[{"Company Name":"Dell Technologies Inc.","Symbol":"DELL","Current Price":"103.32","Latest MA":"110.69","Latest MA 5":110.3180008545,"Latest MA 9":114.4866663954,"Latest MA 20":110.6894992981,"Price Target":142.61609,"Difference from MA":"-6.66%","Difference from Open":"2.34%","Change from Yesterday":"-4.27%","Change from Last Report":"0.30","Latest Volume":"5,562,229","Market Cap":"72,086,880,256","Earning Date":"2025-02-27","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":10.991489,"PB Ratio":-48.943626,"Previous Close":107.83,"ROE":"N\/A","DTE":"N\/A","Industry":"Computer Hardware","Sector":"Technology","Beta":"N\/A","Trailing PEG":0.5635,"Trailing PE":16.194357,"Trailing PS":0.7543072,"Quick Ratio":0.413,"Day High":103.9,"Day Low":99.01,"VS Average Volume":0.6948546768,"Company Summary":"Dell Technologies Inc. designs, develops, manufactures, markets, sells, and supports various comprehensive and integrated solutions, products, and services in the Americas, Europe, the Middle East, Asia, and internationally. The company operates through two segments, Infrastructure Solutions Group (ISG) and Client Solutions Group (CSG). The ISG segment provides modern and traditional storage solutions, including all-flash arrays, scale-out file, object platforms, hyper-converged infrastructure, and software-defined storage; and general-purpose and AI-optimized servers. This segment also offers networking products and services comprising wide area network infrastructure, data center and edge networking switches, and cables and optics that help its business customers to transform and modernize their infrastructure, mobilize and enrich end-user experiences, and accelerate business applications and processes; software and peripherals; and consulting, support, and deployment services. The CSG segment provides desktops, workstations, and notebooks; displays, docking stations, keyboards, mice, webcam, and audio devices; and third-party software and peripherals, as well as configuration, support and deployment, and extended warranty services. It is involved in cybersecurity technology-driven security solutions to prevent security breaches, detect malicious activity, respond rapidly when a security breach occurs, and identify emerging threats; originating, collecting, and servicing customer financing arrangements; and the resale of VMware products and services. The company serves enterprises, public institutions, and small and medium-sized businesses through its direct sales channel, value-added resellers, system integrators, distributors, and retailers. The company was formerly known as Denali Holding Inc. and changed its name to Dell Technologies Inc. in August 2016. Dell Technologies Inc. was founded in 1984 and is headquartered in Round Rock, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"28-02-2025 16:50:59"},{"Company Name":"Warner Bros. Discovery, Inc. - ","Symbol":"WBD","Current Price":"10.99","Latest MA":"10.45","Latest MA 5":10.8549999466,"Latest MA 9":10.8449999619,"Latest MA 20":10.4507499275,"Price Target":13.2632,"Difference from MA":"5.21%","Difference from Open":"0.05%","Change from Yesterday":"-0.05%","Change from Last Report":"0.64","Latest Volume":"5,103,530","Market Cap":"26,990,086,144","Earning Date":"2025-02-27","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":-84.57693,"PB Ratio":0.7927181,"Previous Close":11.0,"ROE":-0.28208,"DTE":114.397,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.497,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.6864038,"Quick Ratio":0.649,"Day High":11.03,"Day Low":10.77,"VS Average Volume":0.1720429999,"Company Summary":"Warner Bros. Discovery, Inc. operates as a media and entertainment company worldwide. It operates through three segments: Studios, Network, and DTC. The Studios segment produces and releases feature films for initial exhibition in theaters; produces and licenses television programs to its networks and third parties and direct-to-consumer services; distributes films and television programs to various third parties and internal television; and offers streaming services and distribution through the home entertainment market, themed experience licensing, and interactive gaming. The Network segment comprises domestic and international television networks. The DTC segment offers premium pay-tv and streaming services. In addition, the company offers portfolio of content, brands, and franchises across television, film, streaming, and gaming under the Warner Bros. Motion Picture Group, Warner Bros. Television Group, DC, HBO, HBO Max, Max, Discovery Channel, discovery+, CNN, HGTV, Food Network, TNT Sports, TBS, TLC, OWN, Warner Bros. Games, Batman, Superman, Wonder Woman, Harry Potter, Looney Tunes, Hanna-Barbera, Game of Thrones, and The Lord of the Rings brands. Further, it provides content through distribution platforms, including linear network, free-to-air, and broadcast television; authenticated GO applications, digital distribution arrangements, content licensing arrangements, and direct-to-consumer subscription products. Warner Bros. Discovery, Inc. was incorporated in 2008 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"28-02-2025 16:50:59"},{"Company Name":"The AES Corporation","Symbol":"AES","Current Price":"11.29","Latest MA":"10.57","Latest MA 5":10.8350000229,"Latest MA 9":10.6805555471,"Latest MA 20":10.5727499447,"Price Target":15.68417,"Difference from MA":"6.83%","Difference from Open":"2.22%","Change from Yesterday":"8.82%","Change from Last Report":"0.49","Latest Volume":"3,495,341","Market Cap":"8,031,050,240","Earning Date":"2025-02-27","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":5.5640397,"PB Ratio":2.4411066,"Previous Close":10.38,"ROE":-0.02549,"DTE":352.879,"Industry":"Utilities - Diversified","Sector":"Utilities","Beta":0.983,"Trailing PEG":1.0921,"Trailing PE":7.8437495,"Trailing PS":0.65378135,"Quick Ratio":0.311,"Day High":11.419,"Day Low":10.75,"VS Average Volume":0.2552298392,"Company Summary":"The AES Corporation, together with its subsidiaries, operates as a diversified power generation and utility company in the United States and internationally. The company owns and\/or operates power plants to generate and sell power to customers, such as utilities, industrial users, and other intermediaries; owns and\/or operates utilities to generate or purchase, distribute, transmit, and sell electricity to end-user customers in the residential, commercial, industrial, and governmental sectors; and generates and sells electricity on the wholesale market. It uses various fuels and technologies to generate electricity, such as coal, gas, hydro, wind, solar, and biomass, as well as renewables comprising energy storage and landfill gas. The company owns and\/or operates a generation portfolio of approximately 34,596 megawatts and distributes power to 2.6 million customers. The company was formerly known as Applied Energy Services, Inc. and changed its name to The AES Corporation in April 2000. The AES Corporation was incorporated in 1981 and is headquartered in Arlington, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"28-02-2025 16:50:59"},{"Company Name":"Mosaic Company (The)","Symbol":"MOS","Current Price":"24.39","Latest MA":"26.50","Latest MA 5":25.1099999695,"Latest MA 9":25.7977778795,"Latest MA 20":26.4969999619,"Price Target":32.45368,"Difference from MA":"-7.95%","Difference from Open":"-0.45%","Change from Yesterday":"-2.79%","Change from Last Report":"-2.79","Latest Volume":"2,151,824","Market Cap":"7,747,361,280","Earning Date":"2025-02-27","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":9.914634,"PB Ratio":0.673199,"Previous Close":25.09,"ROE":0.0168,"DTE":36.374,"Industry":"Agricultural Inputs","Sector":"Basic Materials","Beta":"N\/A","Trailing PEG":1.8994,"Trailing PE":44.34545,"Trailing PS":0.6965298,"Quick Ratio":0.332,"Day High":24.72,"Day Low":23.05,"VS Average Volume":0.4636131909,"Company Summary":"The Mosaic Company, through its subsidiaries, produces and markets concentrated phosphate and potash crop nutrients in North America and internationally. The company operates through three segments: Phosphates, Potash, and Mosaic Fertilizantes. It owns and operates mines, which produce concentrated phosphate crop nutrients, such as diammonium phosphate, monoammonium phosphate, and ammoniated phosphate products; and phosphate-based animal feed ingredients primarily under the Biofos and Nexfos brand names, as well as produces a double sulfate of potash magnesia product under K-Mag brand name. The company also produces and sells potash for use in the manufacturing of mixed crop nutrients and animal feed ingredients, and for industrial use; and for use in the de-icing and as a water softener regenerant. In addition, it provides nitrogen-based crop nutrients, animal feed ingredients, and other ancillary services; and purchases and sells phosphates, potash, and nitrogen products. The company sells its products to wholesale distributors, retail chains, farmers, cooperatives, independent retailers, and national accounts. The company was incorporated in 2004 and is headquartered in Tampa, Florida.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"28-02-2025 16:50:59"},{"Company Name":"NVIDIA Corporation","Symbol":"NVDA","Current Price":"118.76","Latest MA":"129.53","Latest MA 5":125.4191592676,"Latest MA 9":131.1406421387,"Latest MA 20":129.5322892065,"Price Target":174.8093,"Difference from MA":"-8.32%","Difference from Open":"0.61%","Change from Yesterday":"-1.17%","Change from Last Report":"0.21","Latest Volume":"71,277,115","Market Cap":"2,897,499,914,240","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":28.822817,"PB Ratio":36.639927,"Previous Close":120.15,"ROE":1.1917701,"DTE":12.946,"Industry":"Semiconductors","Sector":"Technology","Beta":1.619,"Trailing PEG":0.8611,"Trailing PE":40.391155,"Trailing PS":22.204659,"Quick Ratio":3.672,"Day High":119.59,"Day Low":116.41,"VS Average Volume":0.2940882713,"Company Summary":"NVIDIA Corporation provides graphics and compute and networking solutions in the United States, Taiwan, China, Hong Kong, and internationally. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro\/NVIDIA RTX GPUs for enterprise workstation graphics; virtual GPU or vGPU software for cloud-based visual and virtual computing; automotive platforms for infotainment systems; and Omniverse software for building and operating metaverse and 3D internet applications. The Compute & Networking segment comprises Data Center computing platforms and end-to-end networking platforms, including Quantum for InfiniBand and Spectrum for Ethernet; NVIDIA DRIVE automated-driving platform and automotive development agreements; Jetson robotics and other embedded platforms; NVIDIA AI Enterprise and other software; and DGX Cloud software and services. The company's products are used in gaming, professional visualization, data center, and automotive markets. It sells its products to original equipment manufacturers, original device manufacturers, system integrators and distributors, independent software vendors, cloud service providers, consumer internet companies, add-in board manufacturers, distributors, automotive manufacturers and tier-1 automotive suppliers, and other ecosystem participants. It has a strategic collaboration with IQVIA to help realize the potential of AI in healthcare and life sciences. NVIDIA Corporation was incorporated in 1993 and is headquartered in Santa Clara, California.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"28-02-2025 16:50:59"}]