[{"Company Name":"Intuitive Surgical, Inc.","Symbol":"ISRG","Current Price":"586.87","Latest MA":"497.80","Price Target":623.8661,"Difference from MA":"17.89%","Difference from Open":"1.10%","Change from Yesterday":"-3.75%","Change from Last Report":"-0.51","Latest Volume":"1,161,332","Market Cap":"209,030,774,784","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":62.259113,"PB Ratio":13.414477,"ROE":0.15973,"DTE":"N\/A","Industry":"Medical Instruments & Supplies","Sector":"Healthcare","Beta":1.389,"Trailing PEG":4.4985,"Trailing PE":91.84194,"Trailing PS":26.57092,"Quick Ratio":3.293,"Day High":591.91,"Day Low":575.31,"VS Average Volume":0.8189825517,"Company Summary":"Intuitive Surgical, Inc. develops, manufactures, and markets products that enable physicians and healthcare providers to enhance the quality of and access to minimally invasive care in the United States and internationally. The company offers the da Vinci Surgical System that enables complex surgery using a minimally invasive approach; and Ion endoluminal system, which extends its commercial offerings beyond surgery into diagnostic procedures enabling minimally invasive biopsies in the lung. It also provides a suite of stapling, energy, and core instrumentation for its multi-port da Vinci surgical systems; progressive learning pathways to support the use of its technology; infrastructure of service and support specialists, a complement of services to its customers, including installation, repair, maintenance, 24\/7 technical support, and proactive system health monitoring; and integrated digital capabilities providing connected offerings, streamlining performance for hospitals with program-enhancing insights. The company sells its products through direct sales organizations, such as capital and clinical sales teams. It has a collaboration agreement with FluoGuide A\/S for head & neck cancer. The company was incorporated in 1995 and is headquartered in Sunnyvale, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 17:03:53"},{"Company Name":"American Airlines Group, Inc.","Symbol":"AAL","Current Price":"16.93","Latest MA":"12.95","Price Target":20.24273,"Difference from MA":"30.71%","Difference from Open":"0.47%","Change from Yesterday":"-0.70%","Change from Last Report":"-0.47","Latest Volume":"8,279,590","Market Cap":"11,129,304,064","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":5.415289,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Airlines","Sector":"Industrials","Beta":1.399,"Trailing PEG":0.2073,"Trailing PE":13.649193,"Trailing PS":0.20758593,"Quick Ratio":0.422,"Day High":17.05,"Day Low":16.555,"VS Average Volume":0.304098909,"Company Summary":"American Airlines Group Inc., through its subsidiaries, operates as a network air carrier. The company provides scheduled air transportation services for passengers and cargo through its hubs in Charlotte, Chicago, Dallas\/Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix, and Washington, D.C., as well as through partner gateways in London, Doha, Madrid, Seattle\/Tacoma, Sydney, and Tokyo. It operates a mainline fleet of 965 aircraft. The company was formerly known as AMR Corporation and changed its name to American Airlines Group Inc. in December 2013. American Airlines Group Inc. was founded in 1926 and is headquartered in Fort Worth, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 17:03:53"},{"Company Name":"NextEra Energy, Inc.","Symbol":"NEE","Current Price":"71.26","Latest MA":"76.30","Price Target":85.23636,"Difference from MA":"-6.60%","Difference from Open":"4.64%","Change from Yesterday":"2.66%","Change from Last Report":"0.12","Latest Volume":"4,228,193","Market Cap":"146,539,069,440","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":17.767605,"PB Ratio":2.9278114,"ROE":0.09887999,"DTE":139.015,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.561,"Trailing PEG":2.8193,"Trailing PE":21.145401,"Trailing PS":5.5832915,"Quick Ratio":0.258,"Day High":71.48,"Day Low":68.0,"VS Average Volume":0.3931654633,"Company Summary":"NextEra Energy, Inc., through its subsidiaries, generates, transmits, distributes, and sells electric power to retail and wholesale customers in North America. The company generates electricity through wind, solar, nuclear,natural gas, and other clean energy. It also develops, constructs, and operates long-term contracted assets that consists of clean energy solutions, such as renewable generation facilities, battery storage projects, and electric transmission facilities; sells energy commodities; and owns, develops, constructs, manages and operates electric generation facilities in wholesale energy markets. The company had approximately 33,276 megawatts of net generating capacity; approximately 90,000 circuit miles of transmission and distribution lines; and 883 substations. It serves approximately 12 million people through approximately 5.9 million customer accounts in the east and lower west coasts of Florida. The company was formerly known as FPL Group, Inc. and changed its name to NextEra Energy, Inc. in 2010. NextEra Energy, Inc. was founded in 1925 and is headquartered in Juno Beach, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"24-01-2025 17:03:53"},{"Company Name":"Texas Instruments Incorporated","Symbol":"TXN","Current Price":"188.12","Latest MA":"198.26","Price Target":206.45241,"Difference from MA":"-5.12%","Difference from Open":"-0.99%","Change from Yesterday":"-6.24%","Change from Last Report":"-0.44","Latest Volume":"3,269,900","Market Cap":"171,601,707,008","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":25.618347,"PB Ratio":9.935302,"ROE":0.29293,"DTE":84.399,"Industry":"Semiconductors","Sector":"Technology","Beta":0.98,"Trailing PEG":3.2176,"Trailing PE":34.965614,"Trailing PS":10.922393,"Quick Ratio":3.048,"Day High":191.42,"Day Low":186.74,"VS Average Volume":0.563614746,"Company Summary":"Texas Instruments Incorporated designs, manufactures, and sells semiconductors to electronics designers and manufacturers in the United States and internationally. The company operates through Analog and Embedded Processing segments. The Analog segment offers power products to manage power requirements across various voltage levels, including battery-management solutions, DC\/DC switching regulators, AC\/DC and isolated controllers and converters, power switches, linear regulators, voltage references, and lighting products. This segment provides signal chain products that sense, condition, and measure signals to allow information to be transferred or converted for further processing and control, including amplifiers, data converters, interface products, motor drives, clocks, and logic and sensing products. The Embedded Processing segment offers microcontrollers that are used in electronic equipment; digital signal processors for mathematical computations; and applications processors for specific computing activity. This segment offers products for use in various markets, such as industrial, automotive, personal electronics, communications equipment, enterprise systems, and calculators and other. It provides DLP products primarily for use in project high-definition images; calculators; and application-specific integrated circuits. The company markets and sells its semiconductor products through direct sales and distributors, as well as through its website. Texas Instruments Incorporated was founded in 1930 and is headquartered in Dallas, Texas.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"24-01-2025 17:03:53"},{"Company Name":"Verizon Communications Inc.","Symbol":"VZ","Current Price":"39.50","Latest MA":"40.54","Price Target":47.1625,"Difference from MA":"-2.56%","Difference from Open":"-1.51%","Change from Yesterday":"0.82%","Change from Last Report":"-0.27","Latest Volume":"12,432,717","Market Cap":"166,293,012,480","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.058169,"PB Ratio":1.7263788,"ROE":0.10431,"DTE":182.615,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.418,"Trailing PEG":1.0397,"Trailing PE":17.100866,"Trailing PS":1.2388016,"Quick Ratio":0.51,"Day High":40.68,"Day Low":39.37,"VS Average Volume":0.6492722533,"Company Summary":"Verizon Communications Inc., through its subsidiaries, engages in the provision of communications, technology, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide. It operates in two segments, Verizon Consumer Group (Consumer) and Verizon Business Group (Business). The Consumer segment provides wireless services across the wireless networks in the United States under the Verizon and TracFone brands and through wholesale and other arrangements; and fixed wireless access (FWA) broadband through its wireless networks, as well as related equipment and devices, such as smartphones, tablets, smart watches, and other wireless-enabled connected devices. The segment also offers wireline services in the Mid-Atlantic and Northeastern United States, as well as Washington D.C. through its fiber-optic network, Verizon Fios product portfolio, and a copper-based network. The Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and conferencing, corporate networking, security and managed network, local and long-distance voice, and network access services to deliver various IoT services and products to businesses, government customers, and wireless and wireline carriers in the United States and internationally. The company was formerly known as Bell Atlantic Corporation and changed its name to Verizon Communications Inc. in June 2000. Verizon Communications Inc. was incorporated in 1983 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"24-01-2025 17:03:53"},{"Company Name":"American Express Company","Symbol":"AXP","Current Price":"315.06","Latest MA":"269.42","Price Target":304.3844,"Difference from MA":"16.94%","Difference from Open":"-2.88%","Change from Yesterday":"-3.30%","Change from Last Report":"-0.16","Latest Volume":"1,705,695","Market Cap":"221,942,431,744","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":20.656557,"PB Ratio":7.466408,"ROE":0.3469,"DTE":186.815,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.214,"Trailing PEG":2.0628,"Trailing PE":23.183222,"Trailing PS":3.7465596,"Quick Ratio":1.619,"Day High":324.4,"Day Low":313.74,"VS Average Volume":0.6938172917,"Company Summary":"American Express Company, together with its subsidiaries, operates as integrated payments company in the United States, Europe, the Middle East and Africa, the Asia Pacific, Australia, New Zealand, Latin America, Canada, the Caribbean, and Internationally. It operates through four segments: U.S. Consumer Services, Commercial Services, International Card Services, and Global Merchant and Network Services. The company's products and services include credit card, charge card, banking, and other payment and financing products; network services; expense management products and services; and travel and lifestyle services. It also provides merchant acquisition and processing, servicing and settlement, point-of-sale marketing, and information products and services for merchants; and fraud prevention services, as well as the design and operation of customer loyalty programs. In addition, the company operates lounges at airports under Centurion Lounge brand name. It sells its products and services to consumers, small businesses, mid-sized companies, and large corporations through mobile and online applications, affiliate marketing, customer referral programs, third-party service providers and business partners, direct mail, telephone, in-house sales teams, and direct response advertising. American Express Company was founded in 1850 and is headquartered in New York, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"24-01-2025 17:03:53"},{"Company Name":"TAL Education Group","Symbol":"TAL","Current Price":"11.04","Latest MA":"9.88","Price Target":14.16211,"Difference from MA":"11.74%","Difference from Open":"-0.54%","Change from Yesterday":"0.27%","Change from Last Report":"-0.18","Latest Volume":"1,447,818","Market Cap":"6,671,284,224","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":23.741425,"PB Ratio":1.8214816,"ROE":0.019609999,"DTE":9.291,"Industry":"Education & Training Services","Sector":"Consumer Defensive","Beta":0.033,"Trailing PEG":0.896,"Trailing PE":92.0,"Trailing PS":3.6323764,"Quick Ratio":2.67,"Day High":11.43,"Day Low":11.01,"VS Average Volume":0.2204533322,"Company Summary":"TAL Education Group provides K-12 after-school tutoring services in the People's Republic of China. It provides learning services primarily through small-classes services; personalized premium services; and learning content solutions, such as print books, smart books, mobile apps, and AI-driven learning devices. The company also operates www.xueersi.com, an online education platform; provides investment management and consulting services; develops and sells software and networks, as well as related consulting services; and sells educational materials and products. It offers its services under the Haoweilai and Think Academy brands. TAL Education Group was founded in 2003 and is headquartered in Beijing, the People's Republic of China.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"24-01-2025 17:03:53"},{"Company Name":"SLM Corporation","Symbol":"SLM","Current Price":"30.14","Latest MA":"23.40","Price Target":32.5,"Difference from MA":"28.78%","Difference from Open":"-1.63%","Change from Yesterday":"2.87%","Change from Last Report":"2.87","Latest Volume":"1,175,228","Market Cap":"6,399,626,240","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":8.876402,"PB Ratio":3.3991203,"ROE":0.33828,"DTE":282.907,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.171,"Trailing PEG":null,"Trailing PE":10.393103,"Trailing PS":4.034714,"Quick Ratio":1.258,"Day High":31.38,"Day Low":29.77,"VS Average Volume":0.457884369,"Company Summary":"SLM Corporation, through its subsidiaries, originates and services private education loans to students and their families to finance the cost of their education in the United States. It is also involved in the provision of retail deposit accounts, including certificates of deposit, money market accounts, and high-yield savings accounts; and interest-bearing omnibus accounts. The company was formerly known as New BLC Corporation and changed its name to SLM Corporation in December 2013. SLM Corporation was founded in 1972 and is headquartered in Newark, Delaware.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 17:03:53"},{"Company Name":"Freeport-McMoRan, Inc.","Symbol":"FCX","Current Price":"38.07","Latest MA":"44.28","Price Target":49.18381,"Difference from MA":"-14.02%","Difference from Open":"-1.70%","Change from Yesterday":"-1.09%","Change from Last Report":"0.00","Latest Volume":"3,023,048","Market Cap":"54,703,927,296","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.693562,"PB Ratio":3.1174254,"ROE":0.16870001,"DTE":33.531,"Industry":"Copper","Sector":"Basic Materials","Beta":1.91,"Trailing PEG":10.0701,"Trailing PE":29.284616,"Trailing PS":2.1335385,"Quick Ratio":1.048,"Day High":38.88,"Day Low":37.99,"VS Average Volume":0.2572800678,"Company Summary":"Freeport-McMoRan Inc. engages in the mining of mineral properties in North America, South America, and Indonesia. It primarily explores for copper, gold, molybdenum, silver, and other metals. The company's assets include the Grasberg minerals district in Indonesia; Morenci, Bagdad, Safford, Sierrita, and Miami in Arizona; Chino and Tyrone in New Mexico; and Henderson and Climax in Colorado, North America, as well as Cerro Verde in Peru and El Abra in Chile. The company was formerly known as Freeport-McMoRan Copper & Gold Inc. and changed its name to Freeport-McMoRan Inc. in July 2014. Freeport-McMoRan Inc. was incorporated in 1987 and is headquartered in Phoenix, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"24-01-2025 17:03:53"},{"Company Name":"CSX Corporation","Symbol":"CSX","Current Price":"32.70","Latest MA":"33.79","Price Target":37.15846,"Difference from MA":"-3.20%","Difference from Open":"1.93%","Change from Yesterday":"-2.91%","Change from Last Report":"0.26","Latest Volume":"5,518,148","Market Cap":"63,068,979,200","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":15.313984,"PB Ratio":4.8777037,"ROE":0.29458,"DTE":147.913,"Industry":"Railroads","Sector":"Industrials","Beta":1.191,"Trailing PEG":2.1553,"Trailing PE":18.27095,"Trailing PS":4.2959595,"Quick Ratio":1.195,"Day High":32.55,"Day Low":32.0,"VS Average Volume":0.4495430393,"Company Summary":"CSX Corporation, together with its subsidiaries, provides rail-based freight transportation services. The company offers rail services; and transportation of intermodal containers and trailers, as well as other transportation services, such as rail-to-truck transfers and bulk commodity operations. It also transports chemicals, agricultural and food products, minerals, automotive, forest products, fertilizers, and metals and equipment; and coal, coke, and iron ore to electricity-generating power plants, steel manufacturers, and industrial plants, as well as exports coal to deep-water port facilities. In addition, the company provides intermodal services through a network of approximately 30 terminals transporting manufactured consumer goods in containers; and drayage services, including the pickup and delivery of intermodal shipments. It serves the automotive industry with distribution centers and storage locations, as well as connects non-rail served customers through transferring products, such as plastics and ethanol from rail to trucks. The company operates approximately 20,000 route mile rail network, which serves various population centers in 26 states east of the Mississippi River, the District of Columbia, and the Canadian provinces of Ontario and Quebec, as well as owns and leases approximately 3,500 locomotives. It serves production and distribution facilities through track connections. CSX Corporation was incorporated in 1978 and is headquartered in Jacksonville, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"24-01-2025 17:03:53"},{"Company Name":"Abbott Laboratories","Symbol":"ABT","Current Price":"124.20","Latest MA":"111.63","Price Target":132.28792,"Difference from MA":"11.26%","Difference from Open":"1.31%","Change from Yesterday":"0.83%","Change from Last Report":"0.05","Latest Volume":"1,284,846","Market Cap":"215,419,928,576","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":21.922354,"PB Ratio":5.41318,"ROE":0.14840001,"DTE":37.589,"Industry":"Medical Devices","Sector":"Healthcare","Beta":0.722,"Trailing PEG":2.388,"Trailing PE":16.256544,"Trailing PS":5.2264824,"Quick Ratio":0.996,"Day High":124.31,"Day Low":122.18,"VS Average Volume":0.2397914516,"Company Summary":"Abbott Laboratories, together with its subsidiaries, discovers, develops, manufactures, and sells health care products worldwide. It operates in four segments: Established Pharmaceutical Products, Diagnostic Products, Nutritional Products, and Medical Devices. The company provides generic pharmaceuticals for the treatment of pancreatic exocrine insufficiency, irritable bowel syndrome or biliary spasm, intrahepatic cholestasis or depressive symptoms, gynecological disorder, hormone replacement therapy, dyslipidemia, hypertension, hypothyroidism, Ménière's disease and vestibular vertigo, pain, fever, inflammation, and migraine, as well as provides anti-infective clarithromycin, influenza vaccine, and products to regulate physiological rhythm of the colon. It also offers laboratory and transfusion medicine systems in the areas of immunoassay, clinical chemistry, hematology, and transfusion; molecular diagnostics polymerase chain reaction instrument systems that automate the extraction, purification, and preparation of DNA and RNA from patient samples, and detect and measure infectious agents; point of care systems; cartridges for testing blood gas, chemistry, electrolytes, coagulation, and immunoassay; rapid diagnostics lateral flow testing products; molecular point-of-care testing for HIV, SARS-CoV-2, influenza A and B, RSV, and strep A; cardiometabolic test systems; drug and alcohol test, and remote patient monitoring and consumer self-test systems; and informatics and automation solutions for laboratories. In addition, the company provides pediatric and adult nutritional products; rhythm management, electrophysiology, heart failure, vascular, and structural heart devices for the treatment of cardiovascular diseases; diabetes care products, such as glucose and blood glucose monitoring systems; and neuromodulation devices for the management of chronic pain and movement disorders. Abbott Laboratories was founded in 1888 and is based in North Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 17:03:53"},{"Company Name":"Halliburton Company","Symbol":"HAL","Current Price":"27.88","Latest MA":"30.13","Price Target":34.69259,"Difference from MA":"-7.50%","Difference from Open":"-1.15%","Change from Yesterday":"-0.27%","Change from Last Report":"-0.23","Latest Volume":"1,768,140","Market Cap":"24,488,243,200","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.915379,"PB Ratio":2.3769932,"ROE":0.26293,"DTE":83.993,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.905,"Trailing PEG":2.2169,"Trailing PE":9.849824,"Trailing PS":1.0613377,"Quick Ratio":1.377,"Day High":28.38,"Day Low":27.87,"VS Average Volume":0.1798670086,"Company Summary":"Halliburton Company provides products and services to the energy industry worldwide. It operates through two segments, Completion and Production, and Drilling and Evaluation. The Completion and Production segment offers production enhancement services that include stimulation and sand control services; cementing services, such as well bonding and casing, and casing equipment; and completion tools that offer downhole solutions and services, including well completion products and services, intelligent well completions, and service tools, as well as liner hanger, sand control, and multilateral systems. This segment also provides electrical submersible pumps, as well as artificial lift services; production solutions comprising coiled tubing, hydraulic workover units, downhole tools, and pumping and nitrogen services; pipeline and process services, such as pre-commissioning, commissioning, maintenance, and decommissioning; and specialty chemicals and services. The Drilling and Evaluation segment offers drilling fluid systems, performance additives, completion fluids, solids control, specialized testing equipment, and waste management services; drilling systems and services; wireline and perforating services consists of open-hole logging, and cased-hole and slickline; and drill bits and services comprising roller cone rock bits, fixed cutter bits, hole enlargement, and related downhole tools and services, as well as coring equipment and services. This segment also provides cloud based digital services and artificial intelligence solutions on an open architecture for subsurface insights, integrated well construction, and reservoir and production management; testing and subsea services, such as acquisition and analysis of reservoir information and optimization solutions; and project management and integrated asset management services. Halliburton Company was founded in 1919 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"24-01-2025 17:03:53"},{"Company Name":"Kinder Morgan, Inc.","Symbol":"KMI","Current Price":"30.47","Latest MA":"23.76","Price Target":29.19611,"Difference from MA":"28.25%","Difference from Open":"-0.03%","Change from Yesterday":"-0.05%","Change from Last Report":"0.15","Latest Volume":"1,287,480","Market Cap":"67,693,367,296","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":22.511007,"PB Ratio":2.2263627,"ROE":0.083500005,"DTE":101.433,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.907,"Trailing PEG":2.2318,"Trailing PE":26.042736,"Trailing PS":4.467914,"Quick Ratio":0.291,"Day High":30.555,"Day Low":30.35,"VS Average Volume":0.0942643688,"Company Summary":"Kinder Morgan, Inc. operates as an energy infrastructure company primarily in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas gasification, liquefaction, and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and\/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, renewable fuel and feedstocks, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; owns interests in\/or operates oil fields and gasoline processing plants; and operates a crude oil pipeline system in West Texas, as well as owns and operates RNG and LNG facilities. It owns and operates approximately 82,000 miles of pipelines and 139 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1997 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 17:03:53"},{"Company Name":"United Airlines Holdings, Inc.","Symbol":"UAL","Current Price":"105.58","Latest MA":"68.49","Price Target":127.2913,"Difference from MA":"54.16%","Difference from Open":"2.69%","Change from Yesterday":"2.24%","Change from Last Report":"-0.02","Latest Volume":"1,923,556","Market Cap":"34,722,729,984","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.1532474,"PB Ratio":3.0357401,"ROE":0.27245,"DTE":291.676,"Industry":"Airlines","Sector":"Industrials","Beta":1.393,"Trailing PEG":0.8181,"Trailing PE":11.172487,"Trailing PS":0.6201152,"Quick Ratio":0.694,"Day High":106.45,"Day Low":102.27,"VS Average Volume":0.3255104239,"Company Summary":"United Airlines Holdings, Inc., through its subsidiaries, provides air transportation services in North America, Asia, Europe, Africa, the Pacific, the Middle East, and Latin America. The company transports people and cargo through its mainline and regional fleets. It also offers catering, ground handling, flight academy, and maintenance services for third parties. The company was formerly known as United Continental Holdings, Inc. and changed its name to United Airlines Holdings, Inc. in June 2019. United Airlines Holdings, Inc. was incorporated in 1968 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"24-01-2025 17:03:53"},{"Company Name":"GE Aerospace","Symbol":"GE","Current Price":"196.04","Latest MA":"173.53","Price Target":218.47765,"Difference from MA":"12.97%","Difference from Open":"-3.19%","Change from Yesterday":"-2.47%","Change from Last Report":"-0.14","Latest Volume":"1,337,495","Market Cap":"210,486,181,888","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":30.768215,"PB Ratio":11.24147,"ROE":0.22552,"DTE":110.224,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.188,"Trailing PEG":null,"Trailing PE":32.24342,"Trailing PS":3.0089655,"Quick Ratio":0.804,"Day High":202.99,"Day Low":195.52,"VS Average Volume":0.2594017736,"Company Summary":"General Electric Company, doing business as GE Aerospace, designs and produces commercial and defense aircraft engines, integrated engine components, electric power, and mechanical aircraft systems. It also offers aftermarket services to support its products. The company operates in the United States, Europe, China, Asia, the Americas, the Middle East, and Africa. General Electric Company was incorporated in 1892 and is based in Evendale, Ohio.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"24-01-2025 17:03:53"},{"Company Name":"Schlumberger N.V.","Symbol":"SLB","Current Price":"41.93","Latest MA":"42.81","Price Target":53.44613,"Difference from MA":"-2.06%","Difference from Open":"-0.64%","Change from Yesterday":"-0.29%","Change from Last Report":"0.09","Latest Volume":"2,458,142","Market Cap":"58,737,643,520","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":11.031656,"PB Ratio":2.7525766,"ROE":0.21722999,"DTE":57.141,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.532,"Trailing PEG":1.9574,"Trailing PE":13.482316,"Trailing PS":1.6318278,"Quick Ratio":1.003,"Day High":42.42,"Day Low":41.87,"VS Average Volume":0.1924804624,"Company Summary":"Schlumberger Limited engages in the provision of technology for the energy industry worldwide. The company operates through four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company provides field development and hydrocarbon production, carbon management, and integration of adjacent energy systems; reservoir interpretation and data processing services for exploration data; and well construction and production improvement services and products. It also offers subsurface geology and fluids evaluation information; open and cased hole services; exploration and production pressure, and flow-rate measurement services; and pressure pumping, well stimulation, and coiled tubing equipment solutions. In addition, the company offers mud logging, directional drilling, measurement-while-drilling, and logging-while-drilling services, as well as engineering support services; supplies drilling fluid systems; designs, manufactures, and markets roller cone and fixed cutter drill bits; bottom-hole-assembly and borehole enlargement technologies; well cementing products and services; well planning, well drilling, engineering, supervision, logistics, procurement, and contracting of third parties, as well as drilling rig management solutions; and drilling equipment and services, as well as land drilling rigs and related services. Further, it provides artificial lift production equipment and optimization services; supplies packers, safety valves, sand control technology, and various intelligent well completions technology and equipment; designs and manufactures valves, chokes, actuators, and surface trees; and OneSubsea, an integrated solutions, products, systems, and services, including wellheads, subsea trees, manifolds and flowline connectors, control systems, connectors, and services. The company was formerly known as Socie´te´ de Prospection E´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"24-01-2025 17:03:53"},{"Company Name":"Huntington Bancshares Incorpora","Symbol":"HBAN","Current Price":"17.07","Latest MA":"15.16","Price Target":18.69526,"Difference from MA":"12.60%","Difference from Open":"1.20%","Change from Yesterday":"1.12%","Change from Last Report":"1.02","Latest Volume":"1,088,418","Market Cap":"24,816,541,696","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":10.982875,"PB Ratio":1.3618379,"ROE":0.08545,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.057,"Trailing PEG":2.8573,"Trailing PE":13.993443,"Trailing PS":3.7094982,"Quick Ratio":"N\/A","Day High":17.08,"Day Low":16.84,"VS Average Volume":0.0719204131,"Company Summary":"Huntington Bancshares Incorporated operates as the bank holding company for The Huntington National Bank that provides commercial, consumer, and mortgage banking services in the United States. The company offers financial products and services to consumer and business customers, including deposits, lending, payments, mortgage banking, dealer financing, investment management, trust, brokerage, insurance, and other financial products and services. It also provides 24-hour grace, asterisk-free checking, money scout, $50 safety zone, standby cash, early pay, instant access, savings goal getter, and Huntington heads up; digitally powered consumer and business financial solutions to consumer lending, regional banking, branch banking, and wealth management customers; direct and indirect consumer loans, as well as dealer finance loans and deposits; and private banking, wealth management and legacy planning through investment and portfolio management, fiduciary administration and trust, institutional custody, and full-service retail brokerage investment services. The company offers equipment financing, asset-based lending, distribution finance, structured lending, and municipal financing solutions, as well as Huntington ChoicePay. In addition, it offers lending, liquidity, treasury management and other payment services, and capital markets; government and non-profits, healthcare, technology and telecommunications, franchises, financial sponsors, and global services; and corporate risk management, institutional sales and trading, debt and equity issuance, and additional advisory services. The company offers its products through a network of channels, including branches and ATMs, online and mobile banking, and through customer call centers to customers in middle market banking, corporate, specialty, and government banking, asset finance, commercial real estate banking, and capital markets. The company was founded in 1866 and is headquartered in Columbus, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 17:03:53"},{"Company Name":"Bank of America Corporation","Symbol":"BAC","Current Price":"46.49","Latest MA":"42.03","Price Target":51.92857,"Difference from MA":"10.62%","Difference from Open":"0.57%","Change from Yesterday":"0.32%","Change from Last Report":"0.02","Latest Volume":"2,917,252","Market Cap":"353,866,940,416","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.734578,"PB Ratio":1.314495,"ROE":0.08092,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.325,"Trailing PEG":2.0554,"Trailing PE":14.484424,"Trailing PS":3.7396376,"Quick Ratio":"N\/A","Day High":46.58,"Day Low":46.165,"VS Average Volume":0.0822870611,"Company Summary":"Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. It operates in four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, non-interest and interest-bearing checking accounts, and investment accounts and products; credit and debit cards; residential mortgages, and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research, and certain market-based services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 17:03:53"},{"Company Name":"Citigroup, Inc.","Symbol":"C","Current Price":"81.72","Latest MA":"65.15","Price Target":88.8355,"Difference from MA":"25.44%","Difference from Open":"0.29%","Change from Yesterday":"-0.23%","Change from Last Report":"-0.04","Latest Volume":"3,071,494","Market Cap":"153,405,440,000","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.836613,"PB Ratio":0.8019538,"ROE":0.03874,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.426,"Trailing PEG":0.8887,"Trailing PE":13.735245,"Trailing PS":2.2133873,"Quick Ratio":"N\/A","Day High":82.12,"Day Low":81.36,"VS Average Volume":0.2095003317,"Company Summary":"Citigroup Inc., a diversified financial service holding company, provides various financial product and services to consumers, corporations, governments, and institutions worldwide. It operates through five segments: Services, Markets, Banking, U.S. Personal Banking, and Wealth. The Services segment includes Treasury and Trade Solutions, which provides cash management, trade, and working capital solutions to multinational corporations, financial institutions, and public sector organizations; and Securities Services, such as cross-border support for clients, local market expertise, post-trade technologies, data solutions, and various securities services solutions. The Markets segment offers sales and trading services for equities, foreign exchange, rates, spread products, and commodities to corporate, institutional, and public sector clients; and market-making services, including asset classes, risk management solutions, financing, prime brokerage, research, securities clearing, and settlement. The banking segment includes investment banking; advisory services related to mergers and acquisitions, divestitures, restructurings, and corporate defense activities; and corporate lending, which includes corporate and commercial banking. The U.S. Personal Banking segment provides co-branded cards and retail banking services. The Wealth segment provides financial services to high-net-worth clients through banking, lending, mortgages, investment, custody, and trust product offerings; and to professional industries, including law firms, consulting groups, accounting, and asset management. The company was founded in 1812 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 17:03:53"},{"Company Name":"Wells Fargo & Company","Symbol":"WFC","Current Price":"77.27","Latest MA":"63.03","Price Target":82.52381,"Difference from MA":"22.58%","Difference from Open":"0.34%","Change from Yesterday":"-0.21%","Change from Last Report":"-0.07","Latest Volume":"1,076,772","Market Cap":"254,119,952,384","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":11.29597,"PB Ratio":1.5698525,"ROE":0.099139996,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.136,"Trailing PEG":3.4954,"Trailing PE":14.388268,"Trailing PS":3.2631774,"Quick Ratio":"N\/A","Day High":77.595,"Day Low":77.0,"VS Average Volume":0.063852051,"Company Summary":"Wells Fargo & Company, a financial services company, provides diversified banking, investment, mortgage, and consumer and commercial finance products and services in the United States and internationally. The company operates through four segments: Consumer Banking and Lending; Commercial Banking; Corporate and Investment Banking; and Wealth and Investment Management. The Consumer Banking and Lending segment offers diversified financial products and services for consumers and small businesses. Its financial products and services include checking and savings accounts, and credit and debit cards, as well as home, auto, personal, and small business lending services. The Commercial Banking segment provides financial solutions to private, family owned, and certain public companies. Its products and services include banking and credit products across various industry sectors and municipalities, secured lending and lease products, and treasury management services. The Corporate and Investment Banking segment offers a suite of capital markets, banking, and financial products and services, such as corporate banking, investment banking, treasury management, commercial real estate lending and servicing, equity, and fixed income solutions, as well as sales, trading, and research capabilities services to corporate, commercial real estate, government, and institutional clients. The Wealth and Investment Management segment provides personalized wealth management, brokerage, financial planning, lending, private banking, and trust and fiduciary products and services to affluent, high-net worth, and ultra-high-net worth clients. It also operates through financial advisors in brokerage and wealth offices, consumer bank branches, independent offices, and digitally through WellsTrade and Intuitive Investor. The company was founded in 1852 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 17:03:53"},{"Company Name":"Walgreens Boots Alliance, Inc.","Symbol":"WBA","Current Price":"11.56","Latest MA":"9.87","Price Target":12.414,"Difference from MA":"17.16%","Difference from Open":"-0.77%","Change from Yesterday":"-1.36%","Change from Last Report":"-0.26","Latest Volume":"1,336,830","Market Cap":"9,989,695,488","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":7.209157,"PB Ratio":0.9562495,"ROE":-0.75969005,"DTE":277.898,"Industry":"Pharmaceutical Retailers","Sector":"Healthcare","Beta":0.669,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.06765428,"Quick Ratio":0.332,"Day High":11.82,"Day Low":11.555,"VS Average Volume":0.0556437746,"Company Summary":"Walgreens Boots Alliance, Inc. operates as a healthcare, pharmacy, and retail company in the United States, Germany, the United Kingdom, and internationally. It operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The U.S. Retail Pharmacy segment engages in operation of the retail drugstores, health and wellness services, specialty, and home delivery pharmacy services, which offers health and wellness, beauty, personal care and consumables, and general merchandise. The International segment offers sale of prescription drugs and health and wellness, beauty, personal care, and other consumer products outside the United States; and operates pharmacy-led health and beauty retail businesses under the Boots brand stores in the United Kingdom, the Republic of Ireland, and Thailand, as well as the Benavides brand in Mexico and the Ahumada brand in Chile. The U.S. Healthcare segment provides VillageMD, a national provider of value-based care with primary, multi-specialty, and urgent care providers serving patients in traditional clinic settings, in patients' homes and online appointments; Shields, a specialty pharmacy integrator and accelerator for hospitals; and CareCentrix, a participant in the post-acute and home care management sectors. Walgreens Boots Alliance, Inc. was founded in 1909 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"24-01-2025 17:03:53"},{"Company Name":"Tesla, Inc.","Symbol":"TSLA","Current Price":"415.27","Latest MA":"284.22","Price Target":317.4917,"Difference from MA":"46.11%","Difference from Open":"0.21%","Change from Yesterday":"0.81%","Change from Last Report":"-0.36","Latest Volume":"12,550,743","Market Cap":"1,333,035,794,432","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":127.33444,"PB Ratio":19.043758,"ROE":0.20389,"DTE":18.078,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":2.295,"Trailing PEG":4.9332,"Trailing PE":113.15209,"Trailing PS":13.721418,"Quick Ratio":1.214,"Day High":418.01,"Day Low":411.71,"VS Average Volume":0.135366675,"Company Summary":"Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners; and provision of service and repairs to its energy product customers, including under warranty, as well as various financing options to its solar customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was incorporated in 2003 and is headquartered in Austin, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"24-01-2025 17:03:53"},{"Company Name":"Microsoft Corporation","Symbol":"MSFT","Current Price":"444.02","Latest MA":"427.04","Price Target":508.3098,"Difference from MA":"3.98%","Difference from Open":"-0.26%","Change from Yesterday":"-0.50%","Change from Last Report":"-0.15","Latest Volume":"2,519,176","Market Cap":"3,301,246,763,008","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":29.6084,"PB Ratio":11.475499,"ROE":0.35604,"DTE":33.657,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.904,"Trailing PEG":2.3441,"Trailing PE":36.66569,"Trailing PS":12.98732,"Quick Ratio":1.163,"Day High":445.9356,"Day Low":441.4,"VS Average Volume":0.1170949848,"Company Summary":"Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services. This segment also provides LinkedIn; and dynamics business solutions, including Dynamics 365, a set of intelligent, cloud-based applications across ERP, CRM, power apps, and power automate; and on-premises ERP and CRM applications. The Intelligent Cloud segment offers server products and cloud services, such as azure and other cloud services; SQL and windows server, visual studio, system center, and related client access licenses, as well as nuance and GitHub; and enterprise services including enterprise support services, industry solutions, and nuance professional services. The More Personal Computing segment offers Windows, including windows OEM licensing and other non-volume licensing of the Windows operating system; Windows commercial comprising volume licensing of the Windows operating system, windows cloud services, and other Windows commercial offerings; patent licensing; and windows Internet of Things; and devices, such as surface, HoloLens, and PC accessories. Additionally, this segment provides gaming, which includes Xbox hardware and content, and first- and third-party content; Xbox game pass and other subscriptions, cloud gaming, advertising, third-party disc royalties, and other cloud services; and search and news advertising, which includes Bing, Microsoft News and Edge, and third-party affiliates. The company sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online, and retail stores. The company was founded in 1975 and is headquartered in Redmond, Washington.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"24-01-2025 17:03:53"},{"Company Name":"Alibaba Group Holding Limited","Symbol":"BABA","Current Price":"86.71","Latest MA":"87.06","Price Target":121.04385,"Difference from MA":"-0.40%","Difference from Open":"0.00%","Change from Yesterday":"0.71%","Change from Last Report":"0.21","Latest Volume":"2,432,513","Market Cap":"206,042,890,240","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":1.2232494,"PB Ratio":0.21389914,"ROE":0.05668,"DTE":22.796,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":0.349,"Trailing PEG":0.5725,"Trailing PE":17.915289,"Trailing PS":0.21683064,"Quick Ratio":0.97,"Day High":87.18,"Day Low":86.48,"VS Average Volume":0.1746402215,"Company Summary":"Alibaba Group Holding Limited, through its subsidiaries, provides technology infrastructure and marketing reach to help merchants, brands, retailers, and other businesses to engage with their users and customers in the People's Republic of China and internationally. The company operates through seven segments: China Commerce, International Commerce, Local Consumer Services, Cainiao, Cloud, Digital Media and Entertainment, and Innovation Initiatives and Others. It operates Taobao and Tmall, which are digital retail platforms; Alimama, a proprietary monetization platform; 1688.com and Alibaba.com, which are online wholesale marketplaces; AliExpress, a retail marketplace; Lazada, Trendyol, and Daraz that are e-commerce platforms; Freshippo, a retail platform for groceries and fresh goods; and Tmall Global, an import e-commerce platform. The company also operates Cainiao Network logistic services platform; Ele.me, an on-demand delivery and local services platform; Koubei, a restaurant and local services guide platform; and Fliggy, an online travel platform. In addition, it offers pay-for-performance, in-feed, and display marketing services; and Taobao Ad Network and Exchange, a real-time online bidding marketing exchange. Further, the company provides elastic computing, storage, network, security, database, big data, and IoT services; and hardware, software license, software installation, and application development and maintenance services. Additionally, it operates Youku, an online video platform; Quark, a platform for information search, storage, and consumption; Alibaba Pictures and other content platforms that provide online videos, films, live events, news feeds, literature, music, and others; Amap, a mobile digital map, navigation, and real-time traffic information app; DingTalk, a business efficiency mobile app; and Tmall Genie smart speaker. The company was incorporated in 1999 and is based in Hangzhou, the People's Republic of China.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"24-01-2025 17:03:53"},{"Company Name":"Meta Platforms, Inc.","Symbol":"META","Current Price":"641.14","Latest MA":"554.65","Price Target":668.18353,"Difference from MA":"15.59%","Difference from Open":"0.73%","Change from Yesterday":"0.76%","Change from Last Report":"-0.27","Latest Volume":"5,198,745","Market Cap":"1,618,551,504,896","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":25.199896,"PB Ratio":9.835548,"ROE":0.36134,"DTE":29.811,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.215,"Trailing PEG":1.4153,"Trailing PE":30.256725,"Trailing PS":10.360255,"Quick Ratio":2.568,"Day High":646.9,"Day Low":634.28,"VS Average Volume":0.4053618775,"Company Summary":"Meta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and wearables worldwide. It operates in two segments, Family of Apps and Reality Labs. The Family of Apps segment offers Facebook, which enables people to share, discuss, discover, and connect with interests; Instagram, a community for sharing photos, videos, and private messages, as well as feed, stories, reels, video, live, and shops; Messenger, a messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls; and WhatsApp, a messaging application that is used by people and businesses to communicate and transact privately. The Reality Labs segment provides augmented and virtual reality related products comprising consumer hardware, software, and content that help people feel connected, anytime, and anywhere. The company was formerly known as Facebook, Inc. and changed its name to Meta Platforms, Inc. in October 2021. The company was incorporated in 2004 and is headquartered in Menlo Park, California","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 17:03:53"},{"Company Name":"Boeing Company (The)","Symbol":"BA","Current Price":"179.23","Latest MA":"165.66","Price Target":185.63,"Difference from MA":"8.19%","Difference from Open":"1.84%","Change from Yesterday":"0.28%","Change from Last Report":"-0.23","Latest Volume":"2,763,343","Market Cap":"134,095,585,280","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":256.52658,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.572,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":1.8295826,"Quick Ratio":0.238,"Day High":180.43,"Day Low":174.365,"VS Average Volume":0.2087582834,"Company Summary":"The Boeing Company, together with its subsidiaries, designs, develops, manufactures, sells, services, and supports commercial jetliners, military aircraft, satellites, missile defense, human space flight and launch systems, and services worldwide. The company operates through Commercial Airplanes; Defense, Space & Security; and Global Services segments. The Commercial Airplanes segment develops, produces, and markets commercial jet aircraft for passenger and cargo requirements, as well as provides fleet support services. The Defense, Space & Security segment engages in the research, development, production, and modification of manned and unmanned military aircraft and weapons systems; strategic defense and intelligence systems, which include strategic missile and defense systems, command, control, communications, computers, intelligence, surveillance and reconnaissance, cyber and information solutions, and intelligence systems; and satellite systems, such as government and commercial satellites, and space exploration. The Global Services segment offers products and services, including supply chain and logistics management, engineering, maintenance and modifications, upgrades and conversions, spare parts, pilot and maintenance training systems and services, technical and maintenance documents, and data analytics and digital services to commercial and defense customers. The Boeing Company was incorporated in 1916 and is based in Arlington, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 17:03:53"},{"Company Name":"SoFi Technologies, Inc.","Symbol":"SOFI","Current Price":"18.25","Latest MA":"10.52","Price Target":12.6,"Difference from MA":"73.50%","Difference from Open":"0.52%","Change from Yesterday":"1.14%","Change from Last Report":"0.03","Latest Volume":"10,173,187","Market Cap":"19,809,411,072","Earning Date":"2025-01-27","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":74.5102,"PB Ratio":3.2332623,"ROE":0.037249997,"DTE":54.394,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.613,"Trailing PEG":null,"Trailing PE":152.125,"Trailing PS":7.8633394,"Quick Ratio":0.47,"Day High":18.33,"Day Low":18.01,"VS Average Volume":0.1988215161,"Company Summary":"SoFi Technologies, Inc. provides various financial services in the United States, Latin America, and Canada. It operates through three segments: Lending, Technology Platform, and Financial Services. The company offers lending and financial services and products that allows its members to borrow, save, spend, invest, and protect money. It offers personal loans, student loans, home loans, and related services. The company also operates Galileo, a technology platform that offers services to financial and non-financial institution; and Technisys, a cloud-native digital and core banking platform with financial services customers. In addition, it provides SoFi Money offers checking and savings accounts, debit cards, and cash management products; and SoFi Invest, a mobile-first investment platform that provides access to trading and advisory solutions, such as investing and robo-advisory. Further, the company offers SoFi Credit Card that provides cash backs on every purchase; Sofi Relay, a personal finance management product that allows to track all of their financial accounts comprising credit score and spending behaviors; SoFi Protect, which offers insurance product; SoFi Travel, an application that manages travel search and booking experience; SoFi At Work provides financial benefits to employees, including student loan payments made on their employees' behalf; Lantern Credit, a financial services marketplace platform for seeking alternative products and provide product comparisons; and other lending as a service that offers pre-qualified borrower referrals and sells loans to third-party partner. The company was founded in 2011 and is based in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"24-01-2025 17:03:53"},{"Company Name":"AT&T Inc.","Symbol":"T","Current Price":"22.64","Latest MA":"20.79","Price Target":26.14962,"Difference from MA":"8.94%","Difference from Open":"0.42%","Change from Yesterday":"0.60%","Change from Last Report":"-0.09","Latest Volume":"5,141,332","Market Cap":"162,484,436,992","Earning Date":"2025-01-27","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":10.405896,"PB Ratio":1.5873406,"ROE":0.08759,"DTE":125.151,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.73,"Trailing PEG":1.864,"Trailing PE":18.41057,"Trailing PS":1.331185,"Quick Ratio":0.42,"Day High":22.79,"Day Low":22.54,"VS Average Volume":0.1504072039,"Company Summary":"AT&T Inc. provides telecommunications and technology services worldwide. The company operates through two segments, Communications and Latin America. The Communications segment offers wireless voice and data communications services; and sells handsets, wireless data cards, wireless computing devices, carrying cases\/protective covers, and wireless chargers through its own company-owned stores, agents, and third-party retail stores. It also provides Virtual Private Networks, AT&T Dedicated Internet, Ethernet, data services, cloud solutions, outsourcing, and managed professional services, as well as customer premises equipment for multinational corporations, small and mid-sized businesses, governmental, and wholesale customers. In addition, this segment offers broadband services, including fiber connections, legacy telephony voice communication services, and other VoIP services and equipment to residential customers. This segment markets its communications services and products under the AT&T, AT&T Business, Cricket, AT&T PREPAID, and AT&T Fiber brand names. The Latin America segment provides postpaid and prepaid wireless services in Mexico under the AT&T and Unefon brand names, as well as sells smartphones through its owned stores, agents and third-party retail stores. The company was formerly known as SBC Communications Inc. and changed its name to AT&T Inc. in 2005. AT&T Inc. was incorporated in 1983 and is based in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 17:03:53"}]