[{"Company Name":"Broadcom Inc.","Symbol":"AVGO","Current Price":"255.22","Latest MA":"204.48","Latest MA 5":248.793,"Latest MA 9":252.281665785,"Latest MA 20":242.1097490234,"RSI":66.8992972776,"Price Target":279.93256,"Difference from MA":"24.81%","Difference from Open":"2.02%","Change from Yesterday":"0.92%","Change from Last Report":"0.13","Latest Volume":"11,751,155","Market Cap":"1,200,008,200,192","Earning Date":"05-06-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":41.363857,"PB Ratio":4.3095355,"Previous Close":252.91,"ROE":0.18977,"DTE":166.032,"Industry":"Semiconductors","Sector":"Technology","Beta":1.122,"Trailing PEG":1.4936,"Trailing PE":93.485344,"Trailing PS":93.485344,"Quick Ratio":0.73,"Day High":257.89,"Day Low":249.5,"VS Average Volume":0.4218056994,"Company Summary":"Broadcom Inc. designs, develops, and supplies various semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products worldwide. The company operates in two segments, Semiconductor Solutions and Infrastructure Software. It provides Ethernet switching and routing custom silicon solutions, optical and copper physical layer devices, and fiber optic transmitter and receiver components; set-top box system-on-chips (SoCs), data over cable service interface specifications cable modem and networking infrastructure, DSL access multiplexer\/PON optical line termination products, and Wi-Fi access point SoCs, as well as digital subscriber line (DSL)\/cable, passive optical networking (PON) gateways; and fiber optic components and mobile device connectivity solutions. The company also offers RF front end modules and filters; Wi-Fi, Bluetooth, and global positioning system\/global navigation satellite system SoCs; custom touch controllers; inductive charging application specific integrated circuits; serial attached small computer system interface and redundant array of independent disks controllers and adapters, peripheral component interconnect express switches, fiber channel host bus adapters, read channel based SoCs, custom flash controllers, and preamplifiers; and optocouplers, industrial fiber optics, industrial and medical sensors, motion control encoders and subsystems, light emitting diodes, ethernet PHYs, switch ICs, and camera microcontrollers. Its products are used in various applications in enterprise and data center networking, including artificial intelligence networking and connectivity, home connectivity, set-top boxes, broadband access, telecommunication equipment, smartphones and base stations, data center servers and storage systems, factory automation, power generation and alternative energy systems, and electronic displays. Broadcom Inc. was founded in 1961 and is headquartered in Palo Alto, California.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:47:33"},{"Company Name":"Philip Morris International Inc","Symbol":"PM","Current Price":"182.93","Latest MA":"146.29","Latest MA 5":181.5379989014,"Latest MA 9":181.7144444444,"Latest MA 20":178.3419986572,"RSI":64.7419603727,"Price Target":177.15312,"Difference from MA":"25.04%","Difference from Open":"-0.48%","Change from Yesterday":"-0.24%","Change from Last Report":"0.20","Latest Volume":"2,847,187","Market Cap":"284,734,193,664","Earning Date":"22-07-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":25.406944,"PB Ratio":-26.117931,"Previous Close":183.37,"ROE":null,"DTE":null,"Industry":"Tobacco","Sector":"Consumer Defensive","Beta":0.544,"Trailing PEG":1.347,"Trailing PE":28.85331,"Trailing PS":28.85331,"Quick Ratio":0.364,"Day High":184.06,"Day Low":181.63,"VS Average Volume":0.4656816628,"Company Summary":"Philip Morris International Inc. operates as a tobacco company. The company offers cigarettes and smoke-free products, including heat-not-burn, vapor, and oral nicotine products under the IQOS and ZYN brands; and consumer accessories, such as lighters and matches. It also offers wellness and healthcare products. Philip Morris International Inc. was incorporated in 1987 and is headquartered in Stamford, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:47:33"},{"Company Name":"GE Aerospace","Symbol":"GE","Current Price":"240.85","Latest MA":"196.67","Latest MA 5":247.0820025635,"Latest MA 9":248.2844451904,"Latest MA 20":241.9194996643,"RSI":44.8008658158,"Price Target":241.0061,"Difference from MA":"22.46%","Difference from Open":"0.35%","Change from Yesterday":"-1.90%","Change from Last Report":"0.05","Latest Volume":"5,471,716","Market Cap":"256,840,040,448","Earning Date":"22-07-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":45.963745,"PB Ratio":13.341273,"Previous Close":245.52,"ROE":0.27197,"DTE":106.4,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.389,"Trailing PEG":9.0722,"Trailing PE":38.048973,"Trailing PS":38.048973,"Quick Ratio":0.727,"Day High":243.43,"Day Low":238.6801,"VS Average Volume":0.8733656266,"Company Summary":"General Electric Company, doing business as GE Aerospace, designs and produces commercial and defense aircraft engines, integrated engine components, electric power, and mechanical aircraft systems. The company operates through two reportable segments, Commercial Engines and Services, and Defense and Propulsion Technologies. The Commercial Engines and Services segment designs, develops, manufactures, maintenance, repair, and overhaul (MRO) services of jet engines and sale of spare parts for commercial airframes, business aviation, and aeroderivative applications. The Defense and Propulsion Technologies segment provides designs, develops, manufactures, and MRO services jet engines and avionics and power systems for governments, militaries and commercial airframers, as well as sale of spare parts. Its Defense and Propulsion Technologies segment also offers small turboprop engines, aeroengine mechanical transmissions, turbines, combustors and controls, additive manufacturing, propeller systems, ignition systems, sensors and engine accessories for both fixed wing and rotorcraft applications. The company operates in the United States, Europe, China, rest of Asia, the Americas, the Middle East, and Africa. General Electric Company was incorporated in 1892 and is based in Evendale, Ohio.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:47:33"},{"Company Name":"Abbott Laboratories","Symbol":"ABT","Current Price":"135.92","Latest MA":"124.99","Latest MA 5":134.4619998779,"Latest MA 9":134.0544469537,"Latest MA 20":133.6315026245,"RSI":70.8151628548,"Price Target":140.8096,"Difference from MA":"8.74%","Difference from Open":"0.28%","Change from Yesterday":"0.47%","Change from Last Report":"0.09","Latest Volume":"2,179,461","Market Cap":"236,479,053,824","Earning Date":"16-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":26.341085,"PB Ratio":4.844769,"Previous Close":135.28,"ROE":0.30649,"DTE":27.087,"Industry":"Medical Devices","Sector":"Healthcare","Beta":0.737,"Trailing PEG":null,"Trailing PE":17.651949,"Trailing PS":17.651949,"Quick Ratio":1.09,"Day High":136.89,"Day Low":135.455,"VS Average Volume":0.316149318,"Company Summary":"Abbott Laboratories, together with its subsidiaries, discovers, develops, manufactures, and sells health care products worldwide. It operates in four segments: Established Pharmaceutical Products, Diagnostic Products, Nutritional Products, and Medical Devices. The company provides generic pharmaceuticals for the treatment of pancreatic exocrine insufficiency, irritable bowel syndrome or biliary spasm, intrahepatic cholestasis or depressive symptoms, gynecological disorder, hormone replacement therapy, dyslipidemia, hypertension, hypothyroidism, hypertriglyceridemia, Ménière's disease and vestibular vertigo, pain, fever, inflammation, and migraine, as well as provides anti-infective clarithromycin, influenza vaccine, and products to regulate physiological rhythm of the colon. It also offers laboratory and transfusion medicine systems in the areas of immunoassay, clinical chemistry, hematology, and transfusion serology testing; molecular diagnostics polymerase chain reaction instrument systems that automate the extraction, purification, and preparation of DNA and RNA from patient samples, and detect and measure infectious agents; point of care systems; cartridges for testing blood gas, chemistry, electrolytes, coagulation, and immunoassay; rapid diagnostics lateral flow testing products; molecular point-of-care testing for HIV, SARS-CoV-2, influenza A and B, RSV, and strep A; cardiometabolic test systems; and drug and alcohol test. In addition, the company provides pediatric and adult nutritional products and infant formula; rhythm management, electrophysiology, heart failure, vascular, and structural heart devices for the treatment of cardiovascular diseases; diabetes care products, such as glucose and blood glucose monitoring systems; and neuromodulation devices for the management of chronic pain and movement disorders. Abbott Laboratories was founded in 1888 and is based in North Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:47:33"},{"Company Name":"Intuit Inc.","Symbol":"INTU","Current Price":"769.31","Latest MA":"633.27","Latest MA 5":766.4239995117,"Latest MA 9":766.1355525716,"Latest MA 20":731.6054963379,"RSI":77.0505247164,"Price Target":788.22485,"Difference from MA":"21.48%","Difference from Open":"0.78%","Change from Yesterday":"0.60%","Change from Last Report":"0.06","Latest Volume":"463,637","Market Cap":"214,596,714,496","Earning Date":"22-05-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":34.60684,"PB Ratio":10.6681185,"Previous Close":764.75,"ROE":0.17839001,"DTE":null,"Industry":"Software - Application","Sector":"Technology","Beta":1.283,"Trailing PEG":1.9854,"Trailing PE":62.852123,"Trailing PS":62.852123,"Quick Ratio":0.715,"Day High":770.77,"Day Low":763.35,"VS Average Volume":0.2563061143,"Company Summary":"Intuit Inc. provides financial management, compliance, and marketing products and services in the United States. The company operates in four segments: Small Business & Self-Employed, Consumer, Credit Karma, and ProTax. The Small Business & Self-Employed segment provides QuickBooks services, that includes financial and business management online services, desktop software, payroll solutions, time tracking, merchant payment processing and bill pay solutions, checking accounts, and financing services for small and mid-market businesses; and Mailchimp, a marketing automation and customer relationship management. This segment also offers QuickBooks online services and desktop software solutions comprising QuickBooks Online, QuickBooks Live, QuickBooks Online Advanced, QuickBooks Self-Employed, QuickBooks Solopreneur financial and business management offerings, QuickBooks Online Payroll QuickBooks Checking, QuickBooks Desktop software subscriptions, QuickBooks Basic Payroll, QuickBooks Assisted Payroll, and QuickBooks Enhanced Payroll. The Consumer segment provides do-it-yourself and assisted TurboTax income tax preparation products and services. The Credit Karma segment offers consumers with a personal finance platform that provides personalized recommendations of credit card, home, auto, and personal loan, and insurance product; online savings and checking accounts; and access to its credit scores and reports, credit and identity monitoring, credit report dispute, credit building tools, and tools. The ProTax segment provides Lacerte, ProSeries, and ProFile desktop tax-preparation software products; and ProConnect Tax Online bill pay tax products, electronic tax filing service, and bank products and related services. It sells products and services through direct sales channels, multi-channel shop-and-buy experiences, mobile application stores, and partner and other channels. The company was incorporated in 1984 and is headquartered in Mountain View, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:47:33"},{"Company Name":"Verizon Communications Inc.","Symbol":"VZ","Current Price":"43.10","Latest MA":"41.60","Latest MA 5":43.6850007019,"Latest MA 9":43.6550005256,"Latest MA 20":43.6507505646,"RSI":40.5927230066,"Price Target":48.06739,"Difference from MA":"3.62%","Difference from Open":"-1.77%","Change from Yesterday":"-1.45%","Change from Last Report":"0.07","Latest Volume":"10,728,573","Market Cap":"181,741,453,312","Earning Date":"21-07-2025","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":9.113108,"PB Ratio":1.804387,"Previous Close":43.74,"ROE":0.18416001,"DTE":169.089,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.38,"Trailing PEG":2.1689,"Trailing PE":10.263096,"Trailing PS":10.263096,"Quick Ratio":0.471,"Day High":43.8899,"Day Low":42.912,"VS Average Volume":0.5212263537,"Company Summary":"Verizon Communications Inc., through its subsidiaries, engages in the provision of communications, technology, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide. It operates in two segments, Verizon Consumer Group (Consumer) and Verizon Business Group (Business). The Consumer segment provides wireless services across the wireless networks in the United States under the Verizon and TracFone brands and through wholesale and other arrangements; and fixed wireless access (FWA) broadband through its wireless networks, as well as related equipment and devices, such as smartphones, tablets, smart watches, and other wireless-enabled connected devices. The segment also offers wireline services in the Mid-Atlantic and Northeastern United States, as well as Washington D.C. through its fiber-optic network, Verizon Fios product portfolio, and a copper-based network. The Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and conferencing, corporate networking, security and managed network, local and long-distance voice, and network access services to deliver various IoT services and products to businesses, government customers, and wireless and wireline carriers in the United States and internationally. The company was formerly known as Bell Atlantic Corporation and changed its name to Verizon Communications Inc. in June 2000. Verizon Communications Inc. was incorporated in 1983 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:47:33"},{"Company Name":"Deere & Company","Symbol":"DE","Current Price":"519.10","Latest MA":"462.10","Latest MA 5":519.485003418,"Latest MA 9":515.2161151801,"Latest MA 20":515.43025354,"RSI":59.5446163799,"Price Target":547.3326,"Difference from MA":"12.33%","Difference from Open":"0.11%","Change from Yesterday":"-0.34%","Change from Last Report":"0.10","Latest Volume":"335,030","Market Cap":"140,584,943,616","Earning Date":"15-05-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":23.414297,"PB Ratio":5.788496,"Previous Close":520.84,"ROE":0.23912,"DTE":275.281,"Industry":"Farm & Heavy Construction Machinery","Sector":"Industrials","Beta":1.102,"Trailing PEG":1.9605,"Trailing PE":25.101303,"Trailing PS":25.101303,"Quick Ratio":1.919,"Day High":520.065,"Day Low":515.0,"VS Average Volume":0.2549080625,"Company Summary":"Deere & Company engages in the manufacture and distribution of various equipment worldwide. The company operates through four segments: Production and Precision Agriculture, Small Agriculture and Turf, Construction and Forestry, and Financial Services. The Production and Precision Agriculture segment provides large and mid-size tractors, combines, cotton pickers and strippers, sugarcane harvesters and loaders, soil preparation, tillage, seeding, and crop care equipment, as well as application equipment, including sprayers and nutrient management, soil preparation machinery for grain growers, and related attachments and service parts. The Small Agriculture and Turf segment offers rotary mowers, hay and forage equipment, forage harvesters, utility tractors, and related loaders and attachments; turf and utility equipment, including riding lawn, commercial mowing, and golf course equipment, and utility vehicles; and other outdoor power products, as well as implements for mowing, tilling, snow and debris handling, aerating, residential, commercial, golf, and sports turf care applications. The Construction and Forestry segment provides backhoe loaders, crawler dozers and loaders, four-wheel-drive loaders, track loaders, excavators, motor graders, articulated dump trucks, landscape and skid-steer loaders, scraper systems, milling machines, recyclers, slipform and asphalt pavers, surface miners, compactors, tandem, static rollers, mobile crushers and screens, mobile and stationary asphalt plants, log skidders and harvesters, log feller bunchers, and log loaders and forwarders; and road building and rehabilitation equipment. The Financial Services segment finances sales and leases agriculture and turf, and construction and forestry equipment. It also offers wholesale financing to dealers of the foregoing equipment; and extended equipment warranties, as well as finances retail revolving charge accounts. The company was founded in 1837 and is headquartered in Moline, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:47:33"},{"Company Name":"Equinix, Inc.","Symbol":"EQIX","Current Price":"899.69","Latest MA":"885.61","Latest MA 5":904.5280024414,"Latest MA 9":903.3233368598,"Latest MA 20":886.5293638916,"RSI":56.2930224751,"Price Target":1010.36,"Difference from MA":"1.59%","Difference from Open":"0.67%","Change from Yesterday":"0.67%","Change from Last Report":"-0.21","Latest Volume":"134,341","Market Cap":"88,006,778,880","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":67.2414,"PB Ratio":6.3364253,"Previous Close":893.7,"ROE":0.07059,"DTE":141.235,"Industry":"REIT - Specialty","Sector":"Real Estate","Beta":0.957,"Trailing PEG":3.6598,"Trailing PE":94.109825,"Trailing PS":94.109825,"Quick Ratio":1.248,"Day High":902.5,"Day Low":893.7,"VS Average Volume":0.2173971441,"Company Summary":"Equinix (Nasdaq: EQIX) is the world's digital infrastructure company. Digital leaders harness Equinix's trusted platform to bring together and interconnect foundational infrastructure at software speed. Equinix enables organizations to access all the right places, partners and possibilities to scale with agility, speed the launch of digital services, deliver world-class experiences and multiply their value, while supporting their sustainability goals.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:47:33"},{"Company Name":"Monster Beverage Corporation","Symbol":"MNST","Current Price":"63.23","Latest MA":"55.41","Latest MA 5":63.0530001831,"Latest MA 9":63.2494449192,"Latest MA 20":63.2627503204,"RSI":53.3236670953,"Price Target":62.10042,"Difference from MA":"14.11%","Difference from Open":"0.51%","Change from Yesterday":"1.01%","Change from Last Report":"0.09","Latest Volume":"2,677,585","Market Cap":"61,659,926,528","Earning Date":"08-05-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":33.810158,"PB Ratio":9.4563265,"Previous Close":62.59,"ROE":0.20004,"DTE":3.998,"Industry":"Beverages - Non-Alcoholic","Sector":"Consumer Defensive","Beta":0.605,"Trailing PEG":2.0596,"Trailing PE":41.595394,"Trailing PS":41.595394,"Quick Ratio":2.657,"Day High":63.64,"Day Low":62.815,"VS Average Volume":0.4744712449,"Company Summary":"Monster Beverage Corporation, through its subsidiaries, engages in development, marketing, sale, and distribution of energy drink beverages and concentrates in the United States and internationally. The company operates through four segments: Monster Energy Drinks, Strategic Brands, Alcohol Brands, and Other. It offers carbonated non-carbonated energy drinks, ready-to-drink iced teas, lemonades, juice cocktails, single-serve juices and fruit beverages, ready-to-drink dairy and coffee drinks, energy drinks, sports drinks and single-serve still waters, and sodas that are considered natural, sparkling juices, and flavored sparkling beverages. In addition, the company provides its products under the Monster Energy, Monster Energy Ultra, Rehab Monster, Monster Energy Nitro, Java Monster, Punch Monster, Juice Monster, Monster Tour Water, Reign Total Body Fuel, Reign Inferno Thermogenic Fuel, Reign Storm, Bang Energy, NOS, Full Throttle, Burn, Mother, Nalu, Ultra Energy, Play and Power Play, Relentless, BPM, BU, Samurai, Live+, Predator, and Fury brands. Further, it offers craft beers, flavored malt beverages,and hard seltzers under the Jai Alai IPA, Florida Man IPA, Dale's Pale Ale, Wild Basin Hard Seltzers, Dallas Blonde, Deep Ellum IPA, Perrin Brewing Company Black Ale, Hop Rising Double IPA, Wasatch Apricot Hefeweizen, The Beast, and Nasty Beast Hard Tea brands. The company engages in the concentrates and\/or beverage bases to authorized bottling, and canning operations. It sells its products to full-service beverage bottlers\/distributors, retail grocery and specialty chains, wholesalers, club stores, mass merchandisers, convenience chains, food service customers, value stores, e-commerce retailers, and the military. The company was formerly known as Hansen Natural Corporation and changed its name to Monster Beverage Corporation in January 2012. Monster Beverage Corporation was founded in 1985 and is headquartered in Corona, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:47:33"},{"Company Name":"Truist Financial Corporation","Symbol":"TFC","Current Price":"39.83","Latest MA":"42.17","Latest MA 5":40.3849996948,"Latest MA 9":39.9905551487,"Latest MA 20":40.0467498398,"RSI":47.0272783941,"Price Target":45.2155,"Difference from MA":"-5.57%","Difference from Open":"-0.44%","Change from Yesterday":"-1.08%","Change from Last Report":"0.00","Latest Volume":"2,946,043","Market Cap":"52,152,430,592","Earning Date":"18-07-2025","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":10.082278,"PB Ratio":0.88803905,"Previous Close":40.26,"ROE":0.0013400001,"DTE":null,"Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.815,"Trailing PEG":null,"Trailing PE":null,"Trailing PS":null,"Quick Ratio":null,"Day High":40.0099,"Day Low":39.495,"VS Average Volume":0.2973126398,"Company Summary":"Truist Financial Corporation, a financial services company, provides banking and trust services in the Southeastern and Mid-Atlantic United States. The company operates through three segments: Consumer Banking and Wealth, Corporate and Commercial Banking, and Insurance Holdings.Its deposit products include noninterest-bearing checking, interest-bearing checking, savings, and money market deposit accounts, as well as certificates of deposit and individual retirement accounts. The company also provides funding; asset management; automobile lending; credit card lending; consumer finance; home equity and mortgage lending; other direct retail lending; insurance; investment brokerage; mobile\/online banking; payment solutions; point-of-sale lending; retail and small business deposit products; small business lending; and wealth management\/private banking services. In addition, it offers asset based lending, investment banking and capital market, institutional trust, insurance premium finance, derivatives, commercial lending, international banking, leasing, merchant, commercial deposit and treasury, floor plan, mortgage warehouse lending, real estate lending, and supply chain financing services. Further, the company provides insurance brokerage, retail and wholesale brokerage, securities underwriting and market making, loan syndication, and investment management and advisory services. The company was formerly known as BB&T Corporation and changed its name to Truist Financial Corporation in December 2019. Truist Financial Corporation was founded in 1872 and is headquartered in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:47:33"},{"Company Name":"Public Storage","Symbol":"PSA","Current Price":"296.88","Latest MA":"302.88","Latest MA 5":301.310996582,"Latest MA 9":302.5983299425,"Latest MA 20":302.9932490234,"RSI":35.3751711488,"Price Target":332.83334,"Difference from MA":"-1.98%","Difference from Open":"-0.38%","Change from Yesterday":"-1.09%","Change from Last Report":"0.30","Latest Volume":"499,737","Market Cap":"52,082,835,456","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":27.928976,"PB Ratio":9.984698,"Previous Close":297.16,"ROE":0.20121,"DTE":97.458,"Industry":"REIT - Industrial","Sector":"Real Estate","Beta":0.879,"Trailing PEG":11.6945,"Trailing PE":29.423687,"Trailing PS":29.423687,"Quick Ratio":0.552,"Day High":299.535,"Day Low":295.32,"VS Average Volume":0.6192627638,"Company Summary":"Public Storage, a member of the S&P 500, is a REIT that primarily acquires, develops, owns, and operates self-storage facilities. At March 31, 2025, we: (i) owned and\/or operated 3,399 self-storage facilities located in 40 states with approximately 247 million net rentable square feet in the United States and (ii) owned a 35% common equity interest in Shurgard Self Storage Limited (Euronext Brussels: SHUR), which owned 318 self-storage facilities located in seven Western European nations with approximately 18 million net rentable square feet operated under the Shurgard brand. Our headquarters are located in Glendale, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:47:33"},{"Company Name":"Simon Property Group, Inc.","Symbol":"SPG","Current Price":"158.80","Latest MA":"166.27","Latest MA 5":159.9620019531,"Latest MA 9":159.8319308811,"Latest MA 20":159.5808790588,"RSI":44.3654671484,"Price Target":182.77779,"Difference from MA":"-4.49%","Difference from Open":"-0.33%","Change from Yesterday":"-0.56%","Change from Last Report":"0.27","Latest Volume":"710,442","Market Cap":"59,889,676,288","Earning Date":"12-05-2025","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":23.42183,"PB Ratio":20.211277,"Previous Close":159.7,"ROE":0.67307,"DTE":773.472,"Industry":"REIT - Retail","Sector":"Real Estate","Beta":1.486,"Trailing PEG":null,"Trailing PE":25.286623,"Trailing PS":25.286623,"Quick Ratio":0.372,"Day High":159.3704,"Day Low":157.95,"VS Average Volume":0.389120177,"Company Summary":"Simon Property Group, Inc. (NYSE:SPG) is a self-administered and self-managed real estate investment trust (\u0093REIT\u0094). Simon Property Group, L.P., or the Operating Partnership, is our majority-owned partnership subsidiary that owns all of our real estate properties and other assets. In this package, the terms Simon, we, our, or the Company refer to Simon Property Group, Inc., the Operating Partnership, and its subsidiaries. We own, develop and manage premier shopping, dining, entertainment and mixed-use destinations, which consist primarily of malls, Premium Outlets, The Mills, and International Properties. At December 31, 2024, we owned or had an interest in 229 properties comprising 183 million square feet in North America, Asia and Europe. We also owned an 88% interest in The Taubman Realty Group, or TRG, which owns 22 regional, super-regional, and outlet malls in the U.S. and Asia. Additionally, at December 31, 2024, we had a 22.4% ownership interest in Klepierre, a publicly traded, Paris-based real estate company, which owns shopping centers in 14 European countries.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:47:33"},{"Company Name":"General Motors Company","Symbol":"GM","Current Price":"49.25","Latest MA":"49.63","Latest MA 5":48.6900001526,"Latest MA 9":48.2790578206,"Latest MA 20":48.8138072968,"RSI":56.819465285,"Price Target":54.15407,"Difference from MA":"-0.76%","Difference from Open":"-0.42%","Change from Yesterday":"-1.24%","Change from Last Report":"0.13","Latest Volume":"3,740,866","Market Cap":"47,350,673,408","Earning Date":"22-07-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":4.6594133,"PB Ratio":0.7390678,"Previous Close":49.87,"ROE":0.08557,"DTE":201.974,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":1.344,"Trailing PEG":1.5547,"Trailing PE":6.878492,"Trailing PS":6.878492,"Quick Ratio":0.958,"Day High":49.54,"Day Low":48.6,"VS Average Volume":0.2792367256,"Company Summary":"General Motors Company designs, builds, and sells trucks, crossovers, cars, and automobile parts worldwide. The company operates through GM North America, GM International, Cruise, and GM Financial segments. It markets its vehicles primarily under the Buick, Cadillac, Chevrolet, GMC, Baojun, and Wuling brand names. In addition, the company sells trucks, crossovers, cars, and automobile parts through retail dealers, distributors and dealers, as well as to fleet customers, including daily rental car companies, commercial fleet customers, leasing companies, and governments. Further, it offers software-enabled services and subscriptions; and various range of after-sale services through dealer network, such as maintenance, light repairs, collision repairs, vehicle accessories, and extended service warranties. Additionally, the company provides automotive financing; and software-enabled services and subscriptions. General Motors Company was founded in 1908 and is headquartered in Detroit, Michigan.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:47:33"},{"Company Name":"Diamondback Energy, Inc.","Symbol":"FANG","Current Price":"148.68","Latest MA":"153.96","Latest MA 5":145.1720015869,"Latest MA 9":142.5033340115,"Latest MA 20":139.895000824,"RSI":72.4164821332,"Price Target":181.84225,"Difference from MA":"-3.43%","Difference from Open":"1.49%","Change from Yesterday":"-0.16%","Change from Last Report":"-0.12","Latest Volume":"790,225","Market Cap":"43,439,534,080","Earning Date":"05-05-2025","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":10.155737,"PB Ratio":1.1102316,"Previous Close":148.92,"ROE":0.14668,"DTE":33.594,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":1.036,"Trailing PEG":null,"Trailing PE":9.246268,"Trailing PS":9.246268,"Quick Ratio":0.717,"Day High":149.04,"Day Low":145.89,"VS Average Volume":0.3090480316,"Company Summary":"Diamondback Energy, Inc., an independent oil and natural gas company, acquires, develops, explores, and exploits unconventional, onshore oil and natural gas reserves in the Permian Basin in West Texas. It focuses on the development of the Spraberry and Wolfcamp formations of the Midland basin; and the Wolfcamp and Bone Spring formations of the Delaware basin, which are part of the Permian Basin in West Texas and New Mexico. Diamondback Energy, Inc. was founded in 2007 and is headquartered in Midland, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:47:33"},{"Company Name":"Otis Worldwide Corporation","Symbol":"OTIS","Current Price":"96.72","Latest MA":"96.98","Latest MA 5":95.7639996948,"Latest MA 9":95.3855547078,"Latest MA 20":96.2949996338,"RSI":61.6073452342,"Price Target":101.85714,"Difference from MA":"-0.27%","Difference from Open":"1.50%","Change from Yesterday":"1.38%","Change from Last Report":"0.06","Latest Volume":"1,104,179","Market Cap":"38,173,159,424","Earning Date":"23-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":23.083532,"PB Ratio":-7.45951,"Previous Close":95.4,"ROE":null,"DTE":null,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":0.974,"Trailing PEG":2.5719,"Trailing PE":25.319372,"Trailing PS":25.319372,"Quick Ratio":0.783,"Day High":96.725,"Day Low":94.9,"VS Average Volume":0.3878442482,"Company Summary":"Otis Worldwide Corporation engages in manufacturing, installation, and servicing of elevators and escalators in the United States, China, and internationally. The company operates through two segments, New Equipment and Service. The New Equipment segment designs, manufactures, sells, and installs a range of passenger and freight elevators, as well as escalators and moving walkways for residential and commercial buildings, and infrastructure projects. This segment serves real-estate and building developers, and general contractors. It sells its products directly to customers, as well as through agents and distributors. The Service segment performs maintenance and repair services, as well as modernization services to upgrade elevators and escalators. Otis Worldwide Corporation was founded in 1853 and is headquartered in Farmington, Connecticut.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"12-06-2025 20:47:33"},{"Company Name":"Electronic Arts Inc.","Symbol":"EA","Current Price":"148.97","Latest MA":"145.00","Latest MA 5":148.0590003662,"Latest MA 9":147.6394470893,"Latest MA 20":147.7575136108,"RSI":57.5074368889,"Price Target":166.7976,"Difference from MA":"2.74%","Difference from Open":"0.90%","Change from Yesterday":"0.87%","Change from Last Report":"0.34","Latest Volume":"702,278","Market Cap":"37,355,356,160","Earning Date":"29-07-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":17.463657,"PB Ratio":5.885618,"Previous Close":147.68,"ROE":0.16131,"DTE":34.732,"Industry":"Electronic Gaming & Multimedia","Sector":"Communication Services","Beta":0.711,"Trailing PEG":1.3779,"Trailing PE":35.050587,"Trailing PS":35.050587,"Quick Ratio":0.846,"Day High":149.02,"Day Low":147.33,"VS Average Volume":0.2118812921,"Company Summary":"Electronic Arts Inc. develops, markets, publishes, and delivers games, content, and services for game consoles, PCs, and mobile phones worldwide. It develops and publishes games and services across various genres, such as sports, racing, first-person shooter, action, role-playing, and simulation; live services offerings, including extra content and subscription offerings through its global football and American football franchises, such as EA SPORTS College Football and EA SPORTS Madden NFL, as well as based on its IP comprising The Sims, Apex Legends, and Battlefield. The company markets and sells its games and services through digital distribution and retail channels; and directly to mass market retailers, specialty stores, and distribution arrangements. Electronic Arts Inc. was incorporated in 1982 and is headquartered in Redwood City, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:47:33"},{"Company Name":"Prudential Financial, Inc.","Symbol":"PRU","Current Price":"104.59","Latest MA":"110.75","Latest MA 5":105.3379996948,"Latest MA 9":104.6911108059,"Latest MA 20":104.403019516,"RSI":50.7353588123,"Price Target":113.28571,"Difference from MA":"-5.56%","Difference from Open":"0.17%","Change from Yesterday":"-0.02%","Change from Last Report":"0.06","Latest Volume":"632,242","Market Cap":"37,025,591,296","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":7.119809,"PB Ratio":1.2390125,"Previous Close":104.61,"ROE":0.07908,"DTE":148.073,"Industry":"Insurance - Life","Sector":"Financial Services","Beta":1.047,"Trailing PEG":0.6882,"Trailing PE":16.496845,"Trailing PS":16.496845,"Quick Ratio":0.881,"Day High":104.59,"Day Low":103.01,"VS Average Volume":0.3365846751,"Company Summary":"Prudential Financial, Inc., together with its subsidiaries, provides insurance, investment management, and other financial products and services in the United States, Japan and internationally. It operates through PGIM, Retirement Strategies, Group Insurance, Individual Life, and International Businesses segments. The PGIM segment offers investment management services and solutions related to public fixed income, public equity, real estate debt and equity, private credit and other alternatives, and multi-asset class strategies to institutional and retail clients, as well as its insurance and retirement businesses. The Retirement Strategies segment provides a range of retirement investment, and income products and services to retirement plan sponsors in the public, private, and not-for-profit sectors; develops and distributes individual variable and fixed annuity products. The Group Insurance segment offers various group life, and long-term and short-term group disability, as well as group corporate-, bank-, and trust-owned life insurance in the United States primarily for institutional clients for use in connection with employee and membership benefits plans; sells accidental death and dismemberment, and other supplemental health solutions; and plan administration services in connection with its insurance coverages. The Individual Life segment develops and distributes variable life, universal life, and term life insurance products. The International Businesses segment develops and distributes life insurance, retirement products, investment products, and certain accident and health products; and advisory and administration services . The company provides its products and services to individual and institutional customers through its proprietary and third-party distribution networks. Prudential Financial, Inc. was founded in 1875 and is headquartered in Newark, New Jersey.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:47:33"},{"Company Name":"Microchip Technology Incorporat","Symbol":"MCHP","Current Price":"68.19","Latest MA":"55.86","Latest MA 5":68.1359995728,"Latest MA 9":65.9511109924,"Latest MA 20":62.0197998734,"RSI":73.464271545,"Price Target":66.13957,"Difference from MA":"22.07%","Difference from Open":"-0.74%","Change from Yesterday":"-2.03%","Change from Last Report":"-0.54","Latest Volume":"3,665,655","Market Cap":"36,781,617,152","Earning Date":"08-05-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":26.226925,"PB Ratio":5.189893,"Previous Close":69.6,"ROE":-0.00007,"DTE":81.675,"Industry":"Semiconductors","Sector":"Technology","Beta":1.463,"Trailing PEG":null,"Trailing PE":null,"Trailing PS":null,"Quick Ratio":1.265,"Day High":69.19,"Day Low":67.8,"VS Average Volume":0.3045523395,"Company Summary":"Microchip Technology Incorporated develops, manufactures, and sells smart, connected, and secure embedded control solutions in the Americas, Europe, and Asia. The company offers general purpose 8-bit, 16-bit, 32-bit, and 64-bit mixed-signal microcontrollers; 32-bit and 64-bit embedded mixed-signal microprocessors; and specialized mixed-signal microcontrollers for automotive, industrial, computing, communications, lighting, power supplies, motor control, human machine interface, security, wired connectivity, and wireless connectivity applications. It also provides analog products, including power management, linear, mixed-signal, high voltage, thermal management, discrete diodes and MOSFETS, radio frequency (RF), drivers, safety, security, timing, USB, ethernet, wireless, and other interface products; field-programmable gate array (FPGA) products; and application development tools that enable system designers to program mixed-signal microcontroller, FPGA, and microprocessor products for specific applications. In addition, the company offers memory products that consist of serial electrically erasable programmable read only memory (EEPROMs), serial flash memories, parallel flash memories, serial static random-access memory (SRAM), and electrically erasable random-access memory (EERAMs) for production of very small footprint devices; and licenses its SuperFlash embedded flash and non-volatile memory technologies to foundries, integrated device manufacturers, and design partners for use in the manufacture of microcontroller products, gate array, RF, analog, and neuromorphic compute products, as well as provides engineering services. Further, it provides wafer foundry and assembly, and test subcontracting manufacturing services; and timing systems, application specific integrated circuits, and products for aerospace applications. It sells its products primarily through a network of direct sales personnel and distributors. Microchip Technology Incorporated was incorporated in 1989 and is headquartered in Chandler, Arizona.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:47:33"},{"Company Name":"Westinghouse Air Brake Technolo","Symbol":"WAB","Current Price":"204.25","Latest MA":"192.33","Latest MA 5":204.891998291,"Latest MA 9":204.208887736,"Latest MA 20":203.3288139343,"RSI":58.0528307854,"Price Target":213.08818,"Difference from MA":"6.20%","Difference from Open":"0.67%","Change from Yesterday":"0.08%","Change from Last Report":"0.12","Latest Volume":"236,378","Market Cap":"34,952,486,912","Earning Date":"23-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":24.057716,"PB Ratio":3.3706844,"Previous Close":204.09,"ROE":0.106800005,"DTE":41.406,"Industry":"Railroads","Sector":"Industrials","Beta":1.128,"Trailing PEG":null,"Trailing PE":31.964006,"Trailing PS":31.964006,"Quick Ratio":0.668,"Day High":204.61,"Day Low":202.67,"VS Average Volume":0.2472459427,"Company Summary":"Westinghouse Air Brake Technologies Corporation provides technology-based locomotives, equipment, systems, and services for the freight rail and passenger transit industries worldwide. It offers diesel-electric and liquid natural gas-powered locomotives; engines, electric motors, and propulsion systems; and marine and mining products. The company also offers positive train control equipment; electronically controlled pneumatic braking products; railway electronics; signal design and engineering services; distributed locomotive power, train cruise controls, and train remote controls; industrial\/mobile Internet of Things hardware and software, edge-to-cloud, on and off-board analytics and rules, and asset performance management solutions; rail and shipper transportation management, and port visibility and optimization solutions; and network optimization solutions. It provides freight car trucks, braking equipment, and related components; air compressors and dryers, as well as heating, ventilation, and air conditioning (HVAC) systems; heat transfer components and systems; custom engineered burners and combustion systems; rail gear, signaling, and switch products; and turbochargers. The company also offers various services, such as freight locomotive overhauls, modernizations, and refurbishment; locomotive and car maintenance; transit locomotive and car overhaul; unit exchange of locomotive components; long term parts arrangements; and maintenance of way equipment and services. It provides railway and freight braking equipment and related components; brake shoes, discs, and pads; HVAC equipment; access and platform screen doors; pantographs; auxiliary power converters and battery chargers; passenger information systems and closed-circuit television; signaling and railway electric relays; and doors, window assemblies, accessibility lifts, ramps, and electric charging solutions for buses. The company was founded in 1869 and is headquartered in Pittsburgh, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:49:52"},{"Company Name":"Agilent Technologies, Inc.","Symbol":"A","Current Price":"119.35","Latest MA":"126.15","Latest MA 5":118.4259997559,"Latest MA 9":116.0911120945,"Latest MA 20":113.6185005951,"RSI":69.5993124925,"Price Target":136.825,"Difference from MA":"-5.39%","Difference from Open":"0.31%","Change from Yesterday":"-0.31%","Change from Last Report":"-0.07","Latest Volume":"606,086","Market Cap":"33,903,157,248","Earning Date":"28-05-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":21.123894,"PB Ratio":5.5226502,"Previous Close":119.72,"ROE":0.18882999,"DTE":60.039,"Industry":"Diagnostics & Research","Sector":"Healthcare","Beta":1.232,"Trailing PEG":1.9435,"Trailing PE":29.396551,"Trailing PS":29.396551,"Quick Ratio":1.417,"Day High":120.04,"Day Low":118.53,"VS Average Volume":0.2626439028,"Company Summary":"Agilent Technologies, Inc. provides application focused solutions to the life sciences, diagnostics, and applied chemical markets worldwide. The company operates in three segments: Life Sciences and Applied Markets, Diagnostics and Genomics, and Agilent CrossLab. The Life Sciences and Applied Markets segment offers liquid chromatography systems and components; liquid chromatography mass spectrometry systems; gas chromatography systems and components; gas chromatography mass spectrometry systems; inductively coupled plasma mass spectrometry instruments; atomic absorption instruments; microwave plasma-atomic emission spectrometry instruments; inductively coupled plasma optical emission spectrometry instruments; raman spectroscopy; laboratory software; information management and analytics; laboratory automation and robotic systems; dissolution testing; and vacuum pumps, and measurement technologies. This segment also offers GC and LC columns, sample preparation products, custom chemistries, and laboratory instrument supplies. The Diagnostics and Genomics segment provides genomics, contract manufacturing and research and development, pathology, companion diagnostics, reagent partnership, and biomolecular analysis businesses; and cell analysis plate based assays, flow cytometers, real-time cell analyzers, cell imaging systems, microplate readers, and related consumables. The Agilent CrossLab segment provides various services, including repairs, parts, maintenance, installations, training, compliance support, software as a service, asset management, and consulting services. The company markets its products through direct sales, distributors, resellers, manufacturer's representatives, and electronic commerce. Agilent Technologies, Inc. was incorporated in 1999 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:49:52"},{"Company Name":"DexCom, Inc.","Symbol":"DXCM","Current Price":"83.25","Latest MA":"78.81","Latest MA 5":84.6819992065,"Latest MA 9":85.2288886176,"Latest MA 20":85.4855003357,"RSI":38.229298714,"Price Target":98.4488,"Difference from MA":"5.63%","Difference from Open":"0.44%","Change from Yesterday":"0.31%","Change from Last Report":"0.49","Latest Volume":"1,158,760","Market Cap":"32,642,908,160","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":41.009853,"PB Ratio":14.400622,"Previous Close":82.99,"ROE":0.23716,"DTE":113.968,"Industry":"Medical Devices","Sector":"Healthcare","Beta":1.461,"Trailing PEG":1.2815,"Trailing PE":62.593983,"Trailing PS":62.593983,"Quick Ratio":1.275,"Day High":83.4,"Day Low":82.0244,"VS Average Volume":0.2872585004,"Company Summary":"DexCom, Inc., a medical device company, focuses on the design, development, and commercialization of continuous glucose monitoring (CGM) systems in the United States and internationally. The company provides its systems for the management of diabetes and metabolic health by patients, caregivers, and clinicians. Its products include Dexcom G6 and Dexcom G7, integrated CGM systems for diabetes management; Dexcom Share, a remote monitoring system; Dexcom Real-Time API, which enables authorized third-party software developers to integrate real-time CGM data into their digital health apps and devices; Dexcom ONE, that is designed to replace finger stick blood glucose testing for diabetes treatment decisions; and Stelo, a new over-the-counter glucose biosensor designed for adults with prediabetes and Type 2 diabetes. The company has a collaboration and license agreement with Verily Life Sciences LLC and Verily Ireland Limited to develop blood-based or interstitial glucose monitoring products. It markets its products directly to endocrinologists, physicians, and diabetes educators. The company was incorporated in 1999 and is headquartered in San Diego, California.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:49:52"},{"Company Name":"Extra Space Storage Inc","Symbol":"EXR","Current Price":"150.61","Latest MA":"150.43","Latest MA 5":150.5540007324,"Latest MA 9":150.5322214084,"Latest MA 20":149.7034988098,"RSI":54.7540176612,"Price Target":162.73685,"Difference from MA":"0.12%","Difference from Open":"0.11%","Change from Yesterday":"0.23%","Change from Last Report":"0.42","Latest Volume":"345,196","Market Cap":"33,369,903,104","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":31.508368,"PB Ratio":2.3017087,"Previous Close":150.27,"ROE":0.063930005,"DTE":89.649,"Industry":"REIT - Industrial","Sector":"Real Estate","Beta":1.131,"Trailing PEG":3.8003,"Trailing PE":35.02558,"Trailing PS":35.02558,"Quick Ratio":0.579,"Day High":151.31,"Day Low":149.64,"VS Average Volume":0.3261704761,"Company Summary":"Extra Space Storage Inc., headquartered in Salt Lake City, Utah, is a self-administered and self-managed REIT and a member of the S&P 500. As of March 31, 2025, the Company owned and\/or operated 4,099 self-storage stores in 43 states and Washington, D.C. The Company's stores comprise approximately 2.8 million units and approximately 315.0 million square feet of rentable space operating under the Extra Space brand. The Company offers customers a wide selection of conveniently located and secure storage units across the country, including boat storage, RV storage and business storage. It is the largest operator of self-storage properties in the United States.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:49:52"},{"Company Name":"Carnival Corporation","Symbol":"CCL","Current Price":"23.54","Latest MA":"23.10","Latest MA 5":24.0810001678,"Latest MA 9":23.9694447157,"Latest MA 20":23.4052500801,"RSI":49.5705498654,"Price Target":28.28522,"Difference from MA":"1.87%","Difference from Open":"-0.19%","Change from Yesterday":"-1.40%","Change from Last Report":"0.00","Latest Volume":"13,782,311","Market Cap":"31,886,630,912","Earning Date":"21-03-2025","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":13.683139,"PB Ratio":3.3602226,"Previous Close":23.87,"ROE":0.2587,"DTE":309.246,"Industry":"Travel Services","Sector":"Consumer Cyclical","Beta":2.583,"Trailing PEG":null,"Trailing PE":15.183871,"Trailing PS":15.183871,"Quick Ratio":0.149,"Day High":23.735,"Day Low":23.24,"VS Average Volume":0.554871539,"Company Summary":"Carnival Corporation & plc, a cruise company, provides leisure travel services in North America, Australia, Europe, and internationally. The company operates through four segments: NAA Cruise Operations, Europe Cruise Operations, Cruise Support, and Tour and Other. It operates port destinations and islands, as well as owns and operates hotels, lodges, glass-domed railcars, and motorcoaches. The company offers its services under the AIDA Cruises, Carnival Cruise Line, Costa Cruises, Cunard, Holland America Line, P&O Cruises (Australia), P&O Cruises (UK), Princess Cruises, and Seabourn brands. It sells its cruises through travel agents, tour operators, vacation planners, websites, and onboard future cruise consultants. Carnival Corporation & plc was founded in 1972 and is headquartered in Miami, Florida.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:49:52"},{"Company Name":"Delta Air Lines, Inc.","Symbol":"DAL","Current Price":"48.83","Latest MA":"55.19","Latest MA 5":50.366,"Latest MA 9":49.664444614,"Latest MA 20":49.446499733,"RSI":44.5039233178,"Price Target":58.46826,"Difference from MA":"-11.53%","Difference from Open":"0.70%","Change from Yesterday":"-0.69%","Change from Last Report":"0.17","Latest Volume":"4,275,220","Market Cap":"31,883,698,176","Earning Date":"09-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":6.9558406,"PB Ratio":2.0503883,"Previous Close":49.17,"ROE":0.27521,"DTE":151.356,"Industry":"Airlines","Sector":"Industrials","Beta":1.508,"Trailing PEG":null,"Trailing PE":8.657802,"Trailing PS":8.657802,"Quick Ratio":0.248,"Day High":48.94,"Day Low":47.88,"VS Average Volume":0.3537279769,"Company Summary":"Delta Air Lines, Inc. provides scheduled air transportation for passengers and cargo in the United States and internationally. The company operates through two segments, Airline and Refinery. Its domestic network centered on core hubs in Atlanta, Detroit, Minneapolis-St. Paul, and Salt Lake City, as well as coastal hub positions in Boston, Los Angeles, New York-LaGuardia, New York-JFK, and Seattle; and international network centered on hubs and market presence in Amsterdam, Bogota, Lima, Mexico City, London-Heathrow, Paris-Charles de Gaulle, Santiago (Chile), Sao Paulo, Seoul-Incheon, and Tokyo. The company sells its tickets through various distribution channels, including delta.com and the Fly Delta app; and acts as a reservations specialists. It also provides aircraft maintenance and engineering support, repair, and overhaul services; and vacation packages to third-party consumers. The company operates through a fleet of approximately 1,292 aircraft. Delta Air Lines, Inc. was founded in 1924 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:49:52"},{"Company Name":"Xylem Inc.","Symbol":"XYL","Current Price":"127.35","Latest MA":"121.69","Latest MA 5":127.433999939,"Latest MA 9":127.045556132,"Latest MA 20":126.4010975647,"RSI":57.9689564281,"Price Target":140.30647,"Difference from MA":"4.65%","Difference from Open":"0.73%","Change from Yesterday":"0.26%","Change from Last Report":"0.07","Latest Volume":"317,925","Market Cap":"30,990,749,696","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":26.810526,"PB Ratio":2.865855,"Previous Close":127.02,"ROE":0.08505,"DTE":19.323,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":1.123,"Trailing PEG":2.4572,"Trailing PE":34.326145,"Trailing PS":34.326145,"Quick Ratio":1.296,"Day High":127.55,"Day Low":126.05,"VS Average Volume":0.1842566013,"Company Summary":"Xylem Inc., together with its subsidiaries, engages in the design, manufacture, and servicing of engineered products and solutions for utility, industrial, and residential and commercial building services settings worldwide. It operates through four segments: Water Infrastructure; Applied Water; Measurement and Control Solutions; and Water Solutions and Services. The company offers water, wastewater and storm water pumps, and controls and systems; filtration, disinfection, and biological treatment equipment under the Flygt, Ionpure, Vortisand, Wallace & Tiernan, and Wedeco brands; and pumps, valves, heat exchangers, controls and dispensing equipment used for water and focuses on the residential, commercial and industrial markets under the Rule, Bell & Gossett, Flojet, Goulds Water Technology, Jabsco, Lowara, and Standard Xchange brands. It also provides smart meters, network communication devices, data analytics, test instruments, controls, sensor devices, software and managed services, and critical infrastructure services; and software and services including cloud-based analytics, and remote monitoring and data management under the Sensus, Smith Blair, WTW, YSI, and Xylem Vue brands. In addition, the company offers preventative maintenance services, rapid response mobile services, digitally enabled\/outsourced solutions, process and wastewater treatment systems, environmental remediation, odor and corrosion control, filtration, reverse osmosis, continuous deionization, and mobile dewatering equipment and rental services; and municipal services comprising odor and corrosion control services, as well as leak detection, condition assessment and asset management and pressure monitoring solutions under the AquaPro, WaterOne, Ion Pure, Flygt, Pure Technologies, and Godwin brands. The company was formerly known as ITT WCO, Inc. and changed its name to Xylem Inc. in May 2011. Xylem Inc. was incorporated in 2011 and is headquartered in Washington, District Of Columbia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:49:52"},{"Company Name":"Raymond James Financial, Inc.","Symbol":"RJF","Current Price":"147.79","Latest MA":"151.55","Latest MA 5":147.2220014648,"Latest MA 9":146.2699999322,"Latest MA 20":147.9460002441,"RSI":56.4430598233,"Price Target":155.08333,"Difference from MA":"-2.48%","Difference from Open":"1.23%","Change from Yesterday":"0.04%","Change from Last Report":"0.06","Latest Volume":"333,952","Market Cap":"29,817,370,624","Earning Date":"23-07-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.266605,"PB Ratio":2.4744666,"Previous Close":147.73,"ROE":0.18866,"DTE":36.485,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.043,"Trailing PEG":1.669,"Trailing PE":14.224253,"Trailing PS":14.224253,"Quick Ratio":6.184,"Day High":147.9,"Day Low":145.43,"VS Average Volume":0.2244859273,"Company Summary":"Raymond James Financial, Inc., a diversified financial services company, provides private client group, capital markets, asset management, banking, and other services to individuals, corporations, and municipalities in the United States, Canada, and Europe. The Private Client Group segment offers investment services, portfolio management services, insurance and annuity products, and mutual funds; support to third-party mutual fund and annuity companies, including sales and marketing support, as well as distribution and accounting, and administrative services; margin loans; securities borrowing and lending services; diversification strategies and alternative investment products; and custodial, trade execution, research, and other support and services. The Capital Markets segment provides investment banking services, such as equity and debt underwriting, and merger and acquisition advisory services; and fixed income and equity brokerage services. This segment also offers institutional sales, securities trading, equity research, and the syndication and management of investments in low-income housing funds and funds of a similar nature. The Asset Management segment provides asset management, portfolio management, and related administrative services to retail and institutional clients; and administrative support services, such as record-keeping. The Bank segment offers various types of loans, including securities-based, commercial and industrial, commercial real estate and construction, real estate investment trust, residential mortgage, and tax-exempt loans; insured deposit accounts; retail and corporate deposit; and liquidity management products and services. The Other segment engages in the private equity investments comprising invests in third-party funds. Raymond James Financial, Inc. was founded in 1962 and is headquartered in Saint Petersburg, Florida.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:49:52"},{"Company Name":"AvalonBay Communities, Inc.","Symbol":"AVB","Current Price":"208.28","Latest MA":"213.81","Latest MA 5":206.5719973145,"Latest MA 9":205.7277765571,"Latest MA 20":204.9150002136,"RSI":61.2437968571,"Price Target":232.4762,"Difference from MA":"-2.59%","Difference from Open":"0.78%","Change from Yesterday":"0.84%","Change from Last Report":"0.24","Latest Volume":"240,636","Market Cap":"29,652,406,272","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":37.59567,"PB Ratio":2.485323,"Previous Close":206.54,"ROE":0.096920006,"DTE":71.138,"Industry":"REIT - Residential","Sector":"Real Estate","Beta":0.872,"Trailing PEG":7.0884,"Trailing PE":25.937735,"Trailing PS":25.937735,"Quick Ratio":0.036,"Day High":209.29,"Day Low":206.6,"VS Average Volume":0.2671213489,"Company Summary":"AvalonBay Communities, Inc., a member of the S&P 500, is an equity REIT that develops, redevelops, acquires and manages apartment communities in leading metropolitan areas in New England, the New York\/New Jersey Metro area, the Mid-Atlantic, the Pacific Northwest, and Northern and Southern California, as well as in the Company's expansion regions of Raleigh-Durham and Charlotte, North Carolina, Southeast Florida, Dallas and Austin, Texas, and Denver, Colorado. As of December 31, 2024, the Company owned or held a direct or indirect ownership interest in 306 apartment communities containing 93,518 apartment homes in 12 states and the District of Columbia, of which 17 communities were under development.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:49:52"},{"Company Name":"Ventas, Inc.","Symbol":"VTR","Current Price":"63.62","Latest MA":"63.60","Latest MA 5":63.3540003052,"Latest MA 9":63.3988886007,"Latest MA 20":64.0379999695,"RSI":47.5082089293,"Price Target":75.94737,"Difference from MA":"0.03%","Difference from Open":"0.06%","Change from Yesterday":"0.33%","Change from Last Report":"0.39","Latest Volume":"749,596","Market Cap":"28,711,577,600","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":397.625,"PB Ratio":2.5013762,"Previous Close":63.41,"ROE":0.01381,"DTE":108.897,"Industry":"REIT - Healthcare Facilities","Sector":"Real Estate","Beta":0.908,"Trailing PEG":1.7311,"Trailing PE":192.78787,"Trailing PS":192.78787,"Quick Ratio":0.412,"Day High":64.16,"Day Low":63.27,"VS Average Volume":0.2255547425,"Company Summary":"Ventas, Inc. (NYSE: VTR) is a leading S&P 500 real estate investment trust enabling exceptional environments that benefit a large and growing aging population. With approximately 1,350 properties in North America and the United Kingdom, Ventas occupies an essential role in the longevity economy. The Company's growth is fueled by its over 800 senior housing communities, which provide valuable services to residents and enable them to thrive in supported environments. The Ventas portfolio also includes outpatient medical buildings, research centers and healthcare facilities. The Company aims to deliver outsized performance by leveraging its unmatched operational expertise, data-driven insights from its Ventas OI platform, extensive relationships and strong financial position. Ventas's seasoned team of talented professionals shares a commitment to excellence, integrity and a common purpose of helping people live longer, healthier, happier lives.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:49:52"},{"Company Name":"Broadridge Financial Solutions,","Symbol":"BR","Current Price":"239.31","Latest MA":"233.72","Latest MA 5":242.512,"Latest MA 9":243.1077764893,"Latest MA 20":241.5929993896,"RSI":35.8359072286,"Price Target":256.27222,"Difference from MA":"2.39%","Difference from Open":"-0.57%","Change from Yesterday":"-0.78%","Change from Last Report":"0.03","Latest Volume":"132,705","Market Cap":"28,110,069,760","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":25.59465,"PB Ratio":11.773011,"Previous Close":240.3,"ROE":0.33918,"DTE":152.819,"Industry":"Information Technology Services","Sector":"Technology","Beta":0.969,"Trailing PEG":1.7178,"Trailing PE":35.932434,"Trailing PS":35.932434,"Quick Ratio":1.188,"Day High":240.54,"Day Low":238.905,"VS Average Volume":0.2379859294,"Company Summary":"Broadridge Financial Solutions, Inc. provides investor communications and technology-driven solutions for the financial services industry. The company's Investor Communication Solutions segment handles the proxy materials distribution and voting processes for bank, broker-dealer, corporate issuer, and fund clients, as well as distributes regulatory reports, prospectuses, class action, and corporate action\/reorganization event information, as well as tax reporting solutions. The segment also offers ProxyEdge, an electronic proxy delivery and voting solution; data-driven solutions and an end-to-end platform for content management, composition, and omni-channel distribution of regulatory, marketing, and transactional information, as well as mutual fund trade processing services; solutions for public corporations and mutual funds; data and analytics solutions; SEC filing and capital markets transaction services; registrar, stock transfer, and record-keeping services; and omni-channel customer communications solutions, as well as operates Broadridge Communications Cloud platform that creates, delivers, and manages communications and customer engagement activities. Its Global Technology and Operations segment provides solutions that automate the front-to-back transaction lifecycle of equity, mutual fund, fixed income, foreign exchange and exchange-traded derivatives, order capture and execution, trade confirmation, margin, cash management, clearing and settlement, reference data management, reconciliations, securities financing and collateral management, asset servicing, compliance and regulatory reporting, portfolio accounting, and custody-related services. This segment also offers business process outsourcing services; technology solutions, such portfolio management, compliance, fee billing, and operational support solutions; and capital market and wealth and investment management solutions. The company was founded in 1962 and is headquartered in Lake Success, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:49:52"},{"Company Name":"W.R. Berkley Corporation","Symbol":"WRB","Current Price":"73.31","Latest MA":"64.45","Latest MA 5":72.8930003052,"Latest MA 9":73.5894450548,"Latest MA 20":73.5132502289,"RSI":50.4764280873,"Price Target":70.298,"Difference from MA":"13.76%","Difference from Open":"1.10%","Change from Yesterday":"1.28%","Change from Last Report":"-0.03","Latest Volume":"606,001","Market Cap":"27,812,485,120","Earning Date":"21-04-2025","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":16.854023,"PB Ratio":3.1197875,"Previous Close":72.39,"ROE":0.20686,"DTE":34.344,"Industry":"Insurance - Property & Casualty","Sector":"Financial Services","Beta":0.432,"Trailing PEG":17.994,"Trailing PE":17.01044,"Trailing PS":17.01044,"Quick Ratio":0.22,"Day High":73.48,"Day Low":72.455,"VS Average Volume":0.3230699269,"Company Summary":"W. R. Berkley Corporation, an insurance holding company, operates as a commercial line writer worldwide. The company operates in two segments, Insurance, and Reinsurance & Monoline Excess. The Insurance segment underwrites commercial insurance business, including excess and surplus lines, admitted lines, and specialty personal lines. This segment also provides accident and health insurance and reinsurance products; insurance for commercial risks; casualty and specialty environmental products; insurance coverages for fine arts and jewelry exposures; excess liability and inland marine coverage for small to medium-sized insureds; and commercial general liability, umbrella, professional liability, directors and officers, commercial property, and surety products, as well as products for technology, and life sciences and travel industries. In addition, it offers cyber risk solutions; crime and fidelity insurance products; medical professional coverages; workers' compensation insurance products; management liability and general insurance products; personal lines insurance solutions, including home, condo\/co-op, auto, fine arts and collectibles, liability, collector vehicle, and recreational marine; law enforcement, public officials and educator's legal, and employment practices liability, as well as incidental medical, property, and crime insurance products; at-risk and alternative risk insurance program management services; professional liability; energy and marine risks; and insurance products to the Lloyd's marketplace. The Reinsurance & Monoline Excess segment provides treaty and facultative reinsurance solutions; property and casualty reinsurance products; facultative reinsurance products include automatic, semi-automatic, and individual risk assumed reinsurance; and turnkey products, such as cyber, employment practices liability insurance, liquor liability insurance and violent events. The company was founded in 1967 and is headquartered in Greenwich, Connecticut.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"12-06-2025 20:49:52"},{"Company Name":"Equity Residential","Symbol":"EQR","Current Price":"69.84","Latest MA":"70.11","Latest MA 5":69.3859992676,"Latest MA 9":69.24777771,"Latest MA 20":69.535000412,"RSI":55.6329512373,"Price Target":77.59524,"Difference from MA":"-0.38%","Difference from Open":"0.49%","Change from Yesterday":"0.82%","Change from Last Report":"0.27","Latest Volume":"384,482","Market Cap":"27,349,901,312","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":41.32544,"PB Ratio":2.4050415,"Previous Close":69.27,"ROE":0.08901,"DTE":70.333,"Industry":"REIT - Residential","Sector":"Real Estate","Beta":0.919,"Trailing PEG":15.8945,"Trailing PE":26.656488,"Trailing PS":26.656488,"Quick Ratio":0.073,"Day High":70.07,"Day Low":69.23,"VS Average Volume":0.192422647,"Company Summary":"Equity Residential is committed to creating communities where people thrive. The Company, a member of the S&P 500, is focused on the acquisition, development and management of residential properties located in and around dynamic cities that attract affluent long-term renters. Equity Residential owns or has investments in 312 properties consisting of 84,648 apartment units, with an established presence in Boston, New York, Washington, D.C., Seattle, San Francisco and Southern California, and an expanding presence in Denver, Atlanta, Dallas\/Ft. Worth and Austin.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:49:52"},{"Company Name":"GoDaddy Inc.","Symbol":"GDDY","Current Price":"177.81","Latest MA":"188.67","Latest MA 5":179.153998291,"Latest MA 9":180.2499985758,"Latest MA 20":182.6804986267,"RSI":36.1594639671,"Price Target":210.78444,"Difference from MA":"-5.76%","Difference from Open":"0.82%","Change from Yesterday":"0.51%","Change from Last Report":"-0.07","Latest Volume":"603,590","Market Cap":"25,335,791,616","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":26.499254,"PB Ratio":126.825966,"Previous Close":176.91,"ROE":2.45696,"DTE":1945.769,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.075,"Trailing PEG":2.8654,"Trailing PE":34.194233,"Trailing PS":34.194233,"Quick Ratio":0.326,"Day High":178.27,"Day Low":175.93,"VS Average Volume":0.4014598055,"Company Summary":"GoDaddy Inc. engages in the design and development of cloud-based products in the United States and internationally. It operates in two segments: Applications and Commerce (A&C), and Core Platform (Core). The A&C segment offers applications products, including Websites + Marketing, a mobile-optimized online tool that enables customers to build websites and e-commerce enabled online stores; and Managed WordPress, a streamlined and optimized website building that allows customers to build and manage a WordPress site; Managed WooCommerce Stores to sell anything and anywhere online; and marketing tools and services, such as GoDaddy Studio mobile application, search engine optimization, Meta and Google My Business, and email and social media marketing designed to help businesses acquire and engage customers and create content. The segment also offers connected commerce comprising Smart Terminal, a dual screen all-in-one point-of-sale system that allows customers to manage in-store inventory and product catalogs and accept payments; GoDaddy Payments, a payment facilitator that enables customers to accept various forms of payments; and email service plans with a multi-feature web interface, and Microsoft 365 accounts that connects to customers' domains. The Core segment offers domain products, including primary registrations, domain aftermarket platform, and domain name add-ons, as well as GoDaddy Registry, a provider of domain name registry services; and hosting and security services comprising shared website hosting and virtual private servers, as well as security products with a suite of tools designed to help secure customers' online presence. The company serves small businesses, individuals, organizations, developers, designers, and domain investors. GoDaddy Inc. was founded in 1997 and is headquartered in Tempe, Arizona.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"12-06-2025 20:49:52"},{"Company Name":"SBA Communications Corporation","Symbol":"SBAC","Current Price":"225.84","Latest MA":"216.04","Latest MA 5":225.4840003662,"Latest MA 9":227.5955543349,"Latest MA 20":229.3055749817,"RSI":40.5557654105,"Price Target":254.94118,"Difference from MA":"4.54%","Difference from Open":"-0.18%","Change from Yesterday":"0.48%","Change from Last Report":"0.20","Latest Volume":"284,444","Market Cap":"24,265,377,792","Earning Date":"28-04-2025","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":24.628134,"PB Ratio":-4.908178,"Previous Close":224.75,"ROE":null,"DTE":null,"Industry":"REIT - Specialty","Sector":"Real Estate","Beta":0.78,"Trailing PEG":1.6454,"Trailing PE":29.912582,"Trailing PS":29.912582,"Quick Ratio":0.591,"Day High":227.9,"Day Low":224.99,"VS Average Volume":0.2991964809,"Company Summary":"SBA Communications Corporation is a leading independent owner and operator of wireless communications infrastructure including towers, buildings, rooftops, distributed antenna systems (DAS) and small cells. With a portfolio of more than 39,000 communications sites throughout the Americas and in Africa, SBA is listed on NASDAQ under the symbol SBAC. Our organization is part of the S&P 500 and one of the top Real Estate Investment Trusts (REITs) by market capitalization.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:49:52"},{"Company Name":"CMS Energy Corporation","Symbol":"CMS","Current Price":"70.39","Latest MA":"69.22","Latest MA 5":70.0390010376,"Latest MA 9":70.0438891262,"Latest MA 20":70.2417509918,"RSI":53.6387103581,"Price Target":75.27125,"Difference from MA":"1.68%","Difference from Open":"0.45%","Change from Yesterday":"0.55%","Change from Last Report":"0.09","Latest Volume":"466,971","Market Cap":"21,053,843,456","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":19.660616,"PB Ratio":2.5955086,"Previous Close":70.0,"ROE":0.11234,"DTE":190.138,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.379,"Trailing PEG":2.8351,"Trailing PE":20.823965,"Trailing PS":20.823965,"Quick Ratio":0.568,"Day High":70.43,"Day Low":70.0,"VS Average Volume":0.1685450197,"Company Summary":"CMS Energy Corporation operates as an energy company primarily in Michigan. The company operates through three segments: Electric Utility; Gas Utility; and NorthStar Clean Energy. The Electric Utility segment is involved in the generation, purchase, distribution, and sale of electricity. This segment generates electricity through coal, wind, gas, renewable energy, oil, and nuclear sources. Its distribution system comprises 270 miles of high-voltage distribution overhead lines; 4 miles of high-voltage distribution underground lines; 4,646 miles of high-voltage distribution overhead lines; 18 miles of high-voltage distribution underground lines; 81,924 miles of electric distribution overhead lines; 9,775 miles of underground distribution lines; and 1,098 substations. The Gas Utility segment engages in the purchase, transmission, storage, distribution, and sale of natural gas, which includes 2,342 miles of transmission lines; 15 gas storage fields; 28,368 miles of distribution mains; and 8 compressor stations. The NorthStar Clean Energy segment is involved in the independent power production and marketing, including the development and operation of renewable generation. The company serves 1.9 million electric and 1.8 million gas customers, including residential, commercial, and diversified industrial customers. The company was incorporated in 1987 and is headquartered in Jackson, Michigan.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:49:52"},{"Company Name":"Invitation Homes Inc.","Symbol":"INVH","Current Price":"33.73","Latest MA":"32.75","Latest MA 5":33.408999176,"Latest MA 9":33.3716661241,"Latest MA 20":33.5492497253,"RSI":56.7522571917,"Price Target":37.84091,"Difference from MA":"2.97%","Difference from Open":"1.22%","Change from Yesterday":"1.22%","Change from Last Report":"0.03","Latest Volume":"1,255,068","Market Cap":"20,671,703,040","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":45.57432,"PB Ratio":2.1268208,"Previous Close":33.32,"ROE":0.048070002,"DTE":83.399,"Industry":"REIT - Residential","Sector":"Real Estate","Beta":0.817,"Trailing PEG":12.9681,"Trailing PE":43.23718,"Trailing PS":43.23718,"Quick Ratio":0.721,"Day High":33.73,"Day Low":33.1,"VS Average Volume":0.3826040726,"Company Summary":"Invitation Homes, an S&P 500 company, is the nation's premier single-family home leasing and management company, meeting changing lifestyle demands by providing access to high-quality, updated homes with valued features such as close proximity to jobs and access to good schools.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:49:52"},{"Company Name":"Ulta Beauty, Inc.","Symbol":"ULTA","Current Price":"459.64","Latest MA":"392.51","Latest MA 5":462.5560029297,"Latest MA 9":466.027779541,"Latest MA 20":439.8610008545,"RSI":60.6166707116,"Price Target":475.30914,"Difference from MA":"17.10%","Difference from Open":"0.71%","Change from Yesterday":"0.58%","Change from Last Report":"0.14","Latest Volume":"269,033","Market Cap":"20,658,796,544","Earning Date":"29-05-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":20.097944,"PB Ratio":8.518793,"Previous Close":456.97,"ROE":0.50435,"DTE":81.274,"Industry":"Specialty Retail","Sector":"Consumer Cyclical","Beta":1.096,"Trailing PEG":2.5807,"Trailing PE":17.961704,"Trailing PS":17.961704,"Quick Ratio":0.385,"Day High":463.0,"Day Low":452.0,"VS Average Volume":0.2652314378,"Company Summary":"Ulta Beauty, Inc. operates as a specialty beauty retailer in the United States. The company offers branded and private label beauty products, including cosmetics, fragrance, haircare, skincare, bath and body products, professional hair products, and salon styling tools through its Ulta Beauty stores, shop-in-shops, Ulta.com website, and its mobile applications. It also provides beauty services, including hair, makeup, brow, and skin services at its stores. The company was formerly known as ULTA Salon, Cosmetics & Fragrance, Inc. and changed its name to Ulta Beauty, Inc. in January 2017. Ulta Beauty, Inc. was incorporated in 1990 and is based in Bolingbrook, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:49:52"},{"Company Name":"Citizens Financial Group, Inc.","Symbol":"CFG","Current Price":"41.01","Latest MA":"42.37","Latest MA 5":41.4200000305,"Latest MA 9":40.9366668871,"Latest MA 20":40.7294999008,"RSI":53.0979779994,"Price Target":47.36842,"Difference from MA":"-3.22%","Difference from Open":"-0.29%","Change from Yesterday":"-0.94%","Change from Last Report":"0.00","Latest Volume":"3,647,023","Market Cap":"17,783,945,216","Earning Date":"17-07-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.596899,"PB Ratio":0.788851,"Previous Close":41.4,"ROE":0.06367,"DTE":null,"Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.074,"Trailing PEG":null,"Trailing PE":13.019047,"Trailing PS":13.019047,"Quick Ratio":null,"Day High":41.22,"Day Low":40.62,"VS Average Volume":0.7119960127,"Company Summary":"Citizens Financial Group, Inc. operates as the bank holding company that provides retail and commercial banking products and services to individuals, small businesses, middle-market companies, large corporations, and institutions in the United States. The company operates through two segments, Consumer Banking and Commercial Banking. The Consumer Banking segment offers deposit products, mortgage and home equity lending products, credit cards, business loans, wealth management, and investment services; and education and point-of-sale finance loans, as well as digital deposit products. This segment serves its customers through telephone service centers, as well as through its online and mobile platforms. The Commercial Banking segment provides various financial products and solutions, including lending and leasing, deposit and treasury management services, foreign exchange, and interest rate and commodity risk management solutions, as well as syndicated loans, corporate finance, mergers and acquisitions, and debt and equity capital markets services. This segment serves multi-family, office, industrial, retail, healthcare, and hospitality sectors. The company was formerly known as RBS Citizens Financial Group, Inc. and changed its name to Citizens Financial Group, Inc. in April 2014. Citizens Financial Group, Inc. was founded in 1828 and is headquartered in Providence, Rhode Island.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:49:52"},{"Company Name":"Baxter International Inc.","Symbol":"BAX","Current Price":"31.24","Latest MA":"31.42","Latest MA 5":31.0939999084,"Latest MA 9":30.5811108738,"Latest MA 20":30.6310572739,"RSI":59.8472466133,"Price Target":38.3425,"Difference from MA":"-0.58%","Difference from Open":"0.00%","Change from Yesterday":"-0.51%","Change from Last Report":"-0.02","Latest Volume":"1,079,038","Market Cap":"16,031,587,328","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":10.847221,"PB Ratio":2.2636042,"Previous Close":31.4,"ROE":-0.03506,"DTE":146.144,"Industry":"Medical Instruments & Supplies","Sector":"Healthcare","Beta":0.613,"Trailing PEG":null,"Trailing PE":null,"Trailing PS":null,"Quick Ratio":1.147,"Day High":31.65,"Day Low":31.115,"VS Average Volume":0.2516266542,"Company Summary":"Baxter International Inc., through its subsidiaries, provides a portfolio of healthcare products in the United States. The company operates through three segments: Medical Products and Therapies, Healthcare Systems and Technologies, and Pharmaceuticals. It offers sterile intravenous (IV) solutions; infusion systems and devices; parenteral nutrition therapies; administrative sets; generic injectable pharmaceuticals; surgical hemostat and sealant products; advanced surgical equipment; smart bed systems; patient monitoring and diagnostic technologies; and respiratory health devices, as well as advanced equipment for the surgical space comprising operating room integration technologies, precision positioning devices, and other accessories. The company also provides specialty injectable pharmaceuticals, inhaled anesthetics, and drug compounding services. Its products are used in hospitals, nursing homes, rehabilitation centers, ambulatory surgery centers, doctors' offices, kidney dialysis centers, and patients at home under physician supervision. The company sells its products through direct sales force, independent distributors, drug wholesalers, and specialty pharmacy or other alternate site providers. It has an agreement with Celerity Pharmaceuticals, LLC to develop acute care generic injectable premix and oncolytic products. The company operates in Eastern Europe, the Middle East, Africa, Latin America, Asia, Western Europe, Canada, Japan, Australia, and New Zealand. Baxter International Inc. was incorporated in 1931 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:49:52"},{"Company Name":"Evergy, Inc.","Symbol":"EVRG","Current Price":"67.51","Latest MA":"64.27","Latest MA 5":67.1079997559,"Latest MA 9":66.4633337402,"Latest MA 20":66.2041045074,"RSI":63.3340757491,"Price Target":73.1375,"Difference from MA":"5.04%","Difference from Open":"-0.22%","Change from Yesterday":"0.00%","Change from Last Report":"0.21","Latest Volume":"921,568","Market Cap":"15,533,444,096","Earning Date":"08-05-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":16.710396,"PB Ratio":1.5641437,"Previous Close":67.51,"ROE":0.09047,"DTE":144.484,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.472,"Trailing PEG":2.7693,"Trailing PE":17.76579,"Trailing PS":17.76579,"Quick Ratio":0.07,"Day High":67.79,"Day Low":67.235,"VS Average Volume":0.3761081414,"Company Summary":"Evergy, Inc., together with its subsidiaries, engages in the generation, transmission, distribution, and sale of electricity in the United States. It generates electricity through coal, landfill gas, uranium, and natural gas and oil sources, as well as solar, wind, other renewable sources. The company serves residences, commercial firms, industrials, municipalities, and other electric utilities. The company was incorporated in 2017 and is headquartered in Kansas City, Missouri.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:49:52"},{"Company Name":"Solventum Corporation","Symbol":"SOLV","Current Price":"74.08","Latest MA":"71.70","Latest MA 5":74.7610002441,"Latest MA 9":74.6327786933,"Latest MA 20":73.815250061,"RSI":51.31195414,"Price Target":82.165,"Difference from MA":"3.33%","Difference from Open":"-0.15%","Change from Yesterday":"-0.44%","Change from Last Report":"0.16","Latest Volume":"195,945","Market Cap":"12,817,667,072","Earning Date":"08-05-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":13.396925,"PB Ratio":3.9291966,"Previous Close":74.41,"ROE":0.10657,"DTE":242.581,"Industry":"Medical Instruments & Supplies","Sector":"Healthcare","Beta":null,"Trailing PEG":null,"Trailing PE":34.140553,"Trailing PS":34.140553,"Quick Ratio":0.641,"Day High":74.23,"Day Low":73.63,"VS Average Volume":0.159163184,"Company Summary":"Solventum Corporation, a healthcare company, develops, manufactures, and commercializes a portfolio of solutions to address critical customer and patient needs in the United States and internationally. It operates in four segments: Medsurg, Dental Solutions, Health Information Systems, and Purification and Filtration. The Medsurg segment offers solutions for negative pressure wound therapy, advanced wound dressings, advanced skin care, I.V. site management, sterilization assurance, temperature management, surgical supplies, medical tapes and wrap, stethoscopes, medical electrodes, and medical technologies for original equipment manufacturers. Its Dental Solutions segment provides a suite of dental and orthodontic products, including brackets, aligners, restorative cements, and bonding agents. The Health Information Systems provides software solutions and services for health care systems, such as computer-assisted, physician documentation, direct-to-bill and coding automation, classification methodologies, speech recognition, and data visualization platforms. Its Purification and Filtration segment provides purification and filtration technologies comprising filters, purifiers, cartridges, and membranes. The company sells its products and services through direct-to-consumer, distribution, key account management, inside sales, and e-commerce. Solventum Corporation was incorporated in 2023 and is based in Maplewood, Minnesota.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"12-06-2025 20:49:52"},{"Company Name":"Camden Property Trust","Symbol":"CPT","Current Price":"117.91","Latest MA":"116.64","Latest MA 5":117.3610003052,"Latest MA 9":117.295,"Latest MA 20":116.9597496643,"RSI":57.2134081146,"Price Target":130.03261,"Difference from MA":"1.09%","Difference from Open":"0.35%","Change from Yesterday":"0.41%","Change from Last Report":"0.34","Latest Volume":"186,716","Market Cap":"12,596,733,952","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":72.78086,"PB Ratio":2.7813687,"Previous Close":117.42,"ROE":0.025999999,"DTE":79.752,"Industry":"REIT - Residential","Sector":"Real Estate","Beta":0.802,"Trailing PEG":null,"Trailing PE":108.16972,"Trailing PS":108.16972,"Quick Ratio":0.026,"Day High":118.39,"Day Low":117.035,"VS Average Volume":0.1789741166,"Company Summary":"Camden Property Trust, an S&P 500 Company, is a real estate company primarily engaged in the ownership, management, development, redevelopment, acquisition, and construction of multifamily apartment communities. Camden owns and operates 172 properties containing 58,250 apartment homes across the United States. Upon completion of 5 properties currently under development, the Company's portfolio will increase to 59,996 apartment homes in 177 properties. Camden has been recognized as one of the 100 Best Companies to Work For by FORTUNE magazine for 17 consecutive years, most recently ranking #24.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:49:52"},{"Company Name":"Healthpeak Properties, Inc.","Symbol":"DOC","Current Price":"17.48","Latest MA":"19.37","Latest MA 5":17.4250002594,"Latest MA 9":17.318333452,"Latest MA 20":17.3046706848,"RSI":57.4632160381,"Price Target":22.97059,"Difference from MA":"-9.71%","Difference from Open":"-0.09%","Change from Yesterday":"-0.14%","Change from Last Report":"0.11","Latest Volume":"1,873,922","Market Cap":"12,147,390,464","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":69.94,"PB Ratio":1.4918942,"Previous Close":17.51,"ROE":0.0332,"DTE":103.846,"Industry":"REIT - Healthcare Facilities","Sector":"Real Estate","Beta":1.013,"Trailing PEG":4.3819,"Trailing PE":42.646343,"Trailing PS":42.646343,"Quick Ratio":0.661,"Day High":17.55,"Day Low":17.365,"VS Average Volume":0.3069257048,"Company Summary":"Healthpeak Properties, Inc. is a fully integrated real estate investment trust (REIT) and S&P 500 company. Healthpeak owns, operates, and develops high-quality real estate focused on healthcare discovery and delivery.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:49:52"},{"Company Name":"Revvity, Inc.","Symbol":"RVTY","Current Price":"95.55","Latest MA":"107.96","Latest MA 5":94.5439996338,"Latest MA 9":92.8855553521,"Latest MA 20":92.1525007629,"RSI":62.8976149336,"Price Target":124.83,"Difference from MA":"-11.50%","Difference from Open":"0.09%","Change from Yesterday":"-0.54%","Change from Last Report":"0.01","Latest Volume":"232,082","Market Cap":"11,262,479,360","Earning Date":"28-04-2025","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":18.517443,"PB Ratio":1.4939492,"Previous Close":96.07,"ROE":0.03824,"DTE":43.542,"Industry":"Diagnostics & Research","Sector":"Healthcare","Beta":0.972,"Trailing PEG":0.7179,"Trailing PE":39.48347,"Trailing PS":39.48347,"Quick Ratio":2.708,"Day High":96.06,"Day Low":94.56,"VS Average Volume":0.1808055469,"Company Summary":"Revvity, Inc. provides health sciences solutions, technologies, and services worldwide. The company's Life Sciences segment provides instruments, reagents, informatics, software, subscriptions, detection, imaging technologies, warranties, training, and DNA sequencing services. Its Diagnostics segment offers instruments, reagents, assay platforms, and software products for the early detection of genetic disorders, such as pregnancy and early childhood, as well as infectious disease testing in the diagnostics market. Its products are used for testing and screening genetic abnormalities, disorders, and diseases, including down syndrome, hypothyroidism, muscular dystrophy, infertility, and various metabolic conditions. It also develops technologies that enable and support genomic workflows using protein coupled receptor and next-generation DNA sequencing for use in oncology, screening newborns for rare genetic conditions, immunodiagnostics, and drug discovery. It serves pharmaceutical and biotechnology companies, laboratories, academic and research institutions, public health authorities, private healthcare organizations, doctors, and government agencies under the AutoDELFIA, BACS-on-Beads, BIOCHIPs, Bioo Scientific, BioQule, BoBs, chemagic, Chitas, DELFIA, DELFIA Xpress, DOPlify, EONIS, EUROArray, EUROIMMUN, EUROLabWorkstation, EUROLINE, EUROPatternTM, Evolution Evoya, explorer, Fontus, GSP, Haoyuan, IDS Immunodiagnosticsystems, IDS-i10, IDS-i10T, IDS-iSYS, iLab, iQ, JANUS, LabChip, LifeCycle, LimsLink, Migele, MultiPROBE, NEXTFLEX, NextPrep, Omni Bead Ruptor, Omni Bead Ruptor Elite, Omni Tip, Pannoramic, Panthera Puncher, PG-Seq, PG-Find, PreNAT II, Prime, Protein Clear, ProteinEXact, QuantiVac, RONIA, Sciclone, SimplicityChrom, Specimen Gate, Superflex, Symbio, T-SPOT, Touch, Twister, Vanadis, VariSpec, ViaCord, VICTOR2D, and Zephyr brands. The company was formerly known as PerkinElmer, Inc. and changed its name to Revvity, Inc. in April 2023. Revvity, Inc. was founded in 1937 and is headquartered in Waltham, Massachusetts.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:49:52"},{"Company Name":"Host Hotels & Resorts, Inc.","Symbol":"HST","Current Price":"15.83","Latest MA":"15.96","Latest MA 5":15.9100000534,"Latest MA 9":15.7222222307,"Latest MA 20":15.4585000076,"RSI":59.3383453792,"Price Target":17.97059,"Difference from MA":"-0.80%","Difference from Open":"0.44%","Change from Yesterday":"-0.88%","Change from Last Report":"0.35","Latest Volume":"4,137,059","Market Cap":"11,130,262,528","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":16.319588,"PB Ratio":1.6513665,"Previous Close":15.97,"ROE":0.09996,"DTE":83.171,"Industry":"REIT - Hotel & Motel","Sector":"Real Estate","Beta":1.351,"Trailing PEG":2.2526,"Trailing PE":16.489584,"Trailing PS":16.489584,"Quick Ratio":2.084,"Day High":15.9,"Day Low":15.72,"VS Average Volume":0.377826167,"Company Summary":"Host Hotels & Resorts, Inc. is an S&P 500 company and is the largest lodging real estate investment trust and one of the largest owners of luxury and upper-upscale hotels. The Company currently owns 76 properties in the United States and five properties internationally totaling approximately 43,400 rooms. The Company also holds non-controlling interests in seven domestic and one international joint ventures. Guided by a disciplined approach to capital allocation and aggressive asset management, the Company partners with premium brands such as Marriott, Ritz-Carlton, Westin, Sheraton, W, St. Regis, The Luxury Collection, Hyatt, Fairmont, 1 Hotels, Hilton, Four Seasons, Swissôtel, ibis and Novotel, as well as independent brands.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:49:52"},{"Company Name":"Pinnacle West Capital Corporati","Symbol":"PNW","Current Price":"90.30","Latest MA":"89.21","Latest MA 5":89.5340005493,"Latest MA 9":89.7600001017,"Latest MA 20":90.5309996033,"RSI":52.4158734049,"Price Target":95.36733,"Difference from MA":"1.22%","Difference from Open":"1.02%","Change from Yesterday":"1.22%","Change from Last Report":"0.14","Latest Volume":"471,641","Market Cap":"10,781,729,792","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":19.294872,"PB Ratio":1.6000142,"Previous Close":89.21,"ROE":0.0919,"DTE":177.219,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.431,"Trailing PEG":4.4027,"Trailing PE":17.881187,"Trailing PS":17.881187,"Quick Ratio":0.188,"Day High":90.31,"Day Low":89.175,"VS Average Volume":0.384347904,"Company Summary":"Pinnacle West Capital Corporation, through its subsidiary, provides retail and wholesale electric services primarily in the state of Arizona. The company engages in the generation, transmission, and distribution of electricity using nuclear, gas, oil, coal, and solar generating facilities. Its transmission facilities include overhead lines and underground lines; and distribution facilities consist of overhead lines and underground primary cables. The company also owns and maintains transmission and distribution substations; and owns energy storage facilities. Pinnacle West Capital Corporation was incorporated in 1985 and is headquartered in Phoenix, Arizona.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:49:52"},{"Company Name":"Albemarle Corporation","Symbol":"ALB","Current Price":"63.17","Latest MA":"78.43","Latest MA 5":62.9169999695,"Latest MA 9":60.5583331638,"Latest MA 20":59.3097498322,"RSI":63.0269491059,"Price Target":82.4556,"Difference from MA":"-19.45%","Difference from Open":"-1.32%","Change from Yesterday":"-2.93%","Change from Last Report":"-0.56","Latest Volume":"1,739,082","Market Cap":"7,433,233,408","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":34.33424,"PB Ratio":0.9537433,"Previous Close":65.08,"ROE":-0.09992,"DTE":35.757,"Industry":"Specialty Chemicals","Sector":"Basic Materials","Beta":1.614,"Trailing PEG":null,"Trailing PE":null,"Trailing PS":null,"Quick Ratio":1.196,"Day High":64.23,"Day Low":62.46,"VS Average Volume":0.5047727657,"Company Summary":"Albemarle Corporation provides energy storage solutions worldwide. It operates through three segments: Energy Storage, Specialties, and Ketjen. The Energy Storage segment offers lithium compounds, including lithium carbonate, lithium hydroxide, and lithium chloride for use in lithium batteries used in consumer electronics and electric vehicles, power grids and solar panels, high performance greases, specialty glass used in consumer appliances and electronics, organic synthesis processes in the areas of steroid chemistry and vitamins, and various life science applications, as well as intermediates in the pharmaceutical industry; technical services, including handling and use of reactive lithium products; and recycling services for lithium-containing by-products. The Specialties segment provides bromine and highly specialized lithium solutions for various industries, such as energy, mobility, connectivity, and health comprising fire safety compounds; bromine-based specialty chemicals products, including elemental bromine, alkyl bromides, inorganic bromides, brominated powdered activated carbon, and various bromine fine chemicals; lithium specialties, such as butyllithium and lithium aluminum hydride; cesium products for the chemical and pharmaceutical industries; and zirconium, barium, and titanium products for pyrotechnical applications that include airbag initiators. The Ketjen segment offers clean fuels technologies, including hydroprocessing catalysts together with isomerization and akylation catalysts; fluidized catalytic cracking catalysts and additives; and performance catalyst solutions comprising organometallics and curatives. It serves grid storage, automotive, aerospace, conventional energy, electronics, construction, agriculture and food, pharmaceuticals and medical device industries. Albemarle Corporation was founded in 1887 and is headquartered in Charlotte, North Carolina.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:49:52"}]