[{"Company Name":"Alphabet Inc.","Symbol":"GOOG","Current Price":"177.59","Latest MA":"175.91","Latest MA 5":177.7459968262,"Latest MA 9":173.9107619222,"Latest MA 20":171.6885423584,"RSI":64.8875097904,"Price Target":199.625,"Difference from MA":"0.96%","Difference from Open":"0.07%","Change from Yesterday":"-0.67%","Change from Last Report":"-0.01","Latest Volume":"9,239,870","Market Cap":"2,145,464,877,056","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":19.842459,"PB Ratio":6.252068,"Previous Close":178.79,"ROE":0.34789002,"DTE":8.254,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.014,"Trailing PEG":1.3702,"Trailing PE":19.820312,"Trailing PS":19.820312,"Quick Ratio":1.597,"Day High":178.112,"Day Low":176.12,"VS Average Volume":0.3525440897,"Company Summary":"Alphabet Inc. offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube. It is also involved in the sale of apps and in-app purchases and digital content in the Google Play and YouTube; and devices, as well as in the provision of YouTube consumer subscription services. The Google Cloud segment offers AI infrastructure, Vertex AI platform, cybersecurity, data and analytics, and other services; Google Workspace that include cloud-based communication and collaboration tools for enterprises, such as Calendar, Gmail, Docs, Drive, and Meet; and other services for enterprise customers. The Other Bets segment sells healthcare-related and internet services. The company was incorporated in 1998 and is headquartered in Mountain View, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:29:01"},{"Company Name":"Oracle Corporation","Symbol":"ORCL","Current Price":"200.90","Latest MA":"162.82","Latest MA 5":181.1859997559,"Latest MA 9":175.653334554,"Latest MA 20":167.268500061,"RSI":92.8192328659,"Price Target":204.78146,"Difference from MA":"23.39%","Difference from Open":"5.76%","Change from Yesterday":"13.93%","Change from Last Report":"-0.04","Latest Volume":"42,643,795","Market Cap":"563,369,738,240","Earning Date":"12-06-2025","Earning Time":"Before","Earning Day of Week":"Saturday","PE Ratio":28.058659,"PB Ratio":33.65723,"Previous Close":176.38,"ROE":1.03741,"DTE":632.501,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.324,"Trailing PEG":1.8619,"Trailing PE":47.04918,"Trailing PS":47.04918,"Quick Ratio":0.873,"Day High":202.49,"Day Low":188.88,"VS Average Volume":4.3862248796,"Company Summary":"Oracle Corporation offers products and services that address enterprise information technology environments worldwide. Its Oracle cloud software as a service offering include various cloud software applications, including Oracle Fusion cloud enterprise resource planning (ERP), Oracle Fusion cloud enterprise performance management, Oracle Fusion cloud supply chain and manufacturing management, Oracle Fusion cloud human capital management, Oracle Cerner healthcare, and NetSuite applications suite, as well as Oracle Fusion Sales, Service, and Marketing. The company also offers cloud-based industry solutions for various industries; Oracle application licenses; and Oracle license support services. In addition, it provides cloud and license business' infrastructure technologies, such as the Oracle Database and MySQL Database; Java, a software development language; and middleware, including development tools and others. The company's cloud and license business' infrastructure technologies also comprise cloud-based compute, storage, and networking capabilities; and Oracle autonomous database and MySQL HeatWave, as well as Internet-of-Things, digital assistant, and blockchain. Further, it provides hardware products and other hardware-related software offerings, including Oracle engineered systems, enterprise servers, storage solutions, industry-specific hardware, virtualization software, operating systems, management software, and related hardware services, as well as hardware support products; and consulting and customer services. The company markets and sells its cloud, license, hardware, support, and services offerings directly to businesses in various industries, government agencies, and educational institutions, as well as through indirect channels. Oracle Corporation was founded in 1977 and is headquartered in Austin, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:29:01"},{"Company Name":"Procter & Gamble Company (The)","Symbol":"PG","Current Price":"162.53","Latest MA":"166.05","Latest MA 5":162.8119997559,"Latest MA 9":164.1600004069,"Latest MA 20":165.1714996948,"RSI":39.1977528112,"Price Target":172.87914,"Difference from MA":"-2.12%","Difference from Open":"0.35%","Change from Yesterday":"0.26%","Change from Last Report":"0.16","Latest Volume":"2,848,614","Market Cap":"381,058,056,192","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":21.904312,"PB Ratio":7.40051,"Previous Close":162.11,"ROE":0.30294,"DTE":64.975,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":0.427,"Trailing PEG":3.9252,"Trailing PE":25.757528,"Trailing PS":25.757528,"Quick Ratio":0.445,"Day High":163.31,"Day Low":161.675,"VS Average Volume":0.3417058,"Company Summary":"The Procter & Gamble Company engages in the provision of branded consumer packaged goods worldwide. The company operates through five segments: Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care. The Beauty segment offers conditioners, shampoos, styling aids, and treatments under the Head & Shoulders, Herbal Essences, Pantene, and Rejoice brands; and antiperspirants and deodorants, personal cleansing, and skin care products under the Olay, Old Spice, Safeguard, Secret, SK-II, and Native brands. The Grooming segment provides blades and razors, shave products, appliances, and other grooming products under the Braun, Gillette, and Venus brand names. The Health Care segment offers toothbrushes, toothpastes, and other oral care products under the Crest and Oral-B brand names; and gastrointestinal, pain relief, rapid diagnostics, respiratory, vitamins\/minerals\/supplements, and other personal health care products under Metamucil, Neurobion, Pepto-Bismol, and Vicks brands. The Fabric & Home Care segment provides fabric enhancers, laundry additives, and laundry detergents under the Ariel, Downy, Gain, and Tide brands; and air care, dish care, P&G professional, and surface care products under the Cascade, Dawn, Fairy, Febreze, Mr. Clean, and Swiffer brands. The Baby, Feminine & Family Care segment offers baby wipes, and taped diapers and pants under the Luvs and Pampers brands; adult incontinence and feminine care products under the Always, Always Discreet, and Tampax brands; and paper towels, tissues, and toilet papers under the Bounty, Charmin, and Puffs brands. It sells its products primarily through mass merchandisers, e-commerce, grocery stores, membership club stores, drug stores, department stores, distributors, wholesalers, specialty beauty stores, high-frequency stores, pharmacies, electronics stores, and professional channels, as well as directly to consumers. The company was founded in 1837 and is headquartered in Cincinnati, Ohio.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:29:01"},{"Company Name":"UnitedHealth Group Incorporated","Symbol":"UNH","Current Price":"318.23","Latest MA":"484.84","Latest MA 5":307.7980019531,"Latest MA 9":304.5722237142,"Latest MA 20":301.6645029297,"RSI":62.7325491601,"Price Target":385.33792,"Difference from MA":"-34.36%","Difference from Open":"2.19%","Change from Yesterday":"2.46%","Change from Last Report":"0.33","Latest Volume":"9,578,285","Market Cap":"288,679,165,952","Earning Date":"29-07-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":10.643145,"PB Ratio":3.0471003,"Previous Close":310.56,"ROE":0.22700001,"DTE":77.277,"Industry":"Healthcare Plans","Sector":"Healthcare","Beta":0.453,"Trailing PEG":0.8241,"Trailing PE":13.326216,"Trailing PS":13.326216,"Quick Ratio":0.769,"Day High":318.62,"Day Low":308.58,"VS Average Volume":0.6200725589,"Company Summary":"UnitedHealth Group Incorporated operates as a health care company in the United States and internationally. The company operates through four segments: UnitedHealthcare, Optum Health, Optum Insight, and Optum Rx. The UnitedHealthcare segment offers consumer-oriented health benefit plans and services for national employers, public sector employers, mid-sized employers, small businesses, and individuals; health care coverage, and health and well-being services to individuals age 50 and older; Medicaid plans, children's health insurance and health care programs; and health care benefits products and services to state programs caring for the economically disadvantaged, medically underserved, and those without the benefit of employer-funded health care coverage. The Optum Health segment provides care delivery, care management, wellness and consumer engagement, and health financial services patients, consumers, care delivery systems, providers, employers, payers, and public-sector entities. The Optum Insight segment offers software and information products, advisory consulting arrangements, and managed services outsourcing contracts to hospital systems, physicians, health plans, governments, life sciences companies, and other organizations. The Optum Rx segment provides pharmacy care services and programs, including retail network contracting, home delivery, specialty and community health pharmacy services, infusion, and purchasing and clinical capabilities, as well as develops programs in the areas of step therapy, formulary management, drug adherence, and disease and drug therapy management. UnitedHealth Group Incorporated was founded in 1974 and is based in Eden Prairie, Minnesota.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:29:01"},{"Company Name":"Abbott Laboratories","Symbol":"ABT","Current Price":"135.80","Latest MA":"124.99","Latest MA 5":134.4381998779,"Latest MA 9":134.0412247314,"Latest MA 20":133.6255526245,"RSI":70.1947656417,"Price Target":140.8096,"Difference from MA":"8.65%","Difference from Open":"0.19%","Change from Yesterday":"0.39%","Change from Last Report":"0.20","Latest Volume":"2,115,173","Market Cap":"236,272,009,216","Earning Date":"16-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":26.318024,"PB Ratio":4.8405275,"Previous Close":135.28,"ROE":0.30649,"DTE":27.087,"Industry":"Medical Devices","Sector":"Healthcare","Beta":0.737,"Trailing PEG":null,"Trailing PE":17.636494,"Trailing PS":17.636494,"Quick Ratio":1.09,"Day High":136.89,"Day Low":135.455,"VS Average Volume":0.3068237979,"Company Summary":"Abbott Laboratories, together with its subsidiaries, discovers, develops, manufactures, and sells health care products worldwide. It operates in four segments: Established Pharmaceutical Products, Diagnostic Products, Nutritional Products, and Medical Devices. The company provides generic pharmaceuticals for the treatment of pancreatic exocrine insufficiency, irritable bowel syndrome or biliary spasm, intrahepatic cholestasis or depressive symptoms, gynecological disorder, hormone replacement therapy, dyslipidemia, hypertension, hypothyroidism, hypertriglyceridemia, Ménière's disease and vestibular vertigo, pain, fever, inflammation, and migraine, as well as provides anti-infective clarithromycin, influenza vaccine, and products to regulate physiological rhythm of the colon. It also offers laboratory and transfusion medicine systems in the areas of immunoassay, clinical chemistry, hematology, and transfusion serology testing; molecular diagnostics polymerase chain reaction instrument systems that automate the extraction, purification, and preparation of DNA and RNA from patient samples, and detect and measure infectious agents; point of care systems; cartridges for testing blood gas, chemistry, electrolytes, coagulation, and immunoassay; rapid diagnostics lateral flow testing products; molecular point-of-care testing for HIV, SARS-CoV-2, influenza A and B, RSV, and strep A; cardiometabolic test systems; and drug and alcohol test. In addition, the company provides pediatric and adult nutritional products and infant formula; rhythm management, electrophysiology, heart failure, vascular, and structural heart devices for the treatment of cardiovascular diseases; diabetes care products, such as glucose and blood glucose monitoring systems; and neuromodulation devices for the management of chronic pain and movement disorders. Abbott Laboratories was founded in 1888 and is based in North Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:29:01"},{"Company Name":"RTX Corporation","Symbol":"RTX","Current Price":"141.85","Latest MA":"125.13","Latest MA 5":140.4520007324,"Latest MA 9":139.4266689724,"Latest MA 20":136.7889698792,"RSI":71.6798146792,"Price Target":142.49783,"Difference from MA":"13.36%","Difference from Open":"1.13%","Change from Yesterday":"0.03%","Change from Last Report":"0.08","Latest Volume":"2,224,219","Market Cap":"189,504,503,808","Earning Date":"22-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":23.21604,"PB Ratio":3.0805483,"Previous Close":141.81,"ROE":0.07802,"DTE":67.798,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":0.617,"Trailing PEG":1.527,"Trailing PE":41.72059,"Trailing PS":41.72059,"Quick Ratio":0.605,"Day High":142.0583,"Day Low":140.1281,"VS Average Volume":0.4086083314,"Company Summary":"RTX Corporation, an aerospace and defense company, provides systems and services for the commercial, military, and government customers in the United States and internationally. It operates through three segments: Collins Aerospace, Pratt & Whitney, and Raytheon. The Collins Aerospace Systems segment offers aerospace and defense products, and aftermarket service solutions for civil and military aircraft manufacturers and commercial airlines, as well as regional, business, and general aviation, defense, and commercial space operations. This segment also designs, produces, and supports cabin interior, including seating, oxygen systems, food and beverage preparation, storage and galley systems, and lavatory and wastewater management systems; battlespace, test and training range systems, crew escape systems, and simulation and training solutions; information management services; and aftermarket services that include spare parts, overhaul and repair, engineering and technical support, training and fleet management solutions, and asset and information management services. The Pratt & Whitney segment supplies aircraft engines for commercial, military, business jet, and general aviation customers; and produces, sells, and services military and commercial auxiliary power units. The Raytheon segment provides defensive and offensive threat detection, tracking, and mitigation capabilities for government, and commercial customers. The company was formerly known as Raytheon Technologies Corporation and changed its name to RTX Corporation in July 2023. RTX Corporation was incorporated in 1934 and is headquartered in Arlington, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:29:01"},{"Company Name":"Verizon Communications Inc.","Symbol":"VZ","Current Price":"43.07","Latest MA":"41.60","Latest MA 5":43.6789607019,"Latest MA 9":43.65164497,"Latest MA 20":43.6492405646,"RSI":40.1837952537,"Price Target":48.06739,"Difference from MA":"3.54%","Difference from Open":"-1.84%","Change from Yesterday":"-1.52%","Change from Last Report":"0.31","Latest Volume":"9,990,061","Market Cap":"181,614,116,864","Earning Date":"21-07-2025","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":9.106723,"PB Ratio":1.8031228,"Previous Close":43.74,"ROE":0.18416001,"DTE":169.089,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.38,"Trailing PEG":2.1689,"Trailing PE":10.255905,"Trailing PS":10.255905,"Quick Ratio":0.471,"Day High":43.8899,"Day Low":42.912,"VS Average Volume":0.4853472189,"Company Summary":"Verizon Communications Inc., through its subsidiaries, engages in the provision of communications, technology, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide. It operates in two segments, Verizon Consumer Group (Consumer) and Verizon Business Group (Business). The Consumer segment provides wireless services across the wireless networks in the United States under the Verizon and TracFone brands and through wholesale and other arrangements; and fixed wireless access (FWA) broadband through its wireless networks, as well as related equipment and devices, such as smartphones, tablets, smart watches, and other wireless-enabled connected devices. The segment also offers wireline services in the Mid-Atlantic and Northeastern United States, as well as Washington D.C. through its fiber-optic network, Verizon Fios product portfolio, and a copper-based network. The Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and conferencing, corporate networking, security and managed network, local and long-distance voice, and network access services to deliver various IoT services and products to businesses, government customers, and wireless and wireline carriers in the United States and internationally. The company was formerly known as Bell Atlantic Corporation and changed its name to Verizon Communications Inc. in June 2000. Verizon Communications Inc. was incorporated in 1983 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:29:01"},{"Company Name":"Amgen Inc.","Symbol":"AMGN","Current Price":"295.62","Latest MA":"284.34","Latest MA 5":292.2329975586,"Latest MA 9":290.3683346897,"Latest MA 20":282.5182515259,"RSI":74.248038862,"Price Target":314.69678,"Difference from MA":"3.96%","Difference from Open":"0.48%","Change from Yesterday":"1.30%","Change from Last Report":"0.05","Latest Volume":"857,263","Market Cap":"158,953,947,136","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":14.301644,"PB Ratio":25.607676,"Previous Close":291.81,"ROE":1.0567299,"DTE":924.456,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.496,"Trailing PEG":0.9715,"Trailing PE":26.947582,"Trailing PS":26.947582,"Quick Ratio":0.736,"Day High":296.88,"Day Low":292.68,"VS Average Volume":0.2867758288,"Company Summary":"Amgen Inc. discovers, develops, manufactures, and delivers human therapeutics worldwide. The company's principal products include Enbrel for the treatment of rheumatoid arthritis, plaque psoriasis, and psoriatic arthritis; Otezla for the treatment of adult patients with plaque psoriasis, psoriatic arthritis, and oral ulcers associated with Behçet's disease; Prolia to treat postmenopausal women with osteoporosis; XGEVA for skeletal-related events prevention; Repatha, which reduces the risks of myocardial infarction, stroke, and coronary revascularization; Nplate for the treatment of patients with immune thrombocytopenia; KYPROLIS to treat patients with relapsed or refractory multiple myeloma; Aranesp to treat a lower-than-normal number of red blood cells and anemia; EVENITY for the treatment of osteoporosis in postmenopausal for men and women; Vectibix to treat patients with wild-type RAS metastatic colorectal cancer; BLINCYTO for the treatment of patients with acute lymphoblastic leukemia; TEPEZZA to treat thyroid eye disease; and KRYSTEXXA for the treatment of chronic refractory gout. It also markets other products, including Neulasta, MVASI, AMJEVITA\/AMGEVITA, TEZSPIRE, Parsabiv, Aimovig, LUMAKRAS\/LUMYKRAS, EPOGEN, KANJINTI, TAVNEOS, RAVICTI, UPLIZNA and PROCYSBI. The company serves healthcare providers, including physicians or their clinics, dialysis centers, hospitals, and pharmacies. It distributes its products through pharmaceutical wholesale distributors, as well as direct-to-consumer channels. The company has collaboration agreements with AstraZeneca plc for the development and commercialization of TEZSPIRE; Novartis Pharma AG to develop and commercialize Aimovig; UCB for the development and commercialization of EVENITY; Kyowa Kirin Co., Ltd. for rocatinlimab development and commercialization; and BeiGene, Ltd. for oncology products expansion and development. Amgen Inc. was incorporated in 1980 and is headquartered in Thousand Oaks, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:29:01"},{"Company Name":"Progressive Corporation (The)","Symbol":"PGR","Current Price":"265.80","Latest MA":"263.00","Latest MA 5":269.0276592676,"Latest MA 9":275.9442569119,"Latest MA 20":278.8989131079,"RSI":29.729059713,"Price Target":287.90118,"Difference from MA":"1.07%","Difference from Open":"0.93%","Change from Yesterday":"0.98%","Change from Last Report":"0.09","Latest Volume":"1,439,832","Market Cap":"155,817,345,024","Earning Date":"18-06-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":19.260746,"PB Ratio":5.3794436,"Previous Close":263.22,"ROE":0.34338,"DTE":23.81,"Industry":"Insurance - Property & Casualty","Sector":"Financial Services","Beta":0.4,"Trailing PEG":6.8016,"Trailing PE":17.935108,"Trailing PS":17.935108,"Quick Ratio":0.26,"Day High":266.34,"Day Low":262.93,"VS Average Volume":0.4384788126,"Company Summary":"The Progressive Corporation operates as an insurance company in the United States. The company writes insurance for personal autos and special lines products, including motorcycles, RVs, and watercraft; and personal residential property insurance for homeowners and renters. It also writes auto-related liability and physical damage insurance for comprising dump trucks, log trucks, garbage trucks, tractors, trailers, straight trucks, tow trucks and wreckers, vans, pick-up trucks, and autos; business-related general liability and commercial property insurance for small businesses; and workers' compensation insurance for the transportation industry. In addition, the company offers other specialty property-casualty insurance and provide related services; personal property reinsurance products; and involved in investment activities. It sells its products through independent insurance agencies, as well as online and over the phone. The Progressive Corporation was founded in 1937 and is headquartered in Mayfield Village, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:29:01"},{"Company Name":"Citigroup, Inc.","Symbol":"C","Current Price":"77.94","Latest MA":"72.01","Latest MA 5":78.1569992676,"Latest MA 9":77.3538886515,"Latest MA 20":76.0587494049,"RSI":68.3340716326,"Price Target":85.09524,"Difference from MA":"8.24%","Difference from Open":"0.19%","Change from Yesterday":"-0.55%","Change from Last Report":"0.16","Latest Volume":"3,248,961","Market Cap":"145,580,212,224","Earning Date":"15-07-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":10.840751,"PB Ratio":0.75019246,"Previous Close":78.38,"ROE":0.06435,"DTE":null,"Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.31,"Trailing PEG":1.1591,"Trailing PE":12.313586,"Trailing PS":12.313586,"Quick Ratio":null,"Day High":78.205,"Day Low":77.34,"VS Average Volume":0.205936167,"Company Summary":"Citigroup Inc., a diversified financial service holding company, provides various financial product and services to consumers, corporations, governments, and institutions. It operates through five segments: Services, Markets, Banking, U.S. Personal Banking, and Wealth. The Services segment includes treasury and trade solutions, which provides cash management, trade, and working capital solutions to multinational corporations, financial institutions, and public sector organizations; and securities services, such as cross-border support for clients, local market expertise, post-trade technologies, data solutions, and various securities services solutions. The Markets segment offers sales and trading services for equities, foreign exchange, rates, spread products, and commodities to corporate, institutional, and public sector clients; and market-making services, including asset classes, risk management solutions, financing, and prime brokerage. The Banking segment includes investment banking services comprising equity and debt capital markets-related strategic financing solutions; advisory services related to mergers and acquisitions, divestitures, restructurings, and corporate defense activities; and corporate lending consists of corporate and commercial banking. The U.S. Personal Banking segment provides proprietary and co-branded card portfolios; and traditional banking services to retail and small business customers. The Wealth segment offers financial services to high-net-worth clients through banking, lending, mortgages, investment, custody, and trust product offerings; professional industries, including law firms, consulting groups, accounting, and asset management; and affluent and high net worth clients. The company operates in North America, the United Kingdom, Japan, North and South Asia, Australia, Europe, the Middle East, and Africa. Citigroup Inc. was founded in 1812 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:29:01"},{"Company Name":"Vertex Pharmaceuticals Incorpor","Symbol":"VRTX","Current Price":"458.68","Latest MA":"463.08","Latest MA 5":451.8569970703,"Latest MA 9":448.9850002713,"Latest MA 20":444.3662496948,"RSI":67.5704718402,"Price Target":500.1232,"Difference from MA":"-0.95%","Difference from Open":"1.21%","Change from Yesterday":"1.38%","Change from Last Report":"0.16","Latest Volume":"337,764","Market Cap":"117,786,353,664","Earning Date":"05-05-2025","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":24.4366,"PB Ratio":7.1449156,"Previous Close":452.44,"ROE":-0.05644,"DTE":9.997,"Industry":"Biotechnology","Sector":"Healthcare","Beta":0.418,"Trailing PEG":2.695,"Trailing PE":null,"Trailing PS":null,"Quick Ratio":2.116,"Day High":458.91,"Day Low":451.94,"VS Average Volume":0.1969406229,"Company Summary":"Vertex Pharmaceuticals Incorporated, a biotechnology company, engages in developing and commercializing therapies for treating cystic fibrosis (CF). It markets TRIKAFTA\/KAFTRIO for people with CF with at least one F508del mutation for 2 years of age and older; ALYFTREK for the treatment for people with CF 6 years of age and older; SYMDEKO\/SYMKEVI for treatment of patients with CF 6 years of age and older; ORKAMBI for CF patients 1 year or older; and KALYDECO for the treatment of patients with 1 month or older who have CF with ivacaftor. The company also develops CASGEVY for the treatment of sickle cell disease and transfusion-dependent beta thalassemia; JOURNAVX for the treatment of acute pain in adults; VX-522, a CFTR mRNA therapeutic designed to treat the underlying cause of CF, which is in Phase 1\/2 clinical trial; inaxaplin for the treatment of APOL1-mediated kidney disease which is in single Phase 2; VX-880 and VX-264, treatment for Type 1 Diabetes; VX-670 for the treatment of myotonic dystrophy type 1; and VX-407, a small molecule corrector for the treatment of autosomal dominant polycystic kidney disease. Further, it sells the products to specialty pharmacy and specialty distributors in the United States, as well as retail pharmacies, hospitals, and clinics. Additionally, the company has collaborations with CRISPR Therapeutics AG.; Moderna, Inc.; and Entrada Therapeutics, Inc. Vertex Pharmaceuticals Incorporated was founded in 1989 and is headquartered in Boston, Massachusetts.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:29:01"},{"Company Name":"Chubb Limited","Symbol":"CB","Current Price":"287.24","Latest MA":"281.53","Latest MA 5":288.5439960938,"Latest MA 9":291.3733294,"Latest MA 20":291.4484974976,"RSI":41.1979444419,"Price Target":304.061,"Difference from MA":"2.03%","Difference from Open":"0.86%","Change from Yesterday":"0.57%","Change from Last Report":"0.01","Latest Volume":"469,013","Market Cap":"115,110,854,656","Earning Date":"22-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":12.166031,"PB Ratio":1.7513779,"Previous Close":285.61,"ROE":0.12855,"DTE":29.874,"Industry":"Insurance - Property & Casualty","Sector":"Financial Services","Beta":0.555,"Trailing PEG":2.4413,"Trailing PE":13.836223,"Trailing PS":13.836223,"Quick Ratio":0.177,"Day High":287.3158,"Day Low":284.785,"VS Average Volume":0.2686146512,"Company Summary":"Chubb Limited provides insurance and reinsurance products worldwide. The company operates through six segments: North America Commercial P&C Insurance, North America Personal P&C Insurance, North America Agricultural Insurance, Overseas General Insurance, Global Reinsurance, and Life Insurance. The company provides package policies, property and general liability, workers' compensation, automobile, umbrella, financial lines, professional and management liability, environmental, international coverages, property and casualty, commercial marine, and risk management products and services. It also offers homeowners, automobile and collector cars, valuable articles, personal and excess liability, travel insurance, cyber, and recreational marine insurance and services. In addition, the company provides multiple peril crop insurance and crop-hail insurance for farm, ranch, and specialty property and casualty, and commercial agriculture products; and property insurance products, including traditional commercial fire coverage, as well as energy industry-related, construction, and other technical coverages; personal accident and supplemental medical coverages, such as accidental death, business\/holiday travel, specified disease, disability, medical and hospital indemnity, and income protection; and professional indemnity, cyber, surety, aviation, political risk, and specialty personal lines products. Further, the company offers property catastrophe reinsurance, traditional and specialty P&C reinsurance; and protection and savings products, which includes whole life, universal life, unit linked contracts, endowment plans, individual and group term life, dental, critical illness, dementia, hospital cash, personal accident, credit life, and group employee benefits. The company was formerly known as ACE Limited and changed its name to Chubb Limited in January 2016. Chubb Limited was incorporated in 1985 and is headquartered in Zurich, Switzerland.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"12-06-2025 20:29:01"},{"Company Name":"Medtronic plc.","Symbol":"MDT","Current Price":"87.83","Latest MA":"85.85","Latest MA 5":87.7469992065,"Latest MA 9":86.734999254,"Latest MA 20":85.0157506561,"RSI":72.703406795,"Price Target":95.43037,"Difference from MA":"2.29%","Difference from Open":"-0.23%","Change from Yesterday":"-0.27%","Change from Last Report":"0.02","Latest Volume":"2,028,466","Market Cap":"112,585,498,624","Earning Date":"19-08-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":15.01282,"PB Ratio":2.3443754,"Previous Close":88.06,"ROE":0.09508,"DTE":59.093,"Industry":"Medical Devices","Sector":"Healthcare","Beta":0.815,"Trailing PEG":2.5249,"Trailing PE":24.328255,"Trailing PS":24.328255,"Quick Ratio":1.202,"Day High":88.27,"Day Low":87.65,"VS Average Volume":0.2540168139,"Company Summary":"Medtronic plc develops, manufactures, and sells device-based medical therapies to healthcare systems, physicians, clinicians, and patients worldwide. The Cardiovascular Portfolio segment offers implantable cardiac pacemakers, cardioverter defibrillators, and cardiac resynchronization therapy devices; cardiac ablation products; insertable cardiac monitor systems; TYRX products; and remote monitoring and patient-centered software. It also provides aortic valves, surgical valve replacement and repair products, endovascular stent grafts and accessories, and transcatheter pulmonary valves; and percutaneous coronary intervention products, percutaneous angioplasty balloons, and other products. The Neuroscience Portfolio segment offers medical devices and implants, biologic solutions, spinal cord stimulation and brain modulation systems, implantable drug infusion systems, and interventional products, as well as nerve ablation system under the Accurian name. The segment offers its products for spinal surgeons, neurosurgeons, neurologists, pain management specialists, anesthesiologists, orthopedic surgeons, urologists, urogynecologists, and interventional radiologists, as well as ear, nose, and throat specialists; and energy surgical instruments. The Medical Surgical Portfolio segment offers surgical stapling devices, vessel sealing instruments, wound closure and electrosurgery products, AI-powered surgical video and analytics platform, robotic-assisted surgery products, hernia mechanical devices, mesh implants, gynecology products, gastrointestinal and hepatologic diagnostics and therapies, and therapies to treat other non-exclusive diseases and conditions; and patient monitoring and airway management products. The Diabetes Operating Unit segment provides insulin pumps and consumables, continuous glucose monitoring systems, and InPen, a smart insulin pen system. The company was founded in 1949 and is headquartered in Galway, Ireland.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:29:01"},{"Company Name":"Coinbase Global, Inc.","Symbol":"COIN","Current Price":"244.58","Latest MA":"247.04","Latest MA 5":251.6195008545,"Latest MA 9":251.5475006782,"Latest MA 20":255.5223739929,"RSI":42.8540612861,"Price Target":260.29715,"Difference from MA":"-1.00%","Difference from Open":"-0.88%","Change from Yesterday":"-2.43%","Change from Last Report":"0.15","Latest Volume":"3,903,479","Market Cap":"62,295,109,632","Earning Date":"08-05-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":68.5091,"PB Ratio":5.948186,"Previous Close":250.68,"ROE":0.15841,"DTE":43.892,"Industry":"Financial Data & Stock Exchanges","Sector":"Financial Services","Beta":3.62,"Trailing PEG":70.976,"Trailing PE":46.05979,"Trailing PS":46.05979,"Quick Ratio":1.197,"Day High":247.7125,"Day Low":242.65,"VS Average Volume":0.3741731434,"Company Summary":"Coinbase Global, Inc. operates platform for crypto assets in the United States and internationally. It offers the primary financial account in the crypto economy for consumers; a brokerage platform with a pool of liquidity across the crypto marketplace for institutions; and a suite of products granting access to build onchain for developers. The company was founded in 2012 and is based in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:29:01"},{"Company Name":"Axon Enterprise, Inc.","Symbol":"AXON","Current Price":"778.12","Latest MA":"617.49","Latest MA 5":778.956984375,"Latest MA 9":775.6427690972,"Latest MA 20":754.7827458496,"RSI":62.1499696117,"Price Target":721.31573,"Difference from MA":"26.01%","Difference from Open":"0.64%","Change from Yesterday":"-0.03%","Change from Last Report":"-0.05","Latest Volume":"108,765","Market Cap":"60,576,874,496","Earning Date":"07-05-2025","Earning Time":"Before","Earning Day of Week":"Saturday","PE Ratio":125.50242,"PB Ratio":23.700617,"Previous Close":778.36,"ROE":0.15166001,"DTE":80.08,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.285,"Trailing PEG":null,"Trailing PE":188.40556,"Trailing PS":188.40556,"Quick Ratio":2.5,"Day High":781.0,"Day Low":773.16,"VS Average Volume":0.176623617,"Company Summary":"Axon Enterprise, Inc. develops, manufactures, and sells conducted energy devices (CEDs) under the TASER brand in the United States and internationally. It operates through two segments, Software and Sensors, and TASER. The company also offers hardware and cloud-based software solutions that enable law enforcement to capture, securely store, manage, share, and analyze video and other digital evidence. Its products include axon officer safety plan; taser 10, taser7, taser X26P, taser X2, taser 7 CQ, and civilian series; cameras, such as axon body, axon flex, axon fleet, axon air, axon signal sidearm, axon signal vehicle, axon interview, and axon interview portable kit; software, including axon records, evidence, standards, commander, performance, auto-transcribe, justice, investigate, respond, and justice, my90, and redaction assistant; mobile applications, and training services, as well as hardware extended warranties; and Axon docks, cartridges, and batteries. The company sells its products through its direct sales, distribution partners, online store, and third-party resellers. Axon Enterprise, Inc. has a strategic partnership with Fusus, Inc. to expand bility to aggregate live video, data, and sensor feeds. It serves law enforcement, federal, correction, fire, EMS, campus, justice healthcare, retail, private security, and personal safety industries. The company was formerly known as TASER International, Inc. and changed its name to Axon Enterprise, Inc. in April 2017. Axon Enterprise, Inc. was incorporated in 1993 and is headquartered in Scottsdale, Arizona.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:29:01"},{"Company Name":"FedEx Corporation","Symbol":"FDX","Current Price":"225.47","Latest MA":"250.91","Latest MA 5":223.844,"Latest MA 9":221.389999254,"Latest MA 20":221.3944983826,"RSI":60.0771222956,"Price Target":275.13257,"Difference from MA":"-10.14%","Difference from Open":"0.67%","Change from Yesterday":"0.66%","Change from Last Report":"0.04","Latest Volume":"721,729","Market Cap":"54,022,389,760","Earning Date":"25-06-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":9.910769,"PB Ratio":2.0260956,"Previous Close":224.0,"ROE":0.14762,"DTE":null,"Industry":"Integrated Freight & Logistics","Sector":"Industrials","Beta":1.362,"Trailing PEG":0.9279,"Trailing PE":14.198362,"Trailing PS":14.198362,"Quick Ratio":1.111,"Day High":225.75,"Day Low":222.29,"VS Average Volume":0.3547580497,"Company Summary":"FedEx Corporation, together with its subsidiaries, provides transportation, e-commerce, and business services in the United States and internationally. It operates through FedEx Express, FedEx Ground, FedEx Freight, and FedEx Services segments. The FedEx Express segment offers express transportation, small-package ground delivery, and freight transportation services; and time-critical transportation services. The FedEx Ground segment provides small-package ground delivery services. The FedEx Freight segment offers less-than-truckload freight transportation services. The FedEx Services segment provides sales, marketing, information technology, communications, customer service, technical support, billing and collection, and back-office support services. In addition, the company offers supply chain management solutions; and air and ocean freight forwarding and cargo transportation, specialty transportation, customs brokerage, third party logistics and supply chain, and document and business solutions, as well as provides trade management tools and data. The company was founded in 1971 and is headquartered in Memphis, Tennessee.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:29:01"},{"Company Name":"Quanta Services, Inc.","Symbol":"PWR","Current Price":"358.65","Latest MA":"307.10","Latest MA 5":356.0400036621,"Latest MA 9":355.6566643609,"Latest MA 20":347.4064974976,"RSI":64.3858607391,"Price Target":350.0448,"Difference from MA":"16.79%","Difference from Open":"0.86%","Change from Yesterday":"0.81%","Change from Last Report":"0.01","Latest Volume":"439,172","Market Cap":"53,151,571,968","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":35.300198,"PB Ratio":7.1312113,"Previous Close":355.78,"ROE":0.13731,"DTE":63.537,"Industry":"Engineering & Construction","Sector":"Industrials","Beta":1.072,"Trailing PEG":2.2087,"Trailing PE":57.940224,"Trailing PS":57.940224,"Quick Ratio":1.181,"Day High":360.73,"Day Low":354.25,"VS Average Volume":0.3329792549,"Company Summary":"Quanta Services, Inc. offers infrastructure solutions for the electric and gas utility, renewable energy, communications, pipeline, and energy industries in the United States, Canada, Australia, and internationally. The company's Electric Power Infrastructure Solutions segment engages in the design, procurement, construction, upgrade, repair, and maintenance of electric power transmission and distribution infrastructure and substation facilities; installation, maintenance, and upgrade of electric power infrastructure projects; installation of smart grid technologies on electric power networks; and design, installation, maintenance, and repair of commercial and industrial wirings. This segment offers aviation; emergency restoration; and other engineering and technical services; design and construction solutions to wireline and wireless communications, cable multi-system operators, and other customers; and training for electric workers, as well as training for the gas distribution and communications industries. Its Renewable Energy Infrastructure Solutions segment is involved in engineering, procurement, construction, repair, and maintenance of wind, solar, and hydropower generation facilities, as well as battery storage facilities; and engineering and construction services for substations and switchyards, transmission, and other electrical infrastructures. The company's Underground Utility and Infrastructure Solutions segment offers design, engineering, procurement, construction, upgrade, repair, and maintenance services for natural gas systems for gas utility customers; fabrication services for pipeline support systems and structures and facilities; and engineering and construction services for pipeline and storage systems, and compressor and pump stations. The company was formerly known as Fabal Construction, Inc. and changed its name to Quanta Services, Inc. in November 1997. The company was incorporated in 1997 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:29:01"},{"Company Name":"General Motors Company","Symbol":"GM","Current Price":"49.19","Latest MA":"49.63","Latest MA 5":48.6770001526,"Latest MA 9":48.2718355984,"Latest MA 20":48.8105572968,"RSI":56.1936379784,"Price Target":54.15407,"Difference from MA":"-0.89%","Difference from Open":"-0.56%","Change from Yesterday":"-1.37%","Change from Last Report":"-0.10","Latest Volume":"3,656,577","Market Cap":"47,288,180,736","Earning Date":"22-07-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":4.653264,"PB Ratio":0.7380924,"Previous Close":49.87,"ROE":0.08557,"DTE":201.974,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":1.344,"Trailing PEG":1.5547,"Trailing PE":6.869414,"Trailing PS":6.869414,"Quick Ratio":0.958,"Day High":49.54,"Day Low":48.6,"VS Average Volume":0.2729449781,"Company Summary":"General Motors Company designs, builds, and sells trucks, crossovers, cars, and automobile parts worldwide. The company operates through GM North America, GM International, Cruise, and GM Financial segments. It markets its vehicles primarily under the Buick, Cadillac, Chevrolet, GMC, Baojun, and Wuling brand names. In addition, the company sells trucks, crossovers, cars, and automobile parts through retail dealers, distributors and dealers, as well as to fleet customers, including daily rental car companies, commercial fleet customers, leasing companies, and governments. Further, it offers software-enabled services and subscriptions; and various range of after-sale services through dealer network, such as maintenance, light repairs, collision repairs, vehicle accessories, and extended service warranties. Additionally, the company provides automotive financing; and software-enabled services and subscriptions. General Motors Company was founded in 1908 and is headquartered in Detroit, Michigan.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:29:01"},{"Company Name":"Edwards Lifesciences Corporatio","Symbol":"EW","Current Price":"76.02","Latest MA":"72.43","Latest MA 5":76.2340003052,"Latest MA 9":76.9566662598,"Latest MA 20":76.9035001526,"RSI":41.9198682194,"Price Target":80.86793,"Difference from MA":"4.96%","Difference from Open":"0.98%","Change from Yesterday":"0.73%","Change from Last Report":"-0.24","Latest Volume":"1,116,854","Market Cap":"44,593,328,128","Earning Date":"23-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":31.02857,"PB Ratio":4.39956,"Previous Close":75.47,"ROE":0.16511999,"DTE":6.863,"Industry":"Medical Devices","Sector":"Healthcare","Beta":1.123,"Trailing PEG":4.2082,"Trailing PE":31.413221,"Trailing PS":31.413221,"Quick Ratio":3.334,"Day High":76.62,"Day Low":75.26,"VS Average Volume":0.2382091327,"Company Summary":"Edwards Lifesciences Corporation provides products and technologies to treat advanced cardiovascular diseases in the United States, Europe, Japan, and internationally. The company offers transcatheter heart valve replacement products for minimally invasive replacement of aortic heart valves under the Edwards SAPIEN family of valves system; and transcatheter heart valve repair and replacement products to treat mitral and tricuspid valve diseases under the PASCAL PRECISION and Cardioband brands. It also provides surgical structural heart solutions, such as aortic surgical valve under the INSPIRIS brand name; INSPIRIS RESILIA aortic valve, which offers RESILIA tissue and VFit technology; KONECT RESILIA, a pre-assembled tissue valve conduit for complex combined procedures; and MITRIS RESILIA valve. The company distributes its products through a direct sales force and independent distributors. Edwards Lifesciences Corporation was founded in 1958 and is headquartered in Irvine, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:29:01"},{"Company Name":"Cummins Inc.","Symbol":"CMI","Current Price":"323.50","Latest MA":"337.32","Latest MA 5":325.2639953613,"Latest MA 9":323.7755499946,"Latest MA 20":324.7721237183,"RSI":50.618529839,"Price Target":353.2574,"Difference from MA":"-4.10%","Difference from Open":"0.65%","Change from Yesterday":"-0.02%","Change from Last Report":"-0.17","Latest Volume":"214,125","Market Cap":"44,563,746,816","Earning Date":"05-05-2025","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":14.365008,"PB Ratio":4.079445,"Previous Close":323.58,"ROE":0.26187,"DTE":67.789,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":1.028,"Trailing PEG":2.5906,"Trailing PE":15.943814,"Trailing PS":15.943814,"Quick Ratio":0.677,"Day High":324.28,"Day Low":319.375,"VS Average Volume":0.2456085816,"Company Summary":"Cummins Inc. offers various power solutions worldwide. It operates through five segments: Engine, Distribution, Components, Power Systems, and Accelera. The company offers diesel and natural gas-powered engines; and drivetrain systems, including axles, drivelines, brakes, and suspension systems; truck, trailer, on- and off-highway, and other products. It also provides aftertreatment technology and solutions comprising custom engineering systems and integrated controls, oxidation catalysts, particulate filters, and selective catalytic reduction systems, as well as engineered components, including dosers; turbochargers, fuel systems, and valvetrain technologies; electronic control modules, sensors, and supporting software; and automated manual transmissions, dual-clutch transmissions, and automatic transmissions for internal combustion engines. In addition, the company sells and offers support services power generation systems, high-horsepower engines, and heavy-duty and medium-duty engines; offers application engineering services, custom-designed assemblies, and inshop and field-based repair services; and retails and wholesales aftermarket parts. Further, it offers standby and prime power generators, controls, paralleling systems, and transfer switches; turnkey solutions for distributed generation and energy management applications using natural gas, diesel, and newer alternative sustainable fuels; diesel and natural gas high-speed, high-horsepower engines; and A\/C generator\/alternator products. Additionally, the company provides electrified power systems, including batteries, fuel cells, and electric powertrain technologies, as well as hydrogen production technologies. It sells its products to original equipment manufacturers, distributors, dealers, and other customers. The company was formerly known as Cummins Engine Company and changed its name to Cummins Inc. in 2001. Cummins Inc. was founded in 1919 and is headquartered in Columbus, Indiana.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:29:01"},{"Company Name":"Occidental Petroleum Corporatio","Symbol":"OXY","Current Price":"44.63","Latest MA":"45.96","Latest MA 5":43.7377772827,"Latest MA 9":42.8463535055,"Latest MA 20":42.108448494,"RSI":73.4831294119,"Price Target":49.53962,"Difference from MA":"-2.88%","Difference from Open":"0.38%","Change from Yesterday":"-0.46%","Change from Last Report":"-0.13","Latest Volume":"5,049,076","Market Cap":"43,926,773,760","Earning Date":"07-05-2025","Earning Time":"Before","Earning Day of Week":"Saturday","PE Ratio":14.124999,"PB Ratio":1.5912088,"Previous Close":44.84,"ROE":0.0949,"DTE":74.026,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":0.853,"Trailing PEG":1.3342,"Trailing PE":18.070848,"Trailing PS":18.070848,"Quick Ratio":0.715,"Day High":44.7199,"Day Low":44.0536,"VS Average Volume":0.4144521704,"Company Summary":"Occidental Petroleum Corporation, together with its subsidiaries, engages in the acquisition, exploration, and development of oil and gas properties in the United States and internationally. It operates through three segments: Oil and Gas, Chemical, and Midstream and Marketing. The Oil and Gas segment explores for, develops, and produces oil and condensate, natural gas liquids (NGLs), and natural gas. The Chemical segment manufactures and markets basic chemicals, including chlorine, caustic soda, chlorinated organics, potassium chemicals, ethylene dichloride, chlorinated isocyanurates, sodium silicates, and calcium chloride; and vinyls comprising vinyl chloride monomer, polyvinyl chloride, and ethylene. The Midstream and Marketing segment purchases, markets, gathers, processes, transports and stores oil, condensate, NGLs, natural gas, carbon dioxide, and power. This segment invests in entities. Occidental Petroleum Corporation was founded in 1920 and is headquartered in Houston, Texas.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:29:01"},{"Company Name":"Verisk Analytics, Inc.","Symbol":"VRSK","Current Price":"310.66","Latest MA":"291.52","Latest MA 5":313.4599968262,"Latest MA 9":315.9688852268,"Latest MA 20":314.4559980469,"RSI":37.1105904262,"Price Target":306.31647,"Difference from MA":"6.56%","Difference from Open":"-0.49%","Change from Yesterday":"-0.27%","Change from Last Report":"-0.06","Latest Volume":"159,252","Market Cap":"43,456,364,544","Earning Date":"07-05-2025","Earning Time":"Before","Earning Day of Week":"Saturday","PE Ratio":42.61454,"PB Ratio":353.42435,"Previous Close":311.49,"ROE":4.68222,"DTE":3178.837,"Industry":"Consulting Services","Sector":"Industrials","Beta":0.878,"Trailing PEG":4.2023,"Trailing PE":45.75258,"Trailing PS":45.75258,"Quick Ratio":1.2,"Day High":312.53,"Day Low":309.95,"VS Average Volume":0.1800411744,"Company Summary":"Verisk Analytics, Inc. engages in the provision of data analytics and technology solutions to the insurance industry in the United States and internationally. The company offers underwriting solutions, including forms, rules, and loss costs services that provides policy language, prospective loss costs, policy writing and rating rules, and underwriting solutions for risk selection and segmentation, pricing, and workflow optimization; underwriting data and analytics solutions, which provides property and auto specific rating, and underwriting information solutions; extreme event solutions, including catastrophe modeling solutions; life insurance solutions for transforming current workflows in life insurance underwriting, claim insights, policy administration, unclaimed property\/equity, compliance and fraud detection, and actuarial and portfolio modeling; specialty business solutions, which provides full end-to-end management of insurance and reinsurance business; marketing solutions, such as compliant, real-time decisioning, profitability, and risk assessment for inbound consumer interactions; and international underwriting solutions. It also provides claims insurance solutions, including property estimating solutions, provide data, analytics, and networking solutions for professionals involved in estimating all phases of building repair and reconstruction; anti-fraud solutions that provide fraud-detection tools for the property and casualty insurance industry; casualty solutions, which focus on compliance, casualty claims decision, and workflow automation; and international claims solutions, which focus on personal injury and motor franchises with complementary offerings to the property claims sector. The company was founded in 1971 and is headquartered in Jersey City, New Jersey.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"12-06-2025 20:29:01"},{"Company Name":"Kroger Company (The)","Symbol":"KR","Current Price":"64.82","Latest MA":"64.00","Latest MA 5":65.3020004883,"Latest MA 9":66.0411106025,"Latest MA 20":67.2709995422,"RSI":25.5738445111,"Price Target":70.68636,"Difference from MA":"1.27%","Difference from Open":"-0.51%","Change from Yesterday":"0.29%","Change from Last Report":"0.12","Latest Volume":"2,408,421","Market Cap":"43,160,592,384","Earning Date":"20-06-2025","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":14.152839,"PB Ratio":5.253688,"Previous Close":64.62,"ROE":0.26879,"DTE":229.201,"Industry":"Grocery Stores","Sector":"Consumer Defensive","Beta":0.574,"Trailing PEG":1.5646,"Trailing PE":17.662125,"Trailing PS":17.662125,"Quick Ratio":0.386,"Day High":65.279,"Day Low":64.47,"VS Average Volume":0.3110113644,"Company Summary":"The Kroger Co. operates as a food and drug retailer in the United States. The company operates combination food and drug stores, multi-department stores, marketplace stores, and price impact warehouses. Its combination food and drug stores offer natural food and organic sections, pharmacies, general merchandise, pet centers, fresh seafood, and organic produce; and its multi-department stores provide apparel, home fashion and furnishings, outdoor living, electronics, automotive products, and toys. The company's marketplace stores offer full-service grocery, pharmacy, health and beauty care, and perishable goods, as well as general merchandise, including apparel, home goods, and toys; and its price impact warehouse stores provide grocery, and health and beauty care items, as well as meat, dairy, baked goods, and fresh produce items. It also manufactures and processes food products for sale in its supermarkets and online; and sells fuel through its fuel centers. The company sells its products through its stores, fuel centers, and online platforms. The Kroger Co. was founded in 1883 and is based in Cincinnati, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:29:01"},{"Company Name":"Kenvue Inc.","Symbol":"KVUE","Current Price":"22.06","Latest MA":"22.38","Latest MA 5":21.6919999237,"Latest MA 9":21.9633331892,"Latest MA 20":23.0009998589,"RSI":42.45490864,"Price Target":24.53667,"Difference from MA":"-1.45%","Difference from Open":"1.43%","Change from Yesterday":"0.96%","Change from Last Report":"0.14","Latest Volume":"16,155,877","Market Cap":"42,353,213,440","Earning Date":"08-05-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":18.081966,"PB Ratio":4.210727,"Previous Close":21.85,"ROE":0.10216,"DTE":88.043,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":0.925,"Trailing PEG":1.0177,"Trailing PE":39.392857,"Trailing PS":39.392857,"Quick Ratio":0.505,"Day High":22.14,"Day Low":21.67,"VS Average Volume":0.8833290869,"Company Summary":"Kenvue Inc. operates as a consumer health company in the United States, Europe, the Middle East, Africa, Asia-Pacific, and Latin America. It operates through three segments: Self Care, Skin Health and Beauty, and Essential Health. The Self Care segment offers cough, cold and allergy, pain care, digestive health, smoking cessation, eye care, and other products under the Tylenol, Motrin, Benadryl, Nicorette, Zarbee's, ORSLTM, Rhinocort, Calpol, and Zyrtec brands. Its Skin Health and Beauty segment provides face and body care, hair, sun, and other care products under the Neutrogena, Aveeno, Dr.Ci:Labo, Le Petit Marseillais, Lubriderm, Rogaine, and OGX brand names. The Essential Health segment offers oral and baby, women's health, wound, and other care products under the Listerine, Johnson's, Band-Aid, and Stayfree, o.b., tampons, Carefree, and Desitin Diaper Rash brands. Kenvue Inc. was incorporated in 2022 and is headquartered in Summit, New Jersey.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:29:01"},{"Company Name":"General Mills, Inc.","Symbol":"GIS","Current Price":"54.37","Latest MA":"59.25","Latest MA 5":54.5339998474,"Latest MA 9":54.474444614,"Latest MA 20":54.2625004349,"RSI":48.7330004032,"Price Target":60.77773,"Difference from MA":"-8.23%","Difference from Open":"0.06%","Change from Yesterday":"0.22%","Change from Last Report":"0.11","Latest Volume":"1,782,235","Market Cap":"29,773,066,240","Earning Date":"25-06-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":11.568086,"PB Ratio":3.2135468,"Previous Close":54.23,"ROE":0.26834,"DTE":149.142,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.017,"Trailing PEG":3.5317,"Trailing PE":11.94945,"Trailing PS":11.94945,"Quick Ratio":0.294,"Day High":54.45,"Day Low":53.61,"VS Average Volume":0.3157340984,"Company Summary":"General Mills, Inc. manufactures and markets branded consumer foods worldwide. The company operates through four segments: North America Retail; International; Pet; and North America Foodservice. It offers grain, ready-to-eat cereals, refrigerated yogurt, soup, meal kits, refrigerated and frozen dough products, dessert and baking mixes, bakery flour, frozen pizza and pizza snacks, snack bars, fruit and savory snacks, ice cream and frozen desserts, unbaked and fully baked frozen dough products, frozen hot snacks, ethnic meals, side dish mixes, frozen breakfast and entrees, nutrition bars, and frozen and shelf-stable vegetables. The company also manufactures and markets pet food products, including dog and cat food; and operates ice cream parlors. It markets its products under the Annie's, Betty Crocker, Bisquick, Blue Buffalo, Bugles, Cascadian Farm, Cheerios, Chex, Cinnamon Toast Crunch, Cocoa Puffs, Cookie Crisp, Dunkaroos, Edgard & Cooper, Fiber One, Fruit by the Foot, Fruit Gushers, Fruit Roll-Ups, Gardetto's, Gold Medal, Golden Grahams, Häagen-Dazs, Kitano, Kix, Lärabar, Latina, Lucky Charms, Muir Glen, Nature Valley, Nudges, Oatmeal Crisp, Old El Paso, Pillsbury, Progresso, Tastefuls, Total, Totino's , Trix, True Chews, True Solutions, Wanchai Ferry, Wheaties, Wilderness, and Yoki brands. The company sells its products to grocery stores, mass merchandisers, membership stores, natural food chains, drug, dollar and discount chains, e-commerce retailers, commercial and noncommercial foodservice distributors and operators, restaurants, convenience stores, and pet specialty stores. General Mills, Inc. was founded in 1866 and is headquartered in Minneapolis, Minnesota.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"lululemon athletica inc.","Symbol":"LULU","Current Price":"247.25","Latest MA":"334.62","Latest MA 5":256.4686992676,"Latest MA 9":289.5748348253,"Latest MA 20":305.8466776855,"RSI":17.629428611,"Price Target":303.1209,"Difference from MA":"-26.11%","Difference from Open":"-1.76%","Change from Yesterday":"-1.99%","Change from Last Report":"-0.11","Latest Volume":"2,528,989","Market Cap":"29,633,579,008","Earning Date":"05-06-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":16.56085,"PB Ratio":6.9183106,"Previous Close":252.28,"ROE":0.42488998,"DTE":39.789,"Industry":"Apparel Retail","Sector":"Consumer Cyclical","Beta":1.262,"Trailing PEG":1.0715,"Trailing PE":16.80853,"Trailing PS":16.80853,"Quick Ratio":0.933,"Day High":251.8,"Day Low":246.56,"VS Average Volume":0.8955625726,"Company Summary":"lululemon athletica inc., together with its subsidiaries, designs, distributes, and retails technical athletic apparel, footwear, and accessories for women and men under the lululemon brand in the United States, Canada, Mexico, China Mainland, Hong Kong, Taiwan, Macau, and internationally. The company offers pants, shorts, tops, and jackets for athletic activities, such as yoga, running, training, and other activities. It also provides fitness-inspired accessories. The company sells its products through company-operated stores; seasonal stores, pop-ups, university campus retailers, and yoga and fitness studios; outlets; Like New, a re-commerce program; and its e-commerce website. lululemon athletica inc. was founded in 1998 and is based in Vancouver, Canada.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"Las Vegas Sands Corp.","Symbol":"LVS","Current Price":"41.51","Latest MA":"43.72","Latest MA 5":41.5920009155,"Latest MA 9":41.4233336724,"Latest MA 20":41.2730002289,"RSI":52.796557053,"Price Target":51.39471,"Difference from MA":"-5.05%","Difference from Open":"-0.02%","Change from Yesterday":"-0.79%","Change from Last Report":"-0.07","Latest Volume":"935,778","Market Cap":"29,332,125,696","Earning Date":"23-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":15.094544,"PB Ratio":10.872184,"Previous Close":41.84,"ROE":0.44687,"DTE":456.677,"Industry":"Resorts & Casinos","Sector":"Consumer Cyclical","Beta":1.022,"Trailing PEG":1.0691,"Trailing PE":23.189943,"Trailing PS":23.189943,"Quick Ratio":0.555,"Day High":41.84,"Day Low":40.91,"VS Average Volume":0.1462807045,"Company Summary":"Las Vegas Sands Corp., together with its subsidiaries, owns, develops, and operates integrated resorts in Macao and Singapore. The company owns and operates The Venetian Macao Resort Hotel, The Londoner Macao, The Parisian Macao, The Plaza Macao and Four Seasons Hotel Macao, and The Sands Macao in Macao, the People's Republic of China; and Marina Bay Sands in Singapore. Its integrated resorts feature accommodations, gaming, entertainment and retail malls, convention and exhibition facilities, celebrity chef restaurants, and other amenities. The company was founded in 1988 and is based in Las Vegas, Nevada.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"DuPont de Nemours, Inc.","Symbol":"DD","Current Price":"68.63","Latest MA":"74.02","Latest MA 5":68.9780004272,"Latest MA 9":68.1966674466,"Latest MA 20":68.0883458557,"RSI":53.1755653129,"Price Target":85.07053,"Difference from MA":"-7.28%","Difference from Open":"-0.33%","Change from Yesterday":"-1.11%","Change from Last Report":"-0.16","Latest Volume":"547,490","Market Cap":"28,721,586,176","Earning Date":"02-05-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":15.633257,"PB Ratio":1.257835,"Previous Close":69.4,"ROE":0.00199,"DTE":33.114,"Industry":"Specialty Chemicals","Sector":"Basic Materials","Beta":1.03,"Trailing PEG":0.6471,"Trailing PE":2287.6667,"Trailing PS":2287.6667,"Quick Ratio":0.872,"Day High":69.07,"Day Low":68.24,"VS Average Volume":0.1621349491,"Company Summary":"DuPont de Nemours, Inc. provides technology-based materials and solutions in the United States, Canada, the Asia Pacific, Latin America, Europe, the Middle East, and Africa. It operates through Electronics & Industrial, Water & Protection, and Corporate & Other segments. The Electronics & Industrial segment supplies materials and solutions for the fabrication of semiconductors and integrated circuits. This segment also provides semiconductor and advanced packaging materials; dielectric and metallization solutions for chip packaging; silicones for light emitting diode packaging and semiconductor applications; and permanent and process chemistries for the fabrication of printed circuit boards to include laminates and substrates, and electroless and electrolytic metallization solutions, and electromagnetic shielding and thermal management solutions, as well as patterning solutions, and materials and metallization processes for metal finishing, decorative, and industrial applications. In addition, it offers various materials to manufacture rigid and flexible displays for organic light emitting diode, and other display applications; provides high performance parts, and specialty silicone elastomers, and lubricants to automotive, aerospace, electronics, industrial, and healthcare markets; and photopolymer plates and platemaking systems used in flexographic printing, and digital inks for textile, commercial, and home-office printing applications. The Water & Protection segment provides engineered products and integrated systems for worker safety, water purification and separation, transportation, energy, medical packaging and building materials. The Corporate & Other segment offers auto adhesives and fluids; Multibase; and Tedlar products. The company was formerly known as DowDuPont Inc. and changed its name to DuPont de Nemours, Inc. in June 2019. DuPont de Nemours, Inc. was incorporated in 2015 and is headquartered in Wilmington, Delaware.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"Broadridge Financial Solutions,","Symbol":"BR","Current Price":"239.07","Latest MA":"233.71","Latest MA 5":242.464,"Latest MA 9":243.0811098226,"Latest MA 20":241.5809993896,"RSI":34.9943715317,"Price Target":256.27222,"Difference from MA":"2.29%","Difference from Open":"-0.67%","Change from Yesterday":"-0.87%","Change from Last Report":"-0.09","Latest Volume":"122,581","Market Cap":"28,081,881,088","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":25.568983,"PB Ratio":11.761205,"Previous Close":240.3,"ROE":0.33918,"DTE":152.819,"Industry":"Information Technology Services","Sector":"Technology","Beta":0.969,"Trailing PEG":1.7178,"Trailing PE":35.896397,"Trailing PS":35.896397,"Quick Ratio":1.188,"Day High":240.54,"Day Low":238.905,"VS Average Volume":0.2198300984,"Company Summary":"Broadridge Financial Solutions, Inc. provides investor communications and technology-driven solutions for the financial services industry. The company's Investor Communication Solutions segment handles the proxy materials distribution and voting processes for bank, broker-dealer, corporate issuer, and fund clients, as well as distributes regulatory reports, prospectuses, class action, and corporate action\/reorganization event information, as well as tax reporting solutions. The segment also offers ProxyEdge, an electronic proxy delivery and voting solution; data-driven solutions and an end-to-end platform for content management, composition, and omni-channel distribution of regulatory, marketing, and transactional information, as well as mutual fund trade processing services; solutions for public corporations and mutual funds; data and analytics solutions; SEC filing and capital markets transaction services; registrar, stock transfer, and record-keeping services; and omni-channel customer communications solutions, as well as operates Broadridge Communications Cloud platform that creates, delivers, and manages communications and customer engagement activities. Its Global Technology and Operations segment provides solutions that automate the front-to-back transaction lifecycle of equity, mutual fund, fixed income, foreign exchange and exchange-traded derivatives, order capture and execution, trade confirmation, margin, cash management, clearing and settlement, reference data management, reconciliations, securities financing and collateral management, asset servicing, compliance and regulatory reporting, portfolio accounting, and custody-related services. This segment also offers business process outsourcing services; technology solutions, such portfolio management, compliance, fee billing, and operational support solutions; and capital market and wealth and investment management solutions. The company was founded in 1962 and is headquartered in Lake Success, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"Humana Inc.","Symbol":"HUM","Current Price":"232.71","Latest MA":"264.49","Latest MA 5":232.0400010986,"Latest MA 9":231.4444453939,"Latest MA 20":233.3265003662,"RSI":49.1669212085,"Price Target":298.53174,"Difference from MA":"-12.02%","Difference from Open":"0.92%","Change from Yesterday":"0.42%","Change from Last Report":"-0.36","Latest Volume":"634,800","Market Cap":"28,086,468,608","Earning Date":"30-07-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.818884,"PB Ratio":1.582254,"Previous Close":231.74,"ROE":0.10099,"DTE":77.075,"Industry":"Healthcare Plans","Sector":"Healthcare","Beta":0.435,"Trailing PEG":0.7446,"Trailing PE":16.434322,"Trailing PS":16.434322,"Quick Ratio":1.474,"Day High":233.625,"Day Low":227.76,"VS Average Volume":0.3599088322,"Company Summary":"Humana Inc. provides medical and specialty insurance products in the United States. It operates in two segments, Insurance and CenterWell. It offers medical care and supplemental benefit plans to individuals. The company also has a contract with Centers for Medicare and Medicaid Services to administer the Limited Income Newly Eligible Transition prescription drug plan program; and contracts with various states to provide Medicaid, dual eligible, and long-term support services benefits. In addition, it provides commercial fully-insured medical and specialty health insurance benefits comprising dental, vision, and other supplemental health benefits, as well as administrative services only products to individuals and employer groups; and military services, such as TRICARE T2017 East Region contract. Further, the company engages in the operation of pharmacy benefit manager business; operates pharmacies and senior focused primary care centers; and offers home solutions services, such as home health, hospice, and other services to its health plan members, as well as to third parties. It sells its products through employers and employees, independent brokers and agents, sales representatives, and digital insurance agencies. The company was formerly known as Extendicare Inc. and changed its name to Humana Inc. in April 1974. Humana Inc. was founded in 1961 and is headquartered in Louisville, Kentucky.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"Rollins, Inc.","Symbol":"ROL","Current Price":"57.00","Latest MA":"51.67","Latest MA 5":57.1380004883,"Latest MA 9":57.6088896857,"Latest MA 20":57.271500206,"RSI":44.3808850495,"Price Target":54.64636,"Difference from MA":"10.32%","Difference from Open":"-0.38%","Change from Yesterday":"0.02%","Change from Last Report":"-0.10","Latest Volume":"479,164","Market Cap":"27,624,822,784","Earning Date":"23-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":50.892857,"PB Ratio":20.371693,"Previous Close":56.99,"ROE":0.37827,"DTE":67.198,"Industry":"Personal Services","Sector":"Consumer Cyclical","Beta":0.768,"Trailing PEG":4.9279,"Trailing PE":57.575756,"Trailing PS":57.575756,"Quick Ratio":0.682,"Day High":57.37,"Day Low":56.95,"VS Average Volume":0.2285411758,"Company Summary":"Rollins, Inc., through its subsidiaries, provides pest and wildlife control services to residential and commercial customers in the United States and internationally. The company offers pest control services to residential properties protecting from common pests, including rodents, insects, and wildlife. It also provides workplace pest control solutions for customers across various end markets, such as healthcare, foodservice, and logistics. In addition, the company offers termite protection and ancillary services. It serves clients directly, as well as through franchisee operations. The company was formerly known as Rollins Broadcasting, Inc and changed its name to Rollins, Inc. in 1965. Rollins, Inc. was founded in 1901 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"Nucor Corporation","Symbol":"NUE","Current Price":"118.04","Latest MA":"126.52","Latest MA 5":120.7893992065,"Latest MA 9":120.8085553182,"Latest MA 20":115.8568499237,"RSI":49.6230042731,"Price Target":145.37154,"Difference from MA":"-6.70%","Difference from Open":"1.72%","Change from Yesterday":"0.77%","Change from Last Report":"-0.07","Latest Volume":"779,769","Market Cap":"27,237,156,864","Earning Date":"28-04-2025","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":12.610791,"PB Ratio":1.3571683,"Previous Close":117.13,"ROE":0.074039996,"DTE":37.319,"Industry":"Steel","Sector":"Basic Materials","Beta":1.747,"Trailing PEG":null,"Trailing PE":20.817814,"Trailing PS":20.817814,"Quick Ratio":1.389,"Day High":118.3193,"Day Low":115.66,"VS Average Volume":0.2982489893,"Company Summary":"Nucor Corporation engages in the manufacture and sale of steel and steel products. The company operates in three segments: Steel Mills, Steel Products, and Raw Materials. The Steel Mills segment produces hot-rolled, cold-rolled, and galvanized sheet steel products; plate steel products; wide-flange beams, beam blanks, and H-piling and sheet piling structural steel products; and bar steel products, such as blooms, billets, concrete reinforcing and merchant bars, and engineered special bar quality products. It also engages in the steel trading and rebar distribution businesses. This segment sells its products to steel service centers, fabricators, and manufacturers in the United States, Canada, and Mexico. The Steel Products segment offers steel joists and joist girders, steel decks, and galvanized torque tubes for used in solar arrays, hollow structural section steel tubing, electrical conduit, fabricated concrete reinforcing steel, cold finished steel, steel fasteners, steel grating and expanded metal, wire and wire mesh, metal building systems, insulated metal panels, steel racking, overhead doors, and utility towers and structures for communications and energy transmission. This segment is also involved in the piling distribution business. The Raw Materials segment produces direct reduced iron (DRI); brokers ferrous and nonferrous metals, pig iron, hot briquetted iron, and DRI; supplies ferro-alloys; processes ferrous and nonferrous scrap metal; and engages in the natural gas production and industrial gas business. This segment sells its ferrous scrap to electric arc furnace steel mills and foundries for manufacturing process; and nonferrous scrap metal to aluminum can producers, secondary aluminum smelters, steel mills and other processors, and consumers of various nonferrous metals. Nucor Corporation was founded in 1905 and is based in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"International Paper Company","Symbol":"IP","Current Price":"47.11","Latest MA":"52.04","Latest MA 5":47.4319798474,"Latest MA 9":47.3410998983,"Latest MA 20":48.0223717929,"RSI":42.8990011383,"Price Target":54.32308,"Difference from MA":"-9.48%","Difference from Open":"0.90%","Change from Yesterday":"0.06%","Change from Last Report":"-0.02","Latest Volume":"1,136,097","Market Cap":"24,869,412,864","Earning Date":"31-07-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":15.7033,"PB Ratio":1.374348,"Previous Close":47.08,"ROE":0.03006,"DTE":57.086,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":0.994,"Trailing PEG":0.9443,"Trailing PE":40.264874,"Trailing PS":40.264874,"Quick Ratio":0.867,"Day High":47.15,"Day Low":46.3422,"VS Average Volume":0.2183856145,"Company Summary":"International Paper Company produces and sells renewable fiber-based packaging and pulp products in North America, Latin America, Europe, and North Africa. It operates through two segments, Industrial Packaging and Global Cellulose Fibers. The company offers linerboard, medium, whitetop, recycled linerboard, recycled medium and saturating kraft; and pulp for a range of applications, such as diapers, towel and tissue products, feminine care, incontinence, and other personal care products, as well as specialty pulps for use in textiles, construction materials, paints, coatings, and others. The company sells its products directly to end users and converters, as well as through agents, resellers, and distributors. The company was founded in 1898 and is headquartered in Memphis, Tennessee.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"Church & Dwight Company, Inc.","Symbol":"CHD","Current Price":"98.87","Latest MA":"104.06","Latest MA 5":99.0219995728,"Latest MA 9":99.1455549791,"Latest MA 20":97.739499527,"RSI":57.3347165647,"Price Target":100.38667,"Difference from MA":"-4.99%","Difference from Open":"-0.12%","Change from Yesterday":"-0.23%","Change from Last Report":"0.19","Latest Volume":"519,643","Market Cap":"24,349,407,232","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":26.506702,"PB Ratio":5.34924,"Previous Close":99.1,"ROE":0.13354999,"DTE":52.837,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":0.515,"Trailing PEG":2.3663,"Trailing PE":42.43348,"Trailing PS":42.43348,"Quick Ratio":1.384,"Day High":99.2,"Day Low":98.04,"VS Average Volume":0.2312334187,"Company Summary":"Church & Dwight Co., Inc. develops, manufactures, and markets household, personal care, and specialty products. It operates in three segments: Consumer Domestic, Consumer International, and Specialty Products Division. The company offers cat litters, carpet deodorizers, laundry detergents, and baking soda, as well as other baking soda based products under the ARM & HAMMER brand; condoms, lubricants, and vibrators under the TROJAN brand; stain removers, cleaning solutions, laundry detergents, and bleach alternatives under the OXICLEAN brand; toothbrushes under the SPINBRUSH brand; home pregnancy and ovulation test kits under the FIRST RESPONSE brand; depilatories under the NAIR brand; oral analgesics under the ORAJEL brand; laundry detergents under the XTRA brand; gummy dietary supplements under the L'IL CRITTERS and VITAFUSION brands; dry shampoos under the BATISTE brand; water flossers and showerheads under the WATERPIK brand; cold shortening and relief products under the ZICAM brand; oral care products under the THERABREATH brand; and acne treatment products under the HERO brand. Its specialty products include animal and food productivity products, such as ARM & HAMMER baking soda as a feed additive to help dairy cow; BIO-CHLOR and FERMENTEN used to reduce health issues associated with calving, as well as needed protein; CELMANAX refined functional carbohydrate, a yeast-based prebiotic; and CERTILLUS a probiotics products used in the poultry, dairy, beef, and swine industries. It offers sodium bicarbonate; and cleaning and deodorizing products. The company sells its consumer products through supermarkets, mass merchandisers, wholesale clubs, drugstores, convenience stores, home stores, dollar and other discount stores, pet and other specialty stores, and websites and other e-commerce channels; and specialty products to industrial customers and livestock producers through distributors. The company was founded in 1846 and is headquartered in Ewing, New Jersey.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"CDW Corporation","Symbol":"CDW","Current Price":"175.60","Latest MA":"176.16","Latest MA 5":177.1499987793,"Latest MA 9":176.9433332655,"Latest MA 20":181.0703457642,"RSI":40.3681027511,"Price Target":208.82909,"Difference from MA":"-0.32%","Difference from Open":"0.17%","Change from Yesterday":"-0.09%","Change from Last Report":"-0.20","Latest Volume":"458,567","Market Cap":"23,123,886,080","Earning Date":"07-05-2025","Earning Time":"Before","Earning Day of Week":"Saturday","PE Ratio":17.35178,"PB Ratio":9.955214,"Previous Close":175.75,"ROE":0.48707,"DTE":272.795,"Industry":"Information Technology Services","Sector":"Technology","Beta":0.943,"Trailing PEG":null,"Trailing PE":21.759605,"Trailing PS":21.759605,"Quick Ratio":1.152,"Day High":176.21,"Day Low":173.865,"VS Average Volume":0.3203762351,"Company Summary":"CDW Corporation provides information technology (IT) solutions in the United States, the United Kingdom, and Canada. It operates through three segments: Corporate, Small Business, and Public. The company offers discrete hardware and software products and services, as well as integrated IT solutions, including on-premise and cloud capabilities across hybrid infrastructure, digital experience, and security. It also provides hardware products comprising notebooks\/mobile devices, tablets, network communications, collaboration hardware, data storage and servers, desktop computers, and other hardware; and software products, such as cloud solutions, software assurance, application suites, security, virtualization, collaboration and productivity applications, operating systems, and network management. In addition, the company offers advisory and design, software development, implementation, and managed services, as well as warranties. It serves business, government, education, and healthcare customers. The company was formerly known as CDW Computer Centers, Inc. and changed its name to CDW Corporation in June 2003. CDW Corporation was founded in 1984 and is based in Vernon Hills, Illinois.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"T. Rowe Price Group, Inc.","Symbol":"TROW","Current Price":"94.50","Latest MA":"103.22","Latest MA 5":94.9580001831,"Latest MA 9":94.1722225613,"Latest MA 20":94.916999054,"RSI":50.4008024607,"Price Target":94.07692,"Difference from MA":"-8.45%","Difference from Open":"0.25%","Change from Yesterday":"-0.63%","Change from Last Report":"-0.10","Latest Volume":"599,763","Market Cap":"20,819,861,504","Earning Date":"02-05-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":10.106952,"PB Ratio":2.0096977,"Previous Close":95.1,"ROE":0.18447,"DTE":4.48,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.513,"Trailing PEG":2.9602,"Trailing PE":10.726447,"Trailing PS":10.726447,"Quick Ratio":3.886,"Day High":94.885,"Day Low":93.275,"VS Average Volume":0.288806493,"Company Summary":"T. Rowe Price Group, Inc. is a publicly owned investment manager. The firm provides its services to individuals, institutional investors, retirement plans, financial intermediaries, and institutions. It launches and manages equity and fixed income mutual funds. The firm invests in the public equity and fixed income markets across the globe. It employs fundamental and quantitative analysis with a bottom-up approach. The firm utilizes in-house and external research to make its investments. It employs socially responsible investing with a focus on environmental, social, and governance issues. It makes investment in late-stage venture capital transactions and usually invests between $3 million and $5 million. The firm was previously known as T. Rowe Group, Inc. and T. Rowe Price Associates, Inc. T. Rowe Price Group, Inc. was founded in 1937 and is based in Baltimore, Maryland, with additional offices in Colorado Springs, Colorado; Owings Mills, Maryland; San Francisco, California; New York, New York; Philadelphia, Pennsylvania; Tampa, Florida; Toronto, Ontario; Hellerup, Denmark; Amsterdam, The Netherlands; Luxembourg, Grand Duchy of Luxembourg; Zurich, Switzerland; Dubai, United Arab Emirates; London, United Kingdom; Sydney, New South Wales; Hong Kong; Tokyo, Japan; Singapore; Frankfurt, Shanghai, China; Germany, Madrid, Spain, Milan, Italy, Stockholm, Sweden, Melbourne, Australia, Amsterdam, Netherlands and Washington, DC.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"Ulta Beauty, Inc.","Symbol":"ULTA","Current Price":"459.02","Latest MA":"392.50","Latest MA 5":462.4320029297,"Latest MA 9":465.9588906521,"Latest MA 20":439.8300008545,"RSI":60.0581181517,"Price Target":475.30914,"Difference from MA":"16.95%","Difference from Open":"0.58%","Change from Yesterday":"0.45%","Change from Last Report":"0.08","Latest Volume":"262,638","Market Cap":"20,630,929,408","Earning Date":"29-05-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":20.070833,"PB Ratio":8.507302,"Previous Close":456.97,"ROE":0.50435,"DTE":81.274,"Industry":"Specialty Retail","Sector":"Consumer Cyclical","Beta":1.096,"Trailing PEG":2.5807,"Trailing PE":17.937475,"Trailing PS":17.937475,"Quick Ratio":0.385,"Day High":463.0,"Day Low":452.0,"VS Average Volume":0.2589268021,"Company Summary":"Ulta Beauty, Inc. operates as a specialty beauty retailer in the United States. The company offers branded and private label beauty products, including cosmetics, fragrance, haircare, skincare, bath and body products, professional hair products, and salon styling tools through its Ulta Beauty stores, shop-in-shops, Ulta.com website, and its mobile applications. It also provides beauty services, including hair, makeup, brow, and skin services at its stores. The company was formerly known as ULTA Salon, Cosmetics & Fragrance, Inc. and changed its name to Ulta Beauty, Inc. in January 2017. Ulta Beauty, Inc. was incorporated in 1990 and is based in Bolingbrook, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"International Flavors & Fragran","Symbol":"IFF","Current Price":"78.24","Latest MA":"81.41","Latest MA 5":78.2000004272,"Latest MA 9":77.4777783542,"Latest MA 20":76.9589997406,"RSI":57.4142622381,"Price Target":92.24381,"Difference from MA":"-3.89%","Difference from Open":"0.62%","Change from Yesterday":"-0.11%","Change from Last Report":"-0.05","Latest Volume":"412,682","Market Cap":"20,013,008,896","Earning Date":"06-05-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.9718,"PB Ratio":1.5182503,"Previous Close":78.33,"ROE":-0.060349997,"DTE":75.009,"Industry":"Specialty Chemicals","Sector":"Basic Materials","Beta":1.076,"Trailing PEG":0.9783,"Trailing PE":null,"Trailing PS":null,"Quick Ratio":0.544,"Day High":78.815,"Day Low":77.5591,"VS Average Volume":0.2306937213,"Company Summary":"International Flavors & Fragrances Inc., together with its subsidiaries, manufactures and markets food, beverage, health and biosciences, scent, pharma solutions, and complementary adjacent products in the United States, Europe, and internationally. It operates in four segments Nourish, Health & Biosciences, Scent, and Pharma Solutions. The Nourish segment consists of portfolio of natural-based ingredients that includes plant-based specialty food ingredients, such as soy and pea protein with value-added formulations, emulsifiers, and sweeteners; food protection ingredients, including natural antioxidants, and anti-microbials for natural food preservation and shelf-life extension; savory solutions, such as spices, marinades, and mixtures; combining flavourings with fruits, vegetables, and other natural ingredients products; a range of flavor compounds used in savory products, such as soups, sauces, meat, fish, poultry, and snacks; and beverages juice drinks, carbonated or flavored beverages, and spirits, as well as sweets bakery products, candy, cereal, and chewing gum; and dairy products, such as yogurt, ice cream, and cheese, as well as spices and seasoning ingredients. Its Health & Biosciences is comprised of health, cultures and food enzymes, home and personal care, animal nutrition, and grain processing. The Scent segment creates fragrance compounds, and fragrance ingredients. Its Pharma Solutions segment produces cellulosics and seaweed-based pharmaceutical excipients. The company was incorporated in 1909 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"Williams-Sonoma, Inc.","Symbol":"WSM","Current Price":"155.20","Latest MA":"173.69","Latest MA 5":156.6840232959,"Latest MA 9":157.9033453261,"Latest MA 20":162.8605047253,"RSI":34.2426504094,"Price Target":176.8335,"Difference from MA":"-10.65%","Difference from Open":"-0.21%","Change from Yesterday":"-0.24%","Change from Last Report":"-0.16","Latest Volume":"489,098","Market Cap":"19,089,301,504","Earning Date":"22-05-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":19.089804,"PB Ratio":8.832239,"Previous Close":155.58,"ROE":0.50154996,"DTE":63.334,"Industry":"Specialty Retail","Sector":"Consumer Cyclical","Beta":1.477,"Trailing PEG":2.0834,"Trailing PE":17.94221,"Trailing PS":17.94221,"Quick Ratio":0.679,"Day High":155.94,"Day Low":152.9925,"VS Average Volume":0.1820768761,"Company Summary":"Williams-Sonoma, Inc. operates as an omni-channel specialty retailer of various products for home. The company offers cooking, dining, and entertaining products, such as cookware, tools, electrics, cutlery, tabletop and bar, outdoor, furniture, and a library of cookbooks. It also provides home furnishings, home decor products and accessories, bedding, lighting, rugs, table essentials, kids accessories, made-to-order lighting, hardware, personalized products, custom gifts, and colorful and vintage-inspired heirloom products. In addition, the company operates a 3-D imaging and augmented reality platform for the home furnishings and decor industry. It offers its products under the Williams Sonoma, Pottery Barn, Pottery Barn Kids, Pottery Barn Teen, West Elm, Williams Sonoma Home, Rejuvenation, Mark and Graham, and GreenRow brand names. The company markets its products through e-commerce websites, direct-mail catalogs, and retail stores. Williams-Sonoma, Inc. was founded in 1956 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"NiSource Inc","Symbol":"NI","Current Price":"39.58","Latest MA":"37.92","Latest MA 5":39.4519992981,"Latest MA 9":39.3722222731,"Latest MA 20":39.2239998856,"RSI":58.4648283045,"Price Target":43.225,"Difference from MA":"4.39%","Difference from Open":"0.30%","Change from Yesterday":"0.30%","Change from Last Report":"0.03","Latest Volume":"1,030,248","Market Cap":"18,630,426,624","Earning Date":"07-05-2025","Earning Time":"Before","Earning Day of Week":"Saturday","PE Ratio":21.279572,"PB Ratio":2.093737,"Previous Close":39.46,"ROE":0.09364,"DTE":136.355,"Industry":"Utilities - Regulated Gas","Sector":"Utilities","Beta":0.549,"Trailing PEG":2.4255,"Trailing PE":21.394596,"Trailing PS":21.394596,"Quick Ratio":0.338,"Day High":39.695,"Day Low":39.29,"VS Average Volume":0.2169160074,"Company Summary":"NiSource Inc., an energy holding company, operates as a regulated natural gas and electric utility company in the United States. It operates in two segments, Columbia Operations and NIPSCO Operations. The company provides natural gas to approximately 2.4 million residential, commercial, and industrial customers through approximately 37,200 miles of distribution main pipeline and the associated individual customer service lines; and 330 miles of transmission main pipeline in Ohio, Pennsylvania, Virginia, Kentucky, and Maryland. It also generates, transmits, and distributes electricity to approximately 0.5 million customers in various counties in the northern part of Indiana, as well as engages in wholesale electric and transmission transactions. It owns and operates steam coal generating stations in Wheatfield and Michigan City; combined cycle gas turbine in West Terre Haute; natural gas generating units in Wheatfield; hydro generating plants in Carroll County and White County; wind generating units in White County, Indiana; and solar generating units in Jasper County and White County. The company was formerly known as NIPSCO Industries, Inc. and changed its name to NiSource Inc. in April 1999. NiSource Inc. was founded in 1847 and is headquartered in Merrillville, Indiana.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"KeyCorp","Symbol":"KEY","Current Price":"16.10","Latest MA":"16.46","Latest MA 5":16.2580001068,"Latest MA 9":16.1022222943,"Latest MA 20":15.9805952835,"RSI":53.5091500434,"Price Target":18.99091,"Difference from MA":"-2.16%","Difference from Open":"-0.12%","Change from Yesterday":"-0.80%","Change from Last Report":"-0.09","Latest Volume":"6,055,924","Market Cap":"17,644,634,112","Earning Date":"22-07-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":10.320514,"PB Ratio":1.0848327,"Previous Close":16.23,"ROE":0.0014300001,"DTE":null,"Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.074,"Trailing PEG":null,"Trailing PE":null,"Trailing PS":null,"Quick Ratio":null,"Day High":16.17,"Day Low":15.88,"VS Average Volume":0.4114630869,"Company Summary":"KeyCorp operates as the holding company for KeyBank National Association that provides various retail and commercial banking products and services in the United States. It operates in two segments, Consumer Bank and Commercial Bank. The company offers various deposits and investment products; commercial leasing, investment management, consumer finance; personal finance and financial wellness, lending, student loan refinancing, mortgage and home equity, credit card, treasury, and business advisory; and wealth management and investment services for institutional, non-profit, and high-net-worth clients. It also provides lending, cash management, equipment financing, and commercial mortgage loans; and capital market products and services, such as syndicated finance, debt and equity underwriting, fixed income and equity sales and trading, derivatives, foreign exchange, mergers and acquisition, other advisory, and public finance to large corporate and institutional clients. In addition, the company offers personal and institutional trust custody services, personal financial and planning services, access to mutual funds, treasury services, and international banking services. Further, it provides community development financing, securities underwriting, brokerage, and investment banking services, as well as merchant services. The company was founded in 1849 and is headquartered in Cleveland, Ohio.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"Mid-America Apartment Communiti","Symbol":"MAA","Current Price":"150.59","Latest MA":"156.34","Latest MA 5":150.7400001221,"Latest MA 9":151.4966672092,"Latest MA 20":154.6959993286,"RSI":35.2835147327,"Price Target":170.76923,"Difference from MA":"-3.68%","Difference from Open":"0.00%","Change from Yesterday":"0.15%","Change from Last Report":"-0.05","Latest Volume":"426,876","Market Cap":"18,088,568,832","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":36.286747,"PB Ratio":2.9592438,"Previous Close":150.36,"ROE":0.09368,"DTE":82.626,"Industry":"REIT - Residential","Sector":"Real Estate","Beta":0.778,"Trailing PEG":null,"Trailing PE":31.307692,"Trailing PS":31.307692,"Quick Ratio":0.043,"Day High":151.44,"Day Low":149.35,"VS Average Volume":0.4439013941,"Company Summary":"MAA, an S&P 500 company, is a real estate investment trust (REIT) focused on delivering full-cycle and superior investment performance for shareholders through the ownership, management, acquisition, development and redevelopment of quality apartment communities primarily in the Southeast, Southwest and Mid-Atlantic regions of the United States. As of March 31, 2025, MAA had ownership interest in 104,011 apartment units, including communities currently in development, across 16 states and the District of Columbia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"Domino's Pizza Inc","Symbol":"DPZ","Current Price":"449.29","Latest MA":"456.64","Latest MA 5":457.5669975586,"Latest MA 9":460.4783321126,"Latest MA 20":473.7522474365,"RSI":26.9908770894,"Price Target":503.4907,"Difference from MA":"-1.61%","Difference from Open":"0.68%","Change from Yesterday":"0.53%","Change from Last Report":"-0.24","Latest Volume":"228,448","Market Cap":"15,384,192,000","Earning Date":"28-04-2025","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":25.469673,"PB Ratio":-3.9802003,"Previous Close":446.9,"ROE":null,"DTE":null,"Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":1.122,"Trailing PEG":2.6064,"Trailing PE":25.776535,"Trailing PS":25.776535,"Quick Ratio":0.358,"Day High":451.99,"Day Low":444.297,"VS Average Volume":0.370978795,"Company Summary":"Domino's Pizza, Inc. operates as a pizza company in the United States and internationally. The company operates through three segments: U.S. Stores, International Franchise, and Supply Chain. It offers pizzas under the Domino's brand name through company-owned and franchised stores. It provides bread products, wings, boneless chicken, pastas, oven-baked sandwiches, dips, soft drink products and desserts. Domino's Pizza, Inc. was founded in 1960 and is headquartered in Ann Arbor, Michigan.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"Ball Corporation","Symbol":"BALL","Current Price":"55.15","Latest MA":"53.51","Latest MA 5":54.6109999695,"Latest MA 9":53.9327782016,"Latest MA 20":53.5624982605,"RSI":69.8858667645,"Price Target":60.75688,"Difference from MA":"3.05%","Difference from Open":"0.96%","Change from Yesterday":"0.39%","Change from Last Report":"-0.06","Latest Volume":"597,612","Market Cap":"15,298,214,912","Earning Date":"06-05-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":15.621813,"PB Ratio":2.801514,"Previous Close":54.93,"ROE":0.08219,"DTE":126.809,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":1.083,"Trailing PEG":null,"Trailing PE":31.332386,"Trailing PS":31.332386,"Quick Ratio":0.638,"Day High":55.39,"Day Low":54.465,"VS Average Volume":0.22007844,"Company Summary":"Ball Corporation supplies aluminum packaging products for the beverage, personal care, and household products industries in the United States, Brazil, and internationally. The company manufactures and sells aluminum beverage containers to fillers of carbonated soft drinks, beer, energy drinks, and other beverages. It manufactures and sells extruded aluminum aerosol containers, recloseable aluminum bottles, aluminum cups, and aluminum slugs. Ball Corporation was founded in 1880 and is headquartered in Westminster, Colorado.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"Aptiv PLC","Symbol":"APTV","Current Price":"69.80","Latest MA":"60.69","Latest MA 5":68.8370014038,"Latest MA 9":67.5261122301,"Latest MA 20":67.4962498627,"RSI":66.3692660043,"Price Target":74.88526,"Difference from MA":"15.01%","Difference from Open":"1.15%","Change from Yesterday":"-0.56%","Change from Last Report":"-0.25","Latest Volume":"634,506","Market Cap":"15,196,465,152","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":9.999284,"PB Ratio":1.7429577,"Previous Close":70.19,"ROE":0.15237,"DTE":91.193,"Industry":"Auto Parts","Sector":"Consumer Cyclical","Beta":1.473,"Trailing PEG":0.9668,"Trailing PE":11.404411,"Trailing PS":11.404411,"Quick Ratio":1.075,"Day High":70.11,"Day Low":68.5623,"VS Average Volume":0.208217166,"Company Summary":"Aptiv PLC engages in design, manufacture, and sale of vehicle components in North America, Europe, the Middle East, Africa, the Asia Pacific, South America, and internationally. The company provides electrical, electronic, and safety technology solutions to the automotive and commercial vehicle markets. It operates through two segments, Signal and Power Solutions, and Advanced Safety and User Experience. The Signal and Power Solutions segment designs, manufactures, and assembles vehicle's electrical architecture, including engineered component products, connectors, wiring assemblies and harnesses, cable management products, electrical centers, and high voltage and safety distribution systems. The Advanced Safety and User Experience segment provides critical technologies and services for vehicle safety, security, comfort, and convenience, such as sensing and perception systems, electronic control units, multi-domain controllers, vehicle connectivity systems, cloud-native software platform, application software, autonomous driving technologies, and end-to-end DevOps tools. Aptiv PLC was incorporated in 2011 and is based in Schaffhausen, Switzerland.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"Textron Inc.","Symbol":"TXT","Current Price":"77.63","Latest MA":"75.54","Latest MA 5":76.9860006104,"Latest MA 9":75.7711108398,"Latest MA 20":75.1799996796,"RSI":69.4272870832,"Price Target":86.10647,"Difference from MA":"2.76%","Difference from Open":"1.86%","Change from Yesterday":"1.08%","Change from Last Report":"-0.05","Latest Volume":"497,750","Market Cap":"14,015,242,240","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":11.586567,"PB Ratio":1.9269243,"Previous Close":76.8,"ROE":0.11699,"DTE":56.371,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.163,"Trailing PEG":0.8991,"Trailing PE":17.484234,"Trailing PS":17.484234,"Quick Ratio":0.637,"Day High":77.78,"Day Low":75.75,"VS Average Volume":0.3290978718,"Company Summary":"Textron Inc. operates in the aircraft, defense, industrial, and finance businesses worldwide. It operates in six segments: Textron Aviation, Bell, Textron Systems, Industrial, Textron eAviation, and Finance. The Textron Aviation segment manufactures, sells, and services business jets, turboprop and piston engine aircraft, and military trainer and defense aircraft; and offers maintenance, inspection, and repair services, as well as sells commercial parts. The Bell segment supplies military and commercial helicopters, tiltrotor aircrafts, and related spare parts and services. The Textron Systems segment offers unmanned aircraft systems, electronic systems and solutions, advanced marine crafts, piston aircraft engines, live military air-to-air and air-to-ship training, weapons and related components, and armored and specialty vehicles. The Industrial segment offers blow-molded solutions, including conventional plastic fuel tanks and pressurized fuel tanks for hybrid vehicle applications, clear-vision systems, plastic tanks for catalytic reduction systems, and battery housing systems for use in electric vehicles primarily to automobile original equipment manufacturers (OEMs); and golf cars, off-road utility vehicles, powersports products, light transportation vehicles, aviation ground support equipment, professional turf-maintenance equipment, and turf-care vehicles to golf courses and resorts, government agencies and municipalities, consumers, outdoor enthusiasts, and commercial and industrial users. The Textron eAviation segment manufactures and sells light aircraft and gliders with electric and combustion engines; and provides other research and development initiatives related to sustainable aviation solutions. The Finance segment offers financing services to purchase new and pre-owned aviation aircraft and Bell helicopters. Textron Inc. was founded in 1923 and is headquartered in Providence, Rhode Island.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"Masco Corporation","Symbol":"MAS","Current Price":"64.06","Latest MA":"71.21","Latest MA 5":64.0279996033,"Latest MA 9":63.4144446648,"Latest MA 20":63.7862668304,"RSI":53.8419145569,"Price Target":70.817,"Difference from MA":"-10.04%","Difference from Open":"0.58%","Change from Yesterday":"0.31%","Change from Last Report":"-0.02","Latest Volume":"739,607","Market Cap":"13,512,943,616","Earning Date":"23-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":14.493212,"PB Ratio":-53.20598,"Previous Close":63.86,"ROE":11.165561,"DTE":null,"Industry":"Building Products & Equipment","Sector":"Industrials","Beta":1.193,"Trailing PEG":1.7948,"Trailing PE":17.502731,"Trailing PS":17.502731,"Quick Ratio":1.02,"Day High":64.14,"Day Low":62.75,"VS Average Volume":0.3011561583,"Company Summary":"Masco Corporation provides home improvement and building products in North America, Europe, and internationally. The company's Plumbing Products segment offers faucets, showerheads, handheld showers, valves, bath hardware and accessories, bathing units, shower bases and enclosures, shower drains, steam shower systems, water filtration systems, and sinks and kitchen accessories; acrylic tubs, bath and shower enclosures, and shower bases and trays; spas, exercise pools, and aquatic fitness systems and saunas; brass, copper, and composite plumbing system component and other non-decorative plumbing products; water products; and thermoplastic products, extruded plastic profiles, and specialized fabrication products, as well as PEX tubing products. This segment provides its products under the DELTA, BRIZO, PEERLESS, HANSGROHE, AXOR, KRAUS, EASY DRAIN, NEWPORT BRASS, GINGER, BRASSTECH, WALTEC, BRISTAN, HERITAGE, MIROLIN, HOT SPRING, CALDERA, FREEFLOW SPAS, FANTASY SPAS, AQUATERRA, LIFESMART, ENDLESS POOLS, TYLO, FINNLEO, HELO, BRASSCRAFT, PLUMBSHOP, and MASTER PLUMBER brands, as well as under private label to home center and online retailers, mass merchandisers, wholesalers and distributors, plumbers, building contractors, remodelers, smaller retailers, and consumers and homebuilders. Its Decorative Architectural Products segment offers paints, primers, specialty coatings, stains, and waterproofing products, as well as paint applicators and accessories; cabinet and door hardware, functional hardware, wall plates, hook and rail, and outdoor living hardware; and decorative bath hardware, shower accessories, mirrors, and shower doors. This segment provides its products under the BEHR, KILZ, WHIZZ, Elder & Jenks, LIBERTY, BRAINERD, and FRANKLIN BRASS brands to home center and other retailers, mass and online retailers, other specialty retailers, and original equipment manufacturers and wholesalers. The company was incorporated in 1929 and is headquartered in Livonia, Michigan.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"Align Technology, Inc.","Symbol":"ALGN","Current Price":"181.97","Latest MA":"196.43","Latest MA 5":183.4129981689,"Latest MA 9":181.6649987793,"Latest MA 20":180.7692499084,"RSI":50.8733110418,"Price Target":227.30267,"Difference from MA":"-7.36%","Difference from Open":"-0.86%","Change from Yesterday":"-1.90%","Change from Last Report":"-0.27","Latest Volume":"300,376","Market Cap":"13,189,696,512","Earning Date":"30-07-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":17.73538,"PB Ratio":3.5037065,"Previous Close":185.48,"ROE":0.108430006,"DTE":3.124,"Industry":"Medical Instruments & Supplies","Sector":"Healthcare","Beta":1.64,"Trailing PEG":1.003,"Trailing PE":33.024498,"Trailing PS":33.024498,"Quick Ratio":0.989,"Day High":183.54,"Day Low":179.975,"VS Average Volume":0.2642215134,"Company Summary":"Align Technology, Inc. designs, manufactures, and markets Invisalign clear aligners, Vivera retainers, and iTero intraoral scanners and services in the United States, Switzerland, and internationally. The Clear Aligner segment offers comprehensive products, including Invisalign comprehensive package to treat adults and teens from mild to severe malocclusion and features, and orthodontic needs of teenage or younger patients; and Invisalign First Phase I and Invisalign First Comprehensive Phase 2 package for younger patients generally between the ages of six and ten years with a mixture of primary\/baby and permanent teeth. This segment also provides Invisalign express, Invisalign lite, and Invisalign moderate; as well as Invisalign Go, Invisalign Go express, and Invisalign Go Plus; retention products, Invisalign training, adjusting tools used by dental professionals during treatment, ancillary Invisalign accessory products, and other oral health products; Invisalign Professional Whitening system; Invisalign Palatal Expander, a 3D printed orthodontic device; and 3D printing solutions. The Imaging Systems and CAD\/CAM Services segment offers iTero intraoral scanning system, a single hardware platform for restorative or orthodontic procedures; exocad, a computer-aided design and computer-aided manufacturing (CAD\/CAM) software; orthodontist software for digital records storage, orthodontic diagnosis, and fabrication of printed models and retainers; and restorative software for general practitioner dentists, prosthodontists, periodontists, and oral surgeons. This segment also provides Invisalign outcome simulator, a chair-side and cloud-based application for the iTero scanner; Invisalign progress assessment tool; Align Oral Health Suite, a digital interface for dental consultations; iTero TimeLapse technology for doctors or practitioners to compare a patient's historic 3D scans to the present-day scan; and subscription software, disposables, rents scanners, and pay per scan services. The company was incorporated in 1997 and is headquartered in Tempe, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"Nordson Corporation","Symbol":"NDSN","Current Price":"218.98","Latest MA":"213.72","Latest MA 5":219.1599984131,"Latest MA 9":216.3388880073,"Latest MA 20":208.0375002136,"RSI":68.2641511532,"Price Target":248.758,"Difference from MA":"2.46%","Difference from Open":"0.15%","Change from Yesterday":"-0.14%","Change from Last Report":"-0.23","Latest Volume":"178,618","Market Cap":"12,374,319,104","Earning Date":"28-05-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":21.035543,"PB Ratio":4.1801243,"Previous Close":219.28,"ROE":0.15536,"DTE":78.487,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":0.896,"Trailing PEG":2.0106,"Trailing PE":28.146528,"Trailing PS":28.146528,"Quick Ratio":1.46,"Day High":219.95,"Day Low":217.12,"VS Average Volume":0.4574107934,"Company Summary":"Nordson Corporation engineers, manufactures, and markets products and systems to dispense, apply, and control adhesives, coatings, polymers, sealants, biomaterials, and other fluids. It operates through three segments: Industrial Precision Solutions; Medical and Fluid Solutions; and Advanced Technology Solutions. The Industrial Precision Solutions segment provides dispensing, coating, and laminating systems for adhesives, lotions, liquids, and fibers to disposable products and roll goods; automated adhesive dispensing systems used in packaged goods industries; components and systems for thermoplastic and biopolymer melt stream; fluid components, such as nozzles, pumps, and filters; smart components that measure and control the flow, quantity and location of dispensed fluid; control systems; and dispensing, coating, and laminating systems. It also offers automated and manual dispensing products and systems for cold materials, container coating, liquid finishing, and powder coating, as well as ultraviolet equipment used in curing and drying operations; and in-line measurement sensors, gauges and analyzers, lasers, X-ray, optical and nucleonic technologies, and proprietary algorithms and software. The Medical and Fluid Solutions segment offers cannulas, catheters, and medical balloons; single-use plastic components; precision manual and semi-automated dispensers; and plastic molded syringes, cartridges, tips, and fluid connection components. The Advanced Technology Solutions segment provides automated dispensing systems for fluids attachment, protection, and coating, as well as related gas plasma treatment systems for cleaning and conditioning surfaces; and bond testing and automated optical, acoustic microscopy, and x-ray inspection systems for semiconductor and printed circuit board industries. The company markets its products through direct sales force, distributors, and sales representatives. The company was founded in 1909 and is headquartered in Westlake, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"Revvity, Inc.","Symbol":"RVTY","Current Price":"95.57","Latest MA":"107.96","Latest MA 5":94.5479996338,"Latest MA 9":92.8877775743,"Latest MA 20":92.1535007629,"RSI":63.015914897,"Price Target":124.83,"Difference from MA":"-11.48%","Difference from Open":"0.12%","Change from Yesterday":"-0.52%","Change from Last Report":"-0.18","Latest Volume":"225,451","Market Cap":"11,264,835,584","Earning Date":"28-04-2025","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":18.521318,"PB Ratio":1.4942619,"Previous Close":96.07,"ROE":0.03824,"DTE":43.542,"Industry":"Diagnostics & Research","Sector":"Healthcare","Beta":0.972,"Trailing PEG":0.7179,"Trailing PE":39.491734,"Trailing PS":39.491734,"Quick Ratio":2.708,"Day High":96.06,"Day Low":94.56,"VS Average Volume":0.1756396074,"Company Summary":"Revvity, Inc. provides health sciences solutions, technologies, and services worldwide. The company's Life Sciences segment provides instruments, reagents, informatics, software, subscriptions, detection, imaging technologies, warranties, training, and DNA sequencing services. Its Diagnostics segment offers instruments, reagents, assay platforms, and software products for the early detection of genetic disorders, such as pregnancy and early childhood, as well as infectious disease testing in the diagnostics market. Its products are used for testing and screening genetic abnormalities, disorders, and diseases, including down syndrome, hypothyroidism, muscular dystrophy, infertility, and various metabolic conditions. It also develops technologies that enable and support genomic workflows using protein coupled receptor and next-generation DNA sequencing for use in oncology, screening newborns for rare genetic conditions, immunodiagnostics, and drug discovery. It serves pharmaceutical and biotechnology companies, laboratories, academic and research institutions, public health authorities, private healthcare organizations, doctors, and government agencies under the AutoDELFIA, BACS-on-Beads, BIOCHIPs, Bioo Scientific, BioQule, BoBs, chemagic, Chitas, DELFIA, DELFIA Xpress, DOPlify, EONIS, EUROArray, EUROIMMUN, EUROLabWorkstation, EUROLINE, EUROPatternTM, Evolution Evoya, explorer, Fontus, GSP, Haoyuan, IDS Immunodiagnosticsystems, IDS-i10, IDS-i10T, IDS-iSYS, iLab, iQ, JANUS, LabChip, LifeCycle, LimsLink, Migele, MultiPROBE, NEXTFLEX, NextPrep, Omni Bead Ruptor, Omni Bead Ruptor Elite, Omni Tip, Pannoramic, Panthera Puncher, PG-Seq, PG-Find, PreNAT II, Prime, Protein Clear, ProteinEXact, QuantiVac, RONIA, Sciclone, SimplicityChrom, Specimen Gate, Superflex, Symbio, T-SPOT, Touch, Twister, Vanadis, VariSpec, ViaCord, VICTOR2D, and Zephyr brands. The company was formerly known as PerkinElmer, Inc. and changed its name to Revvity, Inc. in April 2023. Revvity, Inc. was founded in 1937 and is headquartered in Waltham, Massachusetts.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"Molson Coors Beverage Company","Symbol":"TAP","Current Price":"51.27","Latest MA":"57.10","Latest MA 5":51.867999176,"Latest MA 9":51.9671490479,"Latest MA 20":53.3650285492,"RSI":27.5667644291,"Price Target":63.06087,"Difference from MA":"-10.20%","Difference from Open":"-0.54%","Change from Yesterday":"-0.95%","Change from Last Report":"0.18","Latest Volume":"581,228","Market Cap":"10,386,122,752","Earning Date":"08-05-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":8.645869,"PB Ratio":0.79350585,"Previous Close":51.76,"ROE":0.07989,"DTE":49.065,"Industry":"Beverages - Brewers","Sector":"Consumer Defensive","Beta":0.728,"Trailing PEG":20.4714,"Trailing PE":10.315896,"Trailing PS":10.315896,"Quick Ratio":0.461,"Day High":51.725,"Day Low":51.17,"VS Average Volume":0.2259015611,"Company Summary":"Molson Coors Beverage Company manufactures, markets, and sells beer and other malt beverage products in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company offers flavored malt beverages including hard seltzers, craft, spirits, and ready to drink beverages. It provides its products under Arnold Palmer Spiked, Aspall Cider, Blue Moon, Beck's, Blue Run Spirits, Cobra, Corona Extra, Coors Original, Five Trail, Heineken, Leinenkugel's, Madri, Miller Genuine Draft, Molson Ultra, Peroni Nastro Azurro, Pilsner Urquell, Redd's, Sharp's, Simply Spiked, Sol, Staropramen, Stella Artois, Topo Chico Hard Seltzer, ZOA Energy, and Vizzy Hard Seltzer above premium brands; Bergenbier, Borsodi, Burgasko, Caraiman, Carling, Coors Banquet, Coors Light, Jelen, Kamenitza, Miller Lite, Molson Canadian brands, Niksicko, and O\u009eujsko under the premium brands; and Branik, Icehouse, Keystone, Lowenbrau, Miller High Life, Milwaukee's Best, and Steel Reserve under the economy brands. The company was formerly known as Molson Coors Brewing Company and changed its name to Molson Coors Beverage Company in January 2020. Molson Coors Beverage Company was founded in 1774 and is based in Golden, Colorado.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"Bunge Limited","Symbol":"BG","Current Price":"75.93","Latest MA":"77.42","Latest MA 5":75.3320006714,"Latest MA 9":75.5266663954,"Latest MA 20":77.53515242,"RSI":45.6230714585,"Price Target":87.835,"Difference from MA":"-1.93%","Difference from Open":"1.32%","Change from Yesterday":"0.61%","Change from Last Report":"-0.18","Latest Volume":"657,160","Market Cap":"10,205,371,392","Earning Date":"07-05-2025","Earning Time":"Before","Earning Day of Week":"Saturday","PE Ratio":8.164516,"PB Ratio":0.9647172,"Previous Close":75.47,"ROE":0.09861,"DTE":66.083,"Industry":"Farm Products","Sector":"Consumer Defensive","Beta":0.656,"Trailing PEG":null,"Trailing PE":9.747111,"Trailing PS":9.747111,"Quick Ratio":0.79,"Day High":76.9,"Day Low":74.01,"VS Average Volume":0.3626410617,"Company Summary":"Bunge Global SA operates as an agribusiness and food company worldwide. It operates through four segments: Agribusiness, Refined and Specialty Oils, Milling, and Sugar and Bioenergy. The Agribusiness segment purchases, stores, transports, processes, and sells agricultural commodities and commodity products, including oilseeds primarily soybeans, rapeseed, canola, and sunflower seeds, as well as grains comprising wheat and corn; and processes oilseeds into vegetable oils and protein meals. This segment offers its products for animal feed manufacturers, livestock producers, wheat and corn millers, and other oilseed processors, as well as third-party edible oil processing and biofuel companies for biofuel production applications. The Refined and Specialty Oils segment sells packaged and bulk oils and fats that comprise cooking oils, shortenings, margarines, mayonnaise, renewable diesel feedstocks, and other products for baked goods companies, snack food producers, confectioners, restaurant chains, foodservice operators, infant nutrition companies, and other food manufacturers, as well as grocery chains, wholesalers, distributors, and other retailers. This segment also refines and fractionates palm oil, palm kernel oil, coconut oil, and shea butter, and olive oil; and produces specialty ingredients derived from vegetable oils, such as lecithin. The Milling segment provides wheat flours and bakery mixes; corn milling products that comprise dry-milled corn meals and flours, wet-milled masa and flours, and flaking and brewer's grits, as well as soy-fortified corn meal, corn-soy blends, and other products; whole grain and fiber ingredients; die-cut pellets; and non-GMO products. The Sugar and Bioenergy segment produces sugar and ethanol; and generates electricity from burning sugarcane bagasse. Bunge Global SA was founded in 1818 and is headquartered in Chesterfield, Missouri.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"The Campbell's Company","Symbol":"CPB","Current Price":"33.10","Latest MA":"38.89","Latest MA 5":33.8650002441,"Latest MA 9":34.0261108059,"Latest MA 20":34.3032497635,"RSI":27.3405168582,"Price Target":38.89182,"Difference from MA":"-14.88%","Difference from Open":"-0.85%","Change from Yesterday":"-0.88%","Change from Last Report":"0.18","Latest Volume":"2,823,867","Market Cap":"9,869,592,576","Earning Date":"02-06-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":9.708211,"PB Ratio":2.5490875,"Previous Close":33.4,"ROE":0.1166,"DTE":187.629,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.108,"Trailing PEG":0.5719,"Trailing PE":22.07,"Trailing PS":22.07,"Quick Ratio":0.285,"Day High":33.415,"Day Low":32.83,"VS Average Volume":0.7868872879,"Company Summary":"The Campbell's Company, together with its subsidiaries, manufactures and markets food and beverage products in the United States and internationally. The company operates through Meals & Beverages and Snacks segments. The Meals & Beverages segment engages in the retail and foodservice businesses in the United States and Canada. This segment provides Campbell's condensed and ready-to-serve soups; Swanson broth and stocks; Pacific Foods broth, soups, and non-dairy beverages; Prego pasta sauces; Pace Mexican sauces; Campbell's gravies, pasta, beans, and dinner sauces; Swanson canned poultry; V8 juices and beverages; Campbell's tomato juice; Rao's pasta sauces, dry pasta, frozen entrées, frozen pizza and soups; Michael Angelo's frozen entrées and pasta sauces; and noosa yogurts, as well as snacking products in foodservice in Canada. The Snacks segment retails Pepperidge Farm cookies, crackers, fresh bakery, and frozen products, that includes Goldfish crackers, Snyder's of Hanover pretzels, Lance sandwich crackers, Cape Cod and Kettle Brand potato chips, Late July snacks, Snack Factory pretzel crisps, and other snacking products. This segment is also involved in the retail business in Latin America. It sells its products through retail food chains, mass discounters and merchandisers, club stores, convenience stores, drug stores, and dollar stores, as well as e-commerce and other retail, commercial, and non-commercial establishments, and independent contractor distributors. The company was formerly known as Campbell Soup Company and changed its name to The Campbell's Company in November 2024. The company was founded in 1869 and is headquartered in Camden, New Jersey.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"Huntington Ingalls Industries, ","Symbol":"HII","Current Price":"227.99","Latest MA":"199.54","Latest MA 5":226.3990019531,"Latest MA 9":225.8138901774,"Latest MA 20":225.3511497192,"RSI":57.7979738271,"Price Target":244.17667,"Difference from MA":"14.26%","Difference from Open":"1.41%","Change from Yesterday":"0.81%","Change from Last Report":"-0.12","Latest Volume":"157,498","Market Cap":"8,945,926,144","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":14.53986,"PB Ratio":1.8742601,"Previous Close":226.15,"ROE":0.12271,"DTE":71.36,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":0.282,"Trailing PEG":0.9623,"Trailing PE":16.413607,"Trailing PS":16.413607,"Quick Ratio":0.953,"Day High":228.77,"Day Low":224.0,"VS Average Volume":0.2479666477,"Company Summary":"Huntington Ingalls Industries, Inc. designs, builds, overhauls, and repairs military ships in the United States. It operates through three segments: Ingalls, Newport News, and Mission Technologies. The company is involved in the design and construction of non-nuclear ships comprising amphibious assault ships; expeditionary warfare ships; surface combatants; and national security cutters for the U.S. Navy and U.S. Coast Guard. It also provides nuclear-powered ships, such as aircraft carriers and submarines, as well as refueling and overhaul, and inactivation services of nuclear-powered aircraft carriers. In addition, the company offers naval nuclear support services, including fleet services comprising design, construction, maintenance, and disposal activities for in-service the U.S. Navy nuclear ships; and maintenance services on nuclear reactor prototypes. Further, the company provides C5ISR systems and operations; application of artificial intelligence and machine learning to battlefield decisions; defensive and offensive cyberspace strategies and electronic warfare; uncrewed autonomous systems; live, virtual, and constructive solutions; and fleet sustainment; and critical nuclear operations. Huntington Ingalls Industries, Inc. was founded in 1886 and is headquartered in Newport News, Virginia.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"MarketAxess Holdings, Inc.","Symbol":"MKTX","Current Price":"225.97","Latest MA":"222.62","Latest MA 5":224.1800015869,"Latest MA 9":222.1766678196,"Latest MA 20":219.2577605591,"RSI":64.232772432,"Price Target":236.5,"Difference from MA":"1.51%","Difference from Open":"0.13%","Change from Yesterday":"0.42%","Change from Last Report":"-0.32","Latest Volume":"128,371","Market Cap":"8,474,258,944","Earning Date":"07-05-2025","Earning Time":"Before","Earning Day of Week":"Saturday","PE Ratio":27.456867,"PB Ratio":6.30145,"Previous Close":225.02,"ROE":0.16254,"DTE":5.259,"Industry":"Capital Markets","Sector":"Financial Services","Beta":0.842,"Trailing PEG":3.0809,"Trailing PE":39.2309,"Trailing PS":39.2309,"Quick Ratio":7.399,"Day High":226.99,"Day Low":224.1515,"VS Average Volume":0.2153286937,"Company Summary":"MarketAxess Holdings Inc., together with its subsidiaries, operates an electronic trading platform for institutional investor and broker-dealer firms in the United States, the United Kingdom, and internationally. The company offers trading technology to access liquidity on its platforms in U.S. high-grade bonds, U.S. high-yield bonds, emerging market debt, eurobonds, municipal bonds, U.S. government bonds, and other fixed-income securities; and executes bond trades between and among institutional investor and broker-dealer clients in an all-to-all anonymous trading environment for corporate bonds through its Open Trading protocols. It also provides automated and algorithmic trading solutions, such as X-Pro, a trading platform to combine trading protocols with its proprietary data and pre-trade analytics; and integrated and actionable data offerings, including CP+ and Axess All, a real-time pricing engine, including Auto-X and portfolio trading. In addition, the company offers various pre-and post-trade services, such as processing, trade matching, trade publication, regulatory transaction reporting, and market and reference data across a range of fixed-income and other products. MarketAxess Holdings Inc. was incorporated in 2000 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"Federal Realty Investment Trust","Symbol":"FRT","Current Price":"96.39","Latest MA":"102.06","Latest MA 5":96.7719987183,"Latest MA 9":96.0055551147,"Latest MA 20":95.7215000458,"RSI":53.9885914039,"Price Target":112.625,"Difference from MA":"-5.56%","Difference from Open":"0.24%","Change from Yesterday":"-0.07%","Change from Last Report":"-0.01","Latest Volume":"147,958","Market Cap":"8,373,197,312","Earning Date":"08-05-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":31.397394,"PB Ratio":2.7420914,"Previous Close":96.46,"ROE":0.094469994,"DTE":133.513,"Industry":"REIT - Retail","Sector":"Real Estate","Beta":1.122,"Trailing PEG":3.6496,"Trailing PE":27.698275,"Trailing PS":27.698275,"Quick Ratio":0.357,"Day High":96.5,"Day Low":95.67,"VS Average Volume":0.1762575616,"Company Summary":"Federal Realty is a recognized leader in the ownership, operation and redevelopment of high-quality retail-based properties located primarily in major coastal markets from Washington, D.C. to Boston as well as Northern and Southern California. Founded in 1962, Federal Realty's mission is to deliver long-term, sustainable growth through investing in communities where retail demand exceeds supply. Its expertise includes creating urban, mixed-use neighborhoods like Santana Row in San Jose, California, Pike & Rose in North Bethesda, Maryland and Assembly Row in Somerville, Massachusetts. These unique and vibrant environments that combine shopping, dining, living and working provide a destination experience valued by their respective communities. Federal Realty's 103 properties include approximately 3,500 tenants, in 27 million commercial square feet, and approximately 3,100 residential units.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"Charles River Laboratories Inte","Symbol":"CRL","Current Price":"152.29","Latest MA":"161.99","Latest MA 5":149.3130008545,"Latest MA 9":144.9461112467,"Latest MA 20":141.241249939,"RSI":77.5565588941,"Price Target":156.14175,"Difference from MA":"-5.99%","Difference from Open":"1.42%","Change from Yesterday":"0.78%","Change from Last Report":"-0.10","Latest Volume":"280,954","Market Cap":"7,480,075,264","Earning Date":"07-05-2025","Earning Time":"Before","Earning Day of Week":"Saturday","PE Ratio":14.814689,"PB Ratio":2.341631,"Previous Close":151.11,"ROE":-0.00671,"DTE":92.213,"Industry":"Diagnostics & Research","Sector":"Healthcare","Beta":1.481,"Trailing PEG":0.1303,"Trailing PE":null,"Trailing PS":null,"Quick Ratio":0.938,"Day High":152.64,"Day Low":148.535,"VS Average Volume":0.1757462934,"Company Summary":"Charles River Laboratories International, Inc. provides drug discovery, non-clinical development, and safety testing services in the United States, Europe, Canada, the Asia Pacific, and internationally. It operates through three segments: Research Models and Services (RMS), Discovery and Safety Assessment (DSA), and Manufacturing Solutions (Manufacturing). The RMS segment produces and sells rodents, and purpose-bred rats and mice for use by researchers. This segment also provides a range of services to assist its clients in supporting the use of research models in research and screening pre-clinical drug candidates, including research models, genetically engineered models and services, insourcing solutions, and research animal diagnostic services. The DSA segment offers early and in vivo discovery services for the identification and validation of novel targets, chemical compounds, and antibodies through delivery of preclinical drug and therapeutic candidates ready for safety assessment; and safety assessment services, such as toxicology, pathology, safety pharmacology, bioanalysis, drug metabolism, and pharmacokinetics services. The Manufacturing segment provides in vitro methods for conventional and rapid quality control testing of sterile and non-sterile pharmaceuticals and consumer products. This segment offers specialized testing of biologics that are outsourced by pharmaceutical and biotechnology companies. It utilizes Logica, a platform offering from Valo Health, to identify advanceable small molecule leads. It provides contract vivarium operation services to biopharmaceutical clients. The company was founded in 1947 and is headquartered in Wilmington, Massachusetts.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"Enphase Energy, Inc.","Symbol":"ENPH","Current Price":"44.54","Latest MA":"59.72","Latest MA 5":43.8679998474,"Latest MA 9":43.2077775574,"Latest MA 20":43.578499939,"RSI":56.057631802,"Price Target":55.25758,"Difference from MA":"-25.41%","Difference from Open":"-2.22%","Change from Yesterday":"-1.63%","Change from Last Report":"0.09","Latest Volume":"1,907,854","Market Cap":"5,843,959,808","Earning Date":"22-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":12.169399,"PB Ratio":7.20712,"Previous Close":45.28,"ROE":0.17132,"DTE":152.289,"Industry":"Solar","Sector":"Technology","Beta":1.701,"Trailing PEG":0.5456,"Trailing PE":40.862385,"Trailing PS":40.862385,"Quick Ratio":1.496,"Day High":45.8378,"Day Low":44.16,"VS Average Volume":0.3208073799,"Company Summary":"Enphase Energy, Inc., together with its subsidiaries, designs, develops, manufactures, and sells home energy solutions for the solar photovoltaic industry in the United States and internationally. The company offers semiconductor-based microinverter that converts energy at the individual solar module level and combines with its proprietary networking and software technologies to provide energy monitoring and control. It also provides microinverter units and related accessories; IQ Battery and related accessories; IQ Gateway and IQ Energy Router; cloud-based Enlighten monitoring service; and electric vehicle charging solutions, as well as design, proposal, permitting, and lead generation services. The company sells its solutions to solar distributors; and directly to large installers, original equipment manufacturers, strategic partners, and homeowners, as well as through its legacy product upgrade program or online store. Enphase Energy, Inc. was incorporated in 2006 and is headquartered in Fremont, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:31:15"},{"Company Name":"Caesars Entertainment, Inc.","Symbol":"CZR","Current Price":"27.41","Latest MA":"31.84","Latest MA 5":27.2079996643,"Latest MA 9":26.6822218662,"Latest MA 20":27.6769998207,"RSI":51.9774986943,"Price Target":42.86667,"Difference from MA":"-13.93%","Difference from Open":"-0.42%","Change from Yesterday":"-1.77%","Change from Last Report":"0.18","Latest Volume":"1,247,329","Market Cap":"5,699,363,328","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":20.451492,"PB Ratio":1.4334658,"Previous Close":27.9,"ROE":-0.03767,"DTE":606.801,"Industry":"Resorts & Casinos","Sector":"Consumer Cyclical","Beta":2.309,"Trailing PEG":null,"Trailing PE":null,"Trailing PS":null,"Quick Ratio":0.619,"Day High":27.69,"Day Low":27.065,"VS Average Volume":0.218914296,"Company Summary":"Caesars Entertainment, Inc. operates as a gaming and hospitality company. The company owns, leases, brands, or manages domestic properties in 18 states with slot machines, video lottery terminals and e-tables, and hotel rooms, as well as table games, including poker. It also operates and conducts retail and online sports wagering across 32 jurisdictions in North America, and iGaming in five jurisdictions in North America; sports betting from retail and online sportsbooks; and other games, such as keno. In addition, the company operates dining venues, bars, nightclubs, lounges, hotels, and entertainment venues; and provides staffing and management services. The company was founded in 1937 and is based in Reno, Nevada.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:31:15"}]