[{"Company Name":"Goldman Sachs Group, Inc. (The)","Symbol":"GS","Current Price":"625.63","Latest MA":"580.09","Latest MA 5":618.4389995117,"Latest MA 9":611.0927791341,"Latest MA 20":607.1587000732,"RSI":75.8618248596,"Price Target":592.2105,"Difference from MA":"7.85%","Difference from Open":"0.75%","Change from Yesterday":"0.23%","Change from Last Report":"0.14","Latest Volume":"763,421","Market Cap":"191,970,459,648","Earning Date":"16-07-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":15.053778,"PB Ratio":1.6842866,"Previous Close":624.17,"ROE":0.12222,"DTE":593.344,"Industry":"Capital Markets","Sector":"Financial Services","Beta":1.314,"Trailing PEG":7.0456,"Trailing PE":14.526005,"Trailing PS":14.526005,"Quick Ratio":1.412,"Day High":625.9,"Day Low":615.8,"VS Average Volume":0.2851710998,"Company Summary":"The Goldman Sachs Group, Inc., a financial institution, provides a range of financial services for corporations, financial institutions, governments, and individuals in the Americas, Europe, the Middle East, Africa, and Asia. It operates through Global Banking & Markets, Asset & Wealth Management, and Platform Solutions segments. The Global Banking & Markets segment provides financial advisory services, including strategic advisory assignments related to mergers and acquisitions, divestitures, corporate defense activities, restructurings, and spin-offs; equity and debt underwriting of public offerings and private placements; relationship lending and acquisition financing; secured lending through structured credit and asset-backed lending, such as warehouse, residential and commercial mortgage, corporate, consumer, auto, and student loans; financing through securities purchased under agreements to resell; and commodity financing through structured transactions. This segment also offers client execution activities for cash and derivative instruments; credit and interest rate products; and provision of mortgages, currencies, commodities, and equities related products. Its Asset & Wealth Management segment manages assets across various classes, including equity, fixed income, hedge funds, credit funds, private equity, real estate, currencies, commodities, and asset allocation strategies; and provides customized investment advisory solutions, wealth advisory services, personalized financial planning, and private banking services, as well as invests in corporate equity, credit, real estate, and infrastructure assets. The Platform Solutions segment offers credit cards; and transaction banking and other services, such as deposit-taking, payment solutions, and other cash management services for corporate and institutional clients. The Goldman Sachs Group, Inc. was founded in 1869 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:57:05"},{"Company Name":"Stryker Corporation","Symbol":"SYK","Current Price":"379.56","Latest MA":"376.32","Latest MA 5":382.3719975586,"Latest MA 9":382.1533307563,"Latest MA 20":383.691999939,"RSI":41.2483565593,"Price Target":421.45715,"Difference from MA":"0.86%","Difference from Open":"-0.45%","Change from Yesterday":"-0.40%","Change from Last Report":"0.04","Latest Volume":"478,151","Market Cap":"145,054,547,968","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":28.053215,"PB Ratio":6.930451,"Previous Close":381.08,"ROE":0.14259,"DTE":82.924,"Industry":"Medical Devices","Sector":"Healthcare","Beta":0.927,"Trailing PEG":2.2236,"Trailing PE":51.3613,"Trailing PS":51.3613,"Quick Ratio":0.803,"Day High":381.59,"Day Low":378.02,"VS Average Volume":0.3088892607,"Company Summary":"Stryker Corporation operates as a medical technology company. It operates through two segments, MedSurg and Neurotechnology, and Orthopaedics. The MedSurg and Neurotechnology segment offers surgical equipment, and surgical navigation systems, endoscopic and communications systems, patient handling, emergency medical equipment and intensive care disposable products, clinical communication and  artificial intelligence-assisted virtual care platform technology, minimally invasive products for the treatment of acute ischemic and hemorrhagic stroke, cranial, and maxillofacial and chest wall devices, as well as dural substitutes and sealants; traditional brain and open skull based surgical procedures products; and orthobiologic and biosurgery products, including synthetic bone grafts and vertebral augmentation products. The Orthopaedics segment provides implants for use in total joint replacements, such as hip, knee and shoulder, and trauma and extremities surgeries; thoracolumbar systems that include fixation, minimally invasive and interbody systems used in spinal injury, complex spine and degenerative therapies. The company sells its products to doctors, hospitals, and other healthcare facilities through company-owned subsidiaries and branches, as well as third-party dealers and distributors in approximately 75 countries. Stryker Corporation was founded in 1941 and is headquartered in Portage, Michigan.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:57:05"},{"Company Name":"Prologis, Inc.","Symbol":"PLD","Current Price":"108.15","Latest MA":"110.19","Latest MA 5":108.7724998169,"Latest MA 9":108.6536106364,"Latest MA 20":108.1606252594,"RSI":49.0185413883,"Price Target":117.15,"Difference from MA":"-1.85%","Difference from Open":"0.23%","Change from Yesterday":"-0.32%","Change from Last Report":"-0.26","Latest Volume":"1,359,473","Market Cap":"100,357,513,216","Earning Date":"16-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":30.725142,"PB Ratio":1.8791482,"Previous Close":108.5,"ROE":0.06829,"DTE":56.643,"Industry":"REIT - Industrial","Sector":"Real Estate","Beta":1.268,"Trailing PEG":null,"Trailing PE":26.970695,"Trailing PS":26.970695,"Quick Ratio":0.321,"Day High":109.38,"Day Low":107.66,"VS Average Volume":0.2594013634,"Company Summary":"Prologis, Inc., is the global leader in logistics real estate with a focus on high-barrier, high-growth markets. At March 31, 2025, the company owned or had investments in, on a wholly owned basis or through co-investment ventures, properties and development projects expected to total approximately 1.3 billion square feet (120 million square meters) in 20 countries. Prologis leases modern logistics facilities to a diverse base of approximately 6,500 customers principally across two major categories: business-to-business and retail\/online fulfillment.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:57:05"},{"Company Name":"The Cigna Group","Symbol":"CI","Current Price":"314.29","Latest MA":"308.50","Latest MA 5":312.3369987793,"Latest MA 9":311.9972191026,"Latest MA 20":313.4327558594,"RSI":53.2997997617,"Price Target":375.33957,"Difference from MA":"1.87%","Difference from Open":"1.04%","Change from Yesterday":"1.32%","Change from Last Report":"0.18","Latest Volume":"1,177,458","Market Cap":"83,959,037,952","Earning Date":"02-05-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":10.034642,"PB Ratio":2.1087294,"Previous Close":310.2,"ROE":0.13206,"DTE":75.34,"Industry":"Healthcare Plans","Sector":"Healthcare","Beta":0.45,"Trailing PEG":0.6019,"Trailing PE":17.528444,"Trailing PS":17.528444,"Quick Ratio":0.648,"Day High":314.32,"Day Low":308.375,"VS Average Volume":0.6607267412,"Company Summary":"The Cigna Group, together with its subsidiaries, provides insurance and related products and services in the United States. Its Evernorth Health Services segment provides a range of coordinated and point solution health services, including pharmacy benefits, home delivery pharmacy, specialty pharmacy, distribution, and care delivery and management solutions to health plans, employers, government organizations, and health care providers. The company's Cigna Healthcare segment offers medical, pharmacy, behavioral health, dental, and other products and services for insured and self-insured customers; Medicare Advantage, Medicare Supplement, and Medicare Part D plans for seniors, as well as individual health insurance plans; and health care coverage in its international markets, as well as health care benefits for mobile individuals and employees of multinational organizations. In addition, it offers permanent insurance contracts sold to corporations to provide coverage on the lives of certain employees for financing employer-paid future benefit obligations and stop loss insurance. The company distributes its products and services through insurance brokers and consultants; directly to employers, unions and other groups, or individuals; and private and public exchanges. The company was formerly known as Cigna Corporation and changed its name to The Cigna Group in February 2023. The company was founded in 1792 and is headquartered in Bloomfield, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:57:05"},{"Company Name":"CVS Health Corporation","Symbol":"CVS","Current Price":"66.09","Latest MA":"59.19","Latest MA 5":64.7026011597,"Latest MA 9":64.1503339945,"Latest MA 20":63.0321505341,"RSI":73.8818828614,"Price Target":79.4892,"Difference from MA":"11.66%","Difference from Open":"0.55%","Change from Yesterday":"0.57%","Change from Last Report":"0.07","Latest Volume":"3,245,859","Market Cap":"83,608,969,216","Earning Date":"31-07-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.199537,"PB Ratio":1.0842384,"Previous Close":65.72,"ROE":0.06934,"DTE":105.321,"Industry":"Healthcare Plans","Sector":"Healthcare","Beta":0.561,"Trailing PEG":0.6901,"Trailing PE":15.773986,"Trailing PS":15.773986,"Quick Ratio":0.588,"Day High":66.1,"Day Low":64.8242,"VS Average Volume":0.3230139205,"Company Summary":"CVS Health Corporation provides health solutions in the United States. It operates through Health Care Benefits, Health Services, and Pharmacy & Consumer Wellness segments. The Health Care Benefits segment offers traditional, voluntary, and consumer-directed health insurance products and related services, including medical, pharmacy, dental and behavioral health plans, medical management capabilities, Medicare Advantage and Medicare Supplement plans, PDPs and Medicaid health care management services. It serves employer groups, individuals, college students, part-time and hourly workers, health plans, health care providers, governmental units, government-sponsored plans, labor groups, and expatriates. The Health Services segment offers pharmacy benefit management solutions, including plan design and administration, formulary management, retail pharmacy network management, specialty and mail order pharmacy, clinical, disease management, medical spend management services, and other administrative services. It serves employers, insurance companies, unions, government employee groups, health plans, prescription drug plans, Medicaid managed care plans, CMS, plans offered on public health insurance, and other sponsors of health benefit plans. The Pharmacy & Consumer Wellness segment sells prescription and over-the-counter drugs, consumer health and beauty products, and personal care products. This segment also distributes prescription drugs; and provides related pharmacy consulting and other ancillary services to care facilities and other care settings. It operates online retail pharmacy websites, LTC pharmacies and on-site pharmacies, retail specialty pharmacy stores, compounding pharmacies and branches for infusion and enteral nutrition services. The company was formerly known as CVS Caremark Corporation and changed its name to CVS Health Corporation in September 2014. CVS Health Corporation was incorporated in 1996 and is headquartered in Woonsocket, Rhode Island.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:57:05"},{"Company Name":"PayPal Holdings, Inc.","Symbol":"PYPL","Current Price":"75.09","Latest MA":"76.73","Latest MA 5":74.2880012207,"Latest MA 9":73.2188902791,"Latest MA 20":72.2365007324,"RSI":76.4594276741,"Price Target":81.73974,"Difference from MA":"-2.14%","Difference from Open":"1.47%","Change from Yesterday":"0.64%","Change from Last Report":"0.09","Latest Volume":"4,631,268","Market Cap":"73,027,502,080","Earning Date":"29-07-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":15.355828,"PB Ratio":3.6296403,"Previous Close":74.61,"ROE":0.22198999,"DTE":66.041,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.449,"Trailing PEG":1.0021,"Trailing PE":16.874157,"Trailing PS":16.874157,"Quick Ratio":0.266,"Day High":75.3068,"Day Low":74.0,"VS Average Volume":0.4546450332,"Company Summary":"PayPal Holdings, Inc. operates a technology platform that enables digital payments for merchants and consumers worldwide. It operates a two-sided network at scale that connects merchants and consumers that enables its customers to connect, transact, and send and receive payments through online and in person, as well as transfer and withdraw funds using various funding sources, such as bank accounts, PayPal or Venmo account balance, consumer credit products, credit and debit cards, and cryptocurrencies, as well as other stored value products, including gift cards and eligible rewards. The company provides payment solutions under the PayPal, PayPal Credit, Braintree, Venmo, Xoom, Zettle, Hyperwallet, Honey, and Paidy names. The company was founded in 1998 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:57:05"},{"Company Name":"Emerson Electric Company","Symbol":"EMR","Current Price":"126.64","Latest MA":"118.83","Latest MA 5":125.8350001831,"Latest MA 9":123.6150001695,"Latest MA 20":121.1093497162,"RSI":79.4698392632,"Price Target":134.51357,"Difference from MA":"6.57%","Difference from Open":"0.95%","Change from Yesterday":"0.11%","Change from Last Report":"0.12","Latest Volume":"1,487,484","Market Cap":"71,232,184,320","Earning Date":"07-05-2025","Earning Time":"Before","Earning Day of Week":"Saturday","PE Ratio":20.037184,"PB Ratio":3.7006135,"Previous Close":126.49,"ROE":0.08335,"DTE":77.857,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":1.268,"Trailing PEG":1.5813,"Trailing PE":36.494236,"Trailing PS":36.494236,"Quick Ratio":0.547,"Day High":126.76,"Day Low":124.78,"VS Average Volume":0.4603097338,"Company Summary":"Emerson Electric Co., a technology and software company, provides various solutions in the Americas, Asia, the Middle East, Africa, and Europe. It operates through seven segments: Final Control, Measurement & Analytical, Discrete Automation, Safety & Productivity, Control Systems & Software, Test & Measurement, and AspenTech. The Final Control segment provides control, isolation, shutoff, pressure relief, and pressure safety valves, actuators, and regulators for process and hybrid industries. The Measurement & Analytical segment offers intelligent instrumentation measuring the physical properties of liquids or gases, such as pressure, temperature, level, flow, acoustics, corrosion, pH, conductivity, water quality, toxic gases, and flame. The Discrete Automation segment offers solenoid and pneumatic valves, valve position indicators, pneumatic cylinders, actuators, air preparation equipment, pressure and temperature switches, electric linear motion solutions, programmable automation control systems, electrical distribution equipment, and materials joining solutions. The Safety & Productivity segment offers tools for professionals and homeowners; pipe-working tools, including pipe wrenches, pipe cutters, pipe threading and roll grooving equipment, battery hydraulic tools; electrical tools; and other professional tools. The Control Systems & Software segment provides control systems, safety instrumented systems, SCADA systems, application software, digital twins, asset performance management, and cybersecurity. The Test & Measurement provides software-connected automated test and measurement systems. The AspenTech segment provides asset optimization software that enables industrial manufacturers to design, operate, and maintain operations for enhancing performance through a combination of decades of modeling, simulation, and optimization capabilities. The company was incorporated in 1890 and is based in Saint Louis, Missouri.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:57:05"},{"Company Name":"Motorola Solutions, Inc.","Symbol":"MSI","Current Price":"412.91","Latest MA":"445.65","Latest MA 5":412.982,"Latest MA 9":415.5344437663,"Latest MA 20":418.9974989014,"RSI":42.6330238147,"Price Target":493.6789,"Difference from MA":"-7.35%","Difference from Open":"0.21%","Change from Yesterday":"0.94%","Change from Last Report":"-0.12","Latest Volume":"305,397","Market Cap":"68,921,286,656","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":28.108238,"PB Ratio":41.996544,"Previous Close":409.07,"ROE":1.86885,"DTE":393.309,"Industry":"Communication Equipment","Sector":"Technology","Beta":0.967,"Trailing PEG":1.6751,"Trailing PE":34.437866,"Trailing PS":34.437866,"Quick Ratio":0.948,"Day High":414.51,"Day Low":407.83,"VS Average Volume":0.3224432868,"Company Summary":"Motorola Solutions, Inc. provides public safety and enterprise security solutions in the United States, the United Kingdom, Canada, and internationally. The company operates in two segments, Products and Systems Integration, and Software and Services. The Products and Systems Integration segment offers a portfolio of infrastructure, devices, accessories, and video security devices and infrastructure, as well as the implementation and integration of systems, devices, software, and applications for government, public safety, and commercial customers who operate private communications networks and video security solutions, as well as manage a mobile workforce. Its land mobile radio communications, and video security and access control devices include two-way portable and vehicle-mounted radios, fixed video cameras, and accessories; communications network core and central processing software, base stations, consoles, and repeaters; and video analytics, network video management hardware and software, and access control solutions. The Software and Services segment provides public safety and enterprise command center, unified communications applications, mobile video equipment, and video software solutions; repair, technical support, and maintenance services; and monitoring, software updates, and cybersecurity services to government, public safety, and commercial communications networks. It serves hospitality; manufacturing; military and defence; public safety; mining; oil and gas; transportation and logistics; utilities industries. The company was formerly known as Motorola, Inc. and changed its name to Motorola Solutions, Inc. in January 2011. Motorola Solutions, Inc. was founded in 1928 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:57:05"},{"Company Name":"Regeneron Pharmaceuticals, Inc.","Symbol":"REGN","Current Price":"522.24","Latest MA":"663.23","Latest MA 5":515.0379963379,"Latest MA 9":502.4288849555,"Latest MA 20":549.5235112305,"RSI":46.8502208966,"Price Target":727.21375,"Difference from MA":"-21.26%","Difference from Open":"0.97%","Change from Yesterday":"0.70%","Change from Last Report":"0.11","Latest Volume":"472,774","Market Cap":"56,383,639,552","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":11.525932,"PB Ratio":1.8819256,"Previous Close":518.6,"ROE":0.15961,"DTE":9.204,"Industry":"Biotechnology","Sector":"Healthcare","Beta":0.307,"Trailing PEG":1.0743,"Trailing PE":13.268292,"Trailing PS":13.268292,"Quick Ratio":3.9,"Day High":524.235,"Day Low":512.97,"VS Average Volume":0.3555274474,"Company Summary":"Regeneron Pharmaceuticals, Inc. discovers, invents, develops, manufactures, and commercializes medicines for treating various diseases worldwide. The company's products include EYLEA injection to treat wet age-related macular degeneration and diabetic macular edema; myopic choroidal neovascularization; diabetic retinopathy; neovascular glaucoma; and retinopathy of prematurity. It also provides Dupixent injection to treat atopic dermatitis and asthma in adults and pediatrics; Libtayo injection to treat metastatic or locally advanced cutaneous squamous cell carcinoma; Praluent injection for heterozygous familial hypercholesterolemia (HoFH) or clinical atherosclerotic cardiovascular disease in adults; REGEN-COV for covid-19; and Kevzara solution for treating rheumatoid arthritis in adults. In addition, the company offers Inmazeb injection for infection caused by Zaire ebolavirus; ARCALYST injection for cryopyrin-associated periodic syndromes, including familial cold auto-inflammatory syndrome and muckle-wells syndrome; and ZALTRAP injection for intravenous infusion to treat metastatic colorectal cancer; Evkeeza for treatment of HoFH; Ordspono for Follicular lymphoma and Diffuse large B-cell lymphoma; and Veopoz for CD55-deficient protein-losing enteropathy. Further, it develops product candidates for treating patients with eye, allergic and inflammatory, cardiovascular and metabolic, infectious, and rare diseases; and cancer, pain, and hematologic conditions. It has collaboration with Mammoth Biosciences, Inc. to research, develop and commercialize in vivo CRISPR-based gene editing therapies for multiple tissues and cell types; and with Sonoma Biotherapeutics, Inc. to discover, develop, and commercialize engineered regulatory T cell therapies. The company was incorporated in 1988 and is headquartered in Tarrytown, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:57:05"},{"Company Name":"Paychex, Inc.","Symbol":"PAYX","Current Price":"153.19","Latest MA":"146.08","Latest MA 5":155.8580781689,"Latest MA 9":157.0755989149,"Latest MA 20":156.9865189014,"RSI":30.1167872088,"Price Target":147.95866,"Difference from MA":"4.87%","Difference from Open":"-0.68%","Change from Yesterday":"-0.55%","Change from Last Report":"0.05","Latest Volume":"578,562","Market Cap":"55,177,805,824","Earning Date":"26-03-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":28.958488,"PB Ratio":13.403657,"Previous Close":154.045,"ROE":0.44254002,"DTE":20.981,"Industry":"Software - Application","Sector":"Technology","Beta":0.911,"Trailing PEG":6.9464,"Trailing PE":31.848316,"Trailing PS":31.848316,"Quick Ratio":0.598,"Day High":154.26,"Day Low":151.39,"VS Average Volume":0.2860943382,"Company Summary":"Paychex, Inc., together with its subsidiaries, provides integrated human capital management solutions (HCM) for payroll, benefits, human resources (HR), and insurance services for small to medium-sized businesses in the United States, Europe, and India. It offers payroll processing services; payroll tax administration services; employee payment services; and regulatory compliance services, such as new-hire reporting and garnishment processing. The company also provides HR solutions, including integrated HCM technology solutions and HR advisory services through both virtual and on-site availability of a professionally trained HR representative, as well as HR support to non-payroll clients through its HR Partner Plus solution; and retirement services administration, such as plan implementation, ongoing compliance with government regulations, employee and employer reporting, participant and employer online access, electronic funds transfer, and other administrative services. In addition, it offers cloud-based HR administration software products for employee benefits management and administration, time and attendance, digital communication solutions, recruiting, and onboarding solutions; plan administration outsourcing and state unemployment insurance services; various business services to small to medium-sized businesses comprising payroll funding and outsourcing services, which include payroll processing, invoicing, and tax preparation; and payment processing services, financial fitness programs, and a small-business loan resource center. Further, the company provides insurance services for property and casualty coverage, such as workers' compensation, business-owner policies, cyber security protection, and commercial auto, as well as health and benefits coverage, including health, dental, vision, and life. It markets and sells its services primarily through its direct sales force. The company was founded in 1971 and is headquartered in Rochester, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"12-06-2025 20:57:05"},{"Company Name":"Ameriprise Financial, Inc.","Symbol":"AMP","Current Price":"514.36","Latest MA":"517.81","Latest MA 5":516.6793078125,"Latest MA 9":513.6307264269,"Latest MA 20":513.9003246948,"RSI":54.1700600292,"Price Target":522.3,"Difference from MA":"-0.67%","Difference from Open":"0.91%","Change from Yesterday":"-0.25%","Change from Last Report":"-0.03","Latest Volume":"101,317","Market Cap":"48,978,415,616","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":13.314949,"PB Ratio":9.05637,"Previous Close":515.65,"ROE":0.58108,"DTE":74.235,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.227,"Trailing PEG":2.0562,"Trailing PE":17.471348,"Trailing PS":17.471348,"Quick Ratio":2.082,"Day High":514.5291,"Day Low":507.05,"VS Average Volume":0.1948684906,"Company Summary":"Ameriprise Financial, Inc., together with its subsidiaries, operates as a diversified financial services company in the United States and internationally. The company offers financial planning and advice services to individual and institutional clients. It operates through Advice & Wealth Management, Asset Management, and Retirement & Protection Solutions segments. The Advice & Wealth Management segment provides financial planning and advice; brokerage products and services for retail and institutional clients; discretionary and non-discretionary investment advisory accounts; mutual funds; insurance and annuities products; cash management and banking products; and face-amount certificates. The Asset Management segment offers investment management, advice, and products to retail, high net worth, and institutional clients through third-party financial institutions, advisor networks, direct retail, and its institutional sales force under the Columbia Threadneedle Investments brand name. Its products include U.S. mutual funds and their non-U.S. equivalents, exchange-traded funds, variable product funds underlying insurance, and annuity separate accounts; and institutional asset management products, such as traditional asset classes, separately managed accounts, individually managed accounts, collateralized loan obligations, hedge funds, collective funds, and property and infrastructure funds. The Retirement & Protection Solutions segment provides variable annuity products, as well as life and disability income insurance products to retail clients. The company was formerly known as American Express Financial Corporation and changed its name to Ameriprise Financial, Inc. in September 2005. Ameriprise Financial, Inc. was founded in 1894 and is based in Minneapolis, Minnesota.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:57:05"},{"Company Name":"Hess Corporation","Symbol":"HES","Current Price":"140.99","Latest MA":"140.43","Latest MA 5":138.5970030518,"Latest MA 9":136.5772246636,"Latest MA 20":134.2517516785,"RSI":75.3564908385,"Price Target":159.2557,"Difference from MA":"0.40%","Difference from Open":"0.85%","Change from Yesterday":"0.29%","Change from Last Report":"0.02","Latest Volume":"506,179","Market Cap":"43,602,571,264","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":18.550657,"PB Ratio":3.7695515,"Previous Close":140.58,"ROE":0.22753,"DTE":76.69,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":0.626,"Trailing PEG":3.5106,"Trailing PE":19.554092,"Trailing PS":19.554092,"Quick Ratio":0.868,"Day High":141.3092,"Day Low":139.2325,"VS Average Volume":0.2572459515,"Company Summary":"Hess Corporation, an exploration and production company, explores, develops, produces, purchases, transports, and sells crude oil, natural gas liquids, and natural gas in the United States, Guyana, the Malaysia\/Thailand Joint Development Area, and Malaysia. It operates in two segments, Exploration and Production, and Midstream. The company also conduct exploration activities principally offshore Guyana, in the U.S. Gulf of America, and offshore Suriname. In addition, the company is involved in gathering, compressing, and processing natural gas; fractionating natural gas liquids; gathering, terminaling, loading, and transporting crude oil and natural gas liquids; and storing and terminaling propane, as well as providing water handling services primarily in the Bakken Shale plays in the Williston Basin area of North Dakota. Hess Corporation was incorporated in 1920 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:57:05"},{"Company Name":"MSCI Inc.","Symbol":"MSCI","Current Price":"552.86","Latest MA":"574.85","Latest MA 5":558.3520048828,"Latest MA 9":561.4833322483,"Latest MA 20":564.2489997559,"RSI":33.0535807794,"Price Target":614.5333,"Difference from MA":"-3.82%","Difference from Open":"0.11%","Change from Yesterday":"-0.28%","Change from Last Report":"-0.26","Latest Volume":"173,912","Market Cap":"42,775,609,344","Earning Date":"22-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":32.44483,"PB Ratio":-44.758743,"Previous Close":554.42,"ROE":null,"DTE":null,"Industry":"Financial Data & Stock Exchanges","Sector":"Financial Services","Beta":1.326,"Trailing PEG":2.7376,"Trailing PE":38.049553,"Trailing PS":38.049553,"Quick Ratio":0.755,"Day High":554.66,"Day Low":547.85,"VS Average Volume":0.3317506796,"Company Summary":"MSCI Inc., together with its subsidiaries, provides critical decision support tools and solutions for the investment community to manage investment processes worldwide. The Index segment provides indexes for use in various areas of the investment process, including indexed financial product, such as ETFs, mutual funds, annuities, futures, options, structured products, and over-the-counter derivatives; performance benchmarking; portfolio construction and rebalancing; and asset allocation, as well as licenses GICS and GICS Direct. The Analytics segment offers risk management, performance attribution and portfolio management content, application, an integrated view of risk and return service, and an analysis of market, credit, liquidity, counterparty, and climate risk across asset classes; managed services, including consolidation of client portfolio data, review and reconciliation of input data and results, and customized reporting; and HedgePlatform to measure, evaluate, and monitor the risk of hedge fund investments. The ESG and Climate segment provides products and services that help institutional investors understand how ESG impacts the long-term risk and return of their portfolio and individual security-level investments; and data, ratings, research, and tools to help investors navigate increasing regulation. The All Other \u0096 Private Assets segment comprising real estate and infrastructure data, benchmarks, return-analytics, climate assessments and market insights; business intelligence to real estate owners, managers, developers, and brokers; and offers investment decision support tools for private capital. The Private Capital Solutions segment offers tools to help private asset investors across mission-critical workflows, such as sourcing terms and conditions, evaluating operating performance, managing risk and other activities supporting private capital investing. MSCI Inc. was incorporated in 1998 and is headquartered in New York, New York.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"12-06-2025 20:57:05"},{"Company Name":"Cognizant Technology Solutions ","Symbol":"CTSH","Current Price":"80.58","Latest MA":"78.83","Latest MA 5":80.6060009155,"Latest MA 9":80.2977776082,"Latest MA 20":80.4585154572,"RSI":55.3379604159,"Price Target":87.37348,"Difference from MA":"2.22%","Difference from Open":"0.44%","Change from Yesterday":"-0.09%","Change from Last Report":"-0.04","Latest Volume":"804,306","Market Cap":"39,721,267,200","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":16.148298,"PB Ratio":2.6663578,"Previous Close":80.65,"ROE":0.16605,"DTE":7.913,"Industry":"Information Technology Services","Sector":"Technology","Beta":0.976,"Trailing PEG":1.9196,"Trailing PE":16.96421,"Trailing PS":16.96421,"Quick Ratio":1.829,"Day High":80.74,"Day Low":79.95,"VS Average Volume":0.2100918018,"Company Summary":"Cognizant Technology Solutions Corporation, a professional services company, provides consulting and technology, and outsourcing services in North America, Europe, and internationally. It operates through four segments: Financial Services; Health Sciences; Products and Resources; and Communications, Media and Technology. The company provides services including artificial intelligence (AI) and other technology services and solutions, consulting, application development, systems integration, digital engineering, quality engineering and assurance, application maintenance, infrastructure, security, cloud, internet of things, enterprise platform services, and business process services and automation. It also offers AI-led automation, which includes advisory, and process and IT automation solutions designed to simplify and accelerate automation adoption; business process outsourcing services, which help deliver business outcomes including revenue growth, increased customer and employee satisfaction, and cost savings; and Cognizant Moment, a digital experience service that uses AI to reimagine customer experiences and engineer strategies aimed at driving growth. In addition, the company develops, licenses, implements, and supports proprietary and third-party software products and platforms; and develops industry-specific products and services. It offers solution to healthcare providers and payers, life sciences companies, banking, capital markets, payments and insurance companies, manufacturers, automakers, retailers, consumer goods, travel and hospitality, communications, media and entertainment, education, information services, and technology companies, as well as businesses providing logistics, energy, and utility services. The company was incorporated in 1988 and is headquartered in Teaneck, New Jersey.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"12-06-2025 20:57:05"},{"Company Name":"Xcel Energy Inc.","Symbol":"XEL","Current Price":"68.72","Latest MA":"68.42","Latest MA 5":68.5639996948,"Latest MA 9":68.7722225952,"Latest MA 20":69.7144999847,"RSI":44.9789238126,"Price Target":75.125,"Difference from MA":"0.43%","Difference from Open":"0.28%","Change from Yesterday":"0.69%","Change from Last Report":"0.07","Latest Volume":"917,750","Market Cap":"39,635,017,728","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":17.94256,"PB Ratio":2.0006406,"Previous Close":68.25,"ROE":0.102589995,"DTE":163.558,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.385,"Trailing PEG":2.6887,"Trailing PE":20.211765,"Trailing PS":20.211765,"Quick Ratio":0.516,"Day High":68.82,"Day Low":68.19,"VS Average Volume":0.2385219049,"Company Summary":"Xcel Energy Inc., through its subsidiaries, engages in the generation, purchasing, transmission, distribution, and sale of electricity in the United States. It operates through Regulated Electric Utility and Regulated Natural Gas Utility segments. The company generates electricity through wind, nuclear, hydroelectric, biomass, and solar energy sources, as well as coal, natural gas, oil, wood, and refuse-derived fuels. It also purchases, transports, distributes, and sells natural gas to retail customers, as well as transports customer-owned natural gas. In addition, the company develops and leases natural gas pipelines, and storage and compression facilities; and invests in rental housing projects and nonregulated assets, as well as procures equipment for the construction of renewable generation facilities. It serves residential, commercial, and industrial customers in the portions of Colorado, Michigan, Minnesota, New Mexico, North Dakota, South Dakota, Texas, and Wisconsin. Xcel Energy Inc. was formerly known as Northern States Power company. The company was incorporated in 1909 and is headquartered in Minneapolis, Minnesota.","Stock Sentiment":"N\/A","Row Color":"positive-row","Last Updated":"12-06-2025 20:57:05"},{"Company Name":"Targa Resources, Inc.","Symbol":"TRGP","Current Price":"168.56","Latest MA":"184.54","Latest MA 5":166.6740025635,"Latest MA 9":165.0511121284,"Latest MA 20":163.0650002747,"RSI":60.9589042358,"Price Target":202.27571,"Difference from MA":"-8.66%","Difference from Open":"0.32%","Change from Yesterday":"-0.71%","Change from Last Report":"0.21","Latest Volume":"704,742","Market Cap":"36,566,056,960","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":20.406778,"PB Ratio":14.952541,"Previous Close":169.78,"ROE":0.41976002,"DTE":630.027,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":1.071,"Trailing PEG":1.3981,"Trailing PE":31.042358,"Trailing PS":31.042358,"Quick Ratio":0.486,"Day High":170.27,"Day Low":167.59,"VS Average Volume":0.3171706125,"Company Summary":"Targa Resources Corp., together with its subsidiary, Targa Resources Partners LP, owns, operates, acquires, and develops a portfolio of complementary domestic infrastructure assets in North America. It operates in two segments, Gathering and Processing, and Logistics and Transportation. The company is involved in gathering, compressing, treating, processing, transporting, and selling natural gas; storing, fractionating, treating, transporting, and selling natural gas liquids (NGL) and NGL products, including services to liquefied petroleum gas exporters; and gathering, storing, terminaling, purchasing, and selling crude oil. It is also involved in the purchase and resale of NGL products; and sale of propane, as well as provision of related logistics services to multi-state retailers, independent retailers, and other end-users. In addition, the company offers NGL balancing services; and transportation services to refineries and petrochemical companies in the Gulf Coast area, as well as purchases, markets, and resells natural gas. As of December 31, 2024, it leased and managed approximately 531 railcars; 131 tractors; and 6 vacuum trucks and 2 pressurized NGL barges, as well as owns 8 tractors. Targa Resources Corp. was incorporated in 2005 and is headquartered in Houston, Texas.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:57:05"},{"Company Name":"Agilent Technologies, Inc.","Symbol":"A","Current Price":"119.43","Latest MA":"126.15","Latest MA 5":118.4411997559,"Latest MA 9":116.0995565389,"Latest MA 20":113.6223005951,"RSI":70.0631622147,"Price Target":136.825,"Difference from MA":"-5.33%","Difference from Open":"0.37%","Change from Yesterday":"-0.25%","Change from Last Report":"0.06","Latest Volume":"617,247","Market Cap":"33,924,747,264","Earning Date":"28-05-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":21.137344,"PB Ratio":5.5261674,"Previous Close":119.72,"ROE":0.18882999,"DTE":60.039,"Industry":"Diagnostics & Research","Sector":"Healthcare","Beta":1.232,"Trailing PEG":1.9435,"Trailing PE":29.415272,"Trailing PS":29.415272,"Quick Ratio":1.417,"Day High":120.04,"Day Low":118.53,"VS Average Volume":0.2674804583,"Company Summary":"Agilent Technologies, Inc. provides application focused solutions to the life sciences, diagnostics, and applied chemical markets worldwide. The company operates in three segments: Life Sciences and Applied Markets, Diagnostics and Genomics, and Agilent CrossLab. The Life Sciences and Applied Markets segment offers liquid chromatography systems and components; liquid chromatography mass spectrometry systems; gas chromatography systems and components; gas chromatography mass spectrometry systems; inductively coupled plasma mass spectrometry instruments; atomic absorption instruments; microwave plasma-atomic emission spectrometry instruments; inductively coupled plasma optical emission spectrometry instruments; raman spectroscopy; laboratory software; information management and analytics; laboratory automation and robotic systems; dissolution testing; and vacuum pumps, and measurement technologies. This segment also offers GC and LC columns, sample preparation products, custom chemistries, and laboratory instrument supplies. The Diagnostics and Genomics segment provides genomics, contract manufacturing and research and development, pathology, companion diagnostics, reagent partnership, and biomolecular analysis businesses; and cell analysis plate based assays, flow cytometers, real-time cell analyzers, cell imaging systems, microplate readers, and related consumables. The Agilent CrossLab segment provides various services, including repairs, parts, maintenance, installations, training, compliance support, software as a service, asset management, and consulting services. The company markets its products through direct sales, distributors, resellers, manufacturer's representatives, and electronic commerce. Agilent Technologies, Inc. was incorporated in 1999 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:59:15"},{"Company Name":"M&T Bank Corporation","Symbol":"MTB","Current Price":"183.08","Latest MA":"186.44","Latest MA 5":184.3601371924,"Latest MA 9":182.6922976264,"Latest MA 20":182.4133710901,"RSI":53.1622190054,"Price Target":200.675,"Difference from MA":"-1.80%","Difference from Open":"-0.22%","Change from Yesterday":"-0.79%","Change from Last Report":"-0.04","Latest Volume":"355,059","Market Cap":"29,387,382,784","Earning Date":"16-07-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":11.245743,"PB Ratio":1.1188563,"Previous Close":184.53,"ROE":0.09405,"DTE":null,"Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.61,"Trailing PEG":28.8816,"Trailing PE":12.2462015,"Trailing PS":12.2462015,"Quick Ratio":null,"Day High":183.72,"Day Low":181.66,"VS Average Volume":0.2710742376,"Company Summary":"M&T Bank Corporation operates as a bank holding company for Manufacturers and Traders Trust Company and Wilmington Trust, National Association that provides retail and commercial banking products and services in the United States. The company operates through three segments: Commercial Bank, Retail Bank, and Institutional Services and Wealth Management. It offers a range of credit products and banking services, such as commercial lending and leasing, letters of credits, deposit products, cash management services, commercial real estate loans, and credit facilities secured by various commercial real estate properties to middle-market and large commercial customers. The company also provides customers deposit products, including demand, savings and time accounts, and other services; automobile and recreational finance loans, home equity loans and lines of credit, credit cards, and other loan products, as well as residential mortgage and real estate loans; business loans, cash management, payroll, and direct deposit services to consumers and small businesses through branch network, telephone banking, internet banking, and automated teller machines. In addition, it offers trustee, agency, investment management, security brokerage, and administrative services; personal trust, planning and advisory, fiduciary, asset management, family office, and other services; and investment products, including mutual funds and annuities, and other services for corporations and institutions, investment bankers, corporate tax, finance and legal executives, and other institutional clients. M&T Bank Corporation was founded in 1856 and is headquartered in Buffalo, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:59:15"},{"Company Name":"Equity Residential","Symbol":"EQR","Current Price":"69.85","Latest MA":"70.11","Latest MA 5":69.3879992676,"Latest MA 9":69.2488888211,"Latest MA 20":69.535500412,"RSI":55.7304155638,"Price Target":77.59524,"Difference from MA":"-0.37%","Difference from Open":"0.50%","Change from Yesterday":"0.84%","Change from Last Report":"0.01","Latest Volume":"392,191","Market Cap":"27,353,819,136","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":41.33136,"PB Ratio":2.4053857,"Previous Close":69.27,"ROE":0.08901,"DTE":70.333,"Industry":"REIT - Residential","Sector":"Real Estate","Beta":0.919,"Trailing PEG":15.8945,"Trailing PE":26.660305,"Trailing PS":26.660305,"Quick Ratio":0.073,"Day High":70.07,"Day Low":69.23,"VS Average Volume":0.1962807891,"Company Summary":"Equity Residential is committed to creating communities where people thrive. The Company, a member of the S&P 500, is focused on the acquisition, development and management of residential properties located in and around dynamic cities that attract affluent long-term renters. Equity Residential owns or has investments in 312 properties consisting of 84,648 apartment units, with an established presence in Boston, New York, Washington, D.C., Seattle, San Francisco and Southern California, and an expanding presence in Denver, Atlanta, Dallas\/Ft. Worth and Austin.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:59:15"},{"Company Name":"Hormel Foods Corporation","Symbol":"HRL","Current Price":"30.91","Latest MA":"30.00","Latest MA 5":30.968000061,"Latest MA 9":30.8833334351,"Latest MA 20":30.4255002098,"RSI":60.7275877918,"Price Target":32.323,"Difference from MA":"3.02%","Difference from Open":"-0.16%","Change from Yesterday":"-0.06%","Change from Last Report":"-0.02","Latest Volume":"612,693","Market Cap":"16,997,253,120","Earning Date":"29-05-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":18.28994,"PB Ratio":2.1161087,"Previous Close":30.93,"ROE":0.09373,"DTE":35.538,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.336,"Trailing PEG":3.2847,"Trailing PE":22.727942,"Trailing PS":22.727942,"Quick Ratio":1.125,"Day High":31.025,"Day Low":30.72,"VS Average Volume":0.1963336114,"Company Summary":"Hormel Foods Corporation develops, processes, and distributes various meat, nuts, and other food products to foodservice, convenience store, and commercial customers in the United States and internationally. It operates through three segments: Retail, Foodservice, and International segments. The company provides various perishable products that include fresh meats, frozen items, refrigerated meal solutions, bacons, sausages, hams, and guacamoles; and shelf-stable products comprising canned luncheon meats, nut butters, snack nuts, chili, shelf-stable microwaveable meals, hash, stews, tortillas, salsas, tortilla chips, nutritional food supplements, and others. It sells its products under the HORMEL, ALWAYS TENDER, APPLEGATE, AUSTIN BLUES, BACON 1, BLACK LABEL, BREAD READY, BURKE, CAFÉ H, CERATTI, CHI-CHI'S, COLUMBUS, COMPLEATS, CORN NUTS, CURE 81, DAN'S PRIZE, DI LUSSO, DINTY MOORE, DON MIGUEL, DOÑA MARIA, EMBASA, FAST \u0091N EASY, FIRE BRAISED, FONTANINI, HERDEZ, HORMEL GATHERINGS, HOUSE OF TSANG, JENNIE-O, JUSTIN'S, LA VICTORIA, LAYOUT, LLOYD'S, MARY KITCHEN, MR. PEANUT, NATURAL CHOICE, NUT-RITION, OLD SMOKEHOUSE, OVEN READY, PILLOW PACK, PLANTERS, ROSA GRANDE, SADLER'S SMOKEHOUSE, SKIPPY, SPAM, SQUARE TABLE, SPECIAL RECIPE, VALLEY FRESH, and WHOLLY brands through sales personnel, independent brokers, and distributors. The company was formerly known as Geo. A. Hormel & Company and changed its name to Hormel Foods Corporation in January 1995. Hormel Foods Corporation was founded in 1891 and is headquartered in Austin, Minnesota.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"12-06-2025 20:59:15"},{"Company Name":"Clorox Company (The)","Symbol":"CLX","Current Price":"126.93","Latest MA":"148.90","Latest MA 5":127.0540007935,"Latest MA 9":128.0666656155,"Latest MA 20":130.5624999847,"RSI":30.3739238483,"Price Target":149.58475,"Difference from MA":"-14.76%","Difference from Open":"0.43%","Change from Yesterday":"0.53%","Change from Last Report":"0.20","Latest Volume":"643,852","Market Cap":"15,644,503,040","Earning Date":"05-05-2025","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":17.411522,"PB Ratio":579.58905,"Previous Close":126.26,"ROE":3.18652,"DTE":1549.474,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":0.533,"Trailing PEG":0.5662,"Trailing PE":22.78815,"Trailing PS":22.78815,"Quick Ratio":0.382,"Day High":127.02,"Day Low":126.0,"VS Average Volume":0.4171790271,"Company Summary":"The Clorox Company engages in the manufacture and marketing of consumer and professional products worldwide. It operates through four segments: Health and Wellness, Household, Lifestyle, and International. The Health and Wellness segment offers home care cleaning and disinfecting products, bleach, clog removers, and laundry additives, primarily under the Clorox, Clorox2, Pine-Sol, Scentiva, Tilex, Liquid-Plumr, Poett, and Formula 409 brands; professional cleaning and disinfecting products under the CloroxPro and Clorox Healthcare brands; professional food service products under the Hidden Valley brand in the United States. The Household segment provides cat litter products under the Fresh Step and Scoop Away brands; bags and wraps under the Glad brand; and grilling products under the Kingsford brand in the United States. The Lifestyle segment offers dressings, dips, seasonings, and sauces primarily under the Hidden Valley brand; water-filtration products under the Brita brand; and natural personal care products under the Burt's Bees brand in the United States. The International segment provides laundry additives, home care products, bags and wraps, cat litter products, water-filtration systems, professional cleaning and disinfecting products, natural personal care products, food products, grilling products, and digestive health products internationally primarily under the Clorox, Glad, Poett, Brita, Burt's Bees, Pine-Sol, Ever Clean, Clorinda, Chux, and Fresh Step brands. The company also offers vitamins, minerals, and supplement products under the Natural Vitality, RenewLife, NeoCell, and Rainbow Light brands. It sells its products primarily through mass retailers; grocery outlets; warehouse clubs; dollar stores; home hardware centers; drug, pet, and military stores; third-party and owned e-commerce channels; and distributors, as well as a direct sales force. The company was founded in 1913 and is headquartered in Oakland, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:59:15"},{"Company Name":"Best Buy Co., Inc.","Symbol":"BBY","Current Price":"72.56","Latest MA":"78.21","Latest MA 5":73.1780003662,"Latest MA 9":71.5699991184,"Latest MA 20":71.0344994812,"RSI":56.4135349382,"Price Target":79.27773,"Difference from MA":"-7.23%","Difference from Open":"0.30%","Change from Yesterday":"-0.12%","Change from Last Report":"0.11","Latest Volume":"1,103,951","Market Cap":"15,335,337,984","Earning Date":"29-05-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.608187,"PB Ratio":5.5490975,"Previous Close":72.65,"ROE":0.30214,"DTE":146.906,"Industry":"Specialty Retail","Sector":"Consumer Cyclical","Beta":1.27,"Trailing PEG":1.7566,"Trailing PE":17.697561,"Trailing PS":17.697561,"Quick Ratio":0.281,"Day High":72.59,"Day Low":71.8205,"VS Average Volume":0.2586030925,"Company Summary":"Best Buy Co., Inc. offers technology products and solutions in the United States, Canada, and internationally. It provides computing and mobile phone products, such as desktops, notebooks, and peripherals; mobile phones comprising related mobile network carrier commissions; networking products; tablets covering e-readers; smartwatches; and consumer electronics consisting of digital imaging, health and fitness products, portable audio comprising headphones and portable speakers, and smart home products, as well as home theaters that includes home theater accessories, soundbars, and televisions. The company's stores also offer appliances, such as dishwashers, laundry, ovens, refrigerators, blenders, coffee makers, vacuums, and personal care; entertainment products consisting of drones, peripherals, movies, and toys, as well as hardware and software, and virtual reality and other software products; and other products, such as baby, food and beverage, luggage, and outdoor living products. In addition, it provides delivery, installation, memberships, repair, set-up, technical support, health-related, and warranty-related services. The company offers its products through stores and websites under the Best Buy, Best Buy Ads, Best Buy Business, Best Buy Essentials, Best Buy Health, Current Health, Geek Squad, Imagine That, Insignia, Lively, My Best Buy, My Best Buy Memberships, Pacific Kitchen, Home, TechLiquidators, and Yardbird brand names, as well as domain names comprising bestbuy.com, currenthealth.com, lively.com, techliquidators.com, yardbird.com, bestbuy.ca, and techliquidators.ca. The company was formerly known as Sound of Music, Inc. Best Buy Co., Inc. was incorporated in 1966 and is headquartered in Richfield, Minnesota.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:59:15"},{"Company Name":"Incyte Corporation","Symbol":"INCY","Current Price":"69.43","Latest MA":"68.14","Latest MA 5":69.4019988403,"Latest MA 9":68.2322209337,"Latest MA 20":66.2094995346,"RSI":70.1104595812,"Price Target":73.88435,"Difference from MA":"1.89%","Difference from Open":"0.70%","Change from Yesterday":"0.84%","Change from Last Report":"0.14","Latest Volume":"554,642","Market Cap":"13,439,564,800","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":11.307817,"PB Ratio":3.6684983,"Previous Close":68.85,"ROE":0.0046900003,"DTE":1.176,"Industry":"Biotechnology","Sector":"Healthcare","Beta":0.676,"Trailing PEG":0.1237,"Trailing PE":347.15,"Trailing PS":347.15,"Quick Ratio":1.879,"Day High":69.515,"Day Low":68.1,"VS Average Volume":0.2609311328,"Company Summary":"Incyte Corporation, a biopharmaceutical company, engages in the discovery, development, and commercialization of therapeutics in the United States, Europe, Canada, and Japan. The company offers JAKAFI (ruxolitinib) for the treatment of intermediate or high-risk myelofibrosis, polycythemia vera, and steroid-refractory acute graft-versus-host disease; MONJUVI (tafasitamab-cxix)\/MINJUVI (tafasitamab) for treating relapsed or refractory diffuse large B-cell lymphoma; PEMAZYRE (pemigatinib), a selective fibroblast growth factor receptor kinase inhibitor for the treatment of unresectable biliary tract cancer, metastatic cholangiocarcinoma, and myeloid\/lymphoid neoplasms; ICLUSIG (ponatinib), a kinase inhibitor to treat chronic myeloid leukemia and Philadelphia-chromosome positive acute lymphoblastic leukemia; ZYNYZ (retifanlimab-dlwr) to treat adults with metastatic or recurrent locally advanced Merkel cell carcinoma; and NIKTIMVO (axatilimab-csfr) for treating chronic graft-versus-host disease, as well as OPZELURA (ruxolitinib) cream for treating atopic dermatitis. Its clinical stage products include INCB123667 (CDK2) for ovarian cancer; INCB161734 (KRASG12D) for cancers; INCA33890 (TGFßR2xPD-1) for solid tumors; Ruxolitinib cream for mild to moderate hidradenitis suppurativa (HS); Povorcitinib for HS, nonsegmental vitiligo, prurigo nodularis, and asthma and chronic spontaneous urticaria; INCB000262 (MRGPRX2) and INCB000547 (MRGPRX4) for systemic immune and neuro-immune disorders; INCA034460 (anti-CD122) for vitiligo; and Zilurgisertib (ALK2) for fibrodysplasia ossificans progressive. It has collaboration with Genesis Therapeutics, Inc. The company sells its products to specialty and retail pharmacies, hospital pharmacies, and specialty distributors and wholesalers. The company was formerly known as Incyte Genomics Inc and changed its name to Incyte Corporation in March 2003. Incyte Corporation was incorporated in 1991 and is headquartered in Wilmington, Delaware.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:59:15"},{"Company Name":"BXP, Inc.","Symbol":"BXP","Current Price":"73.37","Latest MA":"70.11","Latest MA 5":73.1880014648,"Latest MA 9":71.8833335368,"Latest MA 20":69.126999527,"RSI":71.7882007052,"Price Target":75.94737,"Difference from MA":"4.66%","Difference from Open":"0.60%","Change from Yesterday":"0.53%","Change from Last Report":"0.56","Latest Volume":"363,422","Market Cap":"12,967,634,944","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":39.235294,"PB Ratio":2.183501,"Previous Close":72.98,"ROE":0.008,"DTE":209.428,"Industry":"REIT - Office","Sector":"Real Estate","Beta":1.186,"Trailing PEG":0.3765,"Trailing PE":null,"Trailing PS":null,"Quick Ratio":1.014,"Day High":73.61,"Day Low":72.675,"VS Average Volume":0.2295261084,"Company Summary":"BXP, Inc. (NYSE: BXP) is the largest publicly traded developer, owner, and manager of premier workplaces in the United States, concentrated in six dynamic gateway markets - Boston, Los Angeles, New York, San Francisco, Seattle, and Washington, DC. BXP has delivered places that power progress for our clients and communities for more than 50 years. BXP is a fully integrated real estate company, organized as a real estate investment trust (REIT). Including properties owned by unconsolidated joint ventures, BXP's portfolio totals 53.3 million square feet and 185 properties, including seven properties under construction\/redevelopment.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:59:15"},{"Company Name":"Interpublic Group of Companies,","Symbol":"IPG","Current Price":"24.02","Latest MA":"26.33","Latest MA 5":23.5390000153,"Latest MA 9":23.2483334435,"Latest MA 20":23.8132914734,"RSI":61.055056913,"Price Target":34.27222,"Difference from MA":"-8.77%","Difference from Open":"1.33%","Change from Yesterday":"1.12%","Change from Last Report":"-0.37","Latest Volume":"15,804,564","Market Cap":"8,882,883,584","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":8.736363,"PB Ratio":2.4814088,"Previous Close":23.76,"ROE":0.13577,"DTE":113.87,"Industry":"Advertising Agencies","Sector":"Communication Services","Beta":1.049,"Trailing PEG":0.8459,"Trailing PE":18.339695,"Trailing PS":18.339695,"Quick Ratio":0.981,"Day High":24.15,"Day Low":23.18,"VS Average Volume":2.3160263775,"Company Summary":"The Interpublic Group of Companies, Inc. provides advertising and marketing services worldwide. It operates in three segments: Media, Data & Engagement Solutions, Integrated Advertising & Creativity Led Solutions, and Specialized Communications & Experiential Solutions. The Media, Data & Engagement Solutions segment provides media and communications services, digital services and products, advertising and marketing technology, e-commerce services, data management and analytics, strategic consulting, and digital brand experience under the IPG Mediabrands, UM, Initiative, Kinesso, Acxiom, Huge, MRM, and R\/GA brand names. The Integrated Advertising & Creativity Led Solutions segment offers advertising, corporate, and brand identity services; and strategic consulting under FCB, IPG Health, McCann Worldgroup, and MullenLowe Group brands. The Specialized Communications & Experiential Solutions segment provides public relations and other specialized communications services, live events, sports and entertainment marketing, and strategic consulting under IPG DXTRA Health, The Weber Shandwick Collective, Golin, Jack Morton, Momentum, and Octagon brand names. The company was formerly known as McCann-Erickson Incorporated and changed its name to The Interpublic Group of Companies, Inc. in January 1961. The Interpublic Group of Companies, Inc. was founded in 1902 and is headquartered in New York, New York.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"12-06-2025 20:59:15"},{"Company Name":"Henry Schein, Inc.","Symbol":"HSIC","Current Price":"70.97","Latest MA":"71.55","Latest MA 5":70.9500012817,"Latest MA 9":70.6377782525,"Latest MA 20":71.4195006714,"RSI":51.3885400896,"Price Target":76.35286,"Difference from MA":"-0.80%","Difference from Open":"0.54%","Change from Yesterday":"-0.24%","Change from Last Report":"-0.07","Latest Volume":"493,105","Market Cap":"8,871,605,248","Earning Date":"05-05-2025","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":13.648078,"PB Ratio":2.6210437,"Previous Close":71.14,"ROE":0.084680006,"DTE":68.32,"Industry":"Medical Distribution","Sector":"Healthcare","Beta":0.867,"Trailing PEG":1.742,"Trailing PE":22.109034,"Trailing PS":22.109034,"Quick Ratio":0.585,"Day High":71.34,"Day Low":70.32,"VS Average Volume":0.3328590146,"Company Summary":"Henry Schein, Inc. provides health care products and services to office-based dental and medical practitioners, and alternate sites of care worldwide. It operates through Global Distribution and Value-Added Services; Global Specialty Products; and Global Technology segments. The company offers dental merchandise, including infection-control products, handpieces, preventatives, impression materials, composites, anesthetics, teeth, dental implants, gypsum, acrylics, articulators, abrasives, and PPE products; dental equipment, such as dental chairs, delivery units and lights, digital dental laboratories, X-ray supplies and equipment, and high-tech and digital restoration equipment, as well as equipment repair; and branded and generic pharmaceuticals, vaccines, surgical products, diagnostic tests, and vitamins. It also provides financial services on a nonrecourse basis, education services for practitioners, consulting, and other services; and consumable merchandise under its own brand. In addition, the company manufactures, markets, and sells dental implant and biomaterial products; and endodontic, orthodontic and orthopedic products and other health care-related products and services. Further, it is involved in the development and distribution of practice management software, e-services, and other products to health care providers. The company serves customers in dental practices, laboratories, physician practices, and ambulatory surgery centers, as well as government, institutional health care clinics and other alternate care clinics. Henry Schein, Inc. was founded in 1932 and is headquartered in Melville, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:59:15"},{"Company Name":"Paramount Global","Symbol":"PARA","Current Price":"11.99","Latest MA":"11.21","Latest MA 5":12.0649999847,"Latest MA 9":12.0116666285,"Latest MA 20":11.9737499771,"RSI":49.2540030867,"Price Target":11.98,"Difference from MA":"6.97%","Difference from Open":"-1.84%","Change from Yesterday":"-2.00%","Change from Last Report":"0.67","Latest Volume":"6,254,634","Market Cap":"8,500,556,800","Earning Date":"08-05-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":7.358896,"PB Ratio":0.48885354,"Previous Close":12.24,"ROE":-0.27754998,"DTE":91.724,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.207,"Trailing PEG":null,"Trailing PE":null,"Trailing PS":null,"Quick Ratio":1.023,"Day High":12.225,"Day Low":11.8,"VS Average Volume":0.8057125853,"Company Summary":"Paramount Global operates as a media, streaming, and entertainment company worldwide. It operates through TV Media, Direct-to-Consumer, and Filmed Entertainment segments. The TV Media segment operates CBS Television Network, a domestic broadcast television network; CBS Stations, a television station; and international free-to-air networks comprising Network 10, Channel 5, Telefe, and Chilevisión; and domestic premium and basic cable networks, such as Nickelodeon, MTV, CMT, Comedy Central, BET, Paramount+ with SHOWTIME, Paramount Network, The Smithsonian Channel, BET Media Group, CBS Sports Network, and international extensions of these brands. This segment also provides domestic and international television studio operations, including CBS Studios, Paramount Television Studios, and Showtime\/MTV Entertainment Studios; CBS Media Ventures, which produces and distributes first run syndicated programming; and digital properties consist of CBS News Streaming and CBS Sports HQ. The Direct-to-Consumer segment offers a portfolio of domestic and international pay and free streaming services, including Paramount+, Pluto TV, and BET+. The Filmed Entertainment segment produces and acquires films, series, and short-form content for release and licensing around the world, including in theaters, on streaming services, on television, through digital home entertainment, and DVDs\/Blu-rays; and operates a portfolio consist of Paramount Pictures, Paramount Players, Paramount Animation, Nickelodeon Studio, Awesomeness, and Miramax. It provides production, distribution, and advertising solutions. The company was formerly known as ViacomCBS Inc. and changed its name to Paramount Global in February 2022. The company was founded in 1914 and is headquartered in New York, New York. Paramount Global is a subsidiary of National Amusements, Inc.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"12-06-2025 20:59:15"},{"Company Name":"O'Reilly Automotive, Inc.","Symbol":"ORLY","Current Price":"90.89","Latest MA":"87.24","Latest MA 5":90.8662675171,"Latest MA 9":91.0822974989,"Latest MA 20":91.253900177,"RSI":49.098120834,"Price Target":97.24107,"Difference from MA":"4.18%","Difference from Open":"0.93%","Change from Yesterday":"0.98%","Change from Last Report":"0.30","Latest Volume":"2,095,631","Market Cap":"77,696,589,824","Earning Date":"23-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":2.0224745,"PB Ratio":-57.343845,"Previous Close":90.01,"ROE":null,"DTE":null,"Industry":"Auto Parts","Sector":"Consumer Cyclical","Beta":0.6,"Trailing PEG":2.1485,"Trailing PE":33.41544,"Trailing PS":33.41544,"Quick Ratio":0.084,"Day High":91.1,"Day Low":90.0,"VS Average Volume":0.3211558682,"Company Summary":"O'Reilly Automotive, Inc., together with its subsidiaries, operates as a retailer and supplier of automotive aftermarket parts, tools, supplies, equipment, and accessories in the United States, Puerto Rico, Mexico, and Canada. The company provides new and remanufactured automotive hard parts and maintenance items, such as alternators, batteries, brake system components, belts, chassis parts, driveline parts, engine parts, fuel pumps, hoses, starters, temperature control, water pumps, antifreeze, appearance products, engine additives, filters, fluids, lighting products, and oil and wiper blades; and accessories, including floor mats, seat covers, and truck accessories. It also offers auto body paint and related materials, automotive tools, and professional service provider service equipment. In addition, the company provides enhanced services and programs consisting used oil, oil filter, and battery recycling; battery, wiper, and bulb replacement; battery diagnostic testing; electrical and module testing; check engine light code extraction; loaner tool program; drum and rotor resurfacing; custom hydraulic hoses; and professional paint shop mixing and related materials. Further, it offers do-it-yourself and professional service for domestic and imported automobiles, vans, and trucks. The company offers its products under the BesTest, BrakeBest, Cartek, Import Direct, MasterPro, MicroGard, Murray, Omnispark, O'Reilly Auto Parts, Precision, PowerTorque, SuperStart, Syntec, and Ultima brands. O'Reilly Automotive, Inc. was founded in 1957 and is headquartered in Springfield, Missouri.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:59:15"}]