[{"Company Name":"Pfizer, Inc.","Symbol":"PFE","Current Price":"26.36","Latest MA":"27.17","Price Target":31.12955,"Difference from MA":"-3.01%","Difference from Open":"0.21%","Change from Yesterday":"-0.58%","Change from Last Report":"-0.02","Latest Volume":"16,528,318","Market Cap":"149,353,512,960","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":8.989297,"PB Ratio":1.6180624,"Previous Close":26.52,"ROE":0.04538,"DTE":73.408,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.615,"Trailing PEG":0.1987,"Trailing PE":35.14,"Trailing PS":2.5154276,"Quick Ratio":0.64,"Day High":26.465,"Day Low":26.15,"VS Average Volume":0.3809950561,"Company Summary":"Pfizer Inc. discovers, develops, manufactures, markets, distributes, and sells biopharmaceutical products in the United States, Europe, and internationally. The company offers medicines and vaccines in various therapeutic areas, including cardiovascular metabolic, migraine, and women's health under the Eliquis, Nurtec ODT\/Vydura, Zavzpret, and the Premarin family brands; infectious diseases with unmet medical needs under the Prevnar family, Abrysvo, Nimenrix, FSME\/IMMUN-TicoVac, and Trumenba brands; and COVID-19 prevention and treatment, and potential future mRNA and antiviral products under the Comirnaty and Paxlovid brands. It also provides medicines and vaccines in various therapeutic areas, such as biosimilars for chronic immune and inflammatory diseases under the Xeljanz, Enbrel, Inflectra, Litfulo, Velsipity, and Cibinqo brands; amyloidosis, hemophilia, endocrine diseases, and sickle cell disease under the Vyndaqel family, Oxbryta, BeneFIX, Somavert, Ngenla, and Genotropin brands; sterile injectable and anti-infective medicines under the Sulperazon, Medrol, Zavicefta, Zithromax, and Panzyga brands; and biologics, small molecules, immunotherapies, and biosimilars under the Ibrance, Xtandi, Inlyta, Bosulif, Mektovi, Padcev, Adcetris, Talzenna, Tukysa, Elrexfio, Tivdak, Lorbrena, and Braftovi brands. In addition, the company involved in the contract manufacturing business. It serves wholesalers, retailers, hospitals, clinics, government agencies, pharmacies, individual provider offices, retail pharmacies, and integrated delivery systems. The company has collaboration agreements with Bristol-Myers Squibb Company; Astellas Pharma US, Inc.; Merck KGaA; and BioNTech SE, as well as has strategic clinical collaboration with Acepodia Inc. for the development of antibody-cell conjugation-based cell therapies in autoimmune diseases. Pfizer Inc. was founded in 1849 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 18:33:32"},{"Company Name":"Lumen Technologies, Inc.","Symbol":"LUMN","Current Price":"4.93","Latest MA":"5.53","Price Target":5.37091,"Difference from MA":"-10.88%","Difference from Open":"4.23%","Change from Yesterday":"-0.20%","Change from Last Report":"-0.20","Latest Volume":"3,740,472","Market Cap":"5,003,013,120","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":-7.3648043,"PB Ratio":14.629079,"Previous Close":4.94,"ROE":-1.6673199,"DTE":5502.924,"Industry":"Telecom Services","Sector":"Communication Services","Beta":1.201,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.37627956,"Quick Ratio":0.988,"Day High":4.95,"Day Low":4.57,"VS Average Volume":0.2637067556,"Company Summary":"Lumen Technologies, Inc., a facilities-based technology and communications company, provides various integrated products and services to business and residential customers in the United States and internationally. The company operates in two segments, Business and Mass Markets. It offers dark fiber, edge cloud services, internet protocol, managed security, software-defined wide area networks, secure access service edge, unified communications and collaboration, and optical wavelengths services; ethernet and VPN data networks services; and legacy services to manage cash flow, including time division multiplexing voice, private line, and other legacy services, as well as sells communication equipment, and IT solutions. The company also provides high speed and lower speed broadband service to residential and small business customers; local and long-distance voice services, professional services, and other ancillary services; and federal broadband and state support programs. It serves its products and services under the Lumen, Quantum Fiber, and CenturyLink brands. The company was formerly known as CenturyLink, Inc. and changed its name to Lumen Technologies, Inc. in September 2020. Lumen Technologies, Inc. was incorporated in 1968 and is headquartered in Monroe, Louisiana.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"03-02-2025 18:33:32"},{"Company Name":"Super Micro Computer, Inc.","Symbol":"SMCI","Current Price":"27.23","Latest MA":"46.40","Price Target":40.79182,"Difference from MA":"-41.32%","Difference from Open":"0.02%","Change from Yesterday":"-3.79%","Change from Last Report":"-0.42","Latest Volume":"26,534,540","Market Cap":"15,942,006,784","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.379389,"PB Ratio":2.9211376,"Previous Close":28.52,"ROE":0.32469,"DTE":39.749,"Industry":"Computer Hardware","Sector":"Technology","Beta":1.279,"Trailing PEG":null,"Trailing PE":13.544776,"Trailing PS":1.066865,"Quick Ratio":1.805,"Day High":27.58,"Day Low":25.71,"VS Average Volume":0.3729027406,"Company Summary":"Super Micro Computer, Inc., together with its subsidiaries, develops and manufactures high performance server and storage solutions based on modular and open architecture in the United States, Europe, Asia, and internationally. Its solutions range from complete server, storage systems, modular blade servers, blades, workstations, full racks, networking devices, server sub-systems, server management software, and security software. The company provides application-optimized server solutions, rackmount and blade servers, storage, and subsystems and accessories; and server software management solutions, such as Server Management Suite, including Supermicro Server Manager, Supermicro Power Management software, Supermicro Update Manager, SuperCloud Composer, and SuperDoctor 5. In addition, it offers server subsystems and accessories comprising server boards, chassis, power supplies, and other accessories. Further, the company provides server and storage system integration, configuration, and software upgrade and update services; and technical documentation services, as well as identifies service requirements, creates and executes project plans, and conducts verification testing and technical documentation, and training services. Additionally, it offers help desk and on-site product support services for its server and storage systems; and customer support services, including ongoing maintenance and technical support for its products. The company provides its products to enterprise data centers, cloud computing, artificial intelligence, and 5G and edge computing markets. It sells its products through direct and indirect sales force, distributors, value-added resellers, system integrators, and original equipment manufacturers. The company was incorporated in 1993 and is headquartered in San Jose, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"03-02-2025 18:33:32"},{"Company Name":"PayPal Holdings, Inc.","Symbol":"PYPL","Current Price":"88.37","Latest MA":"77.17","Price Target":96.24829,"Difference from MA":"14.51%","Difference from Open":"2.16%","Change from Yesterday":"0.02%","Change from Last Report":"-0.16","Latest Volume":"4,140,371","Market Cap":"88,594,464,768","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":18.032854,"PB Ratio":4.406602,"Previous Close":88.58,"ROE":0.22188,"DTE":65.718,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.436,"Trailing PEG":1.468,"Trailing PE":21.14115,"Trailing PS":2.8163674,"Quick Ratio":0.261,"Day High":88.98,"Day Low":86.0,"VS Average Volume":0.492396603,"Company Summary":"PayPal Holdings, Inc. operates a technology platform that enables digital payments on behalf of merchants and consumers worldwide. It operates a two-sided network at scale that connects merchants and consumers that enables its customers to connect, transact, and send and receive payments through online and in person, as well as transfer and withdraw funds using various funding sources, such as bank accounts, PayPal or Venmo account balance, PayPal and Venmo branded credit products comprising its installment products, credit and debit cards, and cryptocurrencies, as well as other stored value products, including gift cards and eligible rewards. The company provides payment solutions under the PayPal, PayPal Credit, Braintree, Venmo, Xoom, Zettle, Hyperwallet, Honey, and Paidy names. The company was founded in 1998 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 18:33:32"},{"Company Name":"Advanced Micro Devices, Inc.","Symbol":"AMD","Current Price":"114.28","Latest MA":"144.11","Price Target":169.81767,"Difference from MA":"-20.70%","Difference from Open":"0.55%","Change from Yesterday":"-1.26%","Change from Last Report":"-0.02","Latest Volume":"13,977,627","Market Cap":"185,454,723,072","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":23.10881,"PB Ratio":3.2548203,"Previous Close":115.95,"ROE":0.03262,"DTE":3.927,"Industry":"Semiconductors","Sector":"Technology","Beta":1.706,"Trailing PEG":0.3206,"Trailing PE":102.03571,"Trailing PS":7.6334524,"Quick Ratio":1.575,"Day High":115.16,"Day Low":112.98,"VS Average Volume":0.3871887196,"Company Summary":"Advanced Micro Devices, Inc. operates as a semiconductor company worldwide. It operates through Data Center, Client, Gaming, and Embedded segments. The company offers x86 microprocessors and graphics processing units (GPUs) as an accelerated processing unit, chipsets, data center, and professional GPUs; and embedded processors, and semi-custom system-on-chip (SoC) products, microprocessor and SoC development services and technology, data processing unites, field programmable gate arrays (FPGA), and adaptive SoC products. It provides processors under the AMD Ryzen, AMD Ryzen PRO, Ryzen Threadripper, Ryzen Threadripper PRO, AMD Athlon, AMD Athlon PRO, and AMD PRO A-Series brand names; graphics under the AMD Radeon graphics and AMD Embedded Radeon graphics; and professional graphics under the AMD Radeon Pro graphics brand name. In addition, the company offers data center graphics under the Radeon Instinct and Radeon PRO V-series brands, as well as servers under the AMD Instinct accelerators brand; server microprocessors under the AMD EPYC brands; low power solutions under the AMD Athlon, AMD Geode, AMD Ryzen, AMD EPYC, AMD R-Series, and G-Series brands; FPGA products under the Virtex-6, Virtex-7, Virtex UltraScale+, Kintex-7, Kintex UltraScale, Kintex UltraScale+, Artix-7, Artix UltraScale+, Spartan-6, and Spartan-7 brands; adaptive SOCs under the Zynq-7000, Zynq UltraScale+ MPSoC, Zynq UltraScale+ RFSoCs, Versal HBM, Versal Premium, Versal Prime, Versal AI Core, Versal AI Edge, Vitis, and Vivado brands; and compute and network acceleration board products under the Alveo brand. It serves original equipment and design manufacturers, public cloud service providers, system integrators, independent distributors, and add-in-board manufacturers through its direct sales force, and sales representatives. Advanced Micro Devices, Inc. was incorporated in 1969 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 18:33:32"},{"Company Name":"Amcor plc","Symbol":"AMCR","Current Price":"9.56","Latest MA":"10.27","Price Target":11.29556,"Difference from MA":"-6.95%","Difference from Open":"-0.31%","Change from Yesterday":"-1.49%","Change from Last Report":"0.05","Latest Volume":"9,786,268","Market Cap":"13,817,594,880","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":12.041641,"PB Ratio":3.523811,"Previous Close":9.72,"ROE":0.1958,"DTE":196.619,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":0.863,"Trailing PEG":1.9257,"Trailing PE":18.037924,"Trailing PS":1.0197487,"Quick Ratio":0.591,"Day High":9.595,"Day Low":9.4,"VS Average Volume":0.6169715746,"Company Summary":"Amcor plc develops, produces, and sells packaging products in Europe, North America, Latin America, and the Asia Pacific. The company operates in two segments, Flexibles and Rigid Packaging. The Flexibles segment offers flexible and film packaging products in the food and beverage, medical and pharmaceutical, fresh produce, snack food, personal care, and other industries. The Rigid Packaging segment provides rigid containers for various beverage and food products, including carbonated soft drinks, water, juices, sports drinks, milk-based beverages, spirits and beer, sauces, dressings, spreads, and personal care items; and plastic caps for various applications. It sells its products through its direct sales force. The company was incorporated in 1926 and is headquartered in Zurich, Switzerland.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 18:33:32"}]