[{"Company Name":"Range Resources Corporation","Symbol":"RRC","Current Price":"37.50","Latest MA":"33.34","Price Target":39.925,"Difference from MA":"12.48%","Difference from Open":"-1.13%","Change from Yesterday":"-1.29%","Change from Last Report":"0.00","Latest Volume":"3,398,731","Market Cap":"9,049,124,864","Earning Date":"2025-02-25","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":12.626263,"PB Ratio":2.2925963,"Previous Close":37.99,"ROE":0.06916,"DTE":46.251,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":"N\/A","Trailing PEG":null,"Trailing PE":18.75,"Trailing PS":3.743819,"Quick Ratio":0.476,"Day High":38.24,"Day Low":36.98,"VS Average Volume":1.4618751161,"Company Summary":"Range Resources Corporation operates as an independent natural gas, natural gas liquids (NGLs), crude oil, and condensate company in the United States. The company engages in the exploration, development, and acquisition of natural gas and crude oil properties located in the Appalachian region. It sells natural gas to utilities, marketing and midstream companies, and industrial users; NGLs to petrochemical end users, marketers\/traders, and natural gas processors; and oil and condensate to crude oil processors, transporters, and refining and marketing companies. The company was formerly known as Lomak Petroleum Inc. and changed its name to Range Resources Corporation in August 1998. Range Resources Corporation was founded in 1976 and is headquartered in Fort Worth, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"26-02-2025 12:56:23"},{"Company Name":"First Solar, Inc.","Symbol":"FSLR","Current Price":"147.46","Latest MA":"201.49","Price Target":262.56287,"Difference from MA":"-26.81%","Difference from Open":"-2.30%","Change from Yesterday":"-3.56%","Change from Last Report":"0.00","Latest Volume":"5,009,408","Market Cap":"15,786,773,504","Earning Date":"2025-02-25","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.0690317,"PB Ratio":1.9789305,"Previous Close":152.91,"ROE":0.17621,"DTE":7.644,"Industry":"Solar","Sector":"Technology","Beta":"N\/A","Trailing PEG":0.2173,"Trailing PE":12.257689,"Trailing PS":3.753136,"Quick Ratio":1.664,"Day High":152.6699,"Day Low":146.19,"VS Average Volume":2.3419742605,"Company Summary":"First Solar, Inc., a solar technology company, provides photovoltaic (PV) solar energy solutions in the United States, France, Japan, Chile, and internationally. The company manufactures and sells PV solar modules with a thin film semiconductor technology that provides a lower-carbon alternative to conventional crystalline silicon PV solar modules. It designs, manufactures, and sells cadmium telluride solar modules that converts sunlight into electricity. The company's residual business operations include project development activities, operations and maintenance services, and the sale of PV solar power systems to third-party customers. It serves developers and operators of systems, utilities, independent power producers, commercial and industrial companies, and other system owners. The company was formerly known as First Solar Holdings, Inc. and changed its name to First Solar, Inc. in 2006. First Solar, Inc. was founded in 1999 and is headquartered in Tempe, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:56:23"},{"Company Name":"Owens Corning Inc","Symbol":"OC","Current Price":"159.00","Latest MA":"177.56","Price Target":200.08,"Difference from MA":"-10.46%","Difference from Open":"-1.43%","Change from Yesterday":"-2.39%","Change from Last Report":"0.00","Latest Volume":"2,362,106","Market Cap":"13,600,955,392","Earning Date":"2025-02-24","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":9.689214,"PB Ratio":2.6745164,"Previous Close":162.89,"ROE":0.12527001,"DTE":109.688,"Industry":"Building Products & Equipment","Sector":"Industrials","Beta":1.459,"Trailing PEG":null,"Trailing PE":21.544716,"Trailing PS":1.2392671,"Quick Ratio":0.699,"Day High":164.0,"Day Low":158.4101,"VS Average Volume":2.8936561702,"Company Summary":"Owens Corning engages in the provision of residential and commercial building products in the United States, Europe, the Asia Pacific, and internationally. It operates through four segments: Roofing, Insulation, Doors, and Composites. The Roofing segment manufactures and sells residential roofing shingles, oxidized asphalt materials, and roofing components primarily used in residential and commercial construction. The Insulation segment manufactures and sells thermal and acoustical batts, loose fill insulation, spray foam insulation, foam sheathing, and accessories. It also manufactures and sells glass fiber pipe insulation, energy efficient flexible duct media, bonded and granulated stone wool insulation, cellular glass insulation, and foam insulation used in above- and below-grade construction applications. The Doors segment manufactures and sells interior and exterior doors and door systems primarily used in residential construction. The Composites segment manufactures, fabricates, and sells glass reinforcements in the form of fiber. The company was founded in 1938 and is headquartered in Toledo, Ohio.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:56:23"},{"Company Name":"Coterra Energy Inc.","Symbol":"CTRA","Current Price":"27.38","Latest MA":"25.23","Price Target":34.5063,"Difference from MA":"8.54%","Difference from Open":"3.32%","Change from Yesterday":"-2.14%","Change from Last Report":"0.00","Latest Volume":"11,189,796","Market Cap":"20,863,012,864","Earning Date":"2025-02-24","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":11.751073,"PB Ratio":1.5357002,"Previous Close":27.98,"ROE":0.08565,"DTE":26.923,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":0.239,"Trailing PEG":null,"Trailing PE":18.13245,"Trailing PS":3.8203647,"Quick Ratio":1.794,"Day High":27.77,"Day Low":26.345,"VS Average Volume":1.8879355681,"Company Summary":"Coterra Energy Inc., an independent oil and gas company, engages in the development, exploration, and production of oil, natural gas, and natural gas liquids in the United States. The company's properties include the Marcellus Shale with approximately 186,000 net acres in the dry gas window of the play located in Susquehanna County, Pennsylvania; Permian Basin properties with approximately 296,000 net acres located in west Texas and southeast New Mexico; and Anadarko Basin properties with approximately 182,000 net acres located in Oklahoma. It also operates natural gas and saltwater gathering and disposal systems in Texas. The company sells its natural gas to industrial customers, local distribution companies, oil and gas marketers, major energy companies, pipeline companies, and power generation facilities. Coterra Energy Inc. was incorporated in 1989 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 12:56:23"},{"Company Name":"Hims & Hers Health, Inc.","Symbol":"HIMS","Current Price":"39.86","Latest MA":"25.40","Price Target":42.45,"Difference from MA":"56.94%","Difference from Open":"-0.05%","Change from Yesterday":"-22.32%","Change from Last Report":"0.00","Latest Volume":"77,381,305","Market Cap":"8,855,536,640","Earning Date":"2025-02-24","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":86.652176,"PB Ratio":18.462252,"Previous Close":51.31,"ROE":0.30712998,"DTE":2.38,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":1.35,"Trailing PEG":4.5239,"Trailing PE":75.20755,"Trailing PS":5.997597,"Quick Ratio":1.384,"Day High":43.22,"Day Low":36.02,"VS Average Volume":4.6026963923,"Company Summary":"Hims & Hers Health, Inc. operates a telehealth platform that connects consumers to licensed healthcare professionals in the United States, the United Kingdom, and internationally. The company offers a range of curated prescription and non-prescription health and wellness products and services available to purchase on its websites and mobile application directly by customers. It also provides prescription medication on a recurring basis and ongoing care from healthcare providers; and over-the-counter drug and device products, cosmetics, and supplement products primarily focusing on general wellness, sexual health and wellness, skincare, and hair care. In addition, the company's curated non-prescription products include melatonin and biotin in the wellness specialty category; moisturizers, creams, sunscreen, serum, face oil, and face wash in the skincare specialty; condoms, climax delay spray and wipes, vibrators, and lubricants in the sexual health and wellness specialty; and shampoos, conditioners, scalp scrubs, and topical treatments, such as minoxidil in the hair care specialty category. Further, it offers medical consultation and post-consultation support services, as well as health and wellness products through wholesale partners. Hims & Hers Health, Inc. is based in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"26-02-2025 12:56:23"},{"Company Name":"Civitas Resources, Inc.","Symbol":"CIVI","Current Price":"40.35","Latest MA":"52.44","Price Target":69.0,"Difference from MA":"-23.05%","Difference from Open":"-11.04%","Change from Yesterday":"-18.15%","Change from Last Report":"0.00","Latest Volume":"7,247,140","Market Cap":"3,753,247,744","Earning Date":"2025-02-24","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":4.4585633,"PB Ratio":0.5717889,"Previous Close":49.3,"ROE":0.13095,"DTE":69.22,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":1.483,"Trailing PEG":0.2942,"Trailing PE":4.769503,"Trailing PS":0.7208347,"Quick Ratio":0.384,"Day High":45.36,"Day Low":40.265,"VS Average Volume":5.5494007345,"Company Summary":"Civitas Resources, Inc., an exploration and production company, focuses on the acquisition, development, and production of oil and natural gas in the Rocky Mountain region, primarily in the Field of the Denver-Julesburg Basin of Colorado. It also holds interest in production wells. The company was formerly known as Bonanza Creek Energy, Inc. Civitas Resources, Inc. was founded in 1999 and is based in Denver, Colorado.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:56:23"},{"Company Name":"Zoom Communications, Inc.","Symbol":"ZM","Current Price":"74.22","Latest MA":"74.65","Price Target":91.4869,"Difference from MA":"-0.58%","Difference from Open":"-4.15%","Change from Yesterday":"-8.48%","Change from Last Report":"0.00","Latest Volume":"10,950,609","Market Cap":"22,748,059,648","Earning Date":"2025-02-24","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":14.030246,"PB Ratio":2.546403,"Previous Close":81.1,"ROE":0.119169995,"DTE":0.419,"Industry":"Software - Application","Sector":"Technology","Beta":-0.005,"Trailing PEG":2.9605,"Trailing PE":23.121496,"Trailing PS":4.875873,"Quick Ratio":4.354,"Day High":77.5,"Day Low":72.51,"VS Average Volume":4.236631945,"Company Summary":"Zoom Communications Inc. provides unified communications platform in the Americas, the Asia Pacific, Europe, the Middle East, and Africa. The company offers Zoom Meetings that offers HD video, voice, chat, and content sharing through mobile devices, desktops, laptops, telephones, and conference room systems; Zoom Phone, an enterprise cloud phone system; and Zoom Chat enables users to share messages, images, audio files, and content in desktop, laptop, tablet, and mobile devices. It also provides Zoom Rooms, a software-based conference room system; Zoom Conference Room Connector, a gateway for SIP\/H.323 endpoints to join Zoom meetings; Zoom Events, which enables users to manage and host internal and external virtual events; OnZoom, a prosumer-focused virtual event platform and marketplace for Zoom users to create, host, and monetize online events; and Zoom Webinars to provide video presentations to large audiences from many devices. In addition, the company offers Zoom Developer Platform that enables developers, platform integrators, service providers, and customers to build apps and integrations using Zoom's video-based communications solutions, as well as integrate Zoom's technology into their products and services; Zoom App Marketplace, which helps developers to publish their apps, as well as third-party integrations of Zoom; and Zoom Contact Center, an omnichannel contact center solution. It serves individuals; and education, entertainment\/media, enterprise infrastructure, finance, government, healthcare, manufacturing, non-profit\/not for profit and social impact, retail\/consumer products, and software\/Internet industries. The company was formerly known as Zoom Video Communications, Inc. and changed its name to Zoom Communications, Inc. in November 2024. The company was incorporated in 2011 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:56:23"},{"Company Name":"Primoris Services Corporation","Symbol":"PRIM","Current Price":"70.51","Latest MA":"67.70","Price Target":89.375,"Difference from MA":"4.15%","Difference from Open":"3.22%","Change from Yesterday":"9.62%","Change from Last Report":"0.00","Latest Volume":"2,570,610","Market Cap":"3,789,743,360","Earning Date":"2025-02-24","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":17.987246,"PB Ratio":2.6872213,"Previous Close":64.32,"ROE":0.13675,"DTE":75.784,"Industry":"Engineering & Construction","Sector":"Industrials","Beta":1.144,"Trailing PEG":null,"Trailing PE":21.302116,"Trailing PS":0.59523165,"Quick Ratio":1.235,"Day High":71.18,"Day Low":65.4,"VS Average Volume":3.6078686205,"Company Summary":"Primoris Services Corporation, a specialty contractor company, provides a range of specialty construction, fabrication, maintenance, replacement, and engineering services in the United States and Canada. The company operates through Utilities and Energy\/Renewables segments. The Utilities segment offers installation and maintenance services for new and existing natural gas distribution systems, electric utility distribution and transmission systems, and communications systems. The Energy\/Renewables segment provides a range of services, including engineering, procurement, and construction, as well as retrofits, highway and bridge construction, demolition, site work, soil stabilization, excavation, flood control, upgrades, repairs, outages, and maintenance services to renewable energy and energy storage, renewable fuels, petroleum, and petrochemical industries, as well as state departments of transportation. It also offers pipeline construction and maintenance, and storage services; pipeline facility, and integrity services. Primoris Services Corporation was founded in 1960 and is headquartered in Dallas, Texas.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"26-02-2025 12:56:23"},{"Company Name":"ONEOK, Inc.","Symbol":"OKE","Current Price":"95.77","Latest MA":"95.82","Price Target":110.12737,"Difference from MA":"-0.05%","Difference from Open":"-2.43%","Change from Yesterday":"-2.40%","Change from Last Report":"0.00","Latest Volume":"7,091,001","Market Cap":"59,771,105,280","Earning Date":"2025-02-24","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":16.041876,"PB Ratio":3.3129234,"Previous Close":98.12,"ROE":0.16875,"DTE":166.619,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":1.659,"Trailing PEG":2.5011,"Trailing PE":18.524178,"Trailing PS":2.9986007,"Quick Ratio":0.515,"Day High":98.88,"Day Low":92.36,"VS Average Volume":2.0357883561,"Company Summary":"ONEOK, Inc. engages in gathering, processing, fractionation, storage, transportation, and marketing of natural gas and natural gas liquids (NGL) in the United States. It operates through four segments: Natural Gas Gathering and Processing, Natural Gas Liquids, Natural Gas Pipelines, and Refined Products and Crude. The company owns natural gas gathering pipelines and processing plants in the Mid-Continent and Rocky Mountain regions; and provides midstream services to producers of NGLs. It also owns NGL gathering and distribution pipelines in Oklahoma, Kansas, Texas, New Mexico, Montana, North Dakota, Wyoming, and Colorado; terminal and storage facilities in Kansas, Nebraska, Iowa, and Illinois; NGL distribution pipelines in Kansas, Nebraska, Iowa, Illinois, and Indiana; transports refined petroleum products, including unleaded gasoline and diesel; and owns and operates truck- and rail-loading, and -unloading facilities connected to NGL fractionation, storage, and pipeline assets. In addition, the company transports and stores natural gas through regulated interstate and intrastate natural gas transmission pipelines, and natural gas storage facilities. Further, it owns and operates a parking garage in downtown Tulsa, Oklahoma; and leases excess office space and rail cars. Additionally, the company transports, stores, and distributes refined products, NGLs, and crude oil, as well as conducts commodity-related activities, including liquids blending and marketing activities. It serves integrated and independent exploration and production companies; other NGL and natural gas gathering and processing companies; crude oil and natural gas production companies; utilities; industrial companies; natural gasoline distributors; propane distributors; municipalities; ethanol producers; petrochemical, refining, and marketing companies; and heating fuel users, refineries, and exporters. ONEOK, Inc. was founded in 1906 and is headquartered in Tulsa, Oklahoma.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:56:23"},{"Company Name":"Realty Income Corporation","Symbol":"O","Current Price":"56.24","Latest MA":"57.25","Price Target":61.65,"Difference from MA":"-1.77%","Difference from Open":"0.99%","Change from Yesterday":"-1.87%","Change from Last Report":"0.00","Latest Volume":"9,770,128","Market Cap":"50,138,578,944","Earning Date":"2025-02-24","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":35.37107,"PB Ratio":1.2908853,"Previous Close":57.31,"ROE":0.02404,"DTE":67.16,"Industry":"REIT - Retail","Sector":"Real Estate","Beta":1.01,"Trailing PEG":5.8746,"Trailing PE":57.387756,"Trailing PS":9.497859,"Quick Ratio":0.622,"Day High":56.46,"Day Low":54.14,"VS Average Volume":1.9633266637,"Company Summary":"Realty Income (NYSE: O), an S&P 500 company, is real estate partner to the world's leading companies. Founded in 1969, we invest in diversified commercial real estate and have a portfolio of 15,450 properties in all 50 U.S. states, the U.K., and six other countries in Europe. We are known as \"The Monthly Dividend Company\" and have a mission to deliver stockholders dependable monthly dividends that grow over time. Since our founding, we have declared 649 consecutive monthly dividends and are a member of the S&P 500 Dividend Aristocrats index for having increased our dividend for the last 29 consecutive years.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"26-02-2025 12:56:23"},{"Company Name":"Cleveland-Cliffs Inc.","Symbol":"CLF","Current Price":"10.79","Latest MA":"12.00","Price Target":12.38889,"Difference from MA":"-10.06%","Difference from Open":"0.28%","Change from Yesterday":"-3.23%","Change from Last Report":"0.00","Latest Volume":"38,460,394","Market Cap":"5,329,655,808","Earning Date":"2025-02-24","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":27.666668,"PB Ratio":0.7601268,"Previous Close":11.15,"ROE":-0.094280005,"DTE":102.436,"Industry":"Steel","Sector":"Basic Materials","Beta":1.951,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.27780327,"Quick Ratio":0.491,"Day High":11.1575,"Day Low":10.0,"VS Average Volume":2.4333227675,"Company Summary":"Cleveland-Cliffs Inc. operates as a flat-rolled steel producer in North America. The company offers hot-rolled, cold-rolled, electrogalvanized, hot-dip galvanized, hot-dip galvannealed, aluminized, galvalume, enameling, and advanced high-strength steel products; austenitic, martensitic, duplex, precipitation hardening, and ferritic stainless steel products; plates; and grain oriented and non-oriented electrical steel products, as well as slab, scrap, iron ore, coal, and coke. It also provides tubular components, including carbon steel, stainless steel, and electric resistance welded tubing. In addition, the company offers tinplate products, such as electrolytic tin coated and chrome coated sheet, and tin mill products; tooling and sampling; ingots, rolled blooms, and cast blooms; and hot-briquetted iron products. Further, it owns five iron ore mines in Minnesota and Michigan. The company serves automotive, infrastructure and manufacturing, distributors and converters, and steel producers. The company was formerly known as Cliffs Natural Resources Inc. and changed its name to Cleveland-Cliffs Inc. in August 2017. Cleveland-Cliffs Inc. was founded in 1847 and is headquartered in Cleveland, Ohio.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"26-02-2025 12:56:23"},{"Company Name":"KBR, Inc.","Symbol":"KBR","Current Price":"48.24","Latest MA":"62.05","Price Target":72.88889,"Difference from MA":"-22.25%","Difference from Open":"-5.60%","Change from Yesterday":"-3.85%","Change from Last Report":"0.00","Latest Volume":"3,163,916","Market Cap":"6,388,712,960","Earning Date":"2025-02-24","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":12.43299,"PB Ratio":4.397047,"Previous Close":50.17,"ROE":0.26634002,"DTE":190.661,"Industry":"Engineering & Construction","Sector":"Industrials","Beta":0.837,"Trailing PEG":null,"Trailing PE":17.290323,"Trailing PS":0.82520187,"Quick Ratio":0.951,"Day High":51.67,"Day Low":47.21,"VS Average Volume":2.1367834342,"Company Summary":"KBR, Inc. provides scientific, technology, and engineering solutions to governments and commercial customers worldwide. It operates through Government Solutions and Sustainable Technology Solutions segments. The Government Solutions segment offers life-cycle support solutions to defense, intelligence, space, aviation, and other programs and missions for military and other government agencies in the United States, the United Kingdom, and Australia. Its services cover research and development, advanced prototyping, acquisition support, systems engineering, cyber analytics, space domain awareness, test and evaluation, systems integration and program management, global supply chain management, and operations readiness and support, as well as command, control, communications, computers, intelligence, surveillance, and reconnaissance services. This segment also provides various professional advisory services to the defense, renewable energy, and critical infrastructure sectors. The Sustainable Technology Solutions segment operates portfolio of various proprietary process technologies for ammonia\/syngas, chemical\/petrochemicals, clean refining, and circular process\/circular economy solutions. This segment also provides synergistic services, including advisory and consulting focused on broad-based energy transition and net-zero carbon emission solutions; high-end engineering, design and program management centered around decarbonization, energy efficiency, environmental impact and asset optimization; and digitally-enabled operating and monitoring solutions. KBR, Inc. was founded in 1901 and is headquartered in Houston, Texas.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:56:23"},{"Company Name":"Diamondback Energy, Inc.","Symbol":"FANG","Current Price":"151.92","Latest MA":"177.43","Price Target":211.97067,"Difference from MA":"-14.38%","Difference from Open":"-3.36%","Change from Yesterday":"-2.13%","Change from Last Report":"0.00","Latest Volume":"4,694,356","Market Cap":"44,206,288,896","Earning Date":"2025-02-24","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":10.3770485,"PB Ratio":1.1714629,"Previous Close":155.23,"ROE":0.1292,"DTE":32.816,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":1.839,"Trailing PEG":null,"Trailing PE":9.782357,"Trailing PS":4.0103683,"Quick Ratio":0.363,"Day High":161.47,"Day Low":151.69,"VS Average Volume":2.1383918363,"Company Summary":"Diamondback Energy, Inc., an independent oil and natural gas company, acquires, develops, explores, and exploits unconventional, onshore oil and natural gas reserves in the Permian Basin in West Texas. It focuses on the development of the Spraberry and Wolfcamp formations of the Midland basin; and the Wolfcamp and Bone Spring formations of the Delaware basin, which are part of the Permian Basin in West Texas and New Mexico. The company also owns and operates midstream infrastructure assets, in the Midland and Delaware Basins of the Permian Basin. Diamondback Energy, Inc. was founded in 2007 and is headquartered in Midland, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:56:23"},{"Company Name":"Vipshop Holdings Limited","Symbol":"VIPS","Current Price":"15.14","Latest MA":"13.98","Price Target":16.542078,"Difference from MA":"8.33%","Difference from Open":"3.27%","Change from Yesterday":"6.39%","Change from Last Report":"0.00","Latest Volume":"9,393,150","Market Cap":"7,810,181,120","Earning Date":"2025-02-21","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":6.4152546,"PB Ratio":0.19540781,"Previous Close":14.23,"ROE":0.19570999,"DTE":7.338,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":0.293,"Trailing PEG":null,"Trailing PE":7.646465,"Trailing PS":0.0720358,"Quick Ratio":1.075,"Day High":15.26,"Day Low":14.48,"VS Average Volume":3.00183693,"Company Summary":"Vipshop Holdings Limited operates online platforms in the People's Republic of China. It operates in Vip.com, Shan Shan Outlets, and Others segments. The company offers womenswear, menswear, sportswear and sporting goods, shoes and bags, accessories, baby and children products, skincare and cosmetics, home goods and other lifestyle products, and supermarket products. It also provides internet finance services, including consumer and supplier financing. In addition, the company engages in warehousing, retail business, product procurement, and software development and information technology support activities. The company provides branded products through its vip.com and vipshop.com online platforms, as well as through retail stores. Vipshop Holdings Limited was founded in 2008 and is headquartered in Guangzhou, the People's Republic of China.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 12:56:23"},{"Company Name":"Constellation Energy Corporatio","Symbol":"CEG","Current Price":"264.31","Latest MA":"243.40","Price Target":315.16714,"Difference from MA":"8.59%","Difference from Open":"-0.18%","Change from Yesterday":"-1.27%","Change from Last Report":"0.00","Latest Volume":"5,037,584","Market Cap":"82,688,589,824","Earning Date":"2025-02-21","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":29.531843,"PB Ratio":6.28352,"Previous Close":267.72,"ROE":0.30115,"DTE":66.438,"Industry":"Utilities - Renewable","Sector":"Utilities","Beta":0.829,"Trailing PEG":null,"Trailing PE":22.229605,"Trailing PS":3.5085113,"Quick Ratio":1.114,"Day High":268.05,"Day Low":248.56,"VS Average Volume":1.2913961509,"Company Summary":"Constellation Energy Corporation produces and sells energy products and services in the United States. It operates through five segments: Mid-Atlantic, Midwest, New York, ERCOT, and Other Power Regions. The company offers electricity, natural gas, energy-related products, and sustainable solutions. It has approximately 31,676 megawatts of generating capacity consisting of nuclear, wind, solar, natural gas, and hydroelectric assets. The company serves distribution utilities, municipalities, cooperatives, and commercial, industrial, public sector, and residential customers. The company was incorporated in 2021 and is headquartered in Baltimore, Maryland.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 12:56:23"},{"Company Name":"Cheniere Energy, Inc.","Symbol":"LNG","Current Price":"216.04","Latest MA":"200.57","Price Target":252.78261,"Difference from MA":"7.71%","Difference from Open":"-1.40%","Change from Yesterday":"-1.70%","Change from Last Report":"0.00","Latest Volume":"2,706,665","Market Cap":"48,320,581,632","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":19.101679,"PB Ratio":8.49147,"Previous Close":219.78,"ROE":0.47085997,"DTE":259.612,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.985,"Trailing PEG":2.1494,"Trailing PE":15.224806,"Trailing PS":3.1267362,"Quick Ratio":0.766,"Day High":219.63,"Day Low":211.82,"VS Average Volume":1.3522939383,"Company Summary":"Cheniere Energy, Inc., an energy infrastructure company, primarily engages in the liquefied natural gas (LNG) related businesses in the United States. It owns and operates the Sabine Pass LNG terminal in Cameron Parish, Louisiana; and the Corpus Christi LNG terminal near Corpus Christi, Texas. The company also owns Creole Trail pipeline, a 94-mile natural gas supply pipeline that interconnects the Sabine Pass LNG Terminal with several interstate and intrastate pipelines; and operates Corpus Christi pipeline, a 21.5-mile natural gas supply pipeline that interconnects the Corpus Christi LNG terminal with various interstate and intrastate natural gas pipelines. It is also involved in the LNG and natural gas marketing business. The company was incorporated in 1983 and is headquartered in Houston, Texas.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"26-02-2025 12:56:23"},{"Company Name":"Dropbox, Inc.","Symbol":"DBX","Current Price":"26.42","Latest MA":"27.14","Price Target":28.10222,"Difference from MA":"-2.66%","Difference from Open":"0.69%","Change from Yesterday":"0.61%","Change from Last Report":"0.00","Latest Volume":"7,937,263","Market Cap":"7,750,069,248","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":10.3203125,"PB Ratio":-10.389304,"Previous Close":26.26,"ROE":"N\/A","DTE":"N\/A","Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.612,"Trailing PEG":0.8685,"Trailing PE":18.87143,"Trailing PS":3.0413897,"Quick Ratio":1.375,"Day High":26.915,"Day Low":25.93,"VS Average Volume":2.4181919884,"Company Summary":"Dropbox, Inc. provides a content collaboration platform worldwide. The company's platform allows individuals, families, teams, and organizations to collaborate and sign up for free through its website or app, as well as upgrade to a paid subscription plan for premium features. It serves customers in professional services, technology, media, education, industrial, consumer and retail, and financial services industries. The company was formerly known as Evenflow, Inc. and changed its name to Dropbox, Inc. in October 2009. Dropbox, Inc. was incorporated in 2007 and is based in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"26-02-2025 12:56:23"},{"Company Name":"Southern Company (The)","Symbol":"SO","Current Price":"89.85","Latest MA":"85.53","Price Target":90.46056,"Difference from MA":"5.05%","Difference from Open":"0.71%","Change from Yesterday":"1.08%","Change from Last Report":"0.00","Latest Volume":"4,870,870","Market Cap":"98,547,474,432","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":20.79861,"PB Ratio":2.9680893,"Previous Close":88.89,"ROE":0.1185,"DTE":180.719,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.521,"Trailing PEG":3.0283,"Trailing PE":22.518797,"Trailing PS":3.687602,"Quick Ratio":0.335,"Day High":90.025,"Day Low":88.93,"VS Average Volume":1.0613269883,"Company Summary":"The Southern Company, through its subsidiaries, engages in the generation, transmission, and distribution of electricity. The company also develops, constructs, acquires, owns, and manages power generation assets, including renewable energy projects and sells electricity in the wholesale market; and distributes natural gas in Illinois, Georgia, Virginia, and Tennessee, as well as provides gas marketing services, gas distribution operations, and gas pipeline investments operations. In addition, it owns and operates nuclear, coal, hydro, cogeneration, solar, wind, battery storage, and fuel cell facilities. Further, the constructs, operates, and maintains approximately 77,900 miles of natural gas pipelines and 14 storage facilities with total capacity of 157 Bcf to provide natural gas to residential, commercial, and industrial customers. The company serves approximately 8.9 million electric and gas utility customers. Further, it develops distributed energy and resilience solutions; deploys microgrids for commercial, industrial, governmental, and utility customers; and offers digital wireless communications and fiber optics services. The Southern Company was incorporated in 1945 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"26-02-2025 12:56:23"},{"Company Name":"Grab Holdings Limited","Symbol":"GRAB","Current Price":"4.56","Latest MA":"4.20","Price Target":5.74365,"Difference from MA":"8.60%","Difference from Open":"-4.20%","Change from Yesterday":"-5.39%","Change from Last Report":"0.00","Latest Volume":"37,481,420","Market Cap":"18,536,398,848","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":152.0,"PB Ratio":2.8970776,"Previous Close":4.82,"ROE":-0.02465,"DTE":5.731,"Industry":"Software - Application","Sector":"Technology","Beta":0.902,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":6.627243,"Quick Ratio":2.344,"Day High":4.77,"Day Low":4.55,"VS Average Volume":1.1251897935,"Company Summary":"Grab Holdings Limited engages in the provision of superapps in Cambodia, Indonesia, Malaysia, Myanmar, the Philippines, Singapore, Thailand, and Vietnam. The company offers its Grab ecosystem, a single platform with superapps for driver- and merchant-partners and consumers, that allows access to mobility, delivery, digital financial services, and enterprise sector offerings. Grab Holdings Limited was founded in 2012 and is headquartered in Singapore.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 12:57:32"},{"Company Name":"Bilibili Inc.","Symbol":"BILI","Current Price":"21.30","Latest MA":"18.38","Price Target":25.454168,"Difference from MA":"15.90%","Difference from Open":"0.80%","Change from Yesterday":"3.75%","Change from Last Report":"0.00","Latest Volume":"8,531,427","Market Cap":"8,797,857,792","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":34.91803,"PB Ratio":0.63081205,"Previous Close":20.53,"ROE":-0.09567001,"DTE":34.288,"Industry":"Electronic Gaming & Multimedia","Sector":"Communication Services","Beta":0.805,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.32789257,"Quick Ratio":1.204,"Day High":21.6899,"Day Low":20.83,"VS Average Volume":1.2588444855,"Company Summary":"Bilibili Inc. provides online entertainment services for the young generations in the People's Republic of China. It offers a range of digital content, including professional user generated videos, mobile games, and value-added services, such as live broadcasting, occupationally generated videos, audio drama on Maoer, and comics on Bilibili Comic. The company also provides advertising services; and IP derivatives and other services. In addition, it engages in the business and technology development activities; e-commerce business; and video, comics, and game distribution activities. Bilibili Inc. was founded in 2009 and is headquartered in Shanghai, the People's Republic of China.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 12:57:32"},{"Company Name":"CenterPoint Energy, Inc (Holdin","Symbol":"CNP","Current Price":"34.22","Latest MA":"29.80","Price Target":33.685,"Difference from MA":"14.82%","Difference from Open":"0.15%","Change from Yesterday":"0.06%","Change from Last Report":"0.00","Latest Volume":"7,436,584","Market Cap":"22,302,167,040","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":19.666668,"PB Ratio":2.0909204,"Previous Close":34.2,"ROE":0.10023,"DTE":196.803,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.947,"Trailing PEG":1.9588,"Trailing PE":21.658228,"Trailing PS":2.5803733,"Quick Ratio":0.486,"Day High":34.38,"Day Low":33.705,"VS Average Volume":1.7387469052,"Company Summary":"CenterPoint Energy, Inc. operates as a public utility holding company in the United States. The company operates through two segments, Electric and Natural Gas. The Electric segment includes electric transmission and distribution services to electric customers and electric generation assets, as well as optimizes assets in the wholesale power market. The Natural Gas segment engages in the intrastate natural gas sales, and natural gas transportation and distribution for residential, commercial, industrial and institutional customers in Indiana, Louisiana, Minnesota, Mississippi, Ohio, and Texas; permanent pipeline connections through interconnects with various interstate and intrastate pipeline companies; and provides maintenance and repair services of home appliances to customers in Minnesota and home repair protection plans to natural gas customers in Indiana, Mississippi, Ohio, and Texas through a third party. It serves approximately 2,534,730 metered customers; owned 348 substations with transformer capacity of 79,719 megavolt amperes; and owned and operated 217 miles of intrastate pipeline in Louisiana and Texas. The company was founded in 1866 and is headquartered in Houston, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"26-02-2025 12:57:32"},{"Company Name":"FNF Group of Fidelity National ","Symbol":"FNF","Current Price":"60.93","Latest MA":"58.27","Price Target":70.8,"Difference from MA":"4.57%","Difference from Open":"0.69%","Change from Yesterday":"1.72%","Change from Last Report":"0.00","Latest Volume":"2,205,319","Market Cap":"16,755,749,888","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":9.843296,"PB Ratio":2.160945,"Previous Close":59.9,"ROE":0.17396,"DTE":50.645,"Industry":"Insurance - Specialty","Sector":"Financial Services","Beta":1.43,"Trailing PEG":null,"Trailing PE":13.103226,"Trailing PS":1.224746,"Quick Ratio":39.168,"Day High":61.36,"Day Low":60.29,"VS Average Volume":2.2731825931,"Company Summary":"Fidelity National Financial, Inc., together with its subsidiaries, provides various insurance products in the United States. The company operates through Title, F&G, and Corporate and Other segments. It offers title insurance, escrow, and other title related services, including trust activities, trustee sales guarantees, recordings and reconveyances, and home warranty products. The company also provides technology and transaction services to the real estate and mortgage industries; and mortgage transaction services, including title-related services and facilitation of production and management of mortgage loans. In addition, it offers annuity and life insurance products, such as deferred and immediate annuities, as well as indexed universal life insurance products; and funding agreements and pension risk transfer (PRT) solutions. Further, the company engages in the real estate brokerage business. Fidelity National Financial, Inc. was incorporated in 2005 and is headquartered in Jacksonville, Florida.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 12:57:32"},{"Company Name":"Targa Resources, Inc.","Symbol":"TRGP","Current Price":"194.92","Latest MA":"171.58","Price Target":212.47545,"Difference from MA":"13.61%","Difference from Open":"-1.73%","Change from Yesterday":"-1.79%","Change from Last Report":"0.00","Latest Volume":"2,206,297","Market Cap":"42,513,416,192","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":23.598063,"PB Ratio":16.372953,"Previous Close":198.47,"ROE":0.34414002,"DTE":323.439,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":2.287,"Trailing PEG":1.1568,"Trailing PE":34.017452,"Trailing PS":2.595209,"Quick Ratio":0.56,"Day High":198.015,"Day Low":188.65,"VS Average Volume":1.3608633596,"Company Summary":"Targa Resources Corp., together with its subsidiary, Targa Resources Partners LP, owns, operates, acquires, and develops a portfolio of complementary domestic midstream infrastructure assets in North America. It operates in two segments, Gathering and Processing, and Logistics and Transportation. The company is involved in gathering, compressing, treating, processing, transporting, and selling natural gas; storing, fractionating, treating, transporting, and selling natural gas liquids (NGL) and NGL products, including services to liquefied petroleum gas exporters; and gathering, storing, terminaling, purchasing, and selling crude oil. It is also involved in the purchase and resale of NGL products; and sale of propane, as well as provision of related logistics services to multi-state retailers, independent retailers, and other end-users. In addition, the company offers NGL balancing services; and transportation services to refineries and petrochemical companies in the Gulf Coast area, as well as purchases, markets, and resells natural gas. As of December 31, 2023, it leased and managed approximately 605 railcars; 137 tractors; and 6 vacuum trucks and 2 pressurized NGL barges. Targa Resources Corp. was incorporated in 2005 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 12:57:32"},{"Company Name":"WillScot Holdings Corporation","Symbol":"WSC","Current Price":"33.85","Latest MA":"37.17","Price Target":43.054,"Difference from MA":"-8.93%","Difference from Open":"-0.97%","Change from Yesterday":"-1.23%","Change from Last Report":"0.00","Latest Volume":"2,455,534","Market Cap":"6,214,013,952","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":18.297297,"PB Ratio":6.1001983,"Previous Close":34.27,"ROE":0.02468,"DTE":390.279,"Industry":"Rental & Leasing Services","Sector":"Industrials","Beta":1.409,"Trailing PEG":1.3806,"Trailing PE":225.66664,"Trailing PS":2.5938003,"Quick Ratio":0.751,"Day High":35.005,"Day Low":33.8,"VS Average Volume":1.1112592468,"Company Summary":"WillScot Holdings Corporation designs, delivers, and services onsite and on-demand space solutions in North America. It provides mobile offices, ground level spaces, blast-resistant modules, clearspan structures and complexes, restrooms, containers, climate-controlled storage containers, and portable classrooms. The company also offers space solutions for workspace, collaboration and break, power and connectivity, security and protection, health and safety, and classroom furnishing facilities. It serves customers in energy and industrial, education and government, manufacturing, retail and distribution, healthcare and entertainment, and construction and builder industries. The company was formerly known as WillScot Mobile Mini Holdings Corp. and changed its name to WillScot Holdings Corporation in July 2024. WillScot Holdings Corporation is headquartered in Phoenix, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:57:32"},{"Company Name":"HF Sinclair Corporation","Symbol":"DINO","Current Price":"36.49","Latest MA":"41.54","Price Target":46.08929,"Difference from MA":"-12.16%","Difference from Open":"-0.55%","Change from Yesterday":"-1.16%","Change from Last Report":"0.00","Latest Volume":"2,941,477","Market Cap":"6,874,972,160","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":11.658147,"PB Ratio":0.74098897,"Previous Close":36.92,"ROE":0.01879,"DTE":33.49,"Industry":"Oil & Gas Refining & Marketing","Sector":"Energy","Beta":1.195,"Trailing PEG":null,"Trailing PE":40.098904,"Trailing PS":0.24055186,"Quick Ratio":0.697,"Day High":37.66,"Day Low":36.11,"VS Average Volume":1.1609312308,"Company Summary":"HF Sinclair Corporation operates as an independent energy company. The company produces and markets gasoline, diesel fuel, jet fuel, renewable diesel, specialty lubricant products, specialty chemicals, specialty and modified asphalt, and others. It owns and operates refineries located in Kansas, Oklahoma, New Mexico, Utah, Washington, and Wyoming; and markets its refined products principally in the Southwest United States and Rocky Mountains, Pacific Northwest, and in other neighboring Plains states. In addition, the company supplies fuels to approximately 1,500 independent Sinclair branded stations and licenses the use of the Sinclair brand at approximately 300 additional locations. Further, it produces base oils and other specialized lubricants; and provides petroleum product and crude oil transportation, terminalling, storage, and throughput services to the petroleum sector. HF Sinclair Corporation is headquartered in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:57:32"},{"Company Name":"Americold Realty Trust, Inc.","Symbol":"COLD","Current Price":"22.17","Latest MA":"24.90","Price Target":27.66667,"Difference from MA":"-10.96%","Difference from Open":"-0.89%","Change from Yesterday":"-0.76%","Change from Last Report":"0.00","Latest Volume":"4,728,335","Market Cap":"6,324,369,408","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":48.195652,"PB Ratio":1.9209774,"Previous Close":22.34,"ROE":-0.0273,"DTE":111.291,"Industry":"REIT - Industrial","Sector":"Real Estate","Beta":0.626,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":2.3750477,"Quick Ratio":0.72,"Day High":22.662,"Day Low":22.01,"VS Average Volume":2.4684831285,"Company Summary":"Americold is a global leader in temperature-controlled logistics real estate and value added services. Focused on the ownership, operation, acquisition and development of temperature-controlled warehouses, Americold owns and\/or operates 245 temperature-controlled warehouses, with approximately 1.5 billion refrigerated cubic feet of storage, in North America, Europe, Asia-Pacific, and South America. Americold's facilities are an integral component of the supply chain connecting food producers, processors, distributors and retailers to consumers.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:57:32"},{"Company Name":"Akamai Technologies, Inc.","Symbol":"AKAM","Current Price":"78.05","Latest MA":"97.54","Price Target":107.09217,"Difference from MA":"-19.98%","Difference from Open":"0.71%","Change from Yesterday":"0.52%","Change from Last Report":"0.00","Latest Volume":"4,078,653","Market Cap":"11,732,320,256","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":11.684133,"PB Ratio":2.400283,"Previous Close":77.65,"ROE":0.10657,"DTE":95.003,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.654,"Trailing PEG":1.0585,"Trailing PE":23.868502,"Trailing PS":2.9395707,"Quick Ratio":1.111,"Day High":78.79,"Day Low":76.595,"VS Average Volume":1.9728799048,"Company Summary":"Akamai Technologies, Inc. provides cloud computing, security, and content delivery services in the United States and internationally. The company offers cloud solutions to keep infrastructure, websites, applications, application programming interfaces, and users safe from various cyberattacks and online threats while enhancing performance. It also provides web and mobile performance solutions to enable dynamic websites and applications; media delivery solutions, including video streaming and video player services, game and software delivery, broadcast operations, authoritative domain name system, resolution, and data and analytics; and cloud computing services, such as compute, storage, networking, database, and container management services to build, deploy, and secure applications and workloads. In addition, the company offers content delivery solutions; and an array of service and support to assist customers with integrating, configuring, optimizing, and managing its offerings. It sells its solutions through various channel partners. Akamai Technologies, Inc. was incorporated in 1998 and is headquartered in Cambridge, Massachusetts.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:57:32"},{"Company Name":"Alliant Energy Corporation","Symbol":"LNT","Current Price":"63.75","Latest MA":"58.71","Price Target":63.4025,"Difference from MA":"8.58%","Difference from Open":"-0.39%","Change from Yesterday":"-0.16%","Change from Last Report":"0.00","Latest Volume":"2,783,837","Market Cap":"16,364,114,944","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":19.736841,"PB Ratio":2.336363,"Previous Close":63.85,"ROE":0.10014,"DTE":151.585,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.598,"Trailing PEG":2.5525,"Trailing PE":23.698885,"Trailing PS":4.1105537,"Quick Ratio":0.187,"Day High":64.1492,"Day Low":63.395,"VS Average Volume":1.8223133869,"Company Summary":"Alliant Energy Corporation operates as a utility holding company that provides regulated electricity and natural gas services in the United States. It operates in three segments: Utility Electric Operations, Utility Gas Operations, and Utility Other. The company, through its subsidiary, Interstate Power and Light Company (IPL), primarily generates and distributes electricity, and distributes and transports natural gas to retail customers in Iowa; sells electricity to wholesale customers in Minnesota, Illinois, and Iowa; and generates and distributes steam in Cedar Rapids, Iowa. Alliant Energy Corporation, through its other subsidiary, Wisconsin Power and Light Company (WPL), generates and distributes electricity, and distributes and transports natural gas to retail customers in Wisconsin; and sells electricity to wholesale customers in Wisconsin. It serves retail customers in the farming, agriculture, industrial manufacturing, chemical, packaging, and food industries, as well as wholesale customers comprising municipalities and rural electric cooperatives. In addition, the company owns and operates a short-line rail freight service in Iowa; a Mississippi River barge, rail, and truck freight terminal in Illinois; freight brokerage services; wind turbine blade recycling services; and a rail-served warehouse in Iowa. Further, it holds interests in a natural gas-fired electric generating unit near Sheboygan Falls, Wisconsin; and a wind farm located in Oklahoma. The company was formerly known as Interstate Energy Corp. and changed its name to Alliant Energy Corporation in May 1999. Alliant Energy Corporation was incorporated in 1981 and is headquartered in Madison, Wisconsin.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 12:57:32"},{"Company Name":"Builders FirstSource, Inc.","Symbol":"BLDR","Current Price":"140.78","Latest MA":"169.94","Price Target":179.38889,"Difference from MA":"-17.16%","Difference from Open":"0.98%","Change from Yesterday":"1.59%","Change from Last Report":"0.00","Latest Volume":"2,918,544","Market Cap":"15,995,564,032","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":12.084121,"PB Ratio":3.721582,"Previous Close":138.58,"ROE":0.23877001,"DTE":100.846,"Industry":"Building Products & Equipment","Sector":"Industrials","Beta":2.121,"Trailing PEG":null,"Trailing PE":15.5215,"Trailing PS":0.97531,"Quick Ratio":1.02,"Day High":143.32,"Day Low":138.1275,"VS Average Volume":1.8871808136,"Company Summary":"Builders FirstSource, Inc., together with its subsidiaries, manufactures and supplies building materials, manufactured components, and construction services to professional homebuilders, sub-contractors, remodelers, and consumers in the United States. It offers lumber and lumber sheet goods comprising dimensional lumber, plywood, and oriented strand board products that are used in on-site house framing; manufactured products, such as wood floor and roof trusses, floor trusses, wall panels, stairs, and engineered wood products; and windows, and interior and exterior door units, as well as interior trims and custom products comprising intricate mouldings, stair parts, and columns under the Synboard brand name. The company also provides specialty building products and services, including vinyl, composite and wood siding, exterior trims, metal studs, cement, roofing, insulation, wallboards, ceilings, cabinets, and hardware products; turn-key framing, shell construction, design assistance, and professional installation services. In addition, it offers software products, such as drafting, estimating, quoting, and virtual home design services, which provide software solutions to retailers, distributors, manufacturers, and homebuilders. The company was formerly known as BSL Holdings, Inc. and changed its name to Builders FirstSource, Inc. in October 1999. Builders FirstSource, Inc. was incorporated in 1998 and is based in Irving, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:57:32"},{"Company Name":"LKQ Corporation","Symbol":"LKQ","Current Price":"41.54","Latest MA":"38.81","Price Target":51.14444,"Difference from MA":"7.03%","Difference from Open":"0.70%","Change from Yesterday":"0.70%","Change from Last Report":"0.00","Latest Volume":"2,421,738","Market Cap":"10,765,299,712","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":11.475139,"PB Ratio":1.788744,"Previous Close":41.25,"ROE":0.11349,"DTE":92.987,"Industry":"Auto Parts","Sector":"Consumer Cyclical","Beta":1.286,"Trailing PEG":2.4906,"Trailing PE":15.794677,"Trailing PS":0.7499338,"Quick Ratio":0.474,"Day High":42.01,"Day Low":41.25,"VS Average Volume":1.0997886924,"Company Summary":"LKQ Corporation engages in the distribution of replacement parts, components, and systems used in the repair and maintenance of vehicles and specialty vehicle aftermarket products and accessories. It operates through four segments: Wholesale-North America, Europe, Specialty, and Self Service. The company distributes bumper covers, automotive body panels, and lights, as well as mechanical automotive parts and accessories; salvage products, including mechanical and collision parts comprising engines; transmissions; door assemblies; sheet metal products, such as trunk lids, fenders, and hoods; lights and bumper assemblies; scrap metal and other materials to metals recyclers; and brake pads, discs and sensors, clutches, steering and suspension products, filters, and oil and automotive fluids, as well as electrical products, including spark plugs and batteries. In addition, the company distributes recreational vehicle appliances and air conditioners, towing hitches, truck bed covers, vehicle protection products, marine electronics, cargo management products, wheels, tires, and suspension products. It serves collision and mechanical repair shops, and new and used car dealerships, as well as retail customers. The company operates in the United States, Canada, the United Kingdom, Germany, Belgium, the Netherlands, Luxembourg, Italy, the Czech Republic, Austria, Poland, Slovakia, Taiwan, and other European countries. LKQ Corporation was incorporated in 1998 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 12:57:32"},{"Company Name":"VICI Properties Inc.","Symbol":"VICI","Current Price":"32.62","Latest MA":"31.03","Price Target":35.56522,"Difference from MA":"5.14%","Difference from Open":"1.43%","Change from Yesterday":"2.10%","Change from Last Report":"0.00","Latest Volume":"6,387,051","Market Cap":"34,457,808,896","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":11.948717,"PB Ratio":1.2984635,"Previous Close":31.95,"ROE":0.10345,"DTE":65.488,"Industry":"REIT - Diversified","Sector":"Real Estate","Beta":0.972,"Trailing PEG":null,"Trailing PE":12.7421875,"Trailing PS":8.951929,"Quick Ratio":21.183,"Day High":32.735,"Day Low":32.16,"VS Average Volume":1.059214897,"Company Summary":"VICI Properties Inc. is an S&P 500 experiential real estate investment trust that owns one of the largest portfolios of market-leading gaming, hospitality and entertainment destinations, including Caesars Palace Las Vegas, MGM Grand and the Venetian Resort Las Vegas, three of the most iconic entertainment facilities on the Las Vegas Strip. VICI Properties owns 93 experiential assets across a geographically diverse portfolio consisting of 54 gaming properties and 39 other experiential properties across the United States and Canada. The portfolio is comprised of approximately 127 million square feet and features approximately 60,300 hotel rooms and over 500 restaurants, bars, nightclubs and sportsbooks. Its properties are occupied by industry-leading gaming, leisure and hospitality operators under long-term, triple-net lease agreements. VICI Properties has a growing array of real estate and financing partnerships with leading operators in other experiential sectors, including Bowlero, Cabot, Canyon Ranch, Chelsea Piers, Great Wolf Resorts, Homefield and Kalahari Resorts. VICI Properties also owns four championship golf courses and 33 acres of undeveloped and underdeveloped land adjacent to the Las Vegas Strip. VICI Properties' goal is to own the highest quality and most productive experiential real estate portfolio through a strategy of partnering with the highest quality experiential place makers and operators.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 12:57:32"},{"Company Name":"Walmart Inc.","Symbol":"WMT","Current Price":"97.69","Latest MA":"84.94","Price Target":108.74553,"Difference from MA":"15.00%","Difference from Open":"3.54%","Change from Yesterday":"4.29%","Change from Last Report":"0.00","Latest Volume":"25,797,900","Market Cap":"784,781,869,056","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":35.915443,"PB Ratio":8.617678,"Previous Close":93.67,"ROE":0.21414,"DTE":61.534,"Industry":"Discount Stores","Sector":"Consumer Defensive","Beta":0.552,"Trailing PEG":2.9805,"Trailing PE":40.53527,"Trailing PS":1.1524217,"Quick Ratio":0.197,"Day High":97.91,"Day Low":94.24,"VS Average Volume":1.4776369791,"Company Summary":"Walmart Inc. engages in the operation of retail, wholesale, other units, and eCommerce worldwide. The company operates through three segments: Walmart U.S., Walmart International, and Sam's Club. It operates supercenters, supermarkets, hypermarkets, warehouse clubs, cash and carry stores, and discount stores under Walmart and Walmart Neighborhood Market brands; membership-only warehouse clubs; ecommerce websites, such as walmart.com.mx, walmart.ca, flipkart.com, PhonePe and other sites; and mobile commerce applications. The company offers grocery and consumables, including dairy, meat, bakery, deli, produce, dry, chilled or frozen packaged foods, alcoholic and nonalcoholic beverages, floral, snack foods, candy, other grocery items, health and beauty aids, paper goods, laundry and home care, baby care, pet supplies, and other consumable items; fuel, tobacco and other categories. It is also involved in the provision of health and wellness products covering pharmacy, optical and hearing services, and over-the-counter drugs and other medical products; and home and apparel including home improvement, outdoor living, gardening, furniture, apparel, jewelry, tools and power equipment, housewares, toys, seasonal items, mattresses and tire and battery centers. In addition, the company offers consumer electronics and accessories, software, video games, office supplies, appliances, and third-party gift cards. Further, it operates digital payment platforms; and offers financial services and related products, including money transfers, bill payments, money orders, check cashing, prepaid access, co-branded credit cards, installment lending, and earned wage access. Additionally, the company markets lines of merchandise under private brands, including Allswell, Athletic Works, Equate, and Free Assembly. The company was formerly known as Wal-Mart Stores, Inc. and changed its name to Walmart Inc. in February 2018. Walmart Inc. was founded in 1945 and is based in Bentonville, Arkansas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 12:57:32"},{"Company Name":"Baxter International Inc.","Symbol":"BAX","Current Price":"35.94","Latest MA":"34.20","Price Target":39.9175,"Difference from MA":"5.08%","Difference from Open":"2.72%","Change from Yesterday":"2.45%","Change from Last Report":"0.00","Latest Volume":"8,921,816","Market Cap":"18,387,802,112","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":12.479166,"PB Ratio":2.6368303,"Previous Close":35.08,"ROE":-0.042090002,"DTE":191.472,"Industry":"Medical Instruments & Supplies","Sector":"Healthcare","Beta":0.614,"Trailing PEG":2.366,"Trailing PE":"N\/A","Trailing PS":1.7288268,"Quick Ratio":0.537,"Day High":36.05,"Day Low":34.955,"VS Average Volume":1.8471313078,"Company Summary":"Baxter International Inc., through its subsidiaries, develops and provides a portfolio of healthcare products worldwide. The company operates through four segments: Medical Products and Therapies, Healthcare Systems and Technologies, Pharmaceuticals, and Kidney Care. The company offers sterile intravenous (IV) solutions; infusion systems and devices; parenteral nutrition therapies; generic injectable pharmaceuticals; surgical hemostat and sealant products, advanced surgical equipment; smart bed systems; patient monitoring and diagnostic technologies; and respiratory health devices, as well as advanced equipment for the surgical space, including surgical video technologies, precision positioning devices, and other accessories. It also provides administrative sets; adhesion prevention products; inhaled anesthesia; drug compounding; chronic and acute dialysis therapies and services, including peritoneal dialysis (PD), hemodialysis (HD), continuous renal replacement therapies (CRRT), and other organ support therapies. The company's products are used in hospitals, kidney dialysis centers, nursing homes, rehabilitation centers, ambulatory surgery centers, doctors' offices, and patients at home under physician supervision. The company sells its products through direct sales force, as well as through independent distributors, drug wholesalers, and specialty pharmacy or other alternate site providers in approximately 100 countries. It has an agreement with Celerity Pharmaceutical, LLC to develop acute care generic injectable premix and oncolytic products; and a collaborative research agreement with Miromatrix Medical Inc. aiming to advance care for patients with acute liver failure. Baxter International Inc. was incorporated in 1931 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"26-02-2025 12:57:32"},{"Company Name":"Floor & Decor Holdings, Inc.","Symbol":"FND","Current Price":"100.29","Latest MA":"105.20","Price Target":105.2048,"Difference from MA":"-4.67%","Difference from Open":"1.82%","Change from Yesterday":"2.83%","Change from Last Report":"0.00","Latest Volume":"2,648,320","Market Cap":"10,770,745,344","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":50.145,"PB Ratio":4.961413,"Previous Close":97.53,"ROE":0.1004,"DTE":77.716,"Industry":"Home Improvement Retail","Sector":"Consumer Cyclical","Beta":1.835,"Trailing PEG":null,"Trailing PE":52.78421,"Trailing PS":2.4172578,"Quick Ratio":0.244,"Day High":101.73,"Day Low":98.45,"VS Average Volume":1.7531147456,"Company Summary":"Floor & Decor Holdings, Inc. together with its subsidiaries, operates as a multi-channel specialty retailer of hard surface flooring and related accessories, and commercial surfaces seller in Georgia and Florida. The company offers tile, wood, laminate, vinyl, and natural stone flooring products, as well as decorative accessories, wall tiles, and installation materials and tools; and vanities, shower doors, bath accessories, faucets, sinks, custom countertops, bathroom mirrors, and bathroom lighting. It also sells products through its Website, FloorandDecor.com. The company serves professional installers, commercial businesses, and homeowners. It operates warehouse stores and design centers. The company was formerly known as FDO Holdings, Inc. and changed its name to Floor & Decor Holdings, Inc. in April 2017. Floor & Decor Holdings, Inc. was founded in 2000 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:57:32"},{"Company Name":"Cameco Corporation","Symbol":"CCJ","Current Price":"43.59","Latest MA":"49.06","Price Target":58.759342,"Difference from MA":"-11.16%","Difference from Open":"0.55%","Change from Yesterday":"0.72%","Change from Last Report":"0.00","Latest Volume":"4,472,416","Market Cap":"19,011,690,496","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":36.94068,"PB Ratio":2.981532,"Previous Close":43.28,"ROE":0.027590001,"DTE":20.364,"Industry":"Uranium","Sector":"Energy","Beta":0.948,"Trailing PEG":null,"Trailing PE":161.44444,"Trailing PS":6.0628424,"Quick Ratio":0.802,"Day High":43.91,"Day Low":42.86,"VS Average Volume":1.0921434765,"Company Summary":"Cameco Corporation provides uranium for the generation of electricity. It operates through Uranium, Fuel Services, Westinghouse segments. The Uranium segment is involved in the exploration for, mining, and milling, purchase, and sale of uranium concentrate. The Fuel Services segment engages in the refining, conversion, and fabrication of uranium concentrate, as well as the purchase and sale of conversion services. This segment also produces CANDU reactor fuel bundles and other reactor components. The company offers nuclear fuel processing services. The Westinghouse segment engages in the manufacture of nuclear reactor technology original equipment. This segment provides products and services to commercial utilities and government agencies; and outage and maintenance services, engineering support, instrumentation and controls equipment, plant modification, and components and parts to nuclear reactors. It sells its uranium and fuel services to nuclear utilities in the Americas, Europe, and Asia. Cameco Corporation was incorporated in 1987 and is headquartered in Saskatoon, Canada.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:57:32"},{"Company Name":"Block, Inc.","Symbol":"XYZ","Current Price":"62.84","Latest MA":"76.65","Price Target":96.0422,"Difference from MA":"-18.02%","Difference from Open":"-5.10%","Change from Yesterday":"-4.67%","Change from Last Report":"0.00","Latest Volume":"16,911,257","Market Cap":"38,928,121,856","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":11.593518,"PB Ratio":1.8309491,"Previous Close":65.92,"ROE":0.14358,"DTE":37.29,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":2.524,"Trailing PEG":0.1082,"Trailing PE":13.780702,"Trailing PS":1.6138649,"Quick Ratio":1.493,"Day High":66.39,"Day Low":62.64,"VS Average Volume":2.3359154492,"Company Summary":"Block, Inc., together with its subsidiaries, builds ecosystems focused on commerce and financial products and services in the United States and internationally. It operates through two segments, Square and Cash App. The Square segment offers commerce products for restaurants, appointments, retail, point of sale, online, online checkout, and invoices, as well as virtual terminals, risk and order managers, and payment and commerce application programming interfaces; managed payment services; software solutions; hardware products, such as registers, terminals, stands, and readers for contactless and chips; banking services consisting of lending, instant transfer, and checking and savings accounts; and full-service setup and support services. This segment also provides loyalty, marketing, team management, and payroll services; and gift cards. The Cash App segment offers financial tools within the mobile Cash App, including peer-to-peer payments, bitcoin, and stock investment brokerage; Cash App Card, a debit card; direct deposit, cash boost, and tax preparation services; and Afterpay, a buy now, pay later platform. This segment also provides Pay in 4, monthly payment solutions, advertising and affiliate, shop directory, and Cash App Pay services; and business accounts, and Afterpay and Afterpay Plus cards. In addition, the company operates TIDAL, a platform for musicians and fans; TBD, an open developer platform focused on making the decentralized financial world accessible; Bitkey, a self-custody bitcoin wallet; and Spiral, which focuses on bitcoin open source work. It serves businesses, sellers, and individuals through e-commerce and retail distribution channels. The company was formerly known as Square, Inc. and changed its name to Block, Inc. in December 2021. Block, Inc. was incorporated in 2009 and is based in Oakland, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:57:32"},{"Company Name":"Consolidated Edison, Inc.","Symbol":"ED","Current Price":"100.97","Latest MA":"96.76","Price Target":99.4,"Difference from MA":"4.35%","Difference from Open":"0.73%","Change from Yesterday":"1.29%","Change from Last Report":"0.00","Latest Volume":"3,481,344","Market Cap":"35,007,512,576","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":17.966192,"PB Ratio":1.5934664,"Previous Close":99.68,"ROE":0.08442,"DTE":126.714,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.381,"Trailing PEG":8.6674,"Trailing PE":19.269085,"Trailing PS":2.2946718,"Quick Ratio":0.816,"Day High":101.95,"Day Low":99.72,"VS Average Volume":1.4661432703,"Company Summary":"Consolidated Edison, Inc., through its subsidiaries, engages in the regulated electric, gas, and steam delivery businesses in the United States. It offers electric services to approximately 3.7 million customers in New York City and Westchester County; gas to approximately 1.1 million customers in Manhattan, the Bronx, parts of Queens, and Westchester County; and steam to approximately 1,530 customers in parts of Manhattan. The company also supplies electricity to approximately 0.3 million customers in southeastern New York and northern New Jersey; and gas to approximately 0.2 million customers in southeastern New York. In addition, it operates 545 circuit miles of transmission lines; 15 transmission substations; 63 distribution substations; 90,051 in-service line transformers; 3,788 pole miles of overhead distribution lines; and 2,314 miles of underground distribution lines, as well as 4,363 miles of mains and 380,870 service lines for natural gas distribution. Further, the company invests in electric and gas transmission projects. It primarily sells electricity to industrial, commercial, residential, and government customers. Consolidated Edison, Inc. was founded in 1823 and is based in New York, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"26-02-2025 12:57:32"},{"Company Name":"American Homes 4 Rent","Symbol":"AMH","Current Price":"35.34","Latest MA":"37.04","Price Target":40.15,"Difference from MA":"-4.58%","Difference from Open":"0.71%","Change from Yesterday":"1.61%","Change from Last Report":"0.00","Latest Volume":"3,275,859","Market Cap":"14,896,234,496","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":56.095238,"PB Ratio":1.8243766,"Previous Close":34.78,"ROE":0.060399998,"DTE":64.05,"Industry":"REIT - Residential","Sector":"Real Estate","Beta":0.786,"Trailing PEG":null,"Trailing PE":32.72222,"Trailing PS":8.61703,"Quick Ratio":0.477,"Day High":35.48,"Day Low":34.81,"VS Average Volume":1.4419821505,"Company Summary":"AMH (NYSE: AMH) is a leading large-scale integrated owner, operator and developer of single-family rental homes. We're an internally managed Maryland real estate investment trust (REIT) focused on acquiring, developing, renovating, leasing and managing homes as rental properties. Our goal is to simplify the experience of leasing a home and deliver peace of mind to households across the country. In recent years, we've been named one of Fortune's 2023 Best Workplaces in Real Estate, a 2024 Great Place to Work, a 2023 Most Loved Workplace, a 2023 Top U.S. Homebuilder by Builder100, and one of America's Most Responsible Companies 2024 and Most Trustworthy Companies in America 2024 by Newsweek and Statista Inc. As of March 31, 2024, we owned nearly 60,000 single-family properties in the Southeast, Midwest, Southwest and Mountain West regions of the United States.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:57:32"},{"Company Name":"Rivian Automotive, Inc.","Symbol":"RIVN","Current Price":"11.45","Latest MA":"12.72","Price Target":15.03536,"Difference from MA":"-9.99%","Difference from Open":"-4.02%","Change from Yesterday":"-4.26%","Change from Last Report":"0.00","Latest Volume":"35,827,052","Market Cap":"12,946,629,632","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":-4.178832,"PB Ratio":1.974819,"Previous Close":11.96,"ROE":-0.60447,"DTE":76.272,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":2.042,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":2.6049557,"Quick Ratio":3.618,"Day High":12.185,"Day Low":11.38,"VS Average Volume":1.004061107,"Company Summary":"Rivian Automotive, Inc., together with its subsidiaries, designs, develops, manufactures, and sells electric vehicles and accessories. The company offers consumer vehicles, including a two-row, five-passenger pickup truck under the R1T brand, a three-row, seven-passenger sport utility vehicle under the R1S name. It provides consumer services, such as digital financing and leasing, telematics-based insurance, vehicle maintenance and repair services, software services, and charging solutions. In addition, the company designs, develops, manufactures, and operates the Rivian Adventure Network Direct Current fast chargers, and offers access to Combined Charging Standard, as well as FleetOS, a proprietary, end-to-end centralized fleet management subscription platform. Further, it offers Rivian Commercial Van platform for Electric Delivery Van with collaboration with Amazon.com, Inc. The company sells its products directly to customers in the consumer and commercial markets. Rivian Automotive, Inc. was founded in 2009 and is based in Irvine, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:57:32"},{"Company Name":"Live Nation Entertainment, Inc.","Symbol":"LYV","Current Price":"144.46","Latest MA":"120.12","Price Target":161.34332,"Difference from MA":"20.26%","Difference from Open":"-6.52%","Change from Yesterday":"-6.57%","Change from Last Report":"0.00","Latest Volume":"3,966,765","Market Cap":"33,386,584,064","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":59.694214,"PB Ratio":193.3869,"Previous Close":154.62,"ROE":0.67384005,"DTE":425.218,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.382,"Trailing PEG":4.648,"Trailing PE":52.72263,"Trailing PS":1.4418347,"Quick Ratio":0.838,"Day High":154.58,"Day Low":143.81,"VS Average Volume":1.9205284066,"Company Summary":"Live Nation Entertainment, Inc. operates as a live entertainment company worldwide. It operates through Concerts, Ticketing, and Sponsorship & Advertising segments. The Concerts segment promotes live music events in its owned or operated venues, and in rented third-party venues. This segment operates and manages music venues; produces music festivals; creates and streams associated content; and offers management and other services to artists. The Ticketing segment manages the ticketing operations, including the provision of ticketing software and services to clients and consumers with marketplace for tickets and event information through mobile apps, other websites, retail outlets, and its primary websites, such as livenation.com and ticketmaster.com; and provides ticket resale services. This segment sells tickets for its events and third-party clients in various live event categories. This segment offers ticketing services for arenas, stadiums, amphitheaters, music clubs, concert promoters, professional sports franchises and leagues, college sports teams, performing arts venues, museums, and theaters. The Sponsorship & Advertising segment sells international, national, and local sponsorships and placement of advertising, including signage, online, and promotional programs; rich media offering that comprises advertising related with live streaming and music-related content; and ads across its distribution network of venues, events, and websites. This segment also manages the development of strategic sponsorship programs, as well as develops, books, and produces custom events or programs for specific brands. It owns, operates, or leases entertainment venues. The company was formerly known as Live Nation, Inc. and changed its name to Live Nation Entertainment, Inc. in January 2010. Live Nation Entertainment, Inc. was incorporated in 2005 and is based in Beverly Hills, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 12:57:32"},{"Company Name":"Newmont Corporation","Symbol":"NEM","Current Price":"42.93","Latest MA":"46.45","Price Target":52.53833,"Difference from MA":"-7.57%","Difference from Open":"-1.92%","Change from Yesterday":"-2.52%","Change from Last Report":"0.00","Latest Volume":"12,084,638","Market Cap":"48,376,102,912","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":11.208878,"PB Ratio":1.6252129,"Previous Close":44.04,"ROE":0.11171,"DTE":29.798,"Industry":"Gold","Sector":"Basic Materials","Beta":0.534,"Trailing PEG":null,"Trailing PE":15.01049,"Trailing PS":2.58945,"Quick Ratio":0.623,"Day High":43.87,"Day Low":42.16,"VS Average Volume":1.2316779738,"Company Summary":"Newmont Corporation engages in the production and exploration of gold. It also explores for copper, silver, zinc, and lead. The company has operations and\/or assets in the United States, Canada, Mexico, Dominican Republic, Peru, Suriname, Argentina, Chile, Australia, Papua New Guinea, Ecuador, Fiji, and Ghana. The company was founded in 1916 and is headquartered in Denver, Colorado.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:57:32"},{"Company Name":"Unity Software Inc.","Symbol":"U","Current Price":"25.65","Latest MA":"20.75","Price Target":27.77045,"Difference from MA":"23.59%","Difference from Open":"-4.82%","Change from Yesterday":"-5.98%","Change from Last Report":"0.00","Latest Volume":"27,424,085","Market Cap":"10,507,907,072","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":-24.663462,"PB Ratio":3.290993,"Previous Close":27.28,"ROE":-0.19419001,"DTE":68.679,"Industry":"Software - Application","Sector":"Technology","Beta":2.32,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":5.795052,"Quick Ratio":2.351,"Day High":27.12,"Day Low":24.21,"VS Average Volume":2.4077041553,"Company Summary":"Unity Software Inc. operates a platform that provides real-time 3D content and experiences. Its platform provides artificial intelligence solutions that support creators in building, running, and growing immersive, real-time 2D and 3D content for mobile phones, tablets, PCs, consoles, and augmented and virtual reality devices. The company also offers Create Solutions, a set of tools and services used to build, ship, and run real-time 2D and 3D content; and Grow Solutions, which allows customers to grow and engage their user base and monetize their content. It serves enterprises, mid-market companies, and government and non-profit institutions; mid-sized, small, and independent businesses; and individuals across various industries. The company offers its solutions directly through its online store, field sales operations, independent distributors, and resellers in North America, Denmark, China, Finland, the United Kingdom, Germany, Israel, Japan, Singapore, South Korea, Spain, and internationally. Unity Software Inc. was founded in 2004 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 12:57:32"},{"Company Name":"Alibaba Group Holding Limited","Symbol":"BABA","Current Price":"134.01","Latest MA":"92.35","Price Target":156.79337,"Difference from MA":"45.12%","Difference from Open":"0.92%","Change from Yesterday":"3.85%","Change from Last Report":"0.00","Latest Volume":"38,606,028","Market Cap":"319,302,926,336","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":13.577507,"PB Ratio":0.30983323,"Previous Close":129.04,"ROE":0.102740005,"DTE":24.142,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":0.308,"Trailing PEG":0.7927,"Trailing PE":19.50655,"Trailing PS":0.3252329,"Quick Ratio":0.991,"Day High":134.45,"Day Low":130.75,"VS Average Volume":1.5895109645,"Company Summary":"Alibaba Group Holding Limited, through its subsidiaries, provides technology infrastructure and marketing reach to help merchants, brands, retailers, and other businesses to engage with their users and customers in the People's Republic of China and internationally. The company operates through seven segments: China Commerce, International Commerce, Local Consumer Services, Cainiao, Cloud, Digital Media and Entertainment, and Innovation Initiatives and Others. It operates Taobao and Tmall, which are digital retail platforms; Alimama, a proprietary monetization platform; 1688.com and Alibaba.com, which are online wholesale marketplaces; AliExpress, a retail marketplace; Lazada, Trendyol, and Daraz that are e-commerce platforms; Freshippo, a retail platform for groceries and fresh goods; and Tmall Global, an import e-commerce platform. The company also operates Cainiao Network logistic services platform; Ele.me, an on-demand delivery and local services platform; Koubei, a restaurant and local services guide platform; and Fliggy, an online travel platform. In addition, it offers pay-for-performance, in-feed, and display marketing services; and Taobao Ad Network and Exchange, a real-time online bidding marketing exchange. Further, the company provides elastic computing, storage, network, security, database, big data, and IoT services; and hardware, software license, software installation, and application development and maintenance services. Additionally, it operates Youku, an online video platform; Quark, a platform for information search, storage, and consumption; Alibaba Pictures and other content platforms that provide online videos, films, live events, news feeds, literature, music, and others; Amap, a mobile digital map, navigation, and real-time traffic information app; DingTalk, a business efficiency mobile app; Tmall Genie smart speaker; and Qwen, an artificial intelligence chatbot. The company was incorporated in 1999 and is based in Hangzhou, the People's Republic of China.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"26-02-2025 12:57:32"},{"Company Name":"Wayfair Inc.","Symbol":"W","Current Price":"42.85","Latest MA":"46.80","Price Target":55.88323,"Difference from MA":"-8.44%","Difference from Open":"2.46%","Change from Yesterday":"3.83%","Change from Last Report":"0.00","Latest Volume":"4,654,665","Market Cap":"5,437,879,296","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":52.256096,"PB Ratio":-1.950742,"Previous Close":41.27,"ROE":"N\/A","DTE":"N\/A","Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":3.439,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.45885405,"Quick Ratio":0.7,"Day High":43.2,"Day Low":41.13,"VS Average Volume":1.2801453998,"Company Summary":"Wayfair Inc. provides e-commerce business in the United States and internationally. The company offers approximately thirty million products for the home sector. It offers online selections of furniture, décor, housewares, and home improvement products through its sites consisting of Wayfair, Joss & Main, AllModern, Birch Lane, Perigold, and Wayfair Professional. The company offers its products under the Three Posts and Mercury Row brand name. The company was founded in 2002 and is headquartered in Boston, Massachusetts.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:57:32"},{"Company Name":"Alight, Inc.","Symbol":"ALIT","Current Price":"6.97","Latest MA":"7.14","Price Target":10.4375,"Difference from MA":"-2.35%","Difference from Open":"0.72%","Change from Yesterday":"0.43%","Change from Last Report":"0.00","Latest Volume":"7,899,547","Market Cap":"3,853,294,592","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":12.22807,"PB Ratio":0.86006904,"Previous Close":6.94,"ROE":-0.03092,"DTE":46.951,"Industry":"Software - Application","Sector":"Technology","Beta":1.157,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":1.6523561,"Quick Ratio":0.913,"Day High":7.0399,"Day Low":6.879,"VS Average Volume":1.345205939,"Company Summary":"Alight, Inc. provides cloud-based integrated digital human capital and business solutions worldwide. The company operates through two segments, Employer Solutions and Professional Services. The Employer Solutions segment offers employee wellbeing, integrated benefits administration, healthcare navigation, financial wellbeing, leave of absence management, retiree healthcare and payroll; and operates AI-led capabilities software. The Professional Services segment offers consulting offerings, such as cloud advisory, deployment, and optimization services for cloud platforms. The company provides Alight Worklife, an intuitive, cloud-based employee engagement platform. Its solutions enable employees to enrich their health, wealth, and wellbeing that helps organizations achieve a high-performance culture. Alight, Inc. was founded in 2020 and is based in Lincolnshire, Illinois.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:57:32"},{"Company Name":"Frontier Communications Parent,","Symbol":"FYBR","Current Price":"35.86","Latest MA":"33.86","Price Target":38.5,"Difference from MA":"5.92%","Difference from Open":"0.17%","Change from Yesterday":"0.28%","Change from Last Report":"0.00","Latest Volume":"2,018,859","Market Cap":"8,954,277,888","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":-52.735294,"PB Ratio":1.8122095,"Previous Close":35.76,"ROE":-0.06301,"DTE":243.878,"Industry":"Telecom Services","Sector":"Communication Services","Beta":1.05,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":1.5082159,"Quick Ratio":0.521,"Day High":35.895,"Day Low":35.764,"VS Average Volume":0.7959545024,"Company Summary":"Frontier Communications Parent, Inc., together with its subsidiaries, provides communication and technology services in the United States. It offers broadband, video, voice, and other value-added services. The company also provides data and Internet, including broadband networking services; data-based voice over internet protocol, unified communications, long-distance, and voice messaging services; video services under the Frontier TV brand; access services; hardware and network solutions; and packages of services. It serves large enterprise customers, small and medium businesses, and wholesale customers. The company was formerly known as Frontier Communications Corporation and changed its name to Frontier Communications Parent, Inc. in April 2021. Frontier Communications Parent, Inc. was incorporated in 1935 and is headquartered in Dallas, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"26-02-2025 12:57:32"},{"Company Name":"Dun & Bradstreet Holdings, Inc.","Symbol":"DNB","Current Price":"9.11","Latest MA":"11.61","Price Target":12.125,"Difference from MA":"-21.54%","Difference from Open":"-1.62%","Change from Yesterday":"-1.30%","Change from Last Report":"0.00","Latest Volume":"3,817,937","Market Cap":"4,022,210,560","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":8.207207,"PB Ratio":1.2195449,"Previous Close":9.23,"ROE":-0.0072600003,"DTE":108.053,"Industry":"Financial Data & Stock Exchanges","Sector":"Financial Services","Beta":1.148,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":1.6887981,"Quick Ratio":0.49,"Day High":9.26,"Day Low":9.02,"VS Average Volume":1.1750535523,"Company Summary":"Dun & Bradstreet Holdings, Inc., together with its subsidiaries, provides business-to-business data and analytics in North America and internationally. It offers finance and risk solutions, including D&B Finance Analytics, an online application that offers clients real time access to its information, comprehensive monitoring, and portfolio analysis; D&B Direct, an application programming interface (API) that delivers risk and financial data directly into enterprise applications for real-time credit decision-making; D&B Small Business, a suite of tools that allows SMBs to monitor and build their business credit file; D&B Enterprise Risk Assessment Manager, a solution for managing and automating credit decisioning and reporting; and D&B Risk Analytics, a subscription-based online application that offers clients real-time access to complete and up-to-date global information to mitigate supply chain risk, regulatory risk, and ESG assessment, as well as other related risks; Risk Guardian, a subscription-based online application that offers real-time access to Northern Europe information, monitoring, and portfolio analysis; and D&B Beneficial Ownership that offers risk intelligence on ultimate beneficial ownership. The company also provides sales and marketing solutions, including D&B Connect, a self-service data management platform; D&B Optimizer, an integrated data management solution; D&B Rev.Up ABX, an open and agnostic platform that aligns marketing and sales teams to deliver an optimal and coordinated buying; D&B Hoovers, a sales intelligence solution; D&B Audience Targeting, which helps clients to reach the right audiences with the right messages; D&B Visitor Intelligence that turns web visitors into leads; D&B Direct, an API-enabled data management solution; and InfoTorg, an online SaaS application that provides information services. Dun & Bradstreet Holdings, Inc. was founded in 1841 and is headquartered in Jacksonville, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:57:32"},{"Company Name":"Teck Resources Ltd","Symbol":"TECK","Current Price":"40.60","Latest MA":"45.63","Price Target":44.741383,"Difference from MA":"-11.03%","Difference from Open":"-1.17%","Change from Yesterday":"-0.64%","Change from Last Report":"0.00","Latest Volume":"2,815,122","Market Cap":"20,487,936,000","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":22.307692,"PB Ratio":0.7883342,"Previous Close":40.86,"ROE":-0.03333,"DTE":36.777,"Industry":"Other Industrial Metals & Mining","Sector":"Basic Materials","Beta":1.373,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":2.2601142,"Quick Ratio":2.177,"Day High":41.26,"Day Low":40.12,"VS Average Volume":1.05499608,"Company Summary":"Teck Resources Limited engages in exploring for, acquiring, developing, and producing natural resources in Asia, Europe, and North America. The company operates through Steelmaking Coal, Copper, Zinc, and Energy segments. Its principal products include copper, zinc, steelmaking coal, and blended bitumen. The company also produces lead, silver, and molybdenum; and various specialty and other metals, chemicals, and fertilizers. In addition, it explores for gold. The company was formerly known as Teck Cominco Limited and changed its name to Teck Resources Limited in April 2009. The company was founded in 1913 and is headquartered in Vancouver, Canada.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:57:32"},{"Company Name":"Nu Holdings Ltd.","Symbol":"NU","Current Price":"11.21","Latest MA":"13.16","Price Target":14.585,"Difference from MA":"-14.82%","Difference from Open":"1.36%","Change from Yesterday":"1.72%","Change from Last Report":"0.00","Latest Volume":"75,982,323","Market Cap":"53,881,872,384","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":18.080645,"PB Ratio":7.045883,"Previous Close":11.02,"ROE":0.21545,"DTE":27.428,"Industry":"Banks - Regional","Sector":"Financial Services","Beta":"N\/A","Trailing PEG":null,"Trailing PE":28.025,"Trailing PS":11.23782,"Quick Ratio":0.576,"Day High":11.42,"Day Low":10.95,"VS Average Volume":1.7996017171,"Company Summary":"Nu Holdings Ltd. provides digital banking platform in Brazil, Mexico, Colombia, Cayman Islands, Germany, Argentina, the United States, and Uruguay. It offers spending solutions comprising Nu credit and prepaid card, a digitally enabled card that acts as a credit and a prepaid card; Ultraviolet credit and prepaid card, a premium metal credit card for affluent customers; mobile payment solutions for NuAccount customers to make and receive transfers, pay bills, and make everyday purchases through their mobile phones; and Nu Shopping, an integrated mall that enables customers to purchase goods and services from various ecommerce retailers. The company also provides savings solutions, such as Nu Personal Accounts, a digital account solution for personal financial activities; Nu business prepaid and credit card; and Nu business accounts for entrepreneur customers and their businesses. In addition, it offers investing solutions, including Money Boxes for goal-based investing; Nucoin, a proprietary utility token for its loyalty program; NuInvest, which provides equity, fixed-income, stock options, ETF products, and multimarket funds; and NuCrypto, a solution for buying and selling cryptocurrencies through the Nu app. Further, the company provides borrowing solutions comprising Personal unsecured and secured loans; Pix financing that enables credit card and digital account customers to make free and instant peer-to-peer transfers; Boleto financing, which enables credit card and digital account customers to make payments using their credit line; purchase financing; and NuPay to make online purchases and pay for services through Nubank app. Additionally, it offers protection solutions, such as NuInsurance protection solutions, including life, mobile, auto, home, and financial protection insurance policies. The company was founded in 2013 and is headquartered in São Paulo, Brazil.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:57:32"},{"Company Name":"Quanta Services, Inc.","Symbol":"PWR","Current Price":"264.39","Latest MA":"300.36","Price Target":337.3987,"Difference from MA":"-11.98%","Difference from Open":"1.90%","Change from Yesterday":"1.94%","Change from Last Report":"0.00","Latest Volume":"2,976,241","Market Cap":"39,182,069,760","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":26.02264,"PB Ratio":5.3356075,"Previous Close":259.36,"ROE":0.13623,"DTE":61.107,"Industry":"Engineering & Construction","Sector":"Industrials","Beta":1.048,"Trailing PEG":1.7116,"Trailing PE":43.84577,"Trailing PS":1.6551518,"Quick Ratio":1.181,"Day High":269.41,"Day Low":253.44,"VS Average Volume":2.1756656588,"Company Summary":"Quanta Services, Inc. offers infrastructure solutions for the electric and gas utility, renewable energy, communications, pipeline, and energy industries in the United States, Canada, Australia, and internationally. The company's Electric Power Infrastructure Solutions segment engages in the design, procurement, construction, upgrade, repair, and maintenance of electric power transmission and distribution infrastructure and substation facilities; installation, maintenance, and upgrade of electric power infrastructure projects; installation of smart grid technologies on electric power networks; and design, installation, maintenance, and repair of commercial and industrial wirings. This segment offers aviation; emergency restoration; and other engineering and technical services; design and construction solutions to wireline and wireless communications, cable multi-system operators, and other customers; and training for electric workers, as well as training for the gas distribution and communications industries. Its Renewable Energy Infrastructure Solutions segment is involved in engineering, procurement, construction, repair, and maintenance of wind, solar, and hydropower generation facilities, as well as battery storage facilities; and engineering and construction services for substations and switchyards, transmission, and other electrical infrastructures. The company's Underground Utility and Infrastructure Solutions segment offers design, engineering, procurement, construction, upgrade, repair, and maintenance services for natural gas systems for gas utility customers; fabrication services for pipeline support systems and structures and facilities; and engineering and construction services for pipeline and storage systems, and compressor and pump stations. The company was formerly known as Fabal Construction, Inc. and changed its name to Quanta Services, Inc. in November 1997. The company was incorporated in 1997 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:57:32"},{"Company Name":"Copart, Inc.","Symbol":"CPRT","Current Price":"56.77","Latest MA":"55.25","Price Target":61.8125,"Difference from MA":"2.75%","Difference from Open":"0.39%","Change from Yesterday":"0.04%","Change from Last Report":"0.00","Latest Volume":"4,625,227","Market Cap":"54,699,483,136","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":32.62644,"PB Ratio":6.5973277,"Previous Close":56.75,"ROE":0.19184999,"DTE":1.434,"Industry":"Specialty Business Services","Sector":"Industrials","Beta":1.333,"Trailing PEG":3.1112,"Trailing PE":38.10067,"Trailing PS":12.13817,"Quick Ratio":7.51,"Day High":57.7641,"Day Low":56.435,"VS Average Volume":1.287008227,"Company Summary":"Copart, Inc. provides online auctions and vehicle remarketing services in the United States, Canada, the United Kingdom, Brazil, the Republic of Ireland, Germany, Finland, the United Arab Emirates, Oman, Bahrain, and Spain. It offers a range of services for processing and selling vehicles over the internet through its virtual bidding third generation internet auction-style sales technology to vehicle sellers, insurance companies, banks and finance companies, charities, fleet operators, dealers, vehicle rental companies, and individuals. The company's services include online seller access, salvage estimation, estimating, end-of-life vehicle processing, transportation, vehicle inspection stations, on-demand reporting, title processing and express, loan payoff, flexible vehicle processing programs, buy it now, sales process, and dealer services. Its services also comprise services to sell vehicles through BluCar, CashForCars.com, CashForCars.ca, CashForCars.de, CashForCars.co.uk, and Cash-for-cars.ie; Copart Recycling service, which allows the public to purchase parts from salvaged and end-of-life vehicles; copart 360, a proprietary technology that captures clear 360-degree views of interiors and exteriors of cars, trucks, and vans; and membership tiers for those registering to buy vehicles through Copart.com. In addition, it provides IntelliSeller, an automated tool leveraging its vast and detailed vehicle and sales data to assist its sellers in making vital auction decisions; Purple Wave Inc., that offers wholesale construction, agriculture, and fleet remarketing services through no-reserve online auctions; non-salvage powersport vehicle remarketing services through live and online auction platforms. The company sells its products principally to licensed vehicle dismantlers, rebuilders, repair licensees, used vehicle dealers, and exporters, as well as to the public. Copart, Inc. was incorporated in 1982 and is headquartered in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 12:57:32"}]