[{"Company Name":"Mastercard Incorporated","Symbol":"MA","Current Price":"587.64","Latest MA":"541.65","Latest MA 5":588.4739960937,"Latest MA 9":586.1255476888,"Latest MA 20":581.2619957275,"RSI":58.8660008079,"Price Target":621.28265,"Difference from MA":"8.49%","Difference from Open":"-0.30%","Change from Yesterday":"-0.52%","Change from Last Report":"0.02","Latest Volume":"780,779","Market Cap":"533,625,307,136","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":35.87546,"PB Ratio":80.15823,"Previous Close":590.74,"ROE":1.8770399,"DTE":280.795,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.052,"Trailing PEG":2.3696,"Trailing PE":41.266857,"Trailing PS":41.266857,"Quick Ratio":0.665,"Day High":590.67,"Day Low":584.56,"VS Average Volume":0.2872573579,"Company Summary":"Mastercard Incorporated, a technology company, provides transaction processing and other payment-related products and services in the United States and internationally. The company offers integrated products and value-added services for account holders, merchants, financial institutions, digital partners, businesses, governments, and other organizations, such as programs that enable issuers to provide consumers with credits to defer payments; payment products and solutions that allow its customers to access funds in deposit and other accounts; prepaid programs services; consumer bill payment services; and commercial credit, debit, and prepaid payment products and solutions. It also provides solutions that enable businesses or governments to make payments to businesses, including Virtual Card Number, which is generated dynamically from a physical card and leverages the credit limit of the funding account; and a platform to optimize supplier payment enablement campaigns for financial institutions. In addition, the company offers Mastercard Move, which partners with digital messaging and payment platforms to enable consumers to send money directly within applications to other consumers; and partners with central banks, fintechs and financial institutions to help governments and nonprofits, as well as enables various cross-border payment flows. Further, it provides security solutions; personalization, issuer and merchant loyalty, and marketing services; advanced analytics, business intelligence, economic and location-based insights, payments consulting, and operational insights services; processing and gateway solutions; and open banking services. The company offers payment solutions and services under the MasterCard, Maestro, and Cirrus names. Mastercard Incorporated was founded in 1966 and is headquartered in Purchase, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:33:37"},{"Company Name":"Johnson & Johnson","Symbol":"JNJ","Current Price":"156.04","Latest MA":"152.23","Latest MA 5":155.6029971924,"Latest MA 9":154.9683314345,"Latest MA 20":153.297272583,"RSI":62.3294687016,"Price Target":169.18262,"Difference from MA":"2.50%","Difference from Open":"-0.12%","Change from Yesterday":"0.51%","Change from Last Report":"0.12","Latest Volume":"2,881,355","Market Cap":"375,455,186,944","Earning Date":"16-07-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":14.721226,"PB Ratio":4.8059683,"Previous Close":155.26,"ROE":0.29447,"DTE":66.896,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.41,"Trailing PEG":1.0557,"Trailing PE":17.35762,"Trailing PS":17.35762,"Quick Ratio":0.963,"Day High":156.29,"Day Low":155.17,"VS Average Volume":0.3210346851,"Company Summary":"Johnson & Johnson, together with its subsidiaries, engages in the research and development, manufacture, and sale of various products in the healthcare field worldwide. It operates in two segments, Innovative Medicine and MedTech. The Innovative Medicine segment offers products for various therapeutic areas, such as immunology, including rheumatoid arthritis, psoriatic arthritis, inflammatory bowel disease, and psoriasis; infectious diseases comprising HIV\/AIDS; neuroscience, consisting of mood disorders, neurodegenerative disorders, and schizophrenia; oncology, such as prostate cancer, hematologic malignancies, lung cancer, and bladder cancer; cardiovascular and metabolism, including thrombosis, diabetes, and macular degeneration; and pulmonary hypertension comprising pulmonary arterial hypertension through retailers, wholesalers, distributors, hospitals, and healthcare professionals for prescription use. The MedTech segment provides electrophysiology products to treat heart rhythm disorders; the heart recovery portfolio, which includes technologies to treat severe coronary artery disease requiring high-risk PCI or AMI cardiogenic shock; circulatory restoration products for the treatment of calcified coronary artery and peripheral artery diseases; and neurovascular care that treats hemorrhagic and ischemic stroke. This segment offers an orthopaedics portfolio that includes products and enabling technologies that support hips, knees, trauma, spine, sports, and other; surgery portfolios comprising advanced and general surgery technologies, as well as solutions for breast aesthetics and reconstruction; contact lenses under the ACUVUE brand; and TECNIS intraocular lenses for cataract surgery. It distributes its products to wholesalers, hospitals, and retailers, as well as physicians, nurses, hospitals, eye care professionals, and clinics. The company was founded in 1886 and is based in New Brunswick, New Jersey.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:33:37"},{"Company Name":"Home Depot, Inc. (The)","Symbol":"HD","Current Price":"363.65","Latest MA":"381.84","Latest MA 5":364.9109987793,"Latest MA 9":366.7109071181,"Latest MA 20":368.2847061768,"RSI":43.8054276175,"Price Target":418.63828,"Difference from MA":"-4.76%","Difference from Open":"0.79%","Change from Yesterday":"0.89%","Change from Last Report":"0.08","Latest Volume":"1,585,089","Market Cap":"361,810,526,208","Earning Date":"19-08-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":23.311216,"PB Ratio":45.485302,"Previous Close":360.46,"ROE":2.9951901,"DTE":778.781,"Industry":"Home Improvement Retail","Sector":"Consumer Cyclical","Beta":1.018,"Trailing PEG":4.2201,"Trailing PE":24.671303,"Trailing PS":24.671303,"Quick Ratio":0.23,"Day High":364.09,"Day Low":358.52,"VS Average Volume":0.4386194198,"Company Summary":"The Home Depot, Inc. operates as a home improvement retailer in the United States and internationally. It sells various building materials, home improvement products, lawn and garden products, and décor products, as well as facilities maintenance, repair, and operations products. The company also offers installation services for flooring, water heaters, baths, garage doors, cabinets, cabinet makeovers, countertops, sheds, furnaces and central air systems, and windows. In addition, it provides tool and equipment rental services. The company serves consumers, such as do-it-yourself homeowners and do-it-for-me customers; and professional renovators\/remodelers, general contractors, small to medium homebuilders, maintenance professionals, handymen, property managers, building service contractors and specialty tradespeople, such as electricians, landscapers, plumbers, painters, pool contractors, and roofers. It sells its products through websites and its mobile applications, including homedepot.com; homedepot.ca and homedepot.com.mx; blinds.com, justblinds.com, and americanblinds.com for custom window coverings; thecompanystore.com, an online site for textiles and décor products; hdsupply.com for maintenance, repair, and operations products and related services; and srsdistribution.com, heritagelandscapesupplygroup.com, and heritagepoolsupplygroup.com for roofing and building materials, landscape, and pool products; and The Home Depot stores. The Home Depot, Inc. was incorporated in 1978 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:33:37"},{"Company Name":"AbbVie Inc.","Symbol":"ABBV","Current Price":"191.68","Latest MA":"185.35","Latest MA 5":190.3340010986,"Latest MA 9":188.9688898383,"Latest MA 20":186.2560001221,"RSI":71.3993500881,"Price Target":208.86444,"Difference from MA":"3.42%","Difference from Open":"-0.27%","Change from Yesterday":"0.09%","Change from Last Report":"0.20","Latest Volume":"2,882,130","Market Cap":"338,583,552,000","Earning Date":"25-04-2025","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":15.802143,"PB Ratio":238.40794,"Previous Close":191.5,"ROE":0.884,"DTE":4789.603,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.491,"Trailing PEG":0.4094,"Trailing PE":81.91453,"Trailing PS":81.91453,"Quick Ratio":0.485,"Day High":193.5896,"Day Low":187.4078,"VS Average Volume":0.3738054362,"Company Summary":"AbbVie Inc., a research-based biopharmaceutical company, engages in the research and development, manufacture, commercialization, and sale of medicines and therapies worldwide. The company offers Humira, an injection for autoimmune and intestinal Behçet's diseases, generalized pustular psoriasis, and pyoderma gangrenosum; Skyrizi to treat autoimmune diseases, erythrodermic psoriasis, generalized pustular psoriasis, and palmoplantar pustulosis; Rinvoq to treat inflammatory diseases; Imbruvica for the treatment of adult patients with blood cancers; Venclexta\/Venclyxto to treat blood cancers; Elahere to treat various cancer; and Epkinly to treat lymphoma. It also provides facial injectables, plastics and regenerative medicine, body contouring, and skincare products; botox therapeutic to treat neurologic diseases; Vraylar to treat schizophrenia, bipolar disorder, and depressive disorder; Duopa and Duodopa to treat Parkinson's disease; Ubrelvy to treat migraine; and Qulipta for episodic and chronic migraine, as well as other neuroscience products. In addition, the company offers Ozurdex for eye diseases; Lumigan\/Ganfort and Alphagan\/Combigan for the reduction of elevated intraocular pressure in patients with open angle glaucoma or ocular hypertension; Restasis to increase tear production; and other eye care products. Further, it provides Mavyret\/Maviret to treat chronic hepatitis C virus genotype 1-6 infection; Creon, a pancreatic enzyme therapy; and Linzess\/Constella to treat irritable bowel syndrome with constipation and chronic idiopathic constipation. The company was incorporated in 2012 and is headquartered in North Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:33:37"},{"Company Name":"Bank of America Corporation","Symbol":"BAC","Current Price":"44.56","Latest MA":"43.28","Latest MA 5":44.8439999695,"Latest MA 9":44.5166997443,"Latest MA 20":44.1374648361,"RSI":57.7222282149,"Price Target":49.54167,"Difference from MA":"2.96%","Difference from Open":"0.36%","Change from Yesterday":"-0.38%","Change from Last Report":"0.06","Latest Volume":"14,254,188","Market Cap":"335,620,571,136","Earning Date":"16-07-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":12.174864,"PB Ratio":1.2246468,"Previous Close":44.73,"ROE":0.094560005,"DTE":null,"Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.307,"Trailing PEG":1.6831,"Trailing PE":13.301494,"Trailing PS":13.301494,"Quick Ratio":null,"Day High":44.59,"Day Low":44.02,"VS Average Volume":0.3061071041,"Company Summary":"Bank of America Corporation, through its subsidiaries, provides various financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. The company operates through four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, checking accounts, and investment accounts and products; credit and debit cards; residential mortgages and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:33:37"},{"Company Name":"Coca-Cola Company (The)","Symbol":"KO","Current Price":"71.80","Latest MA":"67.11","Latest MA 5":71.8669986572,"Latest MA 9":71.6416670397,"Latest MA 20":71.6642498932,"RSI":52.4559206116,"Price Target":77.8284,"Difference from MA":"6.99%","Difference from Open":"-0.63%","Change from Yesterday":"-0.38%","Change from Last Report":"0.17","Latest Volume":"5,938,572","Market Cap":"309,025,046,528","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":24.173399,"PB Ratio":11.792871,"Previous Close":72.07,"ROE":0.38776,"DTE":180.05,"Industry":"Beverages - Non-Alcoholic","Sector":"Consumer Defensive","Beta":0.464,"Trailing PEG":4.4593,"Trailing PE":28.833332,"Trailing PS":28.833332,"Quick Ratio":0.751,"Day High":72.3999,"Day Low":71.6,"VS Average Volume":0.3571869277,"Company Summary":"The Coca-Cola Company, a beverage company, manufactures and sells various nonalcoholic beverages in the United States and internationally. The company provides sparkling soft drinks and flavors; water, sports, coffee, and tea; juice, value-added dairy, and plant-based beverages; and other beverages. It also offers beverage concentrates and syrups, as well as fountain syrups to fountain retailers comprising restaurants and convenience stores. The company sells its products under the Coca-Cola, Diet Coke\/Coca-Cola Light, Coca-Cola Zero Sugar, caffeine free Diet Coke, Cherry Coke, Fanta Orange, Fanta Zero Orange, Fanta Zero Sugar, Fanta Apple, Sprite, Sprite Zero Sugar, Simply Orange, Simply Apple, Simply Grapefruit, Fresca, Schweppes, Thums Up, Aquarius, Ayataka, BODYARMOR, Ciel, Costa, Crystal, Dasani, dogadan, Fuze Tea, Georgia, glacéau smartwater, glacéau vitaminwater, Gold Peak, I LOHAS, Powerade, Topo Chico, Core Power, Del Valle, fairlife, innocent, Maaza, Minute Maid, Minute Maid Pulpy, and Simply brands. It operates through a network of independent bottling partners, distributors, wholesalers, and retailers, as well as through bottling and distribution operators. The company was founded in 1886 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:33:37"},{"Company Name":"UnitedHealth Group Incorporated","Symbol":"UNH","Current Price":"318.00","Latest MA":"484.84","Latest MA 5":307.7520019531,"Latest MA 9":304.5466681586,"Latest MA 20":301.6530029297,"RSI":62.545064996,"Price Target":385.33792,"Difference from MA":"-34.41%","Difference from Open":"2.12%","Change from Yesterday":"2.40%","Change from Last Report":"-0.07","Latest Volume":"9,671,598","Market Cap":"288,470,499,328","Earning Date":"29-07-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":10.635451,"PB Ratio":3.044898,"Previous Close":310.56,"ROE":0.22700001,"DTE":77.277,"Industry":"Healthcare Plans","Sector":"Healthcare","Beta":0.453,"Trailing PEG":0.8241,"Trailing PE":13.316584,"Trailing PS":13.316584,"Quick Ratio":0.769,"Day High":318.62,"Day Low":308.58,"VS Average Volume":0.626113393,"Company Summary":"UnitedHealth Group Incorporated operates as a health care company in the United States and internationally. The company operates through four segments: UnitedHealthcare, Optum Health, Optum Insight, and Optum Rx. The UnitedHealthcare segment offers consumer-oriented health benefit plans and services for national employers, public sector employers, mid-sized employers, small businesses, and individuals; health care coverage, and health and well-being services to individuals age 50 and older; Medicaid plans, children's health insurance and health care programs; and health care benefits products and services to state programs caring for the economically disadvantaged, medically underserved, and those without the benefit of employer-funded health care coverage. The Optum Health segment provides care delivery, care management, wellness and consumer engagement, and health financial services patients, consumers, care delivery systems, providers, employers, payers, and public-sector entities. The Optum Insight segment offers software and information products, advisory consulting arrangements, and managed services outsourcing contracts to hospital systems, physicians, health plans, governments, life sciences companies, and other organizations. The Optum Rx segment provides pharmacy care services and programs, including retail network contracting, home delivery, specialty and community health pharmacy services, infusion, and purchasing and clinical capabilities, as well as develops programs in the areas of step therapy, formulary management, drug adherence, and disease and drug therapy management. UnitedHealth Group Incorporated was founded in 1974 and is based in Eden Prairie, Minnesota.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:33:37"},{"Company Name":"Philip Morris International Inc","Symbol":"PM","Current Price":"182.48","Latest MA":"146.29","Latest MA 5":181.4479989014,"Latest MA 9":181.6644444444,"Latest MA 20":178.3194986572,"RSI":62.3715175807,"Price Target":177.15312,"Difference from MA":"24.74%","Difference from Open":"-0.73%","Change from Yesterday":"-0.49%","Change from Last Report":"0.43","Latest Volume":"2,731,327","Market Cap":"284,033,744,896","Earning Date":"22-07-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":25.344444,"PB Ratio":-26.053682,"Previous Close":183.37,"ROE":null,"DTE":null,"Industry":"Tobacco","Sector":"Consumer Defensive","Beta":0.544,"Trailing PEG":1.347,"Trailing PE":28.782333,"Trailing PS":28.782333,"Quick Ratio":0.364,"Day High":184.06,"Day Low":181.63,"VS Average Volume":0.4467317739,"Company Summary":"Philip Morris International Inc. operates as a tobacco company. The company offers cigarettes and smoke-free products, including heat-not-burn, vapor, and oral nicotine products under the IQOS and ZYN brands; and consumer accessories, such as lighters and matches. It also offers wellness and healthcare products. Philip Morris International Inc. was incorporated in 1987 and is headquartered in Stamford, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:33:37"},{"Company Name":"Intuit Inc.","Symbol":"INTU","Current Price":"768.88","Latest MA":"633.27","Latest MA 5":766.3379995117,"Latest MA 9":766.0877747938,"Latest MA 20":731.5839963379,"RSI":76.8231644201,"Price Target":788.22485,"Difference from MA":"21.41%","Difference from Open":"0.72%","Change from Yesterday":"0.54%","Change from Last Report":"-0.06","Latest Volume":"446,722","Market Cap":"214,476,783,616","Earning Date":"22-05-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":34.587494,"PB Ratio":10.662155,"Previous Close":764.75,"ROE":0.17839001,"DTE":null,"Industry":"Software - Application","Sector":"Technology","Beta":1.283,"Trailing PEG":1.9854,"Trailing PE":62.816994,"Trailing PS":62.816994,"Quick Ratio":0.715,"Day High":770.77,"Day Low":763.35,"VS Average Volume":0.2469552257,"Company Summary":"Intuit Inc. provides financial management, compliance, and marketing products and services in the United States. The company operates in four segments: Small Business & Self-Employed, Consumer, Credit Karma, and ProTax. The Small Business & Self-Employed segment provides QuickBooks services, that includes financial and business management online services, desktop software, payroll solutions, time tracking, merchant payment processing and bill pay solutions, checking accounts, and financing services for small and mid-market businesses; and Mailchimp, a marketing automation and customer relationship management. This segment also offers QuickBooks online services and desktop software solutions comprising QuickBooks Online, QuickBooks Live, QuickBooks Online Advanced, QuickBooks Self-Employed, QuickBooks Solopreneur financial and business management offerings, QuickBooks Online Payroll QuickBooks Checking, QuickBooks Desktop software subscriptions, QuickBooks Basic Payroll, QuickBooks Assisted Payroll, and QuickBooks Enhanced Payroll. The Consumer segment provides do-it-yourself and assisted TurboTax income tax preparation products and services. The Credit Karma segment offers consumers with a personal finance platform that provides personalized recommendations of credit card, home, auto, and personal loan, and insurance product; online savings and checking accounts; and access to its credit scores and reports, credit and identity monitoring, credit report dispute, credit building tools, and tools. The ProTax segment provides Lacerte, ProSeries, and ProFile desktop tax-preparation software products; and ProConnect Tax Online bill pay tax products, electronic tax filing service, and bank products and related services. It sells products and services through direct sales channels, multi-channel shop-and-buy experiences, mobile application stores, and partner and other channels. The company was incorporated in 1984 and is headquartered in Mountain View, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:33:37"},{"Company Name":"ServiceNow, Inc.","Symbol":"NOW","Current Price":"1014.45","Latest MA":"979.85","Latest MA 5":1017.1279882812,"Latest MA 9":1015.4410997179,"Latest MA 20":1018.5915032959,"RSI":51.2309882094,"Price Target":1085.3595,"Difference from MA":"3.53%","Difference from Open":"1.18%","Change from Yesterday":"1.01%","Change from Last Report":"-0.05","Latest Volume":"367,171","Market Cap":"210,145,345,536","Earning Date":"23-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":60.745506,"PB Ratio":20.708979,"Previous Close":1004.33,"ROE":0.16858,"DTE":23.661,"Industry":"Software - Application","Sector":"Technology","Beta":0.956,"Trailing PEG":2.2379,"Trailing PE":138.397,"Trailing PS":138.397,"Quick Ratio":0.963,"Day High":1016.04,"Day Low":1004.075,"VS Average Volume":0.2105164482,"Company Summary":"ServiceNow, Inc. provides cloud-based solution for digital workflows in the North America, Europe, the Middle East and Africa, Asia Pacific, and internationally. The company operates the Now platform, an AI platform for digital transformation machine learning, robotic process automation, process mining, analytics, and low-code\/no-code development tools. It also provides asset management, integrated risk management, IT service management, Operational Technology management, Security Operations, strategic portfolio management, IT operations management products; customer service management product; and field service management applications. In addition, the company offers human resources, legal, and workplace service delivery products; app engine product; automation engine; platform privacy and security product; and source-to-pay operations. Further, ServiceNow, Inc. develops and operates a mobile-enabled manufacturing application. It serves government, financial services, healthcare and life science, manufacturing, Public Sector, retail, IT services, technology, and Telecom sectors through service providers and resale partners. The company was formerly known as Service-now.com and changed its name to ServiceNow, Inc. in May 2012. ServiceNow, Inc. was founded in 2004 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:33:37"},{"Company Name":"Merck & Company, Inc.","Symbol":"MRK","Current Price":"81.78","Latest MA":"89.77","Latest MA 5":80.3490002441,"Latest MA 9":79.0027777778,"Latest MA 20":77.8242499542,"RSI":69.682897579,"Price Target":101.78708,"Difference from MA":"-8.90%","Difference from Open":"1.98%","Change from Yesterday":"1.84%","Change from Last Report":"-0.15","Latest Volume":"5,238,039","Market Cap":"205,339,475,968","Earning Date":"29-07-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":8.699469,"PB Ratio":4.256898,"Previous Close":80.32,"ROE":0.39293,"DTE":71.992,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.441,"Trailing PEG":0.7364,"Trailing PE":11.885901,"Trailing PS":11.885901,"Quick Ratio":0.827,"Day High":81.94,"Day Low":80.07,"VS Average Volume":0.3234987681,"Company Summary":"Merck & Co., Inc. operates as a healthcare company worldwide. It operates through two segments, Pharmaceutical and Animal Health. The company offers human health pharmaceutical for various areas, including oncology, vaccines, hospital acute care, cardiovascular, virology, neuroscience, and diabetes under the Keytruda, Welireg, Gardasil, ProQuad, M-M-R II, Varivax, Vaxneuvance, RotaTeq, Pneumovax 23, Bridion, Dificid, Zerbaxa, Noxafil, Winrevair, Adempas, Verquvo, Lagevrio, Isentress\/Isentress HD, Delstrigo, Pifeltro, Belsomra, Januvia, and Janumet brands. It also provides veterinary pharmaceuticals, vaccines and health management solutions and services, such as livestock products under the Nuflor, Bovilis\/Vista, Bovilis Cryptium, Banamine, Estrumate, Matrix, Resflor, Zuprevo, Revalor, Safe-Guard, M+Pac, Porcilis, Circumvent, Nobilis\/Innovax, Paracox and Coccivac, Exzolt, Slice, Imvixa, Clynav, Aquavac\/Norvax, Aquaflor, Flexolt brands; Allflex Livestock Intelligence solutions for animal identification, monitoring and traceability; and companion animal products under the Bravecto One-Month, Bravecto Injectable\/Quantum, Bravecto Plus, Sentinel Spectrum, Sentinel Flavor Tabs, Optimmune, Nobivac NXT, GilvetMab, Otomax, Mometamax, Mometamax Ultra, Posatex, Caninsulin\/Vetsulin, Panacur, Regumate, Prestige, Scalibor\/Exspot, Sure Petcare, and Home Again brands. The company has development and commercialization agreement for three of Daiichi Sankyo's deruxtecan ADC candidates; AstraZeneca PLC to co-development and co-commercialize AstraZeneca's Lynparza products for multiple cancer types, and Koselugo for multiple indications; licensed to develop, manufacture and commercialize LM-299, a novel investigational PD-1\/VEGF bispecific antibody from LaNova; and collaboration agreement with Eisai Co., Ltd., Bayer AG, and Ridgeback Biotherapeutics LP, as well Moderna, Inc. It has a collaboration agreement with Antengene Corporation Limited to evaluate the combination of ATG-022, a CLDN18.2-targeting antibody-drug conjugate, and anti-PD-1 therapy, as well as KEYTRUDA (pembrolizumab) in patients with advanced solid tumors. Merck & Co., Inc. was founded in 1891 and is headquartered in Rahway, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:33:37"},{"Company Name":"QUALCOMM Incorporated","Symbol":"QCOM","Current Price":"158.81","Latest MA":"154.77","Latest MA 5":156.4131019531,"Latest MA 9":152.3989584147,"Latest MA 20":150.4109704956,"RSI":75.7238898159,"Price Target":172.42036,"Difference from MA":"2.61%","Difference from Open":"-0.12%","Change from Yesterday":"-0.42%","Change from Last Report":"-0.06","Latest Volume":"3,026,109","Market Cap":"174,368,440,320","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":12.984915,"PB Ratio":6.300055,"Previous Close":159.48,"ROE":0.42205003,"DTE":52.737,"Industry":"Semiconductors","Sector":"Technology","Beta":1.256,"Trailing PEG":2.2904,"Trailing PE":16.221195,"Trailing PS":16.221195,"Quick Ratio":1.838,"Day High":159.61,"Day Low":157.95,"VS Average Volume":0.340727929,"Company Summary":"QUALCOMM Incorporated engages in the development and commercialization of foundational technologies for the wireless industry worldwide. It operates through three segments: Qualcomm CDMA Technologies (QCT); Qualcomm Technology Licensing (QTL); and Qualcomm Strategic Initiatives (QSI). The QCT segment develops and supplies integrated circuits and system software with advanced connectivity and high-performance, and low-power computing technologies for use in mobile devices; automotive systems for connectivity, digital cockpit, and ADAS\/AD; and IoT, including consumer electronic devices, industrial devices, and edge networking products. The QTL segment grants licenses or provides rights to use portions of its intellectual property portfolio, which include various patent rights useful in the manufacture and sale of wireless products comprising products implementing CDMA2000, WCDMA, LTE and\/or OFDMA-based 5G products. The QSI segment invests in early-stage companies in various industries, including 5G, artificial intelligence, automotive, consumer, enterprise, cloud, IoT, and extended reality, and investments, including non-marketable equity securities and, to a lesser extent, marketable equity securities, and convertible debt instruments. It also provides development, and other services and sells related products to the United States government agencies and their contractors. The company was incorporated in 1985 and is headquartered in San Diego, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:33:37"},{"Company Name":"Amgen Inc.","Symbol":"AMGN","Current Price":"295.49","Latest MA":"284.34","Latest MA 5":292.2069975586,"Latest MA 9":290.3538902452,"Latest MA 20":282.5117515259,"RSI":74.0773775119,"Price Target":314.69678,"Difference from MA":"3.92%","Difference from Open":"0.43%","Change from Yesterday":"1.26%","Change from Last Report":"-0.04","Latest Volume":"865,443","Market Cap":"158,884,052,992","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":14.295355,"PB Ratio":25.596413,"Previous Close":291.81,"ROE":1.0567299,"DTE":924.456,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.496,"Trailing PEG":0.9715,"Trailing PE":26.935732,"Trailing PS":26.935732,"Quick Ratio":0.736,"Day High":296.88,"Day Low":292.68,"VS Average Volume":0.2895122426,"Company Summary":"Amgen Inc. discovers, develops, manufactures, and delivers human therapeutics worldwide. The company's principal products include Enbrel for the treatment of rheumatoid arthritis, plaque psoriasis, and psoriatic arthritis; Otezla for the treatment of adult patients with plaque psoriasis, psoriatic arthritis, and oral ulcers associated with Behçet's disease; Prolia to treat postmenopausal women with osteoporosis; XGEVA for skeletal-related events prevention; Repatha, which reduces the risks of myocardial infarction, stroke, and coronary revascularization; Nplate for the treatment of patients with immune thrombocytopenia; KYPROLIS to treat patients with relapsed or refractory multiple myeloma; Aranesp to treat a lower-than-normal number of red blood cells and anemia; EVENITY for the treatment of osteoporosis in postmenopausal for men and women; Vectibix to treat patients with wild-type RAS metastatic colorectal cancer; BLINCYTO for the treatment of patients with acute lymphoblastic leukemia; TEPEZZA to treat thyroid eye disease; and KRYSTEXXA for the treatment of chronic refractory gout. It also markets other products, including Neulasta, MVASI, AMJEVITA\/AMGEVITA, TEZSPIRE, Parsabiv, Aimovig, LUMAKRAS\/LUMYKRAS, EPOGEN, KANJINTI, TAVNEOS, RAVICTI, UPLIZNA and PROCYSBI. The company serves healthcare providers, including physicians or their clinics, dialysis centers, hospitals, and pharmacies. It distributes its products through pharmaceutical wholesale distributors, as well as direct-to-consumer channels. The company has collaboration agreements with AstraZeneca plc for the development and commercialization of TEZSPIRE; Novartis Pharma AG to develop and commercialize Aimovig; UCB for the development and commercialization of EVENITY; Kyowa Kirin Co., Ltd. for rocatinlimab development and commercialization; and BeiGene, Ltd. for oncology products expansion and development. Amgen Inc. was incorporated in 1980 and is headquartered in Thousand Oaks, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:33:37"},{"Company Name":"Lam Research Corporation","Symbol":"LRCX","Current Price":"91.67","Latest MA":"76.65","Latest MA 5":89.6539996948,"Latest MA 9":87.1211117554,"Latest MA 20":85.0360005341,"RSI":82.4448056243,"Price Target":90.6,"Difference from MA":"19.60%","Difference from Open":"1.16%","Change from Yesterday":"0.79%","Change from Last Report":"-0.01","Latest Volume":"2,717,196","Market Cap":"117,256,929,280","Earning Date":"23-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":21.468384,"PB Ratio":12.366113,"Previous Close":90.95,"ROE":0.53138,"DTE":47.148,"Industry":"Semiconductor Equipment & Materials","Sector":"Technology","Beta":1.656,"Trailing PEG":1.3496,"Trailing PE":25.534819,"Trailing PS":25.534819,"Quick Ratio":1.581,"Day High":91.89,"Day Low":90.5,"VS Average Volume":0.2282745478,"Company Summary":"Lam Research Corporation designs, manufactures, markets, refurbishes, and services semiconductor processing equipment used in the fabrication of integrated circuits. The company offers ALTUS systems to deposit conformal films for tungsten metallization applications; SABRE electrochemical deposition products for copper interconnect transition that offers copper damascene manufacturing; and VECTOR plasma-enhanced CVD products. It also provides SPEED gapfill high-density plasma chemical vapor deposition products; and Striker single-wafer atomic layer deposition products for dielectric film solutions. In addition, the company offers Flex for dielectric etch applications; Vantex, a dielectric etch system that provides RF technology and repeatable wafer-to-wafer performance enabled by Equipment Intelligence solutions; Kiyo for conductor etch applications; Syndion for through-silicon via etch applications; and Versys metal products for metal etch processes. Further, it provides Coronus bevel clean products to enhance die yield; and Da Vinci, DV-Prime, EOS, and SP series products to address various wafer cleaning applications. The company sells its products in the United States, China, Europe, Japan, Korea, Southeast Asia, and Taiwan. Lam Research Corporation was incorporated in 1980 and is headquartered in Fremont, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:33:37"},{"Company Name":"Waste Management, Inc.","Symbol":"WM","Current Price":"235.94","Latest MA":"222.54","Latest MA 5":234.9070012207,"Latest MA 9":236.7818707954,"Latest MA 20":235.1995538025,"RSI":52.5703116025,"Price Target":248.18681,"Difference from MA":"6.02%","Difference from Open":"0.47%","Change from Yesterday":"0.70%","Change from Last Report":"-0.02","Latest Volume":"470,509","Market Cap":"94,942,134,272","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":29.236061,"PB Ratio":10.974742,"Previous Close":234.29,"ROE":0.34013999,"DTE":275.54,"Industry":"Waste Management","Sector":"Industrials","Beta":0.668,"Trailing PEG":3.0546,"Trailing PE":35.58597,"Trailing PS":35.58597,"Quick Ratio":0.711,"Day High":236.3862,"Day Low":234.3625,"VS Average Volume":0.2658453211,"Company Summary":"Waste Management, Inc., through its subsidiaries, provides environmental solutions to residential, commercial, industrial, and municipal customers in the United States, Canada, Western Europe, and internationally. It offers collection services, including picking up and transporting waste and recyclable materials from where it was generated to a transfer station, recovery facility, or disposal site; owns and operates transfer stations; and owns, develops, and operates landfill gas-to-energy facilities that produce renewable electricity and renewable natural gas. It also operates materials processing and commodities recycling services, including cardboard, paper, glass, metals, plastics, construction and demolition materials, and other recycling commodities are recovered for resale or redirected for other purposes; recycling brokerage services, such as managing the marketing of recyclable materials for third parties; and other strategic business solutions. In addition, the company collects recyclable food and yard waste, as well as markets and sells mulch, compost, soil amendments, and renewable energy; offers remediation and construction, and industrial waste services; and manages and markets fly ash. Further, it provides Regulated Waste and Compliance Services (RWCS), which offers compliance programs, as well as collection, processing, and disposal of regulated and specialized waste, including medical, pharmaceutical, and hazardous waste; and Secure Information Destruction (SID) services that includes the collection of personal and confidential information for secure destruction and recycling of sorted office paper. The company was formerly known as USA Waste Services, Inc. and changed its name to Waste Management, Inc. in 1998. Waste Management, Inc. was founded in 1968 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:33:37"},{"Company Name":"Equinix, Inc.","Symbol":"EQIX","Current Price":"901.56","Latest MA":"885.62","Latest MA 5":904.9020024414,"Latest MA 9":903.5311146376,"Latest MA 20":886.6228638916,"RSI":57.9082648741,"Price Target":1010.36,"Difference from MA":"1.80%","Difference from Open":"0.88%","Change from Yesterday":"0.88%","Change from Last Report":"0.03","Latest Volume":"128,275","Market Cap":"88,189,698,048","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":67.381165,"PB Ratio":6.3495955,"Previous Close":893.7,"ROE":0.07059,"DTE":141.235,"Industry":"REIT - Specialty","Sector":"Real Estate","Beta":0.957,"Trailing PEG":3.6598,"Trailing PE":94.305435,"Trailing PS":94.305435,"Quick Ratio":1.248,"Day High":902.5,"Day Low":893.7,"VS Average Volume":0.2075808477,"Company Summary":"Equinix (Nasdaq: EQIX) is the world's digital infrastructure company. Digital leaders harness Equinix's trusted platform to bring together and interconnect foundational infrastructure at software speed. Equinix enables organizations to access all the right places, partners and possibilities to scale with agility, speed the launch of digital services, deliver world-class experiences and multiply their value, while supporting their sustainability goals.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:33:37"},{"Company Name":"CVS Health Corporation","Symbol":"CVS","Current Price":"66.04","Latest MA":"59.19","Latest MA 5":64.6929611597,"Latest MA 9":64.144978439,"Latest MA 20":63.0297405341,"RSI":73.6274354612,"Price Target":79.4892,"Difference from MA":"11.58%","Difference from Open":"0.48%","Change from Yesterday":"0.49%","Change from Last Report":"0.25","Latest Volume":"2,777,016","Market Cap":"83,547,996,160","Earning Date":"31-07-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.192099,"PB Ratio":1.0834476,"Previous Close":65.72,"ROE":0.06934,"DTE":105.321,"Industry":"Healthcare Plans","Sector":"Healthcare","Beta":0.561,"Trailing PEG":0.6901,"Trailing PE":15.762482,"Trailing PS":15.762482,"Quick Ratio":0.588,"Day High":66.06,"Day Low":64.8242,"VS Average Volume":0.2763566826,"Company Summary":"CVS Health Corporation provides health solutions in the United States. It operates through Health Care Benefits, Health Services, and Pharmacy & Consumer Wellness segments. The Health Care Benefits segment offers traditional, voluntary, and consumer-directed health insurance products and related services, including medical, pharmacy, dental and behavioral health plans, medical management capabilities, Medicare Advantage and Medicare Supplement plans, PDPs and Medicaid health care management services. It serves employer groups, individuals, college students, part-time and hourly workers, health plans, health care providers, governmental units, government-sponsored plans, labor groups, and expatriates. The Health Services segment offers pharmacy benefit management solutions, including plan design and administration, formulary management, retail pharmacy network management, specialty and mail order pharmacy, clinical, disease management, medical spend management services, and other administrative services. It serves employers, insurance companies, unions, government employee groups, health plans, prescription drug plans, Medicaid managed care plans, CMS, plans offered on public health insurance, and other sponsors of health benefit plans. The Pharmacy & Consumer Wellness segment sells prescription and over-the-counter drugs, consumer health and beauty products, and personal care products. This segment also distributes prescription drugs; and provides related pharmacy consulting and other ancillary services to care facilities and other care settings. It operates online retail pharmacy websites, LTC pharmacies and on-site pharmacies, retail specialty pharmacy stores, compounding pharmacies and branches for infusion and enteral nutrition services. The company was formerly known as CVS Caremark Corporation and changed its name to CVS Health Corporation in September 2014. CVS Health Corporation was incorporated in 1996 and is headquartered in Woonsocket, Rhode Island.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:33:37"},{"Company Name":"Arthur J. Gallagher & Co.","Symbol":"AJG","Current Price":"318.42","Latest MA":"314.49","Latest MA 5":318.4689985352,"Latest MA 9":327.5681956651,"Latest MA 20":334.4149730225,"RSI":34.1316642765,"Price Target":339.445,"Difference from MA":"1.25%","Difference from Open":"1.65%","Change from Yesterday":"1.75%","Change from Last Report":"0.12","Latest Volume":"572,048","Market Cap":"81,531,117,568","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":28.228281,"PB Ratio":3.6534755,"Previous Close":312.94,"ROE":0.092980005,"DTE":60.048,"Industry":"Insurance Brokers","Sector":"Financial Services","Beta":0.75,"Trailing PEG":1.2667,"Trailing PE":49.13812,"Trailing PS":49.13812,"Quick Ratio":0.573,"Day High":318.57,"Day Low":312.3801,"VS Average Volume":0.409588434,"Company Summary":"Arthur J. Gallagher & Co., together with its subsidiaries, provides insurance and reinsurance brokerage, consulting, and third-party property\/casualty claims settlement and administration services to entities and individuals worldwide. It operates in Brokerage and Risk Management segments. The Brokerage segment offers retail and wholesale insurance and reinsurance brokerage services; assists retail brokers and other non-affiliated brokers in the placement of specialized and hard-to-place insurance; and acts as a brokerage wholesaler, managing general agent, and managing general underwriter for distributing specialized insurance coverages to underwriting enterprises. This segment performs activities, including marketing, underwriting, issuing policies, collecting premiums, appointing and supervising other agents, paying claims, and negotiating reinsurance; and offers services in the areas of insurance and reinsurance placement, risk of loss management, and management of employer sponsored benefit programs. The Risk Management segment provides contract claim settlement and administration services; and claims management, loss control consulting, and insurance property appraisal services. The company offers its services through a network of correspondent brokers and consultants. It serves commercial, industrial, public, religious, and nonprofit entities, as well as underwriting enterprises. The company was founded in 1927 and is headquartered in Rolling Meadows, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:33:37"},{"Company Name":"Aon plc","Symbol":"AON","Current Price":"354.25","Latest MA":"374.26","Latest MA 5":356.0719970703,"Latest MA 9":363.7899983724,"Latest MA 20":362.8659988403,"RSI":38.3475315234,"Price Target":396.07315,"Difference from MA":"-5.35%","Difference from Open":"0.77%","Change from Yesterday":"1.36%","Change from Last Report":"0.10","Latest Volume":"310,026","Market Cap":"76,496,748,544","Earning Date":"25-04-2025","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":20.370903,"PB Ratio":10.929932,"Previous Close":349.48,"ROE":0.72012,"DTE":254.468,"Industry":"Insurance Brokers","Sector":"Financial Services","Beta":0.864,"Trailing PEG":1.697,"Trailing PE":30.61798,"Trailing PS":30.61798,"Quick Ratio":0.252,"Day High":354.78,"Day Low":349.75,"VS Average Volume":0.2208041297,"Company Summary":"Aon plc, a professional services firm, provides a range of risk and human capital solutions worldwide. It offers commercial risk solutions, including retail brokerage, specialty solutions, global risk consulting and captive management, and affinity programs; and health solutions, such as consulting and brokerage, consumer benefit, and talent advisory services. The company also provides insurance-linked securities, capital raising, strategic advice, restructuring, and merger and acquisition services; and risk management products and services, capital market solutions, and corporate finance advisory services. In addition, the company offers treaty and facultative reinsurance services; strategic design advice and actuarial services; and investment advisory services on developing and maintaining investment programs across various plan types, including defined benefit plans, defined contribution plans, and trusts for corporations, public pensions, endowments, and foundations. The company was founded in 1919 and is headquartered in Dublin, Ireland.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:33:37"},{"Company Name":"Zoetis Inc.","Symbol":"ZTS","Current Price":"168.47","Latest MA":"164.89","Latest MA 5":167.3340024414,"Latest MA 9":168.1766678196,"Latest MA 20":165.8995002136,"RSI":57.441297201,"Price Target":195.372,"Difference from MA":"2.17%","Difference from Open":"1.19%","Change from Yesterday":"1.29%","Change from Last Report":"-0.10","Latest Volume":"1,129,872","Market Cap":"75,004,190,720","Earning Date":"06-05-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":26.572556,"PB Ratio":16.143158,"Previous Close":166.33,"ROE":0.52085996,"DTE":145.628,"Industry":"Drug Manufacturers - Specialty & Generic","Sector":"Healthcare","Beta":0.944,"Trailing PEG":2.8315,"Trailing PE":30.24596,"Trailing PS":30.24596,"Quick Ratio":0.916,"Day High":168.73,"Day Low":165.52,"VS Average Volume":0.3944702276,"Company Summary":"Zoetis Inc. engages in the discovery, development, manufacture, and commercialization of animal health medicines, vaccines, diagnostic products and services, biodevices, genetic tests, and precision animal health products in the United States and internationally. The company commercializes products primarily across species, including livestock, such as cattle, swine, poultry, fish, and sheep; and companion animals comprising dogs, cats, and horses. It also offers parasiticides, vaccines, dermatology, anti-infectives, pain and sedation, other pharmaceutical, and animal health diagnostics. In addition, the company provides animal health diagnostics, including point-of-care diagnostic products, instruments and reagents, rapid immunoassay tests, reference laboratory kits and services, and blood glucose monitors; and other non-pharmaceutical products, which include nutritionals, as well as products and services in biodevices, genetic tests, and precision animal health. It markets its products to veterinarians, livestock producers, and pet owners. The company has collaboration Blacksmith Medicines, Inc. to discover and develop novel antibiotics for animal health. Zoetis Inc. was founded in 1950 and is headquartered in Parsippany, New Jersey.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:33:37"},{"Company Name":"Colgate-Palmolive Company","Symbol":"CL","Current Price":"92.35","Latest MA":"90.76","Latest MA 5":91.5020007324,"Latest MA 9":91.1566672431,"Latest MA 20":91.4795002747,"RSI":62.6002502833,"Price Target":98.309,"Difference from MA":"1.76%","Difference from Open":"0.18%","Change from Yesterday":"0.26%","Change from Last Report":"0.10","Latest Volume":"2,148,343","Market Cap":"74,842,284,032","Earning Date":"01-08-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":23.924871,"PB Ratio":206.13838,"Previous Close":92.11,"ROE":4.51259,"DTE":1128.104,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":0.382,"Trailing PEG":1.9967,"Trailing PE":26.161472,"Trailing PS":26.161472,"Quick Ratio":0.443,"Day High":93.0,"Day Low":91.95,"VS Average Volume":0.3987634738,"Company Summary":"Colgate-Palmolive Company, together with its subsidiaries, manufactures and sells consumer products in the United States and internationally. It operates through two segments: Oral, Personal and Home Care; and Pet Nutrition. The Oral, Personal and Home Care segment offers toothpaste, toothbrushes, mouthwash, bar and liquid hand soaps, shower gels, shampoos, conditioners, deodorants and antiperspirants, skin health products, dishwashing detergents, fabric conditioners, household cleaners, and other related items. This segment markets and sells its products under the Colgate, Palmolive, Darlie, elmex, hello, meridol, Sorriso, Tom's of Maine, EltaMD, Filorga, Irish Spring, Protex, Sanex, Softsoap, Lady Speed Stick, Speed Stick, PCA SKIN, Ajax, Axion, Fabuloso, Murphy, Suavitel, and Soupline brands to a range of traditional and eCommerce retailers, wholesalers, and distributors, as well as dentists and skin health professionals. It also offers pharmaceutical products for dentists and other oral health professionals. The Pet Nutrition segment offers pet nutrition products for everyday nutritional needs under the Hill's Science Diet brand; and a range of therapeutic pet products to help nutritionally support dogs and cats in different stages of health under the Hill's Prescription Diet brand. This segment markets and sells its products through pet supply retailers, veterinarians, and eCommerce retailers. Colgate-Palmolive Company was founded in 1806 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:33:37"},{"Company Name":"Illinois Tool Works Inc.","Symbol":"ITW","Current Price":"246.61","Latest MA":"253.30","Latest MA 5":247.413998291,"Latest MA 9":246.3999972195,"Latest MA 20":246.5544990234,"RSI":51.3668458463,"Price Target":246.72278,"Difference from MA":"-2.64%","Difference from Open":"0.48%","Change from Yesterday":"-0.00%","Change from Last Report":"0.04","Latest Volume":"225,089","Market Cap":"72,346,992,640","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":23.047665,"PB Ratio":22.295452,"Previous Close":246.62,"ROE":1.07584,"DTE":254.874,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":1.119,"Trailing PEG":3.5944,"Trailing PE":21.689533,"Trailing PS":21.689533,"Quick Ratio":1.065,"Day High":246.79,"Day Low":244.2801,"VS Average Volume":0.1918371069,"Company Summary":"Illinois Tool Works Inc. manufactures and sells industrial products and equipment in the United States and internationally. It operates through seven segments: Automotive OEM; Food Equipment; Test & Measurement and Electronics; Welding; Polymers & Fluids; Construction Products; and Specialty Products. The Automotive OEM segment offers plastic and metal components, fasteners, and assemblies for automobiles, light trucks, and other industrial uses. The Food Equipment segment provides warewashing, refrigeration, cooking, and food processing equipment; kitchen exhaust, ventilation, and pollution control systems; and food equipment maintenance and repair services. The Test & Measurement and Electronics segment produces and sells equipment, consumables, and related software for testing and measuring of materials and structures, as well as equipment and consumables used in the production of electronic subassemblies and microelectronics. The Welding segment produces arc welding equipment; and metal arc welding consumables and related accessories. The Polymers & Fluids segment produces adhesives, sealants, lubrication and cutting fluids, and fluids and polymers for auto aftermarket maintenance and appearance. The Construction Products segment offers engineered fastening systems and solutions for the residential construction, renovation\/remodel, and commercial construction markets. The Specialty Products segment provides beverage packaging equipment and consumables, product coding and marking equipment and consumables, and appliance components and fasteners. It serves the automotive OEM and tiers, MRO, commercial food equipment, construction, general industrial, industrial capital goods, consumer durables, automotive aftermarket end, and other markets. The company distributes its products directly to industrial manufacturers, as well as through independent distributors. Illinois Tool Works Inc. was founded in 1912 and is based in Glenview, Illinois.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:33:37"},{"Company Name":"Emerson Electric Company","Symbol":"EMR","Current Price":"126.48","Latest MA":"118.83","Latest MA 5":125.8040001831,"Latest MA 9":123.5977779473,"Latest MA 20":121.1015997162,"RSI":78.9788779753,"Price Target":134.51357,"Difference from MA":"6.44%","Difference from Open":"0.83%","Change from Yesterday":"-0.01%","Change from Last Report":"-0.07","Latest Volume":"1,376,911","Market Cap":"71,144,996,864","Earning Date":"07-05-2025","Earning Time":"Before","Earning Day of Week":"Saturday","PE Ratio":20.01266,"PB Ratio":3.696084,"Previous Close":126.49,"ROE":0.08335,"DTE":77.857,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":1.268,"Trailing PEG":1.5813,"Trailing PE":36.44957,"Trailing PS":36.44957,"Quick Ratio":0.547,"Day High":126.76,"Day Low":124.78,"VS Average Volume":0.4260923384,"Company Summary":"Emerson Electric Co., a technology and software company, provides various solutions in the Americas, Asia, the Middle East, Africa, and Europe. It operates through seven segments: Final Control, Measurement & Analytical, Discrete Automation, Safety & Productivity, Control Systems & Software, Test & Measurement, and AspenTech. The Final Control segment provides control, isolation, shutoff, pressure relief, and pressure safety valves, actuators, and regulators for process and hybrid industries. The Measurement & Analytical segment offers intelligent instrumentation measuring the physical properties of liquids or gases, such as pressure, temperature, level, flow, acoustics, corrosion, pH, conductivity, water quality, toxic gases, and flame. The Discrete Automation segment offers solenoid and pneumatic valves, valve position indicators, pneumatic cylinders, actuators, air preparation equipment, pressure and temperature switches, electric linear motion solutions, programmable automation control systems, electrical distribution equipment, and materials joining solutions. The Safety & Productivity segment offers tools for professionals and homeowners; pipe-working tools, including pipe wrenches, pipe cutters, pipe threading and roll grooving equipment, battery hydraulic tools; electrical tools; and other professional tools. The Control Systems & Software segment provides control systems, safety instrumented systems, SCADA systems, application software, digital twins, asset performance management, and cybersecurity. The Test & Measurement provides software-connected automated test and measurement systems. The AspenTech segment provides asset optimization software that enables industrial manufacturers to design, operate, and maintain operations for enhancing performance through a combination of decades of modeling, simulation, and optimization capabilities. The company was incorporated in 1890 and is based in Saint Louis, Missouri.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:33:37"},{"Company Name":"The Travelers Companies, Inc.","Symbol":"TRV","Current Price":"264.31","Latest MA":"253.16","Latest MA 5":265.5651433105,"Latest MA 9":268.7351551649,"Latest MA 20":270.5979752808,"RSI":38.5392731777,"Price Target":280.3742,"Difference from MA":"4.40%","Difference from Open":"1.54%","Change from Yesterday":"1.16%","Change from Last Report":"0.08","Latest Volume":"472,681","Market Cap":"59,884,449,792","Earning Date":"16-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":12.438118,"PB Ratio":2.1245248,"Previous Close":261.27,"ROE":0.16052,"DTE":28.495,"Industry":"Insurance - Property & Casualty","Sector":"Financial Services","Beta":0.537,"Trailing PEG":3.3139,"Trailing PE":14.388132,"Trailing PS":14.388132,"Quick Ratio":0.186,"Day High":264.31,"Day Low":258.86,"VS Average Volume":0.3449264512,"Company Summary":"The Travelers Companies, Inc., through its subsidiaries, provides a range of commercial and personal property, and casualty insurance products and services to businesses, government units, associations, and individuals in the United States and internationally. The company operates through three segments: Business Insurance, Bond & Specialty Insurance, and Personal Insurance. The Business Insurance segment offers workers' compensation, commercial automobile and property, general liability, commercial multi-peril, employers' liability, public and product liability, professional indemnity, marine, aviation, onshore and offshore energy, construction, terrorism, personal accident, and kidnap and ransom insurance products. This segment operates through select accounts, which serve small businesses; commercial accounts that serve mid-sized businesses; national accounts, which serve large companies; and national property and other that serve large and mid-sized customers, commercial trucking industry, and agricultural businesses, as well as markets and distributes its products through brokers, wholesale agents, and program managers. The Bond & Specialty Insurance segment provides surety, fidelity, management and professional liability, and other property and casualty coverages and related risk management services through independent agencies and brokers. The Personal Insurance segment offers property and casualty insurance covering personal risks, primarily automobile and homeowners' insurance to individuals through independent agencies and brokers. The Travelers Companies, Inc. was founded in 1853 and is based in New York, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"12-06-2025 20:33:37"},{"Company Name":"Freeport-McMoRan, Inc.","Symbol":"FCX","Current Price":"41.30","Latest MA":"38.81","Latest MA 5":41.6639993286,"Latest MA 9":41.2511110094,"Latest MA 20":39.7859999084,"RSI":59.1800421306,"Price Target":44.28,"Difference from MA":"6.41%","Difference from Open":"2.23%","Change from Yesterday":"0.71%","Change from Last Report":"-0.17","Latest Volume":"4,637,289","Market Cap":"59,315,056,640","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":19.120369,"PB Ratio":3.3552685,"Previous Close":41.01,"ROE":0.14062001,"DTE":32.19,"Industry":"Copper","Sector":"Basic Materials","Beta":1.632,"Trailing PEG":4.6623,"Trailing PE":33.85246,"Trailing PS":33.85246,"Quick Ratio":0.958,"Day High":41.675,"Day Low":40.2701,"VS Average Volume":0.2801065075,"Company Summary":"Freeport-McMoRan Inc. engages in the mining of mineral properties in North America, South America, and Indonesia. It primarily explores for copper, gold, molybdenum, silver, and other metals. The company's assets include the Grasberg minerals district in Indonesia; Morenci, Bagdad, Safford, Sierrita, and Miami in Arizona; Chino and Tyrone in New Mexico; and Henderson and Climax in Colorado, North America, as well as Cerro Verde in Peru and El Abra in Chile. The company was formerly known as Freeport-McMoRan Copper & Gold Inc. and changed its name to Freeport-McMoRan Inc. in July 2014. The company was incorporated in 1987 and is headquartered in Phoenix, Arizona.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:33:37"},{"Company Name":"Truist Financial Corporation","Symbol":"TFC","Current Price":"39.83","Latest MA":"42.17","Latest MA 5":40.3849996948,"Latest MA 9":39.9905551487,"Latest MA 20":40.0467498398,"RSI":47.0272783941,"Price Target":45.2155,"Difference from MA":"-5.57%","Difference from Open":"-0.44%","Change from Yesterday":"-1.08%","Change from Last Report":"0.10","Latest Volume":"2,878,694","Market Cap":"52,152,430,592","Earning Date":"18-07-2025","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":10.082278,"PB Ratio":0.88803905,"Previous Close":40.26,"ROE":0.0013400001,"DTE":null,"Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.815,"Trailing PEG":null,"Trailing PE":null,"Trailing PS":null,"Quick Ratio":null,"Day High":40.0099,"Day Low":39.495,"VS Average Volume":0.2905158249,"Company Summary":"Truist Financial Corporation, a financial services company, provides banking and trust services in the Southeastern and Mid-Atlantic United States. The company operates through three segments: Consumer Banking and Wealth, Corporate and Commercial Banking, and Insurance Holdings.Its deposit products include noninterest-bearing checking, interest-bearing checking, savings, and money market deposit accounts, as well as certificates of deposit and individual retirement accounts. The company also provides funding; asset management; automobile lending; credit card lending; consumer finance; home equity and mortgage lending; other direct retail lending; insurance; investment brokerage; mobile\/online banking; payment solutions; point-of-sale lending; retail and small business deposit products; small business lending; and wealth management\/private banking services. In addition, it offers asset based lending, investment banking and capital market, institutional trust, insurance premium finance, derivatives, commercial lending, international banking, leasing, merchant, commercial deposit and treasury, floor plan, mortgage warehouse lending, real estate lending, and supply chain financing services. Further, the company provides insurance brokerage, retail and wholesale brokerage, securities underwriting and market making, loan syndication, and investment management and advisory services. The company was formerly known as BB&T Corporation and changed its name to Truist Financial Corporation in December 2019. Truist Financial Corporation was founded in 1872 and is headquartered in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:33:37"},{"Company Name":"ONEOK, Inc.","Symbol":"OKE","Current Price":"83.13","Latest MA":"94.47","Latest MA 5":82.1180013428,"Latest MA 9":82.0055561998,"Latest MA 20":82.319,"RSI":59.1339977388,"Price Target":105.35833,"Difference from MA":"-12.00%","Difference from Open":"0.29%","Change from Yesterday":"0.28%","Change from Last Report":"-0.01","Latest Volume":"1,866,956","Market Cap":"51,925,655,552","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":13.9246235,"PB Ratio":2.4304886,"Previous Close":82.9,"ROE":0.16409001,"DTE":144.846,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.931,"Trailing PEG":1.4399,"Trailing PE":16.236328,"Trailing PS":16.236328,"Quick Ratio":0.452,"Day High":83.57,"Day Low":82.52,"VS Average Volume":0.4610071824,"Company Summary":"ONEOK, Inc. operates as a midstream service provider of gathering, processing, fractionation, transportation, storage, and marine export services in the United States. It operates in four segments: Natural Gas Gathering and Processing; Natural Gas Liquids; Natural Gas Pipelines; and Refined Products and Crude. The company owns natural gas gathering pipelines and processing plants in the Mid-Continent, Permian Basin, North Texas, Gulf Coast region, and Rocky Mountain regions; and provides midstream services to producers of NGLs. It also owns NGL gathering and distribution pipelines, fractionation, terminal and storage facilities; and transports refined products, including gasoline, diesel fuel, aviation fuel, kerosene, and heating oil. In addition, the company transports and stores natural gas through regulated interstate and intrastate natural gas transmission pipelines, and natural gas storage facilities; it owns and operates a parking garage in downtown Tulsa, Oklahoma; and leases buildings, warehouses, office space, land, and equipment, including pipeline equipment, pipeline capacity, rail cars, and information technology equipment. Further, the company transports, stores, and distributes refined products, purity NGLs, and crude oil, as well as conducts commodity-related activities, including liquids blending and marketing activities. It serves integrated and independent exploration and production companies; other NGL and natural gas gathering and processing companies; crude oil and natural gas production companies; utilities; industrial companies; natural gasoline distributors; propane distributors; municipalities; ethanol producers; petrochemical, refining, and marketing companies; and diluent users, refineries, and exporters. ONEOK, Inc. was founded in 1906 and is headquartered in Tulsa, Oklahoma.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:33:37"},{"Company Name":"Becton, Dickinson and Company","Symbol":"BDX","Current Price":"174.62","Latest MA":"212.83","Latest MA 5":173.3304967041,"Latest MA 9":171.6214500597,"Latest MA 20":172.2643883972,"RSI":59.4364977392,"Price Target":221.75357,"Difference from MA":"-17.95%","Difference from Open":"1.28%","Change from Yesterday":"1.10%","Change from Last Report":"-0.17","Latest Volume":"791,175","Market Cap":"50,048,032,768","Earning Date":"07-08-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":11.10124,"PB Ratio":1.9828143,"Previous Close":172.72,"ROE":0.058870003,"DTE":76.344,"Industry":"Medical Instruments & Supplies","Sector":"Healthcare","Beta":0.279,"Trailing PEG":0.7529,"Trailing PE":33.84157,"Trailing PS":33.84157,"Quick Ratio":0.483,"Day High":175.23,"Day Low":171.7,"VS Average Volume":0.2693816556,"Company Summary":"Becton, Dickinson and Company develops, manufactures, and sells medical supplies, devices, laboratory equipment, and diagnostic products for healthcare institutions, physicians, life science researchers, clinical laboratories, pharmaceutical industry, and the general public worldwide. The BD Medical segment provides peripheral intravenous (IV) and advanced peripheral catheters, central lines, acute dialysis catheters, vascular access technology, vascular care and preparation products, needle-free IV connectors and extensions sets, closed-system drug transfer devices, hazardous drug detections, hypodermic syringes and needles, anesthesia needles and trays, enteral syringes, and sharps disposal systems; IV medication safety and infusion therapy delivery systems, medication compounding workflow systems, automated medication dispensing and supply management systems, informatics and analytics and pharmacy automation systems, and medication inventory optimization and tracking systems; hemodynamic monitoring systems; and prefillable drug delivery systems. The BD Life Sciences segment offers specimen and blood collection products; automated blood and tuberculosis culturing, molecular testing, microorganism identification and drug susceptibility, and liquid-based cytology systems, as well as rapid diagnostic assays, microbiology laboratory automation products, and plated media products; and fluorescence-activated cell sorters and analyzers, antibodies and kits, reagent systems, and solutions for single-cell gene expression analysis, as well as clinical oncology, immunological, and transplantation diagnostic\/monitoring reagents and analyzers. The BD Interventional segment provides hernia and soft tissue repair, biological and bioresorbable grafts, biosurgery, and other surgical products; surgical infection prevention; peripheral intervention products; and urology and critical care products. The company was founded in 1897 and is headquartered in Franklin Lakes, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:33:37"},{"Company Name":"Phillips 66","Symbol":"PSX","Current Price":"121.66","Latest MA":"117.53","Latest MA 5":118.3399986572,"Latest MA 9":116.2955555556,"Latest MA 20":116.5499586182,"RSI":71.7195413773,"Price Target":131.016,"Difference from MA":"3.52%","Difference from Open":"1.63%","Change from Yesterday":"0.59%","Change from Last Report":"-0.10","Latest Volume":"994,024","Market Cap":"49,568,784,384","Earning Date":"25-07-2025","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":12.819811,"PB Ratio":1.8181547,"Previous Close":120.95,"ROE":0.0656,"DTE":66.317,"Industry":"Oil & Gas Refining & Marketing","Sector":"Energy","Beta":0.998,"Trailing PEG":0.8511,"Trailing PE":27.400902,"Trailing PS":27.400902,"Quick Ratio":0.787,"Day High":122.0,"Day Low":119.05,"VS Average Volume":0.2961352894,"Company Summary":"Phillips 66 operates as an energy manufacturing and logistics company in the United States, the United Kingdom, Germany, and internationally. It operates through five segments: Midstream, Chemicals, Refining, Marketing and Specialties (M&S), and Renewable Fuels. The Midstream segment transports crude oil and other feedstocks; delivers refined petroleum products to market; provides terminaling and storage services for crude oil and refined petroleum products; gathers, processes, transports, and markets natural gas; transports, fractionates, markets, and exports natural gas liquids. The Chemicals segment produces and markets ethylene and other olefin products; aromatics and styrenics products, such as benzene, cyclohexane, styrene, and polystyrene; and various specialty chemical products, including organosulfur chemicals, solvents, catalysts, and chemicals used in drilling and mining. The Refining segment refines crude oil and other feedstocks into petroleum products, such as gasolines, distillates, and aviation fuels. The M&S segment purchases for resale and markets refined petroleum products, including gasolines, distillates, and aviation fuels. This segment also manufactures and markets specialty products, such as automotive, commercial, industrial, and specialty lubricants, as well as base oils. The Renewable Fuels segment processes renewable feedstocks into renewable products. This segment also procures renewable feedstocks, manage certain regulatory credits, and market renewable diesel, renewable jet fuel and other renewable fuels. The company markets its products through Phillips 66, Conoco and 76, JET, Kendall, Red Line, and other private label brands. Phillips 66 was founded in 1875 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:33:37"},{"Company Name":"Xcel Energy Inc.","Symbol":"XEL","Current Price":"68.67","Latest MA":"68.42","Latest MA 5":68.5539996948,"Latest MA 9":68.7666670397,"Latest MA 20":69.7119999847,"RSI":44.2586144093,"Price Target":75.125,"Difference from MA":"0.36%","Difference from Open":"0.20%","Change from Yesterday":"0.62%","Change from Last Report":"0.12","Latest Volume":"859,886","Market Cap":"39,606,177,792","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":17.929504,"PB Ratio":1.9991848,"Previous Close":68.25,"ROE":0.102589995,"DTE":163.558,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.385,"Trailing PEG":2.6887,"Trailing PE":20.197058,"Trailing PS":20.197058,"Quick Ratio":0.516,"Day High":68.82,"Day Low":68.19,"VS Average Volume":0.2234831345,"Company Summary":"Xcel Energy Inc., through its subsidiaries, engages in the generation, purchasing, transmission, distribution, and sale of electricity in the United States. It operates through Regulated Electric Utility and Regulated Natural Gas Utility segments. The company generates electricity through wind, nuclear, hydroelectric, biomass, and solar energy sources, as well as coal, natural gas, oil, wood, and refuse-derived fuels. It also purchases, transports, distributes, and sells natural gas to retail customers, as well as transports customer-owned natural gas. In addition, the company develops and leases natural gas pipelines, and storage and compression facilities; and invests in rental housing projects and nonregulated assets, as well as procures equipment for the construction of renewable generation facilities. It serves residential, commercial, and industrial customers in the portions of Colorado, Michigan, Minnesota, New Mexico, North Dakota, South Dakota, Texas, and Wisconsin. Xcel Energy Inc. was formerly known as Northern States Power company. The company was incorporated in 1909 and is headquartered in Minneapolis, Minnesota.","Stock Sentiment":"N\/A","Row Color":"positive-row","Last Updated":"12-06-2025 20:33:37"},{"Company Name":"VICI Properties Inc.","Symbol":"VICI","Current Price":"32.52","Latest MA":"30.84","Latest MA 5":32.1870000153,"Latest MA 9":31.9194444699,"Latest MA 20":31.78825,"RSI":72.8822358567,"Price Target":36.11957,"Difference from MA":"5.44%","Difference from Open":"0.08%","Change from Yesterday":"0.11%","Change from Last Report":"0.20","Latest Volume":"1,479,380","Market Cap":"34,358,925,312","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":11.910256,"PB Ratio":1.2912,"Previous Close":32.48,"ROE":0.1012,"DTE":65.738,"Industry":"REIT - Diversified","Sector":"Real Estate","Beta":0.724,"Trailing PEG":null,"Trailing PE":13.006,"Trailing PS":13.006,"Quick Ratio":21.502,"Day High":32.56,"Day Low":32.305,"VS Average Volume":0.2119866501,"Company Summary":"VICI Properties Inc. is an S&P 500 experiential real estate investment trust that owns one of the largest portfolios of market-leading gaming, hospitality and entertainment destinations, including Caesars Palace Las Vegas, MGM Grand and the Venetian Resort Las Vegas, three of the most iconic entertainment facilities on the Las Vegas Strip. VICI Properties owns 93 experiential assets across a geographically diverse portfolio consisting of 54 gaming properties and 39 other experiential properties across the United States and Canada. The portfolio is comprised of approximately 127 million square feet and features approximately 60,300 hotel rooms and over 500 restaurants, bars, nightclubs and sportsbooks. Its properties are occupied by industry-leading gaming, leisure and hospitality operators under long-term, triple-net lease agreements. VICI Properties has a growing array of real estate and financing partnerships with leading operators in other experiential sectors, including Bowlero, Cabot, Canyon Ranch, Chelsea Piers, Great Wolf Resorts, Homefield and Kalahari Resorts. VICI Properties also owns four championship golf courses and 33 acres of undeveloped and underdeveloped land adjacent to the Las Vegas Strip. VICI Properties' goal is to own the highest quality and most productive experiential real estate portfolio through a strategy of partnering with the highest quality experiential place makers and operators.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:35:49"},{"Company Name":"Delta Air Lines, Inc.","Symbol":"DAL","Current Price":"48.73","Latest MA":"55.19","Latest MA 5":50.345,"Latest MA 9":49.6527779473,"Latest MA 20":49.441249733,"RSI":43.7636148441,"Price Target":58.46826,"Difference from MA":"-11.72%","Difference from Open":"0.48%","Change from Yesterday":"-0.91%","Change from Last Report":"0.20","Latest Volume":"4,104,452","Market Cap":"31,815,135,232","Earning Date":"09-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":6.940883,"PB Ratio":2.0459793,"Previous Close":49.17,"ROE":0.27521,"DTE":151.356,"Industry":"Airlines","Sector":"Industrials","Beta":1.508,"Trailing PEG":null,"Trailing PE":8.639184,"Trailing PS":8.639184,"Quick Ratio":0.248,"Day High":48.94,"Day Low":47.88,"VS Average Volume":0.3395987814,"Company Summary":"Delta Air Lines, Inc. provides scheduled air transportation for passengers and cargo in the United States and internationally. The company operates through two segments, Airline and Refinery. Its domestic network centered on core hubs in Atlanta, Detroit, Minneapolis-St. Paul, and Salt Lake City, as well as coastal hub positions in Boston, Los Angeles, New York-LaGuardia, New York-JFK, and Seattle; and international network centered on hubs and market presence in Amsterdam, Bogota, Lima, Mexico City, London-Heathrow, Paris-Charles de Gaulle, Santiago (Chile), Sao Paulo, Seoul-Incheon, and Tokyo. The company sells its tickets through various distribution channels, including delta.com and the Fly Delta app; and acts as a reservations specialists. It also provides aircraft maintenance and engineering support, repair, and overhaul services; and vacation packages to third-party consumers. The company operates through a fleet of approximately 1,292 aircraft. Delta Air Lines, Inc. was founded in 1924 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:35:49"},{"Company Name":"Fifth Third Bancorp","Symbol":"FITB","Current Price":"38.91","Latest MA":"41.00","Latest MA 5":39.3639999695,"Latest MA 9":38.9488890076,"Latest MA 20":38.6509998398,"RSI":52.3470489096,"Price Target":44.51136,"Difference from MA":"-5.09%","Difference from Open":"0.05%","Change from Yesterday":"-0.59%","Change from Last Report":"0.08","Latest Volume":"1,341,889","Market Cap":"25,972,111,360","Earning Date":"17-07-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.660274,"PB Ratio":1.4197621,"Previous Close":39.14,"ROE":0.11715,"DTE":null,"Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.918,"Trailing PEG":2.5394,"Trailing PE":12.352381,"Trailing PS":12.352381,"Quick Ratio":null,"Day High":38.99,"Day Low":38.41,"VS Average Volume":0.2795409317,"Company Summary":"Fifth Third Bancorp operates as the bank holding company for Fifth Third Bank, National Association that engages in the provision of a range of financial products and services in the United States. It operates through three segments: Commercial Banking, Consumer and Small Business Banking, and Wealth and Asset Management. The Commercial Banking segment offers credit intermediation, cash management, and financial services; lending and depository products; and cash management, foreign exchange and international trade finance, derivatives and capital markets services, asset-based lending, real estate finance, public finance, commercial leasing, and syndicated finance for business, government, and professional customers. Its Consumer and Small Banking segment provides a range of deposit and loan products to individuals and small businesses; home equity loans and lines of credit; credit cards; and cash management services. This segment also engages in the residential mortgage that include origination, retention and servicing of residential mortgage loans, sales and securitizations of loans, and hedging activities; indirect lending, including extending loans to consumers through automobile dealers, motorcycle dealers, powersport dealers, recreational vehicle dealers, and marine dealers; and home improvement and solar energy installation loans through contractors and installers. The Wealth & Asset Management segment provides various wealth management services for individuals, companies, and not-for-profit organizations. It also offers retail brokerage services to individual clients; and broker dealer services to the institutional marketplace. This segment also provides wealth planning, investment management, banking, insurance, and trust and estate services; and advisory services for institutional clients comprising middle market businesses, non-profits, states, and municipalities. Fifth Third Bancorp was founded in 1858 and is headquartered in Cincinnati, Ohio.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:35:49"},{"Company Name":"PPG Industries, Inc.","Symbol":"PPG","Current Price":"112.31","Latest MA":"113.76","Latest MA 5":113.2850001221,"Latest MA 9":112.3705560303,"Latest MA 20":112.1987505646,"RSI":50.7808446219,"Price Target":126.51409,"Difference from MA":"-1.27%","Difference from Open":"0.25%","Change from Yesterday":"-0.61%","Change from Last Report":"-0.03","Latest Volume":"562,394","Market Cap":"25,492,699,136","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":12.69096,"PB Ratio":3.680649,"Previous Close":113.01,"ROE":0.1765,"DTE":111.012,"Industry":"Specialty Chemicals","Sector":"Basic Materials","Beta":1.156,"Trailing PEG":0.8206,"Trailing PE":19.878761,"Trailing PS":19.878761,"Quick Ratio":0.913,"Day High":112.52,"Day Low":111.51,"VS Average Volume":0.2645825394,"Company Summary":"PPG Industries, Inc. manufactures and distributes paints, coatings, and specialty materials in the United States, Canada, the Asia Pacific, Latin America, Europe, the Middle East, and Africa. It operates through three segments: Global Architectural Coatings, Performance Coatings, and Industrial Coatings. The Global Architectural Coatings segment offers paints, wood stains, adhesives, sealants, and purchased sundries for painting and maintenance contractors and consumers. The Performance Coatings segment offers coatings, sealants, transparencies, adhesives, engineered materials, packaging, and chemical management services for aerospace industry; coatings, solvents, adhesives, sealants, purchased sundries, digital solutions and paint films for automotive and commercial transport industries; coatings and finishes for protection of metals and structures; and paints, thermoplastics, raised pavement markers, and other pavement marking technologies for government, commercial infrastructure, painting, and maintenance contractors. The Industrial Coatings segment provides coatings, adhesives and sealants, metal pretreatments, and paint films, as well as technical services and coatings applications for automotive original equipment manufacturers, tier supplier, appliances, agricultural and construction equipment, consumer electronics, automotive parts and accessories, building products, kitchenware, and transportation vehicles and other finished products; and on-site coatings services. It also offers coatings for metal cans, closures, plastic and aluminum tubes for food, beverage and personal care, promotional, and specialty packaging; TESLIN substrates for labels, e-passports, drivers' licenses, breathable membranes, and loyalty and identification cards; and organic light emitting diode materials, displays and lighting lens materials, optical lenses, color-change products, and photochromic dyes. The company was incorporated in 1883 and is based in Pittsburgh, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:35:49"},{"Company Name":"GoDaddy Inc.","Symbol":"GDDY","Current Price":"177.93","Latest MA":"188.67","Latest MA 5":179.177998291,"Latest MA 9":180.2633319092,"Latest MA 20":182.6864986267,"RSI":36.8057910629,"Price Target":210.78444,"Difference from MA":"-5.69%","Difference from Open":"0.88%","Change from Yesterday":"0.58%","Change from Last Report":"-0.05","Latest Volume":"584,851","Market Cap":"25,352,888,320","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":26.517138,"PB Ratio":126.91155,"Previous Close":176.91,"ROE":2.45696,"DTE":1945.769,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.075,"Trailing PEG":2.8654,"Trailing PE":34.217308,"Trailing PS":34.217308,"Quick Ratio":0.326,"Day High":178.27,"Day Low":175.93,"VS Average Volume":0.388996121,"Company Summary":"GoDaddy Inc. engages in the design and development of cloud-based products in the United States and internationally. It operates in two segments: Applications and Commerce (A&C), and Core Platform (Core). The A&C segment offers applications products, including Websites + Marketing, a mobile-optimized online tool that enables customers to build websites and e-commerce enabled online stores; and Managed WordPress, a streamlined and optimized website building that allows customers to build and manage a WordPress site; Managed WooCommerce Stores to sell anything and anywhere online; and marketing tools and services, such as GoDaddy Studio mobile application, search engine optimization, Meta and Google My Business, and email and social media marketing designed to help businesses acquire and engage customers and create content. The segment also offers connected commerce comprising Smart Terminal, a dual screen all-in-one point-of-sale system that allows customers to manage in-store inventory and product catalogs and accept payments; GoDaddy Payments, a payment facilitator that enables customers to accept various forms of payments; and email service plans with a multi-feature web interface, and Microsoft 365 accounts that connects to customers' domains. The Core segment offers domain products, including primary registrations, domain aftermarket platform, and domain name add-ons, as well as GoDaddy Registry, a provider of domain name registry services; and hosting and security services comprising shared website hosting and virtual private servers, as well as security products with a suite of tools designed to help secure customers' online presence. The company serves small businesses, individuals, organizations, developers, designers, and domain investors. GoDaddy Inc. was founded in 1997 and is headquartered in Tempe, Arizona.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"12-06-2025 20:35:49"},{"Company Name":"Huntington Bancshares Incorpora","Symbol":"HBAN","Current Price":"15.96","Latest MA":"15.85","Latest MA 5":16.1619996948,"Latest MA 9":15.9755553097,"Latest MA 20":15.8429999809,"RSI":52.7429899184,"Price Target":17.67895,"Difference from MA":"0.73%","Difference from Open":"-0.25%","Change from Yesterday":"-0.81%","Change from Last Report":"-0.09","Latest Volume":"21,690,657","Market Cap":"23,250,688,000","Earning Date":"18-07-2025","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":11.910447,"PB Ratio":1.260564,"Previous Close":16.09,"ROE":0.103719994,"DTE":null,"Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.945,"Trailing PEG":2.3124,"Trailing PE":12.276923,"Trailing PS":12.276923,"Quick Ratio":null,"Day High":16.03,"Day Low":15.83,"VS Average Volume":0.9261310134,"Company Summary":"Huntington Bancshares Incorporated operates as the bank holding company for The Huntington National Bank that provides commercial, consumer, and mortgage banking services in the United States. The company offers financial products and services to consumer and business customers, including deposits, lending, payments, mortgage banking, dealer financing, investment management, trust, brokerage, insurance, and other financial products and services. It also provides 24-Hour Grace, Asterisk-Free Checking, Money Scout, $50 Safety Zone, Standby Cash, Early Pay, Instant Access, Savings Goal Getter, And Huntington Heads Up; digitally powered consumer and business financial solutions to consumer lending, regional banking, branch banking, and wealth management customers; direct and indirect consumer loans, as well as dealer finance loans and deposits; and private banking, wealth management and legacy planning through investment and portfolio management, fiduciary administration and trust, institutional custody, and full-service retail brokerage investment services. The company offers equipment financing, asset-based lending, distribution finance, structured lending, and municipal financing solutions, as well as Huntington ChoicePay. In addition, it offers lending, liquidity, treasury management and other payment services, and capital markets; government and non-profits, healthcare, technology and telecommunications, franchises, financial sponsors, and global services; and corporate risk management, institutional sales and trading, debt and equity issuance, and additional advisory services. The company offers its products through a network of channels, including branches and ATMs, online and mobile banking, and through customer call centers to customers in middle market banking, corporate, specialty, and government banking, asset finance, commercial real estate banking, and capital markets. The company was founded in 1866 and is headquartered in Columbus, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:35:49"},{"Company Name":"CDW Corporation","Symbol":"CDW","Current Price":"175.70","Latest MA":"176.17","Latest MA 5":177.1699987793,"Latest MA 9":176.9544443766,"Latest MA 20":181.0753457642,"RSI":40.6335761791,"Price Target":208.82909,"Difference from MA":"-0.26%","Difference from Open":"0.22%","Change from Yesterday":"-0.03%","Change from Last Report":"0.06","Latest Volume":"462,339","Market Cap":"23,137,054,720","Earning Date":"07-05-2025","Earning Time":"Before","Earning Day of Week":"Saturday","PE Ratio":17.36166,"PB Ratio":9.960882,"Previous Close":175.75,"ROE":0.48707,"DTE":272.795,"Industry":"Information Technology Services","Sector":"Technology","Beta":0.943,"Trailing PEG":null,"Trailing PE":21.771996,"Trailing PS":21.771996,"Quick Ratio":1.152,"Day High":176.21,"Day Low":173.865,"VS Average Volume":0.3230115298,"Company Summary":"CDW Corporation provides information technology (IT) solutions in the United States, the United Kingdom, and Canada. It operates through three segments: Corporate, Small Business, and Public. The company offers discrete hardware and software products and services, as well as integrated IT solutions, including on-premise and cloud capabilities across hybrid infrastructure, digital experience, and security. It also provides hardware products comprising notebooks\/mobile devices, tablets, network communications, collaboration hardware, data storage and servers, desktop computers, and other hardware; and software products, such as cloud solutions, software assurance, application suites, security, virtualization, collaboration and productivity applications, operating systems, and network management. In addition, the company offers advisory and design, software development, implementation, and managed services, as well as warranties. It serves business, government, education, and healthcare customers. The company was formerly known as CDW Computer Centers, Inc. and changed its name to CDW Corporation in June 2003. CDW Corporation was founded in 1984 and is based in Vernon Hills, Illinois.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:35:49"},{"Company Name":"Cincinnati Financial Corporatio","Symbol":"CINF","Current Price":"147.65","Latest MA":"143.27","Latest MA 5":148.338001709,"Latest MA 9":149.3811109755,"Latest MA 20":149.0720011902,"RSI":44.0819920439,"Price Target":152.83333,"Difference from MA":"3.06%","Difference from Open":"0.67%","Change from Yesterday":"0.45%","Change from Last Report":"0.08","Latest Volume":"101,670","Market Cap":"23,078,285,312","Earning Date":"28-04-2025","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":20.143246,"PB Ratio":1.6822951,"Previous Close":146.99,"ROE":0.10974,"DTE":6.4,"Industry":"Insurance - Property & Casualty","Sector":"Financial Services","Beta":0.786,"Trailing PEG":null,"Trailing PE":16.066376,"Trailing PS":16.066376,"Quick Ratio":0.863,"Day High":147.65,"Day Low":146.265,"VS Average Volume":0.1413907667,"Company Summary":"Cincinnati Financial Corporation provides property casualty insurance products in the United States. The company operates through five segments: Commercial Lines Insurance, Personal Lines Insurance, Excess and Surplus Lines Insurance, Life Insurance, and Investments. The Commercial Lines Insurance segment offers coverage for commercial casualty and property, commercial auto, and workers' compensation. This segment also provides contract and commercial surety bonds, and fidelity bonds; management liability; and machinery and equipment insurance products. The Personal Lines Insurance segment offers personal auto; homeowner; and other personal lines insurance, such as dwelling fire, inland marine, personal umbrella liability, and watercraft coverages. The Excess and Surplus Lines Insurance segment offers commercial casualty insurance that covers businesses for third-party liability from accidents occurring on their premises or arising out of their operations, such as injuries sustained from products, as well as other coverages comprising miscellaneous errors and omissions, professional liability, and excess liability; and commercial property insurance, which insures buildings, inventory, equipment, and business income from loss or damage due to various causes, such as fire, wind, hail, water, theft, and vandalism. The Life Insurance segment provides term life insurance; universal life insurance; and worksite and whole life insurance products, as well as annuities. The Investments segment invests in fixed-maturity investments, including taxable and tax-exempt bonds, and redeemable preferred stocks; and equity investments comprising common and nonredeemable preferred stocks. The company also offers commercial leasing and financing services; and insurance brokerage services. Cincinnati Financial Corporation was founded in 1950 and is headquartered in Fairfield, Ohio.","Stock Sentiment":"N\/A","Row Color":"positive-row","Last Updated":"12-06-2025 20:35:49"},{"Company Name":"Expedia Group, Inc.","Symbol":"EXPE","Current Price":"172.11","Latest MA":"174.83","Latest MA 5":174.5325006104,"Latest MA 9":172.4058342828,"Latest MA 20":167.6569906616,"RSI":56.698020647,"Price Target":188.45589,"Difference from MA":"-1.55%","Difference from Open":"0.03%","Change from Yesterday":"-0.70%","Change from Last Report":"0.13","Latest Volume":"426,636","Market Cap":"21,879,113,728","Earning Date":"08-05-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":11.985551,"PB Ratio":20.509115,"Previous Close":173.32,"ROE":0.52188,"DTE":278.63,"Industry":"Travel Services","Sector":"Consumer Cyclical","Beta":1.596,"Trailing PEG":0.7652,"Trailing PE":20.563023,"Trailing PS":20.563023,"Quick Ratio":0.573,"Day High":172.575,"Day Low":170.32,"VS Average Volume":0.1839444609,"Company Summary":"Expedia Group, Inc. operates as an online travel company in the United States and internationally. The company operates through B2C, B2B, and trivago segments. The B2C segment includes Brand Expedia, a full-service online travel brand offers various travel products and services; Hotels.com for lodging accommodations; Vrbo, an online marketplace for the alternative accommodations; Orbitz, Travelocity, Wotif Group, ebookers, CheapTickets, Hotwire.com and CarRentals.com. The B2B segment provides various travel and non-travel companies including airlines, offline travel agents, online retailers, corporate travel management, and financial institutions who leverage its travel technology and tap into its diverse supply to augment their offerings and market Expedia Group rates and availabilities to its travelers. The trivago segment send referrals to online travel companies and travel service providers from hotel metasearch websites. In addition, the company provides brand advertising through online and offline channels, loyalty programs, mobile apps, and search engine marketing, as well as metasearch, social media, direct and personalized traveler communications on its websites, and through direct e-mail communication with its travelers. The company was formerly known as Expedia, Inc. and changed its name to Expedia Group, Inc. in March 2018. Expedia Group, Inc. was founded in 1996 and is headquartered in Seattle, Washington.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:35:49"},{"Company Name":"NVR, Inc.","Symbol":"NVR","Current Price":"7365.45","Latest MA":"7774.69","Latest MA 5":7263.1699804687,"Latest MA 9":7203.726703559,"Latest MA 20":7180.5445458984,"RSI":62.466936146,"Price Target":7700.0,"Difference from MA":"-5.26%","Difference from Open":"0.97%","Change from Yesterday":"0.94%","Change from Last Report":"0.20","Latest Volume":"6,673","Market Cap":"21,535,324,160","Earning Date":"22-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":14.217644,"PB Ratio":5.484261,"Previous Close":7296.57,"ROE":0.38251,"DTE":26.986,"Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":0.995,"Trailing PEG":null,"Trailing PE":15.179609,"Trailing PS":15.179609,"Quick Ratio":2.644,"Day High":7369.24,"Day Low":7250.0,"VS Average Volume":0.3115312792,"Company Summary":"NVR, Inc. operates as a homebuilder in the United States. The company operates through, Homebuilding and Mortgage Banking segments. It engages in the construction and sale of single-family detached homes, townhomes, and condominium buildings under the Ryan Homes, NVHomes, and Heartland Homes names. The company markets its Ryan Homes products to first-time and first-time move-up buyers; and NVHomes and Heartland Homes products to move-up and luxury buyers. It also provides various mortgage related services to its homebuilding customers, as well as brokers title insurance; performs title searches; and sells mortgage loans to investors in the secondary markets on a servicing released basis. The company primarily serves in Maryland, Virginia, West Virginia, Delaware, New Jersey, Eastern Pennsylvania, New York, Ohio, Western Pennsylvania, Indiana, Illinois, North Carolina, Georgia, Kentucky, South Carolina, Florida, Tennessee, and Washington, D.C. NVR, Inc. was founded in 1948 and is headquartered in Reston, Virginia.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"12-06-2025 20:35:49"},{"Company Name":"Northern Trust Corporation","Symbol":"NTRS","Current Price":"109.01","Latest MA":"102.50","Latest MA 5":108.8020015259,"Latest MA 9":107.4377379693,"Latest MA 20":106.8305849915,"RSI":63.9273445393,"Price Target":105.89286,"Difference from MA":"6.35%","Difference from Open":"0.90%","Change from Yesterday":"0.53%","Change from Last Report":"0.09","Latest Volume":"391,622","Market Cap":"21,206,697,984","Earning Date":"23-07-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":14.268325,"PB Ratio":1.7681503,"Previous Close":108.44,"ROE":0.17681,"DTE":null,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.235,"Trailing PEG":67.606,"Trailing PE":10.178338,"Trailing PS":10.178338,"Quick Ratio":null,"Day High":109.01,"Day Low":107.18,"VS Average Volume":0.256767637,"Company Summary":"Northern Trust Corporation, a financial holding company, provides wealth management, asset servicing, asset management, and banking solutions for corporations, institutions, families, and individuals worldwide. It operates in two segments, Asset Servicing and Wealth Management. The Asset Servicing segment offers asset servicing and related services, including custody, fund administration, investment operations outsourcing, investment management, investment risk and analytical services, employee benefit services, securities lending, foreign exchange, treasury management, brokerage services, transition management services, banking, and cash management services. This segment serves corporate and public retirement funds, foundations, endowments, fund managers, insurance companies, sovereign wealth funds, and other institutional investors. The Wealth Management segment offers trust, investment management, custody, and philanthropic; financial consulting; guardianship and estate administration; family business consulting; family financial education; brokerage services; and private and business banking services. This segment serves high-net-worth individuals and families, business owners, executives, professionals, retirees, and established privately-held businesses. The company provides asset management services, such as active and passive equity; active and passive fixed income; cash management; muti-asset and alternative asset classes comprising private equity and hedge funds of funds; and multi-manager advisory services and products through separately managed accounts, bank common and collective funds, registered investment companies, exchange traded funds, non-U.S. collective investment funds, and unregistered private investment funds. In addition, it offers overlay and other risk management services. The company was founded in 1889 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"12-06-2025 20:35:49"},{"Company Name":"Western Digital Corporation","Symbol":"WDC","Current Price":"55.88","Latest MA":"47.18","Latest MA 5":55.9940000305,"Latest MA 9":55.0236594815,"Latest MA 20":52.6521777573,"RSI":71.9892601848,"Price Target":59.00286,"Difference from MA":"18.44%","Difference from Open":"1.09%","Change from Yesterday":"0.38%","Change from Last Report":"-0.02","Latest Volume":"1,327,990","Market Cap":"19,495,303,168","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":6.342792,"PB Ratio":3.767022,"Previous Close":55.67,"ROE":0.13558,"DTE":null,"Industry":"Computer Hardware","Sector":"Technology","Beta":1.543,"Trailing PEG":null,"Trailing PE":19.136986,"Trailing PS":19.136986,"Quick Ratio":0.954,"Day High":56.05,"Day Low":55.1321,"VS Average Volume":0.1720945988,"Company Summary":"Western Digital Corporation develops, manufactures, and sells data storage devices and solutions in the United States, China, Hong Kong, Europe, the Middle East, Africa, rest of Asia, and internationally. It offers client devices, including hard disk drives (HDDs) and solid state drives (SSDs) for desktop and notebook personal computers (PCs), gaming consoles, and set top boxes; and flash-based embedded storage products for mobile phones, tablets, notebook PCs, and other portable and wearable devices, as well as automotive, Internet of Things, industrial, and connected home applications. The company also provides enterprise HDDs; enterprise SSDs consisting of flash-based SSDs and software solutions for use in enterprise servers, online transactions, artificial intelligence-related workloads, data analysis, and other enterprise applications; and data storage platforms. In addition, it offers external HDD storage products in mobile and desktop form; client portable SSDs; removable cards that are used in consumer devices comprising mobile phones, tablets, imaging systems, and cameras and smart video systems; universal serial bus flash drives for use in the computing and consumer markets; and wireless drive products used in-field backup of created content, as well as wireless streaming of high-definition movies, photos, music, documents to tablets, smartphones, and PCs. The company sells its products under the Western Digital, SanDisk, and WD brands to original equipment manufacturers, distributors, dealers, resellers, and retailers. Western Digital Corporation was founded in 1970 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:35:49"},{"Company Name":"Halliburton Company","Symbol":"HAL","Current Price":"22.02","Latest MA":"24.90","Latest MA 5":21.4960001984,"Latest MA 9":20.838166292,"Latest MA 20":20.4299320946,"RSI":74.8104367391,"Price Target":28.93,"Difference from MA":"-11.56%","Difference from Open":"0.02%","Change from Yesterday":"-0.77%","Change from Last Report":"0.25","Latest Volume":"4,846,118","Market Cap":"18,930,925,568","Earning Date":"22-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":6.775385,"PB Ratio":1.8287518,"Previous Close":22.19,"ROE":0.21004,"DTE":82.371,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.141,"Trailing PEG":12.3539,"Trailing PE":9.213388,"Trailing PS":9.213388,"Quick Ratio":1.204,"Day High":22.03,"Day Low":21.675,"VS Average Volume":0.3253973061,"Company Summary":"Halliburton Company provides products and services to the energy industry worldwide. It operates in two segments, Completion and Production, and Drilling and Evaluation. The Completion and Production segment offers production enhancement services that include stimulation and sand control services; cementing services, such as well bonding and casing, and casing equipment; and completion tools that offer downhole solutions and services, including well completion products and services, intelligent well completions, liner hanger systems, sand control systems, multilateral systems, and service tools. This segment also provides electrical submersible pumps, as well as artificial lift services; production solutions comprising coiled tubing, hydraulic workover units, downhole tools, and pumping and nitrogen services; pipeline and process services, such as pre-commissioning, commissioning, maintenance, and decommissioning; and specialty chemicals and services. The Drilling and Evaluation segment offers drilling fluid systems, performance additives, completion fluids, solids control, specialized testing equipment, and waste management services; drilling systems and services; wireline and perforating services consists of open-hole logging, and cased-hole and slickline; and drill bits and services comprising roller cone rock bits, fixed cutter bits, hole enlargement, and related downhole tools and services, as well as coring equipment and services. This segment also provides cloud based digital services and artificial intelligence solutions on an open architecture for subsurface insights, integrated well construction, and reservoir and production management; testing and subsea services, such as acquisition and analysis of reservoir information and optimization solutions; and project management and integrated asset management services. Halliburton Company was founded in 1919 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:35:49"},{"Company Name":"NiSource Inc","Symbol":"NI","Current Price":"39.61","Latest MA":"37.92","Latest MA 5":39.4579992981,"Latest MA 9":39.3755556064,"Latest MA 20":39.2254998856,"RSI":59.1268321865,"Price Target":43.225,"Difference from MA":"4.47%","Difference from Open":"0.38%","Change from Yesterday":"0.38%","Change from Last Report":"0.08","Latest Volume":"1,046,493","Market Cap":"18,644,545,536","Earning Date":"07-05-2025","Earning Time":"Before","Earning Day of Week":"Saturday","PE Ratio":21.295698,"PB Ratio":2.0953238,"Previous Close":39.46,"ROE":0.09364,"DTE":136.355,"Industry":"Utilities - Regulated Gas","Sector":"Utilities","Beta":0.549,"Trailing PEG":2.4255,"Trailing PE":21.41081,"Trailing PS":21.41081,"Quick Ratio":0.338,"Day High":39.695,"Day Low":39.29,"VS Average Volume":0.2203363494,"Company Summary":"NiSource Inc., an energy holding company, operates as a regulated natural gas and electric utility company in the United States. It operates in two segments, Columbia Operations and NIPSCO Operations. The company provides natural gas to approximately 2.4 million residential, commercial, and industrial customers through approximately 37,200 miles of distribution main pipeline and the associated individual customer service lines; and 330 miles of transmission main pipeline in Ohio, Pennsylvania, Virginia, Kentucky, and Maryland. It also generates, transmits, and distributes electricity to approximately 0.5 million customers in various counties in the northern part of Indiana, as well as engages in wholesale electric and transmission transactions. It owns and operates steam coal generating stations in Wheatfield and Michigan City; combined cycle gas turbine in West Terre Haute; natural gas generating units in Wheatfield; hydro generating plants in Carroll County and White County; wind generating units in White County, Indiana; and solar generating units in Jasper County and White County. The company was formerly known as NIPSCO Industries, Inc. and changed its name to NiSource Inc. in April 1999. NiSource Inc. was founded in 1847 and is headquartered in Merrillville, Indiana.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:35:49"},{"Company Name":"Best Buy Co., Inc.","Symbol":"BBY","Current Price":"72.48","Latest MA":"78.21","Latest MA 5":73.1620003662,"Latest MA 9":71.5611102295,"Latest MA 20":71.0304994812,"RSI":55.9648564307,"Price Target":79.27773,"Difference from MA":"-7.33%","Difference from Open":"0.19%","Change from Yesterday":"-0.23%","Change from Last Report":"0.24","Latest Volume":"1,058,120","Market Cap":"15,318,431,744","Earning Date":"29-05-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.596492,"PB Ratio":5.5429797,"Previous Close":72.65,"ROE":0.30214,"DTE":146.906,"Industry":"Specialty Retail","Sector":"Consumer Cyclical","Beta":1.27,"Trailing PEG":1.7566,"Trailing PE":17.67805,"Trailing PS":17.67805,"Quick Ratio":0.281,"Day High":72.495,"Day Low":71.8205,"VS Average Volume":0.247867074,"Company Summary":"Best Buy Co., Inc. offers technology products and solutions in the United States, Canada, and internationally. It provides computing and mobile phone products, such as desktops, notebooks, and peripherals; mobile phones comprising related mobile network carrier commissions; networking products; tablets covering e-readers; smartwatches; and consumer electronics consisting of digital imaging, health and fitness products, portable audio comprising headphones and portable speakers, and smart home products, as well as home theaters that includes home theater accessories, soundbars, and televisions. The company's stores also offer appliances, such as dishwashers, laundry, ovens, refrigerators, blenders, coffee makers, vacuums, and personal care; entertainment products consisting of drones, peripherals, movies, and toys, as well as hardware and software, and virtual reality and other software products; and other products, such as baby, food and beverage, luggage, and outdoor living products. In addition, it provides delivery, installation, memberships, repair, set-up, technical support, health-related, and warranty-related services. The company offers its products through stores and websites under the Best Buy, Best Buy Ads, Best Buy Business, Best Buy Essentials, Best Buy Health, Current Health, Geek Squad, Imagine That, Insignia, Lively, My Best Buy, My Best Buy Memberships, Pacific Kitchen, Home, TechLiquidators, and Yardbird brand names, as well as domain names comprising bestbuy.com, currenthealth.com, lively.com, techliquidators.com, yardbird.com, bestbuy.ca, and techliquidators.ca. The company was formerly known as Sound of Music, Inc. Best Buy Co., Inc. was incorporated in 1966 and is headquartered in Richfield, Minnesota.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:35:49"},{"Company Name":"Solventum Corporation","Symbol":"SOLV","Current Price":"73.97","Latest MA":"71.70","Latest MA 5":74.7380002441,"Latest MA 9":74.6200009155,"Latest MA 20":73.809500061,"RSI":50.2178544869,"Price Target":82.165,"Difference from MA":"3.17%","Difference from Open":"-0.31%","Change from Yesterday":"-0.59%","Change from Last Report":"-0.01","Latest Volume":"185,908","Market Cap":"12,797,770,752","Earning Date":"08-05-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":13.37613,"PB Ratio":3.9230974,"Previous Close":74.41,"ROE":0.10657,"DTE":242.581,"Industry":"Medical Instruments & Supplies","Sector":"Healthcare","Beta":null,"Trailing PEG":null,"Trailing PE":34.08756,"Trailing PS":34.08756,"Quick Ratio":0.641,"Day High":74.23,"Day Low":73.63,"VS Average Volume":0.1510102795,"Company Summary":"Solventum Corporation, a healthcare company, develops, manufactures, and commercializes a portfolio of solutions to address critical customer and patient needs in the United States and internationally. It operates in four segments: Medsurg, Dental Solutions, Health Information Systems, and Purification and Filtration. The Medsurg segment offers solutions for negative pressure wound therapy, advanced wound dressings, advanced skin care, I.V. site management, sterilization assurance, temperature management, surgical supplies, medical tapes and wrap, stethoscopes, medical electrodes, and medical technologies for original equipment manufacturers. Its Dental Solutions segment provides a suite of dental and orthodontic products, including brackets, aligners, restorative cements, and bonding agents. The Health Information Systems provides software solutions and services for health care systems, such as computer-assisted, physician documentation, direct-to-bill and coding automation, classification methodologies, speech recognition, and data visualization platforms. Its Purification and Filtration segment provides purification and filtration technologies comprising filters, purifiers, cartridges, and membranes. The company sells its products and services through direct-to-consumer, distribution, key account management, inside sales, and e-commerce. Solventum Corporation was incorporated in 2023 and is based in Maplewood, Minnesota.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"12-06-2025 20:35:49"},{"Company Name":"Alexandria Real Estate Equities","Symbol":"ARE","Current Price":"73.00","Latest MA":"90.69","Latest MA 5":72.3610006104,"Latest MA 9":71.3138897027,"Latest MA 20":70.9472505035,"RSI":62.2246233416,"Price Target":97.30769,"Difference from MA":"-19.50%","Difference from Open":"-0.23%","Change from Yesterday":"-0.25%","Change from Last Report":"0.15","Latest Volume":"427,417","Market Cap":"12,629,060,608","Earning Date":"21-07-2025","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":21.222383,"PB Ratio":0.71116847,"Previous Close":73.19,"ROE":0.01476,"DTE":61.193,"Industry":"REIT - Office","Sector":"Real Estate","Beta":1.267,"Trailing PEG":null,"Trailing PE":96.05921,"Trailing PS":96.05921,"Quick Ratio":2.868,"Day High":73.2904,"Day Low":72.28,"VS Average Volume":0.2446439753,"Company Summary":"Alexandria Real Estate Equities, Inc. (NYSE: ARE), an S&P 500 company, is a best-in-class, mission-driven life science REIT making a positive and lasting impact on the world. With our founding in 1994, Alexandria pioneered the life science real estate niche. Alexandria is the preeminent and longest-tenured owner, operator, and developer of collaborative Megacampus ecosystems in AAA life science innovation cluster locations, including Greater Boston, the San Francisco Bay Area, San Diego, Seattle, Maryland, Research Triangle, and New York City. As of March 31, 2025, Alexandria has a total market capitalization of $28.8 billion and an asset base in North America that includes 39.6 million RSF of operating properties and 4.0 million RSF of Class A\/A+ properties undergoing construction. Alexandria has a longstanding and proven track record of developing Class A\/A+ properties clustered in highly dynamic and collaborative Megacampus environments that enhance our tenants' ability to successfully recruit and retain world-class talent and inspire productivity, efficiency, creativity, and success. Alexandria also provides strategic capital to transformative life science companies through our venture capital platform. We believe our unique business model and diligent underwriting ensure a high-quality and diverse tenant base that results in higher occupancy levels, longer lease terms, higher rental income, higher returns, and greater long-term asset value.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:35:49"},{"Company Name":"Healthpeak Properties, Inc.","Symbol":"DOC","Current Price":"17.46","Latest MA":"19.37","Latest MA 5":17.4210002594,"Latest MA 9":17.3161112298,"Latest MA 20":17.3036706848,"RSI":56.328931013,"Price Target":22.97059,"Difference from MA":"-9.82%","Difference from Open":"-0.20%","Change from Yesterday":"-0.26%","Change from Last Report":"0.29","Latest Volume":"1,802,191","Market Cap":"12,133,494,784","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":69.86,"PB Ratio":1.4901876,"Previous Close":17.51,"ROE":0.0332,"DTE":103.846,"Industry":"REIT - Healthcare Facilities","Sector":"Real Estate","Beta":1.013,"Trailing PEG":4.3819,"Trailing PE":42.59756,"Trailing PS":42.59756,"Quick Ratio":0.661,"Day High":17.55,"Day Low":17.365,"VS Average Volume":0.2951770367,"Company Summary":"Healthpeak Properties, Inc. is a fully integrated real estate investment trust (REIT) and S&P 500 company. Healthpeak owns, operates, and develops high-quality real estate focused on healthcare discovery and delivery.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:35:49"},{"Company Name":"Franklin Resources, Inc.","Symbol":"BEN","Current Price":"22.68","Latest MA":"20.15","Latest MA 5":22.1660003052,"Latest MA 9":21.846666726,"Latest MA 20":21.879499897,"RSI":76.6037846292,"Price Target":20.18182,"Difference from MA":"12.54%","Difference from Open":"1.11%","Change from Yesterday":"0.62%","Change from Last Report":"0.02","Latest Volume":"1,612,179","Market Cap":"11,918,816,256","Earning Date":"02-05-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.723078,"PB Ratio":0.96518856,"Previous Close":22.54,"ROE":0.02799,"DTE":24.117,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.458,"Trailing PEG":0.4589,"Trailing PE":32.869564,"Trailing PS":32.869564,"Quick Ratio":1.642,"Day High":22.695,"Day Low":22.265,"VS Average Volume":0.3133497843,"Company Summary":"Franklin Resources, Inc. is a publicly owned asset management holding company. Through its subsidiaries, the firm provides its services to individuals, institutions, pension plans, trusts, and partnerships. It launches equity, fixed income, balanced, and multi-asset mutual funds through its subsidiaries. The firm invests in the public equity, fixed income, and alternative markets. Franklin Resources, Inc. was founded in 1947 and is based in San Mateo, California with an additional office in Calgary, Canada; Dubai, United Arab Emirates; Edinburgh, United Kingdom; Fort Lauderdale, United States; Hyderabad, India; London, United Kingdom; Rancho Cordova, United states; Shanghai, China; Singapore; Stamford, United States; and Vienna, Austria.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"12-06-2025 20:35:49"},{"Company Name":"Revvity, Inc.","Symbol":"RVTY","Current Price":"95.55","Latest MA":"107.96","Latest MA 5":94.5429996338,"Latest MA 9":92.8849997965,"Latest MA 20":92.1522507629,"RSI":62.8680755554,"Price Target":124.83,"Difference from MA":"-11.50%","Difference from Open":"0.09%","Change from Yesterday":"-0.55%","Change from Last Report":"-0.03","Latest Volume":"227,294","Market Cap":"11,261,888,512","Earning Date":"28-04-2025","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":18.516474,"PB Ratio":1.493871,"Previous Close":96.07,"ROE":0.03824,"DTE":43.542,"Industry":"Diagnostics & Research","Sector":"Healthcare","Beta":0.972,"Trailing PEG":0.7179,"Trailing PE":39.481403,"Trailing PS":39.481403,"Quick Ratio":2.708,"Day High":96.06,"Day Low":94.56,"VS Average Volume":0.1770754129,"Company Summary":"Revvity, Inc. provides health sciences solutions, technologies, and services worldwide. The company's Life Sciences segment provides instruments, reagents, informatics, software, subscriptions, detection, imaging technologies, warranties, training, and DNA sequencing services. Its Diagnostics segment offers instruments, reagents, assay platforms, and software products for the early detection of genetic disorders, such as pregnancy and early childhood, as well as infectious disease testing in the diagnostics market. Its products are used for testing and screening genetic abnormalities, disorders, and diseases, including down syndrome, hypothyroidism, muscular dystrophy, infertility, and various metabolic conditions. It also develops technologies that enable and support genomic workflows using protein coupled receptor and next-generation DNA sequencing for use in oncology, screening newborns for rare genetic conditions, immunodiagnostics, and drug discovery. It serves pharmaceutical and biotechnology companies, laboratories, academic and research institutions, public health authorities, private healthcare organizations, doctors, and government agencies under the AutoDELFIA, BACS-on-Beads, BIOCHIPs, Bioo Scientific, BioQule, BoBs, chemagic, Chitas, DELFIA, DELFIA Xpress, DOPlify, EONIS, EUROArray, EUROIMMUN, EUROLabWorkstation, EUROLINE, EUROPatternTM, Evolution Evoya, explorer, Fontus, GSP, Haoyuan, IDS Immunodiagnosticsystems, IDS-i10, IDS-i10T, IDS-iSYS, iLab, iQ, JANUS, LabChip, LifeCycle, LimsLink, Migele, MultiPROBE, NEXTFLEX, NextPrep, Omni Bead Ruptor, Omni Bead Ruptor Elite, Omni Tip, Pannoramic, Panthera Puncher, PG-Seq, PG-Find, PreNAT II, Prime, Protein Clear, ProteinEXact, QuantiVac, RONIA, Sciclone, SimplicityChrom, Specimen Gate, Superflex, Symbio, T-SPOT, Touch, Twister, Vanadis, VariSpec, ViaCord, VICTOR2D, and Zephyr brands. The company was formerly known as PerkinElmer, Inc. and changed its name to Revvity, Inc. in April 2023. Revvity, Inc. was founded in 1937 and is headquartered in Waltham, Massachusetts.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:35:49"},{"Company Name":"Skyworks Solutions, Inc.","Symbol":"SWKS","Current Price":"72.14","Latest MA":"74.32","Latest MA 5":72.93399823,"Latest MA 9":71.8488871935,"Latest MA 20":71.207838089,"RSI":54.417083328,"Price Target":69.50789,"Difference from MA":"-2.94%","Difference from Open":"-0.37%","Change from Yesterday":"-0.93%","Change from Last Report":"-0.50","Latest Volume":"703,013","Market Cap":"10,830,305,280","Earning Date":"07-05-2025","Earning Time":"Before","Earning Day of Week":"Saturday","PE Ratio":11.271874,"PB Ratio":1.8653358,"Previous Close":72.82,"ROE":0.06701,"DTE":20.363,"Industry":"Semiconductors","Sector":"Technology","Beta":1.155,"Trailing PEG":2.0804,"Trailing PE":28.179688,"Trailing PS":28.179688,"Quick Ratio":3.063,"Day High":72.985,"Day Low":71.93,"VS Average Volume":0.1725468549,"Company Summary":"Skyworks Solutions, Inc., together with its subsidiaries, designs, develops, manufactures, and markets proprietary semiconductor products in the United States, China, South Korea, Taiwan, Europe, the Middle East, Africa, and the rest of Asia-Pacific. Its product portfolio includes amplifiers, antenna tuners, attenuators, automotive tuners and digital radios, DC\/DC converters, demodulators, detectors, digital power isolators, diodes, directional couplers, diversity receive modules, filters, front-end modules, hybrids, light emitting diode drivers, low noise amplifiers, mixers, modulators, optocouplers\/optoisolators, phase locked loops, phase shifters, power dividers\/combiners, power over ethernet, power isolators, interface circuits, receivers, switches, synthesizers, timing devices, voltage controlled oscillators\/synthesizers, and voltage regulators. The company products are the used in aerospace, automotive, broadband, cellular infrastructure, connected home, defense, entertainment and gaming, industrial, medical, smartphone, tablet, and wearable markets. It sells its products through direct sales force, electronic component distributors, and independent sales representatives. Skyworks Solutions, Inc. was founded in 1962 and is based in Irvine, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:35:49"},{"Company Name":"CarMax Inc","Symbol":"KMX","Current Price":"66.71","Latest MA":"76.29","Latest MA 5":67.1879991455,"Latest MA 9":66.4111108738,"Latest MA 20":65.4879999619,"RSI":54.4256151592,"Price Target":84.13188,"Difference from MA":"-12.56%","Difference from Open":"-0.33%","Change from Yesterday":"-1.65%","Change from Last Report":"-0.13","Latest Volume":"1,220,247","Market Cap":"10,162,268,160","Earning Date":"20-06-2025","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":17.69496,"PB Ratio":1.6383015,"Previous Close":67.83,"ROE":0.08128,"DTE":311.168,"Industry":"Auto & Truck Dealerships","Sector":"Consumer Cyclical","Beta":1.382,"Trailing PEG":0.8459,"Trailing PE":20.78193,"Trailing PS":20.78193,"Quick Ratio":0.198,"Day High":67.18,"Day Low":65.78,"VS Average Volume":0.3439273457,"Company Summary":"CarMax, Inc., through its subsidiaries, operates as a retailer of used vehicles and related products in the United States. The company operates in two segments: CarMax Sales Operations and CarMax Auto Finance. The CarMax Sales Operations segment offers customers a range of makes and models of used vehicles, including domestic, imported, and luxury vehicles, as well as hybrid and electric vehicles; used vehicle auctions; extended protection plans to customers at the time of sale; and reconditioning and vehicle repair services. The CarMax Auto Finance segment provides financing alternatives for retail customers across a range of credit spectrum and arrangements with various financial institutions. The company was founded in 1993 and is based in Richmond, Virginia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:35:49"},{"Company Name":"Lamb Weston Holdings, Inc.","Symbol":"LW","Current Price":"56.01","Latest MA":"59.93","Latest MA 5":55.752,"Latest MA 9":55.5255556912,"Latest MA 20":54.1195000534,"RSI":68.964337917,"Price Target":65.22214,"Difference from MA":"-6.54%","Difference from Open":"1.63%","Change from Yesterday":"0.43%","Change from Last Report":"0.09","Latest Volume":"325,970","Market Cap":"7,903,906,816","Earning Date":"03-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":11.246987,"PB Ratio":4.8384585,"Previous Close":55.77,"ROE":0.2164,"DTE":261.312,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.474,"Trailing PEG":2.176,"Trailing PE":21.964706,"Trailing PS":21.964706,"Quick Ratio":0.484,"Day High":56.049,"Day Low":54.64,"VS Average Volume":0.1514660099,"Company Summary":"Lamb Weston Holdings, Inc. engages in the production, distribution, and marketing of frozen potato products in the United States, Canada, Mexico, and internationally. It offers frozen potatoes, commercial ingredients, and appetizers under the Lamb Weston brand, as well as under various customer labels. The company also provides its products under its owned or licensed brands, such as Grown in Idaho and Alexia, and other licensed brands, as well as under retailers' own brands. It sells its products through a network of internal sales personnel and independent brokers, agents, and distributors to quick service and full-service restaurants and chains, wholesale, grocery, mass merchants, club retailers, and specialty retailers, as well as foodservice distributors and institutions, including businesses, educational institutions, independent restaurants, regional chain restaurants, and convenience stores. The company was incorporated in 1950 and is headquartered in Eagle, Idaho.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:35:49"},{"Company Name":"Match Group, Inc.","Symbol":"MTCH","Current Price":"30.91","Latest MA":"31.40","Latest MA 5":31.5840004272,"Latest MA 9":31.2472224935,"Latest MA 20":30.3890002327,"RSI":50.5322979908,"Price Target":33.9055,"Difference from MA":"-1.56%","Difference from Open":"-0.55%","Change from Yesterday":"-2.00%","Change from Last Report":"0.10","Latest Volume":"1,318,819","Market Cap":"7,579,904,512","Earning Date":"08-05-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":12.46371,"PB Ratio":-42.05442,"Previous Close":31.54,"ROE":null,"DTE":null,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.364,"Trailing PEG":0.4103,"Trailing PE":15.30198,"Trailing PS":15.30198,"Quick Ratio":1.439,"Day High":31.47,"Day Low":30.795,"VS Average Volume":0.2724369389,"Company Summary":"Match Group, Inc. engages in the provision of digital technologies. It operates through four segments: Tinder, Hinge, Evergreen and Emerging, and Match Group Asia. The company's portfolio of brands includes Tinder, Hinge, Match, Meetic, OkCupid, Pairs, Plenty Of Fish, Azar, BLK, and other brands, built to increase users' likelihood of connecting with others. Its services are available in over 40 languages to users worldwide. The company was incorporated in 1986 and is based in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:35:49"}]