[{"Company Name":"EOG Resources, Inc.","Symbol":"EOG","Current Price":"125.77","Latest MA":"129.83","Latest MA 5":130.2340018311,"Latest MA 9":131.7100011529,"Latest MA 20":129.8299997101,"Price Target":146.35612,"Difference from MA":"-3.13%","Difference from Open":"-1.82%","Change from Yesterday":"-3.71%","Change from Last Report":"0.16","Latest Volume":"3,533,179","Market Cap":"70,739,329,024","Earning Date":"2025-02-27","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":11.371609,"PB Ratio":2.3876603,"Previous Close":130.61,"ROE":0.22294001,"DTE":17.263,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":"N\/A","Trailing PEG":66.4544,"Trailing PE":11.179555,"Trailing PS":2.9850338,"Quick Ratio":1.82,"Day High":128.82,"Day Low":124.36,"VS Average Volume":1.1857984587,"Company Summary":"EOG Resources, Inc., together with its subsidiaries, explores for, develops, produces, and markets crude oil, natural gas liquids, and natural gas primarily in producing basins in the United States, the Republic of Trinidad and Tobago and internationally. The company was formerly known as Enron Oil & Gas Company. EOG Resources, Inc. was incorporated in 1985 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"Monster Beverage Corporation","Symbol":"MNST","Current Price":"54.38","Latest MA":"49.71","Latest MA 5":52.5280004272,"Latest MA 9":52.1766665649,"Latest MA 20":49.7124999466,"Price Target":55.88375,"Difference from MA":"9.39%","Difference from Open":"-1.13%","Change from Yesterday":"4.74%","Change from Last Report":"0.01","Latest Volume":"8,045,822","Market Cap":"52,885,639,168","Earning Date":"2025-02-27","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":29.080214,"PB Ratio":8.881268,"Previous Close":51.92,"ROE":0.21274,"DTE":6.277,"Industry":"Beverages - Non-Alcoholic","Sector":"Consumer Defensive","Beta":"N\/A","Trailing PEG":1.6419,"Trailing PE":33.5679,"Trailing PS":7.0582805,"Quick Ratio":2.51,"Day High":56.395,"Day Low":54.07,"VS Average Volume":1.3944026821,"Company Summary":"Monster Beverage Corporation, through its subsidiaries, engages in development, marketing, sale, and distribution of energy drink beverages and concentrates in the United States and internationally. The company operates through three segments: Monster Energy Drinks, Strategic Brands, Alcohol Brands, and Other. It offers carbonated non-carbonated energy drinks, ready-to-drink iced teas, lemonades, juice cocktails, single-serve juices and fruit beverages, ready-to-drink dairy and coffee drinks, energy drinks, sports drinks and single-serve still waters, and sodas that are considered natural, sparkling juices, and flavored sparkling beverages. The company sells its products to full service beverage bottlers\/distributors, retail grocery and specialty chains, wholesalers, club stores, mass merchandisers, convenience chains, food service customers, value stores, e-commerce retailers, and the military; and concentrates and\/or beverage bases to authorized bottling and canning operations. It provides its products under the Monster Energy, Monster Energy Ultra, Monster Rehab, Monster Energy Nitro, Java Monster, Punch Monster, Juice Monster, Muscle Monster, Espresso Monster, Monster Tour Water, Fury, Monster MAXX, Caffe Monster, Monster Hydro, Monster HydroSport Super Fuel, Monster Dragon Tea, Reign Total Body Fuel, and Reign Inferno Thermogenic Fuel, Reign Storm, Bang Energy, NOS, Full Throttle, Burn, Mother, Nalu, Ultra Energy, Play and Power Play (stylized), Relentless, BPM, BU, Gladiator, Samurai, Live+, Predator, and Fury brands. The company was formerly known as Hansen Natural Corporation and changed its name to Monster Beverage Corporation in January 2012. Monster Beverage Corporation was founded in 1985 and is headquartered in Corona, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"DENTSPLY SIRONA Inc.","Symbol":"XRAY","Current Price":"16.42","Latest MA":"18.68","Latest MA 5":18.0499996033,"Latest MA 9":18.4188887193,"Latest MA 20":18.6815000496,"Price Target":20.93333,"Difference from MA":"-12.11%","Difference from Open":"-5.20%","Change from Yesterday":"-4.26%","Change from Last Report":"0.09","Latest Volume":"2,457,677","Market Cap":"3,263,967,488","Earning Date":"2025-02-27","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":8.21,"PB Ratio":1.310455,"Previous Close":17.15,"ROE":-0.13991,"DTE":93.815,"Industry":"Medical Instruments & Supplies","Sector":"Healthcare","Beta":0.973,"Trailing PEG":0.8795,"Trailing PE":"N\/A","Trailing PS":0.8369147,"Quick Ratio":0.627,"Day High":17.34,"Day Low":16.21,"VS Average Volume":0.947663075,"Company Summary":"DENTSPLY SIRONA Inc. manufactures and sells various dental products and technologies worldwide. It operates in four segments: Connected Technology Solutions, Essential Dental Solutions, Orthodontic and Implant Solutions, and Wellspect Healthcare. The company offers dental equipment comprising imaging equipment, motorized dental handpieces, treatment centers, other instruments, amalgamators, mixing machines, and porcelain furnaces; and dental CAD\/CAM technologies to support dental restorations, such as intraoral scanners, 3-D printers, mills, other software and services, and a full-chairside economical restoration of esthetic ceramic dentistry, as well as DS Core, its cloud-based platform. It also provides endodontic products consisting of motorized endodontic handpieces, files, sealers, irrigation needles, and other tools that support root canal procedures; restorative products, including dental ceramics, crowns, and veneers; and preventative products, such as curing light systems, dental diagnostic systems, and ultrasonic scalers and polishers, as well as dental anesthetics, prophylaxis paste, dental sealants, and impression materials. In addition, the company offers SureSmile and Byte aligner solutions; VPro\/HyperByte, a high-frequency vibration technology device; SureSmile Simulator, which creates a 3D visualization of a patient's outcome; and Byte Plus for treatment planning. Further, it provides dental implants, digital dentures, crown and bridge porcelain products, bone regenerative and restorative solutions, treatment planning software, and educational programs; dental prosthetics; urology catheters; and other health-related consumables. The company serves professional dental and consumable medical device markets through third-party distributors. The company was formerly known as DENTSPLY International Inc. and changed its name to DENTSPLY SIRONA Inc. in February 2016. DENTSPLY SIRONA Inc. was founded in 1877 and is headquartered in Charlotte, North Carolina","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"Warner Bros. Discovery, Inc. - ","Symbol":"WBD","Current Price":"11.39","Latest MA":"10.47","Latest MA 5":10.9339799466,"Latest MA 9":10.8888777396,"Latest MA 20":10.4704949275,"Price Target":13.2632,"Difference from MA":"8.78%","Difference from Open":"3.64%","Change from Yesterday":"3.50%","Change from Last Report":"-0.07","Latest Volume":"53,255,838","Market Cap":"27,947,442,176","Earning Date":"2025-02-27","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":-87.57693,"PB Ratio":0.82083637,"Previous Close":11.0,"ROE":-0.28208,"DTE":114.397,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.497,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.7110569,"Quick Ratio":0.649,"Day High":11.64,"Day Low":10.77,"VS Average Volume":1.7952856416,"Company Summary":"Warner Bros. Discovery, Inc. operates as a media and entertainment company worldwide. It operates through three segments: Studios, Network, and DTC. The Studios segment produces and releases feature films for initial exhibition in theaters; produces and licenses television programs to its networks and third parties and direct-to-consumer services; distributes films and television programs to various third parties and internal television; and offers streaming services and distribution through the home entertainment market, themed experience licensing, and interactive gaming. The Network segment comprises domestic and international television networks. The DTC segment offers premium pay-tv and streaming services. In addition, the company offers portfolio of content, brands, and franchises across television, film, streaming, and gaming under the Warner Bros. Motion Picture Group, Warner Bros. Television Group, DC, HBO, HBO Max, Max, Discovery Channel, discovery+, CNN, HGTV, Food Network, TNT Sports, TBS, TLC, OWN, Warner Bros. Games, Batman, Superman, Wonder Woman, Harry Potter, Looney Tunes, Hanna-Barbera, Game of Thrones, and The Lord of the Rings brands. Further, it provides content through distribution platforms, including linear network, free-to-air, and broadcast television; authenticated GO applications, digital distribution arrangements, content licensing arrangements, and direct-to-consumer subscription products. Warner Bros. Discovery, Inc. was incorporated in 2008 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"Autodesk, Inc.","Symbol":"ADSK","Current Price":"269.43","Latest MA":"296.50","Latest MA 5":281.2850061035,"Latest MA 9":286.3516689724,"Latest MA 20":296.4992514038,"Price Target":337.57867,"Difference from MA":"-9.13%","Difference from Open":"-3.58%","Change from Yesterday":"-4.58%","Change from Last Report":"0.05","Latest Volume":"3,058,455","Market Cap":"58,063,507,456","Earning Date":"2025-02-27","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":29.349127,"PB Ratio":21.997467,"Previous Close":282.35,"ROE":0.49687,"DTE":97.634,"Industry":"Software - Application","Sector":"Technology","Beta":"N\/A","Trailing PEG":1.7143,"Trailing PE":52.725044,"Trailing PS":9.470479,"Quick Ratio":0.562,"Day High":285.0,"Day Low":267.23,"VS Average Volume":2.139743353,"Company Summary":"Autodesk, Inc. provides 3D design, engineering, and entertainment technology solutions worldwide. The company offers AutoCAD Civil 3D, a surveying, design, analysis, and documentation solution for land development, transportation, and environmental projects; Autodesk Build, provides a toolset for managing, sharing, and accessing project documents for streamlined workflows between the office, trailer, and jobsite; Revit, a software built for Building Information Modeling to help professionals design, build, and maintain higher-quality, more energy-efficient buildings; Autodesk BIM Collaborate Pro, cloud-based design collaboration and design management software; and BuildingConnected, a SaaS preconstruction solution. It also provides AutoCAD software, a customizable and extensible CAD application for professional design, drafting, detailing, and visualization; AutoCAD LT, a drafting and detailing software; Fusion, a 3D CAD, computer-aided manufacturing, and computer-aided engineering tool; Inventor, a software solution, that offers a set of tools for 3D mechanical design, simulation, analysis, tooling, visualization, and documentation; and Vault, a data management software, for managing data in one central location, accelerate design processes, and streamline internal\/external collaboration. In addition, the company offers Flow Production Tracking, cloud-based software for review and production tracking; Maya software, which provides 3D modeling, animation, effects, rendering, and compositing solutions for film and video artists, game developers, and design visualization professionals; Media and Entertainment Collection, that provides end-to-end creative tools for entertainment creation; and 3ds Max software provides 3D modeling, animation, and rendering solutions. It sells its products and services to customers directly, as well as through a network of resellers and distributors. The company was incorporated in 1982 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"MasTec, Inc.","Symbol":"MTZ","Current Price":"132.54","Latest MA":"136.30","Latest MA 5":129.1520002441,"Latest MA 9":130.660001865,"Latest MA 20":136.3040008087,"Price Target":162.53847,"Difference from MA":"-2.76%","Difference from Open":"6.36%","Change from Yesterday":"4.61%","Change from Last Report":"0.11","Latest Volume":"2,054,316","Market Cap":"10,501,806,080","Earning Date":"2025-02-27","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":24.453873,"PB Ratio":3.468816,"Previous Close":126.83,"ROE":0.06987,"DTE":76.969,"Industry":"Engineering & Construction","Sector":"Industrials","Beta":"N\/A","Trailing PEG":null,"Trailing PE":117.29203,"Trailing PS":0.853565,"Quick Ratio":"N\/A","Day High":133.39,"Day Low":124.0,"VS Average Volume":2.1861984197,"Company Summary":"MasTec, Inc., an infrastructure construction company, provides engineering, building, installation, maintenance, and upgrade services for communications, energy, utility, and other infrastructure primarily in the United States and Canada. It operates through five segments: Communications, Clean Energy and Infrastructure, Oil and Gas, Power Delivery, and Other. The company build infrastructure for wireless and wireline\/fiber communications; clean energy infrastructure comprising renewable energy power generation; pipeline infrastructure, including natural gas, water, carbon capture sequestration, and other product transport; power delivery services, such as electrical and gas transmission, and distribution systems; industrial and heavy civil infrastructure, including roads, bridges, and rail; and water infrastructure. It also installs electrical and other gas distribution and transmission systems, power generation, power generation, civil and industrial facilities, pipelines, and fiber optic and other cables, as well as install-to-the-home services. In addition, the company offers maintenance and upgrade support services comprising maintenance of customers' distribution facilities, networks, and infrastructure, including communications, power generation, pipeline, electrical distribution and transmission, and civil and industrial and heavy civil infrastructure; service restoration for natural disasters and accidents; and routine replacements and upgrades to overhauls. Its customers include wireless and wireline\/fiber service providers, broadband operators, install-to-the-home service providers, public and private energy providers, including renewable and other energy providers, pipeline operators, civil and industrial infrastructure providers, and government entities. MasTec, Inc. was founded in 1929 and is headquartered in Coral Gables, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"Dell Technologies Inc.","Symbol":"DELL","Current Price":"101.64","Latest MA":"110.61","Latest MA 5":109.9810008545,"Latest MA 9":114.2994441732,"Latest MA 20":110.6052492981,"Price Target":142.26826,"Difference from MA":"-8.11%","Difference from Open":"0.67%","Change from Yesterday":"-5.72%","Change from Last Report":"0.10","Latest Volume":"16,018,962","Market Cap":"70,911,254,528","Earning Date":"2025-02-27","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":10.812235,"PB Ratio":-48.145428,"Previous Close":107.83,"ROE":"N\/A","DTE":"N\/A","Industry":"Computer Hardware","Sector":"Technology","Beta":"N\/A","Trailing PEG":0.5635,"Trailing PE":15.930251,"Trailing PS":0.74200565,"Quick Ratio":0.413,"Day High":103.9,"Day Low":99.01,"VS Average Volume":2.0011492988,"Company Summary":"Dell Technologies Inc. designs, develops, manufactures, markets, sells, and supports various comprehensive and integrated solutions, products, and services in the Americas, Europe, the Middle East, Asia, and internationally. The company operates through two segments, Infrastructure Solutions Group (ISG) and Client Solutions Group (CSG). The ISG segment provides modern and traditional storage solutions, including all-flash arrays, scale-out file, object platforms, hyper-converged infrastructure, and software-defined storage; and general-purpose and AI-optimized servers. This segment also offers networking products and services comprising wide area network infrastructure, data center and edge networking switches, and cables and optics that help its business customers to transform and modernize their infrastructure, mobilize and enrich end-user experiences, and accelerate business applications and processes; software and peripherals; and consulting, support, and deployment services. The CSG segment provides desktops, workstations, and notebooks; displays, docking stations, keyboards, mice, webcam, and audio devices; and third-party software and peripherals, as well as configuration, support and deployment, and extended warranty services. It is involved in cybersecurity technology-driven security solutions to prevent security breaches, detect malicious activity, respond rapidly when a security breach occurs, and identify emerging threats; originating, collecting, and servicing customer financing arrangements; and the resale of VMware products and services. The company serves enterprises, public institutions, and small and medium-sized businesses through its direct sales channel, value-added resellers, system integrators, distributors, and retailers. The company was formerly known as Denali Holding Inc. and changed its name to Dell Technologies Inc. in August 2016. Dell Technologies Inc. was founded in 1984 and is headquartered in Round Rock, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"HP Inc.","Symbol":"HPQ","Current Price":"30.42","Latest MA":"33.21","Latest MA 5":33.2299999084,"Latest MA 9":33.8200003221,"Latest MA 20":33.2140000305,"Price Target":36.39467,"Difference from MA":"-8.41%","Difference from Open":"-3.21%","Change from Yesterday":"-8.18%","Change from Last Report":"0.43","Latest Volume":"10,765,779","Market Cap":"28,685,604,864","Earning Date":"2025-02-27","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":8.45,"PB Ratio":-26.896551,"Previous Close":33.13,"ROE":"N\/A","DTE":"N\/A","Industry":"Computer Hardware","Sector":"Technology","Beta":"N\/A","Trailing PEG":1.2151,"Trailing PE":10.942446,"Trailing PS":0.5324178,"Quick Ratio":0.258,"Day High":31.28,"Day Low":29.98,"VS Average Volume":1.6619452723,"Company Summary":"HP Inc. provides personal computing, printing, 3D printing, hybrid work, gaming, and other related technologies in the United States and internationally. The company operates through three segments: Personal Systems, Printing, and Corporate Investments. The Personal Systems segment offers commercial and consumer desktops and notebooks, workstations, thin clients, retail point-of-sale systems, displays, software, support, and services, as well as hybrid systems. The Printing segment provides consumer and commercial printer hardware, supplies, solutions, and services, as well as focuses on graphics and 3D printing and personalization solutions in the commercial and industrial markets. The Corporate Investments segment is involved in the business incubation and investment projects. It serves individual consumers, small- and medium-sized businesses, and large enterprises. The company was formerly known as Hewlett-Packard Company and changed its name to HP Inc. in October 2015. HP Inc. was founded in 1939 and is headquartered in Palo Alto, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"PENN Entertainment, Inc.","Symbol":"PENN","Current Price":"21.19","Latest MA":"21.25","Latest MA 5":20.6859999542,"Latest MA 9":21.0522222985,"Latest MA 20":21.2480001183,"Price Target":23.47222,"Difference from MA":"-0.27%","Difference from Open":"4.28%","Change from Yesterday":"3.92%","Change from Last Report":"0.09","Latest Volume":"3,033,674","Market Cap":"3,234,208,512","Earning Date":"2025-02-27","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":27.166668,"PB Ratio":1.0345165,"Previous Close":20.39,"ROE":-0.16457,"DTE":369.728,"Industry":"Resorts & Casinos","Sector":"Consumer Cyclical","Beta":2.091,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.513,"Quick Ratio":0.789,"Day High":21.38,"Day Low":19.8982,"VS Average Volume":0.7174506339,"Company Summary":"PENN Entertainment, Inc., together with its subsidiaries, provides integrated entertainment, sports content, and casino gaming experiences. The company operates through five segments: Northeast, South, West, Midwest, and Interactive. It operates online sports betting in various jurisdictions; and iCasino under Hollywood Casino, L'Auberge, ESPN BET, and theScore Bet Sportsbook and Casino brands. The company's portfolio also includes PENN Play, customer loyalty program, which offers a set of rewards and experiences for business channels. In addition, it owns various trademarks and service marks, including Ameristar, Argosy, Boomtown, Hollywood Casino, Hollywood Gaming, L'Auberge, PENN Play, theScore, theScore Bet, theScore esports, and M Resort. The company was formerly known as Penn National Gaming, Inc. and changed its name to PENN Entertainment, Inc. in August 2022. PENN Entertainment, Inc. was founded in 1972 and is based in Wyomissing, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"NetApp, Inc.","Symbol":"NTAP","Current Price":"98.25","Latest MA":"120.62","Latest MA 5":117.4170003662,"Latest MA 9":120.1283335029,"Latest MA 20":120.6167500916,"Price Target":129.0625,"Difference from MA":"-18.54%","Difference from Open":"-1.09%","Change from Yesterday":"-16.89%","Change from Last Report":"0.21","Latest Volume":"6,193,885","Market Cap":"19,975,829,504","Earning Date":"2025-02-27","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":12.9624,"PB Ratio":20.146606,"Previous Close":118.22,"ROE":1.14329,"DTE":200.402,"Industry":"Computer Hardware","Sector":"Technology","Beta":"N\/A","Trailing PEG":1.6521,"Trailing PE":18.19537,"Trailing PS":3.0694268,"Quick Ratio":0.753,"Day High":105.26,"Day Low":97.51,"VS Average Volume":3.9041732693,"Company Summary":"NetApp, Inc. provides a range of enterprise software, systems, and services that customers use to transform their data infrastructures in the United States, Canada, Latin America, Europe, the Middle East, Africa, and the Asia Pacific. It operates in two segments, Hybrid Cloud and Public Could. The company offers data management software, such as NetApp ONTAP, NetApp Snapshot, NetApp SnapCenter Backup Management, NetApp SnapMirror Data Replication, NetApp SnapLock Data Compliance, and NetApp Astra; and storage infrastructure solutions, including NetApp All-Flash FAS, NetApp All-Flash FAS with capacity flash, NetApp All-Flash SAN Array, NetApp Fabric Attached Storage, NetApp E\/EF series, and NetApp StorageGRID. It also provides cloud storage and data services comprising NetApp Cloud Volumes ONTAP, Azure NetApp Files, Amazon FSx for NetApp ONTAP, and Google Cloud NetApp Volumes, as well as NetApp BlueXP, BlueXP Sync, BlueXP Tiering, NetApp Backup, BlueXP Compliance, and BlueXP Cache; and cloud operations services consist of NetApp Cloud Insights, Spot by NetApp, and Instaclustr. In addition, the company offers professional and support services, such as storage-as-a-service (STaaS), strategic consulting, professional, managed, and support services, as well as assessment, design, implementation, and migration services. It serves various industries comprising energy, financial services, government, technology, internet, life sciences, healthcare services, manufacturing, media, entertainment, animation, video postproduction, and telecommunications through a direct sales force and an ecosystem of partners. NetApp, Inc. was incorporated in 1992 and is headquartered in San Jose, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"Viatris Inc.","Symbol":"VTRS","Current Price":"9.18","Latest MA":"10.81","Latest MA 5":10.5629998779,"Latest MA 9":10.7683333079,"Latest MA 20":10.8067499542,"Price Target":12.5125,"Difference from MA":"-15.10%","Difference from Open":"-4.72%","Change from Yesterday":"-3.73%","Change from Last Report":"0.08","Latest Volume":"15,415,005","Market Cap":"10,951,188,480","Earning Date":"2025-02-27","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":3.4363296,"PB Ratio":0.5533108,"Previous Close":9.53,"ROE":-0.043449998,"DTE":80.912,"Industry":"Drug Manufacturers - Specialty & Generic","Sector":"Healthcare","Beta":0.952,"Trailing PEG":0.0599,"Trailing PE":"N\/A","Trailing PS":0.7277262,"Quick Ratio":0.819,"Day High":9.72,"Day Low":9.1,"VS Average Volume":1.5531945014,"Company Summary":"Viatris Inc. operates as a healthcare company worldwide. The company operates in four segments: Developed Markets, Greater China, JANZ, and Emerging Markets. It offers prescription brand drugs, generic drugs, complex generic drugs, biosimilars, and active pharmaceutical ingredients (APIs). The company offers drugs in various therapeutic areas, including noncommunicable and infectious diseases; biosimilars in the areas of oncology, immunology, endocrinology, ophthalmology, and dermatology; and APIs for antibacterial, central nervous system agents, antihistamines\/antiasthmatics, cardiovascular, antivirals, antidiabetics, antifungals, and proton pump inhibitor areas, as well as support services, such as diagnostic clinics, educational seminars, and digital tools to help patients better manage their health. It provides it medicines in the form of oral solid doses, injectables, complex dosage forms, and APIs to retail and pharmacy establishments, wholesalers and distributors, payers, insurers and governments, and institutions. The company distributes its products through pharmaceutical wholesalers\/distributors, pharmaceutical retailers, institutional pharmacies, mail-order and e-commerce pharmacies, and specialty pharmacies. It sells its products under the Lyrica, Lipitor, Creon, Influvac, Wixela Inhub, EpiPen auto-injector, Fraxiparine, and Yupelri; Norvasc and Viagra; AMITIZA, Lipacreon, and Effexor; and Celebrex and ARV names, as well as glargine and SEMGLEE names. The company has collaboration and licensing agreements with Revance Therapeutics, Inc.; and Momenta Pharmaceuticals, Inc. Viatris Inc. was founded in 1961 and is headquartered in Canonsburg, Pennsylvania.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"The AES Corporation","Symbol":"AES","Current Price":"11.68","Latest MA":"10.59","Latest MA 5":10.9110000229,"Latest MA 9":10.7227777693,"Latest MA 20":10.5917499447,"Price Target":15.68417,"Difference from MA":"10.23%","Difference from Open":"5.66%","Change from Yesterday":"12.48%","Change from Last Report":"0.34","Latest Volume":"28,069,141","Market Cap":"8,301,240,320","Earning Date":"2025-02-27","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":5.7512317,"PB Ratio":2.5232334,"Previous Close":10.38,"ROE":-0.02549,"DTE":352.879,"Industry":"Utilities - Diversified","Sector":"Utilities","Beta":0.983,"Trailing PEG":1.0921,"Trailing PE":8.107638,"Trailing PS":0.67577666,"Quick Ratio":0.311,"Day High":12.0,"Day Low":10.75,"VS Average Volume":2.0496089924,"Company Summary":"The AES Corporation, together with its subsidiaries, operates as a diversified power generation and utility company in the United States and internationally. The company owns and\/or operates power plants to generate and sell power to customers, such as utilities, industrial users, and other intermediaries; owns and\/or operates utilities to generate or purchase, distribute, transmit, and sell electricity to end-user customers in the residential, commercial, industrial, and governmental sectors; and generates and sells electricity on the wholesale market. It uses various fuels and technologies to generate electricity, such as coal, gas, hydro, wind, solar, and biomass, as well as renewables comprising energy storage and landfill gas. The company owns and\/or operates a generation portfolio of approximately 34,596 megawatts and distributes power to 2.6 million customers. The company was formerly known as Applied Energy Services, Inc. and changed its name to The AES Corporation in April 2000. The AES Corporation was incorporated in 1981 and is headquartered in Arlington, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"EchoStar Corporation","Symbol":"SATS","Current Price":"30.66","Latest MA":"29.09","Latest MA 5":29.4840000458,"Latest MA 9":29.7011110687,"Latest MA 20":29.0869999962,"Price Target":31.5,"Difference from MA":"5.41%","Difference from Open":"-0.39%","Change from Yesterday":"0.82%","Change from Last Report":"0.13","Latest Volume":"2,583,079","Market Cap":"8,782,342,144","Earning Date":"2025-02-27","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":-11.149091,"PB Ratio":0.43488744,"Previous Close":30.41,"ROE":-0.0061299996,"DTE":147.268,"Industry":"Communication Equipment","Sector":"Technology","Beta":"N\/A","Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.5549483,"Quick Ratio":1.157,"Day High":31.58,"Day Low":29.63,"VS Average Volume":1.6228979308,"Company Summary":"EchoStar Corporation, together with its subsidiaries, provides networking technologies and services worldwide. The company operates in four segments: Pay-TV, Retail Wireless, 5G Network Deployment, Broadband and Satellite Services. The Pay-TV segment offers a direct broadcast and fixed satellite services; designs, develops, and distributes receiver system; and provides digital broadcast operations, including satellite uplinking\/downlinking, transmission and, other services to third-party pay-TV providers; and multichannel, live-linear and on-demand streaming over-the-top internet-based domestic, international, Latino, and Freestream video programming services under the DISH and SLING brand names. The Retail Wireless segment provides prepaid and postpaid wireless services under the Boost Mobile, Boost postpaid, and Gen Mobile brands, as well various wireless devices. The Network Deployment segment deploys a facilities-based 5G broadband network and commercializes deployment of 5G VoNR. The Broadband and Satellite Services offers broadband services to consumer customers, which include home, and small to medium-sized businesses; and satellite and multi-transport technologies, and managed network services to telecommunications providers, aeronautical service providers, civilian and defense government entities, and other enterprise customers. EchoStar Corporation was incorporated in 2007 and is headquartered in Englewood, Colorado.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"TechnipFMC plc","Symbol":"FTI","Current Price":"29.50","Latest MA":"30.16","Latest MA 5":28.5319999695,"Latest MA 9":29.3522222307,"Latest MA 20":30.1570000648,"Price Target":34.18,"Difference from MA":"-2.18%","Difference from Open":"3.51%","Change from Yesterday":"2.36%","Change from Last Report":"0.02","Latest Volume":"3,306,626","Market Cap":"12,549,742,592","Earning Date":"2025-02-27","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":14.974619,"PB Ratio":3.8506722,"Previous Close":28.81,"ROE":0.19940001,"DTE":58.911,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.535,"Trailing PEG":0.288,"Trailing PE":19.536425,"Trailing PS":1.4266583,"Quick Ratio":0.785,"Day High":29.695,"Day Low":28.42,"VS Average Volume":0.9215411404,"Company Summary":"TechnipFMC plc engages in the energy projects, technologies, and systems and services businesses in Europe, Central Asia, North America, Latin America, the Asia Pacific, Africa, the Middle East, and internationally. It operates through two segments: Subsea and Surface Technologies. The Subsea segment engages in the design, engineering, procurement, manufacturing, fabrication, installation, and life of field services for subsea systems, subsea field infrastructure, and subsea pipe systems used in oil and gas production and transportation. It provides subsea production and processing system; flexible pipe; subsea umbilicals, risers, and flowlines; vessels; robotics; well and asset services; and Subsea Studio for optimizing the development, execution, and operation of current and future subsea fields. The Surface Technologies segment designs, manufactures, and services products and systems used in land and shallow water exploration and production of crude oil and natural gas. This segment offers drilling; surface wellheads and production trees systems; iComplete, a pressure control system; fracturing tree and manifold systems; flexible pipes; safety and integrity systems, multiphase meter modules, in-line separation and processing systems, and standard pumps; well control and integrity systems; separation and processing systems; skid systems; and flow measurement and automation solutions. It also offers planning, testing and installation, commissioning, operations, replacement and upgrade, maintenance, storage, preservation, intervention, integrity, decommissioning, and abandonment; and supplies flowline products and services. TechnipFMC plc was founded in 1884 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"Edison International","Symbol":"EIX","Current Price":"54.71","Latest MA":"51.90","Latest MA 5":52.6100000305,"Latest MA 9":52.3155552504,"Latest MA 20":51.8959999542,"Price Target":72.56389,"Difference from MA":"5.42%","Difference from Open":"5.82%","Change from Yesterday":"6.56%","Change from Last Report":"0.05","Latest Volume":"4,543,307","Market Cap":"21,180,977,152","Earning Date":"2025-02-27","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":9.598246,"PB Ratio":1.5123286,"Previous Close":51.34,"ROE":0.07197,"DTE":212.858,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":"N\/A","Trailing PEG":0.6037,"Trailing PE":16.528702,"Trailing PS":1.2035329,"Quick Ratio":0.388,"Day High":55.39,"Day Low":51.52,"VS Average Volume":0.957095606,"Company Summary":"Edison International, through its subsidiaries, engages in the generation and distribution of electric power. The company supplies and delivers electricity to approximately 50,000 square mile area of southern California to residential, commercial, industrial, public authorities, agricultural, and other sectors. Its transmission facilities consist of lines ranging from 55 kV to 500 kV and approximately 80 transmission substations; distribution system consists of approximately 38,000 circuit-miles of overhead lines; approximately 31,000 circuit-miles of underground lines; and 730 distribution substations. The company was founded in 1886 and is based in Rosemead, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"Rocket Companies, Inc.","Symbol":"RKT","Current Price":"13.49","Latest MA":"12.90","Latest MA 5":13.2559999924,"Latest MA 9":13.1688888592,"Latest MA 20":12.8979999657,"Price Target":13.30769,"Difference from MA":"4.59%","Difference from Open":"-4.39%","Change from Yesterday":"5.14%","Change from Last Report":"0.26","Latest Volume":"4,597,779","Market Cap":"26,808,676,352","Earning Date":"2025-02-27","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":20.439392,"PB Ratio":2.7975943,"Previous Close":12.83,"ROE":0.07332,"DTE":154.542,"Industry":"Mortgage Finance","Sector":"Financial Services","Beta":"N\/A","Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":4.949546,"Quick Ratio":7.132,"Day High":14.2,"Day Low":13.36,"VS Average Volume":1.4235535437,"Company Summary":"Rocket Companies, Inc., a fintech holding company, provides mortgage lending, title and settlement services, and other financial technology services in the United States and Canada. It operates through two segments, Direct to Consumer and Partner Network. The company's solutions include Rocket Mortgage, a mortgage lender; Amrock that provides title insurance, property valuation, and settlement services; Rocket Homes, a home search platform and real estate agent referral network, which offers technology-enabled services to support the home buying and selling experience; and Rocket Loans, an online-based personal loans business. It also offers Core Digital Media, a online marketing platform in the mortgage and personal financial product sectors; Rocket Money, a personal finance app that helps clients manage every aspect of their financial lives; Lendesk, a software services company that provides a point of sale system for mortgage professionals and a loan origination system for private lenders; Rock Connections, a sales and support platform specializing in contact center services; and Rocket Innovation Studio that recruits and mentors top technology talent. In addition, the company originates, closes, sells, and services agency-conforming loans. Rocket Companies, Inc. was founded in 1985 and is headquartered in Detroit, Michigan. The company operates as a subsidiary of Rock Holdings Inc.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"Vistra Corp.","Symbol":"VST","Current Price":"133.06","Latest MA":"159.67","Latest MA 5":138.3879979248,"Latest MA 9":149.3544432916,"Latest MA 20":159.6694993286,"Price Target":177.35938,"Difference from MA":"-16.67%","Difference from Open":"3.95%","Change from Yesterday":"2.32%","Change from Last Report":"0.11","Latest Volume":"9,245,978","Market Cap":"45,270,466,560","Earning Date":"2025-02-27","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":19.284058,"PB Ratio":15.290738,"Previous Close":130.01,"ROE":0.30168,"DTE":183.15,"Industry":"Utilities - Independent Power Producers","Sector":"Utilities","Beta":1.237,"Trailing PEG":0.7993,"Trailing PE":25.10566,"Trailing PS":2.7833056,"Quick Ratio":0.408,"Day High":133.57,"Day Low":124.05,"VS Average Volume":1.2165894991,"Company Summary":"Vistra Corp., together with its subsidiaries, operates as an integrated retail electricity and power generation company. The company operates through six segments: Retail, Texas, East, West, Sunset, and Asset Closure. It retails electricity and natural gas to residential, commercial, and industrial customers across states in the United States and the District of Columbia. In addition, the company is involved in the electricity generation, wholesale energy purchases and sales, commodity risk management, fuel production, and fuel logistics management activities. It serves approximately 5 million customers with a generation capacity of approximately 41,000 megawatts with a portfolio of natural gas, nuclear, coal, solar, and battery energy storage facilities. The company was formerly known as Vistra Energy Corp. and changed its name to Vistra Corp. in July 2020. Vistra Corp. was founded in 1882 and is based in Irving, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"Norwegian Cruise Line Holdings ","Symbol":"NCLH","Current Price":"22.73","Latest MA":"26.21","Latest MA 5":24.1889998169,"Latest MA 9":24.9927778625,"Latest MA 20":26.2097499542,"Price Target":30.31895,"Difference from MA":"-13.26%","Difference from Open":"-3.42%","Change from Yesterday":"-4.03%","Change from Last Report":"-0.09","Latest Volume":"17,016,108","Market Cap":"10,006,837,248","Earning Date":"2025-02-27","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.885168,"PB Ratio":8.810999,"Previous Close":23.72,"ROE":0.69788,"DTE":1240.664,"Industry":"Travel Services","Sector":"Consumer Cyclical","Beta":2.65,"Trailing PEG":0.2934,"Trailing PE":19.95614,"Trailing PS":1.0687739,"Quick Ratio":0.088,"Day High":23.68,"Day Low":22.28,"VS Average Volume":1.8330559421,"Company Summary":"Norwegian Cruise Line Holdings Ltd., together with its subsidiaries, operates as a cruise company in North America, Europe, the Asia-Pacific, and internationally. The company operates through the Norwegian Cruise Line, Oceania Cruises, and Regent Seven Seas Cruises brands. It offers itineraries ranging from three days to a 180-days calling on various ports, including Scandinavia, Northern Europe, the Mediterranean, the Greek Isles, Alaska, Canada and New England, Hawaii, Asia, Tahiti and the South Pacific, Australia and New Zealand, Africa, India, South America, the Panama Canal, and the Caribbean. It distributes its products through retail\/travel advisor and onboard cruise sales channels, as well as meetings, incentives, and charters. Norwegian Cruise Line Holdings Ltd. was founded in 1966 and is based in Miami, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"Perrigo Company plc","Symbol":"PRGO","Current Price":"28.97","Latest MA":"25.00","Latest MA 5":25.6919995728,"Latest MA 9":25.3311107127,"Latest MA 20":25.0014997826,"Price Target":34.2,"Difference from MA":"15.87%","Difference from Open":"4.77%","Change from Yesterday":"20.10%","Change from Last Report":"0.00","Latest Volume":"5,808,579","Market Cap":"3,952,318,976","Earning Date":"2025-02-27","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":9.285256,"PB Ratio":0.92287594,"Previous Close":24.13,"ROE":-0.03537,"DTE":83.764,"Industry":"Drug Manufacturers - Specialty & Generic","Sector":"Healthcare","Beta":"N\/A","Trailing PEG":0.9501,"Trailing PE":"N\/A","Trailing PS":0.9037177,"Quick Ratio":1.15,"Day High":29.51,"Day Low":27.23,"VS Average Volume":4.3825432514,"Company Summary":"Perrigo Company plc provides over-the-counter health and wellness solutions to enhance individual well-being in the United States, Europe, and internationally. It operates through Consumer Self-Care Americas and Consumer Self-Care International segments. The company develops, manufactures, markets, and distributes self-care consumer products, such as upper respiratory products, including cough suppressants, expectorants, and sinus and allergy relief; nutrition products consisting of infant formulas and nutritional beverages; digestive health products, including antacids, anti-diarrheal, and anti-heartburn; pain and sleep-aids products comprising pain relievers and fever reducers; and oral care products, which include toothbrushes, toothbrush replacement heads, floss, flossers, whitening products, and toothbrush covers. It also offers healthy lifestyle products, such as smoking cessation, well-being, and weight management products; skin care products consisting of dermatological care, scar management, lice treatment, and other products for various skin conditions; women's health products comprising feminine hygiene and contraceptives; vitamins, minerals, and supplements; rare diseases business; and other miscellaneous self-care products. The company sells its products under the Compeed, Dr. Fresh, Firefly, Good Sense, Good Start, Mederma, Nasonex, Plackers, Prevacid24HR, REACH, Rembrandt, Steripod, Opill, Solpadeine, Coldrex, Physiomer, NiQuitin, ACO, ellaOne, Compeed Stops, XLS, Arterin, Davitamon, Apiserum, Abtei, and Nicorette brands. It also offers contract manufacturing services. The company sells its products through retail drug, supermarket, and mass merchandise chains; e-commerce stores; wholesalers; pharmacies; drug and grocery retailers; and para-pharmacies. The company was formerly known as Perrigo Company and changed its name to Perrigo Company plc in December 2013. Perrigo Company plc was founded in 1887 and is headquartered in Dublin, Ireland.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"Mosaic Company (The)","Symbol":"MOS","Current Price":"24.08","Latest MA":"26.48","Latest MA 5":25.0479999695,"Latest MA 9":25.7633334351,"Latest MA 20":26.4814999619,"Price Target":32.45368,"Difference from MA":"-9.07%","Difference from Open":"-1.71%","Change from Yesterday":"-4.03%","Change from Last Report":"0.17","Latest Volume":"7,837,048","Market Cap":"7,648,891,392","Earning Date":"2025-02-27","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":9.788618,"PB Ratio":0.6646426,"Previous Close":25.09,"ROE":0.0168,"DTE":36.374,"Industry":"Agricultural Inputs","Sector":"Basic Materials","Beta":"N\/A","Trailing PEG":1.8994,"Trailing PE":43.78182,"Trailing PS":0.6876768,"Quick Ratio":0.332,"Day High":24.72,"Day Low":23.05,"VS Average Volume":1.6885018618,"Company Summary":"The Mosaic Company, through its subsidiaries, produces and markets concentrated phosphate and potash crop nutrients in North America and internationally. The company operates through three segments: Phosphates, Potash, and Mosaic Fertilizantes. It owns and operates mines, which produce concentrated phosphate crop nutrients, such as diammonium phosphate, monoammonium phosphate, and ammoniated phosphate products; and phosphate-based animal feed ingredients primarily under the Biofos and Nexfos brand names, as well as produces a double sulfate of potash magnesia product under K-Mag brand name. The company also produces and sells potash for use in the manufacturing of mixed crop nutrients and animal feed ingredients, and for industrial use; and for use in the de-icing and as a water softener regenerant. In addition, it provides nitrogen-based crop nutrients, animal feed ingredients, and other ancillary services; and purchases and sells phosphates, potash, and nitrogen products. The company sells its products to wholesale distributors, retail chains, farmers, cooperatives, independent retailers, and national accounts. The company was incorporated in 2004 and is headquartered in Tampa, Florida.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"ADT Inc.","Symbol":"ADT","Current Price":"8.19","Latest MA":"7.57","Latest MA 5":7.7590000267,"Latest MA 9":7.6149999894,"Latest MA 20":7.5742500095,"Price Target":8.7,"Difference from MA":"8.06%","Difference from Open":"0.31%","Change from Yesterday":"0.80%","Change from Last Report":"0.31","Latest Volume":"23,041,614","Market Cap":"7,292,941,824","Earning Date":"2025-02-27","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.231251,"PB Ratio":1.8959928,"Previous Close":8.12,"ROE":0.00401,"DTE":200.656,"Industry":"Security & Protection Services","Sector":"Industrials","Beta":1.509,"Trailing PEG":null,"Trailing PE":12.401515,"Trailing PS":1.4187776,"Quick Ratio":0.451,"Day High":8.39,"Day Low":8.04,"VS Average Volume":3.652861382,"Company Summary":"ADT Inc. provides security, interactive, and smart home solutions to residential and small business customers in the United States. It operates through two segments, Consumer and Small Business, and Solar. The company provides burglar and life safety alarms, smart security cameras, smart home automation systems, and video surveillance systems. It primarily offers security designed to detect intrusion, control access, sense movement, smoke, fire, carbon monoxide, flooding, temperature, and other environmental conditions and hazards; and address personal medical emergencies, such as injuries or unanticipated falls. The company also provides automation and smart home solutions that allow customers to use their smart phones, smart phone application, or touchscreen panels in their homes to arm and disarm their security systems; record and view real-time video; and creates customized and automated schedules for connected devices; programs systems to react to defined events; integrates system with third-party connected devices, such as cameras, lights, thermostats, appliances, and garage doors, as well as offers monitoring and maintenance services. In addition, the company offers energy storage solutions, energy efficiency upgrades, and roofing services. It offers its products under the ADT, ADT Pulse, ADT+, and ADT Commercial brand names. The company was formerly known as Prime Security Services Parent, Inc. and changed its name to ADT Inc. in September 2017. ADT Inc. was founded in 1874 and is headquartered in Boca Raton, Florida.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"FirstEnergy Corp.","Symbol":"FE","Current Price":"38.60","Latest MA":"40.51","Latest MA 5":41.3150002441,"Latest MA 9":41.2816671244,"Latest MA 20":40.5117916336,"Price Target":43.81467,"Difference from MA":"-4.71%","Difference from Open":"-0.32%","Change from Yesterday":"0.14%","Change from Last Report":"0.26","Latest Volume":"5,998,830","Market Cap":"22,248,716,288","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":13.35813,"PB Ratio":1.7872685,"Previous Close":38.54,"ROE":0.09149,"DTE":175.095,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":"N\/A","Trailing PEG":1.1632,"Trailing PE":24.906452,"Trailing PS":1.6514783,"Quick Ratio":0.389,"Day High":38.8,"Day Low":37.91,"VS Average Volume":1.5626038683,"Company Summary":"FirstEnergy Corp., through its subsidiaries, generates, transmits, and distributes electricity in the United States. It operates through Regulated Distribution and Regulated Transmission segments. The company owns and operates coal-fired, nuclear, hydroelectric, wind, and solar power generating facilities. It operates 24,080 circuit miles of overhead and underground transmission lines; and electric distribution systems, including 274,518 miles of overhead pole line and underground conduit carrying primary, secondary, and street lighting circuits. The company serves approximately 6 million customers in Ohio, Pennsylvania, West Virginia, Maryland, New Jersey, and New York. FirstEnergy Corp. was incorporated in 1996 and is headquartered in Akron, Ohio.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"APi Group Corporation","Symbol":"APG","Current Price":"38.78","Latest MA":"38.69","Latest MA 5":39.3619997559,"Latest MA 9":39.4788887533,"Latest MA 20":38.6850000992,"Price Target":45.7,"Difference from MA":"0.25%","Difference from Open":"0.31%","Change from Yesterday":"0.23%","Change from Last Report":"0.14","Latest Volume":"2,484,618","Market Cap":"10,763,699,200","Earning Date":"2025-02-26","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":18.206572,"PB Ratio":3.611473,"Previous Close":38.7,"ROE":0.0859,"DTE":102.777,"Industry":"Engineering & Construction","Sector":"Industrials","Beta":1.839,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":1.5337275,"Quick Ratio":1.271,"Day High":39.28,"Day Low":38.435,"VS Average Volume":1.8414671746,"Company Summary":"APi Group Corporation provides safety and specialty services worldwide. It operates through Safety Services and Specialty Services segments. The Safety Services segment offers solutions focusing on end-to-end integrated occupancy systems, such as fire protection services; heating, ventilation, and air conditioning solutions; and entry systems, which include the design, installation, inspection, and service of these integrated systems. The Specialty Services segment provides various infrastructure and specialized industrial plant services, including maintenance and repair of underground electric, gas, water, sewer, and telecommunications infrastructure. This segment also offers engineering and design, fabrication, installation, maintenance service and repair, retrofitting and upgrading services, pipeline infrastructure, access and road construction, supporting facilities, and integrity management and maintenance to the energy industry. It serves customers in the public and private sectors, including commercial, industrial, distribution and fulfillment centers, manufacturing, education, healthcare, telecom, utilities, transmission and integrity, high tech, entertainment, government, and infrastructure markets. The company was formerly known as J2 Acquisition Limited and changed its name to APi Group Corporation in October 2019. APi Group Corporation was founded in 1926 and is headquartered in New Brighton, Minnesota.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"Paramount Global","Symbol":"PARA","Current Price":"11.35","Latest MA":"11.07","Latest MA 5":11.3963200229,"Latest MA 9":11.4101777947,"Latest MA 20":11.0700800572,"Price Target":12.892,"Difference from MA":"2.54%","Difference from Open":"0.99%","Change from Yesterday":"0.99%","Change from Last Report":"0.06","Latest Volume":"4,586,666","Market Cap":"8,088,240,640","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":6.969325,"PB Ratio":0.46706682,"Previous Close":11.24,"ROE":-0.30945,"DTE":92.653,"Industry":"Entertainment","Sector":"Communication Services","Beta":"N\/A","Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.27666655,"Quick Ratio":0.995,"Day High":11.46,"Day Low":11.11,"VS Average Volume":0.5149278195,"Company Summary":"Paramount Global operates as a media, streaming, and entertainment company worldwide. It operates through TV Media, Direct-to-Consumer, and Filmed Entertainment segments. The TV Media segment operates CBS Television Network, a domestic broadcast television network; CBS Stations, a television station; and international free-to-air networks comprising Network 10, Channel 5, Telefe, and Chilevisión; domestic premium and basic cable networks, such as Nickelodeon, MTV, CMT, Comedy Central, Paramount+ with SHOWTIME, Paramount Network, The Smithsonian Channel, BET Media Group, CBS Sports Network, and international extensions of these brands. This segment also provides domestic and international television studio operations, including CBS Studios, Paramount Television Studios, and Showtime\/MTV Entertainment Studios; CBS Media Ventures, which produces and distributes first run syndicated programming; and digital properties consisting of CBS News Streaming and CBS Sports HQ. The Direct-to-Consumer segment offers a portfolio of domestic and international pay and free streaming services, including Paramount+, Pluto TV, BET+, and Noggin. The Filmed Entertainment segment produces and acquires films, series, and short-form content for release and licensing around the world, as well as in theaters, on streaming services, on television, through digital home entertainment, and DVDs\/Blu-rays; and operates a portfolio consisting of Paramount Pictures, Paramount Players, Paramount Animation, Nickelodeon Studios, Awesomeness, and Miramax. It also provides production, distribution, and advertising solutions. The company was formerly known as ViacomCBS Inc. and changed its name to Paramount Global in February 2022. The company was founded in 1914 and is headquartered in New York, New York. Paramount Global is a subsidiary of National Amusements, Inc.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"NVIDIA Corporation","Symbol":"NVDA","Current Price":"121.57","Latest MA":"129.67","Latest MA 5":125.9812792676,"Latest MA 9":131.4529310276,"Latest MA 20":129.6728192065,"Price Target":174.8093,"Difference from MA":"-6.25%","Difference from Open":"2.99%","Change from Yesterday":"1.24%","Change from Last Report":"0.15","Latest Volume":"275,504,442","Market Cap":"2,966,307,995,648","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":29.507282,"PB Ratio":37.51003,"Previous Close":120.15,"ROE":1.1917701,"DTE":12.946,"Industry":"Semiconductors","Sector":"Technology","Beta":1.619,"Trailing PEG":0.8611,"Trailing PE":41.350338,"Trailing PS":22.730177,"Quick Ratio":3.672,"Day High":123.7,"Day Low":116.41,"VS Average Volume":1.1367270557,"Company Summary":"NVIDIA Corporation, a computing infrastructure company, provides graphics and compute and networking solutions in the United States, Singapore, Taiwan, China, Hong Kong, and internationally. The Compute & Networking segment comprises Data Center computing platforms and end-to-end networking platforms, including Quantum for InfiniBand and Spectrum for Ethernet; NVIDIA DRIVE automated-driving platform and automotive development agreements; Jetson robotics and other embedded platforms; NVIDIA AI Enterprise and other software; and DGX Cloud software and services. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro\/NVIDIA RTX GPUs for enterprise workstation graphics; virtual GPU or vGPU software for cloud-based visual and virtual computing; automotive platforms for infotainment systems; and Omniverse software for building and operating industrial AI and digital twin applications. The company's products are used in gaming, professional visualization, data center, and automotive markets. It sells its products to original equipment manufacturers, original device manufacturers, system integrators and distributors, independent software vendors, cloud service providers, consumer internet companies, add-in board manufacturers, distributors, automotive manufacturers and tier-1 automotive suppliers, and other ecosystem participants. NVIDIA Corporation was incorporated in 1993 and is headquartered in Santa Clara, California.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"Lineage, Inc.","Symbol":"LINE","Current Price":"60.19","Latest MA":"57.06","Latest MA 5":57.3710003967,"Latest MA 9":56.1794449022,"Latest MA 20":57.0637500076,"Price Target":73.35294,"Difference from MA":"5.47%","Difference from Open":"0.31%","Change from Yesterday":"0.88%","Change from Last Report":"0.09","Latest Volume":"2,347,447","Market Cap":"15,153,763,328","Earning Date":"2025-02-26","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":82.41096,"PB Ratio":1.5879216,"Previous Close":59.66,"ROE":-0.09558,"DTE":70.312,"Industry":"REIT - Industrial","Sector":"Real Estate","Beta":"N\/A","Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":2.8389626,"Quick Ratio":0.669,"Day High":61.13,"Day Low":59.8,"VS Average Volume":2.3969169693,"Company Summary":"Lineage, Inc. is the world's largest global temperature-controlled warehouse REIT with a network of over 480 strategically located facilities totaling over 84.1 million square feet and 3.0 billion cubic feet of capacity across countries in North America, Europe, and Asia-Pacific. Coupling end-to-end supply chain solutions and technology, Lineage partners with some of the world's largest food and beverage producers, retailers, and distributors to help increase distribution efficiency, advance sustainability, minimize supply chain waste, and, most importantly, feed the world.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"Expand Energy Corporation","Symbol":"EXE","Current Price":"98.28","Latest MA":"103.75","Latest MA 5":101.0520006714,"Latest MA 9":103.2655556234,"Latest MA 20":103.752250351,"Price Target":119.84,"Difference from MA":"-5.27%","Difference from Open":"1.13%","Change from Yesterday":"0.53%","Change from Last Report":"0.02","Latest Volume":"2,047,024","Market Cap":"22,869,755,904","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":23.179247,"PB Ratio":1.3033273,"Previous Close":97.76,"ROE":0.02483,"DTE":32.337,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":0.508,"Trailing PEG":16.3547,"Trailing PE":"N\/A","Trailing PS":6.949181,"Quick Ratio":1.452,"Day High":98.61,"Day Low":96.92,"VS Average Volume":0.7610756211,"Company Summary":"Expand Energy Corporation operates as an independent exploration and production company in the United States. It engages in acquisition, exploration, and development of properties to produce oil, natural gas, and natural gas liquids from underground reservoirs. The company holds interests in natural gas resource plays in the Marcellus Shale in the northern Appalachian Basin in Pennsylvania and the Haynesville\/Bossier Shales in northwestern Louisiana. As of December 31, 2023, the company owns a portfolio of onshore U.S. unconventional natural gas assets, including interests in approximately 5,000 natural gas wells. The company was formerly known as Chesapeake Energy Corporation and changed its name to Expand Energy Corporation in October 2024. Expand Energy Corporation was founded in 1989 and is based in Oklahoma City, Oklahoma.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"APA Corporation","Symbol":"APA","Current Price":"20.77","Latest MA":"22.38","Latest MA 5":21.689000061,"Latest MA 9":22.446111323,"Latest MA 20":22.3802500076,"Price Target":30.50069,"Difference from MA":"-7.22%","Difference from Open":"3.21%","Change from Yesterday":"1.72%","Change from Last Report":"0.10","Latest Volume":"7,939,721","Market Cap":"7,579,224,576","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":7.550909,"PB Ratio":1.5019891,"Previous Close":20.42,"ROE":0.22698,"DTE":105.032,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":3.158,"Trailing PEG":null,"Trailing PE":2.9495738,"Trailing PS":0.77887416,"Quick Ratio":"N\/A","Day High":21.035,"Day Low":19.85,"VS Average Volume":1.1735575193,"Company Summary":"APA Corporation, an independent energy company, explores for, develops, and produces natural gas, crude oil, and natural gas liquids. It has oil and gas operations in the United States, Egypt, and North Sea. The company also has exploration and appraisal activities in Suriname, as well as holds interests in projects located in Uruguay and internationally. APA Corporation was incorporated in 1954 and is headquartered in Houston, Texas.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"eBay Inc.","Symbol":"EBAY","Current Price":"63.98","Latest MA":"68.18","Latest MA 5":67.5029994202,"Latest MA 9":68.3861106873,"Latest MA 20":68.181250267,"Price Target":65.01071,"Difference from MA":"-6.17%","Difference from Open":"0.89%","Change from Yesterday":"0.80%","Change from Last Report":"0.11","Latest Volume":"4,203,674","Market Cap":"30,644,023,296","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":12.255748,"PB Ratio":5.9164896,"Previous Close":63.48,"ROE":0.34291,"DTE":150.155,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":1.347,"Trailing PEG":null,"Trailing PE":16.196201,"Trailing PS":2.9800665,"Quick Ratio":1.124,"Day High":64.56,"Day Low":63.09,"VS Average Volume":0.9071390083,"Company Summary":"eBay Inc., together with its subsidiaries, operates marketplace platforms that connect buyers and sellers in the United States, the United Kingdom, China, Germany, and internationally. The company's marketplace platform includes its online marketplace at ebay.com, off-platform businesses, and the eBay suite of mobile apps. Its platforms enable users to list, sell, and buy various products. The company was founded in 1995 and is headquartered in San Jose, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"CRH PLC","Symbol":"CRH","Current Price":"101.09","Latest MA":"102.69","Latest MA 5":101.1140006714,"Latest MA 9":102.7888891262,"Latest MA 20":102.6920003815,"Price Target":115.04545,"Difference from MA":"-1.56%","Difference from Open":"-0.36%","Change from Yesterday":"-0.41%","Change from Last Report":"0.16","Latest Volume":"3,911,818","Market Cap":"68,333,326,336","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":16.650742,"PB Ratio":3.1682394,"Previous Close":101.5,"ROE":0.15835,"DTE":68.114,"Industry":"Building Materials","Sector":"Basic Materials","Beta":1.384,"Trailing PEG":1.7082,"Trailing PE":20.133467,"Trailing PS":1.9213666,"Quick Ratio":0.829,"Day High":102.93,"Day Low":99.815,"VS Average Volume":0.9891139306,"Company Summary":"CRH plc, together with its subsidiaries, provides building materials solutions in Ireland and internationally. It operates through four segments: Americas Materials Solutions, Americas Building Solutions, Europe Materials Solutions, and Europe Building Solutions. The company provides solutions for the construction and maintenance of public infrastructure and commercial and residential buildings; and produces and sells aggregates, cement, readymixed concrete, and asphalt, as well as provides paving and construction services. It also manufactures, supplies, and delivers solutions for the built environment in communities across North America; and offers building and infrastructure solutions serving complex critical utility infrastructure, such as water, energy, transportation, and telecommunications projects, and outdoor living solutions for enhancing private and public spaces. In addition, the company combines materials, products, and services to produce a wide range of architectural and infrastructural solutions for use in the building and renovation of critical utility infrastructure, commercial and residential buildings, and outdoor living spaces for the built environment. Further, it produces and supplies precast and pre-stressed concrete products comprising floor and wall elements, beams, vaults, pipes, and manholes; granite, limestone, and sandstone; concrete and polymer-based products, such as underground vaults, drainage systems, utility enclosures, and modular precast structures; engineered steel, polymer-based anchoring, fixing, and connecting solutions; concrete masonry, hardscape and related products, including pavers, blocks and curbs, retaining walls, and slabs; and fencing and railing systems, composite decking, lawn and garden products, and packaged concrete mixes. The company was founded in 1936 and is headquartered in Dublin, Ireland.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"Salesforce, Inc.","Symbol":"CRM","Current Price":"295.54","Latest MA":"322.87","Latest MA 5":302.3939985352,"Latest MA 9":310.409995931,"Latest MA 20":322.8724986572,"Price Target":381.9469,"Difference from MA":"-8.47%","Difference from Open":"-0.14%","Change from Yesterday":"0.21%","Change from Last Report":"0.00","Latest Volume":"6,239,811","Market Cap":"282,831,781,888","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":26.55346,"PB Ratio":4.63316,"Previous Close":294.9,"ROE":0.10258,"DTE":18.623,"Industry":"Software - Application","Sector":"Technology","Beta":1.307,"Trailing PEG":1.3234,"Trailing PE":46.395607,"Trailing PS":7.4635644,"Quick Ratio":0.928,"Day High":301.9799,"Day Low":292.1536,"VS Average Volume":0.9045520788,"Company Summary":"Salesforce, Inc. provides Customer Relationship Management (CRM) technology that brings companies and customers together worldwide. The company's service includes sales to store data, monitor leads and progress, forecast opportunities, gain insights through analytics and artificial intelligence, and deliver quotes, contracts, and invoices; and service that enables companies to deliver trusted and highly personalized customer support at scale. In addition, its platform offering comprise a flexible platform that enables companies of various sizes, locations, and industries to build business workflow and apps with customer; online learning platform that allows anyone to learn in-demand Salesforce skills; and Slack, an intelligent productivity platform. The company's marketing services enables companies to plan, personalize, automate, and optimize customer marketing journey, connecting interaction, and connected products; and commerce services, which empowers shopping experience across various customer touchpoint, such as mobile, web, social, and stores and provides click-to-code tools that offers customers to build and deploy solutions. Further, its analytics offering includes Tableau, an end-to-end analytics solution for range of enterprise use cases and intelligent analytics with AI models, spot trends, predict outcomes, creates summaries, timely recommendations, and take action from any device; and integration service including MuleSoft, which provides building blocks to deliver end-to-end and connected experiences. Additionally, the company provides data cloud, a hyperscale data engine native to Salesforce; vertical services to meet the needs of customers in industries, such as financial services, healthcare and life sciences, manufacturing and automotive and government; and offers salesforce starter for small and medium-sized businesses. Salesforce, Inc. was incorporated in 1999 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"Snowflake Inc.","Symbol":"SNOW","Current Price":"176.65","Latest MA":"182.17","Latest MA 5":170.33,"Latest MA 9":177.0933336046,"Latest MA 20":182.174499054,"Price Target":204.1419,"Difference from MA":"-3.03%","Difference from Open":"2.69%","Change from Yesterday":"1.70%","Change from Last Report":"0.20","Latest Volume":"5,893,918","Market Cap":"58,307,043,328","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":189.94623,"PB Ratio":19.517181,"Previous Close":173.69,"ROE":-0.31455,"DTE":89.311,"Industry":"Software - Application","Sector":"Technology","Beta":1.073,"Trailing PEG":7.5669,"Trailing PE":"N\/A","Trailing PS":16.07851,"Quick Ratio":1.684,"Day High":177.19,"Day Low":170.57,"VS Average Volume":1.0304356894,"Company Summary":"Snowflake Inc. provides a cloud-based data platform for various organizations in the United States and internationally. Its platform offers Data Cloud, which enables customers to consolidate data into a single source of truth to drive meaningful business insights, build data-driven applications, and share data and data products, as well as applies artificial intelligence (AI) for solving business problems. The company was formerly known as Snowflake Computing, Inc. and changed its name to Snowflake Inc. in April 2019. Snowflake Inc. was incorporated in 2012 and is based in Bozeman, Montana.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"Crescent Energy Company","Symbol":"CRGY","Current Price":"12.52","Latest MA":"14.49","Latest MA 5":13.3309998779,"Latest MA 9":14.0283333079,"Latest MA 20":14.4937500305,"Price Target":19.09091,"Difference from MA":"-13.65%","Difference from Open":"-1.07%","Change from Yesterday":"-2.07%","Change from Last Report":"0.04","Latest Volume":"2,256,573","Market Cap":"3,234,789,632","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":6.914365,"PB Ratio":0.7479233,"Previous Close":12.78,"ROE":-0.0344,"DTE":69.973,"Industry":"Oil & Gas Integrated","Sector":"Energy","Beta":1.179,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":1.1036776,"Quick Ratio":0.816,"Day High":12.845,"Day Low":12.42,"VS Average Volume":0.6868722012,"Company Summary":"Crescent Energy Company operates as an energy company in the United States. Its operations focus on Texas and the Rockies with active development in the Eagle Ford and Uinta basins. The company also operates conventional assets in Wyoming. Crescent Energy Company is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"TJX Companies, Inc. (The)","Symbol":"TJX","Current Price":"123.90","Latest MA":"123.96","Latest MA 5":123.2899990845,"Latest MA 9":123.08777771,"Latest MA 20":123.962502594,"Price Target":133.33952,"Difference from MA":"-0.05%","Difference from Open":"0.24%","Change from Yesterday":"0.37%","Change from Last Report":"0.07","Latest Volume":"2,303,681","Market Cap":"139,283,431,424","Earning Date":"2025-02-26","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":26.934784,"PB Ratio":16.800001,"Previous Close":123.49,"ROE":0.61982,"DTE":152.246,"Industry":"Apparel Retail","Sector":"Consumer Cyclical","Beta":0.91,"Trailing PEG":2.5157,"Trailing PE":29.084505,"Trailing PS":2.471317,"Quick Ratio":0.597,"Day High":124.9,"Day Low":123.35,"VS Average Volume":0.4866986529,"Company Summary":"The TJX Companies, Inc., together with its subsidiaries, operates as an off-price apparel and home fashions retailer in the United States, Canada, Europe, and Australia. It operates through four segments: Marmaxx, HomeGoods, TJX Canada, and TJX International. The company sells family apparel, including footwear and accessories; home fashions, such as home basics, furniture, rugs, lighting products, giftware, soft home products, decorative accessories, tabletop, and cookware, as well as expanded pet, and gourmet food departments; jewelry and accessories; and other merchandise. It offers its products through stores and e-commerce sites. The TJX Companies, Inc. was incorporated in 1962 and is headquartered in Framingham, Massachusetts.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"Caesars Entertainment, Inc.","Symbol":"CZR","Current Price":"32.84","Latest MA":"36.13","Latest MA 5":34.1120002441,"Latest MA 9":35.6844444105,"Latest MA 20":36.1295,"Price Target":50.05882,"Difference from MA":"-9.10%","Difference from Open":"-1.02%","Change from Yesterday":"-1.11%","Change from Last Report":"-0.06","Latest Volume":"4,154,426","Market Cap":"6,962,506,752","Earning Date":"2025-02-25","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":24.507462,"PB Ratio":1.6694627,"Previous Close":33.25,"ROE":-0.04639,"DTE":589.077,"Industry":"Resorts & Casinos","Sector":"Consumer Cyclical","Beta":2.9,"Trailing PEG":4.5397,"Trailing PE":"N\/A","Trailing PS":0.6191647,"Quick Ratio":0.588,"Day High":33.81,"Day Low":32.61,"VS Average Volume":0.9203577818,"Company Summary":"Caesars Entertainment, Inc. operates as a gaming and hospitality company. The company owns, leases, or manages domestic properties in 18 states with slot machines, video lottery terminals and e-tables, and hotel rooms, as well as table games, including poker. It also operates and conducts retail and online sports wagering across 31 jurisdictions in North America and operates iGaming in five jurisdictions in North America; sports betting from our retail and online sportsbooks; and other games, such as keno. In addition, the company operates dining venues, bars, nightclubs, lounges, hotels, and entertainment venues; and provides staffing and management services. Caesars Entertainment, Inc. was founded in 1937 and is based in Reno, Nevada.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"Elanco Animal Health Incorporat","Symbol":"ELAN","Current Price":"11.10","Latest MA":"11.38","Latest MA 5":10.9919999313,"Latest MA 9":11.0744444105,"Latest MA 20":11.3814999866,"Price Target":15.75,"Difference from MA":"-2.47%","Difference from Open":"2.21%","Change from Yesterday":"1.65%","Change from Last Report":"0.18","Latest Volume":"2,973,046","Market Cap":"5,490,215,936","Earning Date":"2025-02-25","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":11.808511,"PB Ratio":0.9003163,"Previous Close":10.92,"ROE":0.05487,"DTE":72.9,"Industry":"Drug Manufacturers - Specialty & Generic","Sector":"Healthcare","Beta":1.418,"Trailing PEG":null,"Trailing PE":16.32353,"Trailing PS":1.2368137,"Quick Ratio":1.122,"Day High":11.12,"Day Low":10.86,"VS Average Volume":0.6174459317,"Company Summary":"Elanco Animal Health Incorporated, an animal health company, innovates, develops, manufactures, and markets products for pets and farm animals. It offers pet health disease prevention products, such as parasiticide and vaccine products that protect pets from worms, fleas, and ticks under the Seresto, Advantage, Advantix, and Advocate brands; pet health therapeutics for pain, osteoarthritis, ear infections, cardiovascular, and dermatology indications in canines and felines under the Galliprant and Claro brands; vaccines, antibiotics, parasiticides, and other products for use in poultry and aquaculture production, as well as nutritional health products, including enzymes, probiotics, and prebiotics; and a range of vaccines, antibiotics, implants, parasiticides, and other products used in ruminant and swine production under the Rumensin and Baytril brands. The company sells its products to third-party distributors; veterinarians; and farm animal producers, including beef and dairy farmers, as well as pork, poultry, and aquaculture operations. Elanco Animal Health Incorporated was founded in 1954 and is headquartered in Greenfield, Indiana.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"Keurig Dr Pepper Inc.","Symbol":"KDP","Current Price":"33.55","Latest MA":"32.46","Latest MA 5":33.9919999695,"Latest MA 9":33.5966666328,"Latest MA 20":32.4554999733,"Price Target":37.605,"Difference from MA":"3.37%","Difference from Open":"-1.18%","Change from Yesterday":"-0.13%","Change from Last Report":"0.00","Latest Volume":"12,831,794","Market Cap":"45,518,958,592","Earning Date":"2025-02-25","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":16.365854,"PB Ratio":1.8774481,"Previous Close":33.61,"ROE":0.057729997,"DTE":75.609,"Industry":"Beverages - Non-Alcoholic","Sector":"Consumer Defensive","Beta":0.616,"Trailing PEG":2.3936,"Trailing PE":31.952381,"Trailing PS":2.9652114,"Quick Ratio":0.276,"Day High":34.23,"Day Low":33.33,"VS Average Volume":1.2283288658,"Company Summary":"Keurig Dr Pepper Inc. owns, manufactures, and distributors beverages and single serve brewing systems in the United States and internationally. It operates through three segments: U.S. Refreshment Beverages, U.S. Coffee, and International. The company manufactures and distributes branded concentrates, syrup, and finished beverages, as well as sales of owned brands and third-party brands; tea, cocoa, and other products; and offers finished goods relating to K-Cup pods, single serve brewers, specialty coffee, and ready to drink coffee products. It offers its products under the Dr Pepper, Canada Dry, Mott's, A&W, Peñafiel, Snapple, 7UP, Green Mountain Coffee Roasters, GHOST, Clamato, Core Hydration, The Original Donut Shop, Snapple, Sunkist soda, Squirt, C4 Energy, Hawaiian Punch, Electrolit, Bai, Evian, Yoo-Hoo, Vita Coco, Big Red, Mott's, Crush, McCafé, Tim Hortons, Van Houtte, Celestial Seasonings, Bigelow, Starbucks, Dunkin', Folgers, Peet's, and Swiss Miss brands, as well as other partner and private label brands. The company markets and sells its products to supermarkets, mass merchandisers, club stores, pure-play e-commerce retailers, office superstores, restaurants, hotel chains, office product and coffee distributors, partner brand owners, and directly to consumers through Keurig.com website. Keurig Dr Pepper Inc. was founded in 1981 and is headquartered in Burlington, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"Coupang, Inc.","Symbol":"CPNG","Current Price":"23.33","Latest MA":"24.28","Latest MA 5":24.1662,"Latest MA 9":24.6456666158,"Latest MA 20":24.2845499352,"Price Target":29.42941,"Difference from MA":"-3.93%","Difference from Open":"-1.01%","Change from Yesterday":"-1.52%","Change from Last Report":"0.07","Latest Volume":"3,662,727","Market Cap":"42,123,886,592","Earning Date":"2025-02-25","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":49.640423,"PB Ratio":10.2418785,"Previous Close":23.69,"ROE":0.01594,"DTE":89.179,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":1.108,"Trailing PEG":0.186,"Trailing PE":291.6375,"Trailing PS":1.391697,"Quick Ratio":0.815,"Day High":23.76,"Day Low":23.2,"VS Average Volume":0.4610892488,"Company Summary":"Coupang, Inc., together with its subsidiaries owns and operates retail business through its mobile applications and Internet websites primarily in South Korea. The company operates through Product Commerce and Developing Offerings segments. It sells various products and services in the categories of home goods and décor products, apparel, beauty products, fresh food and groceries, sporting goods, electronics, and everyday consumables, as well as travel, and restaurant order and delivery services. In addition, the company offers Rocket Fresh, which offers fresh groceries; Coupang Eats, a restaurant ordering and delivery services; and Coupang Play, an online content streaming services, as well as advertising products. It also performs operations and support services in the United States, South Korea, Taiwan, Singapore, China, Japan, and India. Coupang, Inc. was incorporated in 2010 and is headquartered in Seattle, Washington.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"Amer Sports, Inc.","Symbol":"AS","Current Price":"29.55","Latest MA":"30.38","Latest MA 5":29.1699998474,"Latest MA 9":29.5111110263,"Latest MA 20":30.3799998665,"Price Target":33.27895,"Difference from MA":"-2.73%","Difference from Open":"4.27%","Change from Yesterday":"3.47%","Change from Last Report":"0.15","Latest Volume":"2,140,711","Market Cap":"16,144,937,984","Earning Date":"2025-02-25","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":42.214287,"PB Ratio":2.969849,"Previous Close":28.56,"ROE":0.03126,"DTE":28.669,"Industry":"Leisure","Sector":"Consumer Cyclical","Beta":"N\/A","Trailing PEG":0.6117,"Trailing PE":211.07143,"Trailing PS":3.114799,"Quick Ratio":0.626,"Day High":29.87,"Day Low":28.32,"VS Average Volume":0.6625530834,"Company Summary":"Amer Sports, Inc. designs, manufactures, markets, distributes, and sells sports equipment, apparel, footwear, and accessories in Europe, the Middle East, Africa, the Americas, China, and the Asia Pacific. It operates through three segments: Technical Apparel, Outdoor Performance, and Ball & Racquet Sports. The Technical Apparel segment offers outdoor apparel, footwear, and accessories which includes climbing gear. The Outdoor Performance segment provides hiking and running footwear, functional apparel, skiing and snowboarding gear, and lifestyle footwear. The Ball & Racquet Sports segment offers sports equipment for tennis, baseball, american football, basketball, golf, and various other professional and recreational sports. This segment provides custom-fitting protective gear and apparel for baseball, softball, football, and lacrosse. It sells its products under the Arc'teryx, PeakPerformance, Salomon, Atomic, Armada, ENVE, Wilson, Louisville Slugger, DeMarini, EvoShield, and ATEC brands. The company distributes its products through retail stores, general sporting goods retailers, specialty stores, independently operated partner stores, and distributors, as well as its e-commerce websites, and retailer-owned and third-party e-commerce websites. The company was formerly known as Amer Sports Management Holding (Cayman) Limited and changed its name to Amer Sports, Inc. in August 2023. Amer Sports, Inc. was founded in 1950 and is based in Helsinki, Finland.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"Maplebear Inc.","Symbol":"CART","Current Price":"41.06","Latest MA":"48.70","Latest MA 5":44.5479998474,"Latest MA 9":47.9061111281,"Latest MA 20":48.6977501602,"Price Target":52.14815,"Difference from MA":"-15.67%","Difference from Open":"1.77%","Change from Yesterday":"0.85%","Change from Last Report":"0.35","Latest Volume":"2,592,701","Market Cap":"10,549,393,408","Earning Date":"2025-02-25","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":30.645521,"PB Ratio":3.4375522,"Previous Close":40.735,"ROE":0.12684,"DTE":0.793,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":"N\/A","Trailing PEG":null,"Trailing PE":3.892417,"Trailing PS":3.1229703,"Quick Ratio":2.986,"Day High":41.11,"Day Low":39.99,"VS Average Volume":0.628685832,"Company Summary":"Maplebear Inc., doing business as Instacart, engages in the provision of online grocery shopping services to households in North America. It sells and delivers grocery products, as well as pickup services through a mobile application and website. It also operates virtual convenience stores; and provides software-as-a-service solutions to retailers. The company was incorporated in 2012 and is based in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"Permian Resources Corporation","Symbol":"PR","Current Price":"14.03","Latest MA":"14.36","Latest MA 5":13.9670002747,"Latest MA 9":14.1572223663,"Latest MA 20":14.3597500992,"Price Target":19.6,"Difference from MA":"-2.33%","Difference from Open":"1.26%","Change from Yesterday":"-0.25%","Change from Last Report":"0.11","Latest Volume":"5,200,106","Market Cap":"11,269,072,896","Earning Date":"2025-02-25","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":9.226974,"PB Ratio":1.0800924,"Previous Close":14.06,"ROE":0.12663999,"DTE":40.935,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":4.277,"Trailing PEG":1.85,"Trailing PE":9.672413,"Trailing PS":2.2534838,"Quick Ratio":0.761,"Day High":14.05,"Day Low":13.74,"VS Average Volume":0.6942953186,"Company Summary":"Permian Resources Corporation, an independent oil and natural gas company, focuses on the development of crude oil and related liquids-rich natural gas reserves in the United States. The company's assets primarily focus on the Delaware Basin, a sub-basin of the Permian Basin. Its properties consist of acreage blocks in West Texas, Eddy County, Lea County, and New Mexico. The company was formerly known as Centennial Resource Development, Inc. and changed its name to Permian Resources Corporation in September 2022. Permian Resources Corporation was incorporated in 2015 and is headquartered in Midland, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"DBA Sempra","Symbol":"SRE","Current Price":"71.07","Latest MA":"81.33","Latest MA 5":74.727999939,"Latest MA 9":79.6344443766,"Latest MA 20":81.3275001678,"Price Target":84.2875,"Difference from MA":"-12.61%","Difference from Open":"-2.15%","Change from Yesterday":"-1.17%","Change from Last Report":"0.08","Latest Volume":"4,413,820","Market Cap":"46,299,049,984","Earning Date":"2025-02-25","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":13.826849,"PB Ratio":1.5244204,"Previous Close":71.9,"ROE":0.097950004,"DTE":98.735,"Industry":"Utilities - Diversified","Sector":"Utilities","Beta":0.79,"Trailing PEG":3.0439,"Trailing PE":16.079185,"Trailing PS":3.511494,"Quick Ratio":0.422,"Day High":73.03,"Day Low":70.59,"VS Average Volume":0.9454147443,"Company Summary":"Sempra operates as an energy infrastructure company in the United States and internationally. It operates through three segments: Sempra California, Sempra Texas Utilities, and Sempra Infrastructure. The Sempra California segment provides electric services; and natural gas services to San Diego County. As of December 31, 2023, it offered electric services to approximately 3.6 million population and natural gas services to approximately 3.3 million population that covers 4,100 square miles. This segment owns and operates a natural gas distribution, transmission, and storage system that supplies natural gas. As of December 31, 2023, it serves a population of 21 million covering an area of 24,000 square miles. The Sempra Texas Utilities segment engages in the regulated electricity transmission and distribution. As of December 31, 2023, its transmission system included 18,298 circuit miles of transmission lines; 1,257 transmission and distribution substations; interconnection to 173 third-party generation facilities totaling 54,277 MW; and distribution system included approximately 4.0 million points of delivery and consisted of 125,116 miles of overhead and underground lines. The Sempra Infrastructure segment develops, builds, operates, and invests in energy infrastructure to help enable the energy transition in North American markets and worldwide. The company was formerly known as Sempra Energy and changed its name to Sempra in May 2023. Sempra was incorporated in 1996 and is based in San Diego, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"First Solar, Inc.","Symbol":"FSLR","Current Price":"134.99","Latest MA":"159.04","Latest MA 5":146.6759998779,"Latest MA 9":153.1422214762,"Latest MA 20":159.039999115,"Price Target":250.60883,"Difference from MA":"-15.12%","Difference from Open":"-4.32%","Change from Yesterday":"-4.33%","Change from Last Report":"0.15","Latest Volume":"3,885,112","Market Cap":"14,452,299,776","Earning Date":"2025-02-25","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":6.4712367,"PB Ratio":1.8115816,"Previous Close":141.18,"ROE":0.17621,"DTE":9.01,"Industry":"Solar","Sector":"Technology","Beta":1.465,"Trailing PEG":0.2127,"Trailing PE":11.221114,"Trailing PS":3.435879,"Quick Ratio":1.723,"Day High":141.32,"Day Low":133.9,"VS Average Volume":1.6781471371,"Company Summary":"First Solar, Inc., a solar technology company, provides photovoltaic (PV) solar energy solutions in the United States, France, Japan, Chile, and internationally. The company manufactures and sells PV solar modules with a thin film semiconductor technology that provides a lower-carbon alternative to conventional crystalline silicon PV solar modules. It designs, manufactures, and sells cadmium telluride solar modules that converts sunlight into electricity. The company's residual business operations include project development activities, operations and maintenance services, and the sale of PV solar power systems to third-party customers. It serves developers and operators of systems, utilities, independent power producers, commercial and industrial companies, and other system owners. The company was formerly known as First Solar Holdings, Inc. and changed its name to First Solar, Inc. in 2006. First Solar, Inc. was founded in 1999 and is headquartered in Tempe, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"ONEOK, Inc.","Symbol":"OKE","Current Price":"100.27","Latest MA":"97.68","Latest MA 5":97.3110001831,"Latest MA 9":97.9027769979,"Latest MA 20":97.6757496185,"Price Target":111.33789,"Difference from MA":"2.65%","Difference from Open":"3.31%","Change from Yesterday":"3.75%","Change from Last Report":"0.27","Latest Volume":"2,335,307","Market Cap":"62,599,446,528","Earning Date":"2025-02-24","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":16.794807,"PB Ratio":3.4318523,"Previous Close":96.64,"ROE":0.16117,"DTE":145.904,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":1.659,"Trailing PEG":2.4783,"Trailing PE":19.393616,"Trailing PS":2.885033,"Quick Ratio":0.648,"Day High":100.43,"Day Low":96.9742,"VS Average Volume":0.6566166448,"Company Summary":"ONEOK, Inc. engages in gathering, processing, fractionation, storage, transportation, and marketing of natural gas and natural gas liquids (NGL) in the United States. It operates through four segments: Natural Gas Gathering and Processing, Natural Gas Liquids, Natural Gas Pipelines, and Refined Products and Crude. The company owns natural gas gathering pipelines and processing plants in the Mid-Continent and Rocky Mountain regions; and provides midstream services to producers of NGLs. It also owns NGL gathering and distribution pipelines in Oklahoma, Kansas, Texas, New Mexico, Montana, North Dakota, Wyoming, and Colorado; terminal and storage facilities in Kansas, Nebraska, Iowa, and Illinois; NGL distribution pipelines in Kansas, Nebraska, Iowa, Illinois, and Indiana; transports refined petroleum products, including unleaded gasoline and diesel; and owns and operates truck- and rail-loading, and -unloading facilities connected to NGL fractionation, storage, and pipeline assets. In addition, the company transports and stores natural gas through regulated interstate and intrastate natural gas transmission pipelines, and natural gas storage facilities. Further, it owns and operates a parking garage in downtown Tulsa, Oklahoma; and leases excess office space and rail cars. Additionally, the company transports, stores, and distributes refined products, NGLs, and crude oil, as well as conducts commodity-related activities, including liquids blending and marketing activities. It serves integrated and independent exploration and production companies; other NGL and natural gas gathering and processing companies; crude oil and natural gas production companies; utilities; industrial companies; natural gasoline distributors; propane distributors; municipalities; ethanol producers; petrochemical, refining, and marketing companies; and heating fuel users, refineries, and exporters. ONEOK, Inc. was founded in 1906 and is headquartered in Tulsa, Oklahoma.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"Realty Income Corporation","Symbol":"O","Current Price":"56.95","Latest MA":"55.26","Latest MA 5":56.6340002441,"Latest MA 9":56.408888838,"Latest MA 20":55.2617999649,"Price Target":61.65,"Difference from MA":"3.05%","Difference from Open":"0.19%","Change from Yesterday":"0.68%","Change from Last Report":"0.01","Latest Volume":"3,529,754","Market Cap":"50,771,836,928","Earning Date":"2025-02-24","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":35.81761,"PB Ratio":1.3071821,"Previous Close":56.57,"ROE":0.02404,"DTE":68.313,"Industry":"REIT - Retail","Sector":"Real Estate","Beta":1.01,"Trailing PEG":5.9091,"Trailing PE":58.112244,"Trailing PS":9.617818,"Quick Ratio":0.986,"Day High":57.25,"Day Low":56.66,"VS Average Volume":0.6908765642,"Company Summary":"Realty Income (NYSE: O), an S&P 500 company, is real estate partner to the world's leading companies. Founded in 1969, we invest in diversified commercial real estate and have a portfolio of 15,450 properties in all 50 U.S. states, the U.K., and six other countries in Europe. We are known as \"The Monthly Dividend Company\" and have a mission to deliver stockholders dependable monthly dividends that grow over time. Since our founding, we have declared 649 consecutive monthly dividends and are a member of the S&P 500 Dividend Aristocrats index for having increased our dividend for the last 29 consecutive years.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"Cleveland-Cliffs Inc.","Symbol":"CLF","Current Price":"10.77","Latest MA":"10.97","Latest MA 5":10.8009997635,"Latest MA 9":11.2449999534,"Latest MA 20":10.9717500038,"Price Target":12.5,"Difference from MA":"-1.88%","Difference from Open":"1.65%","Change from Yesterday":"0.47%","Change from Last Report":"0.14","Latest Volume":"11,797,623","Market Cap":"5,323,087,872","Earning Date":"2025-02-24","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":27.602566,"PB Ratio":0.79793936,"Previous Close":10.73,"ROE":-0.094280005,"DTE":113.107,"Industry":"Steel","Sector":"Basic Materials","Beta":1.951,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.27746093,"Quick Ratio":0.491,"Day High":11.02,"Day Low":10.46,"VS Average Volume":0.7168036777,"Company Summary":"Cleveland-Cliffs Inc. operates as a flat-rolled steel producer in North America. The company offers hot-rolled, cold-rolled, electrogalvanized, hot-dip galvanized, hot-dip galvannealed, aluminized, galvalume, enameling, and advanced high-strength steel products; austenitic, martensitic, duplex, precipitation hardening, and ferritic stainless steel products; plates; and grain oriented and non-oriented electrical steel products, as well as slab, scrap, iron ore, coal, and coke. It also provides tubular components, including carbon steel, stainless steel, and electric resistance welded tubing. In addition, the company offers tinplate products, such as electrolytic tin coated and chrome coated sheet, and tin mill products; tooling and sampling; ingots, rolled blooms, and cast blooms; and hot-briquetted iron products. Further, it owns five iron ore mines in Minnesota and Michigan. The company serves automotive, infrastructure and manufacturing, distributors and converters, and steel producers. The company was formerly known as Cliffs Natural Resources Inc. and changed its name to Cleveland-Cliffs Inc. in August 2017. Cleveland-Cliffs Inc. was founded in 1847 and is headquartered in Cleveland, Ohio.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"},{"Company Name":"Coterra Energy Inc.","Symbol":"CTRA","Current Price":"26.77","Latest MA":"27.76","Latest MA 5":27.0809998322,"Latest MA 9":27.6561110179,"Latest MA 20":27.7632499886,"Price Target":34.54333,"Difference from MA":"-3.56%","Difference from Open":"1.52%","Change from Yesterday":"1.46%","Change from Last Report":"0.02","Latest Volume":"2,783,510","Market Cap":"20,460,142,592","Earning Date":"2025-02-24","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":11.491417,"PB Ratio":1.4997479,"Previous Close":26.4,"ROE":0.08565,"DTE":28.957,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":0.239,"Trailing PEG":null,"Trailing PE":17.85,"Trailing PS":3.9016287,"Quick Ratio":2.649,"Day High":26.865,"Day Low":26.1496,"VS Average Volume":0.4520781798,"Company Summary":"Coterra Energy Inc., an independent oil and gas company, engages in the development, exploration, and production of oil, natural gas, and natural gas liquids in the United States. The company's properties include the Marcellus Shale with approximately 186,000 net acres in the dry gas window of the play located in Susquehanna County, Pennsylvania; Permian Basin properties with approximately 296,000 net acres located in west Texas and southeast New Mexico; and Anadarko Basin properties with approximately 182,000 net acres located in Oklahoma. It also operates natural gas and saltwater gathering and disposal systems in Texas. The company sells its natural gas to industrial customers, local distribution companies, oil and gas marketers, major energy companies, pipeline companies, and power generation facilities. Coterra Energy Inc. was incorporated in 1989 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"28-02-2025 21:57:27"}]