[{"Company Name":"American Airlines Group, Inc.","Symbol":"AAL","Current Price":"17.00","Latest MA":"12.22","Price Target":"18.30","Difference from MA":"39.16%","Difference from Open":"0.00%","Change from Yesterday":"-1.48%","Change from Last Report":"0.83","Latest Volume":"4,401,937","Market Cap":"11,171,227,648","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":7.4784775,"ROE":"N\/A","DTE":"N\/A","Industry":"Airlines","Sector":"Industrials","Beta":1.399,"Trailing PEG":0.21,"Trailing PE":40.476192,"Trailing PS":0.2083679,"Quick Ratio":0.422,"Day High":17.08,"Day Low":16.8,"VS Average Volume":0.1489101361,"Company Summary":"American Airlines Group Inc., through its subsidiaries, operates as a network air carrier. The company provides scheduled air transportation services for passengers and cargo through its hubs in Charlotte, Chicago, Dallas\/Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix, and Washington, D.C., as well as through partner gateways in London, Doha, Madrid, Seattle\/Tacoma, Sydney, and Tokyo. It operates a mainline fleet of 965 aircraft. The company was formerly known as AMR Corporation and changed its name to American Airlines Group Inc. in December 2013. American Airlines Group Inc. was founded in 1926 and is headquartered in Fort Worth, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-12-2024 16:43:13"},{"Company Name":"Micron Technology, Inc.","Symbol":"MU","Current Price":"88.52","Latest MA":"109.02","Price Target":"132.01","Difference from MA":"-18.80%","Difference from Open":"-1.18%","Change from Yesterday":"-1.40%","Change from Last Report":"0.11","Latest Volume":"1,962,351","Market Cap":"98,559,475,712","Earning Date":"2024-12-18","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":6.89221,"ROE":0.01743,"DTE":31.194,"Industry":"Semiconductors","Sector":"Technology","Beta":1.179,"Trailing PEG":0.2279,"Trailing PE":25.346704,"Trailing PS":3.9249525,"Quick Ratio":1.592,"Day High":89.7,"Day Low":88.35,"VS Average Volume":0.0824930143,"Company Summary":"Micron Technology, Inc. designs, develops, manufactures, and sells memory and storage products in the United States, Taiwan, Mainland China, rest of the Asia Pacific, Hong Kong, Japan, Europe, and internationally. The company operates through four segments: Compute and Networking Business Unit, Mobile Business Unit, Embedded Business Unit, and Storage Business Unit. It provides memory and storage technologies comprising dynamic random access memory semiconductor devices with low latency that provide high-speed data retrieval; non-volatile and re-writeable semiconductor storage devices; and non-volatile re-writable semiconductor memory devices that provide fast read speeds under the Micron and Crucial brands, as well as through private labels. The company offers serves the data center, PC, graphics, networking, automotive, industrial, and consumer embedded markets, as well as for smartphone and other mobile-device markets. It markets its products through its direct sales force, independent sales representatives, distributors, and retailers; and web-based customer direct sales channel, as well as through channel and distribution partners. Micron Technology, Inc. was founded in 1978 and is headquartered in Boise, Idaho.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"24-12-2024 16:43:13"},{"Company Name":"Carnival Corporation","Symbol":"CCL","Current Price":"25.55","Latest MA":"19.37","Price Target":"28.30","Difference from MA":"31.92%","Difference from Open":"-3.64%","Change from Yesterday":"-0.64%","Change from Last Report":"0.22","Latest Volume":"1,447,353","Market Cap":"33,439,021,056","Earning Date":"2024-12-20","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":12.664782,"ROE":0.20120001,"DTE":352.355,"Industry":"Travel Services","Sector":"Consumer Cyclical","Beta":2.668,"Trailing PEG":null,"Trailing PE":17.753471,"Trailing PS":1.3660289,"Quick Ratio":0.202,"Day High":26.05,"Day Low":25.49,"VS Average Volume":0.0559675707,"Company Summary":"Carnival Corporation & plc engages in the provision of leisure travel services in North America, Australia, Europe, Asia, and internationally. The company operates through four segments: NAA Cruise Operations, Europe Cruise Operations, Cruise Support, and Tour and Other. It operates port destinations, private islands, and a solar park, as well as owns and operates hotels, lodges, glass-domed railcars, and motor coaches. The company offers its services under the Carnival Cruise Line, Princess Cruises, Holland America Line, Seabourn, Costa Cruises, AIDA Cruises, P&O Cruises, and Cunard brand. Additionally, it sells its cruises primarily through travel agents, tour operators, vacation planners, and websites. Carnival Corporation & plc was founded in 1972 and is headquartered in Miami, Florida.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"24-12-2024 16:43:13"},{"Company Name":"Bank of America Corporation","Symbol":"BAC","Current Price":"44.14","Latest MA":"41.19","Price Target":"50.10","Difference from MA":"7.16%","Difference from Open":"0.54%","Change from Yesterday":"0.54%","Change from Last Report":"0.56","Latest Volume":"1,052,545","Market Cap":"338,565,824,512","Earning Date":"2025-01-16","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":11.964317,"ROE":0.08092,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.325,"Trailing PEG":1.9446,"Trailing PE":15.987319,"Trailing PS":3.5779366,"Quick Ratio":"N\/A","Day High":44.22,"Day Low":43.95,"VS Average Volume":0.0300811903,"Company Summary":"Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. It operates in four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, non-interest and interest-bearing checking accounts, and investment accounts and products; credit and debit cards; residential mortgages, and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research, and certain market-based services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"24-12-2024 16:43:13"},{"Company Name":"Broadcom Inc.","Symbol":"AVGO","Current Price":"236.33","Latest MA":"166.38","Price Target":"243.78","Difference from MA":"42.04%","Difference from Open":"-1.61%","Change from Yesterday":"1.73%","Change from Last Report":"0.14","Latest Volume":"5,271,550","Market Cap":"1,107,435,585,536","Earning Date":"2024-12-12","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":31.047583,"ROE":0.12509,"DTE":166.032,"Industry":"Semiconductors","Sector":"Technology","Beta":1.187,"Trailing PEG":0.6586,"Trailing PE":181.73846,"Trailing PS":23.655573,"Quick Ratio":0.841,"Day High":240.228,"Day Low":235.44,"VS Average Volume":0.1946396494,"Company Summary":"Broadcom Inc. designs, develops, and supplies various semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products worldwide. The company operates in two segments, Semiconductor Solutions and Infrastructure Software. It provides set-top box system-on-chips (SoCs); cable, digital subscriber line, and passive optical networking central office\/consumer premise equipment SoCs; wireless local area network access point SoCs; Ethernet switching and routing custom silicon solutions; serializer\/deserializer application specific integrated circuits; optical and copper, and physical layer devices; and fiber optic components and RF semiconductor devices. The company also offers RF front end modules and filter; Wi-Fi, Bluetooth, and global positioning system\/global navigation satellite system SoCs; custom touch controllers; inductive charging; attached small computer system interface, and redundant array of independent disks controllers and adapters; peripheral component interconnect express; fiber channel host bus adapters; read channel based SoCs; custom flash controllers; preamplifiers; optocouplers, industrial fiber optics, and motion control encoders and subsystems; light emitting diode, ethernet PHYs, switch ICs, and camera microcontrollers. Its products are used in various applications, including enterprise and data center networking, home connectivity, set-top boxes, broadband access, telecommunication equipment, smartphones and base stations, data center servers and storage systems, factory automation, power generation and alternative energy systems, and electronic displays. Broadcom Inc. was founded in 1961 and is headquartered in Palo Alto, California.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"24-12-2024 16:43:13"}]