[{"Company Name":"DraftKings Inc.","Symbol":"DKNG","Current Price":"46.45","Latest MA":"38.52","Price Target":51.84286,"Difference from MA":"20.57%","Difference from Open":"3.22%","Change from Yesterday":"2.22%","Change from Last Report":"0.00","Latest Volume":"18,246,705","Market Cap":"22,650,320,896","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":34.0318,"PB Ratio":21.027613,"Previous Close":45.44,"ROE":-0.44426,"DTE":124.782,"Industry":"Gambling","Sector":"Consumer Cyclical","Beta":1.819,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":4.917799,"Quick Ratio":0.572,"Day High":47.0999,"Day Low":44.845,"VS Average Volume":2.3964683206,"Company Summary":"DraftKings Inc. operates as a digital sports entertainment and gaming company in the United States and internationally. It provides online sports betting and casino, daily fantasy sports, media, and other consumer products, as well as retails sportsbooks. The company also engages in the design and development of sports betting and casino gaming software for online and retail sportsbooks, and iGaming operators. In addition, it offers DraftKings marketplace, a digital collectibles ecosystem designed for mainstream accessibility that offers curated NFT drops and supports secondary-market transactions. The company was founded in 2012 and is headquartered in Boston, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"DTE Energy Company","Symbol":"DTE","Current Price":"127.81","Latest MA":"121.32","Price Target":135.9,"Difference from MA":"5.35%","Difference from Open":"3.31%","Change from Yesterday":"2.91%","Change from Last Report":"0.00","Latest Volume":"2,257,207","Market Cap":"26,469,576,704","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.47926,"PB Ratio":2.2834222,"Previous Close":124.19,"ROE":0.13638,"DTE":213.847,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.683,"Trailing PEG":3.3727,"Trailing PE":17.318428,"Trailing PS":2.1320643,"Quick Ratio":0.538,"Day High":128.74,"Day Low":123.475,"VS Average Volume":1.7967530865,"Company Summary":"DTE Energy Company engages in the utility operations. The company's Electric segment generates, purchases, distributes, and sells electricity to various residential, commercial, and industrial customers in southeastern Michigan. It generates electricity through coal-fired plants, hydroelectric pumped storage, and nuclear plants, as well as wind and solar assets. This segment owns and operates distribution substations and line transformers. The company's Gas segment purchases, stores, transports, distributes, and sells natural gas to various residential, commercial, and industrial customers throughout Michigan; and sells storage and transportation capacity. Its DTE Vantage segment offers metallurgical and petroleum coke to steel and other industries; and power generation, steam production, chilled water production, and wastewater treatment services, as well as air supplies compressed air to industrial customers. Its Energy Trading segment engages in power, natural gas, and environmental marketing and trading; structured transactions; and the optimization of contracted natural gas pipeline transportation and storage positions. The company was founded in 1849 and is based in Detroit, Michigan.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"GE HealthCare Technologies Inc.","Symbol":"GEHC","Current Price":"93.48","Latest MA":"85.13","Price Target":97.357,"Difference from MA":"9.81%","Difference from Open":"3.87%","Change from Yesterday":"8.82%","Change from Last Report":"0.00","Latest Volume":"7,268,470","Market Cap":"42,708,488,192","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":17.841295,"PB Ratio":5.1348534,"Previous Close":85.9,"ROE":0.21853,"DTE":126.093,"Industry":"Health Information Services","Sector":"Healthcare","Beta":"N\/A","Trailing PEG":2.2684,"Trailing PE":25.61096,"Trailing PS":2.183572,"Quick Ratio":0.883,"Day High":94.7977,"Day Low":89.64,"VS Average Volume":2.497847859,"Company Summary":"GE HealthCare Technologies Inc. engages in the development, manufacture, and marketing of products, services, and complementary digital solutions used in the diagnosis, treatment, and monitoring of patients in the United States, Canada, and internationally. The company operates through four segments: Imaging, Ultrasound, Patient Care Solutions, and Pharmaceutical Diagnostics. The Imaging segment offers molecular imaging, computed tomography (CT) scanning, magnetic resonance (MR) imaging, image-guided therapy, X-ray systems, and women's health products. The Ultrasound segment provides medical devices and solutions for screening, diagnosis, treatment, and monitoring of certain diseases in clinical areas, such as radiology and primary care, women's health, cardiovascular, and point of care and handheld ultrasound solutions, as well as surgical visualization and guidance products. The Patient Care Solutions segment provides medical devices, consumables, services, and digital solutions. Its portfolio includes patient monitoring solutions, anesthesia delivery and respiratory care products, electrocardiogram solutions, maternal infant care products, and consumables and services. The Pharmaceutical Diagnostics supplies diagnostic agents, including CT, angiography and X-ray, MR, single-photon emission computed tomography, positron emission tomography, and ultrasound to the radiology and nuclear medicine industry. The segment also provides contrast media pharmaceuticals that are administered to a patient prior to certain diagnostic scans to increase the visibility of tissues or structures during imaging exams; and molecular imaging agents or radiopharmaceuticals, which are molecular tracers labeled with radioisotopes. It has an AI collaboration with Mass General Brigham. The company was formerly known as GE Healthcare Holding LLC and changed its name to GE HealthCare Technologies Inc. in December 2022. The company was incorporated in 2022 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Iron Mountain Incorporated (Del","Symbol":"IRM","Current Price":"95.25","Latest MA":"110.93","Price Target":120.875,"Difference from MA":"-14.13%","Difference from Open":"-6.33%","Change from Yesterday":"-7.28%","Change from Last Report":"0.00","Latest Volume":"3,778,737","Market Cap":"27,952,064,512","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":43.602455,"PB Ratio":"N\/A","Previous Close":102.73,"ROE":0.54398996,"DTE":"N\/A","Industry":"REIT - Specialty","Sector":"Real Estate","Beta":1.023,"Trailing PEG":null,"Trailing PE":264.5833,"Trailing PS":4.6676555,"Quick Ratio":0.612,"Day High":102.85,"Day Low":94.442,"VS Average Volume":2.1800435116,"Company Summary":"Iron Mountain Incorporated (NYSE: IRM) is a global leader in information management services. Founded in 1951 and trusted by more than 240,000 customers worldwide, Iron Mountain serves to protect and elevate the power of our customers' work. Through a range of offerings including digital transformation, data centers, secure records storage, information management, asset lifecycle management, secure destruction and art storage and logistics, Iron Mountain helps businesses bring light to their dark data, enabling customers to unlock value and intelligence from their stored digital and physical assets at speed and with security, while helping them meet their environmental goals.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Duke Energy Corporation (Holdin","Symbol":"DUK","Current Price":"113.95","Latest MA":"111.71","Price Target":121.57,"Difference from MA":"2.00%","Difference from Open":"-1.17%","Change from Yesterday":"-2.08%","Change from Last Report":"0.00","Latest Volume":"4,868,652","Market Cap":"88,024,317,952","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.899055,"PB Ratio":1.8266194,"Previous Close":116.37,"ROE":0.088369995,"DTE":169.205,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.457,"Trailing PEG":2.5565,"Trailing PE":20.45781,"Trailing PS":2.9587011,"Quick Ratio":0.29,"Day High":115.66,"Day Low":112.88,"VS Average Volume":1.5202133509,"Company Summary":"Duke Energy Corporation, together with its subsidiaries, operates as an energy company in the United States. It operates through two segments: Electric Utilities and Infrastructure (EU&I), and Gas Utilities and Infrastructure (GU&I). The EU&I segment generates, transmits, distributes, and sells electricity in the Carolinas, Florida, and the Midwest. It generates electricity through coal, hydroelectric, natural gas, oil, solar and wind sources, renewables, and nuclear fuel. This segment also engages in the wholesale of electricity to municipalities, electric cooperative utilities, and load-serving entities. The GU&I segment distributes natural gas to residential, commercial, industrial, and power generation natural gas customers; and invests in pipeline transmission projects, renewable natural gas projects, and natural gas storage facilities. The company was formerly known as Duke Energy Holding Corp. and changed its name to Duke Energy Corporation in April 2006. Duke Energy Corporation was founded in 1904 and is headquartered in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"US Foods Holding Corp.","Symbol":"USFD","Current Price":"71.11","Latest MA":"62.88","Price Target":77.575,"Difference from MA":"13.09%","Difference from Open":"2.77%","Change from Yesterday":"1.72%","Change from Last Report":"0.00","Latest Volume":"6,215,534","Market Cap":"16,564,292,608","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":15.594367,"PB Ratio":3.63418,"Previous Close":69.91,"ROE":0.12368,"DTE":107.859,"Industry":"Food Distribution","Sector":"Consumer Defensive","Beta":1.661,"Trailing PEG":null,"Trailing PE":30.519314,"Trailing PS":0.44382116,"Quick Ratio":0.681,"Day High":71.125,"Day Low":65.77,"VS Average Volume":3.3910465513,"Company Summary":"US Foods Holding Corp., together with its subsidiaries, engages in marketing, sale, and distribution of fresh, frozen, and dry food and non-food products to foodservice customers in the United States. The company's customers include independently owned single and multi-unit restaurants, regional concepts, national restaurant chains, hospitals, nursing homes, hotels and motels, country clubs, government and military organizations, colleges and universities, and retail locations. The company was formerly known as USF Holding Corp. and changed its name to US Foods Holding Corp. in February 2016. US Foods Holding Corp. was incorporated in 2007 and is headquartered in Rosemont, Illinois.","Stock Sentiment":"N\/A","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"CBRE Group Inc","Symbol":"CBRE","Current Price":"143.13","Latest MA":"124.93","Price Target":152.27274,"Difference from MA":"14.57%","Difference from Open":"5.22%","Change from Yesterday":"1.76%","Change from Last Report":"0.00","Latest Volume":"2,523,815","Market Cap":"43,800,354,816","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":20.014824,"PB Ratio":4.9531097,"Previous Close":140.65,"ROE":0.11434,"DTE":73.116,"Industry":"Real Estate Services","Sector":"Real Estate","Beta":1.395,"Trailing PEG":1.2382,"Trailing PE":46.320393,"Trailing PS":1.2764944,"Quick Ratio":0.889,"Day High":144.31,"Day Low":136.035,"VS Average Volume":1.3100260675,"Company Summary":"CBRE Group, Inc. operates as a commercial real estate services and investment company in the United States, the United Kingdom, and internationally. The Advisory Services segment offers strategic advice and execution to owners, investors, and occupiers of real estate in connection with leasing of offices, and industrial and retail space; clients fully integrated property sales services under the CBRE Capital Markets brand; clients commercial mortgage and structured financing services; originates and sells commercial mortgage loans; property management services, such as marketing, building engineering, accounting, and financial services on a contractual basis for owners of and investors in office, industrial, and retail properties; and valuation services that include market value appraisals, litigation support, discounted cash flow analyses, and feasibility studies, as well as consulting services, such as property condition reports, hotel advisory, and environmental consulting. The Global Workplace Solutions segment provides facilities management, including day-to-day management of client-occupied space, headquarters, regional offices, administrative offices, data centers and other critical facilities, manufacturing and laboratory facilities, and distribution facilities and retail space; and project management services comprising building consulting, program, and project and cost management services under the Turner & Townsend brand name. The Real Estate Investments segment offers investment management services under the CBRE Investment Management brand to pension funds, insurance companies, sovereign wealth funds, foundations, endowments, and other institutional investors; and development services, such as real estate development and investment activities under the Trammell Crow Company and Telford Homes brands to users and investors in commercial real estate, and for their own account. CBRE Group, Inc. was founded in 1906 and is headquartered in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Summit Materials, Inc.","Symbol":"SUM","Current Price":"52.49","Latest MA":"44.31","Price Target":"N\/A","Difference from MA":"18.47%","Difference from Open":"0.19%","Change from Yesterday":"-0.08%","Change from Last Report":"0.00","Latest Volume":"4,694,636","Market Cap":"9,228,477,440","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":24.99524,"PB Ratio":2.0728192,"Previous Close":52.45,"ROE":0.04364,"DTE":65.584,"Industry":"Building Materials","Sector":"Basic Materials","Beta":1.142,"Trailing PEG":null,"Trailing PE":61.75294,"Trailing PS":2.457947,"Quick Ratio":2.431,"Day High":54.07,"Day Low":52.4,"VS Average Volume":1.1939838893,"Company Summary":"Summit Materials, Inc. operates as a vertically integrated construction materials company in the United States and Canada. It operates in three segments: West, East, and Cement. The company offers aggregates, cement, ready-mix concrete, asphalt paving mixes, and concrete products, as well as plastics components. It also provides asphalt paving and related services. In addition, the company operates municipal waste, construction, and demolition debris landfills; and liquid asphalt terminals. The company serves the public infrastructure, and residential and nonresidential end markets. Summit Materials, Inc. was founded in 2009 and is headquartered in Denver, Colorado. As of February 10, 2025, Summit Materials, Inc. operates as a subsidiary of Quikrete Holdings, Inc.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Hyatt Hotels Corporation","Symbol":"H","Current Price":"147.38","Latest MA":"152.36","Price Target":162.94632,"Difference from MA":"-3.27%","Difference from Open":"-2.35%","Change from Yesterday":"-9.09%","Change from Last Report":"0.00","Latest Volume":"3,593,796","Market Cap":"14,154,139,648","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":29.657146,"PB Ratio":3.828052,"Previous Close":162.11,"ROE":0.3781,"DTE":92.622,"Industry":"Lodging","Sector":"Consumer Cyclical","Beta":1.507,"Trailing PEG":1.1016,"Trailing PE":11.089541,"Trailing PS":2.190365,"Quick Ratio":0.705,"Day High":152.71,"Day Low":140.1727,"VS Average Volume":6.8209910168,"Company Summary":"Hyatt Hotels Corporation operates as a hospitality company in the United States and internationally. It operates through Owned and Leased Hotels, Americas Management and Franchising, ASPAC Management and Franchising, EAME Management and Franchising, and Apple Leisure Group segments. The company manages, franchises, licenses, owns, and leases portfolio of properties, consisting of full-service hotels and resorts, select service hotels, and other properties, including timeshare, fractional, residential, vacation, and condominium units. It operates its properties under the Park Hyatt, Grand Hyatt, Hyatt Regency, Hyatt, Hyatt vacation Club, Hyatt Place, Hyatt House, Hyatt Studios, UrCove, Miraval, Alila, Andaz, Thompson Hotels, Dream Hotels, Hyatt Centric, Caption by Hyatt, The Unbound Collection by Hyatt, Destination by Hyatt, JdV by Hyatt, Hyatt Ziva, Hyatt Zilara, Zoëtry Wellness & Spa Resorts, Secrets Resorts & Spas, Breathless Resorts & Spas, Dreams Resorts & Spas, Hyatt Vivid Hotel & Resorts, Alua Hotels & Resorts, Sunscape Resorts & Spas, Maison Métier, and The Barnett brand name. The company offers short-term vacation rental platform, Homes & Hideaways by World of Hyatt, that features direct booking for short-term private home rentals in the United States. It primarily serves corporations; national, state, and regional associations; specialty market accounts, including social, government, military, educational, religious, and fraternal organizations; travel agency and luxury organizations; and a group of individual consumers. It also operates World of Hyatt loyalty program, which rewards points that can be redeemed for hotel nights and other rewards. Hyatt Hotels Corporation was founded in 1957 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Howmet Aerospace Inc.","Symbol":"HWM","Current Price":"128.08","Latest MA":"105.20","Price Target":128.64217,"Difference from MA":"21.75%","Difference from Open":"1.94%","Change from Yesterday":"-0.01%","Change from Last Report":"0.00","Latest Volume":"4,174,052","Market Cap":"52,033,908,736","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":33.045998,"PB Ratio":11.72357,"Previous Close":128.09,"ROE":0.25719,"DTE":78.925,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.293,"Trailing PEG":null,"Trailing PE":49.26154,"Trailing PS":7.1573462,"Quick Ratio":0.824,"Day High":128.685,"Day Low":122.7173,"VS Average Volume":1.7161010538,"Company Summary":"Howmet Aerospace Inc. provides advanced engineered solutions for the aerospace and transportation industries in the United States, Japan, France, Germany, the United Kingdom, Mexico, Italy, Canada, Poland, China, and internationally. It operates through four segments: Engine Products, Fastening Systems, Engineered Structures, and Forged Wheels. The Engine Products segment offers airfoils and seamless rolled rings primarily for aircraft engines and industrial gas turbines; and rotating and structural parts. The Fastening Systems segment produces aerospace fastening systems, as well as commercial transportation, industrial, and other fasteners; and latches, bearings, fluid fittings, and installation tools. The Engineered Structures segment provides titanium ingots and mill products, aluminum and nickel forgings, and machined components and assemblies for aerospace and defense applications; and titanium forgings, extrusions, and forming and machining services for airframe, wing, aero-engine, and landing gear components. The Forged Wheels segment offers forged aluminum wheels and related products for heavy-duty trucks and commercial transportation markets. The company was formerly known as Arconic Inc. Howmet Aerospace Inc. was founded in 1888 and is based in Pittsburgh, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Informatica Inc.","Symbol":"INFA","Current Price":"25.17","Latest MA":"25.49","Price Target":32.97059,"Difference from MA":"-1.26%","Difference from Open":"-4.11%","Change from Yesterday":"-3.56%","Change from Last Report":"0.00","Latest Volume":"3,100,977","Market Cap":"7,686,162,432","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":20.658241,"PB Ratio":3.1917322,"Previous Close":26.1,"ROE":0.028970001,"DTE":77.673,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.044,"Trailing PEG":null,"Trailing PE":109.434784,"Trailing PS":4.6389065,"Quick Ratio":1.895,"Day High":26.38,"Day Low":24.64,"VS Average Volume":1.9698172967,"Company Summary":"Informatica Inc. develops an artificial intelligence-powered platform that connects, manages, and unifies data across multi-vendor, multi-cloud, and hybrid systems at enterprise scale worldwide. The company's platform includes a suite of interoperable data management products, including data integration products to ingest, transform, and integrate data; API and application integration products that enable users to create and manage APIs and integration processes for app-to-app synchronization, business process orchestration, B2B partner management, application development, and API management; data quality and observability products to profile, cleanse, standardize, observe, and monitor data to deliver accurate, complete, and consistent data; and master data management products to create an authoritative single source of truth of business-critical data. Its platform also includes customer and business 360 application that allow business analysts to create 360-degree views of business data domains like customer, product, supplier, reference, and finance with simplified business user experiences; data catalog products that enables customers to quickly find, access, and understand enterprise data using a simple Google-like search experience; governance and privacy products that help users define policies, govern data, and ensure compliance with industry and corporate policies; and a data marketplace that delivers cloud shopping experience for data consumers and enables data sharing and AI models across organizations to facilitate data-driven decision making. In addition, the company provides CLAIRE GPT, GenAI-powered data management assistant. Further, it offers maintenance and professional services. The company sells its products through its direct sales team. The company was founded in 1993 and is headquartered in Redwood City, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Zoetis Inc.","Symbol":"ZTS","Current Price":"164.93","Latest MA":"178.68","Price Target":208.59941,"Difference from MA":"-7.70%","Difference from Open":"1.81%","Change from Yesterday":"-5.15%","Change from Last Report":"0.00","Latest Volume":"11,614,100","Market Cap":"74,410,639,360","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":23.57436,"PB Ratio":14.229143,"Previous Close":173.88,"ROE":0.47303,"DTE":129.442,"Industry":"Drug Manufacturers - Specialty & Generic","Sector":"Healthcare","Beta":0.896,"Trailing PEG":2.7046,"Trailing PE":31.001877,"Trailing PS":8.130533,"Quick Ratio":1.836,"Day High":166.1025,"Day Low":154.38,"VS Average Volume":4.567260332,"Company Summary":"Zoetis Inc. engages in the discovery, development, manufacture, and commercialization of animal health medicines, vaccines, and diagnostic products and services in the United States and internationally. The company commercializes products primarily across species, including livestock, such as cattle, swine, poultry, fish, and sheep and others; and companion animals comprising dogs, cats, and horses. It also offers parasiticides, vaccines, dermatology, other pharmaceutical, anti-infectives, animal health diagnostics, and medicated feed additives. In addition, the company provides animal health diagnostics, including point-of-care diagnostic products, instruments and reagents, rapid immunoassay tests, reference laboratory kits and services, and blood glucose monitors; and other non-pharmaceutical products, which include nutritionals, as well as products and services in biodevices, genetic tests, and precision animal health. It markets its products to veterinarians, livestock producers, and pet owners. The company has collaboration Blacksmith Medicines, Inc. to discover and develop novel antibiotics for animal health. Zoetis Inc. was founded in 1952 and is headquartered in Parsippany, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Organon & Co.","Symbol":"OGN","Current Price":"16.32","Latest MA":"17.62","Price Target":21.0,"Difference from MA":"-7.40%","Difference from Open":"3.72%","Change from Yesterday":"11.02%","Change from Last Report":"0.00","Latest Volume":"8,150,855","Market Cap":"4,203,036,416","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":3.817642,"PB Ratio":8.526646,"Previous Close":14.7,"ROE":"N\/A","DTE":1774.645,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.796,"Trailing PEG":null,"Trailing PE":3.231683,"Trailing PS":0.65580225,"Quick Ratio":0.893,"Day High":17.22,"Day Low":15.0,"VS Average Volume":2.5202129248,"Company Summary":"Organon & Co. develops and delivers health solutions through a portfolio of prescription therapies and medical devices within women's health in the United States and internationally. Its women's health portfolio comprises contraception and fertility brands, such as Nexplanon, a long-acting reversible contraceptive; NuvaRing, a monthly vaginal contraceptive ring; Cerazette, a daily pill used to prevent pregnancy; Marvelon, progestin and estrogen used as daily pills to prevent pregnancy; Follistim AQ, used to promote the development of multiple ovarian follicles in assisted reproduction technology procedures; Elonva, an ovarian follicle stimulant; Ganirelix Acetate Injection, an injectable antagonist; and Jada, for abnormal postpartum uterine bleeding or hemorrhage. The company's biosimilars portfolio consists of immunology products, such as Brenzys, Renflexis, and Hadlima; and two oncology products, including Ontruzant and Aybintio. It offers cholesterol-modifying medicines under the Zetia, Ezetrol, Vytorin, Atozet, Inegy, Rosuzet, and Zocor brands; Cozaar and Hyzaar for the treatment of hypertension; respiratory products for treatments of control and prevent symptoms caused by asthma under the Singulair, Dulera, Zenhale, and Asmanex brand names; and Singulair, Nasonex, Clarinex, and Aerius for treating seasonal allergic rhinitis. The company provides dermatology products under the Diprosone and Elocon brand; bone health portfolio, including Fosamax brand name; non-opioid pain management products under the Arcoxia, Diprospan, and Celestone brand names; Proscar for the treatment of symptomatic benign prostatic hyperplasia; and Propecia for the treatment of male pattern hair loss. It sells its products to drug wholesalers and retailers, hospitals, pharmacies, clinics, government agencies, health maintenance organizations, pharmacy benefit managers, and other institutions. The company was incorporated in 2020 and is headquartered in Jersey City, New Jersey.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Crocs, Inc.","Symbol":"CROX","Current Price":"110.05","Latest MA":"120.95","Price Target":129.66643,"Difference from MA":"-9.01%","Difference from Open":"-0.54%","Change from Yesterday":"23.89%","Change from Last Report":"0.00","Latest Volume":"7,452,833","Market Cap":"6,413,956,096","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":8.158004,"PB Ratio":3.7307615,"Previous Close":88.83,"ROE":0.57069,"DTE":102.834,"Industry":"Footwear & Accessories","Sector":"Consumer Cyclical","Beta":2.017,"Trailing PEG":null,"Trailing PE":7.99782,"Trailing PS":1.5749694,"Quick Ratio":0.826,"Day High":111.6334,"Day Low":103.65,"VS Average Volume":5.3573373013,"Company Summary":"Crocs, Inc., together with its subsidiaries, designs, develops, manufactures, markets, distributes, and sells casual lifestyle footwear and accessories for men, women, and children under Crocs and HEYDUDE Brand in the United States and internationally. The company offers various footwear products, including clogs, sandals, slides, flips, wedges, platforms, socks, boots, charms, flip flops, sneakers, and slippers. It sells its products through wholesalers, retail stores, e-commerce sites, third-party marketplaces, and kiosks\/store-in-store locations. Crocs, Inc. was founded in 1999 and is headquartered in Broomfield, Colorado.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Bruker Corporation","Symbol":"BRKR","Current Price":"51.15","Latest MA":"60.94","Price Target":73.18538,"Difference from MA":"-16.07%","Difference from Open":"-3.49%","Change from Yesterday":"-0.97%","Change from Last Report":"0.00","Latest Volume":"2,842,247","Market Cap":"7,754,237,952","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.607037,"PB Ratio":4.2911077,"Previous Close":51.65,"ROE":0.19725999,"DTE":132.635,"Industry":"Medical Devices","Sector":"Healthcare","Beta":1.204,"Trailing PEG":null,"Trailing PE":24.710146,"Trailing PS":2.3923235,"Quick Ratio":0.658,"Day High":53.11,"Day Low":48.61,"VS Average Volume":1.8509418013,"Company Summary":"Bruker Corporation, together with its subsidiaries, develops, manufactures, and distributes scientific instruments, and analytical and diagnostic solutions in the United States, Europe, the Asia Pacific, and internationally. The company operates through four segments: Bruker Scientific Instruments (BSI) BioSpin, BSI CALID, BSI Nano, and Bruker Energy & Supercon Technologies. It offers life science tools, and single and multiple modality systems; life science mass spectrometry; MALDI Biotyper rapid pathogen identification platform and related test kits, DNA test strips, and fluorescence-based polymerase chain reaction technology; genotype and fluorotype molecular diagnostics kits; research, analytical, and process analysis instruments and solutions; SARS-CoV 2 testing for the diagnosis of COVID-19 infection; and Fluorotyper-SARS-CoV 2 plus kits. It also provides range of portable analytical and bioanalytical detection systems, and related products; X-ray instruments; analytical tools for electron microscopes, as well as handheld, portable, and mobile X-ray fluorescence spectrometry instruments; atomic force microscopy instrumentation; non-contact nanometer resolution solution topography; and automated X-ray metrology, automated AFM defect-detection, and photomask repair and cleaning equipment. In addition, the company offers advanced optical fluorescence microscopy instruments; products and services to support the multi-omics needs of researchers in translational research, drug, and biomarker discovery; superconducting materials, such as metallic low temperature superconductors; devices and complex tools based on metallic low temperature superconductors; and non-superconducting high technology tools, such as synchrotron and beamline instrumentation. The company was incorporated in 1991 and is headquartered in Billerica, Massachusetts.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"American Electric Power Company","Symbol":"AEP","Current Price":"100.99","Latest MA":"96.11","Price Target":101.01176,"Difference from MA":"5.08%","Difference from Open":"-0.24%","Change from Yesterday":"-1.33%","Change from Last Report":"0.00","Latest Volume":"4,935,954","Market Cap":"53,783,736,320","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.038076,"PB Ratio":2.0202444,"Previous Close":102.35,"ROE":0.10182,"DTE":165.878,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.539,"Trailing PEG":1.5465,"Trailing PE":20.360886,"Trailing PS":2.74376,"Quick Ratio":0.3,"Day High":102.57,"Day Low":100.32,"VS Average Volume":1.6976012904,"Company Summary":"American Electric Power Company, Inc., an electric public utility holding company, engages in the generation, transmission, and distribution of electricity for sale to retail and wholesale customers in the United States. It operates through Vertically Integrated Utilities, Transmission and Distribution Utilities, AEP Transmission Holdco, and Generation & Marketing segments. The company generates electricity using coal and lignite, natural gas, renewable, nuclear, hydro, solar, wind, and other energy sources. It also supplies and markets electric power at wholesale to other electric utility companies, rural electric cooperatives, municipalities, and other market participants. American Electric Power Company, Inc. was incorporated in 1906 and is headquartered in Columbus, Ohio.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"SharkNinja, Inc.","Symbol":"SN","Current Price":"114.44","Latest MA":"98.23","Price Target":123.78364,"Difference from MA":"16.50%","Difference from Open":"-4.82%","Change from Yesterday":"3.43%","Change from Last Report":"0.00","Latest Volume":"4,892,720","Market Cap":"16,046,777,344","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":20.305758,"PB Ratio":8.942022,"Previous Close":110.65,"ROE":0.21666001,"DTE":62.811,"Industry":"Furnishings, Fixtures & Appliances","Sector":"Consumer Cyclical","Beta":"N\/A","Trailing PEG":2.3418,"Trailing PE":45.05512,"Trailing PS":3.1347785,"Quick Ratio":0.873,"Day High":123.0,"Day Low":102.5,"VS Average Volume":4.6732590803,"Company Summary":"SharkNinja, Inc., a product design and technology company, engages in the provision of various solutions for consumers worldwide. It offers cleaning appliances, including corded and cordless vacuums, including handheld and robotic vacuums, as well as other floorcare products comprising steam mops, wet\/dry cleaning floor products, and carpet extraction; cooking and beverage appliances, such as air fryers, multi-cookers, outdoor and countertop grills and ovens, coffee systems, carbonation, cookware, cutlery, kettles, toasters and bakeware; food preparation appliances comprising blenders, food processors, ice cream makers, and juicers; and beauty appliances, such as hair dryers and stylers, as well as home environment products comprising air purifiers and humidifiers. The company sells its products through traditional brick-and-mortar retail channels and e-commerce channels, distributors, and direct-to-consumer channels under the Shark and Ninja brands. SharkNinja, Inc. was incorporated in 2017 and is headquartered in Needham, Massachusetts.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"PPL Corporation","Symbol":"PPL","Current Price":"34.41","Latest MA":"31.98","Price Target":35.38938,"Difference from MA":"7.60%","Difference from Open":"0.61%","Change from Yesterday":"-0.32%","Change from Last Report":"0.00","Latest Volume":"9,194,066","Market Cap":"25,393,547,264","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":17.61508,"PB Ratio":1.8014764,"Previous Close":34.52,"ROE":0.05864,"DTE":117.528,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.834,"Trailing PEG":1.1265,"Trailing PE":31.0,"Trailing PS":3.066113,"Quick Ratio":0.807,"Day High":34.85,"Day Low":33.445,"VS Average Volume":2.1463659815,"Company Summary":"PPL Corporation, an energy company, focuses on providing electricity and natural gas to approximately 3.6 million customers in the United States. It operates through three segments: Kentucky Regulated, Pennsylvania Regulated, and Rhode Island Regulated. The company delivers electricity to customers in Pennsylvania, Kentucky, Virginia, and Rhode Island; delivers natural gas to customers in Kentucky and Rhode Island; and generates electricity from power plants in Kentucky. PPL Corporation was founded in 1920 and is headquartered in Allentown, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Digital Realty Trust, Inc.","Symbol":"DLR","Current Price":"164.81","Latest MA":"166.10","Price Target":189.33333,"Difference from MA":"-0.78%","Difference from Open":"2.03%","Change from Yesterday":"0.97%","Change from Last Report":"0.00","Latest Volume":"2,316,498","Market Cap":"55,723,741,184","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":186.22598,"PB Ratio":2.6620042,"Previous Close":163.22,"ROE":0.01956,"DTE":79.825,"Industry":"REIT - Specialty","Sector":"Real Estate","Beta":0.609,"Trailing PEG":10.3992,"Trailing PE":135.09016,"Trailing PS":10.367489,"Quick Ratio":1.6,"Day High":165.14,"Day Low":161.75,"VS Average Volume":1.1041063832,"Company Summary":"Digital Realty brings companies and data together by delivering the full spectrum of data center, colocation, and interconnection solutions. PlatformDIGITAL, the company's global data center platform, provides customers with a secure data meeting place and a proven Pervasive Datacenter Architecture (PDx) solution methodology for powering innovation and efficiently managing Data Gravity challenges. Digital Realty gives its customers access to the connected data communities that matter to them with a global data center footprint of 300+ facilities in 50+ metros across 25+ countries on six continents.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"TransUnion","Symbol":"TRU","Current Price":"100.25","Latest MA":"96.39","Price Target":117.70588,"Difference from MA":"4.01%","Difference from Open":"5.47%","Change from Yesterday":"7.25%","Change from Last Report":"0.00","Latest Volume":"3,304,801","Market Cap":"19,538,724,864","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":19.23029,"PB Ratio":4.6315546,"Previous Close":93.47,"ROE":0.057189997,"DTE":121.901,"Industry":"Financial Data & Stock Exchanges","Sector":"Financial Services","Beta":1.624,"Trailing PEG":1.0479,"Trailing PE":87.9386,"Trailing PS":4.7640324,"Quick Ratio":1.451,"Day High":100.57,"Day Low":93.9,"VS Average Volume":2.2634367545,"Company Summary":"TransUnion operates as a global consumer credit reporting agency that provides risk and information solutions. The company operates through U.S. Markets, International, and Consumer Interactive segments. The U.S. Markets segment provides consumer reports, actionable insights, and analytic services to businesses, which uses its services to acquire new customers; assess consumer ability to pay for services; identify cross-selling opportunities; measure and manage debt portfolio risk; collect debt; verify consumer identities; and mitigate fraud risk. This segment serves various industry vertical markets, including financial services, technology, commerce and communications, insurance, media, services and collections, tenant and employment, and public sectors. The International segment offers credit reports, analytics, technology solutions, and other value-added risk management services; consumer services, which help consumers to manage their personal finances; consumer credit reporting, insurance and auto information solutions, and commercial credit information services. It serves customers in financial services, retail credit, insurance, automotive, collections, public sector, and communications industries through direct and indirect channels. The company was formerly known as TransUnion Holding Company, Inc. and changed its name to TransUnion in March 2015. TransUnion was founded in 1968 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Palo Alto Networks, Inc.","Symbol":"PANW","Current Price":"201.88","Latest MA":"180.12","Price Target":206.40184,"Difference from MA":"12.08%","Difference from Open":"1.37%","Change from Yesterday":"2.62%","Change from Last Report":"0.00","Latest Volume":"12,302,443","Market Cap":"132,473,659,392","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":55.955765,"PB Ratio":12.695258,"Previous Close":196.73,"ROE":0.74517995,"DTE":27.28,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.118,"Trailing PEG":2.1939,"Trailing PE":52.30052,"Trailing PS":16.50248,"Quick Ratio":0.771,"Day High":202.41,"Day Low":195.35,"VS Average Volume":2.1633883188,"Company Summary":"Palo Alto Networks, Inc. provides cybersecurity solutions worldwide. The company's network security platforms include Prisma Access, a security services edge (SSE) solution, as well as Strata Cloud Manager, a network security management solution. It also provides cloud security solutions, including Prisma Cloud, a cloud native application protection platform; and Code to Cloud platform, as well as offers VM-Series and CN-Series virtual firewalls for inline network security on multi- and hybrid-cloud environments. In addition, the company provides security operation solutions through Cortex platform that includes Cortex XSIAM, an AI-driven security operations platform; Cortex XDR for the prevention, detection, and response to complex cybersecurity attacks; and Cortex XSOAR for security orchestration, automation, and response; and Cortex Xpanse for attack surface management, as well as offers threat intelligence and advisory services under the Unit 42 name. Further, it provides subscription services covering the areas of threat prevention, malware and persistent threat, URL filtering, laptop and mobile device protection, DNS security, Internet of Things security, SaaS security API, and SaaS security inline, as well as threat intelligence, and data loss prevention. Additionally, the company offers professional services, including architecture design and planning, implementation, configuration, and firewall migration; education services, such as certifications, as well as online and in-classroom training; and support services. It sells its products and services through its channel partners, as well as directly to medium to large enterprises, service providers, and government entities operating in various industries, including education, energy, financial services, government entities, healthcare, Internet and media, manufacturing, public sector, and telecommunications. The company was incorporated in 2005 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Pacific Gas & Electric Co.","Symbol":"PCG","Current Price":"15.85","Latest MA":"19.08","Price Target":21.78235,"Difference from MA":"-16.91%","Difference from Open":"-1.25%","Change from Yesterday":"-1.12%","Change from Last Report":"0.00","Latest Volume":"23,307,634","Market Cap":"34,767,130,624","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":9.747068,"PB Ratio":1.2625458,"Previous Close":16.03,"ROE":0.10674,"DTE":221.631,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":1.035,"Trailing PEG":0.979,"Trailing PE":12.382813,"Trailing PS":1.4002631,"Quick Ratio":0.804,"Day High":16.2,"Day Low":15.71,"VS Average Volume":1.0132479423,"Company Summary":"PG&E Corporation, through its subsidiary, Pacific Gas and Electric Company, engages in the sale and delivery of electricity and natural gas to customers in northern and central California, the United States. It generates electricity using nuclear, hydroelectric, fossil fuel-fired, fuel cell, and photovoltaic sources. The company owns and operates interconnected transmission lines; electric transmission substations, distribution lines, transmission switching substations, and distribution substations; and natural gas transmission, storage, and distribution system consisting of distribution pipelines, backbone and local transmission pipelines, and various storage facilities. It serves residential, commercial, industrial, and agricultural customers, as well as natural gas-fired electric generation facilities. PG&E Corporation was incorporated in 1905 and is based in Oakland, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"DexCom, Inc.","Symbol":"DXCM","Current Price":"84.09","Latest MA":"77.77","Price Target":97.51333,"Difference from MA":"8.12%","Difference from Open":"0.15%","Change from Yesterday":"0.26%","Change from Last Report":"0.00","Latest Volume":"6,750,706","Market Cap":"32,845,131,776","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":41.821465,"PB Ratio":16.59562,"Previous Close":83.87,"ROE":0.32061002,"DTE":130.935,"Industry":"Medical Devices","Sector":"Healthcare","Beta":1.173,"Trailing PEG":1.3082,"Trailing PE":50.963634,"Trailing PS":8.306811,"Quick Ratio":2.033,"Day High":84.58,"Day Low":83.2,"VS Average Volume":1.9797801999,"Company Summary":"DexCom, Inc., a medical device company, focuses on the design, development, and commercialization of continuous glucose monitoring (CGM) systems in the United States and internationally. The company provides its systems for use by people with diabetes, as well as for use by healthcare providers. Its products include Dexcom G6 and Dexcom G7, integrated CGM systems for diabetes management; Dexcom Share, a remote monitoring system; Dexcom Real-Time API, which enables authorized third-party software developers to integrate real-time CGM data into their digital health apps and devices; and Dexcom ONE, that is designed to replace finger stick blood glucose testing for diabetes treatment decisions. It has also submitted FDA review for Dexcom Stelo for people with type 2 diabetes. The company has a collaboration and license agreement with Verily Life Sciences LLC and Verily Ireland Limited to develop blood-based or interstitial glucose monitoring products. It markets its products directly to endocrinologists, physicians, and diabetes educators. The company was incorporated in 1999 and is headquartered in San Diego, California.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Molson Coors Beverage Company","Symbol":"TAP","Current Price":"58.54","Latest MA":"55.57","Price Target":62.84636,"Difference from MA":"5.34%","Difference from Open":"2.29%","Change from Yesterday":"9.52%","Change from Last Report":"0.00","Latest Volume":"5,636,465","Market Cap":"12,061,581,312","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":9.363344,"PB Ratio":0.9058274,"Previous Close":53.45,"ROE":0.071669996,"DTE":48.838,"Industry":"Beverages - Brewers","Sector":"Consumer Defensive","Beta":0.827,"Trailing PEG":2.5065,"Trailing PE":13.184685,"Trailing PS":1.0324752,"Quick Ratio":0.628,"Day High":58.9199,"Day Low":55.825,"VS Average Volume":3.2291443473,"Company Summary":"Molson Coors Beverage Company manufactures, markets, and sells beer and other malt beverage products under various brands in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company offers flavored malt beverages including hard seltzers, craft, spirits and energy, and ready to drink beverages. It provides its products under Aspall Cider, Blue Moon, Coors Original, Five Trail, Hop Valley brands, Leinenkugel's, Madri, Miller Genuine Draft, Molson Ultra, Sharp's, Staropramen, and Vizzy Hard Seltzer above premier brands; Bergenbier, Borsodi, Carling, Coors Banquet, Coors Light, Jelen, Kamenitza, Miller Lite, Molson Canadian, and Niksicko, Ozujsko under the premium brands; and Branik, Icehouse, Keystone, Miller High Life, Milwaukee's Best, and Steel Reserve under the economy brands. The company was formerly known as Molson Coors Brewing Company and changed its name to Molson Coors Beverage Company in January 2020. Molson Coors Beverage Company was founded in 1774 and is based in Golden, Colorado.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Wynn Resorts, Limited","Symbol":"WYNN","Current Price":"80.47","Latest MA":"86.42","Price Target":111.45556,"Difference from MA":"-6.88%","Difference from Open":"-0.28%","Change from Yesterday":"2.68%","Change from Last Report":"0.00","Latest Volume":"6,972,387","Market Cap":"8,836,812,800","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":16.208529,"PB Ratio":"N\/A","Previous Close":78.37,"ROE":"N\/A","DTE":"N\/A","Industry":"Resorts & Casinos","Sector":"Consumer Cyclical","Beta":1.802,"Trailing PEG":2.0221,"Trailing PE":9.660264,"Trailing PS":1.23945,"Quick Ratio":1.019,"Day High":81.95,"Day Low":79.6949,"VS Average Volume":3.0441508352,"Company Summary":"Wynn Resorts, Limited designs, develops, and operates integrated resorts. The company operates through four segments: Wynn Palace, Wynn Macau, Las Vegas Operations, and Encore Boston Harbor. The Wynn Palace segment operates private gaming salons and sky casinos; a luxury hotel tower with suites, and villas, including a health club, spa, salon, and pool; food and beverage outlets; retail space; meeting and convention space; and performance lake and floral art displays. The Wynn Macau segment operates casino space with private gaming salons, sky casinos, and a poker room; a luxury hotel tower, that include health clubs, spas, a salon, and a pool; food and beverage outlets; retail space; meeting and convention space; and Chinese zodiac-inspired ceiling attractions. The Las Vegas Operations segment operates casino space with private gaming salons, a sky casino, a poker room, and a race and sports book; a luxury hotel tower with suites, and villas, including swimming pools, private cabanas, full-service spas and salons, and a wedding chapel; food and beverage outlets; meeting and convention space; retail space; and theaters, nightclubs, a beach club. The Encore Boston Harbor segment operates casino space with gaming areas, and a poker room; a luxury hotel tower including a spa and salon; food and beverage outlets and a nightclub; retail space; meeting and convention space; and a waterfront park, floral displays, and water shuttle service. Wynn Resorts, Limited was incorporated in 2002 and is based in Las Vegas, Nevada.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Datadog, Inc.","Symbol":"DDOG","Current Price":"135.89","Latest MA":"129.92","Price Target":162.527,"Difference from MA":"4.59%","Difference from Open":"-0.48%","Change from Yesterday":"-8.24%","Change from Last Report":"0.00","Latest Volume":"19,974,943","Market Cap":"46,164,959,232","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":57.793808,"PB Ratio":17.500322,"Previous Close":148.09,"ROE":0.08663999,"DTE":36.865,"Industry":"Software - Application","Sector":"Technology","Beta":1.095,"Trailing PEG":0.934,"Trailing PE":247.07272,"Trailing PS":18.202433,"Quick Ratio":2.07,"Day High":136.71,"Day Low":130.89,"VS Average Volume":4.1942657137,"Company Summary":"Datadog, Inc. operates an observability and security platform for cloud applications in North America and internationally. The company's products comprise infrastructure and application performance monitoring, log management, digital experience monitoring, continuous profiler, database monitoring, data streams and universal service monitoring, network monitoring, incident management, workflow automation, observability pipelines, cloud cost and cloud security management, application security management, cloud SIEM, sensitive data scanner, and CI visibility. Datadog, Inc. was incorporated in 2010 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Airbnb, Inc.","Symbol":"ABNB","Current Price":"141.04","Latest MA":"131.28","Price Target":136.15028,"Difference from MA":"7.43%","Difference from Open":"1.00%","Change from Yesterday":"0.37%","Change from Last Report":"0.00","Latest Volume":"10,629,218","Market Cap":"88,117,837,824","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":33.356667,"PB Ratio":10.601322,"Previous Close":140.52,"ROE":0.20873,"DTE":26.614,"Industry":"Travel Services","Sector":"Consumer Cyclical","Beta":1.156,"Trailing PEG":20.7272,"Trailing PE":48.972218,"Trailing PS":8.128951,"Quick Ratio":1.008,"Day High":141.94,"Day Low":138.76,"VS Average Volume":2.4690625536,"Company Summary":"Airbnb, Inc., together with its subsidiaries, operates a platform that enables hosts to offer stays and experiences to guests worldwide. The company's marketplace connects hosts and guests online or through mobile devices to book spaces and experiences. It primarily offers private rooms, primary homes, and vacation homes. The company was formerly known as AirBed & Breakfast, Inc. and changed its name to Airbnb, Inc. in November 2010. Airbnb, Inc. was founded in 2007 and is headquartered in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Ventas, Inc.","Symbol":"VTR","Current Price":"64.94","Latest MA":"60.28","Price Target":71.26316,"Difference from MA":"7.73%","Difference from Open":"8.09%","Change from Yesterday":"8.34%","Change from Last Report":"0.00","Latest Volume":"3,842,788","Market Cap":"27,243,044,864","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":85.44737,"PB Ratio":2.7898784,"Previous Close":59.94,"ROE":-0.00543,"DTE":136.679,"Industry":"REIT - Healthcare Facilities","Sector":"Real Estate","Beta":1.39,"Trailing PEG":null,"Trailing PE":341.7895,"Trailing PS":5.679048,"Quick Ratio":1.095,"Day High":64.96,"Day Low":60.69,"VS Average Volume":1.437852748,"Company Summary":"Ventas, Inc. (NYSE: VTR) is a leading S&P 500 real estate investment trust enabling exceptional environments that benefit a large and growing aging population. With approximately 1,350 properties in North America and the United Kingdom, Ventas occupies an essential role in the longevity economy. The Company's growth is fueled by its over 800 senior housing communities, which provide valuable services to residents and enable them to thrive in supported environments. The Ventas portfolio also includes outpatient medical buildings, research centers and healthcare facilities. The Company aims to deliver outsized performance by leveraging its unmatched operational expertise, data-driven insights from its Ventas OI platform, extensive relationships and strong financial position. Ventas's seasoned team of talented professionals shares a commitment to excellence, integrity and a common purpose of helping people live longer, healthier, happier lives.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Cisco Systems, Inc.","Symbol":"CSCO","Current Price":"63.84","Latest MA":"54.23","Price Target":67.70375,"Difference from MA":"17.72%","Difference from Open":"-3.43%","Change from Yesterday":"2.09%","Change from Last Report":"0.00","Latest Volume":"43,068,977","Market Cap":"254,259,396,608","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":15.981015,"PB Ratio":5.6276445,"Previous Close":62.53,"ROE":0.20761,"DTE":70.647,"Industry":"Communication Equipment","Sector":"Technology","Beta":"N\/A","Trailing PEG":2.8084,"Trailing PE":28.0,"Trailing PS":4.7995205,"Quick Ratio":0.648,"Day High":66.5,"Day Low":62.72,"VS Average Volume":2.1748380561,"Company Summary":"Cisco Systems, Inc. designs, manufactures, and sells Internet Protocol based networking and other products related to the communications and information technology industry in the Americas, Europe, the Middle East, Africa, the Asia Pacific, Japan, and China. The company also offers switching portfolio encompasses campus switching as well as data center switching; enterprise routing portfolio interconnects public and private wireline and mobile networks, delivering highly secure, and reliable connectivity to campus, data center and branch networks; and wireless products include indoor and outdoor wireless coverage designed for seamless roaming use of voice, video, and data applications. In addition, it provides security, which comprising network security, identity and access management, secure access service edge, and threat intelligence, detection, and response offerings; collaboration products, such as Webex Suite, collaboration devices, contact center, and communication platform as a service; end-to-end collaboration solutions that can be delivered from the cloud, on-premise or within hybrid cloud environments allowing customers to transition their collaboration solutions from on-premise to the cloud; and observability offers network assurance, monitoring and analytics and observability suite. Further, the company offers a range of service and support options for its customers, including technical support and advanced services and advisory services. It serves businesses of various sizes, public institutions, governments, and service providers. The company sells its products and services directly, as well as through systems integrators, service providers, other resellers, and distributors. Cisco Systems, Inc. has strategic alliances with other companies. Cisco Systems, Inc. was incorporated in 1984 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Albemarle Corporation","Symbol":"ALB","Current Price":"79.25","Latest MA":"92.10","Price Target":109.82963,"Difference from MA":"-13.96%","Difference from Open":"-0.81%","Change from Yesterday":"3.46%","Change from Last Report":"0.00","Latest Volume":"4,565,608","Market Cap":"9,315,045,376","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":21.258389,"PB Ratio":1.163559,"Previous Close":76.6,"ROE":-0.17662,"DTE":35.334,"Industry":"Specialty Chemicals","Sector":"Basic Materials","Beta":1.551,"Trailing PEG":6.8405,"Trailing PE":"N\/A","Trailing PS":1.432648,"Quick Ratio":1.509,"Day High":83.03,"Day Low":74.95,"VS Average Volume":2.1770172875,"Company Summary":"Albemarle Corporation develops, manufactures, and markets engineered specialty chemicals worldwide. It operates through three segments: Energy Storage, Specialties and Ketjen. The Energy Storage segment offers lithium compounds, including lithium carbonate, lithium hydroxide, and lithium chloride; technical services for the handling and use of reactive lithium products; and lithium-containing by-products recycling services. The Specialties segment provides bromine-based specialty chemicals, including elemental bromine, alkyl and inorganic bromides, brominated powdered activated carbon, and other bromine fine chemicals; lithium specialties, such as butyllithium and lithium aluminum hydride; develops and manufactures cesium products for the chemical and pharmaceutical industries; and zirconium, barium, and titanium products for pyrotechnical applications that include airbag initiators. The Ketjen segment offers clean fuels technologies (CFT), which is composed of hydroprocessing catalysts (HPC) together with isomerization and akylation catalysts; fluidized catalytic cracking (FCC) catalysts and additives; and performance catalyst solutions (PCS), which is composed of organometallics and curatives. The company serves the energy storage, petroleum refining, consumer electronics, construction, automotive, lubricants, pharmaceuticals, and crop protection markets. Albemarle Corporation was founded in 1887 and is headquartered in Charlotte, North Carolina.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"CVS Health Corporation","Symbol":"CVS","Current Price":"66.37","Latest MA":"55.51","Price Target":69.1376,"Difference from MA":"19.57%","Difference from Open":"3.93%","Change from Yesterday":"4.98%","Change from Last Report":"0.00","Latest Volume":"20,916,133","Market Cap":"83,679,297,536","Earning Date":"2025-02-12","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":9.729547,"PB Ratio":1.1140766,"Previous Close":63.22,"ROE":0.06697,"DTE":110.116,"Industry":"Healthcare Plans","Sector":"Healthcare","Beta":0.543,"Trailing PEG":2.6144,"Trailing PE":18.13388,"Trailing PS":0.22785626,"Quick Ratio":0.542,"Day High":67.34,"Day Low":63.56,"VS Average Volume":1.540222104,"Company Summary":"CVS Health Corporation provides health solutions in the United States. It operates through Health Care Benefits, Health Services, and Pharmacy & Consumer Wellness segments. The Health Care Benefits segment offers traditional, voluntary, and consumer-directed health insurance products and related services. It serves employer groups, individuals, college students, part-time and hourly workers, health plans, health care providers, governmental units, government-sponsored plans, labor groups, and expatriates. The Health Services segment offers pharmacy benefit management solutions, including plan design and administration, formulary management, retail pharmacy network management, specialty and mail order pharmacy, clinical, disease management, and medical spend management services. It serves employers, insurance companies, unions, government employee groups, health plans, prescription drug plans, Medicaid managed care plans, CMS, plans offered on public health insurance, and other sponsors of health benefit plans. The Pharmacy & Consumer Wellness segment sells prescription and over-the-counter drugs, consumer health and beauty products, and personal care products. This segment also distributes prescription drugs; and provides related pharmacy consulting and other ancillary services to care facilities and other care settings. It operates online retail pharmacy websites, LTC pharmacies and on-site pharmacies, retail specialty pharmacy stores, compounding pharmacies and branches for infusion and enteral nutrition services. The company was formerly known as CVS Caremark Corporation and changed its name to CVS Health Corporation in September 2014. CVS Health Corporation was incorporated in 1996 and is headquartered in Woonsocket, Rhode Island.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Service Corporation Internation","Symbol":"SCI","Current Price":"81.48","Latest MA":"78.82","Price Target":88.05333,"Difference from MA":"3.37%","Difference from Open":"-0.63%","Change from Yesterday":"7.22%","Change from Last Report":"0.00","Latest Volume":"2,865,506","Market Cap":"11,784,371,200","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":18.908163,"PB Ratio":7.259444,"Previous Close":75.99,"ROE":0.31045,"DTE":296.598,"Industry":"Personal Services","Sector":"Consumer Cyclical","Beta":0.843,"Trailing PEG":1.6019,"Trailing PE":23.082153,"Trailing PS":2.8401878,"Quick Ratio":0.429,"Day High":83.76,"Day Low":80.77,"VS Average Volume":2.895412718,"Company Summary":"Service Corporation International provides deathcare products and services in the United States and Canada. Its funeral service and cemetery operations comprise funeral service locations, cemeteries, funeral service\/cemetery combination locations, crematoria, and other businesses. The company also provides professional services related to funerals and cremations, including the use of funeral home facilities and motor vehicles; arranging and directing services; and removal, preparation, embalming, cremation, memorialization, and travel protection, as well as catering services. In addition, it offers funeral merchandise, including burial caskets and related accessories, urns and other cremation receptacles, outer burial containers, flowers, online and video tributes, stationery products, casket and cremation memorialization products, and other ancillary merchandise. Further, the company's cemeteries provide cemetery property interment rights, such as developed lots, lawn crypts, mausoleum spaces, niches, and other cremation memorialization and interment options. It offers its products and services under the Dignity Memorial, Dignity Planning, National Cremation Society, Advantage Funeral and Cremation Services, Funeraria del Angel, Making Everlasting Memories, Neptune Society, and Trident Society brands. The company was incorporated in 1962 and is headquartered in Houston, Texas.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Corebridge Financial Inc.","Symbol":"CRBG","Current Price":"32.02","Latest MA":"29.85","Price Target":38.07692,"Difference from MA":"7.27%","Difference from Open":"2.96%","Change from Yesterday":"-2.26%","Change from Last Report":"0.00","Latest Volume":"4,833,195","Market Cap":"18,092,195,840","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":5.1256113,"PB Ratio":1.3515681,"Previous Close":32.76,"ROE":-0.113929994,"DTE":83.188,"Industry":"Asset Management","Sector":"Financial Services","Beta":0.753,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":1.132461,"Quick Ratio":0.234,"Day High":32.4,"Day Low":30.41,"VS Average Volume":1.456657815,"Company Summary":"Corebridge Financial, Inc. provides retirement solutions and insurance products in the United States. The company operates through Individual Retirement, Group Retirement, Life Insurance, and Institutional Markets segments. The Individual Retirement segment provides fixed annuities, fixed index annuities, variable annuities, and retail mutual funds. The Group Retirement segment offers record-keeping services, plan administration and compliance services, and financial planning and advisory solutions to employer-defined contribution plans and their participants, as well as proprietary and non-proprietary annuities, advisory services, and brokerage products. The Life Insurance segment offers term life and universal life insurance in the United States, as well as issues individual life, whole life, and group life insurance in the United Kingdom; and distributes medical insurance in Ireland. The Institutional Markets segment provides stable value wraps, structured settlement and pension risk transfer annuities, corporate and bank owned life insurance, private placement variable universal life and annuities products, and guaranteed investment contracts. The company was formerly known as SAFG Retirement Services, Inc. Corebridge Financial, Inc. was incorporated in 1998 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Antero Resources Corporation","Symbol":"AR","Current Price":"40.15","Latest MA":"30.94","Price Target":42.22727,"Difference from MA":"29.76%","Difference from Open":"3.59%","Change from Yesterday":"1.96%","Change from Last Report":"0.00","Latest Volume":"5,531,373","Market Cap":"12,493,235,200","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":11.744849,"PB Ratio":1.789136,"Previous Close":39.38,"ROE":0.0130900005,"DTE":59.551,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":3.378,"Trailing PEG":0.9129,"Trailing PE":286.78574,"Trailing PS":2.9241931,"Quick Ratio":0.261,"Day High":40.53,"Day Low":38.61,"VS Average Volume":1.3136568829,"Company Summary":"Antero Resources Corporation, an independent oil and natural gas company, engages in the development, production, exploration, and acquisition of natural gas, natural gas liquids (NGLs), and oil properties in the United States. It operates in three segments: Exploration and Development; Marketing; and Equity Method Investment in Antero Midstream. As of December 31, 2023, the company had approximately 515,000 net acres in the Appalachian Basin; and approximately 172,000 net acres in the Upper Devonian Shale. Its gathering and compression systems also comprise 631 miles of gas gathering pipelines in the Appalachian Basin. The company was formerly known as Antero Resources Appalachian Corporation and changed its name to Antero Resources Corporation in June 2013. Antero Resources Corporation was incorporated in 2002 and is headquartered in Denver, Colorado.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Tenet Healthcare Corporation","Symbol":"THC","Current Price":"133.57","Latest MA":"147.85","Price Target":172.16,"Difference from MA":"-9.66%","Difference from Open":"4.36%","Change from Yesterday":"5.85%","Change from Last Report":"0.00","Latest Volume":"2,526,630","Market Cap":"12,702,106,624","Earning Date":"2025-02-12","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":10.184134,"PB Ratio":3.3125017,"Previous Close":126.19,"ROE":0.59564996,"DTE":159.393,"Industry":"Medical Care Facilities","Sector":"Healthcare","Beta":2.15,"Trailing PEG":0.5854,"Trailing PE":4.0847096,"Trailing PS":0.6056698,"Quick Ratio":1.383,"Day High":134.43,"Day Low":125.15,"VS Average Volume":1.9237205804,"Company Summary":"Tenet Healthcare Corporation operates as a diversified healthcare services company in the United States. The company operates through two segments: Hospital Operations and Services, and Ambulatory Care. Its general hospitals offer acute care services, operating and recovery rooms, radiology and respiratory therapy services, clinical laboratories, and pharmacies. The company also provides intensive and critical care, and\/or coronary care units; cardiovascular, digestive disease, neurosciences, musculoskeletal, and obstetrics services; outpatient services, including physical therapy; tertiary care services, such as cardiothoracic surgery, complex spinal surgery, neonatal intensive care, and neurosurgery services; quaternary care services in heart and kidney transplants; and limb salvaging vascular procedure, acute level 1 trauma, intravascular stroke care, minimally invasive cardiac valve replacement, imaging, surgical robotic, and telemedicine access services. In addition, it offers a range of procedures and services, such as orthopedics, total joint replacement, and spinal and other musculoskeletal procedures; gastroenterology; pain management; otolaryngology; ophthalmology; and urology. It operates hospitals, ambulatory surgery centers, imaging centers, surgical hospitals, off-campus emergency departments, and micro-hospitals. Tenet Healthcare Corporation was founded in 1967 and is headquartered in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Williams Companies, Inc. (The)","Symbol":"WMB","Current Price":"57.46","Latest MA":"50.30","Price Target":57.505,"Difference from MA":"14.23%","Difference from Open":"8.07%","Change from Yesterday":"4.82%","Change from Last Report":"0.00","Latest Volume":"11,823,224","Market Cap":"70,044,319,744","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":24.413559,"PB Ratio":5.651618,"Previous Close":54.82,"ROE":0.20583001,"DTE":182.368,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":1.062,"Trailing PEG":9.1746,"Trailing PE":31.571426,"Trailing PS":6.757121,"Quick Ratio":0.406,"Day High":57.89,"Day Low":53.17,"VS Average Volume":1.6184440262,"Company Summary":"The Williams Companies, Inc., together with its subsidiaries, operates as an energy infrastructure company primarily in the United States. It operates through Transmission & Gulf of Mexico, Northeast G&P, West, and Gas & NGL Marketing Services segments. The Transmission & Gulf of Mexico segment comprises natural gas pipelines; Transco, Northwest pipeline, MountainWest, and related natural gas storage facilities; and natural gas gathering and processing, and crude oil production handling and transportation assets in the Gulf Coast region. The Northeast G&P segment engages in the midstream gathering, processing, and fractionation activities in the Marcellus Shale region primarily in Pennsylvania and New York, and the Utica Shale region of eastern Ohio. The West segment consists of gas gathering, processing, and treating operations in the Rocky Mountain region of Colorado and Wyoming, the Barnett Shale region of north-central Texas, the Eagle Ford Shale region of South Texas, the Haynesville Shale region of northwest Louisiana, the Mid-Continent region that includes the Anadarko and Permian basins, and the DJ Basin of Colorado; and operates natural gas liquid (NGL) fractionation and storage facilities in central Kansas near Conway. The Gas & NGL Marketing Services segment provides wholesale marketing, trading, storage, and transportation of natural gas for natural gas utilities, municipalities, power generators, and producers; asset management services; and transports and markets NGLs. The company owns and operates 33,000 miles of pipelines. The Williams Companies, Inc. was founded in 1908 and is headquartered in Tulsa, Oklahoma.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Dominion Energy, Inc.","Symbol":"D","Current Price":"56.71","Latest MA":"55.36","Price Target":58.48312,"Difference from MA":"2.43%","Difference from Open":"0.94%","Change from Yesterday":"1.39%","Change from Last Report":"0.00","Latest Volume":"4,066,475","Market Cap":"47,636,967,424","Earning Date":"2025-02-12","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":15.771791,"PB Ratio":1.8193775,"Previous Close":55.93,"ROE":0.085030004,"DTE":156.351,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.596,"Trailing PEG":2.1187,"Trailing PE":25.777271,"Trailing PS":3.264371,"Quick Ratio":0.381,"Day High":57.0,"Day Low":55.66,"VS Average Volume":0.8911200812,"Company Summary":"Dominion Energy, Inc. produces and distributes energy in the United States. It operates through three operating segments: Dominion Energy Virginia, Dominion Energy South Carolina, and Contracted Energy. The Dominion Energy Virginia segment generates, transmits, and distributes regulated electricity to approximately 2.8 million residential, commercial, industrial, and governmental customers in Virginia and North Carolina. The Dominion Energy South Carolina segment generates, transmits, and distributes electricity to approximately 0.8 million customers in the central, southern, and southwestern portions of South Carolina; and distributes natural gas to approximately 0.4 million residential, commercial, and industrial customers in South Carolina. The Contracted Energy segment is involved in the nonregulated long-term contracted renewable electric generation and renewable natural gas facility. As of December 31, 2023, the company's portfolio of assets included approximately 29.5 gigawatt of electric generating capacity; 10,600 miles of electric transmission lines; 79,300 miles of electric distribution lines; and 94,800 miles of gas distribution mains and related service facilities. The company was formerly known as Dominion Resources, Inc. Dominion Energy, Inc. was incorporated in 1983 and is headquartered in Richmond, Virginia.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"MGM Resorts International","Symbol":"MGM","Current Price":"40.37","Latest MA":"37.53","Price Target":48.98667,"Difference from MA":"7.57%","Difference from Open":"4.72%","Change from Yesterday":"17.46%","Change from Last Report":"0.00","Latest Volume":"16,488,522","Market Cap":"12,019,763,200","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":14.456476,"PB Ratio":3.708433,"Previous Close":34.37,"ROE":0.2901,"DTE":841.031,"Industry":"Resorts & Casinos","Sector":"Consumer Cyclical","Beta":2.241,"Trailing PEG":1.9047,"Trailing PE":16.820831,"Trailing PS":0.69794464,"Quick Ratio":1.062,"Day High":40.75,"Day Low":38.06,"VS Average Volume":3.9882084542,"Company Summary":"MGM Resorts International, through its subsidiaries, owns and operates casino, hotel, and entertainment resorts in the United States and internationally. The company operates through three segments: Las Vegas Strip Resorts, Regional Operations, and MGM China. Its casino resorts offer gaming, hotel, convention, dining, entertainment, retail, and other resort amenities. The company's casino operations include slots and table games, as well as online sports betting and iGaming through BetMGM. Its customers include premium gaming customers; leisure and wholesale travel customers; business travelers; and group customers, including conventions, trade associations, and small meetings. The company was formerly known as MGM MIRAGE and changed its name to MGM Resorts International in June 2010. MGM Resorts International was incorporated in 1986 and is based in Las Vegas, Nevada.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"The Kraft Heinz Company","Symbol":"KHC","Current Price":"29.25","Latest MA":"32.47","Price Target":33.37619,"Difference from MA":"-9.92%","Difference from Open":"3.30%","Change from Yesterday":"2.20%","Change from Last Report":"0.00","Latest Volume":"13,646,465","Market Cap":"35,368,222,720","Earning Date":"2025-02-12","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":10.1975355,"PB Ratio":0.73172563,"Previous Close":28.62,"ROE":0.027999999,"DTE":41.451,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.475,"Trailing PEG":0.7733,"Trailing PE":12.942478,"Trailing PS":1.3535485,"Quick Ratio":0.448,"Day High":29.32,"Day Low":28.08,"VS Average Volume":1.2996800435,"Company Summary":"The Kraft Heinz Company, together with its subsidiaries, manufactures and markets food and beverage products in North America and internationally. Its products include condiments and sauces, cheese and dairy products, meals, meats, refreshment beverages, coffee, and other grocery products under the Kraft, Oscar Mayer, Heinz, Philadelphia, Lunchables, Velveeta, Ore-Ida, Maxwell House, Kool-Aid, Jell-O, Heinz, ABC, Master, Quero, Kraft, Golden Circle, Wattie's, Pudliszki, and Plasmon brands. It sells its products through its own sales organizations, as well as through independent brokers, agents, and distributors to chain, wholesale, cooperative, and independent grocery accounts; convenience, value, and club stores; pharmacies and drug stores; mass merchants; foodservice distributors; institutions, including hotels, restaurants, bakeries, hospitals, health care facilities, and government agencies; and online through various e-commerce platforms and retailers. The company was formerly known as H.J. Heinz Holding Corporation and changed its name to The Kraft Heinz Company in July 2015. The Kraft Heinz Company was founded in 1869 and is based in Pittsburgh, Pennsylvania.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Paramount Global","Symbol":"PARA","Current Price":"10.81","Latest MA":"10.72","Price Target":12.75429,"Difference from MA":"0.80%","Difference from Open":"1.41%","Change from Yesterday":"1.60%","Change from Last Report":"0.00","Latest Volume":"7,815,618","Market Cap":"7,700,449,792","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":7.1865926,"PB Ratio":0.43361413,"Previous Close":10.64,"ROE":-0.30080998,"DTE":91.924,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.767,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.26675615,"Quick Ratio":0.938,"Day High":10.9,"Day Low":10.61,"VS Average Volume":0.7931918969,"Company Summary":"Paramount Global operates as a media, streaming, and entertainment company worldwide. It operates through TV Media, Direct-to-Consumer, and Filmed Entertainment segments. The TV Media segment operates CBS Television Network, a domestic broadcast television network; CBS Stations, a television station; and international free-to-air networks comprising Network 10, Channel 5, Telefe, and Chilevisión; domestic premium and basic cable networks, such as Paramount+ with Showtime, MTV, Comedy Central, Paramount Network, The Smithsonian Channel, Nickelodeon, BET Media Group, and CBS Sports Network; and international extensions of these brands. This segment also offers domestic and international television studio operations, including CBS Studios, Paramount Television Studios, and Showtime\/MTV Entertainment Studios; CBS Media Ventures, which produces and distributes first-run syndicated programming; and digital properties consisting of CBS News Streaming and CBS Sports HQ. The Direct-to-Consumer segment provides a portfolio of domestic and international pay and free streaming services, including Paramount+, Pluto TV, BET+, and Noggin. The Filmed Entertainment segment produces and acquires films, series, and short-form content for release and licensing around the world, including in theaters, on streaming services, on television, through digital home entertainment, and DVDs\/Blu-rays; and operates a portfolio consisting of Paramount Pictures, Paramount Players, Paramount Animation, Nickelodeon Studio, Awesomeness, and Miramax. It also offers production, distribution, and advertising solutions. The company was formerly known as ViacomCBS Inc. and changed its name to Paramount Global in February 2022. The company was founded in 1914 and is headquartered in New York, New York. Paramount Global is a subsidiary of National Amusements, Inc.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Biogen Inc.","Symbol":"BIIB","Current Price":"138.45","Latest MA":"178.52","Price Target":203.75,"Difference from MA":"-22.45%","Difference from Open":"4.77%","Change from Yesterday":"3.76%","Change from Last Report":"0.00","Latest Volume":"2,211,819","Market Cap":"20,174,796,800","Earning Date":"2025-02-12","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.5973015,"PB Ratio":1.2330999,"Previous Close":133.43,"ROE":0.1047,"DTE":40.656,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":-0.061,"Trailing PEG":null,"Trailing PE":12.38372,"Trailing PS":2.0999007,"Quick Ratio":0.68,"Day High":139.09,"Day Low":132.6,"VS Average Volume":1.4788385754,"Company Summary":"Biogen Inc. discovers, develops, manufactures, and delivers therapies for treating neurological and neurodegenerative diseases in the United States, Europe, Germany, Asia, and internationally. The company provides TECFIDERA, VUMERITY, AVONEX, PLEGRIDY, TYSABRI, and FAMPYRA for multiple sclerosis (MS); SPINRAZA for spinal muscular atrophy; ADUHELM to treat Alzheimer's disease; FUMADERM to treat plaque psoriasis; BENEPALI, an etanercept biosimilar referencing ENBREL; IMRALDI, an adalimumab biosimilar referencing HUMIRA; FLIXABI, an infliximab biosimilar referencing REMICADE; and BYOOVIZ, a ranibizumab biosimilar referencing LUCENTIS. It offers RITUXAN for treating non-Hodgkin's lymphoma, chronic lymphocytic leukemia (CLL), rheumatoid arthritis, two forms of ANCA-associated vasculitis, and pemphigus vulgaris; RITUXAN HYCELA for non-Hodgkin's lymphoma and CLL; GAZYVA to treat CLL and follicular lymphoma; OCREVUS for relapsing MS and primary progressive MS; LUNSUMIO to treat relapsed or refractory follicular lymphoma; glofitamab for non-Hodgkin's lymphoma; and other anti-CD20 therapies. In addition, the company is developing various products for the treatment of MS, Alzheimer's disease and dementia, neuromuscular disorders, Parkinson's disease and movement disorders, neuropsychiatry, genetic neurodevelopmental disorders, and biosimilars, which are under various stages of development. It has collaboration and license agreements with Acorda Therapeutics, Inc.; Alkermes Pharma Ireland Limited; Denali Therapeutics Inc.; Eisai Co., Ltd.; Genentech, Inc.; Neurimmune SubOne AG; Ionis Pharmaceuticals, Inc.; Samsung Bioepis Co., Ltd.; Sangamo Therapeutics, Inc.; and Sage Therapeutics, Inc., as well as collaboration with Fujirebio to potentially identify and develop blood-based biomarkers for tau pathology in the brain. The company was founded in 1978 and is headquartered in Cambridge, Massachusetts.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Exelon Corporation","Symbol":"EXC","Current Price":"42.97","Latest MA":"38.39","Price Target":43.33375,"Difference from MA":"11.93%","Difference from Open":"0.23%","Change from Yesterday":"0.19%","Change from Last Report":"0.00","Latest Volume":"7,264,662","Market Cap":"43,194,302,464","Earning Date":"2025-02-12","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":15.396854,"PB Ratio":1.6218767,"Previous Close":42.89,"ROE":0.0933,"DTE":173.221,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.61,"Trailing PEG":2.5433,"Trailing PE":17.538776,"Trailing PS":1.8842394,"Quick Ratio":0.579,"Day High":43.45,"Day Low":42.54,"VS Average Volume":1.1092279231,"Company Summary":"Exelon Corporation, a utility services holding company, engages in the energy distribution and transmission businesses in the United States and Canada. The company is involved in the purchase and regulated retail sale of electricity and natural gas, transmission and distribution of electricity, and distribution of natural gas to retail customers. It also offers support services, including legal, human resources, information technology, supply management, financial, engineering, customer operations, transmission and distribution planning, asset management, system operations, and power procurement services. It serves distribution utilities, municipalities, and financial institutions, as well as commercial, industrial, governmental, and residential customers. Exelon Corporation was incorporated in 1999 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"NiSource Inc","Symbol":"NI","Current Price":"39.60","Latest MA":"34.42","Price Target":40.47143,"Difference from MA":"15.07%","Difference from Open":"1.54%","Change from Yesterday":"2.06%","Change from Last Report":"0.00","Latest Volume":"4,458,615","Market Cap":"18,609,623,040","Earning Date":"2025-02-12","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":19.682985,"PB Ratio":2.214641,"Previous Close":38.8,"ROE":0.08756,"DTE":131.811,"Industry":"Utilities - Regulated Gas","Sector":"Utilities","Beta":0.507,"Trailing PEG":2.1958,"Trailing PE":24.444443,"Trailing PS":3.5183527,"Quick Ratio":0.207,"Day High":39.885,"Day Low":38.85,"VS Average Volume":1.2008556734,"Company Summary":"NiSource Inc., an energy holding company, operates as a regulated natural gas and electric utility company in the United States. It operates in two segments, Gas Distribution Operations and Electric Operations. The company distributes natural gas to approximately 3.3 million customers through approximately 55,000 miles of distribution main pipeline and the associated individual customer service lines; and 1,000 miles of transmission main pipeline in northern Indiana, Ohio, Pennsylvania, Virginia, Kentucky, and Maryland. It also generates, transmits, and distributes electricity to approximately 0.5 million customers in various counties in the northern part of Indiana, as well as engages in wholesale electric and transmission transactions. It owns and operates coal-fired electric generating stations in Wheatfield and Michigan City; combined cycle gas turbine in West Terre Haute; natural gas generating units in Wheatfield; hydro generating plants in Carroll County and White County; wind generating units in White County, Indiana; and solar generating units in Jasper County and White County. The company was formerly known as NIPSCO Industries, Inc. and changed its name to NiSource Inc. in April 1999. NiSource Inc. was founded in 1847 and is headquartered in Merrillville, Indiana.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Vertiv Holdings, LLC","Symbol":"VRT","Current Price":"109.28","Latest MA":"105.85","Price Target":141.04211,"Difference from MA":"3.24%","Difference from Open":"-3.29%","Change from Yesterday":"-1.76%","Change from Last Report":"0.00","Latest Volume":"14,368,407","Market Cap":"41,603,334,144","Earning Date":"2025-02-12","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":24.572987,"PB Ratio":22.611214,"Previous Close":111.24,"ROE":0.32963002,"DTE":172.427,"Industry":"Electrical Equipment & Parts","Sector":"Industrials","Beta":1.586,"Trailing PEG":1.0049,"Trailing PE":85.375,"Trailing PS":5.524424,"Quick Ratio":0.936,"Day High":114.5,"Day Low":105.82,"VS Average Volume":1.7349772888,"Company Summary":"Vertiv Holdings Co, together with its subsidiaries, designs, manufactures, and services critical digital infrastructure technologies and life cycle services for data centers, communication networks, and commercial and industrial environments in the Americas, the Asia Pacific, Europe, the Middle East, and Africa. It offers AC and DC power management products, switchgear and busbar products, thermal management products, integrated rack systems, modular solutions, and management systems for monitoring and controlling digital infrastructure that are integral to the technologies used for various services, including e-commerce, online banking, file sharing, video on-demand, energy storage, wireless communications, Internet of Things, and online gaming. The company also provides lifecycle management services, predictive analytics, and professional services for deploying, maintaining, and optimizing its products and their related systems; and preventative maintenance, acceptance testing, engineering and consulting, performance assessments, remote monitoring, training, spare parts, and digital critical infrastructure software services. It offers its products primarily under the Vertiv, Liebert, NetSure, Geist, E&I, Powerbar, and Avocent brands. The company serves cloud services, financial services, healthcare, transportation, manufacturing, energy, education, government, social media, and retail industries through a network of direct sales professionals, independent sales representatives, channel partners, and original equipment manufacturers. Vertiv Holdings Co is headquartered in Westerville, Ohio.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Reddit, Inc.","Symbol":"RDDT","Current Price":"204.95","Latest MA":"112.64","Price Target":200.6842,"Difference from MA":"81.95%","Difference from Open":"0.51%","Change from Yesterday":"-5.32%","Change from Last Report":"0.00","Latest Volume":"21,023,375","Market Cap":"35,984,711,680","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":51.689133,"PB Ratio":18.049318,"Previous Close":216.47,"ROE":-0.31801,"DTE":1.364,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":"N\/A","Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":32.06485,"Quick Ratio":11.834,"Day High":214.3,"Day Low":195.98,"VS Average Volume":3.6337584886,"Company Summary":"Reddit, Inc. operates a website that organizes digital communities. It organizes communities based on specific interests that enable users to engage in conversations by sharing experiences, submitting links, uploading images and videos, and replying to one another. The company was founded in 2005 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Pegasystems Inc.","Symbol":"PEGA","Current Price":"85.28","Latest MA":"81.60","Price Target":103.14167,"Difference from MA":"4.51%","Difference from Open":"-14.48%","Change from Yesterday":"-19.62%","Change from Last Report":"0.00","Latest Volume":"3,278,241","Market Cap":"7,313,083,904","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":23.604961,"PB Ratio":15.468891,"Previous Close":106.09,"ROE":0.38324,"DTE":123.241,"Industry":"Software - Application","Sector":"Technology","Beta":1.057,"Trailing PEG":1.003,"Trailing PE":60.914288,"Trailing PS":4.9393272,"Quick Ratio":1.056,"Day High":100.17,"Day Low":85.05,"VS Average Volume":5.159407357,"Company Summary":"Pegasystems Inc. develops, markets, licenses, hosts, and supports enterprise software in the United States, rest of the Americas, the United Kingdom, rest of Europe, the Middle East, Africa, and the Asia-Pacific. The company provides Pega Infinity, a software portfolio comprising of Pega Customer Decision Hub, a real-time AI-powered decision engine to enhance customer acquisition and experiences across inbound, outbound, and paid media channels; Pega Customer Service to anticipate customer needs, connect customers to people and systems, and automate customer interactions to evolve the customer service experience, as well as to allow enterprises to deliver interactions across channels and enhance employee productivity; and Pega Platform, an intelligent automation software for increasing efficiency of clients' processes and workflows. It also offers Situational Layer Cake that organizes logic into layers that map to the unique dimensions of a client's business, such as customer types, lines of business, geographies, etc.; Pega Express Methodology and low code that connects enterprise data and systems to customer experience channels; Pega Cloud that allows clients to develop, test, and deploy applications;  Pega Catalyst, which helps clients to transform and prototype their customer journeys; Pega Academy, which offers instructor-led and online training to its employees, clients, and partners; and global service assurance and client support services. It primarily markets its software and services to financial services, healthcare, communications and media, government, insurance, manufacturing and high tech, and consumer services markets through a direct sales force, as well as partnerships with technology providers and application developers. Pegasystems Inc. was incorporated in 1983 and is headquartered in Cambridge, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"The Trade Desk, Inc.","Symbol":"TTD","Current Price":"81.92","Latest MA":"113.63","Price Target":115.84848,"Difference from MA":"-27.90%","Difference from Open":"-3.49%","Change from Yesterday":"-32.98%","Change from Last Report":"0.00","Latest Volume":"55,623,693","Market Cap":"40,433,582,080","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":36.6818,"PB Ratio":15.395601,"Previous Close":122.23,"ROE":0.12891,"DTE":11.167,"Industry":"Software - Application","Sector":"Technology","Beta":1.47,"Trailing PEG":2.4036,"Trailing PE":105.02564,"Trailing PS":17.506624,"Quick Ratio":1.805,"Day High":85.18,"Day Low":80.655,"VS Average Volume":14.4388316485,"Company Summary":"The Trade Desk, Inc. operates as a technology company in the United States and internationally. The company offers a self-service cloud-based platform that allows buyers to plan, manage, optimize, and measure data-driven digital advertising campaigns across various ad formats and channels, including video, display, audio, digital-out-of-home, native, and social on various devices, such as computers, mobile devices, televisions, and streaming devices. It provides data and other value-added services. The company serves advertising agencies, brands, and other service providers for advertisers. The Trade Desk, Inc. was incorporated in 2009 and is headquartered in Ventura, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"GXO Logistics, Inc.","Symbol":"GXO","Current Price":"36.31","Latest MA":"51.36","Price Target":62.86267,"Difference from MA":"-29.31%","Difference from Open":"2.86%","Change from Yesterday":"-15.08%","Change from Last Report":"0.00","Latest Volume":"6,732,589","Market Cap":"4,338,427,904","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":10.176313,"PB Ratio":1.396646,"Previous Close":42.76,"ROE":0.03726,"DTE":175.963,"Industry":"Integrated Freight & Logistics","Sector":"Industrials","Beta":1.639,"Trailing PEG":1.0422,"Trailing PE":40.797756,"Trailing PS":0.39265344,"Quick Ratio":0.739,"Day High":37.16,"Day Low":34.51,"VS Average Volume":4.9289739304,"Company Summary":"GXO Logistics, Inc., together with its subsidiaries, provides logistics services worldwide. The company provides warehousing and distribution, order fulfilment, e-commerce, reverse logistics, and other supply chain services. As of December 31, 2023, it operated in approximately 974 facilities. The company serves various customers in the e-commerce, omnichannel retail, technology and consumer electronics, food and beverage, industrial and manufacturing, consumer packaged goods, and others. GXO Logistics, Inc. was incorporated in 2021 and is headquartered in Greenwich, Connecticut.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Fidelity National Information S","Symbol":"FIS","Current Price":"70.53","Latest MA":"81.93","Price Target":86.63462,"Difference from MA":"-13.92%","Difference from Open":"-2.81%","Change from Yesterday":"-2.82%","Change from Last Report":"0.00","Latest Volume":"5,089,995","Market Cap":"37,970,104,320","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":11.248965,"PB Ratio":2.311398,"Previous Close":72.58,"ROE":0.03034,"DTE":66.387,"Industry":"Information Technology Services","Sector":"Technology","Beta":1.074,"Trailing PEG":0.5506,"Trailing PE":49.669014,"Trailing PS":3.7852762,"Quick Ratio":0.661,"Day High":72.88,"Day Low":70.24,"VS Average Volume":1.6051561197,"Company Summary":"Fidelity National Information Services, Inc. engages in the provision of financial services technology solutions for financial institutions, businesses, and developers worldwide. It operates through Banking Solutions, Capital Market Solutions, and Corporate and Other segments. The company provides core processing and ancillary applications; mobile and online banking; fraud, risk management, and compliance; card and retail payment; electronic funds transfer and network; wealth and retirement; and item processing and output solutions. It also offers trading and asset, lending, leveraged and syndicated loan markets, and treasury and risk solutions. The company was founded in 1968 and is headquartered in Jacksonville, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Coca-Cola Company (The)","Symbol":"KO","Current Price":"69.50","Latest MA":"65.84","Price Target":73.7932,"Difference from MA":"5.56%","Difference from Open":"0.72%","Change from Yesterday":"1.15%","Change from Last Report":"0.00","Latest Volume":"19,506,669","Market Cap":"298,988,994,560","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":21.761524,"PB Ratio":11.295303,"Previous Close":68.71,"ROE":0.3723,"DTE":167.358,"Industry":"Beverages - Non-Alcoholic","Sector":"Consumer Defensive","Beta":0.62,"Trailing PEG":2.8252,"Trailing PE":28.252031,"Trailing PS":6.4484534,"Quick Ratio":0.784,"Day High":69.61,"Day Low":68.762,"VS Average Volume":1.1063771899,"Company Summary":"The Coca-Cola Company, a beverage company, manufactures, markets, and sells various nonalcoholic beverages worldwide. The company provides sparkling soft drinks, sparkling flavors; water, sports, coffee, and tea; juice, value-added dairy, and plant-based beverages; and other beverages. It also offers beverage concentrates and syrups, as well as fountain syrups to fountain retailers, such as restaurants and convenience stores. The company sells its products under the Coca-Cola, Diet Coke\/Coca-Cola Light, Coca-Cola Zero Sugar, caffeine free Diet Coke, Cherry Coke, Fanta Orange, Fanta Zero Orange, Fanta Zero Sugar, Fanta Apple, Sprite, Sprite Zero Sugar, Simply Orange, Simply Apple, Simply Grapefruit, Fresca, Schweppes, Thums Up, Aquarius, Ayataka, BODYARMOR, Ciel, Costa, Dasani, dogadan, FUZE TEA, Georgia, glacéau smartwater, glacéau vitaminwater, Gold Peak, Ice Dew, I LOHAS, Powerade, Topo Chico, AdeS, Del Valle, fairlife, innocent, Minute Maid, and Minute Maid Pulpy brands. It operates through a network of independent bottling partners, distributors, wholesalers, and retailers, as well as through bottling and distribution operators. The company was founded in 1886 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Eversource Energy (D\/B\/A)","Symbol":"ES","Current Price":"62.50","Latest MA":"61.85","Price Target":69.48412,"Difference from MA":"1.06%","Difference from Open":"4.52%","Change from Yesterday":"4.66%","Change from Last Report":"0.00","Latest Volume":"4,390,213","Market Cap":"22,937,499,648","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":12.398433,"PB Ratio":1.5117433,"Previous Close":59.72,"ROE":-0.03491,"DTE":187.768,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.622,"Trailing PEG":2.0758,"Trailing PE":27.53304,"Trailing PS":1.9733628,"Quick Ratio":0.326,"Day High":63.47,"Day Low":59.7317,"VS Average Volume":1.7491655013,"Company Summary":"Eversource Energy, a public utility holding company, engages in the energy delivery business. The company operates through Electric Distribution, Electric Transmission, Natural Gas Distribution, and Water Distribution segments. It is involved in the transmission and distribution of electricity; solar power facilities; and distribution of natural gas. The company operates regulated water utilities that provide water services to approximately 241,000 customers. It serves residential, commercial, industrial, municipal and fire protection, and other customers in Connecticut, Massachusetts, and New Hampshire. The company was formerly known as Northeast Utilities and changed its name to Eversource Energy in April 2015. Eversource Energy was incorporated in 1927 and is headquartered in Springfield, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Royalty Pharma plc","Symbol":"RPRX","Current Price":"32.46","Latest MA":"27.61","Price Target":40.36444,"Difference from MA":"17.57%","Difference from Open":"-0.03%","Change from Yesterday":"0.37%","Change from Last Report":"0.00","Latest Volume":"3,978,671","Market Cap":"18,711,662,592","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":6.6248546,"PB Ratio":2.1075184,"Previous Close":32.34,"ROE":0.17276,"DTE":74.157,"Industry":"Biotechnology","Sector":"Healthcare","Beta":0.466,"Trailing PEG":7.018,"Trailing PE":16.994764,"Trailing PS":8.257564,"Quick Ratio":1.532,"Day High":32.6262,"Day Low":32.13,"VS Average Volume":1.0653924993,"Company Summary":"Royalty Pharma plc operates as a buyer of biopharmaceutical royalties and a funder of innovations in the biopharmaceutical industry in the United States. It is also involved in the identification, evaluation, and acquisition of royalties on various biopharmaceutical therapies. In addition, the company collaborates with innovators from academic institutions, research hospitals and not-for-profits, small and mid-cap biotechnology companies, and pharmaceutical companies. Its portfolio consists of royalties on approximately 35 commercial products and 14 development-stage product candidates that address various therapeutic areas, such as rare disease, cancer, neuroscience, immunology, respiratory, infectious disease, hematology, and diabetes. The company was founded in 1996 and is based in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Super Micro Computer, Inc.","Symbol":"SMCI","Current Price":"42.28","Latest MA":"43.78","Price Target":47.51909,"Difference from MA":"-3.43%","Difference from Open":"8.40%","Change from Yesterday":"6.55%","Change from Last Report":"0.00","Latest Volume":"109,701,449","Market Cap":"24,757,686,272","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":11.297985,"PB Ratio":4.536481,"Previous Close":39.68,"ROE":0.32469,"DTE":39.749,"Industry":"Computer Hardware","Sector":"Technology","Beta":1.279,"Trailing PEG":null,"Trailing PE":21.034826,"Trailing PS":1.6568245,"Quick Ratio":1.805,"Day High":43.2896,"Day Low":37.51,"VS Average Volume":1.5028340377,"Company Summary":"Super Micro Computer, Inc., together with its subsidiaries, develops and manufactures high performance server and storage solutions based on modular and open architecture in the United States, Europe, Asia, and internationally. Its solutions range from complete server, storage systems, modular blade servers, blades, workstations, full racks, networking devices, server sub-systems, server management software, and security software. The company provides application-optimized server solutions, rackmount and blade servers, storage, and subsystems and accessories; and server software management solutions, such as Server Management Suite, including Supermicro Server Manager, Supermicro Power Management software, Supermicro Update Manager, SuperCloud Composer, and SuperDoctor 5. In addition, it offers server subsystems and accessories comprising server boards, chassis, power supplies, and other accessories. Further, the company provides server and storage system integration, configuration, and software upgrade and update services; and technical documentation services, as well as identifies service requirements, creates and executes project plans, and conducts verification testing and technical documentation, and training services. Additionally, it offers help desk and on-site product support services for its server and storage systems; and customer support services, including ongoing maintenance and technical support for its products. The company provides its products to enterprise data centers, cloud computing, artificial intelligence, and 5G and edge computing markets. It sells its products through direct and indirect sales force, distributors, value-added resellers, system integrators, and original equipment manufacturers. The company was incorporated in 1993 and is headquartered in San Jose, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Energy Transfer LP","Symbol":"ET","Current Price":"19.82","Latest MA":"17.09","Price Target":22.67294,"Difference from MA":"16.00%","Difference from Open":"0.41%","Change from Yesterday":"0.87%","Change from Last Report":"0.00","Latest Volume":"12,362,035","Market Cap":"68,004,397,056","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":13.304424,"PB Ratio":2.1644645,"Previous Close":19.65,"ROE":0.15253,"DTE":128.9,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":1.643,"Trailing PEG":0.6831,"Trailing PE":15.484375,"Trailing PS":0.81284696,"Quick Ratio":0.835,"Day High":19.91,"Day Low":19.55,"VS Average Volume":0.749249389,"Company Summary":"Energy Transfer LP provides energy-related services. The company owns and operates natural gas transportation pipeline, and natural gas storage facilities in Texas and Oklahoma; and approximately 20,090 miles of interstate natural gas pipeline. It also sells natural gas to electric utilities, independent power plants, local distribution and other marketing companies, and industrial end-users. In addition, the company owns and operates natural gas gathering pipelines, processing plant, and treating and conditioning facilities in Texas, New Mexico, West Virginia, Pennsylvania, Ohio, Oklahoma, Arkansas, Kansas, Montana, North Dakota, Wyoming, and Louisiana; natural gas gathering, oil pipeline, and oil stabilization facilities in South Texas; and transports and supplies water to natural gas producer in Pennsylvania. Further, it owns 5,700 miles of natural gas liquid (NGL) pipeline; NGL fractionation facilities; NGL storage facilities; and other NGL storage assets and terminal. Additionally, the company provides crude oil transportation, terminalling, acquisition, and marketing activities; owns and operates approximately 14,500 miles of crude oil trunk and gathering pipelines in the Southwest, Midcontinent, and Midwest United States; and sells and distributes gasoline, middle distillate, and motor fuels and other petroleum products. It also offers natural gas compression services; carbon dioxide and hydrogen sulfide removal services; and manages coal and natural resources properties, as well as sells standing timber, leases coal-related infrastructure facilities, collects oil and gas royalty, and generate electrical power. The company was formerly known as Energy Transfer Equity, L.P. and changed its name to Energy Transfer LP in October 2018. Energy Transfer LP was founded in 1996 and is headquartered in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"GlobalFoundries Inc.","Symbol":"GFS","Current Price":"42.82","Latest MA":"43.25","Price Target":47.79,"Difference from MA":"-0.98%","Difference from Open":"-1.68%","Change from Yesterday":"-1.68%","Change from Last Report":"0.00","Latest Volume":"3,881,800","Market Cap":"23,664,685,056","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":17.34179,"PB Ratio":2.0519454,"Previous Close":43.55,"ROE":0.066479996,"DTE":24.599,"Industry":"Semiconductors","Sector":"Technology","Beta":1.527,"Trailing PEG":1.6912,"Trailing PE":"N\/A","Trailing PS":3.493458,"Quick Ratio":1.74,"Day High":44.8,"Day Low":42.4101,"VS Average Volume":2.1556322264,"Company Summary":"GlobalFoundries Inc., a semiconductor foundry, provides range of mainstream wafer fabrication services and technologies worldwide. It manufactures various semiconductor devices, including microprocessors, mobile application processors, baseband processors, network processors, radio frequency modems, microcontrollers, and power management units. GlobalFoundries Inc. has a strategic partnership with Efficient Computer to develop high-performance computer processors. The company was incorporated in 2008 and is headquartered in Malta, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Carrier Global Corporation","Symbol":"CARR","Current Price":"63.67","Latest MA":"71.63","Price Target":77.88368,"Difference from MA":"-11.12%","Difference from Open":"-0.58%","Change from Yesterday":"0.11%","Change from Last Report":"0.00","Latest Volume":"5,646,420","Market Cap":"55,287,205,888","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":18.644217,"PB Ratio":3.8903825,"Previous Close":63.6,"ROE":0.13931,"DTE":85.607,"Industry":"Building Products & Equipment","Sector":"Industrials","Beta":1.212,"Trailing PEG":1.191,"Trailing PE":52.188522,"Trailing PS":2.229233,"Quick Ratio":0.513,"Day High":64.04,"Day Low":63.22,"VS Average Volume":1.0731276589,"Company Summary":"Carrier Global Corporation provides heating, ventilating, and air conditioning (HVAC), refrigeration, fire, security, and building automation technologies in the United States, Europe, the Asia Pacific, and internationally. It operates through three segments: HVAC, Refrigeration, and Fire & Security. The HVAC segment provides products, controls, services, and solutions to meet the heating, cooling, and ventilation needs of residential and commercial customers. Its products include air conditioners, heating systems, heat pumps, controls, and aftermarket components, as well as aftermarket repair and maintenance services and building automation solutions. The Refrigeration segment offers transport refrigeration and monitoring products and services, as well as digital solutions for trucks, trailers, shipping containers, intermodal applications, food retail, and warehouse cooling; and commercial refrigeration solutions, such as refrigerated cabinets, freezers, systems, and controls. The Fire & Security segment provides various residential, commercial, and industrial technologies, including fire, flame, gas, smoke, and carbon monoxide detection; portable fire extinguishers; fire suppression systems; intruder alarms; access control systems; video management systems; and electronic controls. This segment also offers fire and security service, such as audit, design, installation, and system integration, as well as aftermarket maintenance and repair and monitoring services. It offers its products under the Autronica, Det-Tronics, Edwards, Aritech, Fireye, GST, Kidde, LenelS2, Marioff, Onity, and Supra; Carrier, Toshiba, Automated Logic, Bryant, CIAT, Day & Night, Heil, NORESCO, and Riello; and Carrier Commercial Refrigeration, Carrier Transicold, and Sensitech brands. Carrier Global Corporation was incorporated in 2019 and is headquartered in Palm Beach Gardens, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Zillow Group, Inc.","Symbol":"Z","Current Price":"78.71","Latest MA":"66.58","Price Target":85.0,"Difference from MA":"18.21%","Difference from Open":"1.63%","Change from Yesterday":"0.64%","Change from Last Report":"0.00","Latest Volume":"5,695,240","Market Cap":"18,888,196,096","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":33.304703,"PB Ratio":3.9447703,"Previous Close":78.21,"ROE":-0.028959999,"DTE":25.0,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":2.017,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":8.760758,"Quick Ratio":2.689,"Day High":78.95,"Day Low":76.745,"VS Average Volume":2.0906653432,"Company Summary":"Zillow Group, Inc. operates real estate brands in mobile applications and Websites in the United States. The company offers premier agent and rentals marketplaces, new construction marketplaces, advertising, display advertising, and business technology solutions, as well as dotloop and floor plans. It also provides mortgage originations and the sale of mortgages, and advertising to mortgage lenders and other mortgage professionals; and title and escrow services. In addition, the company's brand portfolio includes Zillow Premier Agent, Zillow Home Loans, Zillow Rentals, Trulia, StreetEasy, HotPads, and Out East; and a suite of marketing software and technology solutions for the real estate industry, including ShowingTime+, Spruce, and Follow Up Boss. Zillow Group, Inc. was incorporated in 2004 and is headquartered in Seattle, Washington.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"Shopify Inc.","Symbol":"SHOP","Current Price":"127.65","Latest MA":"89.54","Price Target":130.78761,"Difference from MA":"42.56%","Difference from Open":"5.50%","Change from Yesterday":"5.94%","Change from Last Report":"0.00","Latest Volume":"10,469,340","Market Cap":"165,221,220,352","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":66.76011,"PB Ratio":16.296438,"Previous Close":120.49,"ROE":0.15031,"DTE":11.277,"Industry":"Software - Application","Sector":"Technology","Beta":2.365,"Trailing PEG":null,"Trailing PE":82.35484,"Trailing PS":20.119486,"Quick Ratio":5.62,"Day High":127.99,"Day Low":120.1,"VS Average Volume":1.413418412,"Company Summary":"Shopify Inc., a commerce company, provides a commerce platform and services in Canada, the United States, Europe, the Middle East, Africa, the Asia Pacific, Australia, China, and Latin America. The company's platform enables merchants to displays, manages, markets, and sells its products through various sales channels, including web and mobile storefronts, physical retail locations, pop-up shops, social media storefronts, native mobile apps, buy buttons, and marketplaces; and enables to manage products and inventory, process orders and payments, fulfill and ship orders, new buyers and build customer relationships, source products, leverage analytics and reporting, manage cash, payments and transactions, and access financing. It also sells custom themes and apps, and registration of domain names; and merchant solutions, which include accepting payments, shipping, and securing working capital. The company was formerly known as Jaded Pixel Technologies Inc. and changed its name to Shopify Inc. in November 2011. Shopify Inc. was incorporated in 2004 and is headquartered in Ottawa, Canada.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:52"},{"Company Name":"DoorDash, Inc.","Symbol":"DASH","Current Price":"205.64","Latest MA":"152.16","Price Target":215.60675,"Difference from MA":"35.15%","Difference from Open":"2.31%","Change from Yesterday":"2.36%","Change from Last Report":"0.00","Latest Volume":"5,523,415","Market Cap":"85,422,030,848","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":34.264256,"PB Ratio":11.279688,"Previous Close":200.89,"ROE":-0.02517,"DTE":7.02,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.671,"Trailing PEG":null,"Trailing PE":685.4666,"Trailing PS":8.414306,"Quick Ratio":1.364,"Day High":205.999,"Day Low":195.62,"VS Average Volume":1.936989619,"Company Summary":"DoorDash, Inc., together with its subsidiaries, operates a commerce platform that connects merchants, consumers, and independent contractors in the United States and internationally. The company operates DoorDash Marketplace and Wolt Marketplace, which provide various services, such as customer acquisition, demand generation, order fulfillment, merchandising, payment processing, and customer support. It also offers membership products, including DashPass and Wolt+; DoorDash Drive and Wolt Drive, which are white-label delivery fulfillment services that enable merchants that have generated consumer demand through their channels to fulfill demand using its platform; DoorDash Storefront that enables merchants to offer consumers on-demand access to e-commerce; and Bbot, which offers merchants digital ordering and payment solutions for in-store and online channels. In addition, the company enables merchants to advertise and promote on its platform to acquire consumers. The company was formerly known as Palo Alto Delivery Inc. and changed its name to DoorDash, Inc. in 2015. DoorDash, Inc. was founded in 2013 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:58"},{"Company Name":"Exelixis, Inc.","Symbol":"EXEL","Current Price":"34.49","Latest MA":"30.00","Price Target":36.88522,"Difference from MA":"14.98%","Difference from Open":"4.77%","Change from Yesterday":"5.15%","Change from Last Report":"0.00","Latest Volume":"3,457,470","Market Cap":"9,653,095,424","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":12.131424,"PB Ratio":4.331826,"Previous Close":32.8,"ROE":0.202,"DTE":8.545,"Industry":"Biotechnology","Sector":"Healthcare","Beta":0.511,"Trailing PEG":2.2685,"Trailing PE":19.596592,"Trailing PS":4.6373487,"Quick Ratio":3.732,"Day High":34.6,"Day Low":32.84,"VS Average Volume":1.5239597645,"Company Summary":"Exelixis, Inc., an oncology company, focuses on the discovery, development, and commercialization of new medicines for difficult-to-treat cancers in the United States. The company offers CABOMETYX tablets for the treatment of patients with advanced renal cell carcinoma who received prior anti-angiogenic therapy; and COMETRIQ capsules for the treatment of progressive and metastatic medullary thyroid cancer. Its CABOMETYX and COMETRIQ are derived from cabozantinib, an inhibitor of multiple tyrosine kinases, including MET, AXL, RET, and VEGF receptors. The company also offers COTELLIC, an inhibitor of MEK as a combination regimen to treat specific forms of advanced melanoma; and MINNEBRO, an oral non-steroidal selective blocker of the mineralocorticoid receptor for the treatment of hypertension in Japan. It develops zanzalintinib, a novel, potent, next-generation oral tyrosine kinase inhibitor (TKI) that targets VEGF receptors, MET and the TAM kinases (TYRO3, AXL and MER); and XB002, a next-generation tissue factor (TF)-targeting ADC, administered via intravenous infusion and composed of a human monoclonal antibody (mAb) against TF that is conjugated to an auristatin-based microtubulin inhibitor (MTI) payload. It has research collaborations and license agreements with Ipsen Pharma SAS; Takeda Pharmaceutical Company Ltd.; F. Hoffmann-La Roche Ltd.; Redwood Bioscience, Inc.; R.P. Scherer Technologies, LLC; Catalent Pharma Solutions, Inc.; NBE Therapeutics AG; Aurigene Discovery Technologies Limited; Iconic Therapeutics, Inc.; Invenra, Inc.; StemSynergy Therapeutics, Inc.; Genentech, Inc.; Bristol-Myers Squibb Company; and Daiichi Sankyo Company, Limited, as well as clinical development agreement and collaboration with Sairopa B.V. and Merck & Co., Inc. The company was formerly known as Exelixis Pharmaceuticals, Inc. and changed its name to Exelixis, Inc. in February 2000. Exelixis, Inc. was incorporated in 1994 and is headquartered in Alameda, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:58"},{"Company Name":"Gilead Sciences, Inc.","Symbol":"GILD","Current Price":"105.96","Latest MA":"85.38","Price Target":104.77481,"Difference from MA":"24.10%","Difference from Open":"1.06%","Change from Yesterday":"2.57%","Change from Last Report":"0.00","Latest Volume":"8,709,531","Market Cap":"132,054,761,472","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":12.946486,"PB Ratio":7.1464224,"Previous Close":103.31,"ROE":0.00561,"DTE":126.415,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.192,"Trailing PEG":0.5978,"Trailing PE":278.8421,"Trailing PS":4.666411,"Quick Ratio":0.962,"Day High":106.43,"Day Low":103.82,"VS Average Volume":1.2356656134,"Company Summary":"Gilead Sciences, Inc., a biopharmaceutical company, discovers, develops, and commercializes medicines in the areas of unmet medical need in the United States, Europe, and internationally. The company provides Biktarvy, Genvoya, Descovy, Odefsey, Truvada, Complera\/ Eviplera, Stribild, Sunlencs, and Atripla products for the treatment of HIV\/AIDS; Veklury, an injection for intravenous use, for the treatment of COVID-19; and Epclusa, Harvoni, Vemlidy, and Viread for the treatment of viral hepatitis. It also offers Yescarta, Tecartus, and Trodelvy products for the treatment of oncology; Letairis, an oral formulation for the treatment of pulmonary arterial hypertension; and AmBisome, a liposomal formulation for the treatment of serious invasive fungal infections. The company has collaboration agreements with Arcus Biosciences, Inc.; Merck Sharp & Dohme Corp.; Pionyr Immunotherapeutics Inc.; Tizona Therapeutics, Inc.; Galapagos NV; Janssen Sciences Ireland Unlimited Company; Japan Tobacco, Inc.; Dragonfly Therapeutics, Inc.; Arcellx, Inc.; Everest Medicines; Merck & Co, Inc.; Tentarix Biotherapeutics Inc.; Marengo Therapeutics; and Assembly Biosciences, Inc. It also has research collaboration, option, and license agreement with Merus N.V. for the discovery of novel dual tumor-associated antigens (TAA) targeting trispecific antibodies. The company has a collaboration with Terray Therapeutics, Inc. to discover and develop small molecule therapies; and LEO Pharma to develop, manufacture, and commercialize the small molecule oral STAT6 program. The company was incorporated in 1987 and is headquartered in Foster City, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:58"},{"Company Name":"American International Group, I","Symbol":"AIG","Current Price":"76.40","Latest MA":"74.26","Price Target":83.45667,"Difference from MA":"2.89%","Difference from Open":"-0.95%","Change from Yesterday":"-0.60%","Change from Last Report":"0.00","Latest Volume":"2,692,940","Market Cap":"46,306,037,760","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":9.832943,"PB Ratio":1.0691595,"Previous Close":76.86,"ROE":0.085,"DTE":22.306,"Industry":"Insurance - Diversified","Sector":"Financial Services","Beta":1.069,"Trailing PEG":1.0977,"Trailing PE":"N\/A","Trailing PS":1.0222309,"Quick Ratio":0.232,"Day High":77.25,"Day Low":75.05,"VS Average Volume":0.669725138,"Company Summary":"American International Group, Inc. offers insurance products for commercial, institutional, and individual customers in North America and internationally. It operates through three segments: General Insurance, Life and Retirement, and Other Operations. The General Insurance segment provides commercial and industrial property insurance, including business interruption and package insurance that cover exposure to made and natural disasters; general liability, environmental, commercial automobile liability, workers' compensation, excess casualty, and crisis management insurance products; and professional liability insurance. This segment offers marine, energy-related property insurance, aviation, political risk, trade credit, trade finance, and portfolio solutions, as well as operates reinsurance business; voluntary and sponsor-paid personal accident, and supplemental health products; and personal auto and personal property insurance. Its Life and Retirement segment offers individual retirement products, including variable, fixed index, and fixed annuities, as well as retail mutual funds; group retirement products comprising record-keeping, plan administrative and compliance services, financial planning, and advisory solutions; life insurance, including term and universal life insurance; and institutional markets products, which includes wrap products, structured settlement, pension risk transfer annuities, corporate and bank-owned life insurance, high net worth, and guaranteed investment contract products. It distributes its products through a network of brokers, agents, advisors, banks, and other distributors. The company was founded in 1919 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:58"},{"Company Name":"Lyft, Inc.","Symbol":"LYFT","Current Price":"13.47","Latest MA":"13.45","Price Target":17.68605,"Difference from MA":"0.17%","Difference from Open":"1.13%","Change from Yesterday":"1.66%","Change from Last Report":"0.00","Latest Volume":"28,932,597","Market Cap":"5,630,527,488","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":9.607567,"PB Ratio":8.519924,"Previous Close":13.25,"ROE":-0.1161,"DTE":189.385,"Industry":"Software - Application","Sector":"Technology","Beta":2.041,"Trailing PEG":null,"Trailing PE":224.50002,"Trailing PS":1.031171,"Quick Ratio":0.58,"Day High":13.48,"Day Low":12.7901,"VS Average Volume":1.745243026,"Company Summary":"Lyft, Inc. operates a peer-to-peer marketplace for on-demand ridesharing in the United States and Canada. It operates multimodal transportation networks that offer access to various transportation options through the Lyft platform and mobile-based applications. The company's platform provides a ridesharing marketplace, which connects drivers with riders; Express Drive, a car rental program for drivers; and a network of shared bikes and scooters in various cities to address the needs of riders for short trips. It also offers centralized tools and enterprise transportation solutions, such as concierge transportation solutions for organizations; Lyft Pink subscription plans; Lyft Pass commuter programs; first-mile and last-mile services; and university safe rides programs. The company was formerly known as Zimride, Inc. and changed its name to Lyft, Inc. in April 2013. Lyft, Inc. was incorporated in 2007 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:58"},{"Company Name":"Arista Networks, Inc.","Symbol":"ANET","Current Price":"109.75","Latest MA":"99.17","Price Target":113.53698,"Difference from MA":"10.67%","Difference from Open":"0.03%","Change from Yesterday":"0.10%","Change from Last Report":"0.00","Latest Volume":"7,800,530","Market Cap":"138,258,661,376","Earning Date":"2025-02-10","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":44.403,"PB Ratio":3.7373154,"Previous Close":109.64,"ROE":0.33833998,"DTE":0.755,"Industry":"Computer Hardware","Sector":"Technology","Beta":1.077,"Trailing PEG":2.5468,"Trailing PE":52.764423,"Trailing PS":20.906635,"Quick Ratio":3.516,"Day High":111.47,"Day Low":108.66,"VS Average Volume":0.9723109638,"Company Summary":"Arista Networks Inc engages in the development, marketing, and sale of data-driven, client to cloud networking solutions for data center, campus, and routing environments in the Americas, Europe, the Middle East, Africa, and the Asia-Pacific. Its cloud networking solutions consist of Extensible Operating System (EOS), a publish-subscribe state-sharing networking operating system offered in combination with a set of network applications. The company offers data center and cloud networking systems, including newer artificial intelligence (AI) ethernet switching platforms; campus wired and wireless products, and routing systems addressing Core Routing, Edge Routing, Data Center Interconnect (DCI), Multi-cloud and Wide Area Networking (WAN) use cases; and a suite of value-add software solutions that leverage EOS to provide end-to-end orchestration, automation, analytics, network monitoring, and security. It also provides post contract customer support services, such as technical support, hardware repair and replacement parts beyond standard warranty, bug fixes, patches, and upgrade services. The company serves a range of industries comprising internet companies, service providers, financial services organizations, government agencies, media and entertainment companies, telecommunication service providers, and others. It markets and sells its products through distributors, system integrators, value-added resellers, and original equipment manufacturer partners, as well as through its direct sales force. The company was formerly known as Arastra, Inc. and changed its name to Arista Networks Inc in October 2008. Arista Networks Inc was incorporated in 2004 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:58"},{"Company Name":"Coty Inc.","Symbol":"COTY","Current Price":"5.75","Latest MA":"8.23","Price Target":8.68095,"Difference from MA":"-30.13%","Difference from Open":"0.52%","Change from Yesterday":"1.23%","Change from Last Report":"0.00","Latest Volume":"9,054,194","Market Cap":"5,013,959,680","Earning Date":"2025-02-10","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":10.457208,"PB Ratio":1.303855,"Previous Close":5.68,"ROE":0.04405,"DTE":94.436,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":1.914,"Trailing PEG":0.1949,"Trailing PE":"Infinity","Trailing PS":0.81552994,"Quick Ratio":0.391,"Day High":5.76,"Day Low":5.64,"VS Average Volume":1.6827480207,"Company Summary":"Coty Inc., together with its subsidiaries, manufactures, markets, distributes, and sells beauty products worldwide. It operates through Prestige and Consumer Beauty segments. The company provides fragrance, color cosmetics, and skin and body care products. It offers Prestige segment products primarily through prestige retailers, including perfumeries, department stores, e-retailers, direct-to-consumer websites, and duty-free shops under the Burberry, Calvin Klein, Chloe, Davidoff, Escada, Gucci, Hugo Boss, Infiniment Coty Paris, Jil Sander, Joop!, Kylie Jenner, Lancaster, Marc Jacobs, Miu Miu, Orveda, philosophy, SKKN BY KIM, and Tiffany & Co. brands. The company provides Consumer Beauty segment products primarily through hypermarkets, supermarkets, drug stores, pharmacies, mid-tier department stores, traditional food and drug retailers, and e-commerce retailers under the Adidas, Beckham, Bozzano, Bourjois, Bruno Banani, CoverGirl, Jovan, Max Factor, Mexx, Monange, Nautica, Paixao, LeGer by Lena Gercke, Rimmel, Risque, Vera Wang, and Sally Hansen brands. It also sells its products through third-party distributors. The company was founded in 1904 and is headquartered in New York, New York. Coty Inc. is a subsidiary of JAB Beauty B.V.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"13-02-2025 23:48:58"},{"Company Name":"ON Semiconductor Corporation","Symbol":"ON","Current Price":"50.92","Latest MA":"67.58","Price Target":61.59448,"Difference from MA":"-24.66%","Difference from Open":"1.72%","Change from Yesterday":"1.72%","Change from Last Report":"0.00","Latest Volume":"7,350,199","Market Cap":"21,458,755,584","Earning Date":"2025-02-10","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":13.180919,"PB Ratio":2.524917,"Previous Close":50.06,"ROE":0.2183,"DTE":42.376,"Industry":"Semiconductors","Sector":"Technology","Beta":1.654,"Trailing PEG":1.8007,"Trailing PE":14.027547,"Trailing PS":2.908518,"Quick Ratio":1.875,"Day High":50.965,"Day Low":49.7001,"VS Average Volume":0.9459754532,"Company Summary":"ON Semiconductor Corporation provides intelligent sensing and power solutions in the United States and internationally. The company operates through Power Solutions Group, Advanced Solutions Group, and Intelligent Sensing Group. Its intelligent power technologies enable the electrification of the automotive industry that allows for lighter and longer-range electric vehicles, empowers fast-charging systems, and propels sustainable energy for the solar strings, industrial power, and storage systems. In addition, the company offers analog, discrete, module, and integrated semiconductor products that perform multiple application functions, includes power switching and conversion, signal conditioning, circuit protection, signal amplification, and voltage regulation functions. Further, it designs and develops analog, mixed-signal, power management ICs and sensor interface devices for automotive, industrial, compute and mobile markets. Additionally, the company offers single photon detectors, including silicon photomultipliers and single photon avalanche diode arrays, as well as actuator drivers for autofocus and image stabilization for a broad base of end-users in the different end-markets. ON Semiconductor Corporation was incorporated in 1992 and is headquartered in Scottsdale, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"13-02-2025 23:48:58"},{"Company Name":"McDonald's Corporation","Symbol":"MCD","Current Price":"310.02","Latest MA":"287.86","Price Target":327.2971,"Difference from MA":"7.70%","Difference from Open":"0.82%","Change from Yesterday":"0.79%","Change from Last Report":"0.00","Latest Volume":"2,087,433","Market Cap":"222,166,532,096","Earning Date":"2025-02-10","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":23.229988,"PB Ratio":"N\/A","Previous Close":307.6,"ROE":"N\/A","DTE":"N\/A","Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":0.735,"Trailing PEG":2.6899,"Trailing PE":27.242529,"Trailing PS":8.565061,"Quick Ratio":0.584,"Day High":311.5,"Day Low":305.63,"VS Average Volume":0.6759931346,"Company Summary":"McDonald's Corporation operates and franchises restaurants under the McDonald's brand in the United States and internationally. It offers food and beverages, including hamburgers and cheeseburgers, various chicken sandwiches, fries, shakes, desserts, sundaes, cookies, pies, soft drinks, coffee, and other beverages; and full or limited breakfast, as well as sells various other products during limited-time promotions. The company owns and operates under various structures comprising conventional franchise, developmental license, or affiliate. McDonald's Corporation was founded in 1940 and is based in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:58"},{"Company Name":"Incyte Corporation","Symbol":"INCY","Current Price":"70.01","Latest MA":"68.80","Price Target":78.255,"Difference from MA":"1.75%","Difference from Open":"1.04%","Change from Yesterday":"1.39%","Change from Last Report":"0.00","Latest Volume":"3,103,438","Market Cap":"13,548,615,680","Earning Date":"2025-02-10","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":10.424655,"PB Ratio":4.256445,"Previous Close":69.05,"ROE":0.00802,"DTE":1.151,"Industry":"Biotechnology","Sector":"Healthcare","Beta":0.71,"Trailing PEG":0.3843,"Trailing PE":466.73334,"Trailing PS":3.3241122,"Quick Ratio":1.687,"Day High":72.69,"Day Low":68.03,"VS Average Volume":1.6272775656,"Company Summary":"Incyte Corporation, a biopharmaceutical company, engages in the discovery, development, and commercialization of therapeutics for hematology\/oncology, and inflammation and autoimmunity areas in the United States and internationally. The company offers JAKAFI (ruxolitinib) for treatment of intermediate or high-risk myelofibrosis, polycythemia vera, and steroid-refractory acute graft-versus-host disease; MONJUVI (tafasitamab-cxix)\/MINJUVI (tafasitamab) for relapsed or refractory diffuse large B-cell lymphoma; PEMAZYRE (pemigatinib), a fibroblast growth factor receptor kinase inhibitor that act as oncogenic drivers in liquid and solid tumor types; ICLUSIG (ponatinib) to treat chronic myeloid leukemia and Philadelphia-chromosome positive acute lymphoblastic leukemia; and ZYNYZ (retifanlimab-dlwr) to treat adults with metastatic or recurrent locally advanced Merkel cell carcinoma, as well as OPZELURA cream for treatment of atopic dermatitis. Its clinical stage products include retifanlimab under Phase 3 clinical trials for squamous cell carcinoma of the anal canal and non-small cell lung cancer; axatilimab, an anti-CSF-1R monoclonal antibody under Phase 2 that is being developed as a therapy for patients with chronic GVHD; INCA033989 to inhibit oncogenesis; INCB160058, which is being developed as a disease-modifying therapeutic; and INCB99280 and INCB99318 for the treatment solid tumors. The company also develops INCB123667, INCA32459, and INCA33890, as well as Ruxolitinib cream, Povorcitinib, and INCA034460. It has collaboration out-license agreements with Novartis and Lilly; in-license agreements with Agenus, Merus, MacroGenics, and Syndax; and collaboration and license agreement with China Medical System Holdings Limited for the development and commercialization of povorcitinib. The company sells its products to specialty, retail, and hospital pharmacies, distributors, and wholesalers. The company was formerly known as Incyte Genomics Inc and changed its name to Incyte Corporation in March 2003. Incyte Corporation was incorporated in 1991 and is headquartered in Wilmington, Delaware.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:58"},{"Company Name":"BGC Group, Inc.","Symbol":"BGC","Current Price":"9.49","Latest MA":"9.50","Price Target":12.0,"Difference from MA":"-0.13%","Difference from Open":"0.00%","Change from Yesterday":"0.32%","Change from Last Report":"0.00","Latest Volume":"2,286,471","Market Cap":"4,621,449,728","Earning Date":"2025-02-14","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.95283,"PB Ratio":5.3494925,"Previous Close":9.46,"ROE":0.12765999,"DTE":152.907,"Industry":"Capital Markets","Sector":"Financial Services","Beta":1.486,"Trailing PEG":null,"Trailing PE":41.260868,"Trailing PS":2.1803002,"Quick Ratio":1.424,"Day High":9.64,"Day Low":9.455,"VS Average Volume":0.7603170328,"Company Summary":"BGC Group, Inc. operates as a financial brokerage and technology company in the United States and internationally. The company offers various brokerage products, such as fixed income, such as government bonds, corporate bonds, and other debt instruments, as well as related interest rate derivatives and credit derivatives; equities, energy and commodities, shipping, insurance, and futures and options. It also provides trade execution, connectivity solutions, brokerage services, clearing, trade compression and other post-trade services, information, and other back-office services to an assortment of financial and non-financial institutions. In addition, the company offers electronic and hybrid brokerage, other financial technology solutions, market data and related information services. Further, its integrated platform is designed to provide flexibility to customers with regard to price discovery, execution and processing of transactions, Hybrid, or in various markets, as well as fully electronic brokerage services in connection with transactions executed either OTC or through an exchange. The company primarily serves banks, broker-dealers, investment banks, trading firms, hedge funds, governments, and corporations, as well as investment firms. BGC Group, Inc. was founded in 1945 and is headquartered in New York, New York.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"13-02-2025 23:48:58"},{"Company Name":"Roku, Inc.","Symbol":"ROKU","Current Price":"86.80","Latest MA":"72.35","Price Target":80.795,"Difference from MA":"19.97%","Difference from Open":"6.28%","Change from Yesterday":"2.38%","Change from Last Report":"0.00","Latest Volume":"8,422,449","Market Cap":"12,603,274,240","Earning Date":"2025-02-14","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":-102.72189,"PB Ratio":5.1221533,"Previous Close":84.78,"ROE":-0.0722,"DTE":24.921,"Industry":"Entertainment","Sector":"Communication Services","Beta":2.072,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":3.2346976,"Quick Ratio":2.309,"Day High":87.06,"Day Low":81.39,"VS Average Volume":2.5843065901,"Company Summary":"Roku, Inc., together with its subsidiaries, operates a TV streaming platform in the United states and internationally. The company operates in two segments, Platform and Devices. Its streaming platform allows users to find and access TV shows, movies, news, sports, and others. The Platform segment offers digital advertising, including direct and programmatic video advertising, media and entertainment promotional spending, and related services; and streaming services distribution, such as subscription and transaction revenue shares, and sale of premium subscriptions and branded app buttons on remote controls. The Devices segment provides sale of streaming players, Roku-branded TVs, smart home products and services, audio products, and related accessories as well as licensing arrangements with service operators. Roku, Inc. was incorporated in 2002 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:58"},{"Company Name":"Moderna, Inc.","Symbol":"MRNA","Current Price":"31.92","Latest MA":"61.42","Price Target":62.00545,"Difference from MA":"-48.03%","Difference from Open":"2.97%","Change from Yesterday":"4.54%","Change from Last Report":"0.00","Latest Volume":"14,296,050","Market Cap":"12,283,389,952","Earning Date":"2025-02-14","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":-3.5950723,"PB Ratio":1.0303754,"Previous Close":30.535,"ROE":-0.17524,"DTE":11.361,"Industry":"Biotechnology","Sector":"Healthcare","Beta":1.69,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":2.4175143,"Quick Ratio":3.954,"Day High":31.96,"Day Low":30.27,"VS Average Volume":1.3563852876,"Company Summary":"Moderna, Inc., a biotechnology company, discovers, develops, and commercializes messenger RNA therapeutics and vaccines for the treatment of infectious diseases, immuno-oncology, rare diseases, autoimmune, and cardiovascular diseases in the United States, Europe, and internationally. Its respiratory vaccines include COVID-19, influenza, and respiratory syncytial virus, spikevax, and hMPV\/PIV3 vaccines; latent vaccines comprise cytomegalovirus, epstein-barr virus, herpes simplex virus, varicella zoster virus, and human immunodeficiency virus vaccines; public health vaccines consists of Zika, Nipah, Mpox vaccines; and infectious diseases vaccines, such as lyme and norovirus vaccines. The company also offers systemic secreted and cell surface therapeutics; cancer vaccines, such as personalized cancer, KRAS, and checkpoint vaccines; intratumoral immuno-oncology products; rare disease intracellular therapeutics; and inhaled pulmonary therapeutics. It has strategic alliances and collaborations with AstraZeneca; Merck & Co., Inc; Vertex Pharmaceuticals Incorporated; Vertex Pharmaceuticals (Europe) Limited; Chiesi Farmaceutici S.p.A.; Metagenomi, Inc.; Carisma Therapeutics, Inc.; CytomX Therapeutics; Defense Advanced Research Projects Agency; Biomedical Advanced Research and Development Authority; Institute for Life Changing Medicines; The Bill & Melinda Gates Foundation; and OpenAI. The company was formerly known as Moderna Therapeutics, Inc. and changed its name to Moderna, Inc. in August 2018. Moderna, Inc. was founded in 2010 and is headquartered in Cambridge, Massachusetts.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"13-02-2025 23:48:58"},{"Company Name":"Coinbase Global, Inc.","Symbol":"COIN","Current Price":"298.11","Latest MA":"237.24","Price Target":298.68,"Difference from MA":"25.66%","Difference from Open":"4.87%","Change from Yesterday":"8.44%","Change from Last Report":"0.00","Latest Volume":"16,255,398","Market Cap":"74,631,831,552","Earning Date":"2025-02-14","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":56.319427,"PB Ratio":8.548692,"Previous Close":274.9,"ROE":0.21316,"DTE":51.515,"Industry":"Financial Data & Stock Exchanges","Sector":"Financial Services","Beta":3.343,"Trailing PEG":0.7863,"Trailing PE":50.698975,"Trailing PS":14.92377,"Quick Ratio":0.029,"Day High":302.4,"Day Low":282.5,"VS Average Volume":1.5735545917,"Company Summary":"Coinbase Global, Inc. provides financial infrastructure and technology for the crypto economy in the United States and internationally. The company offers the primary financial account in the crypto economy for consumers; and a marketplace with a pool of liquidity for transacting in crypto assets for institutions. It also provides technology and services that enable developers to build crypto products and securely accept crypto assets as payment. The company was founded in 2012 and is based in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 23:48:58"}]