[{"Company Name":"Franklin Resources, Inc.","Symbol":"BEN","Current Price":"22.18","Latest MA":"20.72","Price Target":19.80357,"Difference from MA":"7.08%","Difference from Open":"6.66%","Change from Yesterday":"10.05%","Change from Last Report":"0.34","Latest Volume":"10,303,176","Market Cap":"11,624,562,688","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":9.146907,"PB Ratio":0.9286701,"ROE":0.04321,"DTE":25.715,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.402,"Trailing PEG":1.4124,"Trailing PE":26.099998,"Trailing PS":1.3711444,"Quick Ratio":1.307,"Day High":22.415,"Day Low":19.581,"VS Average Volume":2.5950904438,"Company Summary":"Franklin Resources, Inc. is a publicly owned asset management holding company. Through its subsidiaries, the firm provides its services to individuals, institutions, pension plans, trusts, and partnerships. It launches equity, fixed income, balanced, and multi-asset mutual funds through its subsidiaries. The firm invests in the public equity, fixed income, and alternative markets. Franklin Resources, Inc. was founded in 1947 and is based in San Mateo, California with an additional office in Calgary, Canada; Dubai, United Arab Emirates; Edinburgh, United Kingdom; Fort Lauderdale, United States; Hyderabad, India; London, United Kingdom; Rancho Cordova, United states; Shanghai, China; Singapore; Stamford, United States; and Vienna, Austria.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Chevron Corporation","Symbol":"CVX","Current Price":"150.60","Latest MA":"150.08","Price Target":176.93333,"Difference from MA":"0.35%","Difference from Open":"-2.06%","Change from Yesterday":"-3.69%","Change from Last Report":"-0.05","Latest Volume":"8,976,277","Market Cap":"268,507,758,592","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":11.682433,"PB Ratio":1.7326478,"ROE":0.103520006,"DTE":16.456,"Industry":"Oil & Gas Integrated","Sector":"Energy","Beta":1.078,"Trailing PEG":3.2332,"Trailing PE":16.54945,"Trailing PS":1.4007468,"Quick Ratio":0.675,"Day High":154.35,"Day Low":148.65,"VS Average Volume":1.0806144047,"Company Summary":"Chevron Corporation, through its subsidiaries, engages in the integrated energy and chemicals operations in the United States and internationally. The company operates in two segments, Upstream and Downstream. The Upstream segment is involved in the exploration, development, production, and transportation of crude oil and natural gas; processing, liquefaction, transportation, and regasification of liquefied natural gas; transportation of crude oil through pipelines; transportation, storage, and marketing of natural gas; and carbon capture and storage, as well as a gas-to-liquids plant. The Downstream segment refines crude oil into petroleum products; markets crude oil, refined products, and lubricants; manufactures and markets renewable fuels, commodity petrochemicals, plastics for industrial uses, and fuel and lubricant additives; and transports crude oil and refined products by pipeline, marine vessel, motor equipment, and rail car. The company was formerly known as ChevronTexaco Corporation and changed its name to Chevron Corporation in 2005. Chevron Corporation was founded in 1879 and is headquartered in San Ramon, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Phillips 66","Symbol":"PSX","Current Price":"119.68","Latest MA":"128.52","Price Target":138.55316,"Difference from MA":"-6.88%","Difference from Open":"-0.23%","Change from Yesterday":"-1.01%","Change from Last Report":"-0.24","Latest Volume":"2,120,231","Market Cap":"49,426,522,112","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":9.739861,"PB Ratio":1.7208507,"ROE":0.11121,"DTE":67.143,"Industry":"Oil & Gas Refining & Marketing","Sector":"Energy","Beta":1.319,"Trailing PEG":null,"Trailing PE":15.284802,"Trailing PS":0.33455524,"Quick Ratio":0.759,"Day High":120.83,"Day Low":116.72,"VS Average Volume":0.7625270991,"Company Summary":"Phillips 66 operates as an energy manufacturing and logistics company in the United States, the United Kingdom, Germany, and internationally. It operates through four segments: Midstream, Chemicals, Refining, and Marketing and Specialties (M&S). The Midstream segment transports crude oil and other feedstocks; delivers refined petroleum products to market; provides terminaling and storage services for crude oil and refined petroleum products; transports, stores, fractionates, exports, and markets natural gas liquids; provides other fee-based processing services; and gathers, processes, transports, and markets natural gas. The Chemicals segment produces and markets ethylene and other olefin products; aromatics and styrenics products, such as benzene, cyclohexane, styrene, and polystyrene; and various specialty chemical products, including organosulfur chemicals, solvents, catalysts, and chemicals used in drilling and mining. The Refining segment refines crude oil and other feedstocks into petroleum products, such as gasolines, distillates, aviation, and renewable. The M&S segment purchases for resale and markets refined petroleum products, including gasolines, distillates, and aviation fuels. This segment also manufactures and markets specialty products, such as base oils and lubricants. Phillips 66 was founded in 1875 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Exxon Mobil Corporation","Symbol":"XOM","Current Price":"107.51","Latest MA":"114.43","Price Target":129.47845,"Difference from MA":"-6.05%","Difference from Open":"-2.75%","Change from Yesterday":"-1.89%","Change from Last Report":"-0.10","Latest Volume":"9,928,177","Market Cap":"472,515,248,128","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":11.923185,"PB Ratio":1.7592257,"ROE":0.14513999,"DTE":15.394,"Industry":"Oil & Gas Integrated","Sector":"Energy","Beta":0.88,"Trailing PEG":4.2007,"Trailing PE":13.388519,"Trailing PS":1.3743179,"Quick Ratio":0.978,"Day High":110.53,"Day Low":107.0,"VS Average Volume":0.6376922862,"Company Summary":"Exxon Mobil Corporation engages in the exploration and production of crude oil and natural gas in the United States and internationally. It operates through Upstream, Energy Products, Chemical Products, and Specialty Products segments. The Upstream segment explores for and produces crude oil and natural gas. The Energy Products segment offers fuels, aromatics, and catalysts, as well as licensing services. It sells its products under the Exxon, Esso, and Mobil brands. The Chemical Products segment manufactures and markets petrochemicals including olefins, polyolefins, and intermediates. The Specialty Products segment offers performance products, including lubricants, basestocks, waxes, synthetics, elastomers, and resins. The company also involves in the manufacturing, trade, transport, and sale of crude oil, natural gas, petroleum products, petrochemicals, and other specialty products; and pursuit lower-emission business opportunities, including carbon capture and storage, hydrogen, lower-emission fuels, and lithium. Exxon Mobil Corporation was founded in 1870 and is based in Spring, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Eaton Corporation, PLC","Symbol":"ETN","Current Price":"325.98","Latest MA":"329.12","Price Target":377.53708,"Difference from MA":"-0.96%","Difference from Open":"1.23%","Change from Yesterday":"-0.37%","Change from Last Report":"0.01","Latest Volume":"3,154,639","Market Cap":"128,827,301,888","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":24.28511,"PB Ratio":6.7388835,"ROE":0.20079,"DTE":52.594,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":1.01,"Trailing PEG":2.4669,"Trailing PE":34.715656,"Trailing PS":5.235818,"Quick Ratio":0.911,"Day High":327.48,"Day Low":314.4,"VS Average Volume":1.3203878659,"Company Summary":"Eaton Corporation plc operates as a power management company worldwide. The company's Electrical Americas and Electrical Global segment provides electrical components, industrial components, power distribution and assemblies, residential products, single and three phase power quality and connectivity products, wiring devices, circuit protection products, utility power distribution products, power reliability equipment, and services, as well as hazardous duty electrical equipment, emergency lighting, fire detection, explosion-proof instrumentation, and structural support systems. Its Aerospace segment offers pumps, motors, hydraulic power units, hoses and fittings, and electro-hydraulic pumps; valves, cylinders, electronic controls, electromechanical actuators, sensors, aircraft flap and slat systems, and nose wheel steering systems; hose, thermoplastic tubing products, fittings, adapters, couplings, and sealing and ducting products; air-to-air refueling systems, fuel pumps, fuel inerting products, sensors, and adapters and regulators; oxygen generation system, payload carriages, and thermal management products; and wiring connectors and cables, as well as hydraulic and bag filters, strainers and cartridges, and golf grips for manufacturers of commercial and military aircraft, and related after-market customers, as well as industrial applications. The company's Vehicle segment offers transmissions, clutches, hybrid power systems, superchargers, engine valves and valve actuation systems, locking and limited slip differentials, transmission controls, and fuel vapor components for the vehicle industry. Its eMobility segment provides voltage inverters, converters, fuses, circuit protection units, vehicle controls, power distribution systems, fuel tank isolation valves, and commercial vehicle hybrid systems. Eaton Corporation plc was founded in 1911 and is based in Dublin, Ireland.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Gentex Corporation","Symbol":"GNTX","Current Price":"26.12","Latest MA":"29.98","Price Target":34.01818,"Difference from MA":"-12.86%","Difference from Open":"4.06%","Change from Yesterday":"-7.48%","Change from Last Report":"-0.67","Latest Volume":"2,938,710","Market Cap":"5,940,524,032","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":11.5725765,"PB Ratio":2.4571967,"ROE":0.18513,"DTE":0.222,"Industry":"Auto Parts","Sector":"Consumer Cyclical","Beta":0.91,"Trailing PEG":1.2844,"Trailing PE":13.8201065,"Trailing PS":2.5163083,"Quick Ratio":1.965,"Day High":27.065,"Day Low":25.1,"VS Average Volume":2.1159639639,"Company Summary":"Gentex Corporation designs, develops, manufactures, markets, and supplies digital vision, connected car, dimmable glass, and fire protection products in the United States, Germany, Japan, Mexico, Republic of Korea, and internationally. It operates through Automotive Products and Other segments. The company offers automotive products, including interior and exterior electrochromic automatic-dimming rearview mirrors, automotive electronics, and non-automatic-dimming rearview mirrors for automotive passenger cars, light trucks, pick-up trucks, sport utility vehicles, and vans for original equipment manufacturers, automotive suppliers, and various aftermarket and accessory customers. It also provides variable dimmable windows to aircraft manufacturers and airline operators. In addition, the company offers photoelectric smoke detectors and alarms, electrochemical carbon monoxide alarms and detectors, audible and visual signaling alarms, and bells and speakers used in fire detection systems in office buildings, hotels, and other commercial and residential buildings, as well as researches and develops nanofiber chemical sensing products. It sells its fire protection products directly, as well as through sales managers and manufacturer representative organizations to fire protection and security product distributors, electrical wholesale houses, and original equipment manufacturers of fire protection systems. Gentex Corporation was incorporated in 1974 and is headquartered in Zeeland, Michigan.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Colgate-Palmolive Company","Symbol":"CL","Current Price":"86.34","Latest MA":"96.46","Price Target":100.86864,"Difference from MA":"-10.49%","Difference from Open":"1.07%","Change from Yesterday":"-5.00%","Change from Last Report":"-0.08","Latest Volume":"5,706,754","Market Cap":"70,540,730,368","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":21.214958,"PB Ratio":162.29323,"ROE":4.87923,"DTE":1009.091,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":0.415,"Trailing PEG":2.0529,"Trailing PE":24.810343,"Trailing PS":3.5084417,"Quick Ratio":0.576,"Day High":87.39,"Day Low":85.69,"VS Average Volume":1.2325205949,"Company Summary":"Colgate-Palmolive Company, together with its subsidiaries, manufactures and sells consumer products in the United States and internationally. It operates through two segments: Oral, Personal and Home Care; and Pet Nutrition. The Oral, Personal and Home Care segment offers toothpaste, toothbrushes, mouthwash, bar and liquid hand soaps, shower gels, shampoos, conditioners, deodorants and antiperspirants, skin health products, dishwashing detergents, fabric conditioners, household cleaners, and other related items. This segment markets and sells its products under various brands, which include Colgate, Darlie, elmex, hello, meridol, Sorriso, Tom's of Maine, Irish Spring, Palmolive, Protex, Sanex, Softsoap, Lady Speed Stick, Speed Stick, EltaMD, Filorga, PCA SKIN, Ajax, Axion, Fabuloso, Murphy, Suavitel, and Soupline to a range of traditional and eCommerce retailers, wholesalers, and distributors. It includes pharmaceutical products for dentists and other oral health professionals. Its Pet Nutrition segment offers pet nutrition products for everyday nutritional needs under the Hill's Science Diet brand; and a range of therapeutic pet products to help nutritionally support dogs and cats in different stages of health under the Hill's Prescription Diet brand. This segment markets and sells its products through pet supply retailers, veterinarians, and eCommerce retailers. Colgate-Palmolive Company was founded in 1806 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"AbbVie Inc.","Symbol":"ABBV","Current Price":"185.54","Latest MA":"181.33","Price Target":199.96964,"Difference from MA":"2.32%","Difference from Open":"-0.94%","Change from Yesterday":"5.63%","Change from Last Report":"-0.09","Latest Volume":"6,388,728","Market Cap":"327,875,133,440","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":13.565086,"PB Ratio":54.36273,"ROE":0.56407,"DTE":1174.815,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.613,"Trailing PEG":0.4149,"Trailing PE":64.87412,"Trailing PS":5.9041495,"Quick Ratio":0.436,"Day High":191.735,"Day Low":185.01,"VS Average Volume":0.9825643915,"Company Summary":"AbbVie Inc. discovers, develops, manufactures, and sells pharmaceuticals worldwide. The company offers Humira, an injection for autoimmune and intestinal Behçet's diseases, and pyoderma gangrenosum; Skyrizi to treat moderate to severe plaque psoriasis, psoriatic disease, and Crohn's disease; Rinvoq to treat rheumatoid and psoriatic arthritis, ankylosing spondylitis, atopic dermatitis, axial spondyloarthropathy, ulcerative colitis, and Crohn's disease; Imbruvica for the treatment of adult patients with blood cancers; Epkinly to treat lymphoma; Elahere to treat cancer; and Venclexta\/Venclyxto to treat blood cancers. It also provides facial injectables, plastics and regenerative medicine, body contouring, and skincare products; botox therapeutic; Vraylar for depressive disorder; Duopa and Duodopa to treat advanced Parkinson's disease; Ubrelvy for the acute treatment of migraine in adults; and Qulipta for episodic and chronic migraine. In addition, the company offers Ozurdex for eye diseases; Lumigan\/Ganfort and Alphagan\/Combigan for the reduction of elevated intraocular pressure in patients with open angle glaucoma or ocular hypertension; Restasis to increase tear production; and other eye care products. Further, it provides Mavyret\/Maviret to treat chronic hepatitis C virus genotype 1-6 infection; Creon, a pancreatic enzyme therapy; Lupron to treat advanced prostate cancer, endometriosis and central precocious puberty, and patients with anemia caused by uterine fibroids; Linzess\/Constella to treat irritable bowel syndrome with constipation and chronic idiopathic constipation; and Synthroid for hypothyroidism. It has collaborations with Calico Life Sciences LLC; REGENXBIO Inc.; Janssen Biotech, Inc.; Evolveimmune Therapeutics, Inc.; Genentech, Inc.; AbCellera Biologics Inc.; and Tentarix Biotherapeutics, LP. The company was incorporated in 2012 and is headquartered in North Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"LyondellBasell Industries NV","Symbol":"LYB","Current Price":"75.58","Latest MA":"86.71","Price Target":88.76714,"Difference from MA":"-12.84%","Difference from Open":"-2.90%","Change from Yesterday":"-0.74%","Change from Last Report":"-0.28","Latest Volume":"2,173,537","Market Cap":"24,545,134,592","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.350375,"PB Ratio":1.7894688,"ROE":0.1586,"DTE":92.277,"Industry":"Specialty Chemicals","Sector":"Basic Materials","Beta":1.091,"Trailing PEG":1.2304,"Trailing PE":11.468892,"Trailing PS":0.6025712,"Quick Ratio":1.1,"Day High":79.085,"Day Low":75.36,"VS Average Volume":0.7599500718,"Company Summary":"LyondellBasell Industries N.V. operates as a chemical company in the United States, Germany, Mexico, Italy, Poland, France, Japan, China, the Netherlands, and internationally. The company operates in six segments: Olefins and Polyolefins\u0097Americas; Olefins and Polyolefins\u0097Europe, Asia, International; Intermediates and Derivatives; Advanced Polymer Solutions; Refining; and Technology. It produces and markets olefins and co-products, polyethylene, and polypropylene; and propylene oxide and derivatives; oxyfuels and related products; and intermediate chemicals, such as styrene monomer, acetyls, ethylene oxide, and ethylene glycol. In addition, the company produce and markets compounding and solutions including polypropylene compounds, engineered plastics, masterbatches, engineered composites, colors and powders, and advanced polymers including catalloy and polybutene-1; and refines heavy, high-sulfur crude oil and other crude oils, as well as refined products, including gasoline and distillates. Further, it develops and licenses chemical and polyolefin process technologies; manufactures and sells polyolefin catalysts; and serves food packaging, home furnishings, automotive components, and paints and coatings applications. LyondellBasell Industries N.V. was incorporated in 2009 and is headquartered in Houston, Texas.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"United States Steel Corporation","Symbol":"X","Current Price":"36.92","Latest MA":"37.17","Price Target":39.6925,"Difference from MA":"-0.68%","Difference from Open":"2.13%","Change from Yesterday":"0.90%","Change from Last Report":"-0.39","Latest Volume":"2,184,942","Market Cap":"8,313,313,280","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":10.520166,"PB Ratio":0.7180085,"ROE":0.03452,"DTE":37.015,"Industry":"Steel","Sector":"Basic Materials","Beta":1.861,"Trailing PEG":null,"Trailing PE":23.367086,"Trailing PS":0.5108026,"Quick Ratio":0.991,"Day High":37.69,"Day Low":36.07,"VS Average Volume":0.3134331698,"Company Summary":"United States Steel Corporation produces and sells flat-rolled and tubular steel products primarily in North America and Europe. The company operates through North American Flat-Rolled (Flat-Rolled), Mini Mill, U. S. Steel Europe (USSE), and Tubular Products (Tubular) segments. The Flat-Rolled segment offers slabs, strip mill plates, sheets, and tin mill products, as well as iron ore and coke. This segment serves customers in the service center, conversion, transportation, automotive, construction, container, appliance, and electrical markets. The Mini Mill segment provides hot-rolled, cold-rolled, and coated sheets and electrical steel products. This segment serves customers in the automotive, construction, pipe and tube, sheet converter, electrical, solar industrial equipment, and service center markets. The USSE segment provides slabs, strip mill plates, sheets, tin mill products, and spiral welded pipes. This segment serves customers in the construction, container, appliance and electrical, service center, conversion, oil, gas, and petrochemical markets. The Tubular segment offers seamless and electric resistance welded steel casing and tubing products, as well as standard and line pipe and mechanical tubing products primarily to customers in the oil, gas, and petrochemical markets. It also engages in the real estate business. United States Steel Corporation was founded in 1901 and is headquartered in Pittsburgh, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Deckers Outdoor Corporation","Symbol":"DECK","Current Price":"183.66","Latest MA":"172.35","Price Target":217.2981,"Difference from MA":"6.56%","Difference from Open":"-6.34%","Change from Yesterday":"-17.73%","Change from Last Report":"-0.19","Latest Volume":"9,833,664","Market Cap":"27,901,995,008","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":27.950724,"PB Ratio":13.382396,"ROE":0.4357,"DTE":11.633,"Industry":"Footwear & Accessories","Sector":"Consumer Cyclical","Beta":1.053,"Trailing PEG":2.638,"Trailing PE":29.814936,"Trailing PS":5.9917545,"Quick Ratio":2.052,"Day High":198.65,"Day Low":183.5701,"VS Average Volume":5.7536551059,"Company Summary":"Deckers Outdoor Corporation, together with its subsidiaries, designs, markets, and distributes footwear, apparel, and accessories for casual lifestyle use and high-performance activities in the United States and internationally. The company offers premium footwear, apparel, and accessories under the UGG brand name; footwear, apparel, and accessories for ultra-runners and athletes under the HOKA brand name; and sandals, shoes, and boots under the Teva brand name. It also provides relaxed casual shoes and sandals under the Sanuk brand name; casual footwear fashion line under the Koolaburra brand name; and footwear under the AHNU brand name. The company sells its products through domestic and international retailers; international distributors; and directly to its consumers through its direct-to-consumer business, which includes e-commerce websites and retail stores. Deckers Outdoor Corporation was founded in 1973 and is headquartered in Goleta, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"International Paper Company","Symbol":"IP","Current Price":"55.74","Latest MA":"50.48","Price Target":56.36,"Difference from MA":"10.44%","Difference from Open":"-0.72%","Change from Yesterday":"-2.31%","Change from Last Report":"0.03","Latest Volume":"12,958,181","Market Cap":"19,366,258,688","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":14.331771,"PB Ratio":2.244253,"ROE":0.04797,"DTE":69.707,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":0.988,"Trailing PEG":0.5069,"Trailing PE":35.506367,"Trailing PS":1.0389625,"Quick Ratio":1.021,"Day High":58.11,"Day Low":55.695,"VS Average Volume":2.9507226186,"Company Summary":"International Paper Company produces and sells renewable fiber-based packaging and pulp products in North America, Latin America, Europe, and North Africa. It operates through two segments, Industrial Packaging and Global Cellulose Fibers. The company offers linerboard, medium, whitetop, recycled linerboard, recycled medium and saturating kraft; and pulp for a range of applications, such as diapers, towel and tissue products, feminine care, incontinence, and other personal care products, as well as specialty pulps for use in textiles, construction materials, paints, coatings, and others. It sells its products directly to end users and converters, as well as through agents, resellers, and distributors. The company was founded in 1898 and is headquartered in Memphis, Tennessee.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Intel Corporation","Symbol":"INTC","Current Price":"19.60","Latest MA":"23.34","Price Target":22.54882,"Difference from MA":"-16.03%","Difference from Open":"-2.44%","Change from Yesterday":"-2.02%","Change from Last Report":"-0.28","Latest Volume":"71,682,253","Market Cap":"84,867,997,696","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":15.798935,"PB Ratio":0.8485216,"ROE":-0.15597,"DTE":47.906,"Industry":"Semiconductors","Sector":"Technology","Beta":1.026,"Trailing PEG":0.5938,"Trailing PE":"N\/A","Trailing PS":1.5644736,"Quick Ratio":0.833,"Day High":20.33,"Day Low":19.566,"VS Average Volume":0.9690929235,"Company Summary":"Intel Corporation designs, develops, manufactures, markets, and sells computing and related products and services worldwide. It operates through Client Computing Group, Data Center and AI, Network and Edge, Mobileye, and Intel Foundry Services segments. The company's products portfolio comprises central processing units and chipsets, system-on-chips (SoCs), and multichip packages; mobile and desktop processors; hardware products comprising graphics processing units (GPUs), domain-specific accelerators, and field programmable gate arrays (FPGAs); and memory and storage, connectivity and networking, and other semiconductor products. It also offers silicon devices and software products; and optimization solutions for workloads, such as AI, cryptography, security, storage, networking, and leverages various features supporting diverse compute environments. In addition, the company develops and deploys advanced driver assistance systems (ADAS), and autonomous driving technologies and solutions; and provides advanced process technologies backed by an ecosystem of IP, EDA, and design services, as well as systems of chips, including advanced packaging technologies, software and accelerate bring-up, and integration of chips and driving standards. Further, it delivers and deploys intelligent edge platforms that allow developers to achieve agility and drive automation using AI for efficient operations with data integrity, as well as provides hardware and software platforms, tools, and ecosystem partnerships for digital transformation from the cloud to edge. The company serves original equipment manufacturers, original design manufacturers, cloud service providers, and other manufacturers and service providers. It has a strategic agreement with Synopsys, Inc. to develop EDA and IP solutions; and ARM that enables chip designers to build optimized compute SoCs on the Intel 18A process. Intel Corporation was incorporated in 1968 and is headquartered in Santa Clara, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Baker Hughes Company","Symbol":"BKR","Current Price":"46.70","Latest MA":"38.45","Price Target":47.63885,"Difference from MA":"21.46%","Difference from Open":"1.30%","Change from Yesterday":"4.62%","Change from Last Report":"-0.19","Latest Volume":"10,687,818","Market Cap":"46,210,867,200","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":15.967395,"PB Ratio":2.8531282,"ROE":0.14292,"DTE":36.933,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.363,"Trailing PEG":0.9939,"Trailing PE":15.671141,"Trailing PS":1.6927058,"Quick Ratio":0.749,"Day High":47.6,"Day Low":45.8,"VS Average Volume":1.6479589508,"Company Summary":"Baker Hughes Company provides a portfolio of technologies and services to energy and industrial value chain worldwide. The company operates through Oilfield Services & Equipment (OFSE) and Industrial & Energy Technology (IET) segments. The OFSE segment designs and manufactures products and provides related services, including exploration, appraisal, development, production, rejuvenation, and decommissioning for onshore and offshore oilfield operations. This segment also provides drilling services, drill bits, and drilling and completions fluids; completions, intervention, measurements, pressure pumping, and wireline services; artificial lift systems, and oilfield and industrial chemicals; subsea projects and services, flexible pipe systems, and surface pressure control systems; and integrated well services and solutions. It serves oil and natural gas companies; the United States and international independent oil and natural gas companies; national or state-owned oil companies; engineering, procurement, and construction contractors; geothermal companies; and other oilfield service companies. The IET segment provides gas technology equipment, including drivers, driven equipment, flow control, and turnkey solutions for the mechanical-drive, compression, and power-generation applications; and energy sectors, such as oil and gas, LNG operations, petrochemical, and carbon solutions. This segment also provides rack-based vibration monitoring equipment and sensors; integrated asset performance management products; inspection services; pumps, valves, and gears; precision sensors and instrumentation, and condition monitoring solutions. It serves upstream, midstream, downstream, onshore, offshore, and small and large scale customers. The company was formerly known as Baker Hughes, a GE company and changed its name to Baker Hughes Company in October 2019. Baker Hughes Company was incorporated in 2016 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Mobileye Global Inc.","Symbol":"MBLY","Current Price":"16.71","Latest MA":"16.87","Price Target":20.39893,"Difference from MA":"-0.97%","Difference from Open":"1.27%","Change from Yesterday":"2.45%","Change from Last Report":"-0.54","Latest Volume":"5,143,290","Market Cap":"13,552,611,328","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":32.91897,"PB Ratio":1.1220789,"ROE":-0.21936001,"DTE":0.439,"Industry":"Auto Parts","Sector":"Consumer Cyclical","Beta":0.059,"Trailing PEG":0.6796,"Trailing PE":"N\/A","Trailing PS":7.5250483,"Quick Ratio":4.215,"Day High":17.83,"Day Low":16.3742,"VS Average Volume":0.7167918856,"Company Summary":"Mobileye Global Inc. develops and deploys advanced driver assistance systems (ADAS) and autonomous driving technologies and solutions worldwide. The company operates through Mobileye and Other segments. It offers Driver Assist comprising ADAS and autonomous vehicle solutions that covers safety features, such as real-time detection of road users, geometry, semantics, and markings to provide safety alerts and emergency interventions; Cloud-Enhanced Driver Assist, a solution for drivers with interpretations of a scene in real-time; Mobileye SuperVision Lite, a navigation and assisted driving solution; and Mobileye SuperVision, an operational point-to-point assisted driving navigation solution on various road types and includes cloud-based enhancements, such as road experience management. The company also provides Mobileye Chauffeur, a first-generation solution for eyes-off\/hands-off driving with a human driver still in the driver's seat; Mobileye Drive, a self-driving system comprising of radar and lidar subsystems, as well as collision avoidance systems, including Mobileye 8 Connect for light and medium-duty vehicles, and Mobileye Shield+ for large vehicles. It serves original equipment manufacturers. The company was founded in 1999 and is headquartered in Jerusalem, Israel. Mobileye Global Inc. operates as a subsidiary of Intel Overseas Funding Corporation.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Cardinal Health, Inc.","Symbol":"CAH","Current Price":"124.59","Latest MA":"111.78","Price Target":139.00732,"Difference from MA":"11.46%","Difference from Open":"-1.74%","Change from Yesterday":"-2.85%","Change from Last Report":"-0.26","Latest Volume":"2,135,746","Market Cap":"30,096,955,392","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":14.037898,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Medical Distribution","Sector":"Healthcare","Beta":0.616,"Trailing PEG":1.0568,"Trailing PE":23.201117,"Trailing PS":0.13408963,"Quick Ratio":0.422,"Day High":127.98,"Day Low":122.855,"VS Average Volume":0.9475275286,"Company Summary":"Cardinal Health, Inc. operates as a healthcare services and products company in the United States, Canada, Europe, Asia, and internationally. It provides customized solutions for hospitals, healthcare systems, pharmacies, ambulatory surgery centers, clinical laboratories, physician offices, and patients in the home. The company operates in two segments: Pharmaceutical and Specialty Solutions, and Global Medical Products and Distribution. It distributes branded and generic pharmaceutical, specialty pharmaceutical, and over-the-counter healthcare and consumer products, as well as medical supplies. The company also provides services to pharmaceutical manufacturers and healthcare providers for specialty pharmaceutical products; offers pharmacy management services to hospitals; operates pharmacies, including pharmacies in community health centers; and repackages generic pharmaceuticals and over-the-counter healthcare products. In addition, it manufactures, sources, and distributes Cardinal Health branded medical, surgical, and laboratory products and devices that include exam and surgical gloves; needles, syringe, and sharps disposals; compression solution, incontinence, nutritional delivery, and wound care products; single-use surgical drapes, gowns, and apparel products; fluid suction and collection systems; urology products; operating room supply products; and electrode product lines. Further, the company distributes a range of national brand products, including medical, surgical, and laboratory products; provides supply chain services and solutions to hospitals, ambulatory surgery centers, clinical laboratories, and other healthcare providers; and assembles and sells sterile, and non-sterile procedure kits. Additionally, it manufactures, prepares, delivers, and distributes radiopharmaceuticals and related treatments; and optimizes direct shipments through integrated technology solutions. The company was incorporated in 1979 and is headquartered in Dublin, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"CNX Resources Corporation","Symbol":"CNX","Current Price":"27.63","Latest MA":"31.53","Price Target":30.25,"Difference from MA":"-12.37%","Difference from Open":"0.33%","Change from Yesterday":"0.38%","Change from Last Report":"-0.11","Latest Volume":"2,295,421","Market Cap":"4,123,694,592","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":8.737145,"PB Ratio":0.9688278,"ROE":0.13833,"DTE":56.482,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":1.375,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":3.011669,"Quick Ratio":0.172,"Day High":28.66,"Day Low":27.04,"VS Average Volume":0.8294992442,"Company Summary":"CNX Resources Corporation, an independent natural gas and midstream company, engages in the acquisition, exploration, development, and production of natural gas properties in the Appalachian Basin. The company operates in two segments, Shale and Coalbed Methane (CBM). It produces and sells pipeline quality natural gas primarily for gas wholesalers. The company owns rights to extract natural gas from shale properties in Pennsylvania, West Virginia, and Ohio, as well as rights to extract natural gas from other shale and shallow oil and gas formations in Illinois, Indiana, New York, and Virginia. It also owns rights to extract CBM in Virginia, West Virginia, Pennsylvania, Ohio, Illinois, Indiana, and New Mexico. In addition, the company designs, builds, and operates natural gas gathering systems to move gas from the wellhead to interstate pipelines or other local sales points; owns and operates approximately 2,600 miles of natural gas gathering pipelines, as well as various natural gas processing facilities. It also offers turn-key solutions for water sourcing, delivery, and disposal for its natural gas operations and for third parties. The company was formerly known as CONSOL Energy Inc. and changed its name to CNX Resources Corporation in November 2017. CNX Resources Corporation was founded in 1860 and is headquartered in Canonsburg, Pennsylvania.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Comcast Corporation","Symbol":"CMCSA","Current Price":"33.51","Latest MA":"39.53","Price Target":44.2025,"Difference from MA":"-15.22%","Difference from Open":"0.09%","Change from Yesterday":"0.81%","Change from Last Report":"-0.39","Latest Volume":"19,238,468","Market Cap":"128,227,745,792","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":6.9995575,"PB Ratio":1.4979929,"ROE":0.16884,"DTE":117.127,"Industry":"Telecom Services","Sector":"Communication Services","Beta":1.004,"Trailing PEG":1.0317,"Trailing PE":8.094228,"Trailing PS":1.0419091,"Quick Ratio":0.605,"Day High":34.01,"Day Low":33.3,"VS Average Volume":0.9284019617,"Company Summary":"Comcast Corporation operates as a media and technology company worldwide. It operates through Residential Connectivity & Platforms, Business Services Connectivity, Media, Studios, and Theme Parks segments. The Residential Connectivity & Platforms segment provides residential broadband and wireless connectivity services, residential and business video services, sky-branded entertainment television networks, and advertising. The Business Services Connectivity segment offers connectivity services for small business locations, which include broadband, wireline voice, and wireless services, as well as solutions for medium-sized customers and larger enterprises; and small business connectivity services in the United Kingdom. The Media segment operates NBCUniversal's television and streaming business, including national and regional cable networks; the NBC and Telemundo broadcast networks and owned local broadcast television stations; and Peacock, a direct-to-consumer streaming services. It also operates international television networks comprising the Sky Sports networks, as well as other digital properties. The Studios segment operates NBCUniversal and Sky film and television studio production and distribution operations. The Theme Parks segment operates Universal theme parks in Orlando, Florida; Hollywood, California; Osaka, Japan; and Beijing, China. The company also offers a consolidated streaming platforms under the Philadelphia Flyers and the Wells Fargo Center arena in Philadelphia, Pennsylvania; and Xumo. Comcast Corporation was founded in 1963 and is headquartered in Philadelphia, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Gen Digital Inc.","Symbol":"GEN","Current Price":"27.30","Latest MA":"27.10","Price Target":31.36889,"Difference from MA":"0.73%","Difference from Open":"2.56%","Change from Yesterday":"-2.15%","Change from Last Report":"0.05","Latest Volume":"2,783,400","Market Cap":"16,821,798,912","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":11.200981,"PB Ratio":7.7410665,"ROE":0.2766,"DTE":409.342,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.054,"Trailing PEG":0.65,"Trailing PE":27.024754,"Trailing PS":4.3545947,"Quick Ratio":0.273,"Day High":27.38,"Day Low":25.69,"VS Average Volume":0.8511653296,"Company Summary":"Gen Digital Inc. engages in the provision of cyber safety solutions for consumers in the United States, Canada, Latin America, Europe, the Middle East, Africa, the Asia Pacific, and Japan. The company offers security and performance products under Norton, Avast, Avira, AVG, and CCleaner brands that provide real-time protection and maintenance for PCs, Macs, and mobile devices against malware, viruses, adware, and other online threats. It also provides identity protection solutions, including LifeLock Identity Theft Protection, Avast and AVG Secure Identity, Norton Identity Theft Protection, and Dark Web Monitoring for monitoring of credit reports, financial accounts, the dark web, and social media accounts to help safeguard customers' personal information. In addition, the company offers Virtual Private Network (VPN) solutions under Norton, Avast and AVG brands to enhance security and online privacy that allows customers to securely transmit and access private information, such as passwords, bank details, and credit card numbers, when using public Wi-Fi on PCs, Macs, and mobile iOS and Android devices; AntiTrack and Secure Browser products which helps to keep personal information and browsing activity anonymous while browsing online; and Privacy Monitor Assistant and BreachGuard products for removing customers' data from public data broker sites; and ReputationDefender, a white glove service that helps customers manage all aspects of their personal branding online, including search results, social media sites, and overall web presence. It markets and sells its products and related services through retailers, telecom service providers, hardware original equipment manufacturers, and employee benefit providers, as well as e-commerce platform. The company was formerly known as NortonLifeLock Inc. and changed its name to Gen Digital Inc. in November 2022. Gen Digital Inc. was founded in 1982 and is headquartered in Tempe, Arizona.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Apple Inc.","Symbol":"AAPL","Current Price":"236.07","Latest MA":"229.74","Price Target":251.4585,"Difference from MA":"2.76%","Difference from Open":"-4.44%","Change from Yesterday":"-0.64%","Change from Last Report":"-0.04","Latest Volume":"52,272,329","Market Cap":"3,549,997,039,616","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":28.500957,"PB Ratio":62.667908,"ROE":1.5741299,"DTE":209.059,"Industry":"Consumer Electronics","Sector":"Technology","Beta":1.24,"Trailing PEG":2.1827,"Trailing PE":37.471428,"Trailing PS":9.078464,"Quick Ratio":0.745,"Day High":247.19,"Day Low":236.07,"VS Average Volume":1.0587239309,"Company Summary":"Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod. It also provides AppleCare support and cloud services; and operates various platforms, including the App Store that allow customers to discover and download applications and digital content, such as books, music, video, games, and podcasts, as well as advertising services include third-party licensing arrangements and its own advertising platforms. In addition, the company offers various subscription-based services, such as Apple Arcade, a game subscription service; Apple Fitness+, a personalized fitness service; Apple Music, which offers users a curated listening experience with on-demand radio stations; Apple News+, a subscription news and magazine service; Apple TV+, which offers exclusive original content; Apple Card, a co-branded credit card; and Apple Pay, a cashless payment service, as well as licenses its intellectual property. The company serves consumers, and small and mid-sized businesses; and the education, enterprise, and government markets. It distributes third-party applications for its products through the App Store. The company also sells its products through its retail and online stores, and direct sales force; and third-party cellular network carriers, wholesalers, retailers, and resellers. Apple Inc. was founded in 1976 and is headquartered in Cupertino, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Olin Corporation","Symbol":"OLN","Current Price":"29.33","Latest MA":"41.62","Price Target":40.52941,"Difference from MA":"-29.52%","Difference from Open":"-1.91%","Change from Yesterday":"-8.79%","Change from Last Report":"-0.68","Latest Volume":"2,296,406","Market Cap":"3,419,760,640","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":8.276123,"PB Ratio":1.6627927,"ROE":0.06448,"DTE":153.374,"Industry":"Chemicals","Sector":"Basic Materials","Beta":1.423,"Trailing PEG":null,"Trailing PE":23.277779,"Trailing PS":0.5274641,"Quick Ratio":0.775,"Day High":30.74,"Day Low":28.96,"VS Average Volume":1.3941227716,"Company Summary":"Olin Corporation manufactures and distributes chemical products in the United States, Europe, Asia Pacific, Latin America, and Canada. It operates through three segments: Chlor Alkali Products and Vinyls; Epoxy; and Winchester. The Chlor Alkali Products and Vinyls segment offers chlorine and caustic soda, ethylene dichloride and vinyl chloride monomers, methyl chloride, methylene chloride, chloroform, carbon tetrachloride, perchloroethylene, hydrochloric acid, hydrogen, bleach products, potassium hydroxide, and chlorinated organics intermediates and solvents. The Epoxy segment provides Allylics, such as allyl chloride, epichlorohydrin, and glycerin; aromatics, including acetone, bisphenol, cumene, and phenol; liquid and solid epoxy resins; and converted epoxy resins and additives. The Winchester segment offers sporting ammunition products, including shotshells, small caliber centerfire, and rimfire ammunition products for hunters and recreational shooters, and law enforcement agencies; small caliber military ammunition products for use in infantry and mounted weapons; and industrial products comprising gauge loads and powder-actuated tool loads for maintenance applications in power and concrete industries, and powder-actuated tools in construction industry. The company markets its products through its sales force, as well as directly to various industrial customers, mass merchants, retailers, wholesalers, gun clubs, other distributors, and the U.S. Government and its prime contractors. Olin Corporation was incorporated in 1892 and is based in Clayton, Missouri.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Tractor Supply Company","Symbol":"TSCO","Current Price":"54.65","Latest MA":"54.88","Price Target":58.32793,"Difference from MA":"-0.42%","Difference from Open":"0.24%","Change from Yesterday":"0.66%","Change from Last Report":"0.04","Latest Volume":"4,369,884","Market Cap":"29,193,758,720","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":22.605251,"PB Ratio":2.5530226,"ROE":0.5058,"DTE":233.038,"Industry":"Specialty Retail","Sector":"Consumer Cyclical","Beta":0.814,"Trailing PEG":2.5491,"Trailing PE":26.789217,"Trailing PS":1.9766192,"Quick Ratio":0.086,"Day High":54.9,"Day Low":53.31,"VS Average Volume":0.8461031173,"Company Summary":"Tractor Supply Company operates as a rural lifestyle retailer in the United States. The company offers various merchandise, including livestock and equine feed and equipment, poultry, fencing, and sprayers and chemicals; food, treats, and equipment for dogs, cats, and other small animals, as well as dog wellness products; seasonal and recreation products comprising tractors and riders, lawn and garden, bird feeding, power equipment, and other recreational products; truck, tool, and hardware products, such as truck accessories, trailers, generators, lubricants, batteries, and hardware and tools; and clothing, gift, and décor products consist of clothing, footwear, toys, snacks, and decorative merchandise. It provides its products under the 4health, Paws & Claws, American Farmworks, Producer's Pride, Bit & Bridle, Red Shed, Blue Mountain, Redstone, C.E. Schmidt, Retriever, Country Lane, Ridgecut, Countyline, Royal Wing, Country Tuff, Strive, Dumor, Traveller, Farm Table, Treeline, Groundwork, TSC Tractor Supply Co, Huskee, Untamed, and JobSmart brand names. The company operates its retail stores under the Tractor Supply Company, Petsense by Tractor Supply, and Orscheln Farm and Home names; and operates websites under the TractorSupply.com and Petsense.com names. It sells its products to recreational farmers, ranchers, and others. Tractor Supply Company was founded in 1938 and is based in Brentwood, Tennessee.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Flagstar Financial, Inc.","Symbol":"FLG","Current Price":"11.76","Latest MA":"10.59","Price Target":12.55357,"Difference from MA":"11.09%","Difference from Open":"2.80%","Change from Yesterday":"6.24%","Change from Last Report":"-0.51","Latest Volume":"7,893,311","Market Cap":"4,879,635,968","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.90797,"PB Ratio":0.60528076,"ROE":-0.37158,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.0,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":3.4195065,"Quick Ratio":"N\/A","Day High":11.98,"Day Low":11.26,"VS Average Volume":1.3287223507,"Company Summary":"Flagstar Financial, Inc. operates as the bank holding company for Flagstar Bank, N.A. that provides banking products and services in the United States. The company's deposit products include interest-bearing checking and money market, savings, non-interest-bearing, and retirement accounts, as well as certificates of deposit. Its loan products comprise multi-family loans; commercial real estate loans; acquisition, development, and construction loans; commercial and industrial loans; one-to-four family loans; specialty finance loans and leases; warehouse loans; and other loans, such as home equity lines of credit, boat and recreational vehicle indirect lending, point of sale consumer loans, and other consumer loans, including overdraft loans. The company offers cash management products; non-deposit investment and insurance products; and online banking, mobile banking, and bank-by-phone services. It primarily serves individuals, small and mid-size businesses, and professional associations. The company was formerly known as New York Community Bancorp, Inc. and changed its name to Flagstar Financial, Inc. in October 2024. Flagstar Financial, Inc. was founded in 1859 and is headquartered in Hicksville, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Southwest Airlines Company","Symbol":"LUV","Current Price":"30.54","Latest MA":"29.95","Price Target":32.717,"Difference from MA":"1.96%","Difference from Open":"-2.40%","Change from Yesterday":"-2.40%","Change from Last Report":"-0.24","Latest Volume":"4,981,046","Market Cap":"18,315,968,512","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":12.708215,"PB Ratio":1.7593181,"ROE":-0.00447,"DTE":87.36,"Industry":"Airlines","Sector":"Industrials","Beta":1.153,"Trailing PEG":0.4693,"Trailing PE":40.18421,"Trailing PS":0.669052,"Quick Ratio":0.783,"Day High":31.47,"Day Low":30.525,"VS Average Volume":0.727608568,"Company Summary":"Southwest Airlines Co. operates as a passenger airline company that provides scheduled air transportation services in the United States and near-international markets. As of December 31, 2023, the company operated a total fleet of 817 Boeing 737 aircraft; and served 121 destinations in 42 states, the District of Columbia, and the Commonwealth of Puerto Rico, as well as ten near-international countries, including Mexico, Jamaica, the Bahamas, Aruba, the Dominican Republic, Costa Rica, Belize, Cuba, the Cayman Islands, and Turks and Caicos. It also provides inflight entertainment and connectivity services on Wi-Fi enabled aircraft; and Rapid Rewards loyalty program that enables program members to earn points for dollars spent on Southwest base fares. In addition, the company offers a suite of digital platforms to support customers' travel needs, including websites and apps; and SWABIZ, an online booking tool. Further, it provides ancillary services, such as Southwest's EarlyBird Check-In, upgraded boarding, and transportation of pets and unaccompanied minors. Southwest Airlines Co. was incorporated in 1967 and is headquartered in Dallas, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"United Parcel Service, Inc.","Symbol":"UPS","Current Price":"114.66","Latest MA":"129.53","Price Target":136.97069,"Difference from MA":"-11.49%","Difference from Open":"-0.31%","Change from Yesterday":"-0.25%","Change from Last Report":"-0.07","Latest Volume":"9,938,095","Market Cap":"97,843,134,464","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":12.652159,"PB Ratio":5.8017917,"ROE":0.31422,"DTE":155.425,"Industry":"Integrated Freight & Logistics","Sector":"Industrials","Beta":0.982,"Trailing PEG":1.4756,"Trailing PE":17.011127,"Trailing PS":1.0789222,"Quick Ratio":1.027,"Day High":116.59,"Day Low":113.38,"VS Average Volume":2.3392141088,"Company Summary":"United Parcel Service, Inc., a package delivery company, provides transportation and delivery, distribution, contract logistics, ocean freight, airfreight, customs brokerage, and insurance services. It operates through two segments, U.S. Domestic Package and International Package. The U.S. Domestic Package segment offers time-definite delivery of express letters, documents, small packages, and palletized freight through air and ground services in the United States. The International Package segment provides guaranteed day and time-definite international shipping services comprising guaranteed time-definite express options in Europe, Asia, the Indian sub-continent, the Middle East, Africa, Canada, and Latin America. The company also offers international air and ocean freight forwarding, post-sales, and mail and consulting services. In addition, it provides truckload and customs brokerage services; supply chain solutions to the healthcare and life sciences industries; fulfillment and transportation management services; and integrated supply chain and shipment insurance solutions. United Parcel Service, Inc. was founded in 1907 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"PPG Industries, Inc.","Symbol":"PPG","Current Price":"115.81","Latest MA":"124.17","Price Target":143.22261,"Difference from MA":"-6.73%","Difference from Open":"0.71%","Change from Yesterday":"-5.76%","Change from Last Report":"-0.00","Latest Volume":"2,142,611","Market Cap":"26,869,080,064","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":12.409593,"PB Ratio":3.4500582,"ROE":0.19149,"DTE":91.282,"Industry":"Specialty Chemicals","Sector":"Basic Materials","Beta":1.254,"Trailing PEG":1.0902,"Trailing PE":18.3542,"Trailing PS":1.490243,"Quick Ratio":0.998,"Day High":117.55,"Day Low":115.01,"VS Average Volume":1.1415374501,"Company Summary":"PPG Industries, Inc. manufactures and distributes paints, coatings, and specialty materials in the United States, Canada, the Asia Pacific, Latin America, Europe, the Middle East, and Africa. It operates through two segments, Performance Coatings and Industrial Coatings. The Performance Coatings segment offers coatings, solvents, adhesives, sealants, sundries, and software for automotive and commercial transport\/fleet repair and refurbishing, light industrial coatings, and specialty coatings for signs; wood stains; paints, thermoplastics, pavement marking products, and other advanced technologies for pavement marking for government, commercial infrastructure, painting, and maintenance contractors; and coatings, sealants, transparencies, transparent armor, adhesives, engineered materials, and packaging and chemical management services for commercial, military, regional jet, and general aviation aircraft. The Industrial Coatings segment offers coatings, adhesives and sealants, and metal pretreatments, as well as services and coatings applications for appliances, agricultural and construction equipment, consumer electronics, automotive parts and accessories, building products, kitchenware, and transportation vehicles and other finished products; and on-site coatings services. It also provides coatings for metal cans, closures, plastic and aluminum tubes for food, beverage and personal care, promotional, and specialty packaging; amorphous precipitated silica for tire, battery separator, and other end-uses; TESLIN substrates for labels, e-passports, drivers' licenses, breathable membranes, and loyalty and identification cards; and organic light emitting diode materials, displays and lighting lens materials, optical lenses, color-change products, and photochromic dyes. PPG Industries, Inc. was incorporated in 1883 and is headquartered in Pittsburgh, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Altria Group, Inc.","Symbol":"MO","Current Price":"52.22","Latest MA":"50.63","Price Target":56.20308,"Difference from MA":"3.14%","Difference from Open":"1.78%","Change from Yesterday":"1.29%","Change from Last Report":"-0.02","Latest Volume":"3,401,445","Market Cap":"88,277,286,912","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":9.447328,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Tobacco","Sector":"Consumer Defensive","Beta":0.67,"Trailing PEG":3.6051,"Trailing PE":7.983945,"Trailing PS":4.3353934,"Quick Ratio":0.274,"Day High":52.455,"Day Low":51.3,"VS Average Volume":0.4448901484,"Company Summary":"Altria Group, Inc., through its subsidiaries, manufactures and sells smokeable and oral tobacco products in the United States. The company offers cigarettes primarily under the Marlboro brand; large cigars and pipe tobacco under the Black & Mild brand; moist smokeless tobacco and snus products under the Copenhagen, Skoal, Red Seal, and Husky brands; oral nicotine pouches under the on! brand; and e-vapor products under the NJOY ACE brand. It sells its products to distributors, as well as large retail organizations, such as chain stores. The company was founded in 1822 and is headquartered in Richmond, Virginia.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Mastercard Incorporated","Symbol":"MA","Current Price":"558.98","Latest MA":"494.64","Price Target":593.3853,"Difference from MA":"13.01%","Difference from Open":"-0.86%","Change from Yesterday":"-1.25%","Change from Last Report":"-0.33","Latest Volume":"2,069,423","Market Cap":"510,942,904,320","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":29.790976,"PB Ratio":69.12081,"ROE":1.7757801,"DTE":244.839,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.101,"Trailing PEG":2.1742,"Trailing PE":40.30137,"Trailing PS":18.766727,"Quick Ratio":0.891,"Day High":565.54,"Day Low":558.0,"VS Average Volume":0.7975709313,"Company Summary":"Mastercard Incorporated, a technology company, provides transaction processing and other payment-related products and services in the United States and internationally. The company offers integrated products and value-added services for account holders, merchants, financial institutions, digital partners, businesses, governments, and other organizations, such as programs that enable issuers to provide consumers with credits to defer payments; payment products and solutions that allow its customers to access funds in deposit and other accounts; prepaid programs services; and commercial credit, debit, and prepaid payment products and solutions. It also provides solutions that enable businesses or governments to make payments to businesses, including Virtual Card Number, which is generated dynamically from a physical card and leverages the credit limit of the funding account; a platform to optimize supplier payment enablement campaigns for financial institutions; and treasury intelligence platform that offers corporations with recommendations to enhance working capital performance and accelerate spend on cards. In addition, the company offers Mastercard Send, which partners with digital messaging and payment platforms to enable consumers to send money directly within applications to other consumers; and Mastercard Cross-Border Services enables a range of payment flows through a distribution network with a single point of access to send and receive money globally through various channels, including bank accounts, mobile wallets, cards, and cash payouts. Further, it provides cyber and intelligence solutions; insights and analytics, consulting, marketing, loyalty, processing, and payment gateway solutions for e-commerce merchants; and open banking and digital identity services. The company offers payment solutions and services under the MasterCard, Maestro, and Cirrus name. Mastercard Incorporated was founded in 1966 and is headquartered in Purchase, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Atlassian Corporation","Symbol":"TEAM","Current Price":"307.75","Latest MA":"204.60","Price Target":345.29858,"Difference from MA":"50.42%","Difference from Open":"-3.83%","Change from Yesterday":"15.20%","Change from Last Report":"-0.11","Latest Volume":"5,567,348","Market Cap":"80,146,948,096","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":71.52353,"PB Ratio":77.634964,"ROE":-0.43517,"DTE":121.008,"Industry":"Software - Application","Sector":"Technology","Beta":0.711,"Trailing PEG":4.0083,"Trailing PE":"N\/A","Trailing PS":17.542967,"Quick Ratio":1.109,"Day High":324.37,"Day Low":307.21,"VS Average Volume":2.6507331078,"Company Summary":"Atlassian Corporation, through its subsidiaries, designs, develops, licenses, and maintains various software products worldwide. Its product portfolio includes Jira, a project management system that connects technical and business teams so they can better plan, organize, track, and manage their work and projects; Confluence, a connected workspace that empowers organizations to create, organize, find, and share information; Loom, an asynchronous video communication tool that helps users communicate through instantly shareable videos; and Trello that captures and adds structure to fluid and fast-forming work for individuals and teams. The company also offers Jira Service Management, an intuitive and flexible service desk product for creating and managing service experiences for various service team providers, such as IT, legal, and HR teams; and Jira Align, an Atlassian's enterprise agility solution designed to help businesses to adapt and respond dynamic business conditions with a focus on value-creation. In addition, it provides Bitbucket, an enterprise-ready Git solution that enables professional dev teams to manage, collaborate, and deploy quality code; Atlassian Access, an enterprise-wide product for enhanced security and centralized administration that works across every Atlassian cloud product; Jira Product Discovery, a prioritization and road mapping tool; and Compass, a developer portal that provides a unified real-time representation of engineering teams' output in one place. Further, the company's portfolio includes Bamboo, Crowd, Crucible, Fisheye, Opsgenie, Sourcetree, Statuspage, and Atlassian cloud apps. The company was founded in 2002 and is headquartered in Sydney, Australia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Dow Inc.","Symbol":"DOW","Current Price":"38.95","Latest MA":"47.72","Price Target":46.72222,"Difference from MA":"-18.38%","Difference from Open":"0.31%","Change from Yesterday":"0.96%","Change from Last Report":"-0.19","Latest Volume":"5,593,505","Market Cap":"27,402,207,232","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":13.735082,"PB Ratio":1.4890078,"ROE":0.05863,"DTE":95.059,"Industry":"Chemicals","Sector":"Basic Materials","Beta":1.222,"Trailing PEG":0.5728,"Trailing PE":24.80573,"Trailing PS":0.63460416,"Quick Ratio":0.8,"Day High":39.185,"Day Low":38.41,"VS Average Volume":0.7281497346,"Company Summary":"Dow Inc., through its subsidiaries, engages in the provision of various materials science solutions for packaging, infrastructure, mobility, and consumer applications in the United States, Canada, Europe, the Middle East, Africa, India, the Asia Pacific, and Latin America. The company operates through Packaging & Specialty Plastics, Industrial Intermediates & Infrastructure, and Performance Materials & Coatings segments. The Packaging & Specialty Plastics segment provides ethylene, and propylene and aromatics products; and polyethylene, polyolefin elastomers, ethylene vinyl acetate, and ethylene propylene diene monomer rubbers for mobility and transportation, consumer, wire and cable, and construction end-markets. The Industrial Intermediates & Infrastructure segment offers purified ethylene, ethylene and ethanol amines, propylene glycol and polyether polyols, aromatic isocyanates and coatings, adhesives, sealants, elastomers, and composites. This segment also provides caustic soda, and ethylene dichloride and vinyl chloride monomers; and cellulose ethers, redispersible latex powders, and acrylic emulsions. The Performance Materials and Coatings segment provides architectural paints and coatings, and industrial coatings that are used in maintenance and protective industries, wood, metal packaging, traffic markings, thermal paper, and leather; and silicon metal, siloxanes, and intermediates used as key materials in manufacturing differentiated downstream silicone products. It also engages in property and casualty insurance, as well as reinsurance business. Dow Inc. was incorporated in 2018 and is headquartered in Midland, Michigan.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Visa Inc.","Symbol":"V","Current Price":"343.32","Latest MA":"289.67","Price Target":363.36444,"Difference from MA":"18.52%","Difference from Open":"-0.91%","Change from Yesterday":"0.07%","Change from Last Report":"-0.13","Latest Volume":"4,333,413","Market Cap":"662,844,538,880","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":27.0053,"PB Ratio":21.701645,"ROE":0.50708,"DTE":53.239,"Industry":"Credit Services","Sector":"Financial Services","Beta":0.952,"Trailing PEG":2.2753,"Trailing PE":34.643795,"Trailing PS":18.450274,"Quick Ratio":0.837,"Day High":351.25,"Day Low":343.32,"VS Average Volume":0.7305157746,"Company Summary":"Visa Inc. operates as a payment technology company in the United States and internationally. The company operates VisaNet, a transaction processing network that enables authorization, clearing, and settlement of payment transactions. It also offers credit, debit, and prepaid card products; tap to pay, tokenization, and click to pay services; Visa Direct, a solution that facilitates the delivery of funds to eligible cards, bank accounts, and digital wallets; Visa B2B Connect, a multilateral business-to-business cross-border payments network; Visa Cross-Border Solution, a cross-border consumer payments solution; and Visa DPS that provides a range of value-added services, including fraud mitigation, dispute management, data analytics, campaign management, a suite of digital solutions, and contact center services. The company also provides acceptance solutions, which include Cybersource and Authorize.net that provides new and enhanced payment integrations with ecommerce platforms, enabling sellers and acquirers to offer tailored commerce experiences; risk and identity solutions, such as Visa Advanced Authorization, Visa Secure, Visa Consumer Authentication Service, Visa Protect Authentication Intelligence, and Visa Provisioning Intelligence; and Visa Consulting and Analytics, a payment consulting advisory services. It provides its services under the Visa, Visa Electron, Interlink, V PAY, and PLUS brands. The company serves merchants, financial institutions, and government entities. Visa Inc. was founded in 1958 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Weyerhaeuser Company","Symbol":"WY","Current Price":"30.23","Latest MA":"30.53","Price Target":35.6,"Difference from MA":"-0.98%","Difference from Open":"-1.14%","Change from Yesterday":"-2.37%","Change from Last Report":"-0.20","Latest Volume":"2,411,689","Market Cap":"21,964,574,720","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":24.962221,"PB Ratio":2.2131927,"ROE":0.052989997,"DTE":51.335,"Industry":"REIT - Specialty","Sector":"Real Estate","Beta":1.428,"Trailing PEG":11.1207,"Trailing PE":41.410957,"Trailing PS":3.0548782,"Quick Ratio":1.27,"Day High":30.95,"Day Low":30.15,"VS Average Volume":0.7144147013,"Company Summary":"Weyerhaeuser Company, one of the world's largest private owners of timberlands, began operations in 1900. We own or control approximately 11 million acres of timberlands in the U.S. and manage additional timberlands under long-term licenses in Canada. We manage these timberlands on a sustainable basis in compliance with internationally recognized forestry standards. We are also one of the largest manufacturers of wood products in North America. Our company is a real estate investment trust. In 2022, we generated $10.2 billion in net sales and employed approximately 9,200 people who serve customers worldwide. Our common stock trades on the New York Stock Exchange under the symbol WY.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Danaher Corporation","Symbol":"DHR","Current Price":"223.88","Latest MA":"252.48","Price Target":269.50385,"Difference from MA":"-11.33%","Difference from Open":"0.26%","Change from Yesterday":"0.36%","Change from Last Report":"-0.36","Latest Volume":"2,472,893","Market Cap":"160,992,116,736","Earning Date":"2025-01-29","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":25.742832,"PB Ratio":3.151819,"ROE":0.07586,"DTE":36.69,"Industry":"Diagnostics & Research","Sector":"Healthcare","Beta":0.881,"Trailing PEG":3.85,"Trailing PE":42.32136,"Trailing PS":6.7809,"Quick Ratio":0.916,"Day High":227.5,"Day Low":222.395,"VS Average Volume":0.7737854672,"Company Summary":"Danaher Corporation designs, manufactures, and markets professional, medical, industrial, and commercial products and services worldwide. The Biotechnology segments offers bioprocess technologies, consumables, and services that advance, accelerate, and integrate the development and manufacture of therapeutics; cell line and cell culture media development services; cell culture media, process liquids and buffers for manufacturing, chromatography resins, filtration technologies, aseptic fill finish; single-use hardware and consumables and services, such as the design and installation of full manufacturing suites; lab filtration, separation, and purification; lab-scale protein purification and analytical tools; reagents, membranes, and services; and healthcare filtration solutions. The Life Sciences segment provides mass spectrometers; flow cytometry, genomics, lab automation, centrifugation, liquid handling automation instruments, antibodies and reagents, and particle counting and characterization; microscopes; protein consumables; industrial filtration products; and genomic medicines, such as custom nucleic acid products, plasmid DNA, RNA, and proteins under the ABCAM, ALDEVRON, BECKMAN COULTER, IDT, LEICA MICROSYSTEMS, MOLECULAR DEVICES, PALL, PHENOMENEX and SCIEX brands. The Diagnostics segment offers chemistry, immunoassay, microbiology, and automation systems; and molecular, acute care, and pathology diagnostics products. This segment also provides clinical instruments, reagents, consumables, software, and services for hospitals, physicians' offices, reference laboratories, and other critical care settings. The company has a research  collaboration  with Stanford  University's Department  of  Bioengineering for cancer drug development. The company was formerly known as Diversified Mortgage Investors, Inc. and changed its name to Danaher Corporation in 1984. Danaher Corporation was founded in 1969 and is based in Washington, the District of Columbia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Western Digital Corporation","Symbol":"WDC","Current Price":"66.82","Latest MA":"66.56","Price Target":82.95,"Difference from MA":"0.39%","Difference from Open":"2.48%","Change from Yesterday":"1.57%","Change from Last Report":"-0.16","Latest Volume":"4,421,247","Market Cap":"23,100,209,152","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":9.473794,"PB Ratio":2.1186469,"ROE":0.033239998,"DTE":"N\/A","Industry":"Computer Hardware","Sector":"Technology","Beta":1.394,"Trailing PEG":null,"Trailing PE":19.312138,"Trailing PS":1.609995,"Quick Ratio":0.683,"Day High":67.955,"Day Low":64.8318,"VS Average Volume":0.8118031158,"Company Summary":"Western Digital Corporation develops, manufactures, and sells data storage devices and solutions in the United States, China, Hong Kong, Europe, the Middle East, Africa, rest of Asia, and internationally. It offers client devices, including hard disk drives (HDDs) and solid state drives (SSDs) for desktop and notebook personal computers (PCs), gaming consoles, and set top boxes; and flash-based embedded storage products for mobile phones, tablets, notebook PCs, and other portable and wearable devices, as well as automotive, Internet of Things, industrial, and connected home applications. The company also provides enterprise HDDs; enterprise SSDs consisting of flash-based SSDs and software solutions for use in enterprise servers, online transactions, artificial intelligence-related workloads, data analysis, and other enterprise applications; and data storage platforms. In addition, it offers external HDD storage products in mobile and desktop form; client portable SSDs; removable cards that are used in consumer devices comprising mobile phones, tablets, imaging systems, and cameras and smart video systems; universal serial bus flash drives for use in the computing and consumer markets; and wireless drive products used in-field backup of created content, as well as wireless streaming of high-definition movies, photos, music, documents to tablets, smartphones, and PCs. The company sells its products under the Western Digital, SanDisk, and WD brands to original equipment manufacturers, distributors, dealers, resellers, and retailers. Western Digital Corporation was founded in 1970 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Tesla, Inc.","Symbol":"TSLA","Current Price":"413.60","Latest MA":"291.28","Price Target":324.74536,"Difference from MA":"42.00%","Difference from Open":"3.01%","Change from Yesterday":"3.34%","Change from Last Report":"-0.47","Latest Volume":"50,155,906","Market Cap":"1,330,352,619,520","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":104.29669,"PB Ratio":18.967257,"ROE":0.20389,"DTE":18.078,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":2.295,"Trailing PEG":4.9054,"Trailing PE":202.7451,"Trailing PS":13.693799,"Quick Ratio":1.214,"Day High":419.98,"Day Low":401.425,"VS Average Volume":0.5559690611,"Company Summary":"Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners; and provision of service and repairs to its energy product customers, including under warranty, as well as various financing options to its solar customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was incorporated in 2003 and is headquartered in Austin, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"QUALCOMM Incorporated","Symbol":"QCOM","Current Price":"174.56","Latest MA":"168.85","Price Target":202.6071,"Difference from MA":"3.38%","Difference from Open":"1.19%","Change from Yesterday":"1.45%","Change from Last Report":"-0.34","Latest Volume":"3,493,063","Market Cap":"192,956,874,752","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":14.330432,"PB Ratio":7.3947296,"ROE":0.42253,"DTE":58.765,"Industry":"Semiconductors","Sector":"Technology","Beta":1.286,"Trailing PEG":1.6894,"Trailing PE":19.525728,"Trailing PS":4.952438,"Quick Ratio":1.64,"Day High":176.79,"Day Low":172.51,"VS Average Volume":0.4221598119,"Company Summary":"QUALCOMM Incorporated engages in the development and commercialization of foundational technologies for the wireless industry worldwide. It operates through three segments: Qualcomm CDMA Technologies (QCT); Qualcomm Technology Licensing (QTL); and Qualcomm Strategic Initiatives (QSI). The QCT segment develops and supplies integrated circuits and system software with advanced connectivity and high-performance, and low-power computing technologies for use in mobile devices; automotive systems for connectivity, digital cockpit, and ADAS\/AD; and IoT, including consumer electronic devices, industrial devices, and edge networking products. The QTL segment grants licenses or provides rights to use portions of its intellectual property portfolio, which include various patent rights useful in the manufacture and sale of wireless products comprising products implementing CDMA2000, WCDMA, LTE and\/or OFDMA-based 5G products. The QSI segment invests in early-stage companies in various industries, including 5G, artificial intelligence, automotive, consumer, enterprise, cloud, IoT, and extended reality, and investments, including non-marketable equity securities and, to a lesser extent, marketable equity securities, and convertible debt instruments. It also provides development, and other services and sells related products to the United States government agencies and their contractors. The company was incorporated in 1985 and is headquartered in San Diego, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Microsoft Corporation","Symbol":"MSFT","Current Price":"416.81","Latest MA":"426.49","Price Target":507.09418,"Difference from MA":"-2.27%","Difference from Open":"-0.46%","Change from Yesterday":"0.46%","Change from Last Report":"-0.14","Latest Volume":"17,705,677","Market Cap":"3,098,557,022,208","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":27.726004,"PB Ratio":11.541187,"ROE":0.35604,"DTE":33.657,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.904,"Trailing PEG":2.2019,"Trailing PE":33.586624,"Trailing PS":12.189925,"Quick Ratio":1.163,"Day High":420.68,"Day Low":415.23,"VS Average Volume":0.8324061249,"Company Summary":"Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services. This segment also provides LinkedIn; and dynamics business solutions, including Dynamics 365, a set of intelligent, cloud-based applications across ERP, CRM, power apps, and power automate; and on-premises ERP and CRM applications. The Intelligent Cloud segment offers server products and cloud services, such as azure and other cloud services; SQL and windows server, visual studio, system center, and related client access licenses, as well as nuance and GitHub; and enterprise services including enterprise support services, industry solutions, and nuance professional services. The More Personal Computing segment offers Windows, including windows OEM licensing and other non-volume licensing of the Windows operating system; Windows commercial comprising volume licensing of the Windows operating system, windows cloud services, and other Windows commercial offerings; patent licensing; and windows Internet of Things; and devices, such as surface, HoloLens, and PC accessories. Additionally, this segment provides gaming, which includes Xbox hardware and content, and first- and third-party content; Xbox game pass and other subscriptions, cloud gaming, advertising, third-party disc royalties, and other cloud services; and search and news advertising, which includes Bing, Microsoft News and Edge, and third-party affiliates. The company sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online, and retail stores. The company was founded in 1975 and is headquartered in Redmond, Washington.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Tetra Tech, Inc.","Symbol":"TTEK","Current Price":"36.83","Latest MA":"43.93","Price Target":45.0,"Difference from MA":"-16.18%","Difference from Open":"0.97%","Change from Yesterday":"0.68%","Change from Last Report":"-0.47","Latest Volume":"3,200,873","Market Cap":"9,870,131,200","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":23.184729,"PB Ratio":5.356364,"ROE":0.18655,"DTE":55.515,"Industry":"Engineering & Construction","Sector":"Industrials","Beta":0.939,"Trailing PEG":null,"Trailing PE":38.76316,"Trailing PS":2.3307307,"Quick Ratio":1.111,"Day High":37.33,"Day Low":35.87,"VS Average Volume":1.328634984,"Company Summary":"Tetra Tech, Inc. provides consulting and engineering services in the United States and internationally. The company operates through two segments, Government Services Group (GSG) and Commercial\/International Services Group (CIG). The GSG segment offers early data collection and monitoring, data analysis and information management, science and engineering applied research, engineering design, project management, and operations and maintenance services; and climate change and energy management consulting, as well as greenhouse gas inventory assessment, certification, reduction, and management services. This segment serves federal, state, and local governments; and development agencies in water resources analysis and water management, environmental monitoring, data analytics, government consulting, waste management, and a range of civil infrastructure master planning and engineering design markets. The CIG segment provides early data collection and monitoring, data analysis and information management, feasibility studies and assessments, science and engineering applied research, engineering design, project management, and operations and maintenance services; and environmental remediation and reconstruction services, and industrial water treatment services. This segment serves natural resources, energy, and utilities markets, as well as sustainable infrastructure master planning and engineering design for facilities, transportation, and local development projects. Tetra Tech, Inc. was founded in 1966 and is headquartered in Pasadena, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Las Vegas Sands Corp.","Symbol":"LVS","Current Price":"45.64","Latest MA":"46.20","Price Target":58.93789,"Difference from MA":"-1.21%","Difference from Open":"-4.59%","Change from Yesterday":"-5.37%","Change from Last Report":"-0.35","Latest Volume":"5,516,841","Market Cap":"33,093,378,048","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":15.59277,"PB Ratio":9.658147,"ROE":0.45166,"DTE":384.206,"Industry":"Resorts & Casinos","Sector":"Consumer Cyclical","Beta":1.117,"Trailing PEG":0.7279,"Trailing PE":23.28796,"Trailing PS":2.9242182,"Quick Ratio":0.864,"Day High":47.9,"Day Low":45.29,"VS Average Volume":1.1468532035,"Company Summary":"Las Vegas Sands Corp., together with its subsidiaries, develops, owns, and operates integrated resorts in Macao and Singapore. It owns and operates The Venetian Macao Resort Hotel, the Londoner Macao, The Parisian Macao, The Plaza Macao and Four Seasons Hotel Macao, Cotai Strip, and the Sands Macao in Macao, the People's Republic of China; and Marina Bay Sands in Singapore. The company's integrated resorts feature accommodations, gaming, entertainment and retail malls, convention and exhibition facilities, celebrity chef restaurants, and other amenities. Las Vegas Sands Corp. was founded in 1988 and is based in Las Vegas, Nevada.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Levi Strauss & Co","Symbol":"LEVI","Current Price":"19.11","Latest MA":"18.16","Price Target":21.28714,"Difference from MA":"5.23%","Difference from Open":"2.08%","Change from Yesterday":"1.33%","Change from Last Report":"-0.26","Latest Volume":"2,436,220","Market Cap":"7,565,285,888","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":13.236456,"PB Ratio":4.047871,"ROE":0.08122,"DTE":120.196,"Industry":"Apparel Manufacturing","Sector":"Consumer Cyclical","Beta":1.173,"Trailing PEG":null,"Trailing PE":36.750004,"Trailing PS":1.2285497,"Quick Ratio":0.646,"Day High":19.67,"Day Low":18.6919,"VS Average Volume":1.3836608724,"Company Summary":"Levi Strauss & Co. designs, markets, and sells apparels and related accessories for men, women, and children worldwide. The company offers jeans, casual and dress pants, activewears, tops, shorts, skirts, dresses, jumpsuits, shirts, sweaters, jackets, footwear, and related accessories under the Levi's, Dockers, Signature by Levi Strauss & Co., Denizen, and Beyond Yoga brands. It also licenses Levi's and Dockers trademarks for various product categories, including footwear, belts, wallets, bags, outerwear, sweaters, dress shirts, kids wear, sleepwear, and hosiery. In addition, the company sells its products through third-party retailers, such as department stores, specialty retailers, third-party e-commerce sites, and franchisees; and directly to consumers through various formats, including company-operated mainline and outlet stores, company-operated e-commerce sites, and select shop-in-shops located in department stores and other third-party retail locations. Further, it operates brand-dedicated stores and shop-in-shops. The company was founded in 1853 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Alibaba Group Holding Limited","Symbol":"BABA","Current Price":"98.64","Latest MA":"87.83","Price Target":120.953445,"Difference from MA":"12.31%","Difference from Open":"-3.29%","Change from Yesterday":"-3.91%","Change from Last Report":"-0.36","Latest Volume":"22,388,079","Market Cap":"234,363,715,584","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":1.3915502,"PB Ratio":0.24332845,"ROE":0.05668,"DTE":22.796,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":0.349,"Trailing PEG":0.6781,"Trailing PE":20.338144,"Trailing PS":0.24663426,"Quick Ratio":0.97,"Day High":102.5,"Day Low":98.61,"VS Average Volume":1.4333845401,"Company Summary":"Alibaba Group Holding Limited, through its subsidiaries, provides technology infrastructure and marketing reach to help merchants, brands, retailers, and other businesses to engage with their users and customers in the People's Republic of China and internationally. The company operates through seven segments: China Commerce, International Commerce, Local Consumer Services, Cainiao, Cloud, Digital Media and Entertainment, and Innovation Initiatives and Others. It operates Taobao and Tmall, which are digital retail platforms; Alimama, a proprietary monetization platform; 1688.com and Alibaba.com, which are online wholesale marketplaces; AliExpress, a retail marketplace; Lazada, Trendyol, and Daraz that are e-commerce platforms; Freshippo, a retail platform for groceries and fresh goods; and Tmall Global, an import e-commerce platform. The company also operates Cainiao Network logistic services platform; Ele.me, an on-demand delivery and local services platform; Koubei, a restaurant and local services guide platform; and Fliggy, an online travel platform. In addition, it offers pay-for-performance, in-feed, and display marketing services; and Taobao Ad Network and Exchange, a real-time online bidding marketing exchange. Further, the company provides elastic computing, storage, network, security, database, big data, and IoT services; and hardware, software license, software installation, and application development and maintenance services. Additionally, it operates Youku, an online video platform; Quark, a platform for information search, storage, and consumption; Alibaba Pictures and other content platforms that provide online videos, films, live events, news feeds, literature, music, and others; Amap, a mobile digital map, navigation, and real-time traffic information app; DingTalk, a business efficiency mobile app; and Tmall Genie smart speaker. The company was incorporated in 1999 and is based in Hangzhou, the People's Republic of China.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Meta Platforms, Inc.","Symbol":"META","Current Price":"692.95","Latest MA":"560.53","Price Target":727.88446,"Difference from MA":"23.62%","Difference from Open":"0.18%","Change from Yesterday":"0.86%","Change from Last Report":"-0.16","Latest Volume":"11,486,169","Market Cap":"1,755,697,774,592","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":23.784908,"PB Ratio":10.63034,"ROE":0.36134,"DTE":29.811,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.215,"Trailing PEG":1.4637,"Trailing PE":29.066664,"Trailing PS":11.23812,"Quick Ratio":2.568,"Day High":705.2999,"Day Low":689.75,"VS Average Volume":0.880234737,"Company Summary":"Meta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and wearables worldwide. It operates in two segments, Family of Apps and Reality Labs. The Family of Apps segment offers Facebook, which enables people to share, discuss, discover, and connect with interests; Instagram, a community for sharing photos, videos, and private messages, as well as feed, stories, reels, video, live, and shops; Messenger, a messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls; and WhatsApp, a messaging application that is used by people and businesses to communicate and transact privately. The Reality Labs segment provides augmented and virtual reality related products comprising consumer hardware, software, and content that help people feel connected, anytime, and anywhere. The company was formerly known as Facebook, Inc. and changed its name to Meta Platforms, Inc. in October 2021. The company was incorporated in 2004 and is headquartered in Menlo Park, California","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Annaly Capital Management Inc.","Symbol":"NLY","Current Price":"20.38","Latest MA":"18.84","Price Target":21.04545,"Difference from MA":"8.20%","Difference from Open":"-0.44%","Change from Yesterday":"-0.42%","Change from Last Report":"-0.32","Latest Volume":"6,352,720","Market Cap":"11,786,914,816","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":7.203526,"PB Ratio":1.0427752,"ROE":0.0127,"DTE":687.699,"Industry":"REIT - Mortgage","Sector":"Real Estate","Beta":1.579,"Trailing PEG":null,"Trailing PE":12.580246,"Trailing PS":31.911034,"Quick Ratio":0.371,"Day High":20.69,"Day Low":20.375,"VS Average Volume":0.9774953812,"Company Summary":"Annaly Capital Management, Inc., a diversified capital manager, engages in mortgage finance. The company invests in agency mortgage-backed securities collateralized by residential mortgages; non-agency residential whole loans and securitized products within the residential and commercial markets; mortgage servicing rights; agency commercial mortgage-backed securities; to-be-announced forward contracts; residential mortgage loans; and agency or private label credit risk transfer securities. It has elected to be taxed as a real estate investment trust (REIT). As a REIT, it is not subject to federal income tax to the extent that it distributes its taxable income to its shareholders. The company was incorporated in 1996 and is based in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Corning Incorporated","Symbol":"GLW","Current Price":"52.01","Latest MA":"45.05","Price Target":55.49429,"Difference from MA":"15.44%","Difference from Open":"3.12%","Change from Yesterday":"4.05%","Change from Last Report":"-0.09","Latest Volume":"3,947,067","Market Cap":"44,475,146,240","Earning Date":"2025-01-29","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":19.255905,"PB Ratio":3.8126833,"ROE":0.019299999,"DTE":72.739,"Industry":"Electronic Components","Sector":"Technology","Beta":1.029,"Trailing PEG":0.5355,"Trailing PE":89.663795,"Trailing PS":3.5266945,"Quick Ratio":0.776,"Day High":52.38,"Day Low":50.24,"VS Average Volume":0.844313898,"Company Summary":"Corning Incorporated engages in the display technologies, optical communications, environmental technologies, specialty materials, and life sciences businesses in the United States and internationally. The company's Display Technologies segment offers glass substrates for flat panel displays, including liquid crystal displays and organic light-emitting diodes that are used in televisions, notebook computers, desktop monitors, tablets, and handheld devices. Its Optical Communications segment provides optical fibers and cables; and hardware and equipment products, such as cable assemblies, fiber optic hardware and connectors, optical components and couplers, closures, network interface devices, and other accessories for the telecommunications industry, businesses, governments, and individuals. The company's Specialty Materials segment manufactures products that offer material formulations for glass, glass ceramics, crystals, precision metrology instruments, and software, as well as glass wafers and substrates, tinted sunglasses, and radiation shielding products for various markets comprising mobile consumer electronics, semiconductor equipment optics and consumables, aerospace and defense optics, radiation shielding products, sunglasses, and telecommunications components. Its Environmental Technologies segment provides ceramic substrates and filter products for emissions control in mobile, gasoline, and diesel applications. The company's Life Sciences segment offers laboratory products, including consumables, such as plastic vessels, liquid handling plastics, specialty surfaces, cell culture media, and serum, as well as general labware, and glassware and equipment under the Corning, Pyrex, Falcon, and Axygen brands. The company was formerly known as Corning Glass Works and changed its name to Corning Incorporated in April 1989. Corning Incorporated was founded in 1851 and is headquartered in Corning, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"General Motors Company","Symbol":"GM","Current Price":"49.87","Latest MA":"49.51","Price Target":60.05308,"Difference from MA":"0.73%","Difference from Open":"0.39%","Change from Yesterday":"0.65%","Change from Last Report":"-0.21","Latest Volume":"11,451,340","Market Cap":"49,615,773,696","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":4.3277926,"PB Ratio":0.77326864,"ROE":0.14167,"DTE":174.581,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":1.414,"Trailing PEG":7.5411,"Trailing PE":7.8281007,"Trailing PS":0.2715414,"Quick Ratio":0.948,"Day High":51.73,"Day Low":49.565,"VS Average Volume":1.0117029288,"Company Summary":"General Motors Company designs, builds, and sells trucks, crossovers, cars, and automobile parts; and provide software-enabled services and subscriptions worldwide. The company operates through GM North America, GM International, Cruise, and GM Financial segments. It markets its vehicles primarily under the Buick, Cadillac, Chevrolet, GMC, Baojun, and Wuling brand names. In addition, the company sells trucks, crossovers, cars, and automobile parts through retail dealers, and distributors and dealers, as well as to fleet customers, including daily rental car companies, commercial fleet customers, leasing companies, and governments. Further, it offers range of after-sale services through dealer network, such as maintenance, light repairs, collision repairs, vehicle accessories, and extended service warranties. Additionally, the company provides automotive financing; and software-enabled services and subscriptions. General Motors Company was founded in 1908 and is headquartered in Detroit, Michigan.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"International Business Machines","Symbol":"IBM","Current Price":"254.59","Latest MA":"209.80","Price Target":239.09,"Difference from MA":"21.35%","Difference from Open":"-0.57%","Change from Yesterday":"-1.44%","Change from Last Report":"-0.11","Latest Volume":"2,884,335","Market Cap":"235,405,361,152","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":22.394926,"PB Ratio":9.628971,"ROE":0.26729,"DTE":245.112,"Industry":"Information Technology Services","Sector":"Technology","Beta":0.71,"Trailing PEG":8.5844,"Trailing PE":39.59409,"Trailing PS":3.7616708,"Quick Ratio":0.896,"Day High":257.235,"Day Low":251.9254,"VS Average Volume":0.744418862,"Company Summary":"International Business Machines Corporation, together with its subsidiaries, provides integrated solutions and services worldwide. The company operates through Software, Consulting, Infrastructure, and Financing segments. The Software segment offers a hybrid cloud and AI platforms that allows clients to realize their digital and AI transformations across the applications, data, and environments in which they operate. The Consulting segment focuses on skills integration for strategy, experience, technology, and operations by domain and industry. The Infrastructure segment provides on-premises and cloud based server, and storage solutions, as well as life-cycle services for hybrid cloud infrastructure deployment. The Financing segment offers client and commercial financing, facilitates IBM clients' acquisition of hardware, software, and services. The company has a strategic partnership to various companies including hyperscalers, service providers, global system integrators, and software and hardware vendors that includes Adobe, Amazon Web services, Microsoft, Oracle, Salesforce, Samsung Electronics and SAP, and others. The company was formerly known as Computing-Tabulating-Recording Co. International Business Machines Corporation was incorporated in 1911 and is headquartered in Armonk, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"SiriusXM Holdings Inc.","Symbol":"SIRI","Current Price":"23.57","Latest MA":"27.26","Price Target":24.15385,"Difference from MA":"-13.54%","Difference from Open":"1.27%","Change from Yesterday":"1.95%","Change from Last Report":"-0.40","Latest Volume":"5,574,784","Market Cap":"7,983,091,712","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.640357,"PB Ratio":0.73567057,"ROE":-0.46799,"DTE":98.775,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.05,"Trailing PEG":0.196,"Trailing PE":"N\/A","Trailing PS":0.90727264,"Quick Ratio":0.26,"Day High":24.12,"Day Low":23.13,"VS Average Volume":1.0095003549,"Company Summary":"Sirius XM Holdings Inc. operates as an audio entertainment company in North America. It operates in two segments, Sirius XM, and Pandora and Off-platform. The company's Sirius XM segment provides music, sports, entertainment, comedy, talk, news, traffic and weather channels, and other content, as well as podcast and infotainment services on subscription fee basis; and live, curated, and exclusive and on demand programming services through satellite radio systems and streamed through applications for mobile and home devices, and other consumer electronic equipment. This segment also distributes satellite radios through automakers and retailers, as well as its website; podcasts, including true crime, news, politics, music, comedy, sports, and entertainment; and offers location-based services through two-way wireless connectivity, including safety, security, convenience, maintenance and data, remote vehicles diagnostic, and stolen or parked vehicle locator services. In addition, this segment provides music channels on the DISH Network satellite television service as a programming package; Travel Link, a suite of data services that include graphical weather, fuel prices, sports schedule and scores, and movie listings; graphic information related to road closings, traffic flow, and incident data for consumers with in-vehicle navigation systems; real-time weather services in vehicles, boats, and planes; and music programming and commercial-free music services for office, restaurants, and other business. Its Pandora and Off-platform segment operates music, comedy, and podcast streaming platform, which offers personalized experience for listener through computers, tablets, mobile devices, vehicle speakers, and connected devices; and provides advertising services. The company was incorporated in 2013 and is headquartered in New York.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Starbucks Corporation","Symbol":"SBUX","Current Price":"108.58","Latest MA":"91.42","Price Target":105.97067,"Difference from MA":"18.77%","Difference from Open":"-0.39%","Change from Yesterday":"-0.37%","Change from Last Report":"-0.21","Latest Volume":"7,478,258","Market Cap":"123,333,591,040","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":29.632107,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":0.962,"Trailing PEG":2.6556,"Trailing PE":35.024193,"Trailing PS":3.4092467,"Quick Ratio":0.524,"Day High":109.36,"Day Low":108.15,"VS Average Volume":0.874131305,"Company Summary":"Starbucks Corporation, together with its subsidiaries, operates as a roaster, marketer, and retailer of coffee worldwide. The company operates through three segments: North America, International, and Channel Development. Its stores offer coffee, tea, and other beverages, roasted whole beans and ground coffees, single serve products, and ready-to-drink beverages; and various food products, such as pastries, breakfast sandwiches, and lunch items. The company also licenses its trademarks through licensed stores, and grocery and foodservice accounts. The company offers its products under the Starbucks Coffee, Teavana, Seattle's Best Coffee, Ethos, and Starbucks Reserve brands. Starbucks Corporation was founded in 1971 and is based in Seattle, Washington.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Boeing Company (The)","Symbol":"BA","Current Price":"178.19","Latest MA":"165.63","Price Target":193.4675,"Difference from MA":"7.58%","Difference from Open":"-1.29%","Change from Yesterday":"-0.74%","Change from Last Report":"-0.23","Latest Volume":"2,771,374","Market Cap":"133,499,052,032","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":41.509514,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.572,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":1.8214434,"Quick Ratio":0.238,"Day High":181.78,"Day Low":178.15,"VS Average Volume":0.2440108741,"Company Summary":"The Boeing Company, together with its subsidiaries, designs, develops, manufactures, sells, services, and supports commercial jetliners, military aircraft, satellites, missile defense, human space flight and launch systems, and services worldwide. The company operates through Commercial Airplanes; Defense, Space & Security; and Global Services segments. The Commercial Airplanes segment develops, produces, and markets commercial jet aircraft for passenger and cargo requirements, as well as provides fleet support services. The Defense, Space & Security segment engages in the research, development, production, and modification of manned and unmanned military aircraft and weapons systems; strategic defense and intelligence systems, which include strategic missile and defense systems, command, control, communications, computers, intelligence, surveillance and reconnaissance, cyber and information solutions, and intelligence systems; and satellite systems, such as government and commercial satellites, and space exploration. The Global Services segment offers products and services, including supply chain and logistics management, engineering, maintenance and modifications, upgrades and conversions, spare parts, pilot and maintenance training systems and services, technical and maintenance documents, and data analytics and digital services to commercial and defense customers. The Boeing Company was incorporated in 1916 and is based in Arlington, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"SoFi Technologies, Inc.","Symbol":"SOFI","Current Price":"15.80","Latest MA":"10.84","Price Target":13.29375,"Difference from MA":"45.71%","Difference from Open":"-3.91%","Change from Yesterday":"-3.83%","Change from Last Report":"-0.49","Latest Volume":"29,684,190","Market Cap":"17,303,949,312","Earning Date":"2025-01-27","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":34.02214,"PB Ratio":2.7979987,"ROE":0.037249997,"DTE":54.394,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.613,"Trailing PEG":null,"Trailing PE":40.506413,"Trailing PS":6.8687973,"Quick Ratio":0.47,"Day High":16.57,"Day Low":15.785,"VS Average Volume":0.6083840998,"Company Summary":"SoFi Technologies, Inc. provides various financial services in the United States, Latin America, and Canada. It operates through three segments: Lending, Technology Platform, and Financial Services. The company offers lending and financial services and products that allows its members to borrow, save, spend, invest, and protect money. It offers personal loans, student loans, home loans, and related services. The company also operates Galileo, a technology platform that offers services to financial and non-financial institution; and Technisys, a cloud-native digital and core banking platform with financial services customers. In addition, it provides SoFi Money offers checking and savings accounts, debit cards, and cash management products; and SoFi Invest, a mobile-first investment platform that provides access to trading and advisory solutions, such as investing and robo-advisory. Further, the company offers SoFi Credit Card that provides cash backs on every purchase; Sofi Relay, a personal finance management product that allows to track all of their financial accounts comprising credit score and spending behaviors; SoFi Protect, which offers insurance product; SoFi Travel, an application that manages travel search and booking experience; SoFi At Work provides financial benefits to employees, including student loan payments made on their employees' behalf; Lantern Credit, a financial services marketplace platform for seeking alternative products and provide product comparisons; and other lending as a service that offers pre-qualified borrower referrals and sells loans to third-party partner. The company was founded in 2011 and is based in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"AT&T Inc.","Symbol":"T","Current Price":"23.80","Latest MA":"21.00","Price Target":26.61885,"Difference from MA":"13.34%","Difference from Open":"-0.87%","Change from Yesterday":"-0.89%","Change from Last Report":"-0.10","Latest Volume":"16,029,465","Market Cap":"170,788,798,464","Earning Date":"2025-01-27","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":10.626802,"PB Ratio":1.6683022,"ROE":0.08759,"DTE":125.151,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.73,"Trailing PEG":4.0802,"Trailing PE":15.973154,"Trailing PS":1.3992201,"Quick Ratio":0.42,"Day High":24.14,"Day Low":23.78,"VS Average Volume":0.4513277969,"Company Summary":"AT&T Inc. provides telecommunications and technology services worldwide. The company operates through two segments, Communications and Latin America. The Communications segment offers wireless voice and data communications services; and sells handsets, wireless data cards, wireless computing devices, carrying cases\/protective covers, and wireless chargers through its own company-owned stores, agents, and third-party retail stores. It also provides Virtual Private Networks, AT&T Dedicated Internet, Ethernet, data services, cloud solutions, outsourcing, and managed professional services, as well as customer premises equipment for multinational corporations, small and mid-sized businesses, governmental, and wholesale customers. In addition, this segment offers broadband services, including fiber connections, legacy telephony voice communication services, and other VoIP services and equipment to residential customers. This segment markets its communications services and products under the AT&T, AT&T Business, Cricket, AT&T PREPAID, and AT&T Fiber brand names. The Latin America segment provides postpaid and prepaid wireless services in Mexico under the AT&T and Unefon brand names, as well as sells smartphones through its owned stores, agents and third-party retail stores. The company was formerly known as SBC Communications Inc. and changed its name to AT&T Inc. in 2005. AT&T Inc. was incorporated in 1983 and is based in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Verizon Communications Inc.","Symbol":"VZ","Current Price":"39.54","Latest MA":"40.58","Price Target":47.66043,"Difference from MA":"-2.57%","Difference from Open":"-0.08%","Change from Yesterday":"0.19%","Change from Last Report":"-0.18","Latest Volume":"11,249,211","Market Cap":"166,448,775,168","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.113465,"PB Ratio":1.7279959,"ROE":0.10431,"DTE":182.615,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.418,"Trailing PEG":1.0631,"Trailing PE":9.550725,"Trailing PS":1.239962,"Quick Ratio":0.51,"Day High":39.935,"Day Low":39.505,"VS Average Volume":0.5667399752,"Company Summary":"Verizon Communications Inc., through its subsidiaries, engages in the provision of communications, technology, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide. It operates in two segments, Verizon Consumer Group (Consumer) and Verizon Business Group (Business). The Consumer segment provides wireless services across the wireless networks in the United States under the Verizon and TracFone brands and through wholesale and other arrangements; and fixed wireless access (FWA) broadband through its wireless networks, as well as related equipment and devices, such as smartphones, tablets, smart watches, and other wireless-enabled connected devices. The segment also offers wireline services in the Mid-Atlantic and Northeastern United States, as well as Washington D.C. through its fiber-optic network, Verizon Fios product portfolio, and a copper-based network. The Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and conferencing, corporate networking, security and managed network, local and long-distance voice, and network access services to deliver various IoT services and products to businesses, government customers, and wireless and wireline carriers in the United States and internationally. The company was formerly known as Bell Atlantic Corporation and changed its name to Verizon Communications Inc. in June 2000. Verizon Communications Inc. was incorporated in 1983 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"NextEra Energy, Inc.","Symbol":"NEE","Current Price":"71.36","Latest MA":"76.29","Price Target":84.81476,"Difference from MA":"-6.46%","Difference from Open":"-0.21%","Change from Yesterday":"0.08%","Change from Last Report":"-0.06","Latest Volume":"4,141,962","Market Cap":"146,744,705,024","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":17.877409,"PB Ratio":2.9319198,"ROE":0.09887999,"DTE":139.015,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.561,"Trailing PEG":3.6857,"Trailing PE":21.175076,"Trailing PS":5.5911264,"Quick Ratio":0.258,"Day High":71.655,"Day Low":70.93,"VS Average Volume":0.372560547,"Company Summary":"NextEra Energy, Inc., through its subsidiaries, generates, transmits, distributes, and sells electric power to retail and wholesale customers in North America. The company generates electricity through wind, solar, nuclear,natural gas, and other clean energy. It also develops, constructs, and operates long-term contracted assets that consists of clean energy solutions, such as renewable generation facilities, battery storage projects, and electric transmission facilities; sells energy commodities; and owns, develops, constructs, manages and operates electric generation facilities in wholesale energy markets. The company had approximately 33,276 megawatts of net generating capacity; approximately 90,000 circuit miles of transmission and distribution lines; and 883 substations. It serves approximately 12 million people through approximately 5.9 million customer accounts in the east and lower west coasts of Florida. The company was formerly known as FPL Group, Inc. and changed its name to NextEra Energy, Inc. in 2010. NextEra Energy, Inc. was founded in 1925 and is headquartered in Juno Beach, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"American Airlines Group, Inc.","Symbol":"AAL","Current Price":"16.99","Latest MA":"13.15","Price Target":20.995,"Difference from MA":"29.23%","Difference from Open":"0.24%","Change from Yesterday":"0.56%","Change from Last Report":"-0.26","Latest Volume":"16,525,668","Market Cap":"11,172,046,848","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":5.532724,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Airlines","Sector":"Industrials","Beta":1.399,"Trailing PEG":0.2333,"Trailing PE":13.701612,"Trailing PS":0.20838317,"Quick Ratio":0.422,"Day High":17.23,"Day Low":16.91,"VS Average Volume":0.606511657,"Company Summary":"American Airlines Group Inc., through its subsidiaries, operates as a network air carrier. The company provides scheduled air transportation services for passengers and cargo through its hubs in Charlotte, Chicago, Dallas\/Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix, and Washington, D.C., as well as through partner gateways in London, Doha, Madrid, Seattle\/Tacoma, Sydney, and Tokyo. It operates a mainline fleet of 965 aircraft. The company was formerly known as AMR Corporation and changed its name to American Airlines Group Inc. in December 2013. American Airlines Group Inc. was founded in 1926 and is headquartered in Fort Worth, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Texas Instruments Incorporated","Symbol":"TXN","Current Price":"185.86","Latest MA":"197.99","Price Target":205.69379,"Difference from MA":"-6.13%","Difference from Open":"1.13%","Change from Yesterday":"0.29%","Change from Last Report":"-0.40","Latest Volume":"2,530,752","Market Cap":"169,544,663,040","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":25.707348,"PB Ratio":9.816204,"ROE":0.29293,"DTE":84.399,"Industry":"Semiconductors","Sector":"Technology","Beta":0.98,"Trailing PEG":1.7928,"Trailing PE":35.673706,"Trailing PS":10.791463,"Quick Ratio":3.048,"Day High":189.03,"Day Low":183.3457,"VS Average Volume":0.4121858709,"Company Summary":"Texas Instruments Incorporated designs, manufactures, and sells semiconductors to electronics designers and manufacturers in the United States and internationally. The company operates through Analog and Embedded Processing segments. The Analog segment offers power products to manage power requirements across various voltage levels, including battery-management solutions, DC\/DC switching regulators, AC\/DC and isolated controllers and converters, power switches, linear regulators, voltage references, and lighting products. This segment provides signal chain products that sense, condition, and measure signals to allow information to be transferred or converted for further processing and control, including amplifiers, data converters, interface products, motor drives, clocks, and logic and sensing products. The Embedded Processing segment offers microcontrollers that are used in electronic equipment; digital signal processors for mathematical computations; and applications processors for specific computing activity. This segment offers products for use in various markets, such as industrial, automotive, personal electronics, communications equipment, enterprise systems, and calculators and other. It provides DLP products primarily for use in project high-definition images; calculators; and application-specific integrated circuits. The company markets and sells its semiconductor products through direct sales and distributors, as well as through its website. Texas Instruments Incorporated was founded in 1930 and is headquartered in Dallas, Texas.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"CSX Corporation","Symbol":"CSX","Current Price":"33.08","Latest MA":"33.79","Price Target":37.01231,"Difference from MA":"-2.12%","Difference from Open":"0.59%","Change from Yesterday":"0.64%","Change from Last Report":"-0.21","Latest Volume":"5,933,696","Market Cap":"63,782,490,112","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":15.635785,"PB Ratio":4.932886,"ROE":0.29458,"DTE":147.913,"Industry":"Railroads","Sector":"Industrials","Beta":1.191,"Trailing PEG":2.1864,"Trailing PE":18.477654,"Trailing PS":4.34456,"Quick Ratio":1.195,"Day High":33.4,"Day Low":32.77,"VS Average Volume":0.4640931563,"Company Summary":"CSX Corporation, together with its subsidiaries, provides rail-based freight transportation services. The company offers rail services; and transportation of intermodal containers and trailers, as well as other transportation services, such as rail-to-truck transfers and bulk commodity operations. It also transports chemicals, agricultural and food products, minerals, automotive, forest products, fertilizers, and metals and equipment; and coal, coke, and iron ore to electricity-generating power plants, steel manufacturers, and industrial plants, as well as exports coal to deep-water port facilities. In addition, the company provides intermodal services through a network of approximately 30 terminals transporting manufactured consumer goods in containers; and drayage services, including the pickup and delivery of intermodal shipments. It serves the automotive industry with distribution centers and storage locations, as well as connects non-rail served customers through transferring products, such as plastics and ethanol from rail to trucks. The company operates approximately 20,000 route mile rail network, which serves various population centers in 26 states east of the Mississippi River, the District of Columbia, and the Canadian provinces of Ontario and Quebec, as well as owns and leases approximately 3,500 locomotives. It serves production and distribution facilities through track connections. CSX Corporation was incorporated in 1978 and is headquartered in Jacksonville, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Freeport-McMoRan, Inc.","Symbol":"FCX","Current Price":"36.23","Latest MA":"43.85","Price Target":47.8981,"Difference from MA":"-17.38%","Difference from Open":"-0.37%","Change from Yesterday":"-1.20%","Change from Last Report":"-0.19","Latest Volume":"6,076,383","Market Cap":"52,052,787,200","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.284266,"PB Ratio":2.9663446,"ROE":0.16870001,"DTE":33.531,"Industry":"Copper","Sector":"Basic Materials","Beta":1.91,"Trailing PEG":5.159,"Trailing PE":27.865385,"Trailing PS":2.03014,"Quick Ratio":1.048,"Day High":36.64,"Day Low":36.05,"VS Average Volume":0.4910177139,"Company Summary":"Freeport-McMoRan Inc. engages in the mining of mineral properties in North America, South America, and Indonesia. It primarily explores for copper, gold, molybdenum, silver, and other metals. The company's assets include the Grasberg minerals district in Indonesia; Morenci, Bagdad, Safford, Sierrita, and Miami in Arizona; Chino and Tyrone in New Mexico; and Henderson and Climax in Colorado, North America, as well as Cerro Verde in Peru and El Abra in Chile. The company was formerly known as Freeport-McMoRan Copper & Gold Inc. and changed its name to Freeport-McMoRan Inc. in July 2014. Freeport-McMoRan Inc. was incorporated in 1987 and is headquartered in Phoenix, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Valley National Bancorp","Symbol":"VLY","Current Price":"10.24","Latest MA":"8.85","Price Target":11.5,"Difference from MA":"15.65%","Difference from Open":"0.89%","Change from Yesterday":"0.05%","Change from Last Report":"-0.53","Latest Volume":"4,392,119","Market Cap":"5,721,968,128","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":8.854608,"PB Ratio":0.7879347,"ROE":0.049429998,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.086,"Trailing PEG":null,"Trailing PE":14.840579,"Trailing PS":3.6283076,"Quick Ratio":"N\/A","Day High":10.42,"Day Low":10.15,"VS Average Volume":0.541744528,"Company Summary":"Valley National Bancorp operates as the holding company for Valley National Bank that provides various commercial, private banking, retail, insurance, and wealth management financial services products. It operates through Consumer Banking, Commercial Banking, and Treasury and Corporate other segments. The company offers non-interest bearing, savings, NOW, money market, and time deposit accounts; commercial and industrial, commercial real estate, residential mortgage, and automobile loans; loans secured by the cash surrender value of life insurance; home equity loans and lines of credit; automobile financing; and secured and unsecured other consumer loans. It also invests in various securities and interest-bearing deposits with other banks; and provides international banking services, such as standby and documentary letters of credit, and related products, as well as foreign exchange transactions, documentary collections, and foreign wire transfers services. In addition, the company offers investment services for individuals and small to medium sized businesses; and trusts investment strategies designed for various investment profiles and objectives. Further, it provides trust services, such as living and testamentary trusts, investment management, custodial and escrow services, and estate administration to individuals; tax credit advisory services; brokerage services; property and casualty, life, health, and title insurance agency services; and health care equipment lending and other commercial equipment leasing services, as well as owns real estate related investments. Additionally, the company offers online, mobile, and telephone banking services; receivable, payment, and security solution, merchant, payroll processing, and liquidity services; credit cards; and drive-in and night deposit, automated teller machine, remote deposit capture, and safe deposit facility services. Valley National Bancorp was founded in 1927 and is headquartered in Morristown, New Jersey.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"TAL Education Group","Symbol":"TAL","Current Price":"12.18","Latest MA":"9.94","Price Target":14.73579,"Difference from MA":"22.48%","Difference from Open":"-3.03%","Change from Yesterday":"-2.79%","Change from Last Report":"0.08","Latest Volume":"2,824,763","Market Cap":"7,360,167,424","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":25.580175,"PB Ratio":2.0095694,"ROE":0.019609999,"DTE":9.291,"Industry":"Education & Training Services","Sector":"Consumer Defensive","Beta":0.033,"Trailing PEG":0.6702,"Trailing PE":64.10526,"Trailing PS":4.007459,"Quick Ratio":2.67,"Day High":12.63,"Day Low":12.15,"VS Average Volume":0.41336999,"Company Summary":"TAL Education Group provides K-12 after-school tutoring services in the People's Republic of China. It provides learning services primarily through small-classes services; personalized premium services; and learning content solutions, such as print books, smart books, mobile apps, and AI-driven learning devices. The company also operates www.xueersi.com, an online education platform; provides investment management and consulting services; develops and sells software and networks, as well as related consulting services; and sells educational materials and products. It offers its services under the Haoweilai and Think Academy brands. TAL Education Group was founded in 2003 and is headquartered in Beijing, the People's Republic of China.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Abbott Laboratories","Symbol":"ABT","Current Price":"128.22","Latest MA":"112.45","Price Target":133.07957,"Difference from MA":"14.02%","Difference from Open":"-0.12%","Change from Yesterday":"-0.52%","Change from Last Report":"-0.16","Latest Volume":"2,130,725","Market Cap":"222,392,467,456","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":22.60371,"PB Ratio":5.588389,"ROE":0.14840001,"DTE":37.589,"Industry":"Medical Devices","Sector":"Healthcare","Beta":0.722,"Trailing PEG":2.3159,"Trailing PE":16.782722,"Trailing PS":5.395649,"Quick Ratio":0.996,"Day High":128.76,"Day Low":127.9,"VS Average Volume":0.3722543355,"Company Summary":"Abbott Laboratories, together with its subsidiaries, discovers, develops, manufactures, and sells health care products worldwide. It operates in four segments: Established Pharmaceutical Products, Diagnostic Products, Nutritional Products, and Medical Devices. The company provides generic pharmaceuticals for the treatment of pancreatic exocrine insufficiency, irritable bowel syndrome or biliary spasm, intrahepatic cholestasis or depressive symptoms, gynecological disorder, hormone replacement therapy, dyslipidemia, hypertension, hypothyroidism, Ménière's disease and vestibular vertigo, pain, fever, inflammation, and migraine, as well as provides anti-infective clarithromycin, influenza vaccine, and products to regulate physiological rhythm of the colon. It also offers laboratory and transfusion medicine systems in the areas of immunoassay, clinical chemistry, hematology, and transfusion; molecular diagnostics polymerase chain reaction instrument systems that automate the extraction, purification, and preparation of DNA and RNA from patient samples, and detect and measure infectious agents; point of care systems; cartridges for testing blood gas, chemistry, electrolytes, coagulation, and immunoassay; rapid diagnostics lateral flow testing products; molecular point-of-care testing for HIV, SARS-CoV-2, influenza A and B, RSV, and strep A; cardiometabolic test systems; drug and alcohol test, and remote patient monitoring and consumer self-test systems; and informatics and automation solutions for laboratories. In addition, the company provides pediatric and adult nutritional products; rhythm management, electrophysiology, heart failure, vascular, and structural heart devices for the treatment of cardiovascular diseases; diabetes care products, such as glucose and blood glucose monitoring systems; and neuromodulation devices for the management of chronic pain and movement disorders. Abbott Laboratories was founded in 1888 and is based in North Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:35:15"},{"Company Name":"Alcoa Corporation","Symbol":"AA","Current Price":"35.67","Latest MA":"37.62","Price Target":48.04231,"Difference from MA":"-5.19%","Difference from Open":"0.48%","Change from Yesterday":"0.42%","Change from Last Report":"-0.28","Latest Volume":"2,131,169","Market Cap":"9,215,497,216","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":11.070698,"PB Ratio":1.7553221,"ROE":-0.07142,"DTE":56.095,"Industry":"Aluminum","Sector":"Basic Materials","Beta":2.419,"Trailing PEG":null,"Trailing PE":137.19193,"Trailing PS":0.8374679,"Quick Ratio":0.671,"Day High":36.24,"Day Low":35.48,"VS Average Volume":0.4506608816,"Company Summary":"Alcoa Corporation, together with its subsidiaries, produces and sells bauxite, alumina, and aluminum products in the United States, Spain, Australia, Iceland, Norway, Brazil, Canada, and internationally. The company operates through two segments, Alumina and Aluminum. It engages in bauxite mining operations; and processes bauxite into alumina and sells it to customers who process it into industrial chemical products, as well as aluminum smelting and casting businesses. The company offers primary aluminum in the form of alloy ingot or value-add ingot to customers that produce products for the transportation, building and construction, packaging, wire, and other industrial markets; and flat-rolled aluminum in the form of sheet, which is sold primarily to customers that produce beverage and food cans. In addition, it owns hydro power plants that generates and sells electricity in the wholesale market to traders, large industrial consumers, distribution companies, and other generation companies. The company was formerly known as Alcoa Upstream Corporation and changed its name to Alcoa Corporation in October 2016. The company was founded in 1886 and is headquartered in Pittsburgh, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"31-01-2025 20:36:17"},{"Company Name":"Halliburton Company","Symbol":"HAL","Current Price":"26.18","Latest MA":"29.90","Price Target":34.41481,"Difference from MA":"-12.46%","Difference from Open":"-1.52%","Change from Yesterday":"-1.47%","Change from Last Report":"-0.32","Latest Volume":"6,612,587","Market Cap":"22,994,790,400","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.493275,"PB Ratio":2.2320285,"ROE":0.26293,"DTE":83.993,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.905,"Trailing PEG":1.7757,"Trailing PE":9.249117,"Trailing PS":0.99661034,"Quick Ratio":1.377,"Day High":26.64,"Day Low":25.8635,"VS Average Volume":0.6426605534,"Company Summary":"Halliburton Company provides products and services to the energy industry worldwide. It operates through two segments, Completion and Production, and Drilling and Evaluation. The Completion and Production segment offers production enhancement services that include stimulation and sand control services; cementing services, such as well bonding and casing, and casing equipment; and completion tools that offer downhole solutions and services, including well completion products and services, intelligent well completions, and service tools, as well as liner hanger, sand control, and multilateral systems. This segment also provides electrical submersible pumps, as well as artificial lift services; production solutions comprising coiled tubing, hydraulic workover units, downhole tools, and pumping and nitrogen services; pipeline and process services, such as pre-commissioning, commissioning, maintenance, and decommissioning; and specialty chemicals and services. The Drilling and Evaluation segment offers drilling fluid systems, performance additives, completion fluids, solids control, specialized testing equipment, and waste management services; drilling systems and services; wireline and perforating services consists of open-hole logging, and cased-hole and slickline; and drill bits and services comprising roller cone rock bits, fixed cutter bits, hole enlargement, and related downhole tools and services, as well as coring equipment and services. This segment also provides cloud based digital services and artificial intelligence solutions on an open architecture for subsurface insights, integrated well construction, and reservoir and production management; testing and subsea services, such as acquisition and analysis of reservoir information and optimization solutions; and project management and integrated asset management services. Halliburton Company was founded in 1919 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"31-01-2025 20:36:17"},{"Company Name":"Johnson & Johnson","Symbol":"JNJ","Current Price":"152.47","Latest MA":"154.41","Price Target":168.44952,"Difference from MA":"-1.26%","Difference from Open":"-0.10%","Change from Yesterday":"-0.27%","Change from Last Report":"-0.14","Latest Volume":"2,636,742","Market Cap":"367,089,844,224","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.72103,"PB Ratio":5.231609,"ROE":0.20889,"DTE":50.958,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.518,"Trailing PEG":0.9693,"Trailing PE":26.333334,"Trailing PS":4.185936,"Quick Ratio":0.705,"Day High":153.18,"Day Low":152.07,"VS Average Volume":0.3070642161,"Company Summary":"Johnson & Johnson, together with its subsidiaries, researches, develops, manufactures, and sells various products in the healthcare field worldwide. The company's Innovative Medicine segment offers products for various therapeutic areas, such as immunology, including rheumatoid arthritis, psoriatic arthritis, inflammatory bowel disease, and psoriasis; infectious diseases comprising HIV\/AIDS; neuroscience, consisting of mood disorders, neurodegenerative disorders, and schizophrenia; oncology, such as prostate cancer, hematologic malignancies, lung cancer, and bladder cancer; cardiovascular and metabolism, including thrombosis, diabetes, and macular degeneration; and pulmonary hypertension comprising pulmonary arterial hypertension through retailers, wholesalers, distributors, hospitals, and healthcare professionals for prescription use. Its MedTech segment provides Interventional Solutions, including electrophysiology products to treat heart rhythm disorders; the heart recovery portfolio, which includes technologies to treat severe coronary artery disease requiring high-risk PCI or AMI cardiogenic shock; and neurovascular care that treats hemorrhagic and ischemic stroke. this segment also offers an orthopaedics portfolio that includes products and enabling technologies that support hips, knees, trauma, spine, sports, and other; surgery portfolios comprising advanced and general surgery technologies, as well as solutions for breast aesthetics, ear, nose, and throat procedures; contact lenses under the ACUVUE Brand; and TECNIS intraocular lenses for cataract surgery. It distributes its products to wholesalers, hospitals, and retailers, as well as physicians, nurses, hospitals, eye care professionals, and clinics. The company has a collaboration agreement with Stand Up To Cancer for research testing a combination of teclistamab and daratumumab to treat a rare disease AL amyloidosis. Johnson & Johnson was founded in 1886 and is based in New Brunswick, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"31-01-2025 20:36:17"},{"Company Name":"Lam Research Corporation","Symbol":"LRCX","Current Price":"82.39","Latest MA":"80.94","Price Target":91.18703,"Difference from MA":"1.79%","Difference from Open":"1.58%","Change from Yesterday":"1.96%","Change from Last Report":"-0.14","Latest Volume":"8,072,827","Market Cap":"105,861,431,296","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.899714,"PB Ratio":12.577863,"ROE":0.49116,"DTE":58.827,"Industry":"Semiconductor Equipment & Materials","Sector":"Technology","Beta":1.486,"Trailing PEG":1.5518,"Trailing PE":25.041035,"Trailing PS":6.789776,"Quick Ratio":1.685,"Day High":84.215,"Day Low":80.9,"VS Average Volume":0.7043245389,"Company Summary":"Lam Research Corporation designs, manufactures, markets, refurbishes, and services semiconductor processing equipment used in the fabrication of integrated circuits. The company offers ALTUS systems to deposit conformal films for tungsten metallization applications; SABRE electrochemical deposition products for copper interconnect transition that offers copper damascene manufacturing; and VECTOR plasma-enhanced CVD products. It also provides SPEED gapfill high-density plasma chemical vapor deposition products; and Striker single-wafer atomic layer deposition products for dielectric film solutions. In addition, the company offers Flex for dielectric etch applications; Vantex, a dielectric etch system that provides RF technology and repeatable wafer-to-wafer performance enabled by Equipment Intelligence solutions; Kiyo for conductor etch applications; Syndion for through-silicon via etch applications; and Versys metal products for metal etch processes. Further, it provides Coronus bevel clean products to enhance die yield; and Da Vinci, DV-Prime, EOS, and SP series products to address various wafer cleaning applications. The company sells its products in the United States, China, Europe, Japan, Korea, Southeast Asia, and Taiwan. Lam Research Corporation was incorporated in 1980 and is headquartered in Fremont, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:36:17"},{"Company Name":"Kinder Morgan, Inc.","Symbol":"KMI","Current Price":"27.73","Latest MA":"24.03","Price Target":29.585,"Difference from MA":"15.39%","Difference from Open":"-1.77%","Change from Yesterday":"-1.25%","Change from Last Report":"-0.16","Latest Volume":"8,817,137","Market Cap":"61,606,297,600","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.574038,"PB Ratio":2.0261655,"ROE":0.083500005,"DTE":101.433,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.907,"Trailing PEG":2.0575,"Trailing PE":23.700941,"Trailing PS":4.066154,"Quick Ratio":0.291,"Day High":28.14,"Day Low":27.59,"VS Average Volume":0.6158500163,"Company Summary":"Kinder Morgan, Inc. operates as an energy infrastructure company primarily in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas gasification, liquefaction, and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and\/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, renewable fuel and feedstocks, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; owns interests in\/or operates oil fields and gasoline processing plants; and operates a crude oil pipeline system in West Texas, as well as owns and operates RNG and LNG facilities. It owns and operates approximately 82,000 miles of pipelines and 139 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1997 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:36:17"},{"Company Name":"GE Vernova Inc.","Symbol":"GEV","Current Price":"374.51","Latest MA":"268.08","Price Target":413.59042,"Difference from MA":"39.70%","Difference from Open":"-2.87%","Change from Yesterday":"-2.30%","Change from Last Report":"-0.30","Latest Volume":"2,320,736","Market Cap":"103,234,437,120","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":36.177185,"PB Ratio":10.852453,"ROE":"N\/A","DTE":9.346,"Industry":"Utilities - Renewable","Sector":"Utilities","Beta":"N\/A","Trailing PEG":3.3189,"Trailing PE":66.99593,"Trailing PS":2.9990828,"Quick Ratio":0.717,"Day High":386.505,"Day Low":374.0,"VS Average Volume":0.6995659846,"Company Summary":"GE Vernova Inc., an energy company, engages in the provision of various products and services that generate, transfer, orchestrate, convert, and store electricity in the United States, Europe, Asia, the Americas, the Middle East, and Africa. The company operates through three segments: Power, Wind, and Electrification. The Power segment designs, manufactures, and services gas, nuclear, hydro, and steam technologies. The Wind segment offers wind generation technologies, including onshore and offshore wind turbines and blades. The Electrification segment provides grid solutions, power conversion, solar, and storage solutions; and electrification software for the transmission, distribution, conversion, storage, and orchestration of electricity from point of generation to point of consumption. The company was incorporated in 2023 and is headquartered in Cambridge, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:36:17"},{"Company Name":"Amphenol Corporation","Symbol":"APH","Current Price":"71.45","Latest MA":"67.76","Price Target":84.08235,"Difference from MA":"5.44%","Difference from Open":"-1.84%","Change from Yesterday":"-0.23%","Change from Last Report":"-0.54","Latest Volume":"2,352,382","Market Cap":"86,140,829,696","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":28.19063,"PB Ratio":9.111196,"ROE":0.25293,"DTE":57.565,"Industry":"Electronic Components","Sector":"Technology","Beta":1.238,"Trailing PEG":2.5455,"Trailing PE":37.21354,"Trailing PS":6.052446,"Quick Ratio":1.208,"Day High":72.97,"Day Low":71.43,"VS Average Volume":0.3459722108,"Company Summary":"Amphenol Corporation, together with its subsidiaries, primarily designs, manufactures, and markets electrical, electronic, and fiber optic connectors in the United States, China, and internationally. It operates through three segments: Harsh Environment Solutions, Communications Solutions, and Interconnect and Sensor Systems. The company offers connectors and connector systems, including harsh environment data, power, high-speed, fiber optic, and radio frequency interconnect products; busbars and power distribution systems; and other connectors. It also provides value-add products, such as backplane interconnect systems, cable assemblies and harnesses, and cable management products; other products comprising flexible and rigid printed circuit boards, hinges, other mechanical, and production related products. In addition, the company offers consumer device, network infrastructure, and other antennas; coaxial, power, and specialty cables; and sensors and sensor-based products. It sells its products through its sales force, independent representatives, and a network of electronics distributors to original equipment manufacturers, electronic manufacturing services companies, original design manufacturers, and service providers in the automotive, broadband communication, commercial aerospace, industrial, information technology and data communication, military, mobile device, and mobile network markets. Amphenol Corporation was founded in 1932 and is headquartered in Wallingford, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:36:17"},{"Company Name":"United Airlines Holdings, Inc.","Symbol":"UAL","Current Price":"104.96","Latest MA":"70.43","Price Target":129.49522,"Difference from MA":"49.02%","Difference from Open":"-4.26%","Change from Yesterday":"-4.00%","Change from Last Report":"-0.44","Latest Volume":"2,891,733","Market Cap":"34,518,822,912","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.0800614,"PB Ratio":3.017913,"ROE":0.27245,"DTE":291.676,"Industry":"Airlines","Sector":"Industrials","Beta":1.393,"Trailing PEG":1.0274,"Trailing PE":11.106878,"Trailing PS":0.6164736,"Quick Ratio":0.694,"Day High":110.3175,"Day Low":104.9,"VS Average Volume":0.500431948,"Company Summary":"United Airlines Holdings, Inc., through its subsidiaries, provides air transportation services in North America, Asia, Europe, Africa, the Pacific, the Middle East, and Latin America. The company transports people and cargo through its mainline and regional fleets. It also offers catering, ground handling, flight academy, and maintenance services for third parties. The company was formerly known as United Continental Holdings, Inc. and changed its name to United Airlines Holdings, Inc. in June 2019. United Airlines Holdings, Inc. was incorporated in 1968 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:36:17"},{"Company Name":"KeyCorp","Symbol":"KEY","Current Price":"17.98","Latest MA":"16.76","Price Target":21.04,"Difference from MA":"7.25%","Difference from Open":"-0.44%","Change from Yesterday":"-0.34%","Change from Last Report":"-0.14","Latest Volume":"4,980,273","Market Cap":"19,900,084,224","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":10.306973,"PB Ratio":1.2417984,"ROE":0.0096700005,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.231,"Trailing PEG":0.7754,"Trailing PE":"N\/A","Trailing PS":4.101419,"Quick Ratio":"N\/A","Day High":18.16,"Day Low":17.94,"VS Average Volume":0.4680589372,"Company Summary":"KeyCorp operates as the holding company for KeyBank National Association that provides various retail and commercial banking products and services in the United States. It operates in two segments, Consumer Bank and Commercial Bank. The company offers various deposits, investment products and services; commercial leasing, investment management, consumer finance; and personal finance and financial wellness, student loan refinancing, mortgage and home equity, lending, credit card, treasury, business advisory, wealth management, asset management, cash management, portfolio management, and trust and related services to individuals and small and medium-sized businesses. It also provides a suite of banking and capital market products, such as syndicated finance, debt and equity capital market products, commercial payments, equipment finance, commercial mortgage banking, derivatives, foreign exchange, financial advisory, and public finance, as well as commercial mortgage loans to consumer, energy, healthcare, industrial, public sector, real estate, and technology sectors for middle market clients. In addition, the company offers community development financing, securities underwriting, brokerage, and investment banking services. The company was founded in 1849 and is headquartered in Cleveland, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:36:17"},{"Company Name":"Charles Schwab Corporation (The","Symbol":"SCHW","Current Price":"82.77","Latest MA":"71.07","Price Target":89.5,"Difference from MA":"16.47%","Difference from Open":"-0.55%","Change from Yesterday":"-0.90%","Change from Last Report":"-0.22","Latest Volume":"3,121,526","Market Cap":"151,515,447,296","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":15.9661875,"PB Ratio":3.9825816,"ROE":0.12111,"DTE":144.242,"Industry":"Capital Markets","Sector":"Financial Services","Beta":0.952,"Trailing PEG":0.9639,"Trailing PE":27.682274,"Trailing PS":8.086862,"Quick Ratio":0.481,"Day High":83.73,"Day Low":82.76,"VS Average Volume":0.378589628,"Company Summary":"The Charles Schwab Corporation, together with its subsidiaries, operates as a savings and loan holding company that provides wealth management, securities brokerage, banking, asset management, custody, and financial advisory services in the United States and internationally. The company operates in two segments, Investor Services and Advisor Services. It offers brokerage accounts with equity and fixed income trading, margin lending, options trading, futures and forex trading, and cash management capabilities, including certificates of deposit; third-party mutual funds through the Mutual Fund Marketplace and Mutual Fund OneSource service, as well as mutual fund trading and clearing services to broker-dealers; exchange-traded funds; advisory solutions for managed portfolios, separately managed accounts, customized personal advice for tailored portfolios, specialized planning, and full-time portfolio management; banking products comprising checking and savings accounts, first lien residential real estate mortgage loans, home equity lines of credit, and pledged asset lines; and trust custody services, personal trust reporting services, and administrative trustee services. It also provides digital retirement calculators; integrated web-, mobile-, and software-based trading platforms, real-time market data, options trading, premium research, and multi-channel access; self-service education and support tools; online research and analysis tools; equity compensation plan sponsors full-service recordkeeping for stock plans, stock options, restricted stock, performance shares, and stock appreciation rights; retirement plan services; mutual fund clearing services; and advisor services, including interactive tools and educational content. The Company operates through branch offices. The Charles Schwab Corporation was founded in 1971 and is headquartered in Westlake, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:36:17"},{"Company Name":"Regions Financial Corporation","Symbol":"RF","Current Price":"24.66","Latest MA":"23.13","Price Target":27.625,"Difference from MA":"6.61%","Difference from Open":"-0.16%","Change from Yesterday":"-0.44%","Change from Last Report":"-0.36","Latest Volume":"2,244,775","Market Cap":"22,412,587,008","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":9.961423,"PB Ratio":1.3238846,"ROE":0.10042,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.182,"Trailing PEG":4.7653,"Trailing PE":12.777203,"Trailing PS":3.4186373,"Quick Ratio":"N\/A","Day High":24.92,"Day Low":24.66,"VS Average Volume":0.2767648238,"Company Summary":"Regions Financial Corporation, a financial holding company, provides banking and bank-related services to individual and corporate customers. It operates through three segments: Corporate Bank, Consumer Bank, and Wealth Management. The Corporate Bank segment offers commercial banking services, such as commercial and industrial, commercial real estate, and investor real estate lending; equipment lease financing; deposit products; and securities underwriting and placement, loan syndication and placement, foreign exchange, derivatives, merger and acquisition, and other advisory services. It serves corporate, middle market, and commercial real estate developers and investors. The Consumer Bank segment provides consumer banking products and services related to residential first mortgages, home equity lines and loans, consumer credit cards, and other consumer loans, as well as deposits. The Wealth Management segment offers credit related products, and retirement and savings solutions; and trust and investment management, asset management, and estate planning services to individuals, businesses, governmental institutions, and non-profit entities. It also provides investment and insurance products; low-income housing tax credit corporate fund syndication services; and other specialty financing services. The company was founded in 1971 and is headquartered in Birmingham, Alabama.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:36:17"},{"Company Name":"Schlumberger N.V.","Symbol":"SLB","Current Price":"40.49","Latest MA":"42.66","Price Target":53.23677,"Difference from MA":"-5.09%","Difference from Open":"-1.68%","Change from Yesterday":"-1.33%","Change from Last Report":"-0.26","Latest Volume":"6,382,422","Market Cap":"56,720,420,864","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":10.720943,"PB Ratio":2.6580453,"ROE":0.21722999,"DTE":57.141,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.532,"Trailing PEG":1.9191,"Trailing PE":13.019294,"Trailing PS":1.5757861,"Quick Ratio":1.003,"Day High":41.29,"Day Low":39.8599,"VS Average Volume":0.4945271275,"Company Summary":"Schlumberger Limited engages in the provision of technology for the energy industry worldwide. The company operates through four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company provides field development and hydrocarbon production, carbon management, and integration of adjacent energy systems; reservoir interpretation and data processing services for exploration data; and well construction and production improvement services and products. It also offers subsurface geology and fluids evaluation information; open and cased hole services; exploration and production pressure, and flow-rate measurement services; and pressure pumping, well stimulation, and coiled tubing equipment solutions. In addition, the company offers mud logging, directional drilling, measurement-while-drilling, and logging-while-drilling services, as well as engineering support services; supplies drilling fluid systems; designs, manufactures, and markets roller cone and fixed cutter drill bits; bottom-hole-assembly and borehole enlargement technologies; well cementing products and services; well planning, well drilling, engineering, supervision, logistics, procurement, and contracting of third parties, as well as drilling rig management solutions; and drilling equipment and services, as well as land drilling rigs and related services. Further, it provides artificial lift production equipment and optimization services; supplies packers, safety valves, sand control technology, and various intelligent well completions technology and equipment; designs and manufactures valves, chokes, actuators, and surface trees; and OneSubsea, an integrated solutions, products, systems, and services, including wellheads, subsea trees, manifolds and flowline connectors, control systems, connectors, and services. The company was formerly known as Socie´te´ de Prospection E´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"31-01-2025 20:36:17"},{"Company Name":"Truist Financial Corporation","Symbol":"TFC","Current Price":"47.76","Latest MA":"43.26","Price Target":51.44737,"Difference from MA":"10.38%","Difference from Open":"-0.66%","Change from Yesterday":"-0.54%","Change from Last Report":"0.00","Latest Volume":"2,044,309","Market Cap":"62,842,716,160","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":10.347734,"PB Ratio":1.0740875,"ROE":-0.09505,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.035,"Trailing PEG":1.9441,"Trailing PE":"N\/A","Trailing PS":4.334877,"Quick Ratio":"N\/A","Day High":48.36,"Day Low":47.755,"VS Average Volume":0.259333254,"Company Summary":"Truist Financial Corporation, a financial services company, provides banking and trust services in the Southeastern and Mid-Atlantic United States. The company operates through three segments: Consumer Banking and Wealth, Corporate and Commercial Banking, and Insurance Holdings.Its deposit products include noninterest-bearing checking, interest-bearing checking, savings, and money market deposit accounts, as well as certificates of deposit and individual retirement accounts. The company also provides funding; asset management; automobile lending; credit card lending; consumer finance; home equity and mortgage lending; other direct retail lending; insurance; investment brokerage; mobile\/online banking; payment solutions; point-of-sale lending; retail and small business deposit products; small business lending; and wealth management\/private banking services. In addition, it offers asset based lending, investment banking and capital market, institutional trust, insurance premium finance, derivatives, commercial lending, international banking, leasing, merchant, commercial deposit and treasury, floor plan, mortgage warehouse lending, real estate lending, and supply chain financing services. Further, the company provides insurance brokerage, retail and wholesale brokerage, securities underwriting and market making, loan syndication, and investment management and advisory services. The company was formerly known as BB&T Corporation and changed its name to Truist Financial Corporation in December 2019. Truist Financial Corporation was founded in 1872 and is headquartered in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:36:17"},{"Company Name":"Huntington Bancshares Incorpora","Symbol":"HBAN","Current Price":"17.20","Latest MA":"15.32","Price Target":18.88889,"Difference from MA":"12.26%","Difference from Open":"-0.64%","Change from Yesterday":"-1.12%","Change from Last Report":"-0.35","Latest Volume":"6,781,909","Market Cap":"25,002,608,640","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":11.076123,"PB Ratio":1.3720485,"ROE":0.08545,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.057,"Trailing PEG":2.9402,"Trailing PE":14.098361,"Trailing PS":3.737311,"Quick Ratio":"N\/A","Day High":17.41,"Day Low":17.17,"VS Average Volume":0.4210433485,"Company Summary":"Huntington Bancshares Incorporated operates as the bank holding company for The Huntington National Bank that provides commercial, consumer, and mortgage banking services in the United States. The company offers financial products and services to consumer and business customers, including deposits, lending, payments, mortgage banking, dealer financing, investment management, trust, brokerage, insurance, and other financial products and services. It also provides 24-hour grace, asterisk-free checking, money scout, $50 safety zone, standby cash, early pay, instant access, savings goal getter, and Huntington heads up; digitally powered consumer and business financial solutions to consumer lending, regional banking, branch banking, and wealth management customers; direct and indirect consumer loans, as well as dealer finance loans and deposits; and private banking, wealth management and legacy planning through investment and portfolio management, fiduciary administration and trust, institutional custody, and full-service retail brokerage investment services. The company offers equipment financing, asset-based lending, distribution finance, structured lending, and municipal financing solutions, as well as Huntington ChoicePay. In addition, it offers lending, liquidity, treasury management and other payment services, and capital markets; government and non-profits, healthcare, technology and telecommunications, franchises, financial sponsors, and global services; and corporate risk management, institutional sales and trading, debt and equity issuance, and additional advisory services. The company offers its products through a network of channels, including branches and ATMs, online and mobile banking, and through customer call centers to customers in middle market banking, corporate, specialty, and government banking, asset finance, commercial real estate banking, and capital markets. The company was founded in 1866 and is headquartered in Columbus, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"31-01-2025 20:36:17"}]