[{"Company Name":"FirstEnergy Corp.","Symbol":"FE","Current Price":"40.02","Latest MA":"41.32","Price Target":46.21467,"Difference from MA":"-3.12%","Difference from Open":"-0.78%","Change from Yesterday":"-0.48%","Change from Last Report":"-0.01","Latest Volume":"1,938,357","Market Cap":"23,067,088,896","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":13.874398,"PB Ratio":1.8561889,"Previous Close":40.22,"ROE":0.083050005,"DTE":173.13,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.495,"Trailing PEG":1.2139,"Trailing PE":25.822582,"Trailing PS":1.7399931,"Quick Ratio":0.406,"Day High":40.385,"Day Low":39.835,"VS Average Volume":0.6460866957,"Company Summary":"FirstEnergy Corp., through its subsidiaries, generates, transmits, and distributes electricity in the United States. It operates through Regulated Distribution and Regulated Transmission segments. The company owns and operates coal-fired, nuclear, hydroelectric, wind, and solar power generating facilities. It operates 24,080 circuit miles of overhead and underground transmission lines; and electric distribution systems, including 274,518 miles of overhead pole line and underground conduit carrying primary, secondary, and street lighting circuits. The company serves approximately 6 million customers in Ohio, Pennsylvania, West Virginia, Maryland, New Jersey, and New York. FirstEnergy Corp. was incorporated in 1996 and is headquartered in Akron, Ohio.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Honeywell International Inc.","Symbol":"HON","Current Price":"209.61","Latest MA":"213.99","Price Target":244.7213,"Difference from MA":"-2.05%","Difference from Open":"-2.51%","Change from Yesterday":"-5.73%","Change from Last Report":"0.04","Latest Volume":"6,281,197","Market Cap":"136,298,266,624","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":17.527105,"PB Ratio":7.830619,"Previous Close":222.35,"ROE":0.31865,"DTE":177.821,"Industry":"Conglomerates","Sector":"Industrials","Beta":1.025,"Trailing PEG":1.8801,"Trailing PE":24.23237,"Trailing PS":3.6010108,"Quick Ratio":0.972,"Day High":215.23,"Day Low":206.18,"VS Average Volume":1.573887714,"Company Summary":"Honeywell International Inc. engages in the aerospace technologies, building automation, energy and sustainable solutions, and industrial automation businesses in the United States, Europe, and internationally. The company's Aerospace segment offers auxiliary power units, propulsion engines, integrated avionics, environmental control and electric power systems, engine controls, flight safety, communications, navigation hardware, data and software applications, radar and surveillance systems, aircraft lighting, advanced systems and instruments, satellite and space components, and aircraft wheels and brakes; spare parts; repair, overhaul, and maintenance services; and thermal systems, as well as wireless connectivity services. Its Honeywell Building Technologies segment provides software applications for building control and optimization; sensors, switches, control systems, and instruments for energy management; access control; video surveillance; fire products; and installation, maintenance, and upgrades of systems. The company's Performance Materials and Technologies segment offers automation control, instrumentation, and software and related services; catalysts and adsorbents, equipment, and consulting; and materials to manufacture end products, such as bullet-resistant armor, nylon, computer chips, and pharmaceutical packaging, as well as provides materials based on hydrofluoro-olefin technology. Its Safety and Productivity Solutions segment provides personal protective equipment, apparel, gear, and footwear; gas detection technology; custom-engineered sensors, switches, and controls for sensing and productivity solution; cloud-based notification and emergency messaging; mobile devices and software; custom-engineered sensors, switches, and controls; and data and asset management productivity solutions. Honeywell International Inc. was founded in 1885 and is headquartered in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Cloudflare, Inc.","Symbol":"NET","Current Price":"141.51","Latest MA":"94.76","Price Target":115.04138,"Difference from MA":"49.34%","Difference from Open":"-1.00%","Change from Yesterday":"-1.92%","Change from Last Report":"0.12","Latest Volume":"2,183,422","Market Cap":"48,567,095,296","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":165.72008,"PB Ratio":49.88192,"Previous Close":144.29,"ROE":-0.1122,"DTE":149.085,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.097,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":30.892094,"Quick Ratio":3.258,"Day High":144.0,"Day Low":141.0,"VS Average Volume":0.6955090521,"Company Summary":"Cloudflare, Inc. operates as a cloud services provider that delivers a range of services to businesses worldwide. The company provides an integrated cloud-based security solution to secure a range of combination of platforms, including public cloud, private cloud, on-premise, software-as-a-service applications, and IoT devices; and website and application security products comprising web application firewall, bot management, distributed denial of service, API gateways, SSL\/TLS encryption, script management, security center, and rate limiting products. It offers website and application performance solutions, including content delivery, load balancing, DNS, agro smart routing, video stream delivery, web optimization, cache reserve, cloudfare waiting room, and cloudfare data localization suite; SASE platform through cloudfare one that provides a cloud-based network-as-a-service; network services which deliver network connectivity, security, and performance, including magic WAN, magic transit, magic firewall, cloudflare network interconnect, and spectrum. In addition, the company provides zero trust services, such as cloudflare access, cloudflare gateway, remote browser isolation, cloud access security broker, cloud email security, and data loss prevention products that protects, inspects, and provides privilege rules to grant access to data and application. Further, it provides developer-based solutions consisting of cloudflare workers, R2 object storage, workers KV, durable objects, cloudfare pages, cloudfare stream, and cloudfare images; and consumer products comprising of 1.1.1.1, a DNS resolver, WARP, a virtual private network, and cloudfare registrar that secures registration and management of domain names. The company serves customers in the technology, healthcare, financial services, consumer and retail, industrial, and non-profit industries, as well as government. Cloudflare, Inc. was incorporated in 2009 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Philip Morris International Inc","Symbol":"PM","Current Price":"143.51","Latest MA":"120.49","Price Target":136.93071,"Difference from MA":"19.10%","Difference from Open":"-1.67%","Change from Yesterday":"9.57%","Change from Last Report":"0.08","Latest Volume":"7,387,682","Market Cap":"223,133,630,464","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":18.477509,"PB Ratio":"N\/A","Previous Close":130.98,"ROE":"N\/A","DTE":"N\/A","Industry":"Tobacco","Sector":"Consumer Defensive","Beta":0.56,"Trailing PEG":1.6251,"Trailing PE":22.779364,"Trailing PS":5.995154,"Quick Ratio":0.404,"Day High":146.77,"Day Low":140.02,"VS Average Volume":1.4584223171,"Company Summary":"Philip Morris International Inc. operates as a tobacco company working to delivers a smoke-free future and evolving portfolio for the long-term to include products outside of the tobacco and nicotine sector. The company's product portfolio primarily consists of cigarettes and smoke-free products, including heat-not-burn, vapor, and oral nicotine products primarily under the IQOS and ZYN brands; and consumer accessories, such as lighters and matches. It also offers wellness and healthcare products. Philip Morris International Inc. was incorporated in 1987 and is headquartered in Stamford, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Warner Music Group Corp.","Symbol":"WMG","Current Price":"31.77","Latest MA":"30.65","Price Target":35.5555,"Difference from MA":"3.63%","Difference from Open":"2.14%","Change from Yesterday":"-1.04%","Change from Last Report":"-0.05","Latest Volume":"2,118,307","Market Cap":"16,507,666,432","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":20.562399,"PB Ratio":34.046085,"Previous Close":32.1,"ROE":1.25054,"DTE":669.764,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.365,"Trailing PEG":1.2845,"Trailing PE":38.271084,"Trailing PS":2.5865977,"Quick Ratio":0.512,"Day High":32.13,"Day Low":29.9135,"VS Average Volume":1.2383212481,"Company Summary":"Warner Music Group Corp. operates as a music entertainment company in the United States, the United Kingdom, Germany, and internationally. It operates through Recorded Music and Music Publishing segments. The Recorded Music segment is involved in the discovery and development of recording artists, as well as related marketing, promotion, distribution, sale, and licensing of music created by such recording artists; markets its music catalog through compilations and reissuances of previously released music and video titles, as well as previously unreleased materials; and conducts its operation primarily through a collection of record labels, such as Warner Records and Atlantic Records, as well as Asylum, Big Beat, Canvasback, East West, Erato, FFRR, Fueled by Ramen, Nonesuch, Parlophone, Reprise, Roadrunner, Sire, Spinnin' Records, Warner Classics, and Warner Music Nashville. This segment markets, distributes, and sells music and video products to retailers and wholesale distributors; independent labels to retail and wholesale distributors; and various distribution centers and ventures, as well as retail outlets, online physical retailers, streaming services, and download services. The Music Publishing segment owns and acquires rights to approximately one million musical compositions comprising pop hits, American standards, folk songs, and motion picture and theatrical compositions. Its catalog includes approximately 150,000 songwriters and composers; and various genres, including pop, rock, jazz, classical, country, R&B, hip-hop, rap, reggae, Latin, folk, blues, symphonic, soul, Broadway, electronic, alternative, and gospel. This segment also administers the music and soundtracks of various third-party television and film producers and studios. The company was founded in 1929 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Eli Lilly and Company","Symbol":"LLY","Current Price":"880.91","Latest MA":"849.68","Price Target":975.08575,"Difference from MA":"3.68%","Difference from Open":"4.93%","Change from Yesterday":"4.63%","Change from Last Report":"0.13","Latest Volume":"3,533,474","Market Cap":"792,216,403,968","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":30.095333,"PB Ratio":55.665718,"Previous Close":842.18,"ROE":0.65318,"DTE":218.081,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.43,"Trailing PEG":0.7971,"Trailing PE":95.13066,"Trailing PS":19.38699,"Quick Ratio":0.63,"Day High":887.7368,"Day Low":835.97,"VS Average Volume":0.9046040808,"Company Summary":"Eli Lilly and Company discovers, develops, and markets human pharmaceuticals worldwide. The company offers Basaglar, Humalog, Humalog Mix 75\/25, Humalog U-100, Humalog U-200, Humalog Mix 50\/50, insulin lispro, insulin lispro protamine, insulin lispro mix 75\/25, Humulin, Humulin 70\/30, Humulin N, Humulin R, and Humulin U-500 for diabetes; Jardiance, Mounjaro, and Trulicity for type 2 diabetes; and Zepbound for obesity. It provides oncology products, including Alimta, Cyramza, Erbitux, Jaypirca, Retevmo, Tyvyt, and Verzenio. In addition, the company offers Olumiant for rheumatoid arthritis, atopic dermatitis, severe alopecia areata, and COVID-19; Taltz for plaque psoriasis, psoriatic arthritis, ankylosing spondylitis, and non-radiographic axial spondylarthritis; Omvoh for ulcerative colitis; Cymbalta for depressive disorder, diabetic peripheral neuropathic pain, generalized anxiety disorder, fibromyalgia, and chronic musculoskeletal pain; Ebglyss for severe atopic dermatitis; and Emgality for migraine prevention and episodic cluster headache. Further, it provides Cialis for erectile dysfunction and benign prostatic hyperplasia; and Forteo for osteoporosis. It operates Lilly Seaport Innovation Center (LSC), a research and development facility in the Boston Seaport to advancing Lilly's efforts in RNA and DNA-based therapies as well as discovering new drug targets to create life-changing medicines across several disease states, including diabetes, obesity, cardiovascular diseases, neurodegeneration, and chronic pain. It has collaborations with Incyte Corporation; Boehringer Ingelheim Pharmaceuticals, Inc.; F. Hoffmann-La Roche Ltd and Genentech, Inc.; Biologics, Inc., AbCellera Biologics Inc.; Verge Genomics; and Chugai Pharmaceutical Co., Ltd, as well as development collaboration with Eli Lilly and Company for developing QIAstat-Dx IVD panel, for the detection of various APOE genotypes. The company was founded in 1876 and is headquartered in Indianapolis, Indiana.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Linde plc","Symbol":"LIN","Current Price":"455.20","Latest MA":"451.52","Price Target":491.0177,"Difference from MA":"0.82%","Difference from Open":"1.15%","Change from Yesterday":"0.33%","Change from Last Report":"0.15","Latest Volume":"711,909","Market Cap":"216,749,506,560","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":24.62884,"PB Ratio":5.533129,"Previous Close":453.7,"ROE":0.1619,"DTE":54.828,"Industry":"Specialty Chemicals","Sector":"Basic Materials","Beta":0.949,"Trailing PEG":2.5598,"Trailing PE":34.485226,"Trailing PS":6.5631948,"Quick Ratio":0.734,"Day High":459.855,"Day Low":450.01,"VS Average Volume":0.3110197641,"Company Summary":"Linde plc operates as an industrial gas company in the Americas, Europe, the Middle East, Africa, Asia, and South Pacific. It offers atmospheric gases, including oxygen, nitrogen, argon, and rare gases; and process gases, such as carbon dioxide, helium, hydrogen, electronic gases, specialty gases, and acetylene. The company also designs and constructs turnkey process plants for third-party customers, as well as for the gas businesses in various locations, such as air separation, hydrogen, synthesis, olefin, and natural gas plants. It serves a range of industries, including healthcare, chemicals and energy, manufacturing, metals and mining, food and beverage, and electronics. The company was founded in 1879 and is based in Woking, the United Kingdom.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Yum! Brands, Inc.","Symbol":"YUM","Current Price":"142.00","Latest MA":"132.73","Price Target":142.03375,"Difference from MA":"6.99%","Difference from Open":"2.36%","Change from Yesterday":"8.19%","Change from Last Report":"-0.16","Latest Volume":"2,785,803","Market Cap":"39,628,222,464","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":21.594233,"PB Ratio":"N\/A","Previous Close":131.25,"ROE":"N\/A","DTE":"N\/A","Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":1.095,"Trailing PEG":2.3911,"Trailing PE":26.492537,"Trailing PS":5.486394,"Quick Ratio":1.105,"Day High":144.4,"Day Low":138.1,"VS Average Volume":1.5687258635,"Company Summary":"Yum! Brands, Inc., together with its subsidiaries, develops, operates, and franchises quick service restaurants worldwide. The company operates through the KFC Division, the Taco Bell Division, the Pizza Hut Division, and the Habit Burger Grill Division segments. It also operates restaurants under the KFC, Pizza Hut, Taco Bell, and The Habit Burger Grill brands, which specialize in chicken, pizza, made-to-order chargrilled burgers, sandwiches, Mexican-style food categories, and other food products. The company was formerly known as TRICON Global Restaurants, Inc. and changed its name to Yum! Brands, Inc. in May 2002. Yum! Brands, Inc. was incorporated in 1997 and is headquartered in Louisville, Kentucky.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"nVent Electric plc","Symbol":"NVT","Current Price":"65.05","Latest MA":"70.59","Price Target":81.8,"Difference from MA":"-7.85%","Difference from Open":"2.25%","Change from Yesterday":"2.31%","Change from Last Report":"0.30","Latest Volume":"3,544,800","Market Cap":"10,721,281,024","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":19.580753,"PB Ratio":3.2650707,"Previous Close":63.58,"ROE":0.18530001,"DTE":72.196,"Industry":"Electrical Equipment & Parts","Sector":"Industrials","Beta":1.25,"Trailing PEG":null,"Trailing PE":18.965015,"Trailing PS":3.0293808,"Quick Ratio":0.917,"Day High":66.69,"Day Low":62.15,"VS Average Volume":2.0973708314,"Company Summary":"nVent Electric plc, together with its subsidiaries, designs, manufactures, markets, installs, and services electrical connection and protection solutions in North America, Europe, the Middle East, Africa, the Asia Pacific, and internationally. The company operates through three segments: Enclosures, Electrical & Fastening Solutions, and Thermal Management. The Enclosures segment provides solutions to protect electronics and data in mission critical applications, including data solutions. This segment also offers digital and automation solutions, system integrations, and global services. The Electrical & Fastening Solutions segment provides solutions that connect and protect power and data infrastructure. This segment also offers power connections, fastening solutions, cable management solutions, grounding and bonding systems, and tools and test instruments. The Thermal Management segment offers heat management solutions that protect people and assets. This segment includes heat tracing for freeze protection and process temperature maintenance and control; pipe freeze protection, surface deicing, hot water temperature maintenance, floor heating, fire-rated wiring, and leak detection; and heat trace systems, connected controls, remote monitoring, and annual service programs. The company markets its products through electrical distributors, contractors, and original equipment manufacturers under the CADDY, ERICO, GARDNER BENDER, HOFFMAN, ILSCO, RAYCHEM, SCHROFF, and TRACER brand names. Its products are used for various applications, such as industrial, commercial and residential, infrastructure, and energy. nVent Electric plc was founded in 1903 and is based in London, the United Kingdom.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Roblox Corporation","Symbol":"RBLX","Current Price":"65.56","Latest MA":"49.34","Price Target":62.75,"Difference from MA":"32.89%","Difference from Open":"9.03%","Change from Yesterday":"-13.12%","Change from Last Report":"-0.36","Latest Volume":"35,498,544","Market Cap":"43,025,330,176","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":-48.562355,"PB Ratio":226.86852,"Previous Close":75.47,"ROE":-7.00543,"DTE":985.81,"Industry":"Electronic Gaming & Multimedia","Sector":"Communication Services","Beta":1.561,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":12.790939,"Quick Ratio":0.792,"Day High":67.0,"Day Low":60.11,"VS Average Volume":4.6750051987,"Company Summary":"Roblox Corporation develops and operates an online entertainment platform in the United States and internationally. It offers Roblox Studio, a free toolset that allows developers and creators to build, publish, and operate 3D experiences, and other content; Roblox Client, an application that allows users to explore 3D experience; and Roblox Cloud, which provides services and infrastructure that power the platform. Roblox Corporation was incorporated in 2004 and is headquartered in San Mateo, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"ConocoPhillips","Symbol":"COP","Current Price":"99.65","Latest MA":"106.38","Price Target":131.96967,"Difference from MA":"-6.32%","Difference from Open":"0.77%","Change from Yesterday":"-0.56%","Change from Last Report":"-0.02","Latest Volume":"3,836,628","Market Cap":"128,903,266,304","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":11.053517,"PB Ratio":2.2992616,"Previous Close":100.21,"ROE":0.20376,"DTE":36.695,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":1.22,"Trailing PEG":8.2377,"Trailing PE":11.820878,"Trailing PS":2.26448,"Quick Ratio":1.078,"Day High":101.1,"Day Low":98.61,"VS Average Volume":0.5651520586,"Company Summary":"ConocoPhillips explores for, produces, transports, and markets crude oil, bitumen, natural gas, liquefied natural gas (LNG), and natural gas liquids in the United States, Canada, China, Libya, Malaysia, Norway, the United Kingdom, and internationally. The company's portfolio includes unconventional plays in North America; conventional assets in North America, Europe, Asia, and Australia; global LNG developments; oil sands assets in Canada; and an inventory of global exploration prospects. ConocoPhillips was founded in 1917 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Tapestry, Inc.","Symbol":"TPR","Current Price":"82.61","Latest MA":"51.48","Price Target":73.042,"Difference from MA":"60.47%","Difference from Open":"-5.85%","Change from Yesterday":"12.59%","Change from Last Report":"0.04","Latest Volume":"9,140,283","Market Cap":"19,252,269,056","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.057774,"PB Ratio":6.455305,"Previous Close":73.38,"ROE":0.29924,"DTE":295.298,"Industry":"Luxury Goods","Sector":"Consumer Cyclical","Beta":1.556,"Trailing PEG":2.2903,"Trailing PE":23.946377,"Trailing PS":2.8883457,"Quick Ratio":4.233,"Day High":87.8749,"Day Low":81.51,"VS Average Volume":1.8758163858,"Company Summary":"Tapestry, Inc. provides luxury accessories and branded lifestyle products in North America, Greater China, rest of Asia, and internationally. The company operates in three segments: Coach, Kate Spade, and Stuart Weitzman. It offers women's handbags; and women's accessories, such as small leather goods which includes mini and micro handbags, money pieces, wristlets, pouches, and cosmetic cases, as well as novelty accessories including address books, time management and travel accessories, sketchbooks, and portfolios; and belts, key rings, and charms. The company also provides men products, which includes bag collections, such as business cases, computer bags, messenger-style bags, backpacks, and totes; small leather goods including wallets, card cases, travel organizers, and belts; and footwear, watches, fragrances, sunglasses, novelty accessories, and ready-to-wear items. In addition, it offers other products including women's footwear and fragrances; eyewear and sunglasses; and jewelry, such as bracelets, necklaces, rings, and earrings, watches, and other women's seasonal lifestyle apparel collections, including outerwear, ready-to-wear and cold weather accessories, such as gloves, scarves, and hats. Further, the company provides kids items, housewares, and home accessories, such as fashion bedding and tableware, stationery, and gifts. It offers its products through retail and outlet stores, brand e-commerce sites, and concession shop-in-shops, wholesale, and third-party distributors under the Coach, Kate Spade, and Stuart Weitzman brand names. The company was formerly known as Coach, Inc. and changed its name to Tapestry, Inc. in October 2017. Tapestry, Inc. was founded in 1941 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Kenvue Inc.","Symbol":"KVUE","Current Price":"19.98","Latest MA":"21.49","Price Target":24.43667,"Difference from MA":"-7.00%","Difference from Open":"-2.68%","Change from Yesterday":"-3.64%","Change from Last Report":"-0.10","Latest Volume":"10,182,641","Market Cap":"38,316,441,600","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":15.5191965,"PB Ratio":3.59766,"Previous Close":20.74,"ROE":0.098809995,"DTE":82.929,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":"N\/A","Trailing PEG":1.9259,"Trailing PE":36.336365,"Trailing PS":2.4785848,"Quick Ratio":0.58,"Day High":21.1,"Day Low":19.96,"VS Average Volume":0.8066657514,"Company Summary":"Kenvue Inc. operates as a consumer health company worldwide. The company operates through three segments: Self Care, Skin Health and Beauty, and Essential Health. The Self Care segment offers cough, cold and allergy, pain care, digestive health, smoking cessation, eye care, and other products under the Tylenol, Motrin, Benadryl, Nicorette, Zarbee's, ORSLTM, Rhinocort, Calpol, and Zyrtec brands. The Skin Health and Beauty segment provides face and body care, hair, sun, and other care products under the Neutrogena, Aveeno, Dr.Ci:Labo, Le Petit Marseillais, Lubriderm, Rogaine, and OGX brand names. The Essential Health segment offers oral and baby, women's health, wound, and other care products under the Listerine, Johnson's, Band-Aid, and Stayfree, o.b., tampons, Carefree, and Desitin Diaper Rash brands. The company was incorporated in 2022 and is headquartered in Skillman, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Affirm Holdings, Inc.","Symbol":"AFRM","Current Price":"61.85","Latest MA":"46.93","Price Target":66.05789,"Difference from MA":"31.79%","Difference from Open":"-1.82%","Change from Yesterday":"-1.50%","Change from Last Report":"0.00","Latest Volume":"3,107,316","Market Cap":"19,207,831,552","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":-298.09637,"PB Ratio":6.849186,"Previous Close":62.8,"ROE":-0.16519,"DTE":251.092,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":3.477,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":7.60727,"Quick Ratio":12.914,"Day High":63.3599,"Day Low":61.45,"VS Average Volume":0.3818816506,"Company Summary":"Affirm Holdings, Inc. operates payment network in the United States, Canada, and internationally. The company's platform includes point-of-sale payment solution for consumers, merchant commerce solutions, and a consumer-focused app. Its commerce platform, agreements with originating banks, and capital markets partners enables consumers to pay for a purchase over time. The company has active merchants covering small businesses, large enterprises, direct-to-consumer brands, brick-and-mortar stores, and companies with an omni-channel presence. Its merchants represent a range of industries, including sporting goods and outdoors, home and lifestyle, travel and ticketing, electronics, fashion and beauty, equipment and auto, and general merchandise. Affirm Holdings, Inc. was founded in 2012 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Bristol-Myers Squibb Company","Symbol":"BMY","Current Price":"58.53","Latest MA":"51.85","Price Target":61.72,"Difference from MA":"12.90%","Difference from Open":"2.03%","Change from Yesterday":"-1.97%","Change from Last Report":"-0.02","Latest Volume":"12,852,639","Market Cap":"118,719,512,576","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":9.218516,"PB Ratio":6.9247603,"Previous Close":59.71,"ROE":-0.3133,"DTE":299.052,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.441,"Trailing PEG":2.0894,"Trailing PE":"N\/A","Trailing PS":2.5027828,"Quick Ratio":1.016,"Day High":59.38,"Day Low":56.91,"VS Average Volume":1.1714435191,"Company Summary":"Bristol-Myers Squibb Company discovers, develops, licenses, manufactures, markets, distributes, and sells biopharmaceutical products worldwide. It offers products for hematology, oncology, cardiovascular, immunology, fibrotic, and neuroscience diseases. The company's products include Eliquis for reduction in risk of stroke\/systemic embolism in non-valvular atrial fibrillation, and for the treatment of DVT\/PE; Opdivo for various anti-cancer indications, including bladder, blood, CRC, head and neck, RCC, HCC, lung, melanoma, MPM, stomach and esophageal cancer; Pomalyst\/Imnovid for multiple myeloma; Orencia for active rheumatoid arthritis and psoriatic arthritis; and Sprycel for the treatment of Philadelphia chromosome-positive chronic myeloid leukemia. It also provides Yervoy for the treatment of patients with unresectable or metastatic melanoma; Empliciti for the treatment of multiple myeloma; Abecma for the treatment of relapsed or refractory multiple myeloma; Reblozyl for the treatment of anemia; Opdualag for the treatment of unresectable or metastatic melanoma; and Zeposia to treat relapsing forms of multiple sclerosis. In addition, the company offers Breyanzi for the treatment of relapsed or refractory large B-cell lymphoma; Onureg for the treatment of AML; Inrebic for the treatment of myelofibrosis; Camzyos for the treatment of symptomatic obstructive HCM to enhance functional capacity and symptom; Sotyktu for the treatment of moderate-to-severe plaque psoriasis; Augtyro for the treatment of locally advanced or metastatic ROS1-positive NSCLC; Revlimid, an oral immunomodulatory drug for the treatment of multiple myeloma; and Abraxane to treat breast cancer, NSCLC and pancreatic cancer. It sells products to wholesalers, distributors, pharmacies, retailers, hospitals, clinics, and government agencies. The company was formerly known as Bristol-Myers Company. Bristol-Myers Squibb Company was founded in 1887 and is headquartered in Princeton, New Jersey.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"The Hershey Company","Symbol":"HSY","Current Price":"152.37","Latest MA":"180.50","Price Target":164.8475,"Difference from MA":"-15.59%","Difference from Open":"-1.86%","Change from Yesterday":"4.42%","Change from Last Report":"-0.12","Latest Volume":"2,164,725","Market Cap":"30,832,832,512","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":19.003183,"PB Ratio":7.332178,"Previous Close":145.92,"ROE":0.43405998,"DTE":134.227,"Industry":"Confectioners","Sector":"Consumer Defensive","Beta":0.374,"Trailing PEG":4.5247,"Trailing PE":17.513792,"Trailing PS":2.8101802,"Quick Ratio":0.419,"Day High":156.59,"Day Low":150.52,"VS Average Volume":0.9149766683,"Company Summary":"The Hershey Company, together with its subsidiaries, engages in the manufacture and sale of confectionery products and pantry items in the United States and internationally. The company operates through three segments: North America Confectionery, North America Salty Snacks, and International. It offers chocolate and non-chocolate confectionery products; gum and mint refreshment products, including mints, chewing gums, and bubble gums; protein bars; pantry items, such as baking ingredients, toppings, beverages, and sundae syrups; and snack items comprising spreads, bars, snack bites, mixes, popcorn, and pretzels. The company provides its products primarily under the Hershey's, Reese's, Kisses, Jolly Rancher, Almond Joy, Brookside, barkTHINS, Cadbury, Good & Plenty, Heath, Kit Kat, Payday, Rolo, Twizzlers, Whoppers, York, Ice Breakers, Breath Savers, Bubble Yum, Lily's, SkinnyPop, Pirates Booty, Dot's Homestyle Pretzels, and ONE Bar brands, as well as under the Pelon Pelo Rico, IO-IO, and Sofit brands. It markets and sells its products to wholesale distributors, chain grocery stores, mass merchandisers, chain drug stores, vending companies, wholesale clubs, convenience stores, dollar stores, concessionaires, and department stores. The company exports its products in approximately 80 countries worldwide. The Hershey Company was founded in 1894 and is headquartered in Hershey, Pennsylvania.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Pinterest, Inc.","Symbol":"PINS","Current Price":"33.70","Latest MA":"32.45","Price Target":39.33784,"Difference from MA":"3.87%","Difference from Open":"1.89%","Change from Yesterday":"1.22%","Change from Last Report":"0.24","Latest Volume":"4,507,221","Market Cap":"22,778,716,160","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":18.587454,"PB Ratio":7.8621416,"Previous Close":33.3,"ROE":0.07572,"DTE":5.335,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.017,"Trailing PEG":0.4534,"Trailing PE":105.32813,"Trailing PS":6.5582385,"Quick Ratio":7.63,"Day High":33.9,"Day Low":33.08,"VS Average Volume":0.3980835869,"Company Summary":"Pinterest, Inc. operates as a visual search and discovery platform in the United States and internationally. Its platform allows people to find ideas, such as recipes, home and style inspiration, and others; and to search, save, and shop the ideas. The company was formerly known as Cold Brew Labs Inc. and changed its name to Pinterest, Inc. in April 2012. Pinterest, Inc. was incorporated in 2008 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Equifax, Inc.","Symbol":"EFX","Current Price":"251.59","Latest MA":"273.05","Price Target":305.3216,"Difference from MA":"-7.86%","Difference from Open":"-1.27%","Change from Yesterday":"-6.90%","Change from Last Report":"0.00","Latest Volume":"2,057,073","Market Cap":"31,184,463,872","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":23.024668,"PB Ratio":6.3497896,"Previous Close":270.23,"ROE":0.11927,"DTE":108.422,"Industry":"Consulting Services","Sector":"Industrials","Beta":1.594,"Trailing PEG":0.9142,"Trailing PE":55.783813,"Trailing PS":5.580413,"Quick Ratio":0.79,"Day High":260.05,"Day Low":250.0,"VS Average Volume":2.154684518,"Company Summary":"Equifax Inc. operates as a data, analytics, and technology company. The company operates through three segments: Workforce Solutions, U.S. Information Solutions (USIS), and International. The Workforce Solutions segment offers services that enables customers to verify income, employment, educational history, criminal justice data, healthcare professional licensure, and sanctions of people in the United States; and employer customers with services that assist them in complying with and automating payroll-related and human resource management processes throughout the entire cycle of the employment relationship. The USIS segment provides consumer and commercial information services, such as credit information and credit scoring, credit modeling and portfolio analytics, locate, fraud detection and prevention, identity verification, and other consulting services; mortgage services; financial marketing services; identity management services; and credit monitoring products. The International segment offers information service products, which include consumer and commercial services, such as credit and financial information, and credit scoring and modeling; and credit and other marketing products and services, as well as offers information, technology, and other services to support debt collections and recovery management. The company serves customers in financial services, mortgage, retail, telecommunications, utilities, automotive, brokerage, healthcare, and insurance industries, as well as government agencies. It operates in Argentina, Australia, Brazil, Canada, Chile, Costa Rica, Dominican Republic, Ecuador, El Salvador, Honduras, India, Ireland, Mexico, New Zealand, Paraguay, Peru, Portugal, Spain, the United Kingdom, Uruguay, and the United States. The company was founded in 1899 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"BorgWarner Inc.","Symbol":"BWA","Current Price":"30.34","Latest MA":"33.17","Price Target":39.41765,"Difference from MA":"-8.54%","Difference from Open":"-4.77%","Change from Yesterday":"-2.66%","Change from Last Report":"-0.49","Latest Volume":"2,401,959","Market Cap":"6,635,358,208","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":6.0381,"PB Ratio":1.0778741,"Previous Close":31.17,"ROE":0.15923999,"DTE":74.606,"Industry":"Auto Parts","Sector":"Consumer Cyclical","Beta":1.186,"Trailing PEG":1.2103,"Trailing PE":7.509901,"Trailing PS":0.4683011,"Quick Ratio":1.407,"Day High":32.98,"Day Low":30.34,"VS Average Volume":1.0543648024,"Company Summary":"BorgWarner Inc., together with its subsidiaries, provides solutions for combustion, hybrid, and electric vehicles worldwide. It offers turbochargers, eBoosters, eTurbos, timing systems, emissions systems, thermal systems, gasoline ignition technology, smart remote actuators, powertrain sensors, cabin heaters, battery modules and systems, battery heaters, and battery charging. The company provides power electronics, control modules, software, friction, and mechanical products for automatic transmissions and torque-management products. It sells its products to original equipment manufacturers of light vehicles, which comprise passenger cars, sport-utility vehicles, vans, and light trucks; commercial vehicles, including medium-duty and heavy-duty trucks, and buses; and off-highway vehicles, such as agricultural and construction machinery, and marine applications, as well as to tier one vehicle systems suppliers and the aftermarket for light, commercial, and off-highway vehicles. The company was formerly known as Borg-Warner Automotive, Inc. BorgWarner Inc. was incorporated in 1987 and is headquartered in Auburn Hills, Michigan.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Microchip Technology Incorporat","Symbol":"MCHP","Current Price":"53.46","Latest MA":"71.86","Price Target":77.64167,"Difference from MA":"-25.60%","Difference from Open":"-0.37%","Change from Yesterday":"-0.07%","Change from Last Report":"0.09","Latest Volume":"4,216,202","Market Cap":"28,708,552,704","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":23.207455,"PB Ratio":4.574313,"Previous Close":53.5,"ROE":0.118030004,"DTE":102.895,"Industry":"Semiconductors","Sector":"Technology","Beta":1.526,"Trailing PEG":8.9386,"Trailing PE":37.124996,"Trailing PS":5.2229657,"Quick Ratio":0.405,"Day High":54.2195,"Day Low":53.21,"VS Average Volume":0.4903431109,"Company Summary":"Microchip Technology Incorporated engages in the development, manufacture, and sale of smart, connected, and secure embedded control solutions in the Americas, Europe, and Asia. The company offers general purpose 8-bit, 16-bit, and 32-bit mixed-signal microcontrollers; 32-bit embedded mixed-signal microprocessors; and specialized microcontrollers for automotive, industrial, computing, communications, lighting, power supplies, motor control, human machine interface, security, wired connectivity, and wireless connectivity applications. It also provides analog, interface, mixed signal, and timing products comprising power management, linear, mixed-signal, high-voltage, thermal management, discrete diodes, and metal oxide semiconductor field effect transistors (MOSFETS), radio frequency (RF), drivers, safety, security, timing, USB, Ethernet, wireless, and other interface products; field-programmable gate array (FPGA) products; and application development tools that enable system designers to program microcontroller, FPGA, and microprocessor products for specific applications. In addition, the company offers serial electrically erasable programmable read-only memory, serial flash memories, parallel flash memories, serial static random access memories, and serial electrically erasable random access memories for the production of very small footprint devices; and licenses its SuperFlash embedded flash and non-volatile memory technologies to foundries, integrated device manufacturers, and design partners for use in the manufacture of microcontroller products, gate array, RF, analog, and neuromorphic compute products that require embedded non-volatile memory, as well as provides engineering services. Further, it offers wafer foundry and assembly, and test subcontracting manufacturing services; and timing systems products, application specific integrated circuits, and aerospace products. The company was incorporated in 1989 and is headquartered in Chandler, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Amazon.com, Inc.","Symbol":"AMZN","Current Price":"236.32","Latest MA":"199.24","Price Target":249.69365,"Difference from MA":"18.61%","Difference from Open":"-0.82%","Change from Yesterday":"0.07%","Change from Last Report":"0.01","Latest Volume":"17,011,281","Market Cap":"2,484,904,919,040","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":38.083576,"PB Ratio":9.585074,"Previous Close":236.17,"ROE":0.22558,"DTE":61.175,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":1.146,"Trailing PEG":1.9409,"Trailing PE":50.49573,"Trailing PS":4.007084,"Quick Ratio":0.827,"Day High":239.5,"Day Low":236.01,"VS Average Volume":0.4673111742,"Company Summary":"Amazon.com, Inc. engages in the retail sale of consumer products, advertising, and subscriptions service through online and physical stores in North America and internationally. The company operates through three segments: North America, International, and Amazon Web Services (AWS). It also manufactures and sells electronic devices, including Kindle, Fire tablets, Fire TVs, Echo, Ring, Blink, and eero; and develops and produces media content. In addition, the company offers programs that enable sellers to sell their products in its stores; and programs that allow authors, independent publishers, musicians, filmmakers, Twitch streamers, skill and app developers, and others to publish and sell content. Further, it provides compute, storage, database, analytics, machine learning, and other services, as well as advertising services through programs, such as sponsored ads, display, and video advertising. Additionally, the company offers Amazon Prime, a membership program. The company's products offered through its stores include merchandise and content purchased for resale and products offered by third-party sellers. It serves consumers, sellers, developers, enterprises, content creators, advertisers, and employees. Amazon.com, Inc. was incorporated in 1994 and is headquartered in Seattle, Washington.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Skyworks Solutions, Inc.","Symbol":"SWKS","Current Price":"66.16","Latest MA":"96.18","Price Target":74.96952,"Difference from MA":"-31.21%","Difference from Open":"5.79%","Change from Yesterday":"-24.02%","Change from Last Report":"0.02","Latest Volume":"11,949,264","Market Cap":"10,634,625,024","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":14.396129,"PB Ratio":1.668432,"Previous Close":87.08,"ROE":0.12777,"DTE":15.691,"Industry":"Semiconductors","Sector":"Technology","Beta":1.205,"Trailing PEG":1.1252,"Trailing PE":20.356924,"Trailing PS":2.4325507,"Quick Ratio":3.333,"Day High":67.3,"Day Low":62.01,"VS Average Volume":4.6581084732,"Company Summary":"Skyworks Solutions, Inc., together with its subsidiaries, designs, develops, manufactures, and markets proprietary semiconductor products in the United States, China, South Korea, Taiwan, Europe, the Middle East, Africa, and the rest of Asia-Pacific. Its product portfolio includes amplifiers, antenna tuners, attenuators, automotive tuners and digital radios, DC\/DC converters, demodulators, detectors, diodes, wireless analog system on chip products, directional couplers, diversity receive modules, filters, front-end modules, hybrids, light emitting diode drivers, low noise amplifiers, mixers, modulators, optocouplers\/optoisolators, phase locked loops, phase shifters, power dividers\/combiners, power over ethernet, power isolators, receivers, switches, synthesizers, timing devices, voltage controlled oscillators\/synthesizers, and voltage regulators. The company products are the used in aerospace, automotive, broadband, cellular infrastructure, connected home, defense, entertainment and gaming, industrial, medical, military, smartphone, tablet, and wearable markets. It sells its products through direct sales force, electronic component distributors, and independent sales representatives. Skyworks Solutions, Inc. was founded in 1962 and is based in Irvine, California.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Cognizant Technology Solutions ","Symbol":"CTSH","Current Price":"87.07","Latest MA":"76.71","Price Target":86.35174,"Difference from MA":"13.50%","Difference from Open":"3.15%","Change from Yesterday":"4.15%","Change from Last Report":"-0.08","Latest Volume":"2,747,525","Market Cap":"43,171,393,536","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":16.260876,"PB Ratio":2.9882967,"Previous Close":83.6,"ROE":0.16478,"DTE":12.891,"Industry":"Information Technology Services","Sector":"Technology","Beta":1.052,"Trailing PEG":1.3946,"Trailing PE":19.305986,"Trailing PS":2.2239537,"Quick Ratio":1.839,"Day High":87.61,"Day Low":83.35,"VS Average Volume":0.9287849035,"Company Summary":"Cognizant Technology Solutions Corporation, a professional services company, provides consulting and technology, and outsourcing services in North America, Europe, and internationally. It operates through four segments: Financial Services, Health Sciences, Products and Resources, and Communications, Media and Technology. The company provides customer experience, robotic process automation, analytics, and AI services in areas, such as digital lending, fraud detection, and next generation payments; the shift towards consumerism, outcome-based contracting, digital health, delivering integrated seamless, omni-channel, and patient-centered experience; and services that drive operational improvements in areas, such as clinical development, pharmacovigilance, and manufacturing, as well as claims processing, enrollment, membership, and billing to healthcare providers and payers, and life sciences companies, including pharmaceutical, biotech, and medical device companies. It offers solution to manufacturers, automakers, retailers and travel and hospitality companies, as well as companies providing logistics, energy and utility services; and digital content, business process improvement, technology modernization, and the creation of unified and compelling user experience services to communications, media and entertainment, education, and information services and technology companies. The company was incorporated in 1988 and is headquartered in Teaneck, New Jersey.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Fiserv, Inc.","Symbol":"FI","Current Price":"231.01","Latest MA":"189.16","Price Target":251.7103,"Difference from MA":"22.12%","Difference from Open":"0.66%","Change from Yesterday":"0.64%","Change from Last Report":"-0.05","Latest Volume":"950,859","Market Cap":"131,425,968,128","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":19.276503,"PB Ratio":4.7448955,"Previous Close":229.53,"ROE":0.10618,"DTE":89.406,"Industry":"Information Technology Services","Sector":"Technology","Beta":0.919,"Trailing PEG":1.5442,"Trailing PE":43.018623,"Trailing PS":6.531457,"Quick Ratio":0.215,"Day High":232.25,"Day Low":228.27,"VS Average Volume":0.3492928618,"Company Summary":"Fiserv, Inc., together with its subsidiaries, provides payments and financial services technology services in the United States, Europe, the Middle East and Africa, Latin America, the Asia-Pacific, and internationally. It operates through Merchant Acceptance, Financial Technology, and Payments and Network segments. The Merchant Acceptance segment provides merchant acquiring and digital commerce services; mobile payment services; security and fraud protection products; Clover, a cloud based POS and integrated commerce operating system for small and mid-sized businesses and independent software vendors; and Carat, an integrated operating system for large businesses. This segment distributes through various channels, including direct sales teams, strategic partnerships with agent sales forces, independent software vendors, financial institutions, and other strategic partners in the form of joint venture alliances, revenue sharing alliances, and referral agreement. The Financial Technology segment offers customer deposit and loan accounts, as well as manages an institution's general ledger and central information files. This segment also provides digital banking, financial and risk management, professional services and consulting, check processing, and other products and services. The Payments and Network segment offers card transactions, such as debit, credit, and prepaid card processing and services; funds access, debit payments, cardless ATM access, and surcharge-free ATM network; security and fraud protection products; card production; print services; and various network services, as well as non-card digital payment software and services, including bill payment, account-to-account transfers, person-to-person payments, electronic billing, and security and fraud protection products. It serves merchants, banks, credit unions, other financial institutions, and corporate clients. Fiserv, Inc. was incorporated in 1984 and is headquartered in Milwaukee, Wisconsin.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Hologic, Inc.","Symbol":"HOLX","Current Price":"65.99","Latest MA":"77.88","Price Target":81.10067,"Difference from MA":"-15.26%","Difference from Open":"-2.96%","Change from Yesterday":"-9.35%","Change from Last Report":"0.03","Latest Volume":"3,661,129","Market Cap":"14,895,460,352","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":14.303487,"PB Ratio":3.0072,"Previous Close":72.8,"ROE":0.13846,"DTE":49.407,"Industry":"Medical Instruments & Supplies","Sector":"Healthcare","Beta":0.986,"Trailing PEG":1.4755,"Trailing PE":20.88291,"Trailing PS":3.735445,"Quick Ratio":3.069,"Day High":68.5,"Day Low":65.87,"VS Average Volume":1.6836043591,"Company Summary":"Hologic, Inc. engages in the development, manufacture, and supply of diagnostics products, medical imaging systems, and surgical products for women's health through early detection and treatment worldwide. The company operates through four segments: Diagnostics, Breast Health, GYN Surgical, and Skeletal Health. It provides Aptima molecular diagnostic assays to detect the infectious microorganisms; Aptima viral load assays for Hepatitis B virus, Hepatitis C virus, human immunodeficiency virus, and human cytomegalo virus; Aptima bacterial vaginosis and candida vaginitis assays for the diagnosis of vaginitis; Aptima SARS-CoV-2 and Panther Fusion SARS-CoV-2 assays to detect SARS-CoV-2; ThinPrep System for cytology applications; and Rapid Fetal Fibronectin Test that assists physicians in assessing the risk of pre-term birth. The company also offers breast cancer care solutions in the areas of radiology, breast surgery, pathology, and treatment, such as 3D digital mammography systems, image analytics software, reading workstations, minimally invasive breast biopsy guidance systems, breast biopsy site markers, localization, and specimen radiology solutions; and breast conserving surgery products. In addition, it provides MyoSure Hysteroscopic Tissue Removal System for the removal of fibroids and polyps in the uterus; NovaSure Endometrial Ablation System to treat abnormal uterine bleeding; Fluent Fluid Management System that provides liquid distention during diagnostic and operative hysteroscopic procedures; Acessa ProVu system to treat various fibroids; and CoolSeal portfolio, such as bipolar vessel sealing devices. Further, it offers Horizon DXA, a dual energy X-ray system; and Fluoroscan Insight FD mini C-arm to perform minimally invasive orthopedic surgical procedures. It sells its products through direct sales, service forces, independent distributors, and sales representatives. The company was incorporated in 1985 and is headquartered in Marlborough, Massachusetts.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"RTX Corporation","Symbol":"RTX","Current Price":"128.26","Latest MA":"117.98","Price Target":142.005,"Difference from MA":"8.71%","Difference from Open":"-0.62%","Change from Yesterday":"-0.70%","Change from Last Report":"0.03","Latest Volume":"915,047","Market Cap":"170,857,709,568","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":18.765781,"PB Ratio":2.7934225,"Previous Close":129.16,"ROE":0.073460005,"DTE":69.597,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":0.54,"Trailing PEG":1.3357,"Trailing PE":36.129578,"Trailing PS":2.1616066,"Quick Ratio":0.602,"Day High":129.745,"Day Low":127.96,"VS Average Volume":0.2008360055,"Company Summary":"RTX Corporation, an aerospace and defense company, provides systems and services for the commercial, military, and government customers in the United States and internationally. It operates through three segments: Collins Aerospace, Pratt & Whitney, and Raytheon. The Collins Aerospace Systems segment offers aerospace and defense products, and aftermarket service solutions for civil and military aircraft manufacturers and commercial airlines, as well as regional, business, and general aviation, defense, and commercial space operations. This segment also designs, produces, and supports cabin interior, including oxygen systems, food and beverage preparation, storage and galley systems, and lavatory and wastewater management systems; battlespace, test and training range systems, crew escape systems, and simulation and training solutions; information management services; and aftermarket services that include spare parts, overhaul and repair, engineering and technical support, training and fleet management solutions, and asset and information management services. Its Pratt & Whitney segment supplies aircraft engines for commercial, military, business jet, and general aviation customers; and produces, sells, and services military and commercial auxiliary power units. The Raytheon segment provides defensive and offensive threat detection, tracking, and mitigation capabilities for U.S., foreign government, and commercial customers. The company was formerly known as Raytheon Technologies Corporation and changed its name to RTX Corporation in July 2023. RTX Corporation was incorporated in 1934 and is headquartered in Arlington, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Uber Technologies, Inc.","Symbol":"UBER","Current Price":"67.22","Latest MA":"70.24","Price Target":88.44265,"Difference from MA":"-4.30%","Difference from Open":"2.37%","Change from Yesterday":"4.26%","Change from Last Report":"0.12","Latest Volume":"17,417,578","Market Cap":"141,556,350,976","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":15.626088,"PB Ratio":9.570757,"Previous Close":64.48,"ROE":0.34326,"DTE":80.343,"Industry":"Software - Application","Sector":"Technology","Beta":1.337,"Trailing PEG":0.6826,"Trailing PE":14.742325,"Trailing PS":3.3740044,"Quick Ratio":1.223,"Day High":67.89,"Day Low":65.54,"VS Average Volume":0.6577396493,"Company Summary":"Uber Technologies, Inc. develops and operates proprietary technology applications in the United States, Canada, Latin America, Europe, the Middle East, Africa, and Asia excluding China and Southeast Asia. It operates through three segments: Mobility, Delivery, and Freight. The Mobility segment connects consumers with a range of transportation modalities, such as ridesharing, carsharing, micromobility, rentals, public transit, taxis, and other modalities; and offers riders in a variety of vehicle types, as well as financial partnerships products and advertising services. The Delivery segment allows to search for and discover restaurants to grocery, alcohol, convenience, and other retails; order a meal or other items; and Uber direct, a white-label Delivery-as-a-Service for retailers and restaurants, as well as advertising. The Freight segment manages transportation and logistics network, which connects shippers and carriers in digital marketplace including carriers upfronts, pricing, and shipment booking; and provides on-demand platform to automate logistics end-to-end transactions for small-and medium-sized business to global enterprises. The company was formerly known as Ubercab, Inc. and changed its name to Uber Technologies, Inc. in February 2011. Uber Technologies, Inc. was founded in 2009 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Coherent Corp.","Symbol":"COHR","Current Price":"100.56","Latest MA":"88.79","Price Target":114.86111,"Difference from MA":"13.25%","Difference from Open":"-2.61%","Change from Yesterday":"11.61%","Change from Last Report":"-0.11","Latest Volume":"5,603,852","Market Cap":"15,553,011,712","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":22.960527,"PB Ratio":2.9488006,"Previous Close":90.1,"ROE":-0.00863,"DTE":50.88,"Industry":"Scientific & Technical Instruments","Sector":"Technology","Beta":1.654,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":3.1088986,"Quick Ratio":1.371,"Day High":107.37,"Day Low":98.7,"VS Average Volume":1.8885007018,"Company Summary":"Coherent Corp. develops, manufactures, and markets engineered materials, optoelectronic components and devices, and optical and laser systems and subsystems for the use in the industrial, communications, electronics, and instrumentation markets worldwide. It operates through three segments: Networking, Materials, and Lasers. The Networking segment offers telecommunication products for fiber-optic transmission; datacom transceivers, including pluggable transceivers for ethernet and fiber channel applications; and advanced optics, such as fiber and precision optics used in projection displays, crystal materials and components for optical communications, filters and assemblies for life sciences, sensors, instrumentation, and semiconductor equipment, as well as ultraviolet (UV), visible, and near-infrared spectroscopy optics for industrial lasers. The Materials segments provides laser optics and accessories; infrared thermal imaging optics and assemblies; polycrystalline materials; thermoelectric components, subassemblies, and systems; ceramic and metal-matrix composite products; semiconductor lasers and laser bars; Q-switched laser modules, uncooled pump laser modules, and laser systems for superhard materials processing; laser processing heads and beam delivery systems; EELs, VCSELs, and detectors; pumps for amplifiers; precision optical assemblies, infrared optics, thin-film coatings and optical materials; optical solutions; and integrated circuits for transceivers. The Lasers segment offers UV gas and solid-state lasers; UV optical systems, line beams, and mask-based imaging systems; UV nanosecond lasers; continuous-wave lasers and systems; amplifiers; subsystems and standard systems; IR lasers; crystals and diode lasers, and specialty polishing and coating solutions. The company was formerly known as II-VI Incorporated and changed its name to Coherent Corp. in September 2022. Coherent Corp. was incorporated in 1971 and is headquartered in Saxonburg, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Ford Motor Company","Symbol":"F","Current Price":"9.37","Latest MA":"10.74","Price Target":11.16083,"Difference from MA":"-12.77%","Difference from Open":"-1.30%","Change from Yesterday":"-6.44%","Change from Last Report":"0.01","Latest Volume":"123,750,913","Market Cap":"37,224,787,968","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":5.3903923,"PB Ratio":0.84003586,"Previous Close":10.01,"ROE":0.0799,"DTE":359.359,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":1.636,"Trailing PEG":0.8686,"Trailing PE":10.643636,"Trailing PS":0.2037002,"Quick Ratio":0.942,"Day High":9.64,"Day Low":9.29,"VS Average Volume":1.9963594255,"Company Summary":"Ford Motor Company develops, delivers, and services a range of Ford trucks, commercial cars and vans, sport utility vehicles, and Lincoln luxury vehicles worldwide. It operates through Ford Blue, Ford Model e, and Ford Pro; Ford Next; and Ford Credit segments. The company sells Ford and Lincoln vehicles, service parts, and accessories through distributors and dealers, as well as through dealerships to commercial fleet customers, daily rental car companies, and governments. It also engages in vehicle-related financing and leasing activities to and through automotive dealers. In addition, the company provides retail installment sale contracts for new and used vehicles; and direct financing leases for new vehicles to retail and commercial customers, such as leasing companies, government entities, daily rental companies, and fleet customers. Further, it offers wholesale loans to dealers to finance the purchase of vehicle inventory; and loans to dealers to finance working capital and enhance dealership facilities, purchase dealership real estate, and other dealer vehicle programs. The company was incorporated in 1903 and is based in Dearborn, Michigan.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Ares Capital Corporation","Symbol":"ARCC","Current Price":"22.64","Latest MA":"20.95","Price Target":23.03846,"Difference from MA":"8.07%","Difference from Open":"-1.95%","Change from Yesterday":"-1.99%","Change from Last Report":"-0.15","Latest Volume":"3,210,470","Market Cap":"15,202,352,128","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":10.503119,"PB Ratio":1.1450536,"Previous Close":23.1,"ROE":0.1338,"DTE":106.255,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.054,"Trailing PEG":null,"Trailing PE":9.278688,"Trailing PS":5.1743884,"Quick Ratio":1.29,"Day High":23.1,"Day Low":22.635,"VS Average Volume":0.6906353022,"Company Summary":"Ares Capital Corporation is a business development company specializing in acquisition, recapitalization, mezzanine debt, restructurings, rescue financing, and leveraged buyout transactions of middle market companies. It also makes growth capital and general refinancing. It prefers to make investments in companies engaged in the basic and growth manufacturing, business services, consumer products, health care products and services, and information technology service sectors. The fund will also consider investments in industries such as restaurants, retail, oil and gas, and technology sectors. It focuses on investments in Northeast, Mid-Atlantic, Southeast and Southwest regions from its New York office, the Midwest region, from the Chicago office, and the Western region from the Los Angeles office. The fund typically invests between $20 million and $200 million and a maximum of $400 million in companies with an EBITDA between $10 million and $250 million. It makes debt investments between $10 million and $100 million The fund invests through revolvers, first lien loans, warrants, unitranche structures, second lien loans, mezzanine debt, private high yield, junior capital, subordinated debt, and non-control preferred and common equity. The fund also selectively considers third-party-led senior and subordinated debt financings and opportunistically considers the purchase of stressed and discounted debt positions. The fund prefers to be an agent and\/or lead the transactions in which it invests. The fund also seeks board representation in its portfolio companies.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Walt Disney Company (The)","Symbol":"DIS","Current Price":"111.21","Latest MA":"100.14","Price Target":125.34643,"Difference from MA":"11.05%","Difference from Open":"-0.60%","Change from Yesterday":"0.60%","Change from Last Report":"0.23","Latest Volume":"5,076,930","Market Cap":"201,041,428,480","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":18.238539,"PB Ratio":2.0070457,"Previous Close":110.54,"ROE":0.0546,"DTE":45.188,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.398,"Trailing PEG":0.9705,"Trailing PE":36.106625,"Trailing PS":2.233099,"Quick Ratio":0.531,"Day High":112.65,"Day Low":109.15,"VS Average Volume":0.5266864729,"Company Summary":"The Walt Disney Company operates as an entertainment company worldwide. It operates through three segments: Entertainment, Sports, and Experiences. The company produces and distributes film and television video streaming content under the ABC Television Network, Disney, Freeform, FX, Fox, National Geographic, and Star brand television channels, as well as ABC television stations and A+E television networks; and produces original content under the ABC Signature, Disney Branded Television, FX Productions, Lucasfilm, Marvel, National Geographic Studios, Pixar, Searchlight Pictures, Twentieth Century Studios, 20th Television, and Walt Disney Pictures banners. It also offers direct-to-consumer streaming services through Disney+, Disney+ Hotstar, Hulu, and Star+; sports-related entertainment services through ESPN, ESPN on ABC, ESPN+ DTC, and Star; sale\/licensing of film and episodic content to third-party television and VOD services; theatrical, home entertainment, and music distribution services; DVD and Blu-ray discs, electronic home video licenses, and VOD rental services; staging and licensing of live entertainment events; and post-production services. In addition, the company operates theme parks and resorts comprising Walt Disney World Resort, Disneyland Resort, Disneyland Paris, Hong Kong Disneyland Resort, Shanghai Disney Resort, Disney Cruise Line, Disney Vacation Club, National Geographic Expeditions, and Adventures by Disney, as well as Aulani, a Disney resort and spa in Hawaii. It also licenses its intellectual property to a third party for operations of the Tokyo Disney Resort; licenses trade names, characters, visual, literary, and other IP for use on merchandise, published materials, and games; operates a direct-to-home satellite distribution platform; sells branded merchandise through retail, online, and wholesale businesses; and develops and publishes books, comic books, and magazines. The company was founded in 1923 and is based in Burbank, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Pepsico, Inc.","Symbol":"PEP","Current Price":"144.39","Latest MA":"163.24","Price Target":165.66591,"Difference from MA":"-11.55%","Difference from Open":"-1.28%","Change from Yesterday":"-0.87%","Change from Last Report":"-0.11","Latest Volume":"2,083,906","Market Cap":"198,030,884,864","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":16.232496,"PB Ratio":10.191276,"Previous Close":145.66,"ROE":0.48819,"DTE":229.605,"Industry":"Beverages - Non-Alcoholic","Sector":"Consumer Defensive","Beta":0.542,"Trailing PEG":1.7543,"Trailing PE":20.77554,"Trailing PS":2.154383,"Quick Ratio":0.664,"Day High":146.9,"Day Low":143.96,"VS Average Volume":0.318525947,"Company Summary":"PepsiCo, Inc. engages in the manufacture, marketing, distribution, and sale of various beverages and convenient foods worldwide. The company operates through seven segments: Frito-Lay North America; Quaker Foods North America; PepsiCo Beverages North America; Latin America; Europe; Africa, Middle East and South Asia; and Asia Pacific, Australia and New Zealand and China Region. It provides dips, cheese-flavored snacks, and spreads, as well as corn, potato, and tortilla chips; cereals, rice, pasta, mixes and syrups, granola bars, grits, oatmeal, rice cakes, and side dishes; beverage concentrates, fountain syrups, and finished goods; ready-to-drink tea, coffee, and juices; dairy products; and sparkling water makers and related products, as well as distributes alcoholic beverages under Hard MTN Dew brand. The company offers its products primarily under the Lay's, Doritos, Fritos, Tostitos, BaiCaoWei, Cheetos, Cap'n Crunch, Life, Pearl Milling Company, Gatorade, Pepsi-Cola, Mountain Dew, Quaker, Rice-A-Roni, Aquafina, Bubly, Emperador, Diet Mountain Dew, Diet Pepsi, Gatorade Zero, Crush, Propel, Dr Pepper, Schweppes, Marias Gamesa, Ruffles, Sabritas, Saladitas, Tostitos, 7UP, Diet 7UP, H2oh!, Manzanita Sol, Mirinda, Pepsi Black, Pepsi Max, San Carlos, Toddy, Walkers, Chipsy, Kurkure, Sasko, Spekko, White Star, Smith's, Sting, SodaStream, Lubimyj Sad, Agusha, Chudo, Domik v Derevne, Lipton, and other brands. It serves wholesale and other distributors, foodservice customers, grocery stores, drug stores, convenience stores, discount\/dollar stores, mass merchandisers, membership stores, hard discounters, e-commerce retailers and authorized independent bottlers, and others through a network of direct-store-delivery, customer warehouse, and distributor networks, as well as directly to consumers through e-commerce platforms and retailers. The company was founded in 1898 and is based in Purchase, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"NOV Inc.","Symbol":"NOV","Current Price":"15.78","Latest MA":"16.29","Price Target":18.91667,"Difference from MA":"-3.13%","Difference from Open":"-4.31%","Change from Yesterday":"-3.96%","Change from Last Report":"-0.41","Latest Volume":"2,478,088","Market Cap":"6,139,745,280","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":10.047115,"PB Ratio":0.9498585,"Previous Close":16.43,"ROE":0.17694001,"DTE":36.848,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.674,"Trailing PEG":null,"Trailing PE":9.862499,"Trailing PS":0.68947166,"Quick Ratio":1.55,"Day High":16.53,"Day Low":15.575,"VS Average Volume":0.6114342534,"Company Summary":"NOV Inc. designs, constructs, manufactures, and sells systems, components, and products for oil and gas drilling and production, and industrial and renewable energy sectors in the United States and internationally. It operates through two segments, Energy Equipment, and Energy Products and Services. The company provides solids control and waste management equipment and services, managed pressure drilling, drilling fluids, premium drillpipe, wired pipe, drilling optimization services, tubular inspection and coating services, instrumentation, downhole tools, and drill bits. It also offers equipment and technologies for hydraulic fracture stimulation, including downhole multistage fracturing tools, pressure pumping trucks, blenders, sanders, hydration and injection units, flowline, and manifolds; coiled tubing units, and wireline units and tools; connections and liner hangers; onshore production consists of composite pipe, surface transfer and progressive cavity pumps, and artificial lift systems; and offshore production, such as floating production systems and subsea production technologies, as well as manufactures industrial pumps and mixers. In addition, the company provides substructures, derricks, and masts; cranes; jacking systems; pipe lifting, racking, rotating, and assembly systems; mud pumps; pressure control equipment; drives and generators; rig instrumentation and control systems; mooring, anchor, and deck handling machinery; equipment components for offshore wind construction vessels; and pipelay and construction systems. Further, the company offers spare parts, repair, and rentals as well as comprehensive remote equipment monitoring, technical support, field service, and customer training. The company was formerly known as National Oilwell Varco, Inc. and changed its name to NOV Inc. in January 2021. NOV Inc. was founded in 1862 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Alphabet Inc.","Symbol":"GOOGL","Current Price":"190.52","Latest MA":"174.87","Price Target":217.20404,"Difference from MA":"8.95%","Difference from Open":"0.70%","Change from Yesterday":"-0.42%","Change from Last Report":"-0.02","Latest Volume":"13,148,158","Market Cap":"2,333,222,109,184","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":18.51481,"PB Ratio":7.4384103,"Previous Close":191.33,"ROE":0.32101002,"DTE":9.324,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.034,"Trailing PEG":1.2503,"Trailing PE":23.696518,"Trailing PS":6.865265,"Quick Ratio":1.761,"Day High":191.42,"Day Low":188.72,"VS Average Volume":0.4605798416,"Company Summary":"Alphabet Inc. offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube. It is also involved in the sale of apps and in-app purchases and digital content in the Google Play and YouTube; and devices, as well as in the provision of YouTube consumer subscription services. The Google Cloud segment offers infrastructure, cybersecurity, databases, analytics, AI, and other services; Google Workspace that include cloud-based communication and collaboration tools for enterprises, such as Gmail, Docs, Drive, Calendar, and Meet; and other services for enterprise customers. The Other Bets segment sells healthcare-related and internet services. The company was incorporated in 1998 and is headquartered in Mountain View, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Enterprise Products Partners L.","Symbol":"EPD","Current Price":"32.99","Latest MA":"29.66","Price Target":36.38944,"Difference from MA":"11.25%","Difference from Open":"-0.32%","Change from Yesterday":"-0.14%","Change from Last Report":"-0.02","Latest Volume":"1,283,764","Market Cap":"71,514,529,792","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":11.041915,"PB Ratio":2.5227711,"Previous Close":33.04,"ROE":0.20665,"DTE":110.757,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":1.014,"Trailing PEG":3.2038,"Trailing PE":12.264982,"Trailing PS":1.2626153,"Quick Ratio":0.719,"Day High":33.25,"Day Low":32.96,"VS Average Volume":0.2877730031,"Company Summary":"Enterprise Products Partners L.P. provides midstream energy services to producers and consumers of natural gas, natural gas liquids (NGLs), crude oil, petrochemicals, and refined products. It operates in four segments: NGL Pipelines & Services, Crude Oil Pipelines & Services, Natural Gas Pipelines & Services, and Petrochemical & Refined Products Services. The NGL Pipelines & Services segment offers natural gas processing and related NGL marketing services. It operates natural gas processing facilities located in Colorado, Louisiana, Mississippi, New Mexico, Texas, and Wyoming; NGL pipelines; NGL fractionation facilities; NGL and related product storage facilities; and NGL marine terminals. The Crude Oil Pipelines & Services segment operates crude oil pipelines; and crude oil storage and marine terminals, which include a fleet of approximately 250 tractor-trailer tank trucks that are used to transport crude oil. It also engages in crude oil marketing activities. The Natural Gas Pipelines & Services segment operates natural gas pipeline systems to gather, treat, and transport natural gas. It leases underground salt dome natural gas storage facilities in Napoleonville, Louisiana; owns an underground salt dome storage cavern in Wharton County, Texas; and markets natural gas. The Petrochemical & Refined Products Services segment operates propylene fractionation facilities, including propylene fractionation units and propane dehydrogenation facilities, and related marketing activities; butane isomerization complex and related deisobutanizer operations; and octane enhancement, isobutane dehydrogenation, and high purity isobutylene production facilities. It also operates refined products pipelines and terminals; and ethylene export terminals; and provides refined products marketing and marine transportation services. Enterprise Products Partners L.P. was founded in 1968 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Lumen Technologies, Inc.","Symbol":"LUMN","Current Price":"5.04","Latest MA":"5.61","Price Target":5.34364,"Difference from MA":"-10.07%","Difference from Open":"1.51%","Change from Yesterday":"1.31%","Change from Last Report":"-0.20","Latest Volume":"5,264,566","Market Cap":"5,119,716,352","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":-8.7682705,"PB Ratio":14.970326,"Previous Close":4.97,"ROE":-1.6673199,"DTE":5502.924,"Industry":"Telecom Services","Sector":"Communication Services","Beta":1.201,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.38505688,"Quick Ratio":0.988,"Day High":5.16,"Day Low":4.85,"VS Average Volume":0.3874576144,"Company Summary":"Lumen Technologies, Inc., a facilities-based technology and communications company, provides various integrated products and services to business and residential customers in the United States and internationally. The company operates in two segments, Business and Mass Markets. It offers dark fiber, edge cloud services, internet protocol, managed security, software-defined wide area networks, secure access service edge, unified communications and collaboration, and optical wavelengths services; ethernet and VPN data networks services; and legacy services to manage cash flow, including time division multiplexing voice, private line, and other legacy services, as well as sells communication equipment, and IT solutions. The company also provides high speed and lower speed broadband service to residential and small business customers; local and long-distance voice services, professional services, and other ancillary services; and federal broadband and state support programs. It serves its products and services under the Lumen, Quantum Fiber, and CenturyLink brands. The company was formerly known as CenturyLink, Inc. and changed its name to Lumen Technologies, Inc. in September 2020. Lumen Technologies, Inc. was incorporated in 1968 and is headquartered in Monroe, Louisiana.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"FMC Corporation","Symbol":"FMC","Current Price":"35.89","Latest MA":"57.78","Price Target":58.22889,"Difference from MA":"-37.88%","Difference from Open":"-1.39%","Change from Yesterday":"-0.08%","Change from Last Report":"-0.25","Latest Volume":"4,006,066","Market Cap":"4,480,451,584","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.9891148,"PB Ratio":0.97235787,"Previous Close":35.92,"ROE":0.38454,"DTE":90.927,"Industry":"Agricultural Inputs","Sector":"Basic Materials","Beta":0.853,"Trailing PEG":null,"Trailing PE":11.180903,"Trailing PS":1.0749902,"Quick Ratio":0.922,"Day High":36.9696,"Day Low":35.89,"VS Average Volume":2.1269490518,"Company Summary":"FMC Corporation, an agricultural sciences company, provides crop protection, plant health, and professional pest and turf management products. It develops, markets, and sells crop protection chemicals that includes insecticides, herbicides, and fungicides; and biologicals, crop nutrition, and seed treatment products, which are used in agriculture to enhance crop yield and quality by controlling a range of insects, weeds, and diseases, as well as in non-agricultural markets for pest control. The company markets its products through its own sales organization and through alliance partners, independent distributors, and sales representatives. It operates in North America, Latin America, Europe, the Middle East, Africa, and Asia. The company was founded in 1883 and is headquartered in Philadelphia, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Pfizer, Inc.","Symbol":"PFE","Current Price":"25.98","Latest MA":"27.16","Price Target":31.03864,"Difference from MA":"-4.34%","Difference from Open":"-1.67%","Change from Yesterday":"-1.74%","Change from Last Report":"-0.06","Latest Volume":"13,258,224","Market Cap":"147,228,393,472","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":8.534262,"PB Ratio":1.5950392,"Previous Close":26.44,"ROE":0.04538,"DTE":73.408,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.615,"Trailing PEG":0.1981,"Trailing PE":18.425531,"Trailing PS":2.479636,"Quick Ratio":0.64,"Day High":26.41,"Day Low":25.97,"VS Average Volume":0.3035698969,"Company Summary":"Pfizer Inc. discovers, develops, manufactures, markets, distributes, and sells biopharmaceutical products in the United States, Europe, and internationally. The company offers medicines and vaccines in various therapeutic areas, including cardiovascular metabolic, migraine, and women's health under the Eliquis, Nurtec ODT\/Vydura, Zavzpret, and the Premarin family brands; infectious diseases with unmet medical needs under the Prevnar family, Abrysvo, Nimenrix, FSME\/IMMUN-TicoVac, and Trumenba brands; and COVID-19 prevention and treatment, and potential future mRNA and antiviral products under the Comirnaty and Paxlovid brands. It also provides medicines and vaccines in various therapeutic areas, such as biosimilars for chronic immune and inflammatory diseases under the Xeljanz, Enbrel, Inflectra, Litfulo, Velsipity, and Cibinqo brands; amyloidosis, hemophilia, endocrine diseases, and sickle cell disease under the Vyndaqel family, Oxbryta, BeneFIX, Somavert, Ngenla, and Genotropin brands; sterile injectable and anti-infective medicines under the Sulperazon, Medrol, Zavicefta, Zithromax, and Panzyga brands; and biologics, small molecules, immunotherapies, and biosimilars under the Ibrance, Xtandi, Inlyta, Bosulif, Mektovi, Padcev, Adcetris, Talzenna, Tukysa, Elrexfio, Tivdak, Lorbrena, and Braftovi brands. In addition, the company involved in the contract manufacturing business. It serves wholesalers, retailers, hospitals, clinics, government agencies, pharmacies, individual provider offices, retail pharmacies, and integrated delivery systems. The company has collaboration agreements with Bristol-Myers Squibb Company; Astellas Pharma US, Inc.; Merck KGaA; and BioNTech SE, as well as has strategic clinical collaboration with Acepodia Inc. for the development of antibody-cell conjugation-based cell therapies in autoimmune diseases. Pfizer Inc. was founded in 1849 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Apollo Global Management, Inc. ","Symbol":"APO","Current Price":"167.81","Latest MA":"141.52","Price Target":184.17647,"Difference from MA":"18.58%","Difference from Open":"-0.18%","Change from Yesterday":"1.24%","Change from Last Report":"0.01","Latest Volume":"478,135","Market Cap":"94,936,662,016","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":16.9684,"PB Ratio":5.7666664,"Previous Close":165.75,"ROE":0.33501,"DTE":92.115,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.589,"Trailing PEG":null,"Trailing PE":22.893587,"Trailing PS":2.9975898,"Quick Ratio":1.877,"Day High":168.2492,"Day Low":165.46,"VS Average Volume":0.0865978571,"Company Summary":"Apollo Global Management, Inc. is a private equity firm specializing in investments in credit, private equity, infrastructure, secondaries and real estate markets. The firm prefers to invest in private and public markets. The firm's private equity investments include traditional buyouts, recapitalization, distressed buyouts and debt investments in real estate, corporate partner buyouts, distressed asset, corporate carve-outs, middle market, growth, venture capital, turnaround, bridge, corporate restructuring, special situation, acquisition, and industry consolidation transactions. For credit strategies, the firm focuses to invest in multi-sector credit, semi-liquid credit, direct lending, first lien, unitranche, whole loans and private credit. The firm provides its services to endowment and sovereign wealth funds, as well as other institutional and individual investors. It manages client focused portfolios. The firm launches and manages hedge funds for its clients. It also manages real estate funds and private equity funds for its clients. The firm invests in the fixed income and alternative investment markets across the globe. Its fixed income investments include income-oriented senior loans, bonds, collateralized loan obligations, structured credit, opportunistic credit, non-performing loans, distressed debt, mezzanine debt, and value oriented fixed income securities. The firm seeks to invest in chemicals, commodities, consumer and retail, oil and gas, metals, mining, agriculture, commodities, distribution and transportation, financial and business services, manufacturing and industrial, media distribution, cable, entertainment and leisure, telecom, technology, natural resources, energy, packaging and materials, and satellite and wireless industries. It also focuses on clean energy, sustainable industry, climate solutions, energy transition, industrial decarbonization, sustainable mobility, sustainable resource use, and sustainable real estate. It seeks to invest in companies based in across Africa, Asia, North America with a focus on United States, Western Europe and Europe. It employs a combination of contrarian, value, and distressed strategies to make its investments. The firm seeks to make investments in the range of $75 million and $1500 million. The firm seeks to invest in companies with Enterprise value between $750 million to $2500 million. The firm conducts in-house research to create its investment portfolio. It seeks to acquire minority and majority positions in its portfolio companies. Apollo Global Management, Inc. was founded in 1990 and is headquartered in New York, New York with additional offices in North America, Asia, Africa and Europe.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"PayPal Holdings, Inc.","Symbol":"PYPL","Current Price":"78.46","Latest MA":"77.58","Price Target":95.01971,"Difference from MA":"1.13%","Difference from Open":"-1.47%","Change from Yesterday":"-0.93%","Change from Last Report":"0.18","Latest Volume":"6,986,971","Market Cap":"77,615,923,200","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":13.979136,"PB Ratio":3.9124362,"Previous Close":79.2,"ROE":0.22188,"DTE":65.718,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.436,"Trailing PEG":1.2132,"Trailing PE":19.66416,"Trailing PS":2.4673657,"Quick Ratio":0.261,"Day High":79.74,"Day Low":78.12,"VS Average Volume":0.7357346441,"Company Summary":"PayPal Holdings, Inc. operates a technology platform that enables digital payments on behalf of merchants and consumers worldwide. It operates a two-sided network at scale that connects merchants and consumers that enables its customers to connect, transact, and send and receive payments through online and in person, as well as transfer and withdraw funds using various funding sources, such as bank accounts, PayPal or Venmo account balance, PayPal and Venmo branded credit products comprising its installment products, credit and debit cards, and cryptocurrencies, as well as other stored value products, including gift cards and eligible rewards. The company provides payment solutions under the PayPal, PayPal Credit, Braintree, Venmo, Xoom, Zettle, Hyperwallet, Honey, and Paidy names. The company was founded in 1998 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Advanced Micro Devices, Inc.","Symbol":"AMD","Current Price":"109.75","Latest MA":"143.16","Price Target":150.59454,"Difference from MA":"-23.34%","Difference from Open":"-0.99%","Change from Yesterday":"-2.02%","Change from Last Report":"0.17","Latest Volume":"25,675,183","Market Cap":"178,095,292,416","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":17.273403,"PB Ratio":3.1256588,"Previous Close":112.01,"ROE":0.03262,"DTE":3.927,"Industry":"Semiconductors","Sector":"Technology","Beta":1.706,"Trailing PEG":0.3097,"Trailing PE":109.745,"Trailing PS":7.3305326,"Quick Ratio":1.575,"Day High":112.56,"Day Low":109.02,"VS Average Volume":0.6723085103,"Company Summary":"Advanced Micro Devices, Inc. operates as a semiconductor company worldwide. It operates through Data Center, Client, Gaming, and Embedded segments. The company offers x86 microprocessors and graphics processing units (GPUs) as an accelerated processing unit, chipsets, data center, and professional GPUs; and embedded processors, and semi-custom system-on-chip (SoC) products, microprocessor and SoC development services and technology, data processing unites, field programmable gate arrays (FPGA), and adaptive SoC products. It provides processors under the AMD Ryzen, AMD Ryzen PRO, Ryzen Threadripper, Ryzen Threadripper PRO, AMD Athlon, AMD Athlon PRO, and AMD PRO A-Series brand names; graphics under the AMD Radeon graphics and AMD Embedded Radeon graphics; and professional graphics under the AMD Radeon Pro graphics brand name. In addition, the company offers data center graphics under the Radeon Instinct and Radeon PRO V-series brands, as well as servers under the AMD Instinct accelerators brand; server microprocessors under the AMD EPYC brands; low power solutions under the AMD Athlon, AMD Geode, AMD Ryzen, AMD EPYC, AMD R-Series, and G-Series brands; FPGA products under the Virtex-6, Virtex-7, Virtex UltraScale+, Kintex-7, Kintex UltraScale, Kintex UltraScale+, Artix-7, Artix UltraScale+, Spartan-6, and Spartan-7 brands; adaptive SOCs under the Zynq-7000, Zynq UltraScale+ MPSoC, Zynq UltraScale+ RFSoCs, Versal HBM, Versal Premium, Versal Prime, Versal AI Core, Versal AI Edge, Vitis, and Vivado brands; and compute and network acceleration board products under the Alveo brand. It serves original equipment and design manufacturers, public cloud service providers, system integrators, independent distributors, and add-in-board manufacturers through its direct sales force, and sales representatives. Advanced Micro Devices, Inc. was incorporated in 1969 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Amcor plc","Symbol":"AMCR","Current Price":"10.03","Latest MA":"10.29","Price Target":11.34333,"Difference from MA":"-2.50%","Difference from Open":"-1.57%","Change from Yesterday":"-1.86%","Change from Last Report":"-0.10","Latest Volume":"6,915,691","Market Cap":"14,496,759,808","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":12.516535,"PB Ratio":3.7327874,"Previous Close":10.22,"ROE":0.1958,"DTE":196.619,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":0.863,"Trailing PEG":2.0218,"Trailing PE":18.236362,"Trailing PS":1.0698715,"Quick Ratio":0.591,"Day High":10.22,"Day Low":10.02,"VS Average Volume":0.3989687846,"Company Summary":"Amcor plc develops, produces, and sells packaging products in Europe, North America, Latin America, and the Asia Pacific. The company operates in two segments, Flexibles and Rigid Packaging. The Flexibles segment offers flexible and film packaging products in the food and beverage, medical and pharmaceutical, fresh produce, snack food, personal care, and other industries. The Rigid Packaging segment provides rigid containers for various beverage and food products, including carbonated soft drinks, water, juices, sports drinks, milk-based beverages, spirits and beer, sauces, dressings, spreads, and personal care items; and plastic caps for various applications. It sells its products through its direct sales force. The company was incorporated in 1926 and is headquartered in Zurich, Switzerland.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Omnicom Group Inc.","Symbol":"OMC","Current Price":"84.55","Latest MA":"95.00","Price Target":111.83727,"Difference from MA":"-11.00%","Difference from Open":"-1.11%","Change from Yesterday":"-0.45%","Change from Last Report":"-0.06","Latest Volume":"1,109,330","Market Cap":"16,613,315,584","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":9.140204,"PB Ratio":4.1746902,"Previous Close":84.93,"ROE":0.33923998,"DTE":155.236,"Industry":"Advertising Agencies","Sector":"Communication Services","Beta":0.968,"Trailing PEG":1.242,"Trailing PE":11.33378,"Trailing PS":1.0768428,"Quick Ratio":0.788,"Day High":85.96,"Day Low":84.53,"VS Average Volume":0.4652195611,"Company Summary":"Omnicom Group Inc., together with its subsidiaries, offers advertising, marketing, and corporate communications services. It provides a range of services in the areas of advertising and media, precision marketing, commerce and branding, experiential, execution and support, public relations, and healthcare. The company's services include advertising, branding, content marketing, corporate social responsibility consulting, crisis communications, custom publishing, data analytics, database management, digital\/direct marketing and post-production, digital transformation consulting, entertainment marketing, experiential marketing, field marketing, sales support, financial\/corporate business-to-business advertising, graphic arts\/digital imaging, healthcare marketing and communications, and instore design services. Its services also comprise interactive marketing, investor relations, marketing research, media planning and buying, retail media planning and buying, merchandising and point of sale, mobile marketing, multi-cultural marketing, non-profit marketing, organizational communications, package design, product placement, promotional marketing, public affairs, public relations, retail marketing, retail media and e-commerce, search engine marketing, shopper marketing, social media marketing, and sports and event marketing services. It operates in the North and Latin America, Europe, the Middle East and Africa (EMEA), and the Asia Pacific. The company was incorporated in 1944 and is based in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Pentair plc.","Symbol":"PNR","Current Price":"98.78","Latest MA":"95.13","Price Target":112.7285,"Difference from MA":"3.83%","Difference from Open":"-0.90%","Change from Yesterday":"0.08%","Change from Last Report":"0.16","Latest Volume":"218,312","Market Cap":"16,320,693,248","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":18.710611,"PB Ratio":4.664699,"Previous Close":98.7,"ROE":0.20408002,"DTE":49.774,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":1.189,"Trailing PEG":1.796,"Trailing PE":26.410429,"Trailing PS":3.9860039,"Quick Ratio":0.828,"Day High":99.67,"Day Low":98.5701,"VS Average Volume":0.1757730004,"Company Summary":"Pentair plc provides various water solutions in the United States, Western Europe, China, Eastern Europe, Latin America, the Middle East, Southeast Asia, Australia, Canada, and Japan. The company operates through three segments: Flow, Water Solutions, and Pool. The Flow segment designs, manufactures, and sells fluid treatment and pump products and systems, including pressure vessels, gas recovery solutions, membrane bioreactors, wastewater reuse systems and advanced membrane filtration, separation systems, water disposal pumps, water supply pumps, fluid transfer pumps, turbine pumps, solid handling pumps, and agricultural spray nozzles for fluid delivery, ion exchange, desalination, food and beverage, separation technologies in the oil and gas industry, residential and municipal wells, water treatment, wastewater solids handling, pressure boosting, circulation and transfer, fire suppression, flood control, agricultural irrigation, and crop spray in residential, commercial, and industrial markets. The Water Solutions segment provides commercial and residential water treatment products and systems, including pressure tanks, control valves, activated carbon products, commercial ice machines, conventional filtration products, and point-of-entry and point-of-use water treatment systems, as well as installation and preventative services for use in residential whole home water filtration, drinking water filtration, and water softening solutions, as well as commercial total water management and filtration in foodservice operations. The Pool segment provides residential and commercial pool equipment and accessories comprising pumps, filters, heaters, lights, automatic controls, automatic cleaners, maintenance equipment, and pool accessories for applications in residential and commercial pool maintenance, pool repair, renovation, service, and construction and aquaculture solutions. Pentair plc was founded in 1966 and is headquartered in London, the United Kingdom.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Snap Inc.","Symbol":"SNAP","Current Price":"10.67","Latest MA":"11.28","Price Target":13.07057,"Difference from MA":"-5.43%","Difference from Open":"1.72%","Change from Yesterday":"0.42%","Change from Last Report":"0.14","Latest Volume":"15,315,434","Market Cap":"18,100,160,512","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":20.2844,"PB Ratio":8.071104,"Previous Close":10.63,"ROE":-0.4062,"DTE":191.874,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":0.995,"Trailing PEG":496.0591,"Trailing PE":"N\/A","Trailing PS":3.5041146,"Quick Ratio":3.861,"Day High":10.7899,"Day Low":10.35,"VS Average Volume":0.5079265302,"Company Summary":"Snap Inc. operates as a technology company in North America, Europe, and internationally. The company offers Snapchat, a visual messaging application with various tabs, such as camera, visual messaging, snap map, stories, and spotlight that enable people to communicate visually through short videos and images. It also provides Spectacles, an eyewear product that connects with Snapchat and captures photos and video from a human perspective; and advertising products, including AR ads and Snap ads comprises a single image or video ads, collection ads, dynamic ads, story ads, and commercials. The company was formerly known as Snapchat, Inc. and changed its name to Snap Inc. in September 2016. Snap Inc. was founded in 2010 and is headquartered in Santa Monica, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Amgen Inc.","Symbol":"AMGN","Current Price":"301.23","Latest MA":"304.02","Price Target":315.96768,"Difference from MA":"-0.92%","Difference from Open":"-2.52%","Change from Yesterday":"-2.14%","Change from Last Report":"0.14","Latest Volume":"1,820,898","Market Cap":"161,918,386,176","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":13.941846,"PB Ratio":21.509926,"Previous Close":307.81,"ROE":0.5572,"DTE":802.418,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.599,"Trailing PEG":2.1903,"Trailing PE":39.791943,"Trailing PS":4.9768977,"Quick Ratio":0.804,"Day High":309.18,"Day Low":298.35,"VS Average Volume":0.4698866067,"Company Summary":"Amgen Inc. discovers, develops, manufactures, and delivers human therapeutics worldwide. The company's principal products include Enbrel to treat plaque psoriasis, rheumatoid arthritis, and psoriatic arthritis; Otezla for the treatment of adult patients with plaque psoriasis, psoriatic arthritis, and oral ulcers associated with Behçet's disease; Prolia to treat postmenopausal women with osteoporosis; XGEVA for skeletal-related events prevention; Repatha, which reduces the risks of myocardial infarction, stroke, and coronary revascularization; Nplate for the treatment of patients with immune thrombocytopenia; KYPROLIS to treat patients with relapsed or refractory multiple myeloma; Aranesp to treat a lower-than-normal number of red blood cells and anemia; EVENITY for the treatment of osteoporosis in postmenopausal for men and women; Vectibix to treat patients with wild-type RAS metastatic colorectal cancer; BLINCYTO for the treatment of patients with acute lymphoblastic leukemia; TEPEZZA to treat thyroid eye disease; and KRYSTEXXA for the treatment of chronic refractory gout. It also markets other products, including Neulasta, MVASI, AMJEVITA\/AMGEVITA, TEZSPIRE, Parsabiv, Aimovig, LUMAKRAS\/LUMYKRAS, EPOGEN, KANJINTI, TAVNEOS, RAVICTI, UPLIZNA and PROCYSBI. The company serves healthcare providers, including physicians or their clinics, dialysis centers, hospitals, and pharmacies. It distributes its products through pharmaceutical wholesale distributors, as well as direct-to-consumer channels. The company has collaboration agreements with AstraZeneca plc for the development and commercialization of TEZSPIRE; Novartis Pharma AG to develop and commercialize Aimovig; UCB for the development and commercialization of EVENITY; Kyowa Kirin Co., Ltd. for rocatinlimab development and commercialization; and BeiGene, Ltd. for oncology products expansion and development. Amgen Inc. was incorporated in 1980 and is headquartered in Thousand Oaks, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Chipotle Mexican Grill, Inc.","Symbol":"CMG","Current Price":"56.59","Latest MA":"57.75","Price Target":64.70419,"Difference from MA":"-2.01%","Difference from Open":"-2.35%","Change from Yesterday":"-1.60%","Change from Last Report":"-0.04","Latest Volume":"3,446,443","Market Cap":"76,891,660,288","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":36.947086,"PB Ratio":21.354715,"Previous Close":57.51,"ROE":0.45673,"DTE":124.061,"Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":1.266,"Trailing PEG":1.9993,"Trailing PE":50.981983,"Trailing PS":6.9997835,"Quick Ratio":1.486,"Day High":58.28,"Day Low":56.55,"VS Average Volume":0.3767147417,"Company Summary":"Chipotle Mexican Grill, Inc., together with its subsidiaries, owns and operates Chipotle Mexican Grill restaurants. It sells food and beverages through offering burritos, burrito bowls, quesadillas, tacos, and salads. The company also provides delivery and related services its app and website. It has operations in the United States, Canada, France, Germany, Dubai, and the United Kingdom. Chipotle Mexican Grill, Inc. was founded in 1993 and is headquartered in Newport Beach, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Prudential Financial, Inc.","Symbol":"PRU","Current Price":"114.06","Latest MA":"119.41","Price Target":126.14286,"Difference from MA":"-4.48%","Difference from Open":"-1.08%","Change from Yesterday":"0.00%","Change from Last Report":"-0.03","Latest Volume":"533,458","Market Cap":"40,447,451,136","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.4567056,"PB Ratio":1.3347961,"Previous Close":114.06,"ROE":0.13773,"DTE":141.51,"Industry":"Insurance - Life","Sector":"Financial Services","Beta":1.282,"Trailing PEG":0.4874,"Trailing PE":15.188416,"Trailing PS":0.55433285,"Quick Ratio":0.685,"Day High":115.31,"Day Low":113.44,"VS Average Volume":0.3388562463,"Company Summary":"Prudential Financial, Inc., together with its subsidiaries, provides insurance, investment management, and other financial products and services in the United States and internationally. It operates through PGIM, Retirement Strategies, Group Insurance, Individual Life, and International Businesses segments. The PGIM segment offers investment management services and solutions related to public fixed income, public equity, real estate debt and equity, private credit and other alternatives, and multi-asset class strategies to institutional and retail clients, as well as its general account. The Retirement Strategies segment provides a range of retirement investment, and income products and services to retirement plan sponsors in the public, private, and not-for-profit sectors; develops and distributes individual variable and fixed annuity products. The Group Insurance segment offers various group life, and long-term and short-term group disability, as well as group corporate-, bank-, and trust-owned life insurance in the United States primarily for institutional clients for use in connection with employee and membership benefits plans; sells accidental death and dismemberment, and other supplemental health solutions; and plan administration services in connection with its insurance coverages. The Individual Life segment develops and distributes variable life, universal life, and term life insurance products. The International Businesses segment develops and distributes life insurance, retirement products, investment products, and certain accident and health products; and advisory services. The company provides its products and services to individual and institutional customers through its proprietary and third-party distribution networks. Prudential Financial, Inc. was founded in 1875 and is headquartered in Newark, New Jersey.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Mondelez International, Inc.","Symbol":"MDLZ","Current Price":"57.67","Latest MA":"65.92","Price Target":65.9644,"Difference from MA":"-12.50%","Difference from Open":"-0.73%","Change from Yesterday":"0.43%","Change from Last Report":"-0.18","Latest Volume":"4,763,967","Market Cap":"77,122,437,120","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":17.672472,"PB Ratio":2.768843,"Previous Close":57.43,"ROE":0.13552,"DTE":73.232,"Industry":"Confectioners","Sector":"Consumer Defensive","Beta":0.561,"Trailing PEG":4.8129,"Trailing PE":16.864035,"Trailing PS":2.1333418,"Quick Ratio":0.295,"Day High":58.6,"Day Low":57.585,"VS Average Volume":0.4897861807,"Company Summary":"Mondelez International, Inc., through its subsidiaries, manufactures, markets, and sells snack food and beverage products in the Latin America, North America, Asia, the Middle East, Africa, and Europe. It provides biscuits and baked snacks, including cookies, crackers, salted snacks, snack bars, and cakes and pastries; chocolates; and gums and candies, as well as various cheese and grocery, and powdered beverage products. The company's brand portfolio includes Oreo, Ritz, LU, CLIF Bar, and Tate's Bake Shop biscuits and baked snacks, as well as Cadbury Dairy Milk, Milka, and Toblerone chocolate. It serves supermarket chains, wholesalers, supercenters, club stores, mass merchandisers, distributors, convenience stores, gasoline stations, drug stores, value stores, and other retail food outlets through direct store delivery, company-owned and satellite warehouses, distribution centers, third party distributors, and other facilities, as well as through independent sales offices and agents. The company also sells products directly to businesses and consumers through e-retail platforms, retailer digital platforms, as well as through its direct-to-consumer websites and social media platforms. Mondelez International, Inc. was formerly known as Kraft Foods Inc. and changed its name to Mondelez International, Inc. in October 2012. The company was incorporated in 2000 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Fox Corporation","Symbol":"FOXA","Current Price":"53.78","Latest MA":"43.23","Price Target":53.74526,"Difference from MA":"24.41%","Difference from Open":"-1.61%","Change from Yesterday":"-1.37%","Change from Last Report":"-0.02","Latest Volume":"841,132","Market Cap":"23,630,116,864","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":13.498015,"PB Ratio":2.3158233,"Previous Close":54.53,"ROE":0.17711,"DTE":70.271,"Industry":"Entertainment","Sector":"Communication Services","Beta":0.77,"Trailing PEG":9.8858,"Trailing PE":11.541846,"Trailing PS":1.6481911,"Quick Ratio":2.243,"Day High":54.75,"Day Low":53.57,"VS Average Volume":0.2224901443,"Company Summary":"Fox Corporation operates as a news, sports, and entertainment company in the United States (U.S.). The company operates through four segments: Cable Network Programming, Television, Credible, and The FOX Studio Lot. The Cable Network Programming segment produces and licenses news and sports content for distribution through traditional cable television systems, direct broadcast satellite operators and telecommunication companies, virtual multi-channel video programming distributors, and other digital platforms primarily in the U.S. Television segment produces, acquires, markets, and distributes programming through the FOX broadcast network, advertising supported video-on-demand service Tubi, and operates power broadcast television stations including duopolies and other digital platform; and produces content for third parties. The Credible segment engages in the consumer finance marketplace. The FOX Studio Lot segment provides television and film production services along with office space, studio operation services and includes all operations of the facility. The company was incorporated in 2018 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Merck & Company, Inc.","Symbol":"MRK","Current Price":"88.47","Latest MA":"107.64","Price Target":118.79875,"Difference from MA":"-17.80%","Difference from Open":"-1.05%","Change from Yesterday":"-1.33%","Change from Last Report":"0.07","Latest Volume":"6,204,843","Market Cap":"223,809,896,448","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":8.8831215,"PB Ratio":5.033853,"Previous Close":89.67,"ROE":0.28332,"DTE":85.572,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.411,"Trailing PEG":0.0667,"Trailing PE":13.126855,"Trailing PS":3.5427532,"Quick Ratio":0.917,"Day High":89.5713,"Day Low":88.325,"VS Average Volume":0.4929606536,"Company Summary":"Merck & Co., Inc. operates as a healthcare company worldwide. It operates through two segments, Pharmaceutical and Animal Health. The Pharmaceutical segment offers human health pharmaceutical products in the areas of oncology, hospital acute care, immunology, neuroscience, virology, cardiovascular, and diabetes under the Keytruda, Bridion, Adempas, Lagevrio, Belsomra, Simponi, and Januvia brands, as well as vaccine products consisting of preventive pediatric, adolescent, and adult vaccines under the Gardasil\/Gardasil 9, ProQuad, M-M-R II, Varivax, RotaTeq, Live Oral, Vaxneuvance, Pneumovax 23, and Vaqta names. The Animal Health segment discovers, develops, manufactures, and markets veterinary pharmaceuticals, vaccines, and health management solutions and services, as well as digitally connected identification, traceability, and monitoring products. vIt has development and commercialization agreement for three of Daiichi Sankyo's deruxtecan ADC candidates, which include patritumab deruxtecan, ifinatamab deruxtecan, and raludotatug deruxtecan for the treatment of multiple solid tumors both as monotherapy and\/or in combination with other treatments; and AstraZeneca PLC to co-development and co-commercialize AstraZeneca's Lynparza products for multiple cancer types, and Koselugo for multiple indications. It also has licensed to develop, manufacture and  commercialize LM-299, a novel investigational PD-1\/VEGF bispecific antibody from LaNova. The company also has a collaboration agreement with Eisai Co., Ltd., Bayer AG, and Ridgeback Biotherapeutics LP, as well Moderna, Inc. Merck & Co., Inc. was founded in 1891 and is headquartered in Rahway, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Estee Lauder Companies, Inc. (T","Symbol":"EL","Current Price":"65.51","Latest MA":"84.54","Price Target":80.32857,"Difference from MA":"-22.51%","Difference from Open":"-1.16%","Change from Yesterday":"-0.65%","Change from Last Report":"-0.05","Latest Volume":"3,233,803","Market Cap":"23,564,931,072","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":26.698782,"PB Ratio":4.42187,"Previous Close":65.94,"ROE":0.03857,"DTE":196.892,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":1.044,"Trailing PEG":1.089,"Trailing PE":"N\/A","Trailing PS":1.5251396,"Quick Ratio":0.789,"Day High":66.99,"Day Low":64.92,"VS Average Volume":0.7347727031,"Company Summary":"The Estée Lauder Companies Inc. manufactures, markets, and sells skin care, makeup, fragrance, and hair care products worldwide. It offers skin care products, including moisturizers, serums, cleansers, toners, body care, exfoliators, acne care and oil correctors, facial masks, and sun care products; and makeup products, such as lipsticks, lip glosses, mascaras, foundations, eyeshadows, and powders, as well as compacts, brushes, and other makeup tools. The company also provides fragrance products in various forms comprising eau de parfum sprays and colognes, as well as lotions, powders, creams, candles, and soaps; and hair care products, including shampoos, conditioners, styling products, treatment, finishing sprays, and hair color products, as well as sells ancillary products and services. It offers its products under the Estée Lauder, Clinique, Origins, M·A·C, Bobbi Brown Cosmetics, La Mer, Aveda, Jo Malone London, TOM FORD, Too Faced, Dr.Jart+, and The Ordinary brands. The company sells its products through department stores, specialty-multi retailers, upscale perfumeries and pharmacies, and salons and spas; freestanding stores; its own and authorized retailer websites; third-party online malls; stores in airports; and duty-free locations. The Estée Lauder Companies Inc. was founded in 1946 and is headquartered in New York, New York.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"CNH Industrial N.V.","Symbol":"CNH","Current Price":"12.36","Latest MA":"11.03","Price Target":14.66842,"Difference from MA":"12.05%","Difference from Open":"-2.18%","Change from Yesterday":"-1.71%","Change from Last Report":"0.08","Latest Volume":"7,510,822","Market Cap":"15,431,146,496","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":12.567132,"PB Ratio":2.0191207,"Previous Close":12.57,"ROE":0.22186,"DTE":356.262,"Industry":"Farm & Heavy Construction Machinery","Sector":"Industrials","Beta":1.597,"Trailing PEG":null,"Trailing PE":12.479797,"Trailing PS":0.70941275,"Quick Ratio":3.87,"Day High":12.75,"Day Low":12.31,"VS Average Volume":0.5974208878,"Company Summary":"CNH Industrial N.V., an equipment and services company, engages in the design, production, marketing, sale, and financing of agricultural and construction equipment in North America, Europe, the Middle East, Africa, South America, and the Asia Pacific. The company operates through three segments: Agriculture, Construction, and Financial Services. The Agriculture segment designs, manufactures, and distributes farm machinery and implements, including two-wheel and four-wheel drive tractors, crawler tractors, combines, grape and sugar cane harvesters, hay and forage equipment, planting and seeding equipment, soil preparation and cultivation implements, material handling equipment, and precision agriculture technology. This segment sells its agricultural equipment under the New Holland Agriculture and Case IH brands. The Construction segment designs, manufactures, and distributes construction equipment comprising excavators, crawler dozers, graders, wheel loaders, backhoe loaders, skid steer loaders, and compact track loaders under the CASE Construction Equipment, New Holland Construction, and Eurocomach brands. The Financial Services segment offers financing to end-use customers for the purchase of new and used agricultural and construction equipment and components, as well as revolving charge account financing and other financial services. It also provides wholesale financing to CNH Industrial brand dealers and distributors; trade receivables factoring services to CNH companies; and financial services to Iveco Group companies in the North America, South America, and Asia Pacific regions. The company was founded in 1842 and is headquartered in Basildon, the United Kingdom.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Aramark","Symbol":"ARMK","Current Price":"38.01","Latest MA":"37.23","Price Target":44.29533,"Difference from MA":"2.08%","Difference from Open":"0.04%","Change from Yesterday":"0.36%","Change from Last Report":"-0.04","Latest Volume":"489,525","Market Cap":"10,075,315,200","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":16.86383,"PB Ratio":3.3001912,"Previous Close":37.87,"ROE":0.0774,"DTE":182.724,"Industry":"Specialty Business Services","Sector":"Industrials","Beta":1.681,"Trailing PEG":null,"Trailing PE":29.925198,"Trailing PS":0.57901776,"Quick Ratio":0.667,"Day High":38.36,"Day Low":37.725,"VS Average Volume":0.238017327,"Company Summary":"Aramark provides food and facilities services to education, healthcare, business and industry, sports, leisure, and corrections clients in the United States and internationally. It operates in two segments, Food and Support Services United States, and Food and Support Services International. The company offers food-related managed services, including dining, catering, food service management, and convenience-oriented retail services; non-clinical food and food-related support services, such as patient food and nutrition, retail food, environmental services, and procurement services; and plant operations and maintenance, custodial\/housekeeping, energy management, grounds keeping, and capital project management services. It also provides on-site restaurants, catering, convenience stores, and executive dining services; beverage and vending services; and facility management services comprising landscaping, transportation, capital program management, payment services, and other facility consulting services relating to building operations. In addition, the company offers concessions, banquet, and catering services; retail services and merchandise sale, recreational, and lodging services; and facility management services at sports, entertainment, and recreational facilities. Further, it offers correctional food; and operates commissaries, laundry facilities, and property rooms. The company was formerly known as ARAMARK Holdings Corporation. Aramark was founded in 1959 and is based in Philadelphia, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Mattel, Inc.","Symbol":"MAT","Current Price":"21.42","Latest MA":"18.67","Price Target":25.47077,"Difference from MA":"14.73%","Difference from Open":"2.37%","Change from Yesterday":"2.78%","Change from Last Report":"-0.05","Latest Volume":"3,206,514","Market Cap":"7,215,519,744","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":11.925972,"PB Ratio":3.120175,"Previous Close":20.84,"ROE":0.25217,"DTE":114.026,"Industry":"Leisure","Sector":"Consumer Cyclical","Beta":0.785,"Trailing PEG":1.4087,"Trailing PE":13.556962,"Trailing PS":1.3477308,"Quick Ratio":1.695,"Day High":21.88,"Day Low":20.84,"VS Average Volume":0.9408349026,"Company Summary":"Mattel, Inc., a toy and family entertainment company, designs, manufactures, and markets toys and consumer products in North America, Latin America, Europe, the Middle East, Africa, and the Asia Pacific. The company operates through North America, International, and American Girl segments. It offers dolls and accessories, as well as books, content, gaming, and lifestyle products for children under the Barbie, American Girl, Disney Princess and Disney Frozen, Monster High, and Polly Pocket brands; die-cast vehicles, tracks, playsets, and accessories for kids, adults, and collectors under the Hot Wheels, Hot Wheels Monster Trucks, Hot Wheels Mario Kart, Matchbox, and Cars brand names; and infant, toddler, and preschool products comprising content, toys, live events, and other consumer products under the Fisher-Price, Little People and Imaginext, and Thomas & Friends, and Power wheels brands. The company also provides action figures, building sets, games, and other products under the Masters of the Universe, MEGA, UNO, Jurassic World, Minecraft, WWE, Lightyear, and Star Wars; and licensor partner brands, including Disney Pixar, Microsoft, NBCUniversal, and WWE. It sells its products directly to consumers through its catalog, website, and proprietary retail stores; retailers, including omnichannel retailers, discount and free-standing toy stores, chain stores, department stores, and other retail outlets; and wholesalers, as well as through agents and distributors. Mattel, Inc. was founded in 1945 and is headquartered in El Segundo, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Equity Residential","Symbol":"EQR","Current Price":"71.99","Latest MA":"71.55","Price Target":77.625,"Difference from MA":"0.61%","Difference from Open":"-0.30%","Change from Yesterday":"0.08%","Change from Last Report":"0.06","Latest Volume":"760,662","Market Cap":"28,158,095,360","Earning Date":"2025-02-03","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":40.91945,"PB Ratio":2.5201287,"Previous Close":71.93,"ROE":0.08361,"DTE":76.033,"Industry":"REIT - Residential","Sector":"Real Estate","Beta":0.913,"Trailing PEG":7.5557,"Trailing PE":26.466911,"Trailing PS":9.574883,"Quick Ratio":0.027,"Day High":72.44,"Day Low":71.71,"VS Average Volume":0.4874691672,"Company Summary":"Equity Residential is committed to creating communities where people thrive. The Company, a member of the S&P 500, is focused on the acquisition, development and management of residential properties located in and around dynamic cities that attract affluent long-term renters. Equity Residential owns or has investments in 312 properties consisting of 84,018 apartment units, with an established presence in Boston, New York, Washington, D.C., Seattle, San Francisco and Southern California, and an expanding presence in Denver, Atlanta, Dallas\/Ft. Worth and Austin.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Kyndryl Holdings, Inc.","Symbol":"KD","Current Price":"42.85","Latest MA":"28.63","Price Target":44.6,"Difference from MA":"49.67%","Difference from Open":"-1.72%","Change from Yesterday":"-1.38%","Change from Last Report":"0.03","Latest Volume":"1,134,215","Market Cap":"9,952,534,528","Earning Date":"2025-02-03","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":20.490936,"PB Ratio":9.727309,"Previous Close":43.45,"ROE":-0.0779,"DTE":349.744,"Industry":"Information Technology Services","Sector":"Technology","Beta":1.719,"Trailing PEG":null,"Trailing PE":73.87724,"Trailing PS":0.650535,"Quick Ratio":0.663,"Day High":43.56,"Day Low":42.17,"VS Average Volume":0.4580118301,"Company Summary":"Kyndryl Holdings, Inc. operates as a technology services company and IT infrastructure services provider worldwide. The company offers cloud services; core enterprise and zCloud services; application, data, and artificial intelligence services; digital workplace services; security and resiliency services; and network services and edge services. It serves financial, technology, media and telecom, retail and travel, and automotive industries. The company was incorporated in 2020 and is headquartered in New York, New York.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"Healthpeak Properties, Inc.","Symbol":"DOC","Current Price":"20.19","Latest MA":"21.23","Price Target":25.29412,"Difference from MA":"-4.91%","Difference from Open":"0.40%","Change from Yesterday":"0.75%","Change from Last Report":"-0.07","Latest Volume":"1,518,722","Market Cap":"14,124,237,824","Earning Date":"2025-02-03","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":76.67185,"PB Ratio":1.6491057,"Previous Close":20.04,"ROE":0.04085,"DTE":96.594,"Industry":"REIT - Healthcare Facilities","Sector":"Real Estate","Beta":1.117,"Trailing PEG":4.0809,"Trailing PE":56.083332,"Trailing PS":5.5256705,"Quick Ratio":1.429,"Day High":20.3899,"Day Low":20.13,"VS Average Volume":0.3231488416,"Company Summary":"Healthpeak Properties, Inc. is a fully integrated real estate investment trust (REIT) and S&P 500 company. Healthpeak owns, operates and develops high-quality real estate focused on healthcare discovery and delivery.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-02-2025 19:05:49"},{"Company Name":"NXP Semiconductors N.V.","Symbol":"NXPI","Current Price":"215.70","Latest MA":"233.92","Price Target":251.12968,"Difference from MA":"-7.79%","Difference from Open":"-0.37%","Change from Yesterday":"1.15%","Change from Last Report":"0.02","Latest Volume":"1,097,706","Market Cap":"54,821,220,352","Earning Date":"2025-02-03","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":14.875092,"PB Ratio":5.8248253,"Previous Close":213.24,"ROE":0.29555,"DTE":104.495,"Industry":"Semiconductors","Sector":"Technology","Beta":1.494,"Trailing PEG":1.0327,"Trailing PE":22.191265,"Trailing PS":4.241487,"Quick Ratio":1.41,"Day High":220.62,"Day Low":215.2289,"VS Average Volume":0.4444666692,"Company Summary":"NXP Semiconductors N.V. offers various semiconductor products. The company's product portfolio includes microcontrollers; application processors, including i.MX application processors, and i.MX 8 and 9 family of applications processors; communication processors; wireless connectivity solutions, such as near field communications, ultra-wideband, Bluetooth low-energy, Zigbee, and Wi-Fi and Wi-Fi\/Bluetooth integrated SoCs; analog and interface devices; radio frequency power amplifiers; and security controllers, as well as semiconductor-based environmental and inertial sensors, including pressure, inertial, magnetic, and gyroscopic sensors. Its products are used in various applications, including automotive, industrial and Internet of Things, mobile, and communication infrastructure. The company markets its products to various original equipment manufacturers, contract manufacturers, and distributors. It operates in China, the Netherlands, the United States, Singapore, Germany, Japan, South Korea, Taiwan, and internationally. N.V. was incorporated in 2006 and is headquartered in Eindhoven, the Netherlands.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-02-2025 19:05:49"}]