[{"Company Name":"CSX Corporation","Symbol":"CSX","Current Price":"32.70","Latest MA":"33.79","Price Target":37.01231,"Difference from MA":"-3.23%","Difference from Open":"0.85%","Change from Yesterday":"-0.54%","Change from Last Report":"0.26","Latest Volume":"5,987,735","Market Cap":"63,059,333,120","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":15.4585085,"PB Ratio":4.876958,"Previous Close":32.87,"ROE":0.29458,"DTE":147.913,"Industry":"Railroads","Sector":"Industrials","Beta":1.191,"Trailing PEG":2.1871,"Trailing PE":18.268158,"Trailing PS":4.2953024,"Quick Ratio":1.195,"Day High":32.945,"Day Low":32.045,"VS Average Volume":0.4623572926,"Company Summary":"CSX Corporation, together with its subsidiaries, provides rail-based freight transportation services. The company offers rail services; and transportation of intermodal containers and trailers, as well as other transportation services, such as rail-to-truck transfers and bulk commodity operations. It also transports chemicals, agricultural and food products, minerals, automotive, forest products, fertilizers, and metals and equipment; and coal, coke, and iron ore to electricity-generating power plants, steel manufacturers, and industrial plants, as well as exports coal to deep-water port facilities. In addition, the company provides intermodal services through a network of approximately 30 terminals transporting manufactured consumer goods in containers; and drayage services, including the pickup and delivery of intermodal shipments. It serves the automotive industry with distribution centers and storage locations, as well as connects non-rail served customers through transferring products, such as plastics and ethanol from rail to trucks. The company operates approximately 20,000 route mile rail network, which serves various population centers in 26 states east of the Mississippi River, the District of Columbia, and the Canadian provinces of Ontario and Quebec, as well as owns and leases approximately 3,500 locomotives. It serves production and distribution facilities through track connections. CSX Corporation was incorporated in 1978 and is headquartered in Jacksonville, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"Valley National Bancorp","Symbol":"VLY","Current Price":"10.11","Latest MA":"8.88","Price Target":11.5,"Difference from MA":"13.82%","Difference from Open":"1.30%","Change from Yesterday":"-1.70%","Change from Last Report":"0.10","Latest Volume":"5,828,962","Market Cap":"5,646,532,096","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":8.737872,"PB Ratio":0.7775469,"Previous Close":10.28,"ROE":0.049429998,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.086,"Trailing PEG":null,"Trailing PE":14.644927,"Trailing PS":3.5804734,"Quick Ratio":"N\/A","Day High":10.155,"Day Low":9.835,"VS Average Volume":0.704401517,"Company Summary":"Valley National Bancorp operates as the holding company for Valley National Bank that provides various commercial, private banking, retail, insurance, and wealth management financial services products. It operates through Consumer Banking, Commercial Banking, and Treasury and Corporate other segments. The company offers non-interest bearing, savings, NOW, money market, and time deposit accounts; commercial and industrial, commercial real estate, residential mortgage, and automobile loans; loans secured by the cash surrender value of life insurance; home equity loans and lines of credit; automobile financing; and secured and unsecured other consumer loans. It also invests in various securities and interest-bearing deposits with other banks; and provides international banking services, such as standby and documentary letters of credit, and related products, as well as foreign exchange transactions, documentary collections, and foreign wire transfers services. In addition, the company offers investment services for individuals and small to medium sized businesses; and trusts investment strategies designed for various investment profiles and objectives. Further, it provides trust services, such as living and testamentary trusts, investment management, custodial and escrow services, and estate administration to individuals; tax credit advisory services; brokerage services; property and casualty, life, health, and title insurance agency services; and health care equipment lending and other commercial equipment leasing services, as well as owns real estate related investments. Additionally, the company offers online, mobile, and telephone banking services; receivable, payment, and security solution, merchant, payroll processing, and liquidity services; credit cards; and drive-in and night deposit, automated teller machine, remote deposit capture, and safe deposit facility services. Valley National Bancorp was founded in 1927 and is headquartered in Morristown, New Jersey.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"Freeport-McMoRan, Inc.","Symbol":"FCX","Current Price":"35.91","Latest MA":"43.76","Price Target":47.70762,"Difference from MA":"-17.96%","Difference from Open":"1.53%","Change from Yesterday":"0.42%","Change from Last Report":"-0.01","Latest Volume":"9,231,780","Market Cap":"51,592,970,240","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.273409,"PB Ratio":2.9401407,"Previous Close":35.85,"ROE":0.16870001,"DTE":33.531,"Industry":"Copper","Sector":"Basic Materials","Beta":1.91,"Trailing PEG":5.0477,"Trailing PE":27.61923,"Trailing PS":2.0122063,"Quick Ratio":1.048,"Day High":36.13,"Day Low":34.8901,"VS Average Volume":0.7409089818,"Company Summary":"Freeport-McMoRan Inc. engages in the mining of mineral properties in North America, South America, and Indonesia. It primarily explores for copper, gold, molybdenum, silver, and other metals. The company's assets include the Grasberg minerals district in Indonesia; Morenci, Bagdad, Safford, Sierrita, and Miami in Arizona; Chino and Tyrone in New Mexico; and Henderson and Climax in Colorado, North America, as well as Cerro Verde in Peru and El Abra in Chile. The company was formerly known as Freeport-McMoRan Copper & Gold Inc. and changed its name to Freeport-McMoRan Inc. in July 2014. Freeport-McMoRan Inc. was incorporated in 1987 and is headquartered in Phoenix, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"Procter & Gamble Company (The)","Symbol":"PG","Current Price":"168.32","Latest MA":"167.51","Price Target":178.47,"Difference from MA":"0.48%","Difference from Open":"1.72%","Change from Yesterday":"1.41%","Change from Last Report":"-0.01","Latest Volume":"4,565,542","Market Cap":"394,685,153,280","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":22.86056,"PB Ratio":8.016766,"Previous Close":165.99,"ROE":0.28766,"DTE":69.338,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":0.414,"Trailing PEG":3.5199,"Trailing PE":26.845297,"Trailing PS":4.7039523,"Quick Ratio":0.507,"Day High":169.38,"Day Low":165.23,"VS Average Volume":0.6430540101,"Company Summary":"The Procter & Gamble Company engages in the provision of branded consumer packaged goods worldwide. The company operates through five segments: Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care. The Beauty segment offers conditioners, shampoos, styling aids, and treatments under the Head & Shoulders, Herbal Essences, Pantene, and Rejoice brands; and antiperspirants and deodorants, personal cleansing, and skin care products under the Olay, Old Spice, Safeguard, Secret, SK-II, and Native brands. The Grooming segment provides blades and razors, shave products, appliances, and other grooming products under the Braun, Gillette, and Venus brand names. The Health Care segment offers toothbrushes, toothpastes, and other oral care products under the Crest and Oral-B brand names; and gastrointestinal, pain relief, rapid diagnostics, respiratory, vitamins\/minerals\/supplements, and other personal health care products under Metamucil, Neurobion, Pepto-Bismol, and Vicks brands. The Fabric & Home Care segment provides fabric enhancers, laundry additives, and laundry detergents under the Ariel, Downy, Gain, and Tide brands; and air care, dish care, P&G professional, and surface care products under the Cascade, Dawn, Fairy, Febreze, Mr. Clean, and Swiffer brands. The Baby, Feminine & Family Care segment offers baby wipes, and taped diapers and pants under the Luvs and Pampers brands; adult incontinence and feminine care products under the Always, Always Discreet, and Tampax brands; and paper towels, tissues, and toilet papers under the Bounty, Charmin, and Puffs brands. It sells its products primarily through mass merchandisers, e-commerce, grocery stores, membership club stores, drug stores, department stores, distributors, wholesalers, specialty beauty stores, high-frequency stores, pharmacies, electronics stores, and professional channels, as well as directly to consumers. The company was founded in 1837 and is headquartered in Cincinnati, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"Abbott Laboratories","Symbol":"ABT","Current Price":"128.49","Latest MA":"112.62","Price Target":133.07957,"Difference from MA":"14.09%","Difference from Open":"1.45%","Change from Yesterday":"0.43%","Change from Last Report":"-0.09","Latest Volume":"2,842,562","Market Cap":"222,860,771,328","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":22.651308,"PB Ratio":5.6001573,"Previous Close":127.93,"ROE":0.14840001,"DTE":37.589,"Industry":"Medical Devices","Sector":"Healthcare","Beta":0.722,"Trailing PEG":2.3001,"Trailing PE":16.818064,"Trailing PS":5.407011,"Quick Ratio":0.996,"Day High":128.6799,"Day Low":126.11,"VS Average Volume":0.5001169113,"Company Summary":"Abbott Laboratories, together with its subsidiaries, discovers, develops, manufactures, and sells health care products worldwide. It operates in four segments: Established Pharmaceutical Products, Diagnostic Products, Nutritional Products, and Medical Devices. The company provides generic pharmaceuticals for the treatment of pancreatic exocrine insufficiency, irritable bowel syndrome or biliary spasm, intrahepatic cholestasis or depressive symptoms, gynecological disorder, hormone replacement therapy, dyslipidemia, hypertension, hypothyroidism, Ménière's disease and vestibular vertigo, pain, fever, inflammation, and migraine, as well as provides anti-infective clarithromycin, influenza vaccine, and products to regulate physiological rhythm of the colon. It also offers laboratory and transfusion medicine systems in the areas of immunoassay, clinical chemistry, hematology, and transfusion; molecular diagnostics polymerase chain reaction instrument systems that automate the extraction, purification, and preparation of DNA and RNA from patient samples, and detect and measure infectious agents; point of care systems; cartridges for testing blood gas, chemistry, electrolytes, coagulation, and immunoassay; rapid diagnostics lateral flow testing products; molecular point-of-care testing for HIV, SARS-CoV-2, influenza A and B, RSV, and strep A; cardiometabolic test systems; drug and alcohol test, and remote patient monitoring and consumer self-test systems; and informatics and automation solutions for laboratories. In addition, the company provides pediatric and adult nutritional products; rhythm management, electrophysiology, heart failure, vascular, and structural heart devices for the treatment of cardiovascular diseases; diabetes care products, such as glucose and blood glucose monitoring systems; and neuromodulation devices for the management of chronic pain and movement disorders. Abbott Laboratories was founded in 1888 and is based in North Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"Alcoa Corporation","Symbol":"AA","Current Price":"34.31","Latest MA":"37.59","Price Target":48.04231,"Difference from MA":"-8.72%","Difference from Open":"0.39%","Change from Yesterday":"-2.55%","Change from Last Report":"-0.01","Latest Volume":"3,754,395","Market Cap":"8,865,452,032","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":10.650184,"PB Ratio":1.6886473,"Previous Close":35.32,"ROE":-0.07142,"DTE":56.095,"Industry":"Aluminum","Sector":"Basic Materials","Beta":2.419,"Trailing PEG":null,"Trailing PE":131.98077,"Trailing PS":0.8056572,"Quick Ratio":0.671,"Day High":35.22,"Day Low":33.42,"VS Average Volume":0.7919052345,"Company Summary":"Alcoa Corporation, together with its subsidiaries, produces and sells bauxite, alumina, and aluminum products in the United States, Spain, Australia, Iceland, Norway, Brazil, Canada, and internationally. The company operates through two segments, Alumina and Aluminum. It engages in bauxite mining operations; and processes bauxite into alumina and sells it to customers who process it into industrial chemical products, as well as aluminum smelting and casting businesses. The company offers primary aluminum in the form of alloy ingot or value-add ingot to customers that produce products for the transportation, building and construction, packaging, wire, and other industrial markets; and flat-rolled aluminum in the form of sheet, which is sold primarily to customers that produce beverage and food cans. In addition, it owns hydro power plants that generates and sells electricity in the wholesale market to traders, large industrial consumers, distribution companies, and other generation companies. The company was formerly known as Alcoa Upstream Corporation and changed its name to Alcoa Corporation in October 2016. The company was founded in 1886 and is headquartered in Pittsburgh, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"Lam Research Corporation","Symbol":"LRCX","Current Price":"80.60","Latest MA":"79.88","Price Target":91.18703,"Difference from MA":"0.90%","Difference from Open":"2.06%","Change from Yesterday":"-0.42%","Change from Last Report":"-0.05","Latest Volume":"6,158,759","Market Cap":"103,571,374,080","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.4476,"PB Ratio":12.305771,"Previous Close":81.05,"ROE":0.49116,"DTE":58.827,"Industry":"Semiconductor Equipment & Materials","Sector":"Technology","Beta":1.486,"Trailing PEG":1.5967,"Trailing PE":24.49933,"Trailing PS":6.642895,"Quick Ratio":1.685,"Day High":81.56,"Day Low":78.51,"VS Average Volume":0.5206714837,"Company Summary":"Lam Research Corporation designs, manufactures, markets, refurbishes, and services semiconductor processing equipment used in the fabrication of integrated circuits. The company offers ALTUS systems to deposit conformal films for tungsten metallization applications; SABRE electrochemical deposition products for copper interconnect transition that offers copper damascene manufacturing; and VECTOR plasma-enhanced CVD products. It also provides SPEED gapfill high-density plasma chemical vapor deposition products; and Striker single-wafer atomic layer deposition products for dielectric film solutions. In addition, the company offers Flex for dielectric etch applications; Vantex, a dielectric etch system that provides RF technology and repeatable wafer-to-wafer performance enabled by Equipment Intelligence solutions; Kiyo for conductor etch applications; Syndion for through-silicon via etch applications; and Versys metal products for metal etch processes. Further, it provides Coronus bevel clean products to enhance die yield; and Da Vinci, DV-Prime, EOS, and SP series products to address various wafer cleaning applications. The company sells its products in the United States, China, Europe, Japan, Korea, Southeast Asia, and Taiwan. Lam Research Corporation was incorporated in 1980 and is headquartered in Fremont, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"Johnson & Johnson","Symbol":"JNJ","Current Price":"151.91","Latest MA":"154.46","Price Target":168.64,"Difference from MA":"-1.65%","Difference from Open":"-0.06%","Change from Yesterday":"-0.20%","Change from Last Report":"-0.17","Latest Volume":"2,984,399","Market Cap":"365,739,147,264","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.663437,"PB Ratio":5.2123594,"Previous Close":152.15,"ROE":0.20889,"DTE":50.958,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.518,"Trailing PEG":0.9647,"Trailing PE":26.191206,"Trailing PS":4.170534,"Quick Ratio":0.705,"Day High":152.31,"Day Low":150.8,"VS Average Volume":0.3451817155,"Company Summary":"Johnson & Johnson, together with its subsidiaries, researches, develops, manufactures, and sells various products in the healthcare field worldwide. The company's Innovative Medicine segment offers products for various therapeutic areas, such as immunology, including rheumatoid arthritis, psoriatic arthritis, inflammatory bowel disease, and psoriasis; infectious diseases comprising HIV\/AIDS; neuroscience, consisting of mood disorders, neurodegenerative disorders, and schizophrenia; oncology, such as prostate cancer, hematologic malignancies, lung cancer, and bladder cancer; cardiovascular and metabolism, including thrombosis, diabetes, and macular degeneration; and pulmonary hypertension comprising pulmonary arterial hypertension through retailers, wholesalers, distributors, hospitals, and healthcare professionals for prescription use. Its MedTech segment provides Interventional Solutions, including electrophysiology products to treat heart rhythm disorders; the heart recovery portfolio, which includes technologies to treat severe coronary artery disease requiring high-risk PCI or AMI cardiogenic shock; and neurovascular care that treats hemorrhagic and ischemic stroke. this segment also offers an orthopaedics portfolio that includes products and enabling technologies that support hips, knees, trauma, spine, sports, and other; surgery portfolios comprising advanced and general surgery technologies, as well as solutions for breast aesthetics, ear, nose, and throat procedures; contact lenses under the ACUVUE Brand; and TECNIS intraocular lenses for cataract surgery. It distributes its products to wholesalers, hospitals, and retailers, as well as physicians, nurses, hospitals, eye care professionals, and clinics. The company has a collaboration agreement with Stand Up To Cancer for research testing a combination of teclistamab and daratumumab to treat a rare disease AL amyloidosis. Johnson & Johnson was founded in 1886 and is based in New Brunswick, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"Halliburton Company","Symbol":"HAL","Current Price":"25.65","Latest MA":"29.85","Price Target":34.41481,"Difference from MA":"-14.07%","Difference from Open":"-0.16%","Change from Yesterday":"-1.34%","Change from Last Report":"0.02","Latest Volume":"6,145,316","Market Cap":"22,533,576,704","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.322923,"PB Ratio":2.1872602,"Previous Close":26.02,"ROE":0.26293,"DTE":83.993,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.905,"Trailing PEG":1.7409,"Trailing PE":9.063604,"Trailing PS":0.97662103,"Quick Ratio":1.377,"Day High":25.94,"Day Low":25.28,"VS Average Volume":0.5944235587,"Company Summary":"Halliburton Company provides products and services to the energy industry worldwide. It operates through two segments, Completion and Production, and Drilling and Evaluation. The Completion and Production segment offers production enhancement services that include stimulation and sand control services; cementing services, such as well bonding and casing, and casing equipment; and completion tools that offer downhole solutions and services, including well completion products and services, intelligent well completions, and service tools, as well as liner hanger, sand control, and multilateral systems. This segment also provides electrical submersible pumps, as well as artificial lift services; production solutions comprising coiled tubing, hydraulic workover units, downhole tools, and pumping and nitrogen services; pipeline and process services, such as pre-commissioning, commissioning, maintenance, and decommissioning; and specialty chemicals and services. The Drilling and Evaluation segment offers drilling fluid systems, performance additives, completion fluids, solids control, specialized testing equipment, and waste management services; drilling systems and services; wireline and perforating services consists of open-hole logging, and cased-hole and slickline; and drill bits and services comprising roller cone rock bits, fixed cutter bits, hole enlargement, and related downhole tools and services, as well as coring equipment and services. This segment also provides cloud based digital services and artificial intelligence solutions on an open architecture for subsurface insights, integrated well construction, and reservoir and production management; testing and subsea services, such as acquisition and analysis of reservoir information and optimization solutions; and project management and integrated asset management services. Halliburton Company was founded in 1919 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"GE Vernova Inc.","Symbol":"GEV","Current Price":"363.41","Latest MA":"269.32","Price Target":413.4468,"Difference from MA":"34.94%","Difference from Open":"3.73%","Change from Yesterday":"-2.50%","Change from Last Report":"0.12","Latest Volume":"2,693,240","Market Cap":"100,175,429,632","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":35.105194,"PB Ratio":10.530876,"Previous Close":372.88,"ROE":"N\/A","DTE":9.346,"Industry":"Utilities - Renewable","Sector":"Utilities","Beta":"N\/A","Trailing PEG":3.2318,"Trailing PE":65.010735,"Trailing PS":2.9102151,"Quick Ratio":0.717,"Day High":366.5739,"Day Low":348.95,"VS Average Volume":0.7966042188,"Company Summary":"GE Vernova Inc., an energy company, engages in the provision of various products and services that generate, transfer, orchestrate, convert, and store electricity in the United States, Europe, Asia, the Americas, the Middle East, and Africa. The company operates through three segments: Power, Wind, and Electrification. The Power segment designs, manufactures, and services gas, nuclear, hydro, and steam technologies. The Wind segment offers wind generation technologies, including onshore and offshore wind turbines and blades. The Electrification segment provides grid solutions, power conversion, solar, and storage solutions; and electrification software for the transmission, distribution, conversion, storage, and orchestration of electricity from point of generation to point of consumption. The company was incorporated in 2023 and is headquartered in Cambridge, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"Amphenol Corporation","Symbol":"APH","Current Price":"70.21","Latest MA":"67.78","Price Target":84.08235,"Difference from MA":"3.59%","Difference from Open":"1.71%","Change from Yesterday":"-0.79%","Change from Last Report":"-0.12","Latest Volume":"3,678,275","Market Cap":"84,645,879,808","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":27.70139,"PB Ratio":8.9530735,"Previous Close":70.78,"ROE":0.25293,"DTE":57.565,"Industry":"Electronic Components","Sector":"Technology","Beta":1.238,"Trailing PEG":2.5142,"Trailing PE":36.567707,"Trailing PS":5.9474072,"Quick Ratio":1.208,"Day High":70.39,"Day Low":68.54,"VS Average Volume":0.5394210617,"Company Summary":"Amphenol Corporation, together with its subsidiaries, primarily designs, manufactures, and markets electrical, electronic, and fiber optic connectors in the United States, China, and internationally. It operates through three segments: Harsh Environment Solutions, Communications Solutions, and Interconnect and Sensor Systems. The company offers connectors and connector systems, including harsh environment data, power, high-speed, fiber optic, and radio frequency interconnect products; busbars and power distribution systems; and other connectors. It also provides value-add products, such as backplane interconnect systems, cable assemblies and harnesses, and cable management products; other products comprising flexible and rigid printed circuit boards, hinges, other mechanical, and production related products. In addition, the company offers consumer device, network infrastructure, and other antennas; coaxial, power, and specialty cables; and sensors and sensor-based products. It sells its products through its sales force, independent representatives, and a network of electronics distributors to original equipment manufacturers, electronic manufacturing services companies, original design manufacturers, and service providers in the automotive, broadband communication, commercial aerospace, industrial, information technology and data communication, military, mobile device, and mobile network markets. Amphenol Corporation was founded in 1932 and is headquartered in Wallingford, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"Kinder Morgan, Inc.","Symbol":"KMI","Current Price":"27.56","Latest MA":"24.08","Price Target":29.585,"Difference from MA":"14.43%","Difference from Open":"2.68%","Change from Yesterday":"0.53%","Change from Last Report":"-0.14","Latest Volume":"7,150,168","Market Cap":"61,228,396,544","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.447834,"PB Ratio":2.0137367,"Previous Close":27.1925,"ROE":0.083500005,"DTE":101.433,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.907,"Trailing PEG":2.0121,"Trailing PE":23.555555,"Trailing PS":4.0412116,"Quick Ratio":0.291,"Day High":27.67,"Day Low":26.73,"VS Average Volume":0.4932782926,"Company Summary":"Kinder Morgan, Inc. operates as an energy infrastructure company primarily in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas gasification, liquefaction, and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and\/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, renewable fuel and feedstocks, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; owns interests in\/or operates oil fields and gasoline processing plants; and operates a crude oil pipeline system in West Texas, as well as owns and operates RNG and LNG facilities. It owns and operates approximately 82,000 miles of pipelines and 139 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1997 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"Capital One Financial Corporati","Symbol":"COF","Current Price":"200.85","Latest MA":"162.01","Price Target":212.02444,"Difference from MA":"23.98%","Difference from Open":"0.56%","Change from Yesterday":"-1.48%","Change from Last Report":"0.02","Latest Volume":"2,060,009","Market Cap":"76,571,951,104","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":11.012137,"PB Ratio":1.3193573,"Previous Close":203.71,"ROE":0.07479,"DTE":"N\/A","Industry":"Credit Services","Sector":"Financial Services","Beta":1.432,"Trailing PEG":2.097,"Trailing PE":17.359983,"Trailing PS":2.889835,"Quick Ratio":"N\/A","Day High":202.3,"Day Low":197.115,"VS Average Volume":0.6583721723,"Company Summary":"Capital One Financial Corporation operates as the financial services holding company for the Capital One, National Association, which engages in the provision of various financial products and services in the United States, Canada, and the United Kingdom. It operates through three segments: Credit Card, Consumer Banking, and Commercial Banking. The company accepts checking accounts, money market deposits, negotiable order of withdrawals, savings deposits, and time deposits. Its loan products include credit card loans; auto and retail banking loans; and commercial and multifamily real estate, and commercial and industrial loans. The company also offers credit and debit card products; online direct banking services; and provides advisory, capital markets, treasury management, and depository services. It serves consumers, small businesses, and commercial clients through digital channels, branches, cafés, and other distribution channels located in New York, Louisiana, Texas, Maryland, Virginia, New Jersey, and California. The company was founded in 1988 and is headquartered in McLean, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"United Airlines Holdings, Inc.","Symbol":"UAL","Current Price":"105.37","Latest MA":"70.82","Price Target":129.49522,"Difference from MA":"48.78%","Difference from Open":"3.34%","Change from Yesterday":"-0.21%","Change from Last Report":"0.14","Latest Volume":"2,754,553","Market Cap":"34,653,663,232","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.107718,"PB Ratio":3.029702,"Previous Close":105.84,"ROE":0.27245,"DTE":291.676,"Industry":"Airlines","Sector":"Industrials","Beta":1.393,"Trailing PEG":0.994,"Trailing PE":11.150265,"Trailing PS":0.6188817,"Quick Ratio":0.694,"Day High":106.3,"Day Low":101.32,"VS Average Volume":0.4799766716,"Company Summary":"United Airlines Holdings, Inc., through its subsidiaries, provides air transportation services in North America, Asia, Europe, Africa, the Pacific, the Middle East, and Latin America. The company transports people and cargo through its mainline and regional fleets. It also offers catering, ground handling, flight academy, and maintenance services for third parties. The company was formerly known as United Continental Holdings, Inc. and changed its name to United Airlines Holdings, Inc. in June 2019. United Airlines Holdings, Inc. was incorporated in 1968 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"Netflix, Inc.","Symbol":"NFLX","Current Price":"980.91","Latest MA":"768.34","Price Target":1063.7195,"Difference from MA":"27.67%","Difference from Open":"0.86%","Change from Yesterday":"0.38%","Change from Last Report":"-0.10","Latest Volume":"2,392,251","Market Cap":"419,593,224,192","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":32.344738,"PB Ratio":18.454556,"Previous Close":976.76,"ROE":0.34714,"DTE":81.461,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.25,"Trailing PEG":2.4191,"Trailing PE":49.466213,"Trailing PS":11.163171,"Quick Ratio":0.975,"Day High":984.44,"Day Low":964.375,"VS Average Volume":0.6877199388,"Company Summary":"Netflix, Inc. provides entertainment services. It offers TV series, documentaries, feature films, and games across various genres and languages. The company also provides members the ability to receive streaming content through a host of internet-connected devices, including TVs, digital video players, TV set-top boxes, and mobile devices. It has operations in approximately 190 countries. The company was incorporated in 1997 and is headquartered in Los Gatos, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"KeyCorp","Symbol":"KEY","Current Price":"17.57","Latest MA":"16.79","Price Target":21.04,"Difference from MA":"4.65%","Difference from Open":"0.77%","Change from Yesterday":"-2.14%","Change from Last Report":"0.11","Latest Volume":"5,986,664","Market Cap":"19,451,834,368","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":10.074809,"PB Ratio":1.213827,"Previous Close":17.98,"ROE":0.0096700005,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.231,"Trailing PEG":0.7732,"Trailing PE":"N\/A","Trailing PS":4.0090346,"Quick Ratio":"N\/A","Day High":17.745,"Day Low":17.295,"VS Average Volume":0.5512901761,"Company Summary":"KeyCorp operates as the holding company for KeyBank National Association that provides various retail and commercial banking products and services in the United States. It operates in two segments, Consumer Bank and Commercial Bank. The company offers various deposits, investment products and services; commercial leasing, investment management, consumer finance; and personal finance and financial wellness, student loan refinancing, mortgage and home equity, lending, credit card, treasury, business advisory, wealth management, asset management, cash management, portfolio management, and trust and related services to individuals and small and medium-sized businesses. It also provides a suite of banking and capital market products, such as syndicated finance, debt and equity capital market products, commercial payments, equipment finance, commercial mortgage banking, derivatives, foreign exchange, financial advisory, and public finance, as well as commercial mortgage loans to consumer, energy, healthcare, industrial, public sector, real estate, and technology sectors for middle market clients. In addition, the company offers community development financing, securities underwriting, brokerage, and investment banking services. The company was founded in 1849 and is headquartered in Cleveland, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"Charles Schwab Corporation (The","Symbol":"SCHW","Current Price":"82.81","Latest MA":"71.13","Price Target":89.5,"Difference from MA":"16.42%","Difference from Open":"1.87%","Change from Yesterday":"0.13%","Change from Last Report":"-0.05","Latest Volume":"2,923,464","Market Cap":"151,588,667,392","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":15.973904,"PB Ratio":3.9845064,"Previous Close":82.72,"ROE":0.12111,"DTE":144.242,"Industry":"Capital Markets","Sector":"Financial Services","Beta":0.952,"Trailing PEG":0.9537,"Trailing PE":27.695652,"Trailing PS":8.09077,"Quick Ratio":0.481,"Day High":83.22,"Day Low":80.79,"VS Average Volume":0.3543207913,"Company Summary":"The Charles Schwab Corporation, together with its subsidiaries, operates as a savings and loan holding company that provides wealth management, securities brokerage, banking, asset management, custody, and financial advisory services in the United States and internationally. The company operates in two segments, Investor Services and Advisor Services. It offers brokerage accounts with equity and fixed income trading, margin lending, options trading, futures and forex trading, and cash management capabilities, including certificates of deposit; third-party mutual funds through the Mutual Fund Marketplace and Mutual Fund OneSource service, as well as mutual fund trading and clearing services to broker-dealers; exchange-traded funds; advisory solutions for managed portfolios, separately managed accounts, customized personal advice for tailored portfolios, specialized planning, and full-time portfolio management; banking products comprising checking and savings accounts, first lien residential real estate mortgage loans, home equity lines of credit, and pledged asset lines; and trust custody services, personal trust reporting services, and administrative trustee services. It also provides digital retirement calculators; integrated web-, mobile-, and software-based trading platforms, real-time market data, options trading, premium research, and multi-channel access; self-service education and support tools; online research and analysis tools; equity compensation plan sponsors full-service recordkeeping for stock plans, stock options, restricted stock, performance shares, and stock appreciation rights; retirement plan services; mutual fund clearing services; and advisor services, including interactive tools and educational content. The Company operates through branch offices. The Charles Schwab Corporation was founded in 1971 and is headquartered in Westlake, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"Uber Technologies, Inc.","Symbol":"UBER","Current Price":"67.47","Latest MA":"70.33","Price Target":88.6338,"Difference from MA":"-4.06%","Difference from Open":"3.33%","Change from Yesterday":"0.97%","Change from Last Report":"-0.06","Latest Volume":"15,340,591","Market Cap":"142,082,768,896","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":21.289518,"PB Ratio":9.606349,"Previous Close":66.85,"ROE":0.34326,"DTE":80.343,"Industry":"Software - Application","Sector":"Technology","Beta":1.337,"Trailing PEG":0.7077,"Trailing PE":33.238914,"Trailing PS":3.3865514,"Quick Ratio":1.223,"Day High":68.85,"Day Low":65.1781,"VS Average Volume":0.611708503,"Company Summary":"Uber Technologies, Inc. develops and operates proprietary technology applications in the United States, Canada, Latin America, Europe, the Middle East, Africa, and Asia excluding China and Southeast Asia. It operates through three segments: Mobility, Delivery, and Freight. The Mobility segment connects consumers with a range of transportation modalities, such as ridesharing, carsharing, micromobility, rentals, public transit, taxis, and other modalities; and offers riders in a variety of vehicle types, as well as financial partnerships products and advertising services. The Delivery segment allows to search for and discover restaurants to grocery, alcohol, convenience, and other retails; order a meal or other items; and Uber direct, a white-label Delivery-as-a-Service for retailers and restaurants, as well as advertising. The Freight segment manages transportation and logistics network, which connects shippers and carriers in digital marketplace including carriers upfronts, pricing, and shipment booking; and provides on-demand platform to automate logistics end-to-end transactions for small-and medium-sized business to global enterprises. The company was formerly known as Ubercab, Inc. and changed its name to Uber Technologies, Inc. in February 2011. Uber Technologies, Inc. was founded in 2009 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"Johnson Controls International ","Symbol":"JCI","Current Price":"77.19","Latest MA":"75.31","Price Target":88.53333,"Difference from MA":"2.50%","Difference from Open":"0.98%","Change from Yesterday":"-0.98%","Change from Last Report":"0.00","Latest Volume":"2,178,545","Market Cap":"50,956,132,352","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":18.955774,"PB Ratio":3.190065,"Previous Close":78.0,"ROE":0.0805,"DTE":54.68,"Industry":"Building Products & Equipment","Sector":"Industrials","Beta":1.306,"Trailing PEG":1.3301,"Trailing PE":37.11058,"Trailing PS":2.2201173,"Quick Ratio":0.557,"Day High":77.44,"Day Low":75.89,"VS Average Volume":0.5827315999,"Company Summary":"Johnson Controls International plc, together with its subsidiaries, engages in engineering, manufacturing, commissioning, and retrofitting building products and systems in the United States, Europe, the Asia Pacific, and internationally. It operates through four segments: Building Solutions North America, Building Solutions EMEA\/LA, Building Solutions Asia Pacific, and Global Products. The company designs, sells, installs, and services heating, ventilating, air conditioning, controls, building management, refrigeration, integrated electronic security, integrated fire detection and suppression systems, and fire protection and security products. It also provides energy efficiency solutions and technical services, including inspection, scheduled maintenance, and repair and replacement of mechanical and control systems, as well as data-driven smart building solutions. In addition, the company offers control software and software services. It sells its products and services to commercial, institutional, industrial, data center, and governmental customers. Johnson Controls International plc was incorporated in 1885 and is headquartered in Cork, Ireland.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"Ford Motor Company","Symbol":"F","Current Price":"9.91","Latest MA":"10.79","Price Target":11.68125,"Difference from MA":"-8.09%","Difference from Open":"2.01%","Change from Yesterday":"-1.64%","Change from Last Report":"0.10","Latest Volume":"100,308,516","Market Cap":"39,405,084,672","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":5.959751,"PB Ratio":0.8892377,"Previous Close":10.08,"ROE":0.0799,"DTE":359.359,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":1.636,"Trailing PEG":0.8746,"Trailing PE":11.267045,"Trailing PS":0.21563114,"Quick Ratio":0.942,"Day High":10.055,"Day Low":9.6,"VS Average Volume":1.6708466657,"Company Summary":"Ford Motor Company develops, delivers, and services a range of Ford trucks, commercial cars and vans, sport utility vehicles, and Lincoln luxury vehicles worldwide. It operates through Ford Blue, Ford Model e, and Ford Pro; Ford Next; and Ford Credit segments. The company sells Ford and Lincoln vehicles, service parts, and accessories through distributors and dealers, as well as through dealerships to commercial fleet customers, daily rental car companies, and governments. It also engages in vehicle-related financing and leasing activities to and through automotive dealers. In addition, the company provides retail installment sale contracts for new and used vehicles; and direct financing leases for new vehicles to retail and commercial customers, such as leasing companies, government entities, daily rental companies, and fleet customers. Further, it offers wholesale loans to dealers to finance the purchase of vehicle inventory; and loans to dealers to finance working capital and enhance dealership facilities, purchase dealership real estate, and other dealer vehicle programs. The company was incorporated in 1903 and is based in Dearborn, Michigan.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"Boston Scientific Corporation","Symbol":"BSX","Current Price":"103.55","Latest MA":"85.44","Price Target":103.49156,"Difference from MA":"21.20%","Difference from Open":"2.11%","Change from Yesterday":"1.12%","Change from Last Report":"-0.13","Latest Volume":"3,090,378","Market Cap":"152,615,108,608","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":36.812412,"PB Ratio":7.3680096,"Previous Close":102.36,"ROE":0.08916,"DTE":53.722,"Industry":"Medical Devices","Sector":"Healthcare","Beta":0.797,"Trailing PEG":1.8557,"Trailing PE":85.578514,"Trailing PS":9.591799,"Quick Ratio":0.847,"Day High":103.86,"Day Low":100.7,"VS Average Volume":0.5822134631,"Company Summary":"Boston Scientific Corporation develops, manufactures, and markets medical devices for use in various interventional medical specialties worldwide. It operates through two segments, MedSurg and Cardiovascular. The company offers devices to diagnose and treat gastrointestinal and pulmonary conditions, such as resolution clips, biliary stent systems, stents and electrocautery enhanced delivery systems, direct visualization systems, digital catheters, and single-use duodenoscopes; devices to treat urological conditions, including ureteral stents, catheters, baskets, guidewires, sheaths, balloons, single-use digital flexible ureteroscopes, holmium laser systems, artificial urinary sphincter, laser system, fiber, and hydrogel systems; and devices to treat neurological movement disorders and manage chronic pain, such as spinal cord stimulator system, proprietary programming software, radiofrequency generator, indirect decompression systems, practice optimization tools, and deep brain stimulation system. It also provides technologies for diagnosing and treating coronary artery disease and aortic valve conditions; WATCHMAN FLX, a Left Atrial Appendage Closure Device; and implantable devices that monitor the heart and deliver electricity to treat cardiac abnormalities, such as cardioverter and cardiac resynchronization therapy defibrillators, MRI S-ICD systems, cardiac resynchronization therapy pacemakers, quadripolar LV leads, ICD leads, pacing leads, remote patient management systems, insertable cardiac monitor systems, and remote cardiac monitoring systems. In addition, the company offers diagnosis and treatment of rate and rhythm disorders of the heart; peripheral arterial and venous diseases; and products to diagnose, treat and ease forms of cancer. The company was incorporated in 1979 and is headquartered in Marlborough, Massachusetts.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"Ares Capital Corporation","Symbol":"ARCC","Current Price":"23.61","Latest MA":"20.88","Price Target":22.82143,"Difference from MA":"13.04%","Difference from Open":"1.48%","Change from Yesterday":"-0.19%","Change from Last Report":"-0.04","Latest Volume":"3,089,106","Market Cap":"15,831,306,240","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":10.704342,"PB Ratio":1.19386,"Previous Close":23.67,"ROE":0.1338,"DTE":106.255,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.054,"Trailing PEG":null,"Trailing PE":9.078846,"Trailing PS":5.388464,"Quick Ratio":1.29,"Day High":23.7,"Day Low":23.18,"VS Average Volume":0.6945041851,"Company Summary":"Ares Capital Corporation is a business development company specializing in acquisition, recapitalization, mezzanine debt, restructurings, rescue financing, and leveraged buyout transactions of middle market companies. It also makes growth capital and general refinancing. It prefers to make investments in companies engaged in the basic and growth manufacturing, business services, consumer products, health care products and services, and information technology service sectors. The fund will also consider investments in industries such as restaurants, retail, oil and gas, and technology sectors. It focuses on investments in Northeast, Mid-Atlantic, Southeast and Southwest regions from its New York office, the Midwest region, from the Chicago office, and the Western region from the Los Angeles office. The fund typically invests between $20 million and $200 million and a maximum of $400 million in companies with an EBITDA between $10 million and $250 million. It makes debt investments between $10 million and $100 million The fund invests through revolvers, first lien loans, warrants, unitranche structures, second lien loans, mezzanine debt, private high yield, junior capital, subordinated debt, and non-control preferred and common equity. The fund also selectively considers third-party-led senior and subordinated debt financings and opportunistically considers the purchase of stressed and discounted debt positions. The fund prefers to be an agent and\/or lead the transactions in which it invests. The fund also seeks board representation in its portfolio companies.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"Emerson Electric Company","Symbol":"EMR","Current Price":"128.31","Latest MA":"115.51","Price Target":140.15259,"Difference from MA":"11.08%","Difference from Open":"1.14%","Change from Yesterday":"-1.21%","Change from Last Report":"-0.03","Latest Volume":"2,258,118","Market Cap":"73,076,523,008","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":19.815664,"PB Ratio":3.381473,"Previous Close":129.95,"ROE":0.05933,"DTE":30.376,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":1.292,"Trailing PEG":null,"Trailing PE":45.5,"Trailing PS":4.177711,"Quick Ratio":1.323,"Day High":129.09,"Day Low":126.24,"VS Average Volume":0.7175792974,"Company Summary":"Emerson Electric Co., a technology and software company, provides various solutions in the Americas, Asia, the Middle East, Africa, and Europe. It operates through seven segments: Final Control, Measurement & Analytical, Discrete Automation, Safety & Productivity, Control Systems & Software, Test & Measurement, and AspenTech. The Final Control segment provides control, isolation, shutoff, pressure relief, and pressure safety valves, actuators, and regulators for process and hybrid industries. The Measurement & Analytical segment offers intelligent instrumentation measuring the physical properties of liquids or gases, such as pressure, temperature, level, flow, acoustics, corrosion, pH, conductivity, water quality, toxic gases, and flame. The Discrete Automation segment offers solenoid and pneumatic valves, valve position indicators, pneumatic cylinders, actuators, air preparation equipment, pressure and temperature switches, electric linear motion solutions, programmable automation control systems, electrical distribution equipment, and materials joining solutions. The Safety & Productivity segment offers tools for professionals and homeowners; pipe-working tools, including pipe wrenches, pipe cutters, pipe threading and roll grooving equipment, battery hydraulic tools; electrical tools; and other professional tools. The Control Systems & Software segment provides control systems, safety instrumented systems, SCADA systems, application software, digital twins, asset performance management, and cybersecurity. The Test & Measurement provides software-connected automated test and measurement systems. The AspenTech segment provides asset optimization software that enables industrial manufacturers to design, operate, and maintain operations for enhancing performance through a combination of decades of modeling, simulation, and optimization capabilities. The company was incorporated in 1890 and is based in Saint Louis, Missouri.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"Walt Disney Company (The)","Symbol":"DIS","Current Price":"113.38","Latest MA":"99.85","Price Target":124.56071,"Difference from MA":"13.55%","Difference from Open":"1.82%","Change from Yesterday":"0.36%","Change from Last Report":"0.00","Latest Volume":"4,712,451","Market Cap":"205,043,187,712","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":18.599081,"PB Ratio":2.046238,"Previous Close":113.06,"ROE":0.0546,"DTE":45.188,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.398,"Trailing PEG":0.9926,"Trailing PE":41.683823,"Trailing PS":2.277549,"Quick Ratio":0.531,"Day High":113.72,"Day Low":110.86,"VS Average Volume":0.5079419777,"Company Summary":"The Walt Disney Company operates as an entertainment company worldwide. It operates through three segments: Entertainment, Sports, and Experiences. The company produces and distributes film and television video streaming content under the ABC Television Network, Disney, Freeform, FX, Fox, National Geographic, and Star brand television channels, as well as ABC television stations and A+E television networks; and produces original content under the ABC Signature, Disney Branded Television, FX Productions, Lucasfilm, Marvel, National Geographic Studios, Pixar, Searchlight Pictures, Twentieth Century Studios, 20th Television, and Walt Disney Pictures banners. It also offers direct-to-consumer streaming services through Disney+, Disney+ Hotstar, Hulu, and Star+; sports-related entertainment services through ESPN, ESPN on ABC, ESPN+ DTC, and Star; sale\/licensing of film and episodic content to third-party television and VOD services; theatrical, home entertainment, and music distribution services; DVD and Blu-ray discs, electronic home video licenses, and VOD rental services; staging and licensing of live entertainment events; and post-production services. In addition, the company operates theme parks and resorts comprising Walt Disney World Resort, Disneyland Resort, Disneyland Paris, Hong Kong Disneyland Resort, Shanghai Disney Resort, Disney Cruise Line, Disney Vacation Club, National Geographic Expeditions, and Adventures by Disney, as well as Aulani, a Disney resort and spa in Hawaii. It also licenses its intellectual property to a third party for operations of the Tokyo Disney Resort; licenses trade names, characters, visual, literary, and other IP for use on merchandise, published materials, and games; operates a direct-to-home satellite distribution platform; sells branded merchandise through retail, online, and wholesale businesses; and develops and publishes books, comic books, and magazines. The company was founded in 1923 and is based in Burbank, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"Enterprise Products Partners L.","Symbol":"EPD","Current Price":"32.97","Latest MA":"29.55","Price Target":35.66722,"Difference from MA":"11.59%","Difference from Open":"4.37%","Change from Yesterday":"1.24%","Change from Last Report":"-0.36","Latest Volume":"4,302,394","Market Cap":"71,465,115,648","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":11.410713,"PB Ratio":2.5210278,"Previous Close":32.65,"ROE":0.20665,"DTE":110.757,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":1.014,"Trailing PEG":3.166,"Trailing PE":12.394737,"Trailing PS":1.2617428,"Quick Ratio":0.719,"Day High":33.18,"Day Low":31.5101,"VS Average Volume":0.9856708225,"Company Summary":"Enterprise Products Partners L.P. provides midstream energy services to producers and consumers of natural gas, natural gas liquids (NGLs), crude oil, petrochemicals, and refined products. It operates in four segments: NGL Pipelines & Services, Crude Oil Pipelines & Services, Natural Gas Pipelines & Services, and Petrochemical & Refined Products Services. The NGL Pipelines & Services segment offers natural gas processing and related NGL marketing services. It operates natural gas processing facilities located in Colorado, Louisiana, Mississippi, New Mexico, Texas, and Wyoming; NGL pipelines; NGL fractionation facilities; NGL and related product storage facilities; and NGL marine terminals. The Crude Oil Pipelines & Services segment operates crude oil pipelines; and crude oil storage and marine terminals, which include a fleet of approximately 250 tractor-trailer tank trucks that are used to transport crude oil. It also engages in crude oil marketing activities. The Natural Gas Pipelines & Services segment operates natural gas pipeline systems to gather, treat, and transport natural gas. It leases underground salt dome natural gas storage facilities in Napoleonville, Louisiana; owns an underground salt dome storage cavern in Wharton County, Texas; and markets natural gas. The Petrochemical & Refined Products Services segment operates propylene fractionation facilities, including propylene fractionation units and propane dehydrogenation facilities, and related marketing activities; butane isomerization complex and related deisobutanizer operations; and octane enhancement, isobutane dehydrogenation, and high purity isobutylene production facilities. It also operates refined products pipelines and terminals; and ethylene export terminals; and provides refined products marketing and marine transportation services. Enterprise Products Partners L.P. was founded in 1968 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"Alphabet Inc.","Symbol":"GOOGL","Current Price":"202.72","Latest MA":"174.61","Price Target":216.36867,"Difference from MA":"16.09%","Difference from Open":"1.02%","Change from Yesterday":"-0.66%","Change from Last Report":"-0.16","Latest Volume":"15,779,010","Market Cap":"2,490,130,759,680","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":22.53503,"PB Ratio":7.914535,"Previous Close":204.02,"ROE":0.32101002,"DTE":9.324,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.034,"Trailing PEG":1.3332,"Trailing PE":26.849669,"Trailing PS":7.3269525,"Quick Ratio":1.761,"Day High":203.75,"Day Low":200.11,"VS Average Volume":0.5758276262,"Company Summary":"Alphabet Inc. offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube. It is also involved in the sale of apps and in-app purchases and digital content in the Google Play and YouTube; and devices, as well as in the provision of YouTube consumer subscription services. The Google Cloud segment offers infrastructure, cybersecurity, databases, analytics, AI, and other services; Google Workspace that include cloud-based communication and collaboration tools for enterprises, such as Gmail, Docs, Drive, Calendar, and Meet; and other services for enterprise customers. The Other Bets segment sells healthcare-related and internet services. The company was incorporated in 1998 and is headquartered in Mountain View, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"Lumen Technologies, Inc.","Symbol":"LUMN","Current Price":"4.80","Latest MA":"5.53","Price Target":5.37091,"Difference from MA":"-13.12%","Difference from Open":"1.59%","Change from Yesterday":"-2.33%","Change from Last Report":"0.00","Latest Volume":"6,057,782","Market Cap":"4,876,162,048","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":-7.17807,"PB Ratio":14.25816,"Previous Close":4.94,"ROE":-1.6673199,"DTE":5502.924,"Industry":"Telecom Services","Sector":"Communication Services","Beta":1.201,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.36673903,"Quick Ratio":0.988,"Day High":4.95,"Day Low":4.57,"VS Average Volume":0.4270792663,"Company Summary":"Lumen Technologies, Inc., a facilities-based technology and communications company, provides various integrated products and services to business and residential customers in the United States and internationally. The company operates in two segments, Business and Mass Markets. It offers dark fiber, edge cloud services, internet protocol, managed security, software-defined wide area networks, secure access service edge, unified communications and collaboration, and optical wavelengths services; ethernet and VPN data networks services; and legacy services to manage cash flow, including time division multiplexing voice, private line, and other legacy services, as well as sells communication equipment, and IT solutions. The company also provides high speed and lower speed broadband service to residential and small business customers; local and long-distance voice services, professional services, and other ancillary services; and federal broadband and state support programs. It serves its products and services under the Lumen, Quantum Fiber, and CenturyLink brands. The company was formerly known as CenturyLink, Inc. and changed its name to Lumen Technologies, Inc. in September 2020. Lumen Technologies, Inc. was incorporated in 1968 and is headquartered in Monroe, Louisiana.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"Pfizer, Inc.","Symbol":"PFE","Current Price":"26.25","Latest MA":"27.17","Price Target":31.12955,"Difference from MA":"-3.38%","Difference from Open":"-0.17%","Change from Yesterday":"-1.00%","Change from Last Report":"-0.04","Latest Volume":"26,211,653","Market Cap":"148,786,823,168","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":8.955188,"PB Ratio":1.6119229,"Previous Close":26.52,"ROE":0.04538,"DTE":73.408,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.615,"Trailing PEG":0.1987,"Trailing PE":35.006664,"Trailing PS":2.5058832,"Quick Ratio":0.64,"Day High":26.465,"Day Low":26.15,"VS Average Volume":0.6042060787,"Company Summary":"Pfizer Inc. discovers, develops, manufactures, markets, distributes, and sells biopharmaceutical products in the United States, Europe, and internationally. The company offers medicines and vaccines in various therapeutic areas, including cardiovascular metabolic, migraine, and women's health under the Eliquis, Nurtec ODT\/Vydura, Zavzpret, and the Premarin family brands; infectious diseases with unmet medical needs under the Prevnar family, Abrysvo, Nimenrix, FSME\/IMMUN-TicoVac, and Trumenba brands; and COVID-19 prevention and treatment, and potential future mRNA and antiviral products under the Comirnaty and Paxlovid brands. It also provides medicines and vaccines in various therapeutic areas, such as biosimilars for chronic immune and inflammatory diseases under the Xeljanz, Enbrel, Inflectra, Litfulo, Velsipity, and Cibinqo brands; amyloidosis, hemophilia, endocrine diseases, and sickle cell disease under the Vyndaqel family, Oxbryta, BeneFIX, Somavert, Ngenla, and Genotropin brands; sterile injectable and anti-infective medicines under the Sulperazon, Medrol, Zavicefta, Zithromax, and Panzyga brands; and biologics, small molecules, immunotherapies, and biosimilars under the Ibrance, Xtandi, Inlyta, Bosulif, Mektovi, Padcev, Adcetris, Talzenna, Tukysa, Elrexfio, Tivdak, Lorbrena, and Braftovi brands. In addition, the company involved in the contract manufacturing business. It serves wholesalers, retailers, hospitals, clinics, government agencies, pharmacies, individual provider offices, retail pharmacies, and integrated delivery systems. The company has collaboration agreements with Bristol-Myers Squibb Company; Astellas Pharma US, Inc.; Merck KGaA; and BioNTech SE, as well as has strategic clinical collaboration with Acepodia Inc. for the development of antibody-cell conjugation-based cell therapies in autoimmune diseases. Pfizer Inc. was founded in 1849 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"Pepsico, Inc.","Symbol":"PEP","Current Price":"150.71","Latest MA":"163.58","Price Target":172.62045,"Difference from MA":"-7.87%","Difference from Open":"0.77%","Change from Yesterday":"-0.03%","Change from Last Report":"-0.01","Latest Volume":"3,794,677","Market Cap":"206,772,617,216","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":17.668106,"PB Ratio":10.637352,"Previous Close":150.69,"ROE":0.48819,"DTE":229.605,"Industry":"Beverages - Non-Alcoholic","Sector":"Consumer Defensive","Beta":0.542,"Trailing PEG":1.8127,"Trailing PE":22.228615,"Trailing PS":2.2494845,"Quick Ratio":0.664,"Day High":151.12,"Day Low":148.83,"VS Average Volume":0.5996277409,"Company Summary":"PepsiCo, Inc. engages in the manufacture, marketing, distribution, and sale of various beverages and convenient foods worldwide. The company operates through seven segments: Frito-Lay North America; Quaker Foods North America; PepsiCo Beverages North America; Latin America; Europe; Africa, Middle East and South Asia; and Asia Pacific, Australia and New Zealand and China Region. It provides dips, cheese-flavored snacks, and spreads, as well as corn, potato, and tortilla chips; cereals, rice, pasta, mixes and syrups, granola bars, grits, oatmeal, rice cakes, and side dishes; beverage concentrates, fountain syrups, and finished goods; ready-to-drink tea, coffee, and juices; dairy products; and sparkling water makers and related products, as well as distributes alcoholic beverages under Hard MTN Dew brand. The company offers its products primarily under the Lay's, Doritos, Fritos, Tostitos, BaiCaoWei, Cheetos, Cap'n Crunch, Life, Pearl Milling Company, Gatorade, Pepsi-Cola, Mountain Dew, Quaker, Rice-A-Roni, Aquafina, Bubly, Emperador, Diet Mountain Dew, Diet Pepsi, Gatorade Zero, Crush, Propel, Dr Pepper, Schweppes, Marias Gamesa, Ruffles, Sabritas, Saladitas, Tostitos, 7UP, Diet 7UP, H2oh!, Manzanita Sol, Mirinda, Pepsi Black, Pepsi Max, San Carlos, Toddy, Walkers, Chipsy, Kurkure, Sasko, Spekko, White Star, Smith's, Sting, SodaStream, Lubimyj Sad, Agusha, Chudo, Domik v Derevne, Lipton, and other brands. It serves wholesale and other distributors, foodservice customers, grocery stores, drug stores, convenience stores, discount\/dollar stores, mass merchandisers, membership stores, hard discounters, e-commerce retailers and authorized independent bottlers, and others through a network of direct-store-delivery, customer warehouse, and distributor networks, as well as directly to consumers through e-commerce platforms and retailers. The company was founded in 1898 and is based in Purchase, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"Super Micro Computer, Inc.","Symbol":"SMCI","Current Price":"27.24","Latest MA":"46.40","Price Target":40.79182,"Difference from MA":"-41.29%","Difference from Open":"0.07%","Change from Yesterday":"-4.31%","Change from Last Report":"0.08","Latest Volume":"33,426,195","Market Cap":"15,950,790,656","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.3834543,"PB Ratio":2.922747,"Previous Close":28.52,"ROE":0.32469,"DTE":39.749,"Industry":"Computer Hardware","Sector":"Technology","Beta":1.279,"Trailing PEG":null,"Trailing PE":13.552238,"Trailing PS":1.0674528,"Quick Ratio":1.805,"Day High":27.61,"Day Low":25.71,"VS Average Volume":0.4697545057,"Company Summary":"Super Micro Computer, Inc., together with its subsidiaries, develops and manufactures high performance server and storage solutions based on modular and open architecture in the United States, Europe, Asia, and internationally. Its solutions range from complete server, storage systems, modular blade servers, blades, workstations, full racks, networking devices, server sub-systems, server management software, and security software. The company provides application-optimized server solutions, rackmount and blade servers, storage, and subsystems and accessories; and server software management solutions, such as Server Management Suite, including Supermicro Server Manager, Supermicro Power Management software, Supermicro Update Manager, SuperCloud Composer, and SuperDoctor 5. In addition, it offers server subsystems and accessories comprising server boards, chassis, power supplies, and other accessories. Further, the company provides server and storage system integration, configuration, and software upgrade and update services; and technical documentation services, as well as identifies service requirements, creates and executes project plans, and conducts verification testing and technical documentation, and training services. Additionally, it offers help desk and on-site product support services for its server and storage systems; and customer support services, including ongoing maintenance and technical support for its products. The company provides its products to enterprise data centers, cloud computing, artificial intelligence, and 5G and edge computing markets. It sells its products through direct and indirect sales force, distributors, value-added resellers, system integrators, and original equipment manufacturers. The company was incorporated in 1993 and is headquartered in San Jose, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"PayPal Holdings, Inc.","Symbol":"PYPL","Current Price":"89.04","Latest MA":"77.18","Price Target":96.24829,"Difference from MA":"15.37%","Difference from Open":"2.94%","Change from Yesterday":"0.61%","Change from Last Report":"0.09","Latest Volume":"6,414,354","Market Cap":"89,266,167,808","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":18.169575,"PB Ratio":4.440012,"Previous Close":88.58,"ROE":0.22188,"DTE":65.718,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.436,"Trailing PEG":1.468,"Trailing PE":21.301437,"Trailing PS":2.8377204,"Quick Ratio":0.261,"Day High":89.19,"Day Low":86.0,"VS Average Volume":0.762831669,"Company Summary":"PayPal Holdings, Inc. operates a technology platform that enables digital payments on behalf of merchants and consumers worldwide. It operates a two-sided network at scale that connects merchants and consumers that enables its customers to connect, transact, and send and receive payments through online and in person, as well as transfer and withdraw funds using various funding sources, such as bank accounts, PayPal or Venmo account balance, PayPal and Venmo branded credit products comprising its installment products, credit and debit cards, and cryptocurrencies, as well as other stored value products, including gift cards and eligible rewards. The company provides payment solutions under the PayPal, PayPal Credit, Braintree, Venmo, Xoom, Zettle, Hyperwallet, Honey, and Paidy names. The company was founded in 1998 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"Juniper Networks, Inc.","Symbol":"JNPR","Current Price":"34.53","Latest MA":"37.71","Price Target":39.7,"Difference from MA":"-8.42%","Difference from Open":"-0.42%","Change from Yesterday":"-0.90%","Change from Last Report":"-0.40","Latest Volume":"2,465,503","Market Cap":"11,434,158,080","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":17.294046,"PB Ratio":2.4613357,"Previous Close":34.86,"ROE":0.055760004,"DTE":39.109,"Industry":"Communication Equipment","Sector":"Technology","Beta":0.921,"Trailing PEG":null,"Trailing PE":45.44079,"Trailing PS":2.271251,"Quick Ratio":1.069,"Day High":35.0,"Day Low":34.375,"VS Average Volume":0.5674217244,"Company Summary":"Juniper Networks, Inc. designs, develops, and sells network products and services worldwide. The company offers routing products, such as ACX series universal access routers to deploy high-bandwidth services; MX series Ethernet routers that function as a universal edge platform; PTX series packet transport routers; wide-area network SDN controllers; and session smart routers. It also provides switching products, including EX series Ethernet switches to address the access, aggregation, and core layer switching requirements of micro branch, branch office, and campus environments; QFX series of core, spine, and top-of-rack data center switches; and juniper access points, which provide Wi-Fi access and performance. In addition, the company offers security products comprising SRX series services gateways for the data center; Branch SRX family provides an integrated and next-generation firewall; virtual firewall that delivers various features of physical firewalls; and advanced malware protection, a cloud-based service and Juniper ATP. Further, it offers Junos OS, a network operating system; Contrail networking, which provides an open-source and standards-based platform for SDN; Mist AI-driven Wired, Wireless, and WAN assurance solutions to set and measure key metrics; Mist AI-driven Marvis Virtual Network Assistant, which identifies the root cause of issues; Juniper Paragon Automation, a modular portfolio of cloud-native software applications; and Juniper Apstra to automate the network lifecycle in a single system. Additionally, the company provides software-as-a-service, technical support, maintenance, and professional services, as well as education and training programs. It sells its products through direct sales, distributors, value-added resellers, and original equipment manufacturers to end-users in the cloud, service provider, and enterprise markets. The company was incorporated in 1996 and is headquartered in Sunnyvale, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"Amcor plc","Symbol":"AMCR","Current Price":"9.54","Latest MA":"10.27","Price Target":11.29556,"Difference from MA":"-7.09%","Difference from Open":"-0.47%","Change from Yesterday":"-1.33%","Change from Last Report":"0.21","Latest Volume":"17,062,875","Market Cap":"13,795,770,368","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":12.022622,"PB Ratio":3.5182455,"Previous Close":9.72,"ROE":0.1958,"DTE":196.619,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":0.863,"Trailing PEG":1.9257,"Trailing PE":18.009436,"Trailing PS":1.018138,"Quick Ratio":0.591,"Day High":9.61,"Day Low":9.4,"VS Average Volume":1.0757225182,"Company Summary":"Amcor plc develops, produces, and sells packaging products in Europe, North America, Latin America, and the Asia Pacific. The company operates in two segments, Flexibles and Rigid Packaging. The Flexibles segment offers flexible and film packaging products in the food and beverage, medical and pharmaceutical, fresh produce, snack food, personal care, and other industries. The Rigid Packaging segment provides rigid containers for various beverage and food products, including carbonated soft drinks, water, juices, sports drinks, milk-based beverages, spirits and beer, sauces, dressings, spreads, and personal care items; and plastic caps for various applications. It sells its products through its direct sales force. The company was incorporated in 1926 and is headquartered in Zurich, Switzerland.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"Advanced Micro Devices, Inc.","Symbol":"AMD","Current Price":"114.45","Latest MA":"144.11","Price Target":168.42233,"Difference from MA":"-20.58%","Difference from Open":"0.70%","Change from Yesterday":"-1.27%","Change from Last Report":"0.20","Latest Volume":"23,023,124","Market Cap":"185,730,596,864","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":23.194778,"PB Ratio":3.2596622,"Previous Close":115.95,"ROE":0.03262,"DTE":3.927,"Industry":"Semiconductors","Sector":"Technology","Beta":1.706,"Trailing PEG":0.3206,"Trailing PE":102.1875,"Trailing PS":7.6448073,"Quick Ratio":1.575,"Day High":115.16,"Day Low":112.98,"VS Average Volume":0.637754456,"Company Summary":"Advanced Micro Devices, Inc. operates as a semiconductor company worldwide. It operates through Data Center, Client, Gaming, and Embedded segments. The company offers x86 microprocessors and graphics processing units (GPUs) as an accelerated processing unit, chipsets, data center, and professional GPUs; and embedded processors, and semi-custom system-on-chip (SoC) products, microprocessor and SoC development services and technology, data processing unites, field programmable gate arrays (FPGA), and adaptive SoC products. It provides processors under the AMD Ryzen, AMD Ryzen PRO, Ryzen Threadripper, Ryzen Threadripper PRO, AMD Athlon, AMD Athlon PRO, and AMD PRO A-Series brand names; graphics under the AMD Radeon graphics and AMD Embedded Radeon graphics; and professional graphics under the AMD Radeon Pro graphics brand name. In addition, the company offers data center graphics under the Radeon Instinct and Radeon PRO V-series brands, as well as servers under the AMD Instinct accelerators brand; server microprocessors under the AMD EPYC brands; low power solutions under the AMD Athlon, AMD Geode, AMD Ryzen, AMD EPYC, AMD R-Series, and G-Series brands; FPGA products under the Virtex-6, Virtex-7, Virtex UltraScale+, Kintex-7, Kintex UltraScale, Kintex UltraScale+, Artix-7, Artix UltraScale+, Spartan-6, and Spartan-7 brands; adaptive SOCs under the Zynq-7000, Zynq UltraScale+ MPSoC, Zynq UltraScale+ RFSoCs, Versal HBM, Versal Premium, Versal Prime, Versal AI Core, Versal AI Edge, Vitis, and Vivado brands; and compute and network acceleration board products under the Alveo brand. It serves original equipment and design manufacturers, public cloud service providers, system integrators, independent distributors, and add-in-board manufacturers through its direct sales force, and sales representatives. Advanced Micro Devices, Inc. was incorporated in 1969 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"Match Group, Inc.","Symbol":"MTCH","Current Price":"35.52","Latest MA":"34.24","Price Target":36.09261,"Difference from MA":"3.76%","Difference from Open":"1.12%","Change from Yesterday":"-0.69%","Change from Last Report":"-0.03","Latest Volume":"2,283,839","Market Cap":"8,920,008,704","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":10.608278,"PB Ratio":"N\/A","Previous Close":35.7,"ROE":"N\/A","DTE":"N\/A","Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.487,"Trailing PEG":0.5774,"Trailing PE":15.930493,"Trailing PS":2.5592313,"Quick Ratio":2.265,"Day High":35.86,"Day Low":35.1,"VS Average Volume":0.488774201,"Company Summary":"Match Group, Inc. engages in the provision of dating products. Its portfolio of brands includes Tinder, Hinge, Match, Meetic, OkCupid, Pairs, Plenty Of Fish, Azar, BLK, and Hakuna, as well as a various other brands, each built to increase users' likelihood of connecting with others. Its services are available in over 40 languages to users worldwide. The company was incorporated in 1986 and is based in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 21:07:29"},{"Company Name":"Electronic Arts Inc.","Symbol":"EA","Current Price":"122.53","Latest MA":"147.04","Price Target":148.46455,"Difference from MA":"-16.67%","Difference from Open":"0.41%","Change from Yesterday":"-0.29%","Change from Last Report":"-0.09","Latest Volume":"2,593,910","Market Cap":"32,136,099,840","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":15.346805,"PB Ratio":4.35257,"Previous Close":122.91,"ROE":0.13962,"DTE":29.954,"Industry":"Electronic Gaming & Multimedia","Sector":"Communication Services","Beta":0.781,"Trailing PEG":1.943,"Trailing PE":31.417742,"Trailing PS":4.337441,"Quick Ratio":1.283,"Day High":123.48,"Day Low":120.5761,"VS Average Volume":0.9660795252,"Company Summary":"Electronic Arts Inc. develops, markets, publishes, and delivers games, content, and services for game consoles, PCs, mobile phones, and tablets worldwide. It develops and publishes games and services across various genres, such as sports, racing, first-person shooter, action, role-playing, and simulation through owned and licensed brands, such as EA SPORTS FC, Battlefield, Apex Legends, The Sims, Madden NFL, Need for Speed, Titanfall, and F1 brands. The company licenses its games to third parties to distribute and host its games and content. It markets and sells its games and services through digital distribution and retail channels, as well as directly to mass market retailers, specialty stores, and distribution arrangements. Electronic Arts Inc. was incorporated in 1982 and is headquartered in Redwood City, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 21:07:29"}]