[{"Company Name":"Dayforce, Inc.","Symbol":"DAY","Current Price":"67.02","Latest MA":"64.97","Price Target":83.17333,"Difference from MA":"3.15%","Difference from Open":"-0.01%","Change from Yesterday":"-6.58%","Change from Last Report":"-0.36","Latest Volume":"3,050,573","Market Cap":"10,569,053,184","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":24.576727,"PB Ratio":4.1375475,"Previous Close":71.74,"ROE":0.02194,"DTE":48.404,"Industry":"Software - Application","Sector":"Technology","Beta":1.271,"Trailing PEG":null,"Trailing PE":197.11763,"Trailing PS":6.2372694,"Quick Ratio":0.175,"Day High":68.1,"Day Low":63.07,"VS Average Volume":2.0318122026,"Company Summary":"Dayforce Inc., together with its subsidiaries, operates as a human capital management (HCM) software company in the United States, Canada, and internationally. It offers Dayforce, a cloud HCM platform that provides human resources, payroll and tax, workforce management, wallet, benefits, and talent intelligence functionalities; and Powerpay, a cloud HR and payroll solution for the small business market. The company also provides payroll and payroll-related services; and implementation and professional services. It sells its solutions through direct sales force and third-party channels. The company was formerly known as Ceridian HCM Holding Inc. and changed its name to Dayforce Inc. in February 2024. Dayforce Inc. was founded in 1992 and is headquartered in Minneapolis, Minnesota.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"New York Times Company (The)","Symbol":"NYT","Current Price":"49.32","Latest MA":"53.82","Price Target":57.12333,"Difference from MA":"-8.36%","Difference from Open":"-7.38%","Change from Yesterday":"-11.76%","Change from Last Report":"-0.01","Latest Volume":"2,880,764","Market Cap":"8,086,211,072","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":21.229795,"PB Ratio":4.369629,"Previous Close":55.89,"ROE":0.15986,"DTE":"N\/A","Industry":"Publishing","Sector":"Communication Services","Beta":1.019,"Trailing PEG":null,"Trailing PE":29.183432,"Trailing PS":3.2227473,"Quick Ratio":1.157,"Day High":53.56,"Day Low":48.35,"VS Average Volume":2.0351104744,"Company Summary":"The New York Times Company, together with its subsidiaries, creates, collects, and distributes news and information worldwide. The company operates through two segments, The New York Times Group and The Athletic. It offers The New York Times (The Times) through company's mobile application, website, printed newspaper, and associated content, such as podcast. The company also offers The Athletic, a sports media product; Cooking, a recipe product; Games, a puzzle games product; and Audio, an audio product. In addition, it offers a portfolio of advertising products and services to advertisers, such as luxury goods, technology, and financial companies, to promote products, services or brands on digital platforms in the form of display ads, audio and video, in print in the form of column-inch ads, and at live events; and Wirecutter, a product review and recommendation product. Further, the company licenses content to digital aggregators in the business, professional, academic and library markets, and third-party digital platforms; articles, graphics, and photographs, including newspapers, magazines, and websites; and for use in television, films, and books, as well as provide rights to reprint articles, and create and sell new digests. Additionally, it engages in commercial printing and distribution for third parties; and operates the NYTimes.com website. The company was founded in 1851 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"Fiserv, Inc.","Symbol":"FI","Current Price":"228.34","Latest MA":"188.61","Price Target":234.87941,"Difference from MA":"21.06%","Difference from Open":"1.75%","Change from Yesterday":"6.59%","Change from Last Report":"0.01","Latest Volume":"2,762,097","Market Cap":"129,906,958,336","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":19.126436,"PB Ratio":4.6900544,"Previous Close":214.22,"ROE":0.10618,"DTE":89.406,"Industry":"Information Technology Services","Sector":"Technology","Beta":0.919,"Trailing PEG":1.4412,"Trailing PE":44.08108,"Trailing PS":6.455967,"Quick Ratio":0.215,"Day High":231.2099,"Day Low":221.7,"VS Average Volume":1.0279608942,"Company Summary":"Fiserv, Inc., together with its subsidiaries, provides payments and financial services technology services in the United States, Europe, the Middle East and Africa, Latin America, the Asia-Pacific, and internationally. It operates through Merchant Acceptance, Financial Technology, and Payments and Network segments. The Merchant Acceptance segment provides merchant acquiring and digital commerce services; mobile payment services; security and fraud protection products; Clover, a cloud based POS and integrated commerce operating system for small and mid-sized businesses and independent software vendors; and Carat, an integrated operating system for large businesses. This segment distributes through various channels, including direct sales teams, strategic partnerships with agent sales forces, independent software vendors, financial institutions, and other strategic partners in the form of joint venture alliances, revenue sharing alliances, and referral agreement. The Financial Technology segment offers customer deposit and loan accounts, as well as manages an institution's general ledger and central information files. This segment also provides digital banking, financial and risk management, professional services and consulting, check processing, and other products and services. The Payments and Network segment offers card transactions, such as debit, credit, and prepaid card processing and services; funds access, debit payments, cardless ATM access, and surcharge-free ATM network; security and fraud protection products; card production; print services; and various network services, as well as non-card digital payment software and services, including bill payment, account-to-account transfers, person-to-person payments, electronic billing, and security and fraud protection products. It serves merchants, banks, credit unions, other financial institutions, and corporate clients. Fiserv, Inc. was incorporated in 1984 and is headquartered in Milwaukee, Wisconsin.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"CDW Corporation","Symbol":"CDW","Current Price":"211.06","Latest MA":"204.60","Price Target":221.74727,"Difference from MA":"3.15%","Difference from Open":"-5.32%","Change from Yesterday":"5.88%","Change from Last Report":"0.22","Latest Volume":"2,128,486","Market Cap":"28,126,031,872","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":19.302475,"PB Ratio":11.966604,"Previous Close":199.34,"ROE":0.53360003,"DTE":278.653,"Industry":"Information Technology Services","Sector":"Technology","Beta":1.053,"Trailing PEG":null,"Trailing PE":25.832924,"Trailing PS":1.3501879,"Quick Ratio":1.221,"Day High":222.92,"Day Low":204.17,"VS Average Volume":1.5365256605,"Company Summary":"CDW Corporation provides information technology (IT) solutions in the United States, the United Kingdom, and Canada. It operates through three segments: Corporate, Small Business, and Public. The company offers discrete hardware and software products and services, as well as integrated IT solutions, including on-premise and cloud capabilities across hybrid infrastructure, digital experience, and security. It also provides hardware products comprising notebooks\/mobile devices, tablets, network communications, desktop computers, collaboration, data storage and servers, and others; and software products, such as cloud solutions, software assurance, application suites, security, virtualization, operating systems, and network management. In addition, the company offers advisory and design, software development, implementation, managed, professional, configuration, partner, and telecom services, as well as warranties; delivers and manages mission critical software, systems, and network solutions; and implementation and installation, and repair services to its customers through various third-party service providers. It serves government, education, and healthcare customers; and small, medium, and large business customers. CDW Corporation was formerly known as CDW Computer Centers, Inc. and changed its name to CDW Corporation in June 2003. The company was founded in 1984 and is based in Vernon Hills, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"Uber Technologies, Inc.","Symbol":"UBER","Current Price":"64.88","Latest MA":"70.27","Price Target":88.6338,"Difference from MA":"-7.67%","Difference from Open":"-2.44%","Change from Yesterday":"-6.98%","Change from Last Report":"-0.12","Latest Volume":"48,429,105","Market Cap":"136,618,459,136","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":16.024897,"PB Ratio":9.236901,"Previous Close":69.75,"ROE":0.34326,"DTE":80.343,"Industry":"Software - Application","Sector":"Technology","Beta":1.337,"Trailing PEG":0.7384,"Trailing PE":31.96059,"Trailing PS":3.2563093,"Quick Ratio":1.223,"Day High":66.75,"Day Low":63.65,"VS Average Volume":1.9013831355,"Company Summary":"Uber Technologies, Inc. develops and operates proprietary technology applications in the United States, Canada, Latin America, Europe, the Middle East, Africa, and Asia excluding China and Southeast Asia. It operates through three segments: Mobility, Delivery, and Freight. The Mobility segment connects consumers with a range of transportation modalities, such as ridesharing, carsharing, micromobility, rentals, public transit, taxis, and other modalities; and offers riders in a variety of vehicle types, as well as financial partnerships products and advertising services. The Delivery segment allows to search for and discover restaurants to grocery, alcohol, convenience, and other retails; order a meal or other items; and Uber direct, a white-label Delivery-as-a-Service for retailers and restaurants, as well as advertising. The Freight segment manages transportation and logistics network, which connects shippers and carriers in digital marketplace including carriers upfronts, pricing, and shipment booking; and provides on-demand platform to automate logistics end-to-end transactions for small-and medium-sized business to global enterprises. The company was formerly known as Ubercab, Inc. and changed its name to Uber Technologies, Inc. in February 2011. Uber Technologies, Inc. was founded in 2009 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"Stanley Black & Decker, Inc.","Symbol":"SWK","Current Price":"84.87","Latest MA":"92.19","Price Target":101.73,"Difference from MA":"-7.94%","Difference from Open":"2.25%","Change from Yesterday":"-2.12%","Change from Last Report":"0.11","Latest Volume":"2,559,532","Market Cap":"13,083,898,880","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":12.412468,"PB Ratio":1.4767191,"Previous Close":86.66,"ROE":-0.02031,"DTE":79.081,"Industry":"Tools & Accessories","Sector":"Industrials","Beta":1.255,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.85061467,"Quick Ratio":0.34,"Day High":85.0908,"Day Low":82.087,"VS Average Volume":1.4713903099,"Company Summary":"Stanley Black & Decker, Inc. provides hand tools, power tools, outdoor products, and related accessories in the United States, Canada, Other Americas, Europe, and Asia. Its Tools & Outdoor segment offers professional grade corded and cordless electric power tools and equipment, including drills, impact wrenches and drivers, grinders, saws, routers, and sanders; pneumatic tools and fasteners, such as nail guns, nails, staplers and staples, and concrete and masonry anchors; corded and cordless electric power tools; hand-held vacuums, paint tools, and cleaning appliances; leveling and layout tools, planes, hammers, demolition tools, clamps, vises, knives, saws, chisels, and industrial and automotive tools; drill, screwdriver, router bits, abrasives, saw blades, and threading products; tool boxes, sawhorses, medical cabinets, and engineered storage solutions; and electric and gas-powered lawn and garden products. This segment sells its products under the DEWALT, CRAFTSMAN, CUB ADET, BLACK+DECKER, and HUSTLER brands through retailers, third-party distributors, independent dealers, and a direct sales force. The company's Industrial segment provides threaded fasteners, blind rivets and tools, blind inserts and tools, drawn arc weld studs and systems, engineered plastic and mechanical fasteners, self-piercing riveting systems, precision nut running systems, micro fasteners, high-strength structural fasteners, axel swage, latches, heat shields, pins, couplings, fitting, and other engineered products; and attachments used on excavators and handheld tools. This segment sells its products through direct sales force and third-party distributors to the automotive, manufacturing, electronics, construction, aerospace, and other industries. The company was formerly known as The Stanley Works and changed its name to Stanley Black & Decker, Inc. in March 2010. Stanley Black & Decker, Inc. was founded in 1843 and is headquartered in New Britain, Connecticut.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"Coherent Corp.","Symbol":"COHR","Current Price":"92.12","Latest MA":"88.62","Price Target":112.86111,"Difference from MA":"3.95%","Difference from Open":"3.96%","Change from Yesterday":"4.99%","Change from Last Report":"-0.04","Latest Volume":"2,228,058","Market Cap":"14,247,261,184","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":21.21907,"PB Ratio":2.5874248,"Previous Close":87.74,"ROE":-0.00863,"DTE":50.88,"Industry":"Scientific & Technical Instruments","Sector":"Technology","Beta":1.654,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":2.8478916,"Quick Ratio":1.371,"Day High":92.76,"Day Low":88.03,"VS Average Volume":0.7625517438,"Company Summary":"Coherent Corp. develops, manufactures, and markets engineered materials, optoelectronic components and devices, and optical and laser systems and subsystems for the use in the industrial, communications, electronics, and instrumentation markets worldwide. It operates through three segments: Networking, Materials, and Lasers. The Networking segment offers telecommunication products for fiber-optic transmission; datacom transceivers, including pluggable transceivers for ethernet and fiber channel applications; and advanced optics, such as fiber and precision optics used in projection displays, crystal materials and components for optical communications, filters and assemblies for life sciences, sensors, instrumentation, and semiconductor equipment, as well as ultraviolet (UV), visible, and near-infrared spectroscopy optics for industrial lasers. The Materials segments provides laser optics and accessories; infrared thermal imaging optics and assemblies; polycrystalline materials; thermoelectric components, subassemblies, and systems; ceramic and metal-matrix composite products; semiconductor lasers and laser bars; Q-switched laser modules, uncooled pump laser modules, and laser systems for superhard materials processing; laser processing heads and beam delivery systems; EELs, VCSELs, and detectors; pumps for amplifiers; precision optical assemblies, infrared optics, thin-film coatings and optical materials; optical solutions; and integrated circuits for transceivers. The Lasers segment offers UV gas and solid-state lasers; UV optical systems, line beams, and mask-based imaging systems; UV nanosecond lasers; continuous-wave lasers and systems; amplifiers; subsystems and standard systems; IR lasers; crystals and diode lasers, and specialty polishing and coating solutions. The company was formerly known as II-VI Incorporated and changed its name to Coherent Corp. in September 2022. Coherent Corp. was incorporated in 1971 and is headquartered in Saxonburg, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"Corteva, Inc.","Symbol":"CTVA","Current Price":"64.82","Latest MA":"57.49","Price Target":67.09091,"Difference from MA":"12.76%","Difference from Open":"2.31%","Change from Yesterday":"-1.33%","Change from Last Report":"0.04","Latest Volume":"2,350,294","Market Cap":"44,550,815,744","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.33157,"PB Ratio":1.8058923,"Previous Close":65.7,"ROE":0.02704,"DTE":22.883,"Industry":"Agricultural Inputs","Sector":"Basic Materials","Beta":0.773,"Trailing PEG":1.3118,"Trailing PE":67.52157,"Trailing PS":2.6778154,"Quick Ratio":0.88,"Day High":65.01,"Day Low":63.18,"VS Average Volume":0.6737053862,"Company Summary":"Corteva, Inc. operates in the agriculture business. It operates through two segments, Seed and Crop Protection. The Seed segment develops and supplies advanced germplasm and traits that produce optimum yield for farms. It offers trait technologies that enhance resistance to weather, disease, insects, and herbicides used to control weeds, as well as food and nutritional characteristics. This segment also provides digital solutions that assist farmer decision-making with a view to optimize product selection, and maximize yield and profitability. The Crop Protection segment offers products that protect against weeds, insects and other pests, and diseases, as well as enhances crop health above and below ground through nitrogen management and seed-applied technologies. This segment provides herbicides, insecticides, nitrogen stabilizers, and pasture and range management herbicides. It serves agricultural input industry. The company operates in the United States, Canada, Latin America, the Asia Pacific, Europe, the Middle East, and Africa. Corteva, Inc. was incorporated in 2018 and is headquartered in Indianapolis, Indiana.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"Johnson Controls International ","Symbol":"JCI","Current Price":"86.64","Latest MA":"75.53","Price Target":88.53333,"Difference from MA":"14.71%","Difference from Open":"-0.55%","Change from Yesterday":"12.09%","Change from Last Report":"-0.09","Latest Volume":"5,781,900","Market Cap":"57,191,145,472","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":21.269154,"PB Ratio":3.5804026,"Previous Close":77.29,"ROE":0.0805,"DTE":54.68,"Industry":"Building Products & Equipment","Sector":"Industrials","Beta":1.306,"Trailing PEG":1.318,"Trailing PE":41.651443,"Trailing PS":2.4917717,"Quick Ratio":0.557,"Day High":88.9,"Day Low":85.41,"VS Average Volume":1.5447536113,"Company Summary":"Johnson Controls International plc, together with its subsidiaries, engages in engineering, manufacturing, commissioning, and retrofitting building products and systems in the United States, Europe, the Asia Pacific, and internationally. It operates through four segments: Building Solutions North America, Building Solutions EMEA\/LA, Building Solutions Asia Pacific, and Global Products. The company designs, sells, installs, and services heating, ventilating, air conditioning, controls, building management, refrigeration, integrated electronic security, integrated fire detection and suppression systems, and fire protection and security products. It also provides energy efficiency solutions and technical services, including inspection, scheduled maintenance, and repair and replacement of mechanical and control systems, as well as data-driven smart building solutions. In addition, the company offers control software and software services. It sells its products and services to commercial, institutional, industrial, data center, and governmental customers. Johnson Controls International plc was incorporated in 1885 and is headquartered in Cork, Ireland.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"Ares Capital Corporation","Symbol":"ARCC","Current Price":"22.82","Latest MA":"20.93","Price Target":22.82143,"Difference from MA":"9.03%","Difference from Open":"-2.85%","Change from Yesterday":"-4.12%","Change from Last Report":"0.07","Latest Volume":"9,556,655","Market Cap":"15,304,825,856","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":10.568484,"PB Ratio":1.1541574,"Previous Close":23.81,"ROE":0.1338,"DTE":106.255,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.054,"Trailing PEG":null,"Trailing PE":8.776923,"Trailing PS":5.209267,"Quick Ratio":1.29,"Day High":23.5759,"Day Low":22.46,"VS Average Volume":2.1219775938,"Company Summary":"Ares Capital Corporation is a business development company specializing in acquisition, recapitalization, mezzanine debt, restructurings, rescue financing, and leveraged buyout transactions of middle market companies. It also makes growth capital and general refinancing. It prefers to make investments in companies engaged in the basic and growth manufacturing, business services, consumer products, health care products and services, and information technology service sectors. The fund will also consider investments in industries such as restaurants, retail, oil and gas, and technology sectors. It focuses on investments in Northeast, Mid-Atlantic, Southeast and Southwest regions from its New York office, the Midwest region, from the Chicago office, and the Western region from the Los Angeles office. The fund typically invests between $20 million and $200 million and a maximum of $400 million in companies with an EBITDA between $10 million and $250 million. It makes debt investments between $10 million and $100 million The fund invests through revolvers, first lien loans, warrants, unitranche structures, second lien loans, mezzanine debt, private high yield, junior capital, subordinated debt, and non-control preferred and common equity. The fund also selectively considers third-party-led senior and subordinated debt financings and opportunistically considers the purchase of stressed and discounted debt positions. The fund prefers to be an agent and\/or lead the transactions in which it invests. The fund also seeks board representation in its portfolio companies.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"Boston Scientific Corporation","Symbol":"BSX","Current Price":"105.13","Latest MA":"85.80","Price Target":103.49156,"Difference from MA":"22.53%","Difference from Open":"2.13%","Change from Yesterday":"1.53%","Change from Last Report":"-0.10","Latest Volume":"4,153,698","Market Cap":"154,943,750,144","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":32.93443,"PB Ratio":7.4804325,"Previous Close":103.54,"ROE":0.08916,"DTE":53.722,"Industry":"Medical Devices","Sector":"Healthcare","Beta":0.797,"Trailing PEG":1.8771,"Trailing PE":86.88429,"Trailing PS":9.7381525,"Quick Ratio":0.847,"Day High":107.17,"Day Low":102.44,"VS Average Volume":0.7817424828,"Company Summary":"Boston Scientific Corporation develops, manufactures, and markets medical devices for use in various interventional medical specialties worldwide. It operates through two segments, MedSurg and Cardiovascular. The company offers devices to diagnose and treat gastrointestinal and pulmonary conditions, such as resolution clips, biliary stent systems, stents and electrocautery enhanced delivery systems, direct visualization systems, digital catheters, and single-use duodenoscopes; devices to treat urological conditions, including ureteral stents, catheters, baskets, guidewires, sheaths, balloons, single-use digital flexible ureteroscopes, holmium laser systems, artificial urinary sphincter, laser system, fiber, and hydrogel systems; and devices to treat neurological movement disorders and manage chronic pain, such as spinal cord stimulator system, proprietary programming software, radiofrequency generator, indirect decompression systems, practice optimization tools, and deep brain stimulation system. It also provides technologies for diagnosing and treating coronary artery disease and aortic valve conditions; WATCHMAN FLX, a Left Atrial Appendage Closure Device; and implantable devices that monitor the heart and deliver electricity to treat cardiac abnormalities, such as cardioverter and cardiac resynchronization therapy defibrillators, MRI S-ICD systems, cardiac resynchronization therapy pacemakers, quadripolar LV leads, ICD leads, pacing leads, remote patient management systems, insertable cardiac monitor systems, and remote cardiac monitoring systems. In addition, the company offers diagnosis and treatment of rate and rhythm disorders of the heart; peripheral arterial and venous diseases; and products to diagnose, treat and ease forms of cancer. The company was incorporated in 1979 and is headquartered in Marlborough, Massachusetts.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"Ford Motor Company","Symbol":"F","Current Price":"10.17","Latest MA":"10.76","Price Target":11.68125,"Difference from MA":"-5.47%","Difference from Open":"0.10%","Change from Yesterday":"0.15%","Change from Last Report":"-0.15","Latest Volume":"43,896,957","Market Cap":"40,418,926,592","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":6.113088,"PB Ratio":0.91211665,"Previous Close":10.16,"ROE":0.0799,"DTE":359.359,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":1.636,"Trailing PEG":0.8816,"Trailing PE":11.556932,"Trailing PS":0.22117905,"Quick Ratio":0.942,"Day High":10.31,"Day Low":10.11,"VS Average Volume":0.713718971,"Company Summary":"Ford Motor Company develops, delivers, and services a range of Ford trucks, commercial cars and vans, sport utility vehicles, and Lincoln luxury vehicles worldwide. It operates through Ford Blue, Ford Model e, and Ford Pro; Ford Next; and Ford Credit segments. The company sells Ford and Lincoln vehicles, service parts, and accessories through distributors and dealers, as well as through dealerships to commercial fleet customers, daily rental car companies, and governments. It also engages in vehicle-related financing and leasing activities to and through automotive dealers. In addition, the company provides retail installment sale contracts for new and used vehicles; and direct financing leases for new vehicles to retail and commercial customers, such as leasing companies, government entities, daily rental companies, and fleet customers. Further, it offers wholesale loans to dealers to finance the purchase of vehicle inventory; and loans to dealers to finance working capital and enhance dealership facilities, purchase dealership real estate, and other dealer vehicle programs. The company was incorporated in 1903 and is based in Dearborn, Michigan.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"Emerson Electric Company","Symbol":"EMR","Current Price":"124.24","Latest MA":"115.75","Price Target":140.54308,"Difference from MA":"7.34%","Difference from Open":"-2.20%","Change from Yesterday":"-2.70%","Change from Last Report":"-0.06","Latest Volume":"2,082,424","Market Cap":"70,758,531,072","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":19.159416,"PB Ratio":3.2742126,"Previous Close":127.69,"ROE":0.05933,"DTE":30.376,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":1.292,"Trailing PEG":null,"Trailing PE":44.056736,"Trailing PS":4.0451937,"Quick Ratio":1.323,"Day High":127.05,"Day Low":122.37,"VS Average Volume":0.6749506855,"Company Summary":"Emerson Electric Co., a technology and software company, provides various solutions in the Americas, Asia, the Middle East, Africa, and Europe. It operates through seven segments: Final Control, Measurement & Analytical, Discrete Automation, Safety & Productivity, Control Systems & Software, Test & Measurement, and AspenTech. The Final Control segment provides control, isolation, shutoff, pressure relief, and pressure safety valves, actuators, and regulators for process and hybrid industries. The Measurement & Analytical segment offers intelligent instrumentation measuring the physical properties of liquids or gases, such as pressure, temperature, level, flow, acoustics, corrosion, pH, conductivity, water quality, toxic gases, and flame. The Discrete Automation segment offers solenoid and pneumatic valves, valve position indicators, pneumatic cylinders, actuators, air preparation equipment, pressure and temperature switches, electric linear motion solutions, programmable automation control systems, electrical distribution equipment, and materials joining solutions. The Safety & Productivity segment offers tools for professionals and homeowners; pipe-working tools, including pipe wrenches, pipe cutters, pipe threading and roll grooving equipment, battery hydraulic tools; electrical tools; and other professional tools. The Control Systems & Software segment provides control systems, safety instrumented systems, SCADA systems, application software, digital twins, asset performance management, and cybersecurity. The Test & Measurement provides software-connected automated test and measurement systems. The AspenTech segment provides asset optimization software that enables industrial manufacturers to design, operate, and maintain operations for enhancing performance through a combination of decades of modeling, simulation, and optimization capabilities. The company was incorporated in 1890 and is based in Saint Louis, Missouri.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"Walt Disney Company (The)","Symbol":"DIS","Current Price":"111.34","Latest MA":"100.05","Price Target":124.56071,"Difference from MA":"11.29%","Difference from Open":"-3.77%","Change from Yesterday":"-1.73%","Change from Last Report":"-0.24","Latest Volume":"12,570,240","Market Cap":"201,357,377,536","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":18.264748,"PB Ratio":2.0094552,"Previous Close":113.3,"ROE":0.0546,"DTE":45.188,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.398,"Trailing PEG":0.9948,"Trailing PE":40.934525,"Trailing PS":2.2366083,"Quick Ratio":0.531,"Day High":118.58,"Day Low":110.76,"VS Average Volume":1.3414411605,"Company Summary":"The Walt Disney Company operates as an entertainment company worldwide. It operates through three segments: Entertainment, Sports, and Experiences. The company produces and distributes film and television video streaming content under the ABC Television Network, Disney, Freeform, FX, Fox, National Geographic, and Star brand television channels, as well as ABC television stations and A+E television networks; and produces original content under the ABC Signature, Disney Branded Television, FX Productions, Lucasfilm, Marvel, National Geographic Studios, Pixar, Searchlight Pictures, Twentieth Century Studios, 20th Television, and Walt Disney Pictures banners. It also offers direct-to-consumer streaming services through Disney+, Disney+ Hotstar, Hulu, and Star+; sports-related entertainment services through ESPN, ESPN on ABC, ESPN+ DTC, and Star; sale\/licensing of film and episodic content to third-party television and VOD services; theatrical, home entertainment, and music distribution services; DVD and Blu-ray discs, electronic home video licenses, and VOD rental services; staging and licensing of live entertainment events; and post-production services. In addition, the company operates theme parks and resorts comprising Walt Disney World Resort, Disneyland Resort, Disneyland Paris, Hong Kong Disneyland Resort, Shanghai Disney Resort, Disney Cruise Line, Disney Vacation Club, National Geographic Expeditions, and Adventures by Disney, as well as Aulani, a Disney resort and spa in Hawaii. It also licenses its intellectual property to a third party for operations of the Tokyo Disney Resort; licenses trade names, characters, visual, literary, and other IP for use on merchandise, published materials, and games; operates a direct-to-home satellite distribution platform; sells branded merchandise through retail, online, and wholesale businesses; and develops and publishes books, comic books, and magazines. The company was founded in 1923 and is based in Burbank, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"Pepsico, Inc.","Symbol":"PEP","Current Price":"144.61","Latest MA":"163.35","Price Target":167.30228,"Difference from MA":"-11.47%","Difference from Open":"0.86%","Change from Yesterday":"0.78%","Change from Last Report":"0.07","Latest Volume":"3,554,325","Market Cap":"198,332,612,608","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":16.219957,"PB Ratio":10.206804,"Previous Close":143.49,"ROE":0.48819,"DTE":229.605,"Industry":"Beverages - Non-Alcoholic","Sector":"Consumer Defensive","Beta":0.542,"Trailing PEG":1.7281,"Trailing PE":20.837175,"Trailing PS":2.1576655,"Quick Ratio":0.664,"Day High":144.89,"Day Low":142.7,"VS Average Volume":0.5542974711,"Company Summary":"PepsiCo, Inc. engages in the manufacture, marketing, distribution, and sale of various beverages and convenient foods worldwide. The company operates through seven segments: Frito-Lay North America; Quaker Foods North America; PepsiCo Beverages North America; Latin America; Europe; Africa, Middle East and South Asia; and Asia Pacific, Australia and New Zealand and China Region. It provides dips, cheese-flavored snacks, and spreads, as well as corn, potato, and tortilla chips; cereals, rice, pasta, mixes and syrups, granola bars, grits, oatmeal, rice cakes, and side dishes; beverage concentrates, fountain syrups, and finished goods; ready-to-drink tea, coffee, and juices; dairy products; and sparkling water makers and related products, as well as distributes alcoholic beverages under Hard MTN Dew brand. The company offers its products primarily under the Lay's, Doritos, Fritos, Tostitos, BaiCaoWei, Cheetos, Cap'n Crunch, Life, Pearl Milling Company, Gatorade, Pepsi-Cola, Mountain Dew, Quaker, Rice-A-Roni, Aquafina, Bubly, Emperador, Diet Mountain Dew, Diet Pepsi, Gatorade Zero, Crush, Propel, Dr Pepper, Schweppes, Marias Gamesa, Ruffles, Sabritas, Saladitas, Tostitos, 7UP, Diet 7UP, H2oh!, Manzanita Sol, Mirinda, Pepsi Black, Pepsi Max, San Carlos, Toddy, Walkers, Chipsy, Kurkure, Sasko, Spekko, White Star, Smith's, Sting, SodaStream, Lubimyj Sad, Agusha, Chudo, Domik v Derevne, Lipton, and other brands. It serves wholesale and other distributors, foodservice customers, grocery stores, drug stores, convenience stores, discount\/dollar stores, mass merchandisers, membership stores, hard discounters, e-commerce retailers and authorized independent bottlers, and others through a network of direct-store-delivery, customer warehouse, and distributor networks, as well as directly to consumers through e-commerce platforms and retailers. The company was founded in 1898 and is based in Purchase, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"NOV Inc.","Symbol":"NOV","Current Price":"16.36","Latest MA":"16.31","Price Target":18.91667,"Difference from MA":"0.30%","Difference from Open":"1.08%","Change from Yesterday":"12.09%","Change from Last Report":"0.03","Latest Volume":"5,943,443","Market Cap":"6,363,468,800","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":10.301324,"PB Ratio":0.9844699,"Previous Close":14.58,"ROE":0.17694001,"DTE":36.848,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.674,"Trailing PEG":null,"Trailing PE":6.057407,"Trailing PS":0.714595,"Quick Ratio":1.55,"Day High":16.45,"Day Low":15.22,"VS Average Volume":1.5135669718,"Company Summary":"NOV Inc. designs, constructs, manufactures, and sells systems, components, and products for oil and gas drilling and production, and industrial and renewable energy sectors in the United States and internationally. It operates through two segments, Energy Equipment, and Energy Products and Services. The company provides solids control and waste management equipment and services, managed pressure drilling, drilling fluids, premium drillpipe, wired pipe, drilling optimization services, tubular inspection and coating services, instrumentation, downhole tools, and drill bits. It also offers equipment and technologies for hydraulic fracture stimulation, including downhole multistage fracturing tools, pressure pumping trucks, blenders, sanders, hydration and injection units, flowline, and manifolds; coiled tubing units, and wireline units and tools; connections and liner hangers; onshore production consists of composite pipe, surface transfer and progressive cavity pumps, and artificial lift systems; and offshore production, such as floating production systems and subsea production technologies, as well as manufactures industrial pumps and mixers. In addition, the company provides substructures, derricks, and masts; cranes; jacking systems; pipe lifting, racking, rotating, and assembly systems; mud pumps; pressure control equipment; drives and generators; rig instrumentation and control systems; mooring, anchor, and deck handling machinery; equipment components for offshore wind construction vessels; and pipelay and construction systems. Further, the company offers spare parts, repair, and rentals as well as comprehensive remote equipment monitoring, technical support, field service, and customer training. The company was formerly known as National Oilwell Varco, Inc. and changed its name to NOV Inc. in January 2021. NOV Inc. was founded in 1862 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"Lumen Technologies, Inc.","Symbol":"LUMN","Current Price":"4.87","Latest MA":"5.58","Price Target":5.37091,"Difference from MA":"-12.76%","Difference from Open":"-11.21%","Change from Yesterday":"-3.37%","Change from Last Report":"-0.51","Latest Volume":"18,571,641","Market Cap":"4,942,124,544","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":-8.262919,"PB Ratio":14.451037,"Previous Close":5.04,"ROE":-1.6673199,"DTE":5502.924,"Industry":"Telecom Services","Sector":"Communication Services","Beta":1.201,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.3717001,"Quick Ratio":0.988,"Day High":5.51,"Day Low":4.75,"VS Average Volume":1.350607436,"Company Summary":"Lumen Technologies, Inc., a facilities-based technology and communications company, provides various integrated products and services to business and residential customers in the United States and internationally. The company operates in two segments, Business and Mass Markets. It offers dark fiber, edge cloud services, internet protocol, managed security, software-defined wide area networks, secure access service edge, unified communications and collaboration, and optical wavelengths services; ethernet and VPN data networks services; and legacy services to manage cash flow, including time division multiplexing voice, private line, and other legacy services, as well as sells communication equipment, and IT solutions. The company also provides high speed and lower speed broadband service to residential and small business customers; local and long-distance voice services, professional services, and other ancillary services; and federal broadband and state support programs. It serves its products and services under the Lumen, Quantum Fiber, and CenturyLink brands. The company was formerly known as CenturyLink, Inc. and changed its name to Lumen Technologies, Inc. in September 2020. Lumen Technologies, Inc. was incorporated in 1968 and is headquartered in Monroe, Louisiana.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"FMC Corporation","Symbol":"FMC","Current Price":"35.79","Latest MA":"57.90","Price Target":61.39556,"Difference from MA":"-38.18%","Difference from Open":"-0.35%","Change from Yesterday":"-33.78%","Change from Last Report":"0.33","Latest Volume":"15,972,784","Market Cap":"4,468,491,776","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.5470014,"PB Ratio":0.9697624,"Previous Close":54.04,"ROE":0.38454,"DTE":90.927,"Industry":"Agricultural Inputs","Sector":"Basic Materials","Beta":0.853,"Trailing PEG":null,"Trailing PE":2.9364152,"Trailing PS":1.0721207,"Quick Ratio":0.922,"Day High":36.36,"Day Low":34.0001,"VS Average Volume":10.9998657107,"Company Summary":"FMC Corporation, an agricultural sciences company, provides crop protection, plant health, and professional pest and turf management products. It develops, markets, and sells crop protection chemicals that includes insecticides, herbicides, and fungicides; and biologicals, crop nutrition, and seed treatment products, which are used in agriculture to enhance crop yield and quality by controlling a range of insects, weeds, and diseases, as well as in non-agricultural markets for pest control. The company markets its products through its own sales organization and through alliance partners, independent distributors, and sales representatives. It operates in North America, Latin America, Europe, the Middle East, Africa, and Asia. The company was founded in 1883 and is headquartered in Philadelphia, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"Graphic Packaging Holding Compa","Symbol":"GPK","Current Price":"26.82","Latest MA":"28.38","Price Target":31.80909,"Difference from MA":"-5.48%","Difference from Open":"0.71%","Change from Yesterday":"1.06%","Change from Last Report":"0.00","Latest Volume":"3,015,412","Market Cap":"8,050,371,584","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":9.34586,"PB Ratio":2.6753118,"Previous Close":26.54,"ROE":0.25792998,"DTE":179.442,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":0.841,"Trailing PEG":null,"Trailing PE":12.416666,"Trailing PS":0.8983787,"Quick Ratio":0.634,"Day High":26.98,"Day Low":26.5,"VS Average Volume":1.4720140747,"Company Summary":"Graphic Packaging Holding Company, together with its subsidiaries, designs, produces, and sells consumer packaging products to brands in food, beverage, foodservice, household, and other consumer products. It operates through three segments: Paperboard Manufacturing, Americas Paperboard Packaging, and Europe Paperboard Packaging. The company offers unbleached, bleached, and recycled paperboard to various paperboard packaging converters and brokers. It also provides paperboard packaging products for consumer packaged goods companies; and cups, lids, and food containers for foodservice companies and quick-service restaurants serving the food, beverage, and consumer product markets, including healthcare and beauty. The company also designs, manufactures, and installs specialized packaging machines. The company sells its products through sales offices, as well as through broker arrangements with third parties in the Americas, Europe, and the Asia Pacific. Graphic Packaging Holding Company was incorporated in 2007 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"Pfizer, Inc.","Symbol":"PFE","Current Price":"26.38","Latest MA":"27.16","Price Target":30.94773,"Difference from MA":"-2.90%","Difference from Open":"1.64%","Change from Yesterday":"1.94%","Change from Last Report":"0.00","Latest Volume":"23,135,281","Market Cap":"149,466,857,472","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":8.683986,"PB Ratio":1.6192902,"Previous Close":25.87,"ROE":0.04538,"DTE":73.408,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.615,"Trailing PEG":0.1938,"Trailing PE":18.705675,"Trailing PS":2.5173364,"Quick Ratio":0.64,"Day High":26.69,"Day Low":25.7,"VS Average Volume":0.5318190471,"Company Summary":"Pfizer Inc. discovers, develops, manufactures, markets, distributes, and sells biopharmaceutical products in the United States, Europe, and internationally. The company offers medicines and vaccines in various therapeutic areas, including cardiovascular metabolic, migraine, and women's health under the Eliquis, Nurtec ODT\/Vydura, Zavzpret, and the Premarin family brands; infectious diseases with unmet medical needs under the Prevnar family, Abrysvo, Nimenrix, FSME\/IMMUN-TicoVac, and Trumenba brands; and COVID-19 prevention and treatment, and potential future mRNA and antiviral products under the Comirnaty and Paxlovid brands. It also provides medicines and vaccines in various therapeutic areas, such as biosimilars for chronic immune and inflammatory diseases under the Xeljanz, Enbrel, Inflectra, Litfulo, Velsipity, and Cibinqo brands; amyloidosis, hemophilia, endocrine diseases, and sickle cell disease under the Vyndaqel family, Oxbryta, BeneFIX, Somavert, Ngenla, and Genotropin brands; sterile injectable and anti-infective medicines under the Sulperazon, Medrol, Zavicefta, Zithromax, and Panzyga brands; and biologics, small molecules, immunotherapies, and biosimilars under the Ibrance, Xtandi, Inlyta, Bosulif, Mektovi, Padcev, Adcetris, Talzenna, Tukysa, Elrexfio, Tivdak, Lorbrena, and Braftovi brands. In addition, the company involved in the contract manufacturing business. It serves wholesalers, retailers, hospitals, clinics, government agencies, pharmacies, individual provider offices, retail pharmacies, and integrated delivery systems. The company has collaboration agreements with Bristol-Myers Squibb Company; Astellas Pharma US, Inc.; Merck KGaA; and BioNTech SE, as well as has strategic clinical collaboration with Acepodia Inc. for the development of antibody-cell conjugation-based cell therapies in autoimmune diseases. Pfizer Inc. was founded in 1849 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"Alphabet Inc.","Symbol":"GOOGL","Current Price":"190.74","Latest MA":"174.82","Price Target":215.18277,"Difference from MA":"9.10%","Difference from Open":"-0.25%","Change from Yesterday":"-7.60%","Change from Last Report":"0.01","Latest Volume":"43,085,367","Market Cap":"2,341,657,903,104","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":18.536318,"PB Ratio":7.4469995,"Previous Close":206.38,"ROE":0.32101002,"DTE":9.324,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.034,"Trailing PEG":1.3486,"Trailing PE":23.69441,"Trailing PS":6.890086,"Quick Ratio":1.761,"Day High":192.75,"Day Low":188.03,"VS Average Volume":1.5574482026,"Company Summary":"Alphabet Inc. offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube. It is also involved in the sale of apps and in-app purchases and digital content in the Google Play and YouTube; and devices, as well as in the provision of YouTube consumer subscription services. The Google Cloud segment offers infrastructure, cybersecurity, databases, analytics, AI, and other services; Google Workspace that include cloud-based communication and collaboration tools for enterprises, such as Gmail, Docs, Drive, Calendar, and Meet; and other services for enterprise customers. The Other Bets segment sells healthcare-related and internet services. The company was incorporated in 1998 and is headquartered in Mountain View, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"Archer-Daniels-Midland Company","Symbol":"ADM","Current Price":"46.35","Latest MA":"55.94","Price Target":53.0,"Difference from MA":"-17.14%","Difference from Open":"-2.40%","Change from Yesterday":"-2.40%","Change from Last Report":"0.06","Latest Volume":"3,735,608","Market Cap":"22,180,050,944","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":9.799879,"PB Ratio":0.9853107,"Previous Close":47.49,"ROE":0.1075,"DTE":52.874,"Industry":"Farm Products","Sector":"Consumer Defensive","Beta":0.722,"Trailing PEG":null,"Trailing PE":12.698629,"Trailing PS":0.24986538,"Quick Ratio":0.375,"Day High":47.49,"Day Low":45.14,"VS Average Volume":1.1887754582,"Company Summary":"Archer-Daniels-Midland Company engages in the procurement, transportation, storage, processing, and merchandising of agricultural commodities, ingredients, flavors, and solutions in the United States, Switzerland, the Cayman Islands, Brazil, Mexico, Canada, the United Kingdom, and internationally. It operates in three segments: Ag Services and Oilseeds, Carbohydrate Solutions, and Nutrition. The company originates, merchandises, stores, and transports agricultural raw materials, such as oilseeds and soft seeds. It also engages in the agricultural commodity and feed product import, export, and distribution; and various structured trade finance activities. In addition, the company offers soybean meal and oil; vegetable and salad oils and protein meals; ingredients for the food, feed, energy, and industrial customers; margarine, shortening, and other food products; and partially refined oils to produce biodiesel and glycols for use in chemicals, paints, and other industrial products. Further, it provides peanuts, peanut-derived ingredients, and cotton cellulose pulp; sweeteners, corn and wheat starches, syrup, glucose, wheat flour, and dextrose; alcohol, and other food and animal feed ingredients; ethyl alcohol and ethanol; corn gluten feed and meal; distillers' grains; corn germ; and citric acids. Additionally, the company provides proteins, natural flavors, flavor systems, natural colors, emulsifiers, soluble fiber, polyols, hydrocolloids, probiotics, prebiotics, postbiotics, enzymes, and botanical extracts; and other specialty food and feed ingredients; edible beans; formula feeds, and animal health and nutrition products; and contract and private label pet treats and food products. It also offers futures commission merchant; commodity brokerage services; cash margins and securities pledged to commodity exchange clearinghouse; and cash pledged as security under certain insurance arrangements. The company was founded in 1902 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"PayPal Holdings, Inc.","Symbol":"PYPL","Current Price":"78.75","Latest MA":"77.45","Price Target":95.10543,"Difference from MA":"1.68%","Difference from Open":"0.74%","Change from Yesterday":"1.25%","Change from Last Report":"0.07","Latest Volume":"12,206,300","Market Cap":"78,198,751,232","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":14.07713,"PB Ratio":3.9268973,"Previous Close":77.725,"ROE":0.22188,"DTE":65.718,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.436,"Trailing PEG":1.2881,"Trailing PE":19.736841,"Trailing PS":2.4858935,"Quick Ratio":0.261,"Day High":79.5,"Day Low":77.67,"VS Average Volume":1.4437032266,"Company Summary":"PayPal Holdings, Inc. operates a technology platform that enables digital payments on behalf of merchants and consumers worldwide. It operates a two-sided network at scale that connects merchants and consumers that enables its customers to connect, transact, and send and receive payments through online and in person, as well as transfer and withdraw funds using various funding sources, such as bank accounts, PayPal or Venmo account balance, PayPal and Venmo branded credit products comprising its installment products, credit and debit cards, and cryptocurrencies, as well as other stored value products, including gift cards and eligible rewards. The company provides payment solutions under the PayPal, PayPal Credit, Braintree, Venmo, Xoom, Zettle, Hyperwallet, Honey, and Paidy names. The company was founded in 1998 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"Advanced Micro Devices, Inc.","Symbol":"AMD","Current Price":"111.35","Latest MA":"143.52","Price Target":154.54909,"Difference from MA":"-22.41%","Difference from Open":"3.40%","Change from Yesterday":"-6.82%","Change from Last Report":"-0.15","Latest Volume":"73,625,314","Market Cap":"180,699,889,664","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":17.267473,"PB Ratio":3.1713707,"Previous Close":119.5,"ROE":0.03262,"DTE":3.927,"Industry":"Semiconductors","Sector":"Technology","Beta":1.706,"Trailing PEG":0.3305,"Trailing PE":97.67544,"Trailing PS":7.43774,"Quick Ratio":1.575,"Day High":111.61,"Day Low":106.5,"VS Average Volume":2.0258160922,"Company Summary":"Advanced Micro Devices, Inc. operates as a semiconductor company worldwide. It operates through Data Center, Client, Gaming, and Embedded segments. The company offers x86 microprocessors and graphics processing units (GPUs) as an accelerated processing unit, chipsets, data center, and professional GPUs; and embedded processors, and semi-custom system-on-chip (SoC) products, microprocessor and SoC development services and technology, data processing unites, field programmable gate arrays (FPGA), and adaptive SoC products. It provides processors under the AMD Ryzen, AMD Ryzen PRO, Ryzen Threadripper, Ryzen Threadripper PRO, AMD Athlon, AMD Athlon PRO, and AMD PRO A-Series brand names; graphics under the AMD Radeon graphics and AMD Embedded Radeon graphics; and professional graphics under the AMD Radeon Pro graphics brand name. In addition, the company offers data center graphics under the Radeon Instinct and Radeon PRO V-series brands, as well as servers under the AMD Instinct accelerators brand; server microprocessors under the AMD EPYC brands; low power solutions under the AMD Athlon, AMD Geode, AMD Ryzen, AMD EPYC, AMD R-Series, and G-Series brands; FPGA products under the Virtex-6, Virtex-7, Virtex UltraScale+, Kintex-7, Kintex UltraScale, Kintex UltraScale+, Artix-7, Artix UltraScale+, Spartan-6, and Spartan-7 brands; adaptive SOCs under the Zynq-7000, Zynq UltraScale+ MPSoC, Zynq UltraScale+ RFSoCs, Versal HBM, Versal Premium, Versal Prime, Versal AI Core, Versal AI Edge, Vitis, and Vivado brands; and compute and network acceleration board products under the Alveo brand. It serves original equipment and design manufacturers, public cloud service providers, system integrators, independent distributors, and add-in-board manufacturers through its direct sales force, and sales representatives. Advanced Micro Devices, Inc. was incorporated in 1969 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"Omnicom Group Inc.","Symbol":"OMC","Current Price":"83.09","Latest MA":"95.00","Price Target":112.11,"Difference from MA":"-12.54%","Difference from Open":"-4.64%","Change from Yesterday":"-4.31%","Change from Last Report":"0.11","Latest Volume":"2,628,085","Market Cap":"16,325,605,376","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":8.949121,"PB Ratio":4.102602,"Previous Close":86.9,"ROE":0.33923998,"DTE":155.236,"Industry":"Advertising Agencies","Sector":"Communication Services","Beta":0.968,"Trailing PEG":1.2708,"Trailing PE":11.138069,"Trailing PS":1.058194,"Quick Ratio":0.788,"Day High":88.17,"Day Low":82.85,"VS Average Volume":1.1440025387,"Company Summary":"Omnicom Group Inc., together with its subsidiaries, offers advertising, marketing, and corporate communications services. It provides a range of services in the areas of advertising and media, precision marketing, commerce and branding, experiential, execution and support, public relations, and healthcare. The company's services include advertising, branding, content marketing, corporate social responsibility consulting, crisis communications, custom publishing, data analytics, database management, digital\/direct marketing and post-production, digital transformation consulting, entertainment marketing, experiential marketing, field marketing, sales support, financial\/corporate business-to-business advertising, graphic arts\/digital imaging, healthcare marketing and communications, and instore design services. Its services also comprise interactive marketing, investor relations, marketing research, media planning and buying, retail media planning and buying, merchandising and point of sale, mobile marketing, multi-cultural marketing, non-profit marketing, organizational communications, package design, product placement, promotional marketing, public affairs, public relations, retail marketing, retail media and e-commerce, search engine marketing, shopper marketing, social media marketing, and sports and event marketing services. It operates in the North and Latin America, Europe, the Middle East and Africa (EMEA), and the Asia Pacific. The company was incorporated in 1944 and is based in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"Amcor plc","Symbol":"AMCR","Current Price":"10.27","Latest MA":"10.28","Price Target":11.34333,"Difference from MA":"-0.12%","Difference from Open":"1.49%","Change from Yesterday":"2.24%","Change from Last Report":"-0.04","Latest Volume":"21,604,897","Market Cap":"14,845,087,744","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":12.818561,"PB Ratio":3.8224785,"Previous Close":10.05,"ROE":0.1958,"DTE":196.619,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":0.863,"Trailing PEG":1.9984,"Trailing PE":18.674545,"Trailing PS":1.0955784,"Quick Ratio":0.591,"Day High":10.365,"Day Low":10.11,"VS Average Volume":1.3175658682,"Company Summary":"Amcor plc develops, produces, and sells packaging products in Europe, North America, Latin America, and the Asia Pacific. The company operates in two segments, Flexibles and Rigid Packaging. The Flexibles segment offers flexible and film packaging products in the food and beverage, medical and pharmaceutical, fresh produce, snack food, personal care, and other industries. The Rigid Packaging segment provides rigid containers for various beverage and food products, including carbonated soft drinks, water, juices, sports drinks, milk-based beverages, spirits and beer, sauces, dressings, spreads, and personal care items; and plastic caps for various applications. It sells its products through its direct sales force. The company was incorporated in 1926 and is headquartered in Zurich, Switzerland.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"Match Group, Inc.","Symbol":"MTCH","Current Price":"33.67","Latest MA":"34.31","Price Target":36.09261,"Difference from MA":"-1.86%","Difference from Open":"-3.16%","Change from Yesterday":"-7.68%","Change from Last Report":"0.03","Latest Volume":"5,102,482","Market Cap":"8,454,233,600","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":8.906582,"PB Ratio":"N\/A","Previous Close":36.47,"ROE":"N\/A","DTE":"N\/A","Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.487,"Trailing PEG":0.5899,"Trailing PE":15.098654,"Trailing PS":2.4255962,"Quick Ratio":2.265,"Day High":34.9,"Day Low":33.17,"VS Average Volume":1.0835459908,"Company Summary":"Match Group, Inc. engages in the provision of dating products. Its portfolio of brands includes Tinder, Hinge, Match, Meetic, OkCupid, Pairs, Plenty Of Fish, Azar, BLK, and Hakuna, as well as a various other brands, each built to increase users' likelihood of connecting with others. Its services are available in over 40 languages to users worldwide. The company was incorporated in 1986 and is based in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"Berry Global Group, Inc.","Symbol":"BERY","Current Price":"71.83","Latest MA":"63.23","Price Target":74.8,"Difference from MA":"13.59%","Difference from Open":"1.51%","Change from Yesterday":"1.79%","Change from Last Report":"-0.08","Latest Volume":"2,344,221","Market Cap":"8,309,007,360","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":10.616192,"PB Ratio":2.4419513,"Previous Close":70.5,"ROE":0.16395001,"DTE":279.887,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":1.133,"Trailing PEG":null,"Trailing PE":15.717724,"Trailing PS":0.68235254,"Quick Ratio":0.943,"Day High":72.705,"Day Low":70.76,"VS Average Volume":1.4489345093,"Company Summary":"Berry Global Group, Inc. manufactures and supplies products in consumer and industrial end markets in the United States, Canada, Europe, and internationally. The company offers closures and dispensing systems, pharmaceutical devices and packaging, bottles and canisters, containers, and technical components. It also provides containers and pails, foodservice products, closures, bottles and prescription vials, and tubes. In addition, it offers stretch and shrink, converter, food and consumer, and agriculture films, as well as institutional can liners and retail bags. The company was formerly known as Berry Plastics Group, Inc. and changed its name to Berry Global Group, Inc. in April 2017. Berry Global Group, Inc. was founded in 1967 and is based in Evansville, Indiana.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"Electronic Arts Inc.","Symbol":"EA","Current Price":"126.81","Latest MA":"146.86","Price Target":143.78273,"Difference from MA":"-13.65%","Difference from Open":"-0.42%","Change from Yesterday":"4.57%","Change from Last Report":"0.09","Latest Volume":"3,555,707","Market Cap":"33,258,838,016","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":16.84312,"PB Ratio":4.4898033,"Previous Close":121.25,"ROE":0.13962,"DTE":29.954,"Industry":"Electronic Gaming & Multimedia","Sector":"Communication Services","Beta":0.781,"Trailing PEG":1.9168,"Trailing PE":32.267174,"Trailing PS":4.488978,"Quick Ratio":1.283,"Day High":130.56,"Day Low":126.21,"VS Average Volume":1.2989102283,"Company Summary":"Electronic Arts Inc. develops, markets, publishes, and delivers games, content, and services for game consoles, PCs, mobile phones, and tablets worldwide. It develops and publishes games and services across various genres, such as sports, racing, first-person shooter, action, role-playing, and simulation through owned and licensed brands, such as EA SPORTS FC, Battlefield, Apex Legends, The Sims, Madden NFL, Need for Speed, Titanfall, and F1 brands. The company licenses its games to third parties to distribute and host its games and content. It markets and sells its games and services through digital distribution and retail channels, as well as directly to mass market retailers, specialty stores, and distribution arrangements. Electronic Arts Inc. was incorporated in 1982 and is headquartered in Redwood City, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"Snap Inc.","Symbol":"SNAP","Current Price":"10.81","Latest MA":"11.32","Price Target":13.07057,"Difference from MA":"-4.51%","Difference from Open":"-6.29%","Change from Yesterday":"-6.85%","Change from Last Report":"-0.14","Latest Volume":"51,915,365","Market Cap":"18,130,472,960","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":20.836353,"PB Ratio":8.1769285,"Previous Close":11.6,"ROE":-0.4062,"DTE":191.874,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":0.995,"Trailing PEG":496.0591,"Trailing PE":"N\/A","Trailing PS":3.5099828,"Quick Ratio":3.861,"Day High":11.57,"Day Low":10.695,"VS Average Volume":1.813601155,"Company Summary":"Snap Inc. operates as a technology company in North America, Europe, and internationally. The company offers Snapchat, a visual messaging application with various tabs, such as camera, visual messaging, snap map, stories, and spotlight that enable people to communicate visually through short videos and images. It also provides Spectacles, an eyewear product that connects with Snapchat and captures photos and video from a human perspective; and advertising products, including AR ads and Snap ads comprises a single image or video ads, collection ads, dynamic ads, story ads, and commercials. The company was formerly known as Snapchat, Inc. and changed its name to Snap Inc. in September 2016. Snap Inc. was founded in 2010 and is headquartered in Santa Monica, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"KKR & Co. Inc.","Symbol":"KKR","Current Price":"151.67","Latest MA":"136.12","Price Target":170.40633,"Difference from MA":"11.42%","Difference from Open":"3.23%","Change from Yesterday":"1.58%","Change from Last Report":"0.06","Latest Volume":"2,682,168","Market Cap":"139,961,237,504","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":20.677404,"PB Ratio":5.588842,"Previous Close":149.3,"ROE":0.08284,"DTE":83.045,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.606,"Trailing PEG":0.6654,"Trailing PE":46.240852,"Trailing PS":5.0316224,"Quick Ratio":0.792,"Day High":152.71,"Day Low":146.92,"VS Average Volume":0.7717920482,"Company Summary":"KKR & Co. Inc. is a private equity and real estate investment firm specializing in direct and fund of fund investments. It specializes in acquisitions, leveraged buyouts, management buyouts, credit special situations, growth equity, mature, mezzanine, distressed, turnaround, lower middle market, and middle market investments. The firm considers investments in all industries with a focus on software, security, semiconductors, consumer electronics, internet of things (iot), internet, information services, information technology infrastructure, financial technology, network and cyber security architecture, engineering and operations, content, technology and hardware, energy and infrastructure, real estate, services industry with a focus on business services, intelligence, industry-leading franchises and companies in natural resource, containers and packaging, agriculture, airports, ports, forestry, electric utilities, textiles, apparel and luxury goods, household durables, digital media, insurance, brokerage houses, non-durable goods distribution, supermarket retailing, grocery stores, food, beverage, and tobacco, hospitals, entertainment venues and production companies, publishing, printing services, capital goods, financial services, specialized finance, pipelines, and renewable energy. In energy and infrastructure, it focuses on the upstream oil and gas and equipment, minerals and royalties and services verticals. In real estate, the firm seeks to invest in private and public real estate securities including property-level equity, debt and special situations transactions and businesses with significant real estate holdings, and oil and natural gas properties. The firm also invests in asset services sector that encompasses a broad array of B2B, B2C and B2G services verticals including asset-based, transport, logistics, leisure\/hospitality, resource and utility support, infra-like, mission-critical, and environmental services. Within Americas, the firm prefers to invest in consumer products; chemicals, metals and mining; energy and natural resources; financial services; healthcare; industrials; media and communications; retail; and technology. Within Europe, the firm invests in consumer and retail; energy; financial services; health care; industrials and chemicals; media and digital; and telecom and technologies. Within Asia, it invests in consumer products; energy and resources; financial services; healthcare; industrials; logistics; media and telecom; retail; real estate; and technology. It also seeks to make impact investments focused on identifying and investing behind businesses with positive social or environmental impact. The firm seeks to invest in mid to high-end residential developments but can invest in other projects throughout Mainland China through outright ownership, joint ventures, and merger. It invests globally with a focus on Australia, emerging and developed Asia, Middle East and Africa, Nordic, Southeast Asia, Asia Pacific, Ireland, Hong Kong, Japan, Taiwan, India, Vietnam, Malaysia, Singapore, Indonesia, France, Germany, Netherlands, United Kingdom, Caribbean, Mexico, South America, North America, Brazil, Latin America, Korea with a focus on South Korea, and United States of America. In the United States and Europe, the firm focuses on buyouts of large, publicly traded companies. For middle market it seeks to invest in companies with enterprise values between $200 million to $1000 million. The firm prefers to invest in a range of debt and public equity investing and may co-invest. It seeks a board seat in its portfolio companies and a controlling ownership of a company or a strategic minority position. The firm may acquire majority and minority equity interests, particularly when making private equity investments in Asia or sponsoring investments as part of a large investor consortium. The firm typically holds its investment for a period of five to seven years and more and exits through initial public offerings, secondary offerings, and sales to strategic buyers. KKR & Co. Inc. was founded in 1976 and is based in New York, New York with additional offices across North America, Europe, Australia and Asia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"Spotify Technology S.A.","Symbol":"SPOT","Current Price":"621.47","Latest MA":"400.16","Price Target":604.3671,"Difference from MA":"55.31%","Difference from Open":"2.07%","Change from Yesterday":"-0.13%","Change from Last Report":"-0.00","Latest Volume":"2,443,466","Market Cap":"125,586,038,784","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":47.703995,"PB Ratio":27.039244,"Previous Close":621.77,"ROE":0.20703,"DTE":38.55,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.561,"Trailing PEG":null,"Trailing PE":178.58333,"Trailing PS":8.315855,"Quick Ratio":1.67,"Day High":630.77,"Day Low":607.3,"VS Average Volume":0.9068141341,"Company Summary":"Spotify Technology S.A., together with its subsidiaries, provides audio streaming subscription services worldwide. It operates through two segments, Premium and Ad-Supported. The Premium segment offers unlimited online and offline streaming access to its catalog of music and podcasts without commercial breaks to its subscribers. This segment sells directly to the end users. The Ad-Supported segment provides on-demand online access to its catalog of music and unlimited online access to the catalog of podcasts to its users on their computers, tablets, and compatible mobile devices. The company also offers sales, distribution and marketing, contract research and development, and customer and other support services. Spotify Technology S.A. was incorporated in 2006 and is based in Luxembourg City, Luxembourg.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"Amgen Inc.","Symbol":"AMGN","Current Price":"303.98","Latest MA":"304.03","Price Target":314.2754,"Difference from MA":"-0.02%","Difference from Open":"4.57%","Change from Yesterday":"5.18%","Change from Last Report":"-0.13","Latest Volume":"2,896,649","Market Cap":"163,399,286,784","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":14.062698,"PB Ratio":21.706657,"Previous Close":289.02,"ROE":0.5572,"DTE":802.418,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.599,"Trailing PEG":2.0566,"Trailing PE":40.15588,"Trailing PS":5.022416,"Quick Ratio":0.804,"Day High":306.28,"Day Low":289.525,"VS Average Volume":0.7576646662,"Company Summary":"Amgen Inc. discovers, develops, manufactures, and delivers human therapeutics worldwide. The company's principal products include Enbrel to treat plaque psoriasis, rheumatoid arthritis, and psoriatic arthritis; Otezla for the treatment of adult patients with plaque psoriasis, psoriatic arthritis, and oral ulcers associated with Behçet's disease; Prolia to treat postmenopausal women with osteoporosis; XGEVA for skeletal-related events prevention; Repatha, which reduces the risks of myocardial infarction, stroke, and coronary revascularization; Nplate for the treatment of patients with immune thrombocytopenia; KYPROLIS to treat patients with relapsed or refractory multiple myeloma; Aranesp to treat a lower-than-normal number of red blood cells and anemia; EVENITY for the treatment of osteoporosis in postmenopausal for men and women; Vectibix to treat patients with wild-type RAS metastatic colorectal cancer; BLINCYTO for the treatment of patients with acute lymphoblastic leukemia; TEPEZZA to treat thyroid eye disease; and KRYSTEXXA for the treatment of chronic refractory gout. It also markets other products, including Neulasta, MVASI, AMJEVITA\/AMGEVITA, TEZSPIRE, Parsabiv, Aimovig, LUMAKRAS\/LUMYKRAS, EPOGEN, KANJINTI, TAVNEOS, RAVICTI, UPLIZNA and PROCYSBI. The company serves healthcare providers, including physicians or their clinics, dialysis centers, hospitals, and pharmacies. It distributes its products through pharmaceutical wholesale distributors, as well as direct-to-consumer channels. The company has collaboration agreements with AstraZeneca plc for the development and commercialization of TEZSPIRE; Novartis Pharma AG to develop and commercialize Aimovig; UCB for the development and commercialization of EVENITY; Kyowa Kirin Co., Ltd. for rocatinlimab development and commercialization; and BeiGene, Ltd. for oncology products expansion and development. Amgen Inc. was incorporated in 1980 and is headquartered in Thousand Oaks, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"Chipotle Mexican Grill, Inc.","Symbol":"CMG","Current Price":"57.59","Latest MA":"57.78","Price Target":64.70419,"Difference from MA":"-0.34%","Difference from Open":"2.80%","Change from Yesterday":"-2.42%","Change from Last Report":"0.03","Latest Volume":"14,624,260","Market Cap":"78,471,553,024","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":37.50814,"PB Ratio":21.732075,"Previous Close":59.02,"ROE":0.45673,"DTE":124.061,"Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":1.266,"Trailing PEG":2.0517,"Trailing PE":51.88288,"Trailing PS":7.143608,"Quick Ratio":1.486,"Day High":58.3,"Day Low":55.69,"VS Average Volume":1.6749513667,"Company Summary":"Chipotle Mexican Grill, Inc., together with its subsidiaries, owns and operates Chipotle Mexican Grill restaurants. It sells food and beverages through offering burritos, burrito bowls, quesadillas, tacos, and salads. The company also provides delivery and related services its app and website. It has operations in the United States, Canada, France, Germany, Dubai, and the United Kingdom. Chipotle Mexican Grill, Inc. was founded in 1993 and is headquartered in Newport Beach, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"Merck & Company, Inc.","Symbol":"MRK","Current Price":"89.80","Latest MA":"107.89","Price Target":119.34042,"Difference from MA":"-16.77%","Difference from Open":"-0.66%","Change from Yesterday":"-1.06%","Change from Last Report":"0.21","Latest Volume":"9,612,089","Market Cap":"227,149,021,184","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":9.005255,"PB Ratio":5.1089554,"Previous Close":90.74,"ROE":0.28332,"DTE":85.572,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.411,"Trailing PEG":0.0675,"Trailing PE":13.3227005,"Trailing PS":3.5956092,"Quick Ratio":0.917,"Day High":90.34,"Day Low":87.995,"VS Average Volume":0.8192643122,"Company Summary":"Merck & Co., Inc. operates as a healthcare company worldwide. It operates through two segments, Pharmaceutical and Animal Health. The Pharmaceutical segment offers human health pharmaceutical products in the areas of oncology, hospital acute care, immunology, neuroscience, virology, cardiovascular, and diabetes under the Keytruda, Bridion, Adempas, Lagevrio, Belsomra, Simponi, and Januvia brands, as well as vaccine products consisting of preventive pediatric, adolescent, and adult vaccines under the Gardasil\/Gardasil 9, ProQuad, M-M-R II, Varivax, RotaTeq, Live Oral, Vaxneuvance, Pneumovax 23, and Vaqta names. The Animal Health segment discovers, develops, manufactures, and markets veterinary pharmaceuticals, vaccines, and health management solutions and services, as well as digitally connected identification, traceability, and monitoring products. vIt has development and commercialization agreement for three of Daiichi Sankyo's deruxtecan ADC candidates, which include patritumab deruxtecan, ifinatamab deruxtecan, and raludotatug deruxtecan for the treatment of multiple solid tumors both as monotherapy and\/or in combination with other treatments; and AstraZeneca PLC to co-development and co-commercialize AstraZeneca's Lynparza products for multiple cancer types, and Koselugo for multiple indications. It also has licensed to develop, manufacture and  commercialize LM-299, a novel investigational PD-1\/VEGF bispecific antibody from LaNova. The company also has a collaboration agreement with Eisai Co., Ltd., Bayer AG, and Ridgeback Biotherapeutics LP, as well Moderna, Inc. Merck & Co., Inc. was founded in 1891 and is headquartered in Rahway, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"Mondelez International, Inc.","Symbol":"MDLZ","Current Price":"56.85","Latest MA":"65.96","Price Target":67.2844,"Difference from MA":"-13.81%","Difference from Open":"5.26%","Change from Yesterday":"1.28%","Change from Last Report":"0.21","Latest Volume":"9,281,794","Market Cap":"76,019,253,248","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":17.001259,"PB Ratio":2.7292366,"Previous Close":56.12,"ROE":0.13552,"DTE":73.232,"Industry":"Confectioners","Sector":"Consumer Defensive","Beta":0.561,"Trailing PEG":4.7031,"Trailing PE":16.622807,"Trailing PS":2.1028256,"Quick Ratio":0.295,"Day High":57.225,"Day Low":53.95,"VS Average Volume":0.9864386648,"Company Summary":"Mondelez International, Inc., through its subsidiaries, manufactures, markets, and sells snack food and beverage products in the Latin America, North America, Asia, the Middle East, Africa, and Europe. It provides biscuits and baked snacks, including cookies, crackers, salted snacks, snack bars, and cakes and pastries; chocolates; and gums and candies, as well as various cheese and grocery, and powdered beverage products. The company's brand portfolio includes Oreo, Ritz, LU, CLIF Bar, and Tate's Bake Shop biscuits and baked snacks, as well as Cadbury Dairy Milk, Milka, and Toblerone chocolate. It serves supermarket chains, wholesalers, supercenters, club stores, mass merchandisers, distributors, convenience stores, gasoline stations, drug stores, value stores, and other retail food outlets through direct store delivery, company-owned and satellite warehouses, distribution centers, third party distributors, and other facilities, as well as through independent sales offices and agents. The company also sells products directly to businesses and consumers through e-retail platforms, retailer digital platforms, as well as through its direct-to-consumer websites and social media platforms. Mondelez International, Inc. was formerly known as Kraft Foods Inc. and changed its name to Mondelez International, Inc. in October 2012. The company was incorporated in 2000 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"CNH Industrial N.V.","Symbol":"CNH","Current Price":"12.47","Latest MA":"11.01","Price Target":14.40526,"Difference from MA":"13.32%","Difference from Open":"-2.92%","Change from Yesterday":"-2.00%","Change from Last Report":"-0.04","Latest Volume":"5,546,291","Market Cap":"15,581,025,280","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":12.155552,"PB Ratio":2.0387318,"Previous Close":12.73,"ROE":0.22186,"DTE":356.262,"Industry":"Farm & Heavy Construction Machinery","Sector":"Industrials","Beta":1.597,"Trailing PEG":null,"Trailing PE":12.60101,"Trailing PS":0.7163031,"Quick Ratio":3.87,"Day High":13.0,"Day Low":12.41,"VS Average Volume":0.4480865342,"Company Summary":"CNH Industrial N.V., an equipment and services company, engages in the design, production, marketing, sale, and financing of agricultural and construction equipment in North America, Europe, the Middle East, Africa, South America, and the Asia Pacific. The company operates through three segments: Agriculture, Construction, and Financial Services. The Agriculture segment designs, manufactures, and distributes farm machinery and implements, including two-wheel and four-wheel drive tractors, crawler tractors, combines, grape and sugar cane harvesters, hay and forage equipment, planting and seeding equipment, soil preparation and cultivation implements, material handling equipment, and precision agriculture technology. This segment sells its agricultural equipment under the New Holland Agriculture and Case IH brands. The Construction segment designs, manufactures, and distributes construction equipment comprising excavators, crawler dozers, graders, wheel loaders, backhoe loaders, skid steer loaders, and compact track loaders under the CASE Construction Equipment, New Holland Construction, and Eurocomach brands. The Financial Services segment offers financing to end-use customers for the purchase of new and used agricultural and construction equipment and components, as well as revolving charge account financing and other financial services. It also provides wholesale financing to CNH Industrial brand dealers and distributors; trade receivables factoring services to CNH companies; and financial services to Iveco Group companies in the North America, South America, and Asia Pacific regions. The company was founded in 1842 and is headquartered in Basildon, the United Kingdom.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"Mattel, Inc.","Symbol":"MAT","Current Price":"20.80","Latest MA":"18.64","Price Target":25.24,"Difference from MA":"11.59%","Difference from Open":"-2.00%","Change from Yesterday":"15.11%","Change from Last Report":"-0.02","Latest Volume":"11,071,957","Market Cap":"7,004,983,296","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":11.68902,"PB Ratio":3.0291333,"Previous Close":18.07,"ROE":0.25217,"DTE":114.026,"Industry":"Leisure","Sector":"Consumer Cyclical","Beta":0.785,"Trailing PEG":1.2215,"Trailing PE":13.245222,"Trailing PS":1.3084062,"Quick Ratio":1.695,"Day High":21.35,"Day Low":20.18,"VS Average Volume":3.5102890039,"Company Summary":"Mattel, Inc., a toy and family entertainment company, designs, manufactures, and markets toys and consumer products in North America, Latin America, Europe, the Middle East, Africa, and the Asia Pacific. The company operates through North America, International, and American Girl segments. It offers dolls and accessories, as well as books, content, gaming, and lifestyle products for children under the Barbie, American Girl, Disney Princess and Disney Frozen, Monster High, and Polly Pocket brands; die-cast vehicles, tracks, playsets, and accessories for kids, adults, and collectors under the Hot Wheels, Hot Wheels Monster Trucks, Hot Wheels Mario Kart, Matchbox, and Cars brand names; and infant, toddler, and preschool products comprising content, toys, live events, and other consumer products under the Fisher-Price, Little People and Imaginext, and Thomas & Friends, and Power wheels brands. The company also provides action figures, building sets, games, and other products under the Masters of the Universe, MEGA, UNO, Jurassic World, Minecraft, WWE, Lightyear, and Star Wars; and licensor partner brands, including Disney Pixar, Microsoft, NBCUniversal, and WWE. It sells its products directly to consumers through its catalog, website, and proprietary retail stores; retailers, including omnichannel retailers, discount and free-standing toy stores, chain stores, department stores, and other retail outlets; and wholesalers, as well as through agents and distributors. Mattel, Inc. was founded in 1945 and is headquartered in El Segundo, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"Estee Lauder Companies, Inc. (T","Symbol":"EL","Current Price":"65.69","Latest MA":"84.79","Price Target":81.11429,"Difference from MA":"-22.52%","Difference from Open":"-4.79%","Change from Yesterday":"-5.43%","Change from Last Report":"-0.01","Latest Volume":"5,601,426","Market Cap":"23,631,476,736","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":26.764143,"PB Ratio":4.638822,"Previous Close":69.47,"ROE":0.03857,"DTE":196.892,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":1.044,"Trailing PEG":1.1308,"Trailing PE":"N\/A","Trailing PS":1.5294465,"Quick Ratio":0.789,"Day High":69.0109,"Day Low":65.06,"VS Average Volume":1.3628166921,"Company Summary":"The Estée Lauder Companies Inc. manufactures, markets, and sells skin care, makeup, fragrance, and hair care products worldwide. It offers skin care products, including moisturizers, serums, cleansers, toners, body care, exfoliators, acne care and oil correctors, facial masks, and sun care products; and makeup products, such as lipsticks, lip glosses, mascaras, foundations, eyeshadows, and powders, as well as compacts, brushes, and other makeup tools. The company also provides fragrance products in various forms comprising eau de parfum sprays and colognes, as well as lotions, powders, creams, candles, and soaps; and hair care products, including shampoos, conditioners, styling products, treatment, finishing sprays, and hair color products, as well as sells ancillary products and services. It offers its products under the Estée Lauder, Clinique, Origins, M·A·C, Bobbi Brown Cosmetics, La Mer, Aveda, Jo Malone London, TOM FORD, Too Faced, Dr.Jart+, and The Ordinary brands. The company sells its products through department stores, specialty-multi retailers, upscale perfumeries and pharmacies, and salons and spas; freestanding stores; its own and authorized retailer websites; third-party online malls; stores in airports; and duty-free locations. The Estée Lauder Companies Inc. was founded in 1946 and is headquartered in New York, New York.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"05-02-2025 19:31:00"},{"Company Name":"Kyndryl Holdings, Inc.","Symbol":"KD","Current Price":"42.35","Latest MA":"28.51","Price Target":43.6,"Difference from MA":"48.52%","Difference from Open":"5.35%","Change from Yesterday":"6.09%","Change from Last Report":"0.21","Latest Volume":"2,425,080","Market Cap":"9,836,653,568","Earning Date":"2025-02-03","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":20.582483,"PB Ratio":9.614052,"Previous Close":39.92,"ROE":-0.0779,"DTE":349.744,"Industry":"Information Technology Services","Sector":"Technology","Beta":1.719,"Trailing PEG":null,"Trailing PE":73.01707,"Trailing PS":0.64296055,"Quick Ratio":0.663,"Day High":42.56,"Day Low":40.1725,"VS Average Volume":0.9984942791,"Company Summary":"Kyndryl Holdings, Inc. operates as a technology services company and IT infrastructure services provider worldwide. The company offers cloud services; core enterprise and zCloud services; application, data, and artificial intelligence services; digital workplace services; security and resiliency services; and network services and edge services. It serves financial, technology, media and telecom, retail and travel, and automotive industries. The company was incorporated in 2020 and is headquartered in New York, New York.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"05-02-2025 19:31:00"}]