[{"Company Name":"NVIDIA Corporation","Symbol":"NVDA","Current Price":"130.17","Latest MA":"129.95","Latest MA 5":"132.32","Latest MA 9":"134.93","Latest MA 20":"129.95","Price Target":171.63556,"Difference from MA":"0.17%","Difference from Open":"0.14%","Change from Yesterday":"2.72%","Change from Last Report":"-0.14","Latest Volume":"31,102,548","Market Cap":"3,186,883,821,568","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":31.584953,"PB Ratio":48.39346,"Previous Close":126.63,"ROE":1.27211,"DTE":15.516,"Industry":"Semiconductors","Sector":"Technology","Beta":1.619,"Trailing PEG":0.9076,"Trailing PE":51.434784,"Trailing PS":28.14418,"Quick Ratio":3.409,"Day High":131.6,"Day Low":129.07,"VS Average Volume":0.1310402467,"Company Summary":"NVIDIA Corporation provides graphics and compute and networking solutions in the United States, Taiwan, China, Hong Kong, and internationally. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro\/NVIDIA RTX GPUs for enterprise workstation graphics; virtual GPU or vGPU software for cloud-based visual and virtual computing; automotive platforms for infotainment systems; and Omniverse software for building and operating metaverse and 3D internet applications. The Compute & Networking segment comprises Data Center computing platforms and end-to-end networking platforms, including Quantum for InfiniBand and Spectrum for Ethernet; NVIDIA DRIVE automated-driving platform and automotive development agreements; Jetson robotics and other embedded platforms; NVIDIA AI Enterprise and other software; and DGX Cloud software and services. The company's products are used in gaming, professional visualization, data center, and automotive markets. It sells its products to original equipment manufacturers, original device manufacturers, system integrators and distributors, independent software vendors, cloud service providers, consumer internet companies, add-in board manufacturers, distributors, automotive manufacturers and tier-1 automotive suppliers, and other ecosystem participants. It has a strategic collaboration with IQVIA to help realize the potential of AI in healthcare and life sciences. NVIDIA Corporation was incorporated in 1993 and is headquartered in Santa Clara, California.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"26-02-2025 16:45:52"},{"Company Name":"Coupang, Inc.","Symbol":"CPNG","Current Price":"23.90","Latest MA":"24.21","Latest MA 5":"24.53","Latest MA 9":"24.89","Latest MA 20":"24.21","Price Target":28.66471,"Difference from MA":"-1.27%","Difference from Open":"-6.20%","Change from Yesterday":"-1.07%","Change from Last Report":"1.57","Latest Volume":"2,738,281","Market Cap":"43,010,744,320","Earning Date":"2025-02-25","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":50.87234,"PB Ratio":10.519137,"Previous Close":24.17,"ROE":0.01594,"DTE":89.179,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":"N\/A","Trailing PEG":44.1542,"Trailing PE":41.94737,"Trailing PS":1.4204029,"Quick Ratio":0.815,"Day High":25.7881,"Day Low":23.48,"VS Average Volume":0.3556990705,"Company Summary":"Coupang, Inc., together with its subsidiaries owns and operates retail business through its mobile applications and Internet websites primarily in South Korea. The company operates through Product Commerce and Developing Offerings segments. It sells various products and services in the categories of home goods and décor products, apparel, beauty products, fresh food and groceries, sporting goods, electronics, and everyday consumables, as well as travel, and restaurant order and delivery services. In addition, the company offers Rocket Fresh, which offers fresh groceries; Coupang Eats, a restaurant ordering and delivery services; and Coupang Play, an online content streaming services, as well as advertising products. It also performs operations and support services in the United States, South Korea, Taiwan, Singapore, China, Japan, and India. Coupang, Inc. was incorporated in 2010 and is headquartered in Seattle, Washington.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 16:45:52"},{"Company Name":"Maplebear Inc.","Symbol":"CART","Current Price":"43.67","Latest MA":"49.50","Latest MA 5":"49.35","Latest MA 9":"50.13","Latest MA 20":"49.50","Price Target":52.18519,"Difference from MA":"-11.78%","Difference from Open":"0.83%","Change from Yesterday":"-10.48%","Change from Last Report":"-1.51","Latest Volume":"2,635,967","Market Cap":"11,218,604,032","Earning Date":"2025-02-25","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":32.58955,"PB Ratio":3.6282816,"Previous Close":48.78,"ROE":0.12684,"DTE":0.793,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":"N\/A","Trailing PEG":null,"Trailing PE":4.139336,"Trailing PS":3.3210788,"Quick Ratio":2.986,"Day High":44.4892,"Day Low":42.51,"VS Average Volume":0.6728566338,"Company Summary":"Maplebear Inc., doing business as Instacart, engages in the provision of online grocery shopping services to households in North America. It sells and delivers grocery products, as well as pickup services through a mobile application and website. It also operates virtual convenience stores; and provides software-as-a-service solutions to retailers. The company was incorporated in 2012 and is based in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 16:45:52"},{"Company Name":"Hims & Hers Health, Inc.","Symbol":"HIMS","Current Price":"42.48","Latest MA":"47.00","Latest MA 5":"49.87","Latest MA 9":"55.14","Latest MA 20":"47.00","Price Target":42.45,"Difference from MA":"-9.62%","Difference from Open":"5.57%","Change from Yesterday":"6.45%","Change from Last Report":"-0.89","Latest Volume":"7,286,237","Market Cap":"9,436,500,992","Earning Date":"2025-02-24","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":92.33695,"PB Ratio":19.67346,"Previous Close":39.86,"ROE":0.30712998,"DTE":2.38,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":1.35,"Trailing PEG":4.5239,"Trailing PE":80.14151,"Trailing PS":6.39182,"Quick Ratio":1.384,"Day High":43.25,"Day Low":40.195,"VS Average Volume":0.4064425236,"Company Summary":"Hims & Hers Health, Inc. operates a telehealth platform that connects consumers to licensed healthcare professionals in the United States, the United Kingdom, and internationally. The company offers a range of curated prescription and non-prescription health and wellness products and services available to purchase on its websites and mobile application directly by customers. It also provides prescription medication on a recurring basis and ongoing care from healthcare providers; and over-the-counter drug and device products, cosmetics, and supplement products primarily focusing on general wellness, sexual health and wellness, skincare, and hair care. In addition, the company's curated non-prescription products include melatonin and biotin in the wellness specialty category; moisturizers, creams, sunscreen, serum, face oil, and face wash in the skincare specialty; condoms, climax delay spray and wipes, vibrators, and lubricants in the sexual health and wellness specialty; and shampoos, conditioners, scalp scrubs, and topical treatments, such as minoxidil in the hair care specialty category. Further, it offers medical consultation and post-consultation support services, as well as health and wellness products through wholesale partners. Hims & Hers Health, Inc. is based in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"26-02-2025 16:45:52"}]