[{"Company Name":"Citigroup, Inc.","Symbol":"C","Current Price":"70.65","Latest MA":"64.06","Price Target":80.24789,"Difference from MA":"10.29%","Difference from Open":"0.67%","Change from Yesterday":"-0.46%","Change from Last Report":"0.13","Latest Volume":"2,713,221","Market Cap":"133,617,524,736","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":9.716255,"ROE":0.03874,"DTE":"N\/A","Industry":"Banks—Diversified","Sector":"Financial Services","Beta":1.426,"Trailing PEG":0.7067,"Trailing PE":20.128206,"Trailing PS":1.9278803,"Quick Ratio":"N\/A","Day High":70.65,"Day Low":69.795,"VS Average Volume":0.2009841867,"Company Summary":"Citigroup Inc., a diversified financial service holding company, provides various financial product and services to consumers, corporations, governments, and institutions worldwide. It operates through five segments: Services, Markets, Banking, U.S. Personal Banking, and Wealth. The Services segment includes Treasury and Trade Solutions, which provides cash management, trade, and working capital solutions to multinational corporations, financial institutions, and public sector organizations; and Securities Services, such as cross-border support for clients, local market expertise, post-trade technologies, data solutions, and various securities services solutions. The Markets segment offers sales and trading services for equities, foreign exchange, rates, spread products, and commodities to corporate, institutional, and public sector clients; and market-making services, including asset classes, risk management solutions, financing, prime brokerage, research, securities clearing, and settlement. The banking segment includes investment banking; advisory services related to mergers and acquisitions, divestitures, restructurings, and corporate defense activities; and corporate lending, which includes corporate and commercial banking. The U.S. Personal Banking segment provides co-branded cards and retail banking services. The Wealth segment provides financial services to high-net-worth clients through banking, lending, mortgages, investment, custody, and trust product offerings; and to professional industries, including law firms, consulting groups, accounting, and asset management. The company was founded in 1812 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-12-2024 19:22:14"},{"Company Name":"Wells Fargo & Company","Symbol":"WFC","Current Price":"70.61","Latest MA":"61.74","Price Target":74.54182,"Difference from MA":"14.37%","Difference from Open":"0.28%","Change from Yesterday":"-0.66%","Change from Last Report":"0.11","Latest Volume":"2,785,317","Market Cap":"235,095,277,568","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":12.70341,"ROE":0.099139996,"DTE":"N\/A","Industry":"Banks—Diversified","Sector":"Financial Services","Beta":1.136,"Trailing PEG":3.3152,"Trailing PE":14.679834,"Trailing PS":3.01888,"Quick Ratio":"N\/A","Day High":70.71,"Day Low":69.77,"VS Average Volume":0.1602472186,"Company Summary":"Wells Fargo & Company, a financial services company, provides diversified banking, investment, mortgage, and consumer and commercial finance products and services in the United States and internationally. The company operates through four segments: Consumer Banking and Lending; Commercial Banking; Corporate and Investment Banking; and Wealth and Investment Management. The Consumer Banking and Lending segment offers diversified financial products and services for consumers and small businesses. Its financial products and services include checking and savings accounts, and credit and debit cards, as well as home, auto, personal, and small business lending services. The Commercial Banking segment provides financial solutions to private, family owned, and certain public companies. Its products and services include banking and credit products across various industry sectors and municipalities, secured lending and lease products, and treasury management services. The Corporate and Investment Banking segment offers a suite of capital markets, banking, and financial products and services, such as corporate banking, investment banking, treasury management, commercial real estate lending and servicing, equity, and fixed income solutions, as well as sales, trading, and research capabilities services to corporate, commercial real estate, government, and institutional clients. The Wealth and Investment Management segment provides personalized wealth management, brokerage, financial planning, lending, private banking, and trust and fiduciary products and services to affluent, high-net worth, and ultra-high-net worth clients. It also operates through financial advisors in brokerage and wealth offices, consumer bank branches, independent offices, and digitally through WellsTrade and Intuitive Investor. The company was founded in 1852 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-12-2024 19:22:14"},{"Company Name":"Prologis, Inc.","Symbol":"PLD","Current Price":"104.72","Latest MA":"118.13","Price Target":130.33333,"Difference from MA":"-11.36%","Difference from Open":"-0.14%","Change from Yesterday":"-0.43%","Change from Last Report":"0.31","Latest Volume":"1,103,881","Market Cap":"96,984,408,064","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":39.19928,"ROE":0.05662,"DTE":57.079,"Industry":"REIT—Industrial","Sector":"Real Estate","Beta":1.094,"Trailing PEG":0.5152,"Trailing PE":31.540663,"Trailing PS":11.771081,"Quick Ratio":0.417,"Day High":104.98,"Day Low":103.64,"VS Average Volume":0.2803268801,"Company Summary":"Prologis, Inc. is the global leader in logistics real estate with a focus on high-barrier, high-growth markets. At September 30, 2024, the company owned or had investments in, on a wholly owned basis or through co-investment ventures, properties and development projects expected to total approximately 1.2 billion square feet (116 million square meters) in 20 countries. Prologis leases modern logistics facilities to a diverse base of approximately 6,700 customers principally across two major categories: business-to-business and retail\/online fulfilment.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-12-2024 19:22:14"},{"Company Name":"Devon Energy Corporation","Symbol":"DVN","Current Price":"32.17","Latest MA":"41.83","Price Target":50.11571,"Difference from MA":"-23.09%","Difference from Open":"2.91%","Change from Yesterday":"3.10%","Change from Last Report":"0.37","Latest Volume":"5,780,989","Market Cap":"21,132,470,272","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":6.704136,"ROE":0.26279,"DTE":64.021,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":2.071,"Trailing PEG":14.898,"Trailing PE":5.957407,"Trailing PS":1.4545027,"Quick Ratio":0.834,"Day High":32.18,"Day Low":31.11,"VS Average Volume":0.6047802946,"Company Summary":"Devon Energy Corporation, an independent energy company, engages in the exploration, development, and production of oil, natural gas, and natural gas liquids in the United States. It operates in Delaware, Eagle Ford, Anadarko, Williston, and Powder River Basins. The company was founded in 1971 and is headquartered in Oklahoma City, Oklahoma.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-12-2024 19:22:14"},{"Company Name":"JP Morgan Chase & Co.","Symbol":"JPM","Current Price":"240.14","Latest MA":"217.99","Price Target":247.39555,"Difference from MA":"10.16%","Difference from Open":"0.57%","Change from Yesterday":"-0.39%","Change from Last Report":"0.09","Latest Volume":"1,691,828","Market Cap":"676,075,732,992","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":14.127254,"ROE":0.16216,"DTE":"N\/A","Industry":"Banks—Diversified","Sector":"Financial Services","Beta":1.091,"Trailing PEG":4.7432,"Trailing PE":13.348527,"Trailing PS":4.1694975,"Quick Ratio":"N\/A","Day High":240.1905,"Day Low":237.11,"VS Average Volume":0.1950193091,"Company Summary":"JPMorgan Chase & Co. operates as a financial services company worldwide. It operates through three segments: Consumer & Community Banking, Commercial & Investment Bank, and Asset & Wealth Management. It offers deposit, investment and lending products, cash management, and payments and services; mortgage origination and servicing activities; residential mortgages and home equity loans; and credit cards, auto loans, leases, and travel services to consumers and small businesses through bank branches, ATMs, and digital and telephone banking. The company also provides investment banking products and services, including corporate strategy and structure advisory, and equity and debt market capital-raising services, as well as loan origination and syndication; payments; and cash and derivative instruments, risk management solutions, prime brokerage, and research, as well as offers securities services, including custody, fund accounting and administration, and securities lending products for asset managers, insurance companies, and public and private investment funds. In addition, it provides financial solutions, including lending, payments, investment banking, and asset management to small and midsized companies, local governments, nonprofit clients, and large corporations, as well as investors, developers, and owners of multifamily, office, retail, industrial, and affordable housing properties. Further, the company offers multi-asset investment management solutions in equities, fixed income, alternatives, and money market funds to institutional clients and retail investors; and retirement products and services, brokerage, custody, estate planning, lending, deposits, and investment management products to high net worth clients. JPMorgan Chase & Co. was founded in 1799 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-12-2024 19:22:14"},{"Company Name":"Kinder Morgan, Inc.","Symbol":"KMI","Current Price":"27.45","Latest MA":"22.94","Price Target":26.525,"Difference from MA":"19.66%","Difference from Open":"1.09%","Change from Yesterday":"0.99%","Change from Last Report":"0.18","Latest Volume":"2,802,193","Market Cap":"60,995,125,248","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":21.273876,"ROE":0.083500005,"DTE":101.433,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.907,"Trailing PEG":1.9902,"Trailing PE":24.296461,"Trailing PS":4.0258155,"Quick Ratio":0.291,"Day High":27.46,"Day Low":26.935,"VS Average Volume":0.2026934968,"Company Summary":"Kinder Morgan, Inc. operates as an energy infrastructure company primarily in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas gasification, liquefaction, and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and\/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, renewable fuel and feedstocks, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; owns interests in\/or operates oil fields and gasoline processing plants; and operates a crude oil pipeline system in West Texas, as well as owns and operates RNG and LNG facilities. It owns and operates approximately 82,000 miles of pipelines and 139 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1997 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-12-2024 19:23:15"},{"Company Name":"Charles Schwab Corporation (The","Symbol":"SCHW","Current Price":"73.96","Latest MA":"70.67","Price Target":83.9,"Difference from MA":"4.65%","Difference from Open":"-0.19%","Change from Yesterday":"-1.02%","Change from Last Report":"0.07","Latest Volume":"1,110,338","Market Cap":"135,388,217,344","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":20.025614,"ROE":0.12111,"DTE":144.242,"Industry":"Capital Markets","Sector":"Financial Services","Beta":0.952,"Trailing PEG":0.96,"Trailing PE":28.890625,"Trailing PS":7.2261,"Quick Ratio":0.481,"Day High":74.275,"Day Low":73.32,"VS Average Volume":0.139925489,"Company Summary":"The Charles Schwab Corporation, together with its subsidiaries, operates as a savings and loan holding company that provides wealth management, securities brokerage, banking, asset management, custody, and financial advisory services in the United States and internationally. The company operates in two segments, Investor Services and Advisor Services. It offers brokerage accounts with equity and fixed income trading, margin lending, options trading, futures and forex trading, and cash management capabilities, including certificates of deposit; third-party mutual funds through the Mutual Fund Marketplace and Mutual Fund OneSource service, as well as mutual fund trading and clearing services to broker-dealers; exchange-traded funds; advisory solutions for managed portfolios, separately managed accounts, customized personal advice for tailored portfolios, specialized planning, and full-time portfolio management; banking products comprising checking and savings accounts, first lien residential real estate mortgage loans, home equity lines of credit, and pledged asset lines; and trust custody services, personal trust reporting services, and administrative trustee services. It also provides digital retirement calculators; integrated web-, mobile-, and software-based trading platforms, real-time market data, options trading, premium research, and multi-channel access; self-service education and support tools; online research and analysis tools; equity compensation plan sponsors full-service recordkeeping for stock plans, stock options, restricted stock, performance shares, and stock appreciation rights; retirement plan services; mutual fund clearing services; and advisor services, including interactive tools and educational content. The Company operates through branch offices. The Charles Schwab Corporation was founded in 1971 and is headquartered in Westlake, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-12-2024 19:23:15"},{"Company Name":"UnitedHealth Group Incorporated","Symbol":"UNH","Current Price":"507.15","Latest MA":"555.94","Price Target":636.04694,"Difference from MA":"-8.77%","Difference from Open":"0.06%","Change from Yesterday":"-0.55%","Change from Last Report":"0.13","Latest Volume":"1,703,739","Market Cap":"466,726,649,856","Earning Date":"2025-01-10","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":17.790655,"ROE":0.15252,"DTE":74.683,"Industry":"Healthcare Plans","Sector":"Healthcare","Beta":0.591,"Trailing PEG":1.4103,"Trailing PE":32.932144,"Trailing PS":1.1848922,"Quick Ratio":0.833,"Day High":507.45,"Day Low":500.66,"VS Average Volume":0.3834822143,"Company Summary":"UnitedHealth Group Incorporated operates as a diversified health care company in the United States. The company operates through four segments: UnitedHealthcare, Optum Health, Optum Insight, and Optum Rx. The UnitedHealthcare segment offers consumer-oriented health benefit plans and services for national employers, public sector employers, mid-sized employers, small businesses, and individuals; health care coverage, and health and well-being services to individuals age 50 and older addressing their needs; Medicaid plans, children's health insurance and health care programs; and health and dental benefits, and hospital and clinical services, as well as health care benefits products and services to state programs caring for the economically disadvantaged, medically underserved, and those without the benefit of employer-funded health care coverage. The Optum Health segment provides care delivery, care management, wellness and consumer engagement, and health financial services patients, consumers, care delivery systems, providers, employers, payers, and public-sector entities. The Optum Insight segment offers software and information products, advisory consulting arrangements, and managed services outsourcing contracts to hospital systems, physicians, health plans, governments, life sciences companies, and other organizations. The Optum Rx segment provides pharmacy care services and programs, including retail network contracting, home delivery, specialty and community health pharmacy services, infusion, and purchasing and clinical capabilities, as well as develops programs in the areas of step therapy, formulary management, drug adherence, and disease\/drug therapy management. UnitedHealth Group Incorporated was founded in 1974 and is based in Minnetonka, Minnesota.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"30-12-2024 19:23:15"},{"Company Name":"Delta Air Lines, Inc.","Symbol":"DAL","Current Price":"61.01","Latest MA":"51.01","Price Target":75.74636,"Difference from MA":"19.61%","Difference from Open":"1.40%","Change from Yesterday":"-0.45%","Change from Last Report":"0.13","Latest Volume":"2,058,915","Market Cap":"39,368,593,408","Earning Date":"2025-01-10","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":8.32868,"ROE":0.4067,"DTE":186.78,"Industry":"Airlines","Sector":"Industrials","Beta":1.341,"Trailing PEG":null,"Trailing PE":8.461858,"Trailing PS":0.652803,"Quick Ratio":0.268,"Day High":61.16,"Day Low":59.36,"VS Average Volume":0.2534906887,"Company Summary":"Delta Air Lines, Inc. provides scheduled air transportation for passengers and cargo in the United States and internationally. The company operates through two segments, Airline and Refinery. Its domestic network centered on core hubs in Atlanta, Minneapolis-St. Paul, Detroit, and Salt Lake City, as well as coastal hub positions in Boston, Los Angeles, New York-LaGuardia, New York-JFK, and Seattle; and international network centered on hubs and market presence in Amsterdam, Bogota, Lima, Mexico City, London-Heathrow, Paris-Charles de Gaulle, Sao Paulo, Seoul-Incheon, and Tokyo. The company sells its tickets through various distribution channels, including delta.com and the Fly Delta app; acts as a reservations specialists; and operates online travel and traditional brick and mortar agencies. It also provides aircraft maintenance and engineering support, repair, and overhaul services; and vacation packages to third-party consumers. The company operates through a fleet of approximately 1,273 aircrafts. Delta Air Lines, Inc. was founded in 1924 and is based in Atlanta, Georgia.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"30-12-2024 19:23:15"},{"Company Name":"Walgreens Boots Alliance, Inc.","Symbol":"WBA","Current Price":"9.39","Latest MA":"10.65","Price Target":10.35714,"Difference from MA":"-11.82%","Difference from Open":"-0.90%","Change from Yesterday":"-2.49%","Change from Last Report":"0.48","Latest Volume":"5,632,910","Market Cap":"8,112,470,016","Earning Date":"2025-01-02","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":22.60424,"ROE":-0.75969005,"DTE":277.898,"Industry":"Pharmaceutical Retailers","Sector":"Healthcare","Beta":0.669,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.054940946,"Quick Ratio":0.332,"Day High":9.53,"Day Low":9.3,"VS Average Volume":0.2391659856,"Company Summary":"Walgreens Boots Alliance, Inc. operates as a healthcare, pharmacy, and retail company in the United States, Germany, the United Kingdom, and internationally. It operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The U.S. Retail Pharmacy segment engages in operation of the retail drugstores, health and wellness services, specialty, and home delivery pharmacy services, which offers health and wellness, beauty, personal care and consumables, and general merchandise. The International segment offers sale of prescription drugs and health and wellness, beauty, personal care, and other consumer products outside the United States; and operates pharmacy-led health and beauty retail businesses under the Boots brand stores in the United Kingdom, the Republic of Ireland, and Thailand, as well as the Benavides brand in Mexico and the Ahumada brand in Chile. The U.S. Healthcare segment provides VillageMD, a national provider of value-based care with primary, multi-specialty, and urgent care providers serving patients in traditional clinic settings, in patients' homes and online appointments; Shields, a specialty pharmacy integrator and accelerator for hospitals; and CareCentrix, a participant in the post-acute and home care management sectors. Walgreens Boots Alliance, Inc. was founded in 1909 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"30-12-2024 19:23:15"}]