[{"Company Name":"United States Steel Corporation","Symbol":"X","Current Price":"37.21","Latest MA":"37.18","Price Target":40.56625,"Difference from MA":"0.08%","Difference from Open":"1.36%","Change from Yesterday":"1.78%","Change from Last Report":"0.03","Latest Volume":"3,107,272","Market Cap":"8,378,613,248","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":16.669579,"PB Ratio":0.72364837,"ROE":0.03452,"DTE":37.015,"Industry":"Steel","Sector":"Basic Materials","Beta":1.861,"Trailing PEG":null,"Trailing PE":23.550632,"Trailing PS":0.5148149,"Quick Ratio":0.991,"Day High":37.4199,"Day Low":35.85,"VS Average Volume":0.4690818771,"Company Summary":"United States Steel Corporation produces and sells flat-rolled and tubular steel products primarily in North America and Europe. The company operates through North American Flat-Rolled (Flat-Rolled), Mini Mill, U. S. Steel Europe (USSE), and Tubular Products (Tubular) segments. The Flat-Rolled segment offers slabs, strip mill plates, sheets, and tin mill products, as well as iron ore and coke. This segment serves customers in the service center, conversion, transportation, automotive, construction, container, appliance, and electrical markets. The Mini Mill segment provides hot-rolled, cold-rolled, and coated sheets and electrical steel products. This segment serves customers in the automotive, construction, pipe and tube, sheet converter, electrical, solar industrial equipment, and service center markets. The USSE segment provides slabs, strip mill plates, sheets, tin mill products, and spiral welded pipes. This segment serves customers in the construction, container, appliance and electrical, service center, conversion, oil, gas, and petrochemical markets. The Tubular segment offers seamless and electric resistance welded steel casing and tubing products, as well as standard and line pipe and mechanical tubing products primarily to customers in the oil, gas, and petrochemical markets. It also engages in the real estate business. United States Steel Corporation was founded in 1901 and is headquartered in Pittsburgh, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"International Paper Company","Symbol":"IP","Current Price":"55.29","Latest MA":"49.53","Price Target":56.23,"Difference from MA":"11.63%","Difference from Open":"-1.27%","Change from Yesterday":"-0.38%","Change from Last Report":"-0.05","Latest Volume":"1,511,948","Market Cap":"19,208,187,904","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":18.339222,"PB Ratio":2.225935,"ROE":0.04797,"DTE":69.707,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":0.988,"Trailing PEG":0.4924,"Trailing PE":47.256413,"Trailing PS":1.0304823,"Quick Ratio":1.021,"Day High":56.35,"Day Low":55.02,"VS Average Volume":0.3441029267,"Company Summary":"International Paper Company produces and sells renewable fiber-based packaging and pulp products in North America, Latin America, Europe, and North Africa. It operates through two segments, Industrial Packaging and Global Cellulose Fibers. The company offers linerboard, medium, whitetop, recycled linerboard, recycled medium and saturating kraft; and pulp for a range of applications, such as diapers, towel and tissue products, feminine care, incontinence, and other personal care products, as well as specialty pulps for use in textiles, construction materials, paints, coatings, and others. It sells its products directly to end users and converters, as well as through agents, resellers, and distributors. The company was founded in 1898 and is headquartered in Memphis, Tennessee.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Intel Corporation","Symbol":"INTC","Current Price":"19.54","Latest MA":"24.07","Price Target":24.21059,"Difference from MA":"-18.83%","Difference from Open":"0.72%","Change from Yesterday":"1.77%","Change from Last Report":"0.28","Latest Volume":"27,371,670","Market Cap":"84,254,449,664","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":19.983429,"PB Ratio":0.8457076,"ROE":-0.15597,"DTE":47.906,"Industry":"Semiconductors","Sector":"Technology","Beta":1.026,"Trailing PEG":0.5186,"Trailing PE":"N\/A","Trailing PS":1.5531634,"Quick Ratio":0.833,"Day High":19.55,"Day Low":19.171,"VS Average Volume":0.3926440523,"Company Summary":"Intel Corporation designs, develops, manufactures, markets, and sells computing and related products and services worldwide. It operates through Client Computing Group, Data Center and AI, Network and Edge, Mobileye, and Intel Foundry Services segments. The company's products portfolio comprises central processing units and chipsets, system-on-chips (SoCs), and multichip packages; mobile and desktop processors; hardware products comprising graphics processing units (GPUs), domain-specific accelerators, and field programmable gate arrays (FPGAs); and memory and storage, connectivity and networking, and other semiconductor products. It also offers silicon devices and software products; and optimization solutions for workloads, such as AI, cryptography, security, storage, networking, and leverages various features supporting diverse compute environments. In addition, the company develops and deploys advanced driver assistance systems (ADAS), and autonomous driving technologies and solutions; and provides advanced process technologies backed by an ecosystem of IP, EDA, and design services, as well as systems of chips, including advanced packaging technologies, software and accelerate bring-up, and integration of chips and driving standards. Further, it delivers and deploys intelligent edge platforms that allow developers to achieve agility and drive automation using AI for efficient operations with data integrity, as well as provides hardware and software platforms, tools, and ecosystem partnerships for digital transformation from the cloud to edge. The company serves original equipment manufacturers, original design manufacturers, cloud service providers, and other manufacturers and service providers. It has a strategic agreement with Synopsys, Inc. to develop EDA and IP solutions; and ARM that enables chip designers to build optimized compute SoCs on the Intel 18A process. Intel Corporation was incorporated in 1968 and is headquartered in Santa Clara, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"CNX Resources Corporation","Symbol":"CNX","Current Price":"30.56","Latest MA":"31.23","Price Target":30.30769,"Difference from MA":"-2.14%","Difference from Open":"-0.13%","Change from Yesterday":"0.73%","Change from Last Report":"-0.03","Latest Volume":"1,200,039","Market Cap":"4,561,721,856","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":13.057373,"PB Ratio":1.0715663,"ROE":0.13833,"DTE":56.482,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":1.375,"Trailing PEG":null,"Trailing PE":9.954397,"Trailing PS":3.3315744,"Quick Ratio":0.172,"Day High":30.71,"Day Low":30.165,"VS Average Volume":0.4444588889,"Company Summary":"CNX Resources Corporation, an independent natural gas and midstream company, engages in the acquisition, exploration, development, and production of natural gas properties in the Appalachian Basin. The company operates in two segments, Shale and Coalbed Methane (CBM). It produces and sells pipeline quality natural gas primarily for gas wholesalers. The company owns rights to extract natural gas from shale properties in Pennsylvania, West Virginia, and Ohio, as well as rights to extract natural gas from other shale and shallow oil and gas formations in Illinois, Indiana, New York, and Virginia. It also owns rights to extract CBM in Virginia, West Virginia, Pennsylvania, Ohio, Illinois, Indiana, and New Mexico. In addition, the company designs, builds, and operates natural gas gathering systems to move gas from the wellhead to interstate pipelines or other local sales points; owns and operates approximately 2,600 miles of natural gas gathering pipelines, as well as various natural gas processing facilities. It also offers turn-key solutions for water sourcing, delivery, and disposal for its natural gas operations and for third parties. The company was formerly known as CONSOL Energy Inc. and changed its name to CNX Resources Corporation in November 2017. CNX Resources Corporation was founded in 1860 and is headquartered in Canonsburg, Pennsylvania.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Baker Hughes Company","Symbol":"BKR","Current Price":"45.58","Latest MA":"37.51","Price Target":46.86962,"Difference from MA":"21.53%","Difference from Open":"0.18%","Change from Yesterday":"1.02%","Change from Last Report":"-0.08","Latest Volume":"2,496,127","Market Cap":"45,102,596,096","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":17.83988,"PB Ratio":2.784702,"ROE":0.14292,"DTE":36.933,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.363,"Trailing PEG":1.0044,"Trailing PE":20.439463,"Trailing PS":1.6521097,"Quick Ratio":0.749,"Day High":45.805,"Day Low":45.21,"VS Average Volume":0.3928120006,"Company Summary":"Baker Hughes Company provides a portfolio of technologies and services to energy and industrial value chain worldwide. The company operates through Oilfield Services & Equipment (OFSE) and Industrial & Energy Technology (IET) segments. The OFSE segment designs and manufactures products and provides related services, including exploration, appraisal, development, production, rejuvenation, and decommissioning for onshore and offshore oilfield operations. This segment also provides drilling services, drill bits, and drilling and completions fluids; completions, intervention, measurements, pressure pumping, and wireline services; artificial lift systems, and oilfield and industrial chemicals; subsea projects and services, flexible pipe systems, and surface pressure control systems; and integrated well services and solutions. It serves oil and natural gas companies; the United States and international independent oil and natural gas companies; national or state-owned oil companies; engineering, procurement, and construction contractors; geothermal companies; and other oilfield service companies. The IET segment provides gas technology equipment, including drivers, driven equipment, flow control, and turnkey solutions for the mechanical-drive, compression, and power-generation applications; and energy sectors, such as oil and gas, LNG operations, petrochemical, and carbon solutions. This segment also provides rack-based vibration monitoring equipment and sensors; integrated asset performance management products; inspection services; pumps, valves, and gears; precision sensors and instrumentation, and condition monitoring solutions. It serves upstream, midstream, downstream, onshore, offshore, and small and large scale customers. The company was formerly known as Baker Hughes, a GE company and changed its name to Baker Hughes Company in October 2019. Baker Hughes Company was incorporated in 2016 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"BILL Holdings, Inc.","Symbol":"BILL","Current Price":"86.39","Latest MA":"63.11","Price Target":93.83478,"Difference from MA":"36.88%","Difference from Open":"2.09%","Change from Yesterday":"5.33%","Change from Last Report":"0.19","Latest Volume":"1,738,850","Market Cap":"8,940,589,056","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":41.633133,"PB Ratio":2.2275658,"ROE":0.0019400001,"DTE":24.304,"Industry":"Software - Application","Sector":"Technology","Beta":1.594,"Trailing PEG":1.624,"Trailing PE":1234.0714,"Trailing PS":6.6540213,"Quick Ratio":0.53,"Day High":86.51,"Day Low":84.1,"VS Average Volume":0.7336585506,"Company Summary":"BILL Holdings, Inc. provides financial operations platform for small and midsize businesses worldwide. The company provides software-as-a-service, cloud-based payments, and spend management products, which allow users to automate accounts payable and accounts receivable transactions, as well as enable businesses to connect with their suppliers and\/or customers to do business, eliminate expense reports, manage cash flows, and improve office efficiency. It also offers onboarding implementation support, and ongoing support and training services. In addition, the company's artificial intelligence enabled financial software platform provides connections between suppliers and clients. It serves accounting firms, financial institutions, and software companies. The company was formerly known as Bill.com Holdings, Inc. and changed its name to BILL Holdings, Inc. in February 2023. BILL Holdings, Inc. was incorporated in 2006 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Apple Inc.","Symbol":"AAPL","Current Price":"237.68","Latest MA":"228.33","Price Target":247.925,"Difference from MA":"4.10%","Difference from Open":"1.30%","Change from Yesterday":"1.86%","Change from Last Report":"0.14","Latest Volume":"18,110,954","Market Cap":"3,574,207,873,024","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":28.62056,"PB Ratio":63.0953,"ROE":1.5741299,"DTE":209.059,"Industry":"Consumer Electronics","Sector":"Technology","Beta":1.24,"Trailing PEG":2.1258,"Trailing PE":39.027912,"Trailing PS":9.140379,"Quick Ratio":0.745,"Day High":238.54,"Day Low":234.43,"VS Average Volume":0.4041509539,"Company Summary":"Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod. It also provides AppleCare support and cloud services; and operates various platforms, including the App Store that allow customers to discover and download applications and digital content, such as books, music, video, games, and podcasts, as well as advertising services include third-party licensing arrangements and its own advertising platforms. In addition, the company offers various subscription-based services, such as Apple Arcade, a game subscription service; Apple Fitness+, a personalized fitness service; Apple Music, which offers users a curated listening experience with on-demand radio stations; Apple News+, a subscription news and magazine service; Apple TV+, which offers exclusive original content; Apple Card, a co-branded credit card; and Apple Pay, a cashless payment service, as well as licenses its intellectual property. The company serves consumers, and small and mid-sized businesses; and the education, enterprise, and government markets. It distributes third-party applications for its products through the App Store. The company also sells its products through its retail and online stores, and direct sales force; and third-party cellular network carriers, wholesalers, retailers, and resellers. Apple Inc. was founded in 1976 and is headquartered in Cupertino, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Comcast Corporation","Symbol":"CMCSA","Current Price":"36.47","Latest MA":"39.56","Price Target":47.84536,"Difference from MA":"-7.83%","Difference from Open":"-1.04%","Change from Yesterday":"0.38%","Change from Last Report":"-0.03","Latest Volume":"10,639,137","Market Cap":"139,534,778,368","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":8.337449,"PB Ratio":1.6300849,"ROE":0.16884,"DTE":117.127,"Industry":"Telecom Services","Sector":"Communication Services","Beta":1.004,"Trailing PEG":1.1288,"Trailing PE":9.828841,"Trailing PS":1.1337838,"Quick Ratio":0.605,"Day High":36.85,"Day Low":36.36,"VS Average Volume":0.5201531702,"Company Summary":"Comcast Corporation operates as a media and technology company worldwide. It operates through Residential Connectivity & Platforms, Business Services Connectivity, Media, Studios, and Theme Parks segments. The Residential Connectivity & Platforms segment provides residential broadband and wireless connectivity services, residential and business video services, sky-branded entertainment television networks, and advertising. The Business Services Connectivity segment offers connectivity services for small business locations, which include broadband, wireline voice, and wireless services, as well as solutions for medium-sized customers and larger enterprises; and small business connectivity services in the United Kingdom. The Media segment operates NBCUniversal's television and streaming business, including national and regional cable networks; the NBC and Telemundo broadcast networks and owned local broadcast television stations; and Peacock, a direct-to-consumer streaming services. It also operates international television networks comprising the Sky Sports networks, as well as other digital properties. The Studios segment operates NBCUniversal and Sky film and television studio production and distribution operations. The Theme Parks segment operates Universal theme parks in Orlando, Florida; Hollywood, California; Osaka, Japan; and Beijing, China. The company also offers a consolidated streaming platforms under the Philadelphia Flyers and the Wells Fargo Center arena in Philadelphia, Pennsylvania; and Xumo. Comcast Corporation was founded in 1963 and is headquartered in Philadelphia, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"PENN Entertainment, Inc.","Symbol":"PENN","Current Price":"20.43","Latest MA":"19.30","Price Target":23.20588,"Difference from MA":"5.86%","Difference from Open":"-2.58%","Change from Yesterday":"-1.07%","Change from Last Report":"0.05","Latest Volume":"2,372,633","Market Cap":"3,118,210,304","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":28.082474,"PB Ratio":0.9974125,"ROE":-0.16457,"DTE":369.728,"Industry":"Resorts & Casinos","Sector":"Consumer Cyclical","Beta":2.086,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.4946007,"Quick Ratio":0.789,"Day High":21.18,"Day Low":20.32,"VS Average Volume":0.7005757834,"Company Summary":"PENN Entertainment, Inc., together with its subsidiaries, provides integrated entertainment, sports content, and casino gaming experiences. The company operates through five segments: Northeast, South, West, Midwest, and Interactive. It operates online sports betting in various jurisdictions; and iCasino under Hollywood Casino, L'Auberge, ESPN BET, and theScore Bet Sportsbook and Casino brands. The company's portfolio also includes PENN Play, customer loyalty program, which offers a set of rewards and experiences for business channels. In addition, it owns various trademarks and service marks, including Ameristar, Argosy, Boomtown, Hollywood Casino, Hollywood Gaming, L'Auberge, PENN Play, theScore, theScore Bet, theScore esports, and M Resort. The company was formerly known as Penn National Gaming, Inc. and changed its name to PENN Entertainment, Inc. in August 2022. PENN Entertainment, Inc. was founded in 1972 and is based in Wyomissing, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"PulteGroup, Inc.","Symbol":"PHM","Current Price":"115.56","Latest MA":"125.66","Price Target":143.2143,"Difference from MA":"-8.03%","Difference from Open":"-1.62%","Change from Yesterday":"2.69%","Change from Last Report":"-0.13","Latest Volume":"1,375,495","Market Cap":"23,699,275,776","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":8.390853,"PB Ratio":2.0522838,"ROE":0.26705,"DTE":19.411,"Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":1.641,"Trailing PEG":0.2907,"Trailing PE":8.528413,"Trailing PS":1.3684127,"Quick Ratio":0.553,"Day High":117.49,"Day Low":114.49,"VS Average Volume":0.7366906483,"Company Summary":"PulteGroup, Inc., through its subsidiaries, primarily engages in the homebuilding business in the United States. It acquires and develops land primarily for residential purposes; and constructs housing on such land. The company also offers various home designs, including single-family detached, townhomes, condominiums, and duplexes under the Centex, Pulte Homes, Del Webb, DiVosta Homes, John Wieland Homes and Neighborhoods, and American West brand names. In addition, the company arranges financing through the origination of mortgage loans primarily for homebuyers; sells the servicing rights for the originated loans; and provides title insurance policies, and examination and closing services to homebuyers. PulteGroup, Inc. was founded in 1950 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Eaton Corporation, PLC","Symbol":"ETN","Current Price":"341.59","Latest MA":"327.61","Price Target":379.6429,"Difference from MA":"4.27%","Difference from Open":"-1.53%","Change from Yesterday":"0.35%","Change from Last Report":"-0.04","Latest Volume":"1,838,420","Market Cap":"134,996,369,408","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":28.315992,"PB Ratio":7.0615835,"ROE":0.20079,"DTE":52.594,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":1.01,"Trailing PEG":2.9522,"Trailing PE":36.37806,"Trailing PS":5.486542,"Quick Ratio":0.911,"Day High":349.69,"Day Low":341.06,"VS Average Volume":0.9417363331,"Company Summary":"Eaton Corporation plc operates as a power management company worldwide. The company's Electrical Americas and Electrical Global segment provides electrical components, industrial components, power distribution and assemblies, residential products, single and three phase power quality and connectivity products, wiring devices, circuit protection products, utility power distribution products, power reliability equipment, and services, as well as hazardous duty electrical equipment, emergency lighting, fire detection, explosion-proof instrumentation, and structural support systems. Its Aerospace segment offers pumps, motors, hydraulic power units, hoses and fittings, and electro-hydraulic pumps; valves, cylinders, electronic controls, electromechanical actuators, sensors, aircraft flap and slat systems, and nose wheel steering systems; hose, thermoplastic tubing products, fittings, adapters, couplings, and sealing and ducting products; air-to-air refueling systems, fuel pumps, fuel inerting products, sensors, and adapters and regulators; oxygen generation system, payload carriages, and thermal management products; and wiring connectors and cables, as well as hydraulic and bag filters, strainers and cartridges, and golf grips for manufacturers of commercial and military aircraft, and related after-market customers, as well as industrial applications. The company's Vehicle segment offers transmissions, clutches, hybrid power systems, superchargers, engine valves and valve actuation systems, locking and limited slip differentials, transmission controls, and fuel vapor components for the vehicle industry. Its eMobility segment provides voltage inverters, converters, fuses, circuit protection units, vehicle controls, power distribution systems, fuel tank isolation valves, and commercial vehicle hybrid systems. Eaton Corporation plc was founded in 1911 and is based in Dublin, Ireland.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Tractor Supply Company","Symbol":"TSCO","Current Price":"53.01","Latest MA":"54.82","Price Target":57.95033,"Difference from MA":"-3.30%","Difference from Open":"-1.74%","Change from Yesterday":"-0.30%","Change from Last Report":"-0.17","Latest Volume":"2,386,196","Market Cap":"28,317,675,520","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":24.078709,"PB Ratio":2.4764085,"ROE":0.5058,"DTE":233.038,"Industry":"Specialty Retail","Sector":"Consumer Cyclical","Beta":0.814,"Trailing PEG":2.5009,"Trailing PE":25.73301,"Trailing PS":1.9173024,"Quick Ratio":0.086,"Day High":54.42,"Day Low":52.81,"VS Average Volume":0.4589353881,"Company Summary":"Tractor Supply Company operates as a rural lifestyle retailer in the United States. The company offers various merchandise, including livestock and equine feed and equipment, poultry, fencing, and sprayers and chemicals; food, treats, and equipment for dogs, cats, and other small animals, as well as dog wellness products; seasonal and recreation products comprising tractors and riders, lawn and garden, bird feeding, power equipment, and other recreational products; truck, tool, and hardware products, such as truck accessories, trailers, generators, lubricants, batteries, and hardware and tools; and clothing, gift, and décor products consist of clothing, footwear, toys, snacks, and decorative merchandise. It provides its products under the 4health, Paws & Claws, American Farmworks, Producer's Pride, Bit & Bridle, Red Shed, Blue Mountain, Redstone, C.E. Schmidt, Retriever, Country Lane, Ridgecut, Countyline, Royal Wing, Country Tuff, Strive, Dumor, Traveller, Farm Table, Treeline, Groundwork, TSC Tractor Supply Co, Huskee, Untamed, and JobSmart brand names. The company operates its retail stores under the Tractor Supply Company, Petsense by Tractor Supply, and Orscheln Farm and Home names; and operates websites under the TractorSupply.com and Petsense.com names. It sells its products to recreational farmers, ranchers, and others. Tractor Supply Company was founded in 1938 and is based in Brentwood, Tennessee.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Gen Digital Inc.","Symbol":"GEN","Current Price":"27.54","Latest MA":"26.83","Price Target":31.232,"Difference from MA":"2.63%","Difference from Open":"0.00%","Change from Yesterday":"1.51%","Change from Last Report":"0.05","Latest Volume":"1,204,245","Market Cap":"16,972,792,832","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":11.237882,"PB Ratio":8.0857315,"ROE":0.2766,"DTE":409.342,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.054,"Trailing PEG":0.6325,"Trailing PE":27.818182,"Trailing PS":4.3936815,"Quick Ratio":0.273,"Day High":27.61,"Day Low":27.2,"VS Average Volume":0.3531145759,"Company Summary":"Gen Digital Inc. engages in the provision of cyber safety solutions for consumers in the United States, Canada, Latin America, Europe, the Middle East, Africa, the Asia Pacific, and Japan. The company offers security and performance products under Norton, Avast, Avira, AVG, and CCleaner brands that provide real-time protection and maintenance for PCs, Macs, and mobile devices against malware, viruses, adware, and other online threats. It also provides identity protection solutions, including LifeLock Identity Theft Protection, Avast and AVG Secure Identity, Norton Identity Theft Protection, and Dark Web Monitoring for monitoring of credit reports, financial accounts, the dark web, and social media accounts to help safeguard customers' personal information. In addition, the company offers Virtual Private Network (VPN) solutions under Norton, Avast and AVG brands to enhance security and online privacy that allows customers to securely transmit and access private information, such as passwords, bank details, and credit card numbers, when using public Wi-Fi on PCs, Macs, and mobile iOS and Android devices; AntiTrack and Secure Browser products which helps to keep personal information and browsing activity anonymous while browsing online; and Privacy Monitor Assistant and BreachGuard products for removing customers' data from public data broker sites; and ReputationDefender, a white glove service that helps customers manage all aspects of their personal branding online, including search results, social media sites, and overall web presence. It markets and sells its products and related services through retailers, telecom service providers, hardware original equipment manufacturers, and employee benefit providers, as well as e-commerce platform. The company was formerly known as NortonLifeLock Inc. and changed its name to Gen Digital Inc. in November 2022. Gen Digital Inc. was founded in 1982 and is headquartered in Tempe, Arizona.","Stock Sentiment":"N\/A","Row Color":"positive-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Peloton Interactive, Inc.","Symbol":"PTON","Current Price":"8.94","Latest MA":"5.85","Price Target":9.29118,"Difference from MA":"52.88%","Difference from Open":"-2.21%","Change from Yesterday":"2.63%","Change from Last Report":"-0.07","Latest Volume":"6,997,858","Market Cap":"3,409,633,280","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":-40.629093,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Leisure","Sector":"Consumer Cyclical","Beta":1.927,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":1.2671919,"Quick Ratio":1.287,"Day High":9.28,"Day Low":8.883,"VS Average Volume":0.4032467148,"Company Summary":"Peloton Interactive, Inc. operates integrated fitness platform in North America and internationally. The company offers connected fitness products under the Peloton Bike, Peloton Bike+, Peloton Tread, Peloton Tread+, Peloton Guide, and Peloton Row names. The company markets and sells its products through e-commerce and inside sales, retail showrooms, and third party retailers. Peloton Interactive, Inc. was founded in 2012 and is headquartered in New York, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Baxter International Inc.","Symbol":"BAX","Current Price":"30.35","Latest MA":"34.51","Price Target":40.08429,"Difference from MA":"-12.05%","Difference from Open":"-1.49%","Change from Yesterday":"-0.82%","Change from Last Report":"-0.26","Latest Volume":"1,822,177","Market Cap":"15,496,345,600","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":12.2316885,"PB Ratio":1.9680955,"ROE":0.01627,"DTE":166.129,"Industry":"Medical Instruments & Supplies","Sector":"Healthcare","Beta":0.604,"Trailing PEG":null,"Trailing PE":121.4,"Trailing PS":1.0288372,"Quick Ratio":0.517,"Day High":31.04,"Day Low":30.17,"VS Average Volume":0.4282970617,"Company Summary":"Baxter International Inc., through its subsidiaries, develops and provides a portfolio of healthcare products worldwide. The company operates through four segments: Medical Products and Therapies, Healthcare Systems and Technologies, Pharmaceuticals, and Kidney Care. The company offers sterile intravenous (IV) solutions; infusion systems and devices; parenteral nutrition therapies; generic injectable pharmaceuticals; surgical hemostat and sealant products, advanced surgical equipment; smart bed systems; patient monitoring and diagnostic technologies; and respiratory health devices, as well as advanced equipment for the surgical space, including surgical video technologies, precision positioning devices, and other accessories. It also provides administrative sets; adhesion prevention products; inhaled anesthesia; drug compounding; chronic and acute dialysis therapies and services, including peritoneal dialysis (PD), hemodialysis (HD), continuous renal replacement therapies (CRRT), and other organ support therapies. The company's products are used in hospitals, kidney dialysis centers, nursing homes, rehabilitation centers, ambulatory surgery centers, doctors' offices, and patients at home under physician supervision. The company sells its products through direct sales force, as well as through independent distributors, drug wholesalers, and specialty pharmacy or other alternate site providers in approximately 100 countries. It has an agreement with Celerity Pharmaceutical, LLC to develop acute care generic injectable premix and oncolytic products; and a collaborative research agreement with Miromatrix Medical Inc. aiming to advance care for patients with acute liver failure. Baxter International Inc. was incorporated in 1931 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Edwards Lifesciences Corporatio","Symbol":"EW","Current Price":"70.80","Latest MA":"72.98","Price Target":79.57483,"Difference from MA":"-2.99%","Difference from Open":"-0.88%","Change from Yesterday":"-0.30%","Change from Last Report":"-0.13","Latest Volume":"1,398,894","Market Cap":"41,757,843,456","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":28.94013,"PB Ratio":4.374691,"ROE":0.19139,"DTE":7.353,"Industry":"Medical Devices","Sector":"Healthcare","Beta":1.12,"Trailing PEG":6.5234,"Trailing PE":27.335909,"Trailing PS":6.61259,"Quick Ratio":2.704,"Day High":72.095,"Day Low":70.71,"VS Average Volume":0.2809793122,"Company Summary":"Edwards Lifesciences Corporation provides products and technologies for structural heart disease and critical care monitoring in the United States, Europe, Japan, and internationally. It offers transcatheter heart valve replacement products for the minimally invasive replacement of aortic heart valves under the Edwards SAPIEN family of valves system; and transcatheter heart valve repair and replacement products to treat mitral and tricuspid valve diseases under the PASCAL PRECISION and Cardioband names. The company also provides surgical structural heart solutions, such as aortic surgical valve under the INSPIRIS name; INSPIRIS RESILLA aortic valve, which offers RESILIA tissue and VFit technology; KONECT RESILIA, a pre-assembled tissue valves conduit for complex combined procedures; and MITRIS RESILIA valve. In addition, it offers critical care solutions, including hemodynamic monitoring systems to measure a patient's heart function and fluid status in surgical and intensive care settings under the FloTrac, Acumen IQ sensors, ClearSight, Acumen IQ cuffs, and ForeSight names; HemoSphere, a monitoring platform that displays physiological information; and Acumen Hypotension Prediction Index software that alerts clinicians in advance of a patient developing dangerously low blood pressure. The company distributes its products through a direct sales force and independent distributors. Edwards Lifesciences Corporation was founded in 1958 and is headquartered in Irvine, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Southwest Airlines Company","Symbol":"LUV","Current Price":"32.85","Latest MA":"29.67","Price Target":32.2581,"Difference from MA":"10.75%","Difference from Open":"-2.42%","Change from Yesterday":"-0.78%","Change from Last Report":"0.06","Latest Volume":"1,937,894","Market Cap":"19,704,358,912","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":19.976772,"PB Ratio":1.8926783,"ROE":-0.00447,"DTE":87.36,"Industry":"Airlines","Sector":"Industrials","Beta":1.153,"Trailing PEG":0.4974,"Trailing PE":"N\/A","Trailing PS":0.71976763,"Quick Ratio":0.783,"Day High":33.635,"Day Low":32.765,"VS Average Volume":0.2801615137,"Company Summary":"Southwest Airlines Co. operates as a passenger airline company that provides scheduled air transportation services in the United States and near-international markets. As of December 31, 2023, the company operated a total fleet of 817 Boeing 737 aircraft; and served 121 destinations in 42 states, the District of Columbia, and the Commonwealth of Puerto Rico, as well as ten near-international countries, including Mexico, Jamaica, the Bahamas, Aruba, the Dominican Republic, Costa Rica, Belize, Cuba, the Cayman Islands, and Turks and Caicos. It also provides inflight entertainment and connectivity services on Wi-Fi enabled aircraft; and Rapid Rewards loyalty program that enables program members to earn points for dollars spent on Southwest base fares. In addition, the company offers a suite of digital platforms to support customers' travel needs, including websites and apps; and SWABIZ, an online booking tool. Further, it provides ancillary services, such as Southwest's EarlyBird Check-In, upgraded boarding, and transportation of pets and unaccompanied minors. Southwest Airlines Co. was incorporated in 1967 and is headquartered in Dallas, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Thermo Fisher Scientific Inc","Symbol":"TMO","Current Price":"553.06","Latest MA":"568.15","Price Target":646.08,"Difference from MA":"-2.66%","Difference from Open":"-0.86%","Change from Yesterday":"-0.84%","Change from Last Report":"-0.02","Latest Volume":"1,964,669","Market Cap":"211,545,456,640","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":23.740414,"PB Ratio":4.3179474,"ROE":0.12944001,"DTE":72.329,"Industry":"Diagnostics & Research","Sector":"Healthcare","Beta":0.792,"Trailing PEG":2.1472,"Trailing PE":34.71814,"Trailing PS":4.9928126,"Quick Ratio":1.126,"Day High":563.81,"Day Low":544.06,"VS Average Volume":1.0552779501,"Company Summary":"Thermo Fisher Scientific Inc. provides life sciences solutions, analytical instruments, specialty diagnostics, and laboratory products and biopharma services in the North America, Europe, Asia-Pacific, and internationally. The company's Life Sciences Solutions segment offers reagents, instruments, and consumables for biological and medical research, discovery, and production of drugs and vaccines, as well as diagnosis of infections and diseases; and solutions include biosciences, genetic sciences, and bio production to pharmaceutical, biotechnology, agricultural, clinical, healthcare, academic, and government markets. Its Analytical Instruments segment provides instruments, consumables, software, and services for pharmaceutical, biotechnology, academic, government, environmental, and other research and industrial markets, as well as clinical laboratories. The company's Specialty Diagnostics segment offers liquid, ready-to-use, and lyophilized immunodiagnostic reagent kits, as well as calibrators, controls, protein detection assays, and instruments; immunodiagnostics develops, manufactures and markets complete bloodtest systems to support the clinical diagnosis and monitoring of allergy, asthma and autoimmune diseases; dehydrated and prepared culture media, collection and transport systems, instrumentation, and consumables; human leukocyte antigen typing and testing for organ transplant market; and healthcare products. Its Laboratory Products and Biopharma Services segment provides laboratory products, research and safety market channel, and pharma services and clinical research. It offers products and services through a direct sales force, customer-service professionals, electronic commerce, and third-party distributors under Thermo Scientific; Applied Biosystems; Invitrogen; Fisher Scientific; Unity Lab Services; and Patheon and PPD. It has a collaboration agreement with Mainz Biomed N.V. for the development of colorectal cancer screening product. Thermo Fisher Scientific Inc. was founded in 1956 and is headquartered in Waltham, Massachusetts.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"United Parcel Service, Inc.","Symbol":"UPS","Current Price":"127.41","Latest MA":"129.77","Price Target":148.52097,"Difference from MA":"-1.82%","Difference from Open":"-0.07%","Change from Yesterday":"1.32%","Change from Last Report":"-0.17","Latest Volume":"1,988,648","Market Cap":"108,727,869,440","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":14.527754,"PB Ratio":6.447222,"ROE":0.31422,"DTE":155.425,"Industry":"Integrated Freight & Logistics","Sector":"Industrials","Beta":0.982,"Trailing PEG":1.6161,"Trailing PE":19.246225,"Trailing PS":1.1989489,"Quick Ratio":1.027,"Day High":127.7827,"Day Low":126.58,"VS Average Volume":0.4657752678,"Company Summary":"United Parcel Service, Inc., a package delivery company, provides transportation and delivery, distribution, contract logistics, ocean freight, airfreight, customs brokerage, and insurance services. It operates through two segments, U.S. Domestic Package and International Package. The U.S. Domestic Package segment offers time-definite delivery of express letters, documents, small packages, and palletized freight through air and ground services in the United States. The International Package segment provides guaranteed day and time-definite international shipping services comprising guaranteed time-definite express options in Europe, Asia, the Indian sub-continent, the Middle East, Africa, Canada, and Latin America. The company also offers international air and ocean freight forwarding, post-sales, and mail and consulting services. In addition, it provides truckload and customs brokerage services; supply chain solutions to the healthcare and life sciences industries; fulfillment and transportation management services; and integrated supply chain and shipment insurance solutions. United Parcel Service, Inc. was founded in 1907 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Aptiv PLC","Symbol":"APTV","Current Price":"61.37","Latest MA":"65.85","Price Target":74.43364,"Difference from MA":"-6.80%","Difference from Open":"-2.51%","Change from Yesterday":"-0.08%","Change from Last Report":"-0.15","Latest Volume":"1,153,839","Market Cap":"14,424,159,232","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":8.787542,"PB Ratio":1.6236738,"ROE":0.24212,"DTE":109.665,"Industry":"Auto Parts","Sector":"Consumer Cyclical","Beta":1.817,"Trailing PEG":0.9025,"Trailing PE":6.834076,"Trailing PS":0.7312628,"Quick Ratio":1.031,"Day High":63.06,"Day Low":60.735,"VS Average Volume":0.2855011021,"Company Summary":"Aptiv PLC engages in design, manufacture, and sale of vehicle components in North America, Europe, Middle East, Africa, the Asia Pacific, South America, and internationally. The company provides electrical, electronic, and safety technology solutions to the automotive and commercial vehicle markets. It operates through two segments, Signal and Power Solutions, and Advanced Safety and User Experience. The Signal and Power Solutions segment designs, manufactures, and assembles vehicle's electrical architecture, including engineered component products, connectors, wiring assemblies and harnesses, cable management products, electrical centers, and hybrid high voltage and safety distribution systems. Its Advanced Safety and User Experience segment provides critical technologies and services for vehicle safety, security, comfort, and convenience, such as sensing and perception systems, electronic control units, multi-domain controllers, vehicle connectivity systems, application software, autonomous driving technologies, and end-to-end DevOps tools. Aptiv PLC was incorporated in 2011 and is based in Schaffhausen, Switzerland.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Altria Group, Inc.","Symbol":"MO","Current Price":"51.05","Latest MA":"50.02","Price Target":56.80333,"Difference from MA":"2.06%","Difference from Open":"0.40%","Change from Yesterday":"-0.57%","Change from Last Report":"0.00","Latest Volume":"3,072,359","Market Cap":"86,528,524,288","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":9.538997,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Tobacco","Sector":"Consumer Defensive","Beta":0.67,"Trailing PEG":3.5925,"Trailing PE":8.624155,"Trailing PS":4.24951,"Quick Ratio":0.274,"Day High":51.54,"Day Low":50.815,"VS Average Volume":0.4008442055,"Company Summary":"Altria Group, Inc., through its subsidiaries, manufactures and sells smokeable and oral tobacco products in the United States. The company offers cigarettes primarily under the Marlboro brand; large cigars and pipe tobacco under the Black & Mild brand; moist smokeless tobacco and snus products under the Copenhagen, Skoal, Red Seal, and Husky brands; oral nicotine pouches under the on! brand; and e-vapor products under the NJOY ACE brand. It sells its products to distributors, as well as large retail organizations, such as chain stores. The company was founded in 1822 and is headquartered in Richmond, Virginia.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Unity Software Inc.","Symbol":"U","Current Price":"22.45","Latest MA":"19.67","Price Target":22.59565,"Difference from MA":"14.16%","Difference from Open":"-1.62%","Change from Yesterday":"2.50%","Change from Last Report":"-0.09","Latest Volume":"5,304,696","Market Cap":"9,043,758,080","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":28.526413,"PB Ratio":2.8388975,"ROE":-0.23091999,"DTE":68.801,"Industry":"Software - Application","Sector":"Technology","Beta":2.291,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":4.6014285,"Quick Ratio":2.26,"Day High":23.54,"Day Low":22.33,"VS Average Volume":0.4855823216,"Company Summary":"Unity Software Inc. operates a platform that provides real-time 3D content and experiences. Its platform provides artificial intelligence solutions that support creators in building, running, and growing immersive, real-time 2D and 3D content for mobile phones, tablets, PCs, consoles, and augmented and virtual reality devices. The company also offers Create Solutions, a set of tools and services used to build, ship, and run real-time 2D and 3D content; and Grow Solutions, which allows customers to grow and engage their user base and monetize their content. It serves enterprises, mid-market companies, and government and non-profit institutions; mid-sized, small, and independent businesses; and individuals across various industries. The company offers its solutions directly through its online store, field sales operations, independent distributors, and resellers in North America, Denmark, China, Finland, the United Kingdom, Germany, Israel, Japan, Singapore, South Korea, Spain, and internationally. Unity Software Inc. was founded in 2004 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Mastercard Incorporated","Symbol":"MA","Current Price":"520.40","Latest MA":"487.91","Price Target":569.3597,"Difference from MA":"6.66%","Difference from Open":"0.94%","Change from Yesterday":"2.28%","Change from Last Report":"0.01","Latest Volume":"1,345,220","Market Cap":"477,639,278,592","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":31.78058,"PB Ratio":64.3502,"ROE":1.7757801,"DTE":244.839,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.101,"Trailing PEG":1.9469,"Trailing PE":39.334846,"Trailing PS":17.543499,"Quick Ratio":0.891,"Day High":520.68,"Day Low":513.73,"VS Average Volume":0.5237965261,"Company Summary":"Mastercard Incorporated, a technology company, provides transaction processing and other payment-related products and services in the United States and internationally. The company offers integrated products and value-added services for account holders, merchants, financial institutions, digital partners, businesses, governments, and other organizations, such as programs that enable issuers to provide consumers with credits to defer payments; payment products and solutions that allow its customers to access funds in deposit and other accounts; prepaid programs services; and commercial credit, debit, and prepaid payment products and solutions. It also provides solutions that enable businesses or governments to make payments to businesses, including Virtual Card Number, which is generated dynamically from a physical card and leverages the credit limit of the funding account; a platform to optimize supplier payment enablement campaigns for financial institutions; and treasury intelligence platform that offers corporations with recommendations to enhance working capital performance and accelerate spend on cards. In addition, the company offers Mastercard Send, which partners with digital messaging and payment platforms to enable consumers to send money directly within applications to other consumers; and Mastercard Cross-Border Services enables a range of payment flows through a distribution network with a single point of access to send and receive money globally through various channels, including bank accounts, mobile wallets, cards, and cash payouts. Further, it provides cyber and intelligence solutions; insights and analytics, consulting, marketing, loyalty, processing, and payment gateway solutions for e-commerce merchants; and open banking and digital identity services. The company offers payment solutions and services under the MasterCard, Maestro, and Cirrus name. Mastercard Incorporated was founded in 1966 and is headquartered in Purchase, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Microchip Technology Incorporat","Symbol":"MCHP","Current Price":"57.39","Latest MA":"75.29","Price Target":81.39167,"Difference from MA":"-23.78%","Difference from Open":"-1.14%","Change from Yesterday":"0.76%","Change from Last Report":"-0.03","Latest Volume":"2,554,750","Market Cap":"30,819,002,368","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":23.491129,"PB Ratio":4.9105844,"ROE":0.118030004,"DTE":102.895,"Industry":"Semiconductors","Sector":"Technology","Beta":1.526,"Trailing PEG":7.0285,"Trailing PE":39.854164,"Trailing PS":5.606921,"Quick Ratio":0.405,"Day High":58.43,"Day Low":57.3,"VS Average Volume":0.3355312452,"Company Summary":"Microchip Technology Incorporated engages in the development, manufacture, and sale of smart, connected, and secure embedded control solutions in the Americas, Europe, and Asia. The company offers general purpose 8-bit, 16-bit, and 32-bit mixed-signal microcontrollers; 32-bit embedded mixed-signal microprocessors; and specialized microcontrollers for automotive, industrial, computing, communications, lighting, power supplies, motor control, human machine interface, security, wired connectivity, and wireless connectivity applications. It also provides analog, interface, mixed signal, and timing products comprising power management, linear, mixed-signal, high-voltage, thermal management, discrete diodes, and metal oxide semiconductor field effect transistors (MOSFETS), radio frequency (RF), drivers, safety, security, timing, USB, Ethernet, wireless, and other interface products; field-programmable gate array (FPGA) products; and application development tools that enable system designers to program microcontroller, FPGA, and microprocessor products for specific applications. In addition, the company offers serial electrically erasable programmable read-only memory, serial flash memories, parallel flash memories, serial static random access memories, and serial electrically erasable random access memories for the production of very small footprint devices; and licenses its SuperFlash embedded flash and non-volatile memory technologies to foundries, integrated device manufacturers, and design partners for use in the manufacture of microcontroller products, gate array, RF, analog, and neuromorphic compute products that require embedded non-volatile memory, as well as provides engineering services. Further, it offers wafer foundry and assembly, and test subcontracting manufacturing services; and timing systems products, application specific integrated circuits, and aerospace products. The company was incorporated in 1989 and is headquartered in Chandler, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Dow Inc.","Symbol":"DOW","Current Price":"40.35","Latest MA":"48.63","Price Target":48.61111,"Difference from MA":"-17.02%","Difference from Open":"-0.31%","Change from Yesterday":"0.71%","Change from Last Report":"0.05","Latest Volume":"2,252,444","Market Cap":"28,252,213,248","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":12.583725,"PB Ratio":1.5429171,"ROE":0.05863,"DTE":95.059,"Industry":"Chemicals","Sector":"Basic Materials","Beta":1.222,"Trailing PEG":0.5751,"Trailing PE":26.903334,"Trailing PS":0.65428936,"Quick Ratio":0.8,"Day High":40.77,"Day Low":40.14,"VS Average Volume":0.3046581461,"Company Summary":"Dow Inc., through its subsidiaries, engages in the provision of various materials science solutions for packaging, infrastructure, mobility, and consumer applications in the United States, Canada, Europe, the Middle East, Africa, India, the Asia Pacific, and Latin America. The company operates through Packaging & Specialty Plastics, Industrial Intermediates & Infrastructure, and Performance Materials & Coatings segments. The Packaging & Specialty Plastics segment provides ethylene, and propylene and aromatics products; and polyethylene, polyolefin elastomers, ethylene vinyl acetate, and ethylene propylene diene monomer rubbers for mobility and transportation, consumer, wire and cable, and construction end-markets. The Industrial Intermediates & Infrastructure segment offers purified ethylene, ethylene and ethanol amines, propylene glycol and polyether polyols, aromatic isocyanates and coatings, adhesives, sealants, elastomers, and composites. This segment also provides caustic soda, and ethylene dichloride and vinyl chloride monomers; and cellulose ethers, redispersible latex powders, and acrylic emulsions. The Performance Materials and Coatings segment provides architectural paints and coatings, and industrial coatings that are used in maintenance and protective industries, wood, metal packaging, traffic markings, thermal paper, and leather; and silicon metal, siloxanes, and intermediates used as key materials in manufacturing differentiated downstream silicone products. It also engages in property and casualty insurance, as well as reinsurance business. Dow Inc. was incorporated in 2018 and is headquartered in Midland, Michigan.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Visa Inc.","Symbol":"V","Current Price":"316.39","Latest MA":"285.42","Price Target":336.97623,"Difference from MA":"10.85%","Difference from Open":"0.86%","Change from Yesterday":"2.45%","Change from Last Report":"0.03","Latest Volume":"2,669,582","Market Cap":"612,679,745,536","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":25.01621,"PB Ratio":15.758829,"ROE":0.50708,"DTE":53.239,"Industry":"Credit Services","Sector":"Financial Services","Beta":0.952,"Trailing PEG":2.05,"Trailing PE":32.483574,"Trailing PS":17.053938,"Quick Ratio":0.837,"Day High":316.45,"Day Low":313.17,"VS Average Volume":0.4333512599,"Company Summary":"Visa Inc. operates as a payment technology company in the United States and internationally. The company operates VisaNet, a transaction processing network that enables authorization, clearing, and settlement of payment transactions. It also offers credit, debit, and prepaid card products; tap to pay, tokenization, and click to pay services; Visa Direct, a solution that facilitates the delivery of funds to eligible cards, bank accounts, and digital wallets; Visa B2B Connect, a multilateral business-to-business cross-border payments network; Visa Cross-Border Solution, a cross-border consumer payments solution; and Visa DPS that provides a range of value-added services, including fraud mitigation, dispute management, data analytics, campaign management, a suite of digital solutions, and contact center services. The company also provides acceptance solutions, which include Cybersource and Authorize.net that provides new and enhanced payment integrations with ecommerce platforms, enabling sellers and acquirers to offer tailored commerce experiences; risk and identity solutions, such as Visa Advanced Authorization, Visa Secure, Visa Consumer Authentication Service, Visa Protect Authentication Intelligence, and Visa Provisioning Intelligence; and Visa Consulting and Analytics, a payment consulting advisory services. It provides its services under the Visa, Visa Electron, Interlink, V PAY, and PLUS brands. The company serves merchants, financial institutions, and government entities. Visa Inc. was founded in 1958 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Amazon.com, Inc.","Symbol":"AMZN","Current Price":"222.46","Latest MA":"194.70","Price Target":244.65157,"Difference from MA":"14.26%","Difference from Open":"-0.18%","Change from Yesterday":"2.20%","Change from Last Report":"0.05","Latest Volume":"15,818,095","Market Cap":"2,339,114,319,872","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":35.979595,"PB Ratio":9.022714,"ROE":0.22558,"DTE":61.175,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":1.146,"Trailing PEG":1.7853,"Trailing PE":47.533123,"Trailing PS":3.7719865,"Quick Ratio":0.827,"Day High":223.4734,"Day Low":220.75,"VS Average Volume":0.4192241781,"Company Summary":"Amazon.com, Inc. engages in the retail sale of consumer products, advertising, and subscriptions service through online and physical stores in North America and internationally. The company operates through three segments: North America, International, and Amazon Web Services (AWS). It also manufactures and sells electronic devices, including Kindle, Fire tablets, Fire TVs, Echo, Ring, Blink, and eero; and develops and produces media content. In addition, the company offers programs that enable sellers to sell their products in its stores; and programs that allow authors, independent publishers, musicians, filmmakers, Twitch streamers, skill and app developers, and others to publish and sell content. Further, it provides compute, storage, database, analytics, machine learning, and other services, as well as advertising services through programs, such as sponsored ads, display, and video advertising. Additionally, the company offers Amazon Prime, a membership program. The company's products offered through its stores include merchandise and content purchased for resale and products offered by third-party sellers. It serves consumers, sellers, developers, enterprises, content creators, advertisers, and employees. Amazon.com, Inc. was incorporated in 1994 and is headquartered in Seattle, Washington.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Valero Energy Corporation","Symbol":"VLO","Current Price":"137.49","Latest MA":"138.82","Price Target":146.7021,"Difference from MA":"-0.96%","Difference from Open":"1.68%","Change from Yesterday":"2.49%","Change from Last Report":"0.08","Latest Volume":"1,637,872","Market Cap":"43,527,270,400","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":16.887033,"PB Ratio":1.7236452,"ROE":0.13797,"DTE":38.593,"Industry":"Oil & Gas Refining & Marketing","Sector":"Energy","Beta":1.374,"Trailing PEG":null,"Trailing PE":12.092349,"Trailing PS":0.3381258,"Quick Ratio":1.001,"Day High":137.89,"Day Low":134.7,"VS Average Volume":0.618995969,"Company Summary":"Valero Energy Corporation manufactures, markets, and sells petroleum-based and low-carbon liquid transportation fuels and petrochemical products in the United States, Canada, the United Kingdom, Ireland, Latin America, Mexico, Peru, and internationally. It operates through three segments: Refining, Renewable Diesel, and Ethanol. The company produces California Reformulated Gasoline Blendstock for Oxygenate Blending and Conventional Blendstock for Oxygenate Blending gasolines, CARB diesel, diesel, jet fuel, heating oil, and asphalt; feedstocks; aromatics; sulfur and residual fuel oil; intermediate oils; and sulfur, sweet, and sour crude oils. It sells its refined products through wholesale rack and bulk markets; and through outlets under the Valero, Beacon, Diamond Shamrock, Shamrock, Ultramar, and Texaco brands. The company owns and operates renewable diesel and ethanol plants, as well as produces renewable diesel and naphtha under the Diamond Green Diesel brand name. In addition, it offers ethanol and various co-products, including dry distiller grains, syrup, and inedible distillers corn oil to animal feed customers. The company was formerly known as Valero Refining and Marketing Company and changed its name to Valero Energy Corporation in August 1997. Valero Energy Corporation was founded in 1980 and is headquartered in San Antonio, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Blackstone Inc.","Symbol":"BX","Current Price":"175.90","Latest MA":"153.89","Price Target":178.9,"Difference from MA":"14.30%","Difference from Open":"-0.47%","Change from Yesterday":"3.93%","Change from Last Report":"0.07","Latest Volume":"1,707,175","Market Cap":"213,339,537,408","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":30.287561,"PB Ratio":19.274052,"ROE":0.22041,"DTE":65.956,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.486,"Trailing PEG":2.0909,"Trailing PE":60.44502,"Trailing PS":19.15373,"Quick Ratio":0.886,"Day High":177.47,"Day Low":174.37,"VS Average Volume":0.503750595,"Company Summary":"Blackstone Inc. is an alternative asset management firm specializing in private equity, real estate, hedge fund solutions, credit, secondary funds of funds, public debt and equity and multi-asset class strategies. The firm typically invests in early-stage, seed, middle market, mature, late venture and later stage companies. It also provide capital markets services. The real estate segment specializes in opportunistic, core+ investments as well as debt investment opportunities collateralized by commercial real estate, and stabilized income-oriented commercial real estate across North America, Europe and Asia. The firm's corporate private equity business pursues transactions throughout the world across a variety of transaction types, including large buyouts, recapitalization, special situations, distressed mortgage loans, mid-cap buyouts, buy and build platforms, which involves multiple acquisitions behind a single management team and platform, and growth equity\/development projects involving significant majority stakes in portfolio companies and minority investments in operating companies, shipping, real estate, corporate or consumer loans, and alternative energy greenfield development projects in energy and power, property, dislocated markets, shipping opportunities, financial institution breakups, re-insurance, and improving freight mobility, financial services, healthcare, life sciences, infrastructure, enterprise tech and consumer, as well as consumer technologies. The firm considers investment in Asia and Latin America. It seeks to invest between $0.25 million and $900 million per transaction. It invests in companies with enterprise value between $500 million and $5000 million. It has a three year investment period. The firm prefers to take majority and minority stakes. Its hedge fund business manages a broad range of commingled and customized fund solutions and its credit business focuses on loans, and securities of non-investment grade companies spread across the capital structure including senior debt, subordinated debt, preferred stock and common equity. Blackstone Inc. was founded in 1985 and is headquartered in New York, New York with additional offices across Asia, Europe, North America and Central America.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Weyerhaeuser Company","Symbol":"WY","Current Price":"29.50","Latest MA":"30.39","Price Target":36.0,"Difference from MA":"-2.96%","Difference from Open":"-1.42%","Change from Yesterday":"1.86%","Change from Last Report":"-0.03","Latest Volume":"2,366,734","Market Cap":"21,430,536,192","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":32.76822,"PB Ratio":2.159382,"ROE":0.052989997,"DTE":51.335,"Industry":"REIT - Specialty","Sector":"Real Estate","Beta":1.428,"Trailing PEG":10.4023,"Trailing PE":40.40411,"Trailing PS":2.980603,"Quick Ratio":1.27,"Day High":30.17,"Day Low":29.37,"VS Average Volume":0.6926820902,"Company Summary":"Weyerhaeuser Company, one of the world's largest private owners of timberlands, began operations in 1900. We own or control approximately 11 million acres of timberlands in the U.S. and manage additional timberlands under long-term licenses in Canada. We manage these timberlands on a sustainable basis in compliance with internationally recognized forestry standards. We are also one of the largest manufacturers of wood products in North America. Our company is a real estate investment trust. In 2022, we generated $10.2 billion in net sales and employed approximately 9,200 people who serve customers worldwide. Our common stock trades on the New York Stock Exchange under the symbol WY.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Danaher Corporation","Symbol":"DHR","Current Price":"237.97","Latest MA":"253.66","Price Target":284.4269,"Difference from MA":"-6.19%","Difference from Open":"-0.42%","Change from Yesterday":"0.01%","Change from Last Report":"0.08","Latest Volume":"2,543,432","Market Cap":"171,879,792,640","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":28.68249,"PB Ratio":3.3501804,"ROE":0.07586,"DTE":36.69,"Industry":"Diagnostics & Research","Sector":"Healthcare","Beta":0.881,"Trailing PEG":3.173,"Trailing PE":44.899998,"Trailing PS":7.239483,"Quick Ratio":0.916,"Day High":241.69,"Day Low":232.96,"VS Average Volume":0.8130474671,"Company Summary":"Danaher Corporation designs, manufactures, and markets professional, medical, industrial, and commercial products and services worldwide. The Biotechnology segments offers bioprocess technologies, consumables, and services that advance, accelerate, and integrate the development and manufacture of therapeutics; cell line and cell culture media development services; cell culture media, process liquids and buffers for manufacturing, chromatography resins, filtration technologies, aseptic fill finish; single-use hardware and consumables and services, such as the design and installation of full manufacturing suites; lab filtration, separation, and purification; lab-scale protein purification and analytical tools; reagents, membranes, and services; and healthcare filtration solutions. The Life Sciences segment provides mass spectrometers; flow cytometry, genomics, lab automation, centrifugation, liquid handling automation instruments, antibodies and reagents, and particle counting and characterization; microscopes; protein consumables; industrial filtration products; and genomic medicines, such as custom nucleic acid products, plasmid DNA, RNA, and proteins under the ABCAM, ALDEVRON, BECKMAN COULTER, IDT, LEICA MICROSYSTEMS, MOLECULAR DEVICES, PALL, PHENOMENEX and SCIEX brands. The Diagnostics segment offers chemistry, immunoassay, microbiology, and automation systems; and molecular, acute care, and pathology diagnostics products. This segment also provides clinical instruments, reagents, consumables, software, and services for hospitals, physicians' offices, reference laboratories, and other critical care settings. The company has a research  collaboration  with Stanford  University's Department  of  Bioengineering for cancer drug development. The company was formerly known as Diversified Mortgage Investors, Inc. and changed its name to Danaher Corporation in 1984. Danaher Corporation was founded in 1969 and is based in Washington, the District of Columbia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Tesla, Inc.","Symbol":"TSLA","Current Price":"418.91","Latest MA":"274.65","Price Target":304.52762,"Difference from MA":"52.53%","Difference from Open":"2.21%","Change from Yesterday":"5.79%","Change from Last Report":"-0.03","Latest Volume":"50,267,357","Market Cap":"1,344,726,237,184","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":128.49094,"PB Ratio":19.210768,"ROE":0.20389,"DTE":18.078,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":2.295,"Trailing PEG":4.8079,"Trailing PE":114.76986,"Trailing PS":13.841752,"Quick Ratio":1.214,"Day High":420.99,"Day Low":405.661,"VS Average Volume":0.5431862178,"Company Summary":"Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners; and provision of service and repairs to its energy product customers, including under warranty, as well as various financing options to its solar customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was incorporated in 2003 and is headquartered in Austin, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"QUALCOMM Incorporated","Symbol":"QCOM","Current Price":"165.15","Latest MA":"171.79","Price Target":204.05872,"Difference from MA":"-3.86%","Difference from Open":"1.88%","Change from Yesterday":"3.49%","Change from Last Report":"0.10","Latest Volume":"3,763,429","Market Cap":"183,481,647,104","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":13.520803,"PB Ratio":6.9961023,"ROE":0.42253,"DTE":58.765,"Industry":"Semiconductors","Sector":"Technology","Beta":1.286,"Trailing PEG":1.5757,"Trailing PE":18.49384,"Trailing PS":4.709246,"Quick Ratio":1.64,"Day High":165.18,"Day Low":162.09,"VS Average Volume":0.4676746643,"Company Summary":"QUALCOMM Incorporated engages in the development and commercialization of foundational technologies for the wireless industry worldwide. It operates through three segments: Qualcomm CDMA Technologies (QCT); Qualcomm Technology Licensing (QTL); and Qualcomm Strategic Initiatives (QSI). The QCT segment develops and supplies integrated circuits and system software with advanced connectivity and high-performance, and low-power computing technologies for use in mobile devices; automotive systems for connectivity, digital cockpit, and ADAS\/AD; and IoT, including consumer electronic devices, industrial devices, and edge networking products. The QTL segment grants licenses or provides rights to use portions of its intellectual property portfolio, which include various patent rights useful in the manufacture and sale of wireless products comprising products implementing CDMA2000, WCDMA, LTE and\/or OFDMA-based 5G products. The QSI segment invests in early-stage companies in various industries, including 5G, artificial intelligence, automotive, consumer, enterprise, cloud, IoT, and extended reality, and investments, including non-marketable equity securities and, to a lesser extent, marketable equity securities, and convertible debt instruments. It also provides development, and other services and sells related products to the United States government agencies and their contractors. The company was incorporated in 1985 and is headquartered in San Diego, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Microsoft Corporation","Symbol":"MSFT","Current Price":"426.04","Latest MA":"427.19","Price Target":508.4636,"Difference from MA":"-0.27%","Difference from Open":"1.65%","Change from Yesterday":"2.53%","Change from Last Report":"0.08","Latest Volume":"8,513,214","Market Cap":"3,167,556,468,736","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":28.378716,"PB Ratio":11.010777,"ROE":0.35604,"DTE":33.657,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.904,"Trailing PEG":2.182,"Trailing PE":35.209915,"Trailing PS":12.461373,"Quick Ratio":1.163,"Day High":427.42,"Day Low":418.265,"VS Average Volume":0.4064032029,"Company Summary":"Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services. This segment also provides LinkedIn; and dynamics business solutions, including Dynamics 365, a set of intelligent, cloud-based applications across ERP, CRM, power apps, and power automate; and on-premises ERP and CRM applications. The Intelligent Cloud segment offers server products and cloud services, such as azure and other cloud services; SQL and windows server, visual studio, system center, and related client access licenses, as well as nuance and GitHub; and enterprise services including enterprise support services, industry solutions, and nuance professional services. The More Personal Computing segment offers Windows, including windows OEM licensing and other non-volume licensing of the Windows operating system; Windows commercial comprising volume licensing of the Windows operating system, windows cloud services, and other Windows commercial offerings; patent licensing; and windows Internet of Things; and devices, such as surface, HoloLens, and PC accessories. Additionally, this segment provides gaming, which includes Xbox hardware and content, and first- and third-party content; Xbox game pass and other subscriptions, cloud gaming, advertising, third-party disc royalties, and other cloud services; and search and news advertising, which includes Bing, Microsoft News and Edge, and third-party affiliates. The company sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online, and retail stores. The company was founded in 1975 and is headquartered in Redmond, Washington.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Howmet Aerospace Inc.","Symbol":"HWM","Current Price":"121.48","Latest MA":"98.99","Price Target":124.86909,"Difference from MA":"22.72%","Difference from Open":"-1.08%","Change from Yesterday":"2.01%","Change from Last Report":"-0.12","Latest Volume":"2,473,309","Market Cap":"49,352,585,216","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":37.947914,"PB Ratio":11.119451,"ROE":0.25719,"DTE":78.925,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.293,"Trailing PEG":null,"Trailing PE":46.72308,"Trailing PS":6.788526,"Quick Ratio":0.824,"Day High":124.15,"Day Low":120.49,"VS Average Volume":1.061403968,"Company Summary":"Howmet Aerospace Inc. provides advanced engineered solutions for the aerospace and transportation industries in the United States, Japan, France, Germany, the United Kingdom, Mexico, Italy, Canada, Poland, China, and internationally. It operates through four segments: Engine Products, Fastening Systems, Engineered Structures, and Forged Wheels. The Engine Products segment offers airfoils and seamless rolled rings primarily for aircraft engines and industrial gas turbines; and rotating and structural parts. The Fastening Systems segment produces aerospace fastening systems, as well as commercial transportation, industrial, and other fasteners; and latches, bearings, fluid fittings, and installation tools. The Engineered Structures segment provides titanium ingots and mill products, aluminum and nickel forgings, and machined components and assemblies for aerospace and defense applications; and titanium forgings, extrusions, and forming and machining services for airframe, wing, aero-engine, and landing gear components. The Forged Wheels segment offers forged aluminum wheels and related products for heavy-duty trucks and commercial transportation markets. The company was formerly known as Arconic Inc. Howmet Aerospace Inc. was founded in 1888 and is based in Pittsburgh, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Flagstar Financial, Inc.","Symbol":"FLG","Current Price":"9.33","Latest MA":"10.55","Price Target":12.11667,"Difference from MA":"-11.54%","Difference from Open":"-2.71%","Change from Yesterday":"0.86%","Change from Last Report":"-0.16","Latest Volume":"3,255,021","Market Cap":"3,873,022,976","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":-24.71785,"PB Ratio":0.48020998,"ROE":-0.37158,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.0,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":2.7141016,"Quick Ratio":"N\/A","Day High":9.72,"Day Low":9.2145,"VS Average Volume":0.5166156324,"Company Summary":"Flagstar Financial, Inc. operates as the bank holding company for Flagstar Bank, N.A. that provides banking products and services in the United States. The company's deposit products include interest-bearing checking and money market, savings, non-interest-bearing, and retirement accounts, as well as certificates of deposit. Its loan products comprise multi-family loans; commercial real estate loans; acquisition, development, and construction loans; commercial and industrial loans; one-to-four family loans; specialty finance loans and leases; warehouse loans; and other loans, such as home equity lines of credit, boat and recreational vehicle indirect lending, point of sale consumer loans, and other consumer loans, including overdraft loans. The company offers cash management products; non-deposit investment and insurance products; and online banking, mobile banking, and bank-by-phone services. It primarily serves individuals, small and mid-size businesses, and professional associations. The company was formerly known as New York Community Bancorp, Inc. and changed its name to Flagstar Financial, Inc. in October 2024. Flagstar Financial, Inc. was founded in 1859 and is headquartered in Hicksville, New York.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Flex Ltd.","Symbol":"FLEX","Current Price":"41.91","Latest MA":"34.02","Price Target":42.8875,"Difference from MA":"23.22%","Difference from Open":"1.81%","Change from Yesterday":"4.29%","Change from Last Report":"-0.02","Latest Volume":"2,081,269","Market Cap":"16,253,925,376","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":15.063738,"PB Ratio":3.2654254,"ROE":0.15442,"DTE":83.65,"Industry":"Electronic Components","Sector":"Technology","Beta":1.076,"Trailing PEG":null,"Trailing PE":20.151443,"Trailing PS":0.6386862,"Quick Ratio":0.72,"Day High":41.96,"Day Low":40.7,"VS Average Volume":0.4884504955,"Company Summary":"Flex Ltd. provides manufacturing solutions to various brands in Asia, the Americas, and Europe. It operates through two segments, Flex Agility Solutions (FAS) and Flex Reliability Solutions (FRS). The FAS segment offers flexible supply and manufacturing system comprising communications, enterprise, and cloud solution, which includes data, edge, and communications infrastructure; lifestyle solution, including appliances, consumer packaging, floorcare, micro mobility, and audio; and consumer devices, such as mobile and high velocity consumer devices. Its FRS segment provides complex ramps with specialized production models and critical environments, which comprise automotive including next generation mobility, autonomous, connectivity, electrification, and smart technologies; health solutions, such as medical devices, medical equipment, and drug delivery; and industrial solutions, including capital equipment, industrial devices, embedded and critical power offerings, and renewables and grid edge. In addition, it provides various services, including design and engineering, such as product design and engineering resources that provide design services, product development, systems integration services, and solutions; supply chain comprising manufacturing, customization, procurement, logistics services, and innovative supply chain solutions; manufacturing; logistics and value-added fulfillment, including warehousing and vendor managed inventory, omni-channel fulfillment, kitting, configuration, and postponement; and integrated reverse logistics and circular economy. Further, the company offers embedded and critical power solutions. The company was formerly known as Flextronics International Ltd. and changed its name to Flex Ltd. in September 2016. Flex Ltd. was founded in 1969 and is headquartered in Austin, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Dynatrace, Inc.","Symbol":"DT","Current Price":"51.24","Latest MA":"50.61","Price Target":62.07586,"Difference from MA":"1.25%","Difference from Open":"-1.21%","Change from Yesterday":"0.14%","Change from Last Report":"0.08","Latest Volume":"1,314,778","Market Cap":"15,294,320,640","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":34.116787,"PB Ratio":7.134503,"ROE":0.08276,"DTE":3.76,"Industry":"Software - Application","Sector":"Technology","Beta":1.053,"Trailing PEG":1.1464,"Trailing PE":94.888885,"Trailing PS":9.7834,"Quick Ratio":1.249,"Day High":52.02,"Day Low":51.02,"VS Average Volume":0.4438472219,"Company Summary":"Dynatrace, Inc. provides a security platform for multicloud environments in North America, Europe, the Middle East, Africa, the Asia Pacific, and Latin America. The company operates Dynatrace, a security platform, which provides application and microservices monitoring, runtime application security, infrastructure monitoring, log management and analytics, digital experience monitoring, digital business analytics, and cloud automation. Its platform allows its customers to modernize and automate IT operations, delivers software, and enhance user experiences. In addition, the company offers implementation, consulting, and training services. It markets its products through a combination of direct sales team and a network of partners, including resellers, system integrators, and managed service providers. It serves customers in various industries comprising banking, financial services, government, insurance, retail and wholesale, transportation, and software. Dynatrace, Inc. was founded in 2005 and is headquartered in Waltham, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"V.F. Corporation","Symbol":"VFC","Current Price":"23.25","Latest MA":"18.27","Price Target":22.155,"Difference from MA":"27.23%","Difference from Open":"-1.96%","Change from Yesterday":"1.08%","Change from Last Report":"-0.24","Latest Volume":"2,178,703","Market Cap":"9,049,720,832","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":24.562796,"PB Ratio":6.433712,"ROE":-0.22331,"DTE":524.646,"Industry":"Apparel Manufacturing","Sector":"Consumer Cyclical","Beta":1.545,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.89658993,"Quick Ratio":0.465,"Day High":23.85,"Day Low":23.065,"VS Average Volume":0.3389759229,"Company Summary":"V.F. Corporation, together with its subsidiaries, engages in the design, procurement, marketing, and distribution of branded lifestyle apparel, footwear, and accessories for men, women, and children in the Americas, Europe, and the Asia-Pacific. It operates through three segments: Outdoor, Active, and Work. The company offers High performance outdoor apparel, footwear, equipment, accessories; outdoor, adventure-inspired lifestyle footwear, apparel, and accessories; performance merino wool and other natural fibers-based apparel and accessories; performance-based footwear; and high performance apparel and accessories based on natural fibers under the The North Face, Timberland, Smartwool, Icebreaker, and Altra brands. It also offers youth culture\/action sports-inspired and streetwear apparel, footwear, and accessories; handbags, luggage, backpacks, totes, and accessories; outdoor-inspired apparel, footwear, and accessories; and backpacks and luggage under the Vans, Supreme, Kipling, Napapijri, Eastpak, and JanSport brands. In addition, the company provides work and work-inspired lifestyle apparel and footwear; and protective work footwear under the Dickies, and Timberland PRO brands. The company sells its products primarily to specialty stores, department stores, national chains, independently-operated partnership stores, and mass merchants, as well as sells through direct-to-consumer operations, including retail stores, concession retail stores, and e-commerce sites, and other digital platforms. V.F. Corporation was founded in 1899 and is headquartered in Denver, Colorado.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Alibaba Group Holding Limited","Symbol":"BABA","Current Price":"82.59","Latest MA":"86.65","Price Target":119.83882,"Difference from MA":"-4.68%","Difference from Open":"-0.05%","Change from Yesterday":"1.15%","Change from Last Report":"0.07","Latest Volume":"4,572,497","Market Cap":"197,537,939,456","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":1.1642226,"PB Ratio":0.20373577,"ROE":0.05668,"DTE":22.796,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":0.349,"Trailing PEG":0.5408,"Trailing PE":17.20625,"Trailing PS":0.20788041,"Quick Ratio":0.97,"Day High":82.79,"Day Low":82.155,"VS Average Volume":0.3206080092,"Company Summary":"Alibaba Group Holding Limited, through its subsidiaries, provides technology infrastructure and marketing reach to help merchants, brands, retailers, and other businesses to engage with their users and customers in the People's Republic of China and internationally. The company operates through seven segments: China Commerce, International Commerce, Local Consumer Services, Cainiao, Cloud, Digital Media and Entertainment, and Innovation Initiatives and Others. It operates Taobao and Tmall, which are digital retail platforms; Alimama, a proprietary monetization platform; 1688.com and Alibaba.com, which are online wholesale marketplaces; AliExpress, a retail marketplace; Lazada, Trendyol, and Daraz that are e-commerce platforms; Freshippo, a retail platform for groceries and fresh goods; and Tmall Global, an import e-commerce platform. The company also operates Cainiao Network logistic services platform; Ele.me, an on-demand delivery and local services platform; Koubei, a restaurant and local services guide platform; and Fliggy, an online travel platform. In addition, it offers pay-for-performance, in-feed, and display marketing services; and Taobao Ad Network and Exchange, a real-time online bidding marketing exchange. Further, the company provides elastic computing, storage, network, security, database, big data, and IoT services; and hardware, software license, software installation, and application development and maintenance services. Additionally, it operates Youku, an online video platform; Quark, a platform for information search, storage, and consumption; Alibaba Pictures and other content platforms that provide online videos, films, live events, news feeds, literature, music, and others; Amap, a mobile digital map, navigation, and real-time traffic information app; DingTalk, a business efficiency mobile app; and Tmall Genie smart speaker. The company was incorporated in 1999 and is based in Hangzhou, the People's Republic of China.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Meta Platforms, Inc.","Symbol":"META","Current Price":"619.58","Latest MA":"549.88","Price Target":664.31256,"Difference from MA":"12.68%","Difference from Open":"1.49%","Change from Yesterday":"4.27%","Change from Last Report":"0.03","Latest Volume":"8,431,079","Market Cap":"1,564,118,089,728","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":24.374424,"PB Ratio":9.504769,"ROE":0.36134,"DTE":29.811,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.215,"Trailing PEG":1.3266,"Trailing PE":29.211594,"Trailing PS":10.01183,"Quick Ratio":2.568,"Day High":620.9249,"Day Low":606.5,"VS Average Volume":0.6764456855,"Company Summary":"Meta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and wearables worldwide. It operates in two segments, Family of Apps and Reality Labs. The Family of Apps segment offers Facebook, which enables people to share, discuss, discover, and connect with interests; Instagram, a community for sharing photos, videos, and private messages, as well as feed, stories, reels, video, live, and shops; Messenger, a messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls; and WhatsApp, a messaging application that is used by people and businesses to communicate and transact privately. The Reality Labs segment provides augmented and virtual reality related products comprising consumer hardware, software, and content that help people feel connected, anytime, and anywhere. The company was formerly known as Facebook, Inc. and changed its name to Meta Platforms, Inc. in October 2021. The company was incorporated in 2004 and is headquartered in Menlo Park, California","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Mondelez International, Inc.","Symbol":"MDLZ","Current Price":"56.89","Latest MA":"66.69","Price Target":75.9244,"Difference from MA":"-14.69%","Difference from Open":"-0.79%","Change from Yesterday":"-0.45%","Change from Last Report":"-0.02","Latest Volume":"4,118,689","Market Cap":"76,078,219,264","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":16.982908,"PB Ratio":2.7313538,"ROE":0.13552,"DTE":73.232,"Industry":"Confectioners","Sector":"Consumer Defensive","Beta":0.561,"Trailing PEG":4.5111,"Trailing PE":20.175213,"Trailing PS":2.1044567,"Quick Ratio":0.295,"Day High":57.81,"Day Low":56.565,"VS Average Volume":0.4876099366,"Company Summary":"Mondelez International, Inc., through its subsidiaries, manufactures, markets, and sells snack food and beverage products in the Latin America, North America, Asia, the Middle East, Africa, and Europe. It provides biscuits and baked snacks, including cookies, crackers, salted snacks, snack bars, and cakes and pastries; chocolates; and gums and candies, as well as various cheese and grocery, and powdered beverage products. The company's brand portfolio includes Oreo, Ritz, LU, CLIF Bar, and Tate's Bake Shop biscuits and baked snacks, as well as Cadbury Dairy Milk, Milka, and Toblerone chocolate. It serves supermarket chains, wholesalers, supercenters, club stores, mass merchandisers, distributors, convenience stores, gasoline stations, drug stores, value stores, and other retail food outlets through direct store delivery, company-owned and satellite warehouses, distribution centers, third party distributors, and other facilities, as well as through independent sales offices and agents. The company also sells products directly to businesses and consumers through e-retail platforms, retailer digital platforms, as well as through its direct-to-consumer websites and social media platforms. Mondelez International, Inc. was formerly known as Kraft Foods Inc. and changed its name to Mondelez International, Inc. in October 2012. The company was incorporated in 2000 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Hess Corporation","Symbol":"HES","Current Price":"148.37","Latest MA":"139.40","Price Target":167.64285,"Difference from MA":"6.44%","Difference from Open":"0.93%","Change from Yesterday":"1.16%","Change from Last Report":"-0.06","Latest Volume":"1,324,549","Market Cap":"45,715,468,288","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":18.808558,"PB Ratio":4.21075,"ROE":0.2885,"DTE":81.969,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":1.16,"Trailing PEG":0.7959,"Trailing PE":17.29254,"Trailing PS":3.668095,"Quick Ratio":1.089,"Day High":148.77,"Day Low":146.3,"VS Average Volume":0.8026441131,"Company Summary":"Hess Corporation, an exploration and production company, explores, develops, produces, purchases, transports, and sells crude oil, natural gas liquids (NGLs), and natural gas. The company operates in two segments, Exploration and Production, and Midstream. It conducts production operations primarily in the United States, Guyana, the Malaysia\/Thailand Joint Development Area, and Malaysia; and exploration activities principally offshore Guyana, the U.S. Gulf of Mexico, and offshore Suriname and Canada. The company is also involved in gathering, compressing, and processing natural gas; fractionating NGLs; gathering, terminaling, loading, and transporting crude oil and NGL through rail car; and storing and terminaling propane, as well as providing water handling services primarily in the Bakken Shale plays in the Williston Basin area of North Dakota. The company was incorporated in 1920 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Corning Incorporated","Symbol":"GLW","Current Price":"48.84","Latest MA":"44.09","Price Target":52.99429,"Difference from MA":"10.75%","Difference from Open":"1.36%","Change from Yesterday":"3.04%","Change from Last Report":"0.07","Latest Volume":"1,843,376","Market Cap":"41,812,967,424","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":21.132826,"PB Ratio":3.5802784,"ROE":0.019299999,"DTE":72.739,"Industry":"Electronic Components","Sector":"Technology","Beta":1.029,"Trailing PEG":0.607,"Trailing PE":257.0263,"Trailing PS":3.315595,"Quick Ratio":0.776,"Day High":48.88,"Day Low":48.16,"VS Average Volume":0.4298439749,"Company Summary":"Corning Incorporated engages in the display technologies, optical communications, environmental technologies, specialty materials, and life sciences businesses in the United States and internationally. The company's Display Technologies segment offers glass substrates for flat panel displays, including liquid crystal displays and organic light-emitting diodes that are used in televisions, notebook computers, desktop monitors, tablets, and handheld devices. Its Optical Communications segment provides optical fibers and cables; and hardware and equipment products, such as cable assemblies, fiber optic hardware and connectors, optical components and couplers, closures, network interface devices, and other accessories for the telecommunications industry, businesses, governments, and individuals. The company's Specialty Materials segment manufactures products that offer material formulations for glass, glass ceramics, crystals, precision metrology instruments, and software, as well as glass wafers and substrates, tinted sunglasses, and radiation shielding products for various markets comprising mobile consumer electronics, semiconductor equipment optics and consumables, aerospace and defense optics, radiation shielding products, sunglasses, and telecommunications components. Its Environmental Technologies segment provides ceramic substrates and filter products for emissions control in mobile, gasoline, and diesel applications. The company's Life Sciences segment offers laboratory products, including consumables, such as plastic vessels, liquid handling plastics, specialty surfaces, cell culture media, and serum, as well as general labware, and glassware and equipment under the Corning, Pyrex, Falcon, and Axygen brands. The company was formerly known as Corning Glass Works and changed its name to Corning Incorporated in April 1989. Corning Incorporated was founded in 1851 and is headquartered in Corning, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"T-Mobile US, Inc.","Symbol":"TMUS","Current Price":"215.27","Latest MA":"206.12","Price Target":243.72154,"Difference from MA":"4.44%","Difference from Open":"-0.40%","Change from Yesterday":"0.51%","Change from Last Report":"-0.10","Latest Volume":"1,445,585","Market Cap":"249,818,677,248","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":19.890306,"PB Ratio":3.902081,"ROE":0.16087,"DTE":182.272,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.496,"Trailing PEG":0.8574,"Trailing PE":24.574202,"Trailing PS":3.1224995,"Quick Ratio":0.862,"Day High":217.56,"Day Low":214.1502,"VS Average Volume":0.385046376,"Company Summary":"T-Mobile US, Inc., together with its subsidiaries, provides mobile communications services in the United States, Puerto Rico, and the United States Virgin Islands. The company offers voice, messaging, and data services to customers in the postpaid, prepaid, and wholesale and other services. It also provides wireless devices, including smartphones, wearables, tablets, home broadband routers, and other mobile communication devices, as well as wireless devices and accessories; financing through equipment installment plans; reinsurance for device insurance policies and extended warranty contracts; leasing through JUMP! On Demand; and High Speed Internet services. In addition, the company offers services, devices, and accessories under the T-Mobile and Metro by T-Mobile brands through its owned and operated retail stores, T-Mobile app and customer care channels, and its websites. It also sells its devices to dealers and other third-party distributors for resale through independent third-party retail outlets and various third-party websites. The company was founded in 1994 and is headquartered in Bellevue, Washington. T-Mobile US, Inc. operates as a subsidiary of Deutsche Telekom AG.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"SiriusXM Holdings Inc.","Symbol":"SIRI","Current Price":"21.80","Latest MA":"27.51","Price Target":25.53846,"Difference from MA":"-20.75%","Difference from Open":"0.24%","Change from Yesterday":"2.42%","Change from Last Report":"0.14","Latest Volume":"1,707,807","Market Cap":"7,395,485,696","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":6.7358713,"PB Ratio":0.6806506,"ROE":-0.46799,"DTE":98.775,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.05,"Trailing PEG":0.1807,"Trailing PE":"N\/A","Trailing PS":0.84049165,"Quick Ratio":0.26,"Day High":22.09,"Day Low":21.56,"VS Average Volume":0.2909144707,"Company Summary":"Sirius XM Holdings Inc. operates as an audio entertainment company in North America. It operates in two segments, Sirius XM, and Pandora and Off-platform. The company's Sirius XM segment provides music, sports, entertainment, comedy, talk, news, traffic and weather channels, and other content, as well as podcast and infotainment services on subscription fee basis; and live, curated, and exclusive and on demand programming services through satellite radio systems and streamed through applications for mobile and home devices, and other consumer electronic equipment. This segment also distributes satellite radios through automakers and retailers, as well as its website; podcasts, including true crime, news, politics, music, comedy, sports, and entertainment; and offers location-based services through two-way wireless connectivity, including safety, security, convenience, maintenance and data, remote vehicles diagnostic, and stolen or parked vehicle locator services. In addition, this segment provides music channels on the DISH Network satellite television service as a programming package; Travel Link, a suite of data services that include graphical weather, fuel prices, sports schedule and scores, and movie listings; graphic information related to road closings, traffic flow, and incident data for consumers with in-vehicle navigation systems; real-time weather services in vehicles, boats, and planes; and music programming and commercial-free music services for office, restaurants, and other business. Its Pandora and Off-platform segment operates music, comedy, and podcast streaming platform, which offers personalized experience for listener through computers, tablets, mobile devices, vehicle speakers, and connected devices; and provides advertising services. The company was incorporated in 2013 and is headquartered in New York.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"General Motors Company","Symbol":"GM","Current Price":"51.90","Latest MA":"49.16","Price Target":59.20692,"Difference from MA":"5.56%","Difference from Open":"-0.58%","Change from Yesterday":"2.00%","Change from Last Report":"-0.03","Latest Volume":"3,813,992","Market Cap":"57,063,743,488","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":4.9015903,"PB Ratio":0.8047483,"ROE":0.14167,"DTE":174.581,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":1.414,"Trailing PEG":7.9309,"Trailing PE":5.5384207,"Trailing PS":0.31230327,"Quick Ratio":0.948,"Day High":52.945,"Day Low":51.7432,"VS Average Volume":0.3277603642,"Company Summary":"General Motors Company designs, builds, and sells trucks, crossovers, cars, and automobile parts; and provide software-enabled services and subscriptions worldwide. The company operates through GM North America, GM International, Cruise, and GM Financial segments. It markets its vehicles primarily under the Buick, Cadillac, Chevrolet, GMC, Baojun, and Wuling brand names. In addition, the company sells trucks, crossovers, cars, and automobile parts through retail dealers, and distributors and dealers, as well as to fleet customers, including daily rental car companies, commercial fleet customers, leasing companies, and governments. Further, it offers range of after-sale services through dealer network, such as maintenance, light repairs, collision repairs, vehicle accessories, and extended service warranties. Additionally, the company provides automotive financing; and software-enabled services and subscriptions. General Motors Company was founded in 1908 and is headquartered in Detroit, Michigan.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Nextracker Inc.","Symbol":"NXT","Current Price":"42.35","Latest MA":"40.63","Price Target":52.24862,"Difference from MA":"4.24%","Difference from Open":"-3.74%","Change from Yesterday":"-0.02%","Change from Last Report":"-0.06","Latest Volume":"1,562,516","Market Cap":"6,245,540,864","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":12.616507,"PB Ratio":4.804878,"ROE":0.60612,"DTE":11.396,"Industry":"Solar","Sector":"Technology","Beta":"N\/A","Trailing PEG":2.5078,"Trailing PE":10.58875,"Trailing PS":2.2286139,"Quick Ratio":1.794,"Day High":44.57,"Day Low":42.25,"VS Average Volume":0.5917451171,"Company Summary":"Nextracker Inc., an energy solutions company, provides solar tracker and software solutions for utility-scale and distributed generation solar projects in the United States and internationally. The company offers tracking solutions, which includes NX Horizon, a solar tracking solution; and NX Horizon-XTR, a terrain-following tracker designed to expand the addressable market for trackers on sites with sloped, uneven, and challenging terrain. It also provides TrueCapture, a self-adjusting tracker control system, which boosts solar power plant production by optimizing the position of individual tracker row in response to site features, such as varying topography and changing weather conditions; and NX Navigator, that assists solar power plant owners and operators in monitoring, controlling, and protecting their solar projects. The company was founded in 2013 and is headquartered in Fremont, California. As of March 31, 2024 Nextracker Inc. was formerly a subsidiary of Flex Ltd.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Royal Caribbean Cruises Ltd.","Symbol":"RCL","Current Price":"233.34","Latest MA":"190.17","Price Target":250.61365,"Difference from MA":"22.70%","Difference from Open":"-0.19%","Change from Yesterday":"1.58%","Change from Last Report":"0.18","Latest Volume":"1,401,657","Market Cap":"62,738,620,416","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":16.09163,"PB Ratio":8.905332,"ROE":0.44263,"DTE":298.394,"Industry":"Travel Services","Sector":"Consumer Cyclical","Beta":2.6,"Trailing PEG":0.6052,"Trailing PE":23.403961,"Trailing PS":3.9077308,"Quick Ratio":0.087,"Day High":235.95,"Day Low":231.06,"VS Average Volume":0.7458935219,"Company Summary":"Royal Caribbean Cruises Ltd. operates as a cruise company worldwide. The company operates cruises under the Royal Caribbean International, Celebrity Cruises, and Silversea Cruises brands, which comprise a range of itineraries. As of February 21, 2024, it operated 65 ships. Royal Caribbean Cruises Ltd. was founded in 1968 and is headquartered in Miami, Florida.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Chubb Limited","Symbol":"CB","Current Price":"268.57","Latest MA":"275.70","Price Target":301.65,"Difference from MA":"-2.59%","Difference from Open":"0.34%","Change from Yesterday":"1.31%","Change from Last Report":"0.04","Latest Volume":"1,239,593","Market Cap":"108,260,032,512","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":11.373955,"PB Ratio":1.6461035,"ROE":0.16125,"DTE":31.706,"Industry":"Insurance - Property & Casualty","Sector":"Financial Services","Beta":0.681,"Trailing PEG":3.311,"Trailing PE":11.006968,"Trailing PS":1.9792682,"Quick Ratio":0.183,"Day High":269.05,"Day Low":265.85,"VS Average Volume":0.7674505281,"Company Summary":"Chubb Limited provides insurance and reinsurance products worldwide. The company's North America Commercial P&C Insurance segment offers commercial property, casualty, workers' compensation, package policies, risk management, financial lines, marine, construction, environmental, medical risk, cyber risk, surety, and casualty; and group accident and health insurance to large, middle market, and small commercial businesses. Its North America Personal P&C Insurance segment provides affluent and high net worth individuals and families with homeowners, automobile and collector cars, valuable articles, personal and excess liability, travel insurance, and recreational marine insurance and services. The company's North America Agricultural Insurance segment offers multiple peril crop and crop-hail insurance; and coverage for farm, ranch, and specialty property and casualty, and commercial agriculture products. Its Overseas General Insurance segment provides coverage for traditional commercial property and casualty; specialty categories, such as financial lines, marine, energy, aviation, political risk, and construction; and group accident and health, and traditional and specialty personal lines for corporations, middle markets, and small customers through retail brokers, agents, and other channels. The company's Global Reinsurance segment offers traditional and specialty reinsurance under the Chubb Tempest Re brand to property and casualty companies. Its Life Insurance segment provides protection and savings products comprising whole life, endowment plans, individual and life, group term life, health protection, personal accident, credit life, universal life, group employee benefits, and unit linked contracts. It markets its products primarily through insurance and reinsurance brokers. The company was formerly known as ACE Limited and changed its name to Chubb Limited in January 2016. Chubb Limited was incorporated in 1985 and is headquartered in Zurich, Switzerland.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-01-2025 20:52:07"},{"Company Name":"Invesco Ltd","Symbol":"IVZ","Current Price":"16.93","Latest MA":"16.72","Price Target":18.75,"Difference from MA":"1.27%","Difference from Open":"-1.20%","Change from Yesterday":"2.26%","Change from Last Report":"0.00","Latest Volume":"1,757,271","Market Cap":"7,611,266,048","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":8.983561,"PB Ratio":0.70842916,"ROE":-0.00944,"DTE":5.597,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.424,"Trailing PEG":1.4021,"Trailing PE":"N\/A","Trailing PS":1.292806,"Quick Ratio":0.75,"Day High":17.2,"Day Low":16.805,"VS Average Volume":0.5245426929,"Company Summary":"Invesco Ltd. is a publicly owned investment manager. The firm provides its services to retail clients, institutional clients, high-net worth clients, public entities, corporations, unions, non-profit organizations, endowments, foundations, pension funds, financial institutions, and sovereign wealth funds. It manages separate client-focused equity and fixed income portfolios. The firm also launches equity, fixed income, commodity, multi-asset, and balanced mutual funds for its clients. It launches equity, fixed income, multi-asset, and balanced exchange-traded funds. The firm also launches and manages private funds. It invests in the public equity and fixed income markets across the globe. The firm also invests in alternative markets, such as commodities and currencies. For the equity portion of its portfolio, it invests in growth and value stocks of large-cap, mid-cap, and small-cap companies. For the fixed income portion of its portfolio, the firm invests in convertibles, government bonds, municipal bonds, treasury securities, and cash. It also invests in short term and intermediate term bonds, investment grade and high yield bonds, taxable and tax-free bonds, senior secured loans, and structured securities such as asset-backed securities, mortgage-backed securities, and commercial mortgage-backed securities. The firm employs absolute return, global macro, and long\/short strategies. It employs quantitative analysis to make its investments. The firm was formerly known as Invesco Plc, AMVESCAP plc, Amvesco plc, Invesco PLC, Invesco MIM, and H. Lotery & Co. Ltd. Invesco Ltd. was founded in 1935 and is based in Atlanta, Georgia with an additional office in Hamilton, Bermuda.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"15-01-2025 20:52:07"}]