[{"Company Name":"General Motors Company","Symbol":"GM","Current Price":"50.22","Latest MA":"49.44","Price Target":60.01462,"Difference from MA":"1.57%","Difference from Open":"-1.49%","Change from Yesterday":"-8.54%","Change from Last Report":"-0.08","Latest Volume":"8,440,503","Market Cap":"55,221,252,096","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":4.6658864,"PB Ratio":0.77876437,"ROE":0.14167,"DTE":174.581,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":1.414,"Trailing PEG":8.2545,"Trailing PE":5.3595943,"Trailing PS":0.30221954,"Quick Ratio":0.948,"Day High":50.97,"Day Low":49.46,"VS Average Volume":0.7803052161,"Company Summary":"General Motors Company designs, builds, and sells trucks, crossovers, cars, and automobile parts; and provide software-enabled services and subscriptions worldwide. The company operates through GM North America, GM International, Cruise, and GM Financial segments. It markets its vehicles primarily under the Buick, Cadillac, Chevrolet, GMC, Baojun, and Wuling brand names. In addition, the company sells trucks, crossovers, cars, and automobile parts through retail dealers, and distributors and dealers, as well as to fleet customers, including daily rental car companies, commercial fleet customers, leasing companies, and governments. Further, it offers range of after-sale services through dealer network, such as maintenance, light repairs, collision repairs, vehicle accessories, and extended service warranties. Additionally, the company provides automotive financing; and software-enabled services and subscriptions. General Motors Company was founded in 1908 and is headquartered in Detroit, Michigan.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"28-01-2025 16:49:51"},{"Company Name":"Invesco Ltd","Symbol":"IVZ","Current Price":"19.09","Latest MA":"16.89","Price Target":18.4375,"Difference from MA":"13.03%","Difference from Open":"1.81%","Change from Yesterday":"7.49%","Change from Last Report":"7.55","Latest Volume":"1,286,540","Market Cap":"8,579,809,792","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":10.340158,"PB Ratio":0.79857767,"ROE":-0.00944,"DTE":5.597,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.424,"Trailing PEG":1.4965,"Trailing PE":"N\/A","Trailing PS":1.4573174,"Quick Ratio":0.75,"Day High":19.2,"Day Low":18.47,"VS Average Volume":0.3911792357,"Company Summary":"Invesco Ltd. is a publicly owned investment manager. The firm provides its services to retail clients, institutional clients, high-net worth clients, public entities, corporations, unions, non-profit organizations, endowments, foundations, pension funds, financial institutions, and sovereign wealth funds. It manages separate client-focused equity and fixed income portfolios. The firm also launches equity, fixed income, commodity, multi-asset, and balanced mutual funds for its clients. It launches equity, fixed income, multi-asset, and balanced exchange-traded funds. The firm also launches and manages private funds. It invests in the public equity and fixed income markets across the globe. The firm also invests in alternative markets, such as commodities and currencies. For the equity portion of its portfolio, it invests in growth and value stocks of large-cap, mid-cap, and small-cap companies. For the fixed income portion of its portfolio, the firm invests in convertibles, government bonds, municipal bonds, treasury securities, and cash. It also invests in short term and intermediate term bonds, investment grade and high yield bonds, taxable and tax-free bonds, senior secured loans, and structured securities such as asset-backed securities, mortgage-backed securities, and commercial mortgage-backed securities. The firm employs absolute return, global macro, and long\/short strategies. It employs quantitative analysis to make its investments. The firm was formerly known as Invesco Plc, AMVESCAP plc, Amvesco plc, Invesco PLC, Invesco MIM, and H. Lotery & Co. Ltd. Invesco Ltd. was founded in 1935 and is based in Atlanta, Georgia with an additional office in Hamilton, Bermuda.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"28-01-2025 16:49:51"},{"Company Name":"Royal Caribbean Cruises Ltd.","Symbol":"RCL","Current Price":"251.66","Latest MA":"194.28","Price Target":255.43182,"Difference from MA":"29.54%","Difference from Open":"1.99%","Change from Yesterday":"8.55%","Change from Last Report":"-1.14","Latest Volume":"1,365,661","Market Cap":"67,665,084,416","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":17.427917,"PB Ratio":9.60461,"ROE":0.44263,"DTE":298.394,"Industry":"Travel Services","Sector":"Consumer Cyclical","Beta":2.6,"Trailing PEG":0.6115,"Trailing PE":25.216434,"Trailing PS":4.21458,"Quick Ratio":0.087,"Day High":255.28,"Day Low":246.0,"VS Average Volume":0.6896333886,"Company Summary":"Royal Caribbean Cruises Ltd. operates as a cruise company worldwide. The company operates cruises under the Royal Caribbean International, Celebrity Cruises, and Silversea Cruises brands, which comprise a range of itineraries. As of February 21, 2024, it operated 65 ships. Royal Caribbean Cruises Ltd. was founded in 1968 and is headquartered in Miami, Florida.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"28-01-2025 16:49:51"},{"Company Name":"Boeing Company (The)","Symbol":"BA","Current Price":"182.10","Latest MA":"165.67","Price Target":185.63,"Difference from MA":"9.92%","Difference from Open":"0.44%","Change from Yesterday":"3.95%","Change from Last Report":"-1.01","Latest Volume":"3,831,904","Market Cap":"136,246,583,296","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":260.6415,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.572,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":1.8589305,"Quick Ratio":0.238,"Day High":185.29,"Day Low":181.0401,"VS Average Volume":0.2919310358,"Company Summary":"The Boeing Company, together with its subsidiaries, designs, develops, manufactures, sells, services, and supports commercial jetliners, military aircraft, satellites, missile defense, human space flight and launch systems, and services worldwide. The company operates through Commercial Airplanes; Defense, Space & Security; and Global Services segments. The Commercial Airplanes segment develops, produces, and markets commercial jet aircraft for passenger and cargo requirements, as well as provides fleet support services. The Defense, Space & Security segment engages in the research, development, production, and modification of manned and unmanned military aircraft and weapons systems; strategic defense and intelligence systems, which include strategic missile and defense systems, command, control, communications, computers, intelligence, surveillance and reconnaissance, cyber and information solutions, and intelligence systems; and satellite systems, such as government and commercial satellites, and space exploration. The Global Services segment offers products and services, including supply chain and logistics management, engineering, maintenance and modifications, upgrades and conversions, spare parts, pilot and maintenance training systems and services, technical and maintenance documents, and data analytics and digital services to commercial and defense customers. The Boeing Company was incorporated in 1916 and is based in Arlington, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"28-01-2025 16:49:51"},{"Company Name":"RTX Corporation","Symbol":"RTX","Current Price":"128.51","Latest MA":"116.65","Price Target":136.59592,"Difference from MA":"10.17%","Difference from Open":"-2.03%","Change from Yesterday":"2.67%","Change from Last Report":"-0.59","Latest Volume":"1,747,895","Market Cap":"171,049,369,600","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":21.160316,"PB Ratio":2.7988672,"ROE":0.073460005,"DTE":69.597,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":0.54,"Trailing PEG":0.9365,"Trailing PE":37.03458,"Trailing PS":2.1640313,"Quick Ratio":0.602,"Day High":132.43,"Day Low":128.34,"VS Average Volume":0.3784186649,"Company Summary":"RTX Corporation, an aerospace and defense company, provides systems and services for the commercial, military, and government customers in the United States and internationally. It operates through three segments: Collins Aerospace, Pratt & Whitney, and Raytheon. The Collins Aerospace Systems segment offers aerospace and defense products, and aftermarket service solutions for civil and military aircraft manufacturers and commercial airlines, as well as regional, business, and general aviation, defense, and commercial space operations. This segment also designs, produces, and supports cabin interior, including oxygen systems, food and beverage preparation, storage and galley systems, and lavatory and wastewater management systems; battlespace, test and training range systems, crew escape systems, and simulation and training solutions; information management services; and aftermarket services that include spare parts, overhaul and repair, engineering and technical support, training and fleet management solutions, and asset and information management services. Its Pratt & Whitney segment supplies aircraft engines for commercial, military, business jet, and general aviation customers; and produces, sells, and services military and commercial auxiliary power units. The Raytheon segment provides defensive and offensive threat detection, tracking, and mitigation capabilities for U.S., foreign government, and commercial customers. The company was formerly known as Raytheon Technologies Corporation and changed its name to RTX Corporation in July 2023. RTX Corporation was incorporated in 1934 and is headquartered in Arlington, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"28-01-2025 16:49:51"},{"Company Name":"SoFi Technologies, Inc.","Symbol":"SOFI","Current Price":"15.59","Latest MA":"10.65","Price Target":12.66667,"Difference from MA":"46.44%","Difference from Open":"-3.47%","Change from Yesterday":"-3.23%","Change from Last Report":"0.29","Latest Volume":"10,307,640","Market Cap":"16,917,487,616","Earning Date":"2025-01-27","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":41.026318,"PB Ratio":2.761247,"ROE":0.037249997,"DTE":54.394,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.613,"Trailing PEG":null,"Trailing PE":129.91667,"Trailing PS":6.715391,"Quick Ratio":0.47,"Day High":16.2199,"Day Low":15.22,"VS Average Volume":0.2029170243,"Company Summary":"SoFi Technologies, Inc. provides various financial services in the United States, Latin America, and Canada. It operates through three segments: Lending, Technology Platform, and Financial Services. The company offers lending and financial services and products that allows its members to borrow, save, spend, invest, and protect money. It offers personal loans, student loans, home loans, and related services. The company also operates Galileo, a technology platform that offers services to financial and non-financial institution; and Technisys, a cloud-native digital and core banking platform with financial services customers. In addition, it provides SoFi Money offers checking and savings accounts, debit cards, and cash management products; and SoFi Invest, a mobile-first investment platform that provides access to trading and advisory solutions, such as investing and robo-advisory. Further, the company offers SoFi Credit Card that provides cash backs on every purchase; Sofi Relay, a personal finance management product that allows to track all of their financial accounts comprising credit score and spending behaviors; SoFi Protect, which offers insurance product; SoFi Travel, an application that manages travel search and booking experience; SoFi At Work provides financial benefits to employees, including student loan payments made on their employees' behalf; Lantern Credit, a financial services marketplace platform for seeking alternative products and provide product comparisons; and other lending as a service that offers pre-qualified borrower referrals and sells loans to third-party partner. The company was founded in 2011 and is based in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"28-01-2025 16:49:51"},{"Company Name":"AT&T Inc.","Symbol":"T","Current Price":"24.15","Latest MA":"20.88","Price Target":26.30346,"Difference from MA":"15.70%","Difference from Open":"0.38%","Change from Yesterday":"0.04%","Change from Last Report":"0.22","Latest Volume":"5,620,691","Market Cap":"173,301,186,560","Earning Date":"2025-01-27","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":10.751408,"PB Ratio":1.6930114,"ROE":0.08759,"DTE":125.151,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.73,"Trailing PEG":1.8797,"Trailing PE":19.636179,"Trailing PS":1.4198033,"Quick Ratio":0.42,"Day High":24.23,"Day Low":23.92,"VS Average Volume":0.1624489844,"Company Summary":"AT&T Inc. provides telecommunications and technology services worldwide. The company operates through two segments, Communications and Latin America. The Communications segment offers wireless voice and data communications services; and sells handsets, wireless data cards, wireless computing devices, carrying cases\/protective covers, and wireless chargers through its own company-owned stores, agents, and third-party retail stores. It also provides Virtual Private Networks, AT&T Dedicated Internet, Ethernet, data services, cloud solutions, outsourcing, and managed professional services, as well as customer premises equipment for multinational corporations, small and mid-sized businesses, governmental, and wholesale customers. In addition, this segment offers broadband services, including fiber connections, legacy telephony voice communication services, and other VoIP services and equipment to residential customers. This segment markets its communications services and products under the AT&T, AT&T Business, Cricket, AT&T PREPAID, and AT&T Fiber brand names. The Latin America segment provides postpaid and prepaid wireless services in Mexico under the AT&T and Unefon brand names, as well as sells smartphones through its owned stores, agents and third-party retail stores. The company was formerly known as SBC Communications Inc. and changed its name to AT&T Inc. in 2005. AT&T Inc. was incorporated in 1983 and is based in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"28-01-2025 16:49:51"},{"Company Name":"Verizon Communications Inc.","Symbol":"VZ","Current Price":"40.52","Latest MA":"40.57","Price Target":47.27826,"Difference from MA":"-0.12%","Difference from Open":"-0.18%","Change from Yesterday":"-0.30%","Change from Last Report":"-0.14","Latest Volume":"2,076,590","Market Cap":"170,595,254,272","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.292442,"PB Ratio":1.7710428,"ROE":0.10431,"DTE":182.615,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.418,"Trailing PEG":1.0493,"Trailing PE":9.788648,"Trailing PS":1.2708511,"Quick Ratio":0.51,"Day High":40.805,"Day Low":40.3682,"VS Average Volume":0.1062792582,"Company Summary":"Verizon Communications Inc., through its subsidiaries, engages in the provision of communications, technology, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide. It operates in two segments, Verizon Consumer Group (Consumer) and Verizon Business Group (Business). The Consumer segment provides wireless services across the wireless networks in the United States under the Verizon and TracFone brands and through wholesale and other arrangements; and fixed wireless access (FWA) broadband through its wireless networks, as well as related equipment and devices, such as smartphones, tablets, smart watches, and other wireless-enabled connected devices. The segment also offers wireline services in the Mid-Atlantic and Northeastern United States, as well as Washington D.C. through its fiber-optic network, Verizon Fios product portfolio, and a copper-based network. The Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and conferencing, corporate networking, security and managed network, local and long-distance voice, and network access services to deliver various IoT services and products to businesses, government customers, and wireless and wireline carriers in the United States and internationally. The company was formerly known as Bell Atlantic Corporation and changed its name to Verizon Communications Inc. in June 2000. Verizon Communications Inc. was incorporated in 1983 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"28-01-2025 16:49:51"},{"Company Name":"NextEra Energy, Inc.","Symbol":"NEE","Current Price":"71.27","Latest MA":"76.32","Price Target":84.81476,"Difference from MA":"-6.62%","Difference from Open":"-1.47%","Change from Yesterday":"-3.51%","Change from Last Report":"0.11","Latest Volume":"1,900,191","Market Cap":"146,559,614,976","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":17.810154,"PB Ratio":2.928222,"ROE":0.09887999,"DTE":139.015,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.561,"Trailing PEG":2.9659,"Trailing PE":21.148367,"Trailing PS":5.584074,"Quick Ratio":0.258,"Day High":72.86,"Day Low":71.07,"VS Average Volume":0.1712690137,"Company Summary":"NextEra Energy, Inc., through its subsidiaries, generates, transmits, distributes, and sells electric power to retail and wholesale customers in North America. The company generates electricity through wind, solar, nuclear,natural gas, and other clean energy. It also develops, constructs, and operates long-term contracted assets that consists of clean energy solutions, such as renewable generation facilities, battery storage projects, and electric transmission facilities; sells energy commodities; and owns, develops, constructs, manages and operates electric generation facilities in wholesale energy markets. The company had approximately 33,276 megawatts of net generating capacity; approximately 90,000 circuit miles of transmission and distribution lines; and 883 substations. It serves approximately 12 million people through approximately 5.9 million customer accounts in the east and lower west coasts of Florida. The company was formerly known as FPL Group, Inc. and changed its name to NextEra Energy, Inc. in 2010. NextEra Energy, Inc. was founded in 1925 and is headquartered in Juno Beach, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"28-01-2025 16:49:51"},{"Company Name":"American Airlines Group, Inc.","Symbol":"AAL","Current Price":"17.14","Latest MA":"13.03","Price Target":20.64273,"Difference from MA":"31.60%","Difference from Open":"0.38%","Change from Yesterday":"-0.29%","Change from Last Report":"-0.15","Latest Volume":"1,702,660","Market Cap":"11,273,969,664","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":5.5258327,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Airlines","Sector":"Industrials","Beta":1.399,"Trailing PEG":0.2065,"Trailing PE":13.826613,"Trailing PS":0.21028426,"Quick Ratio":0.422,"Day High":17.215,"Day Low":16.955,"VS Average Volume":0.0631779723,"Company Summary":"American Airlines Group Inc., through its subsidiaries, operates as a network air carrier. The company provides scheduled air transportation services for passengers and cargo through its hubs in Charlotte, Chicago, Dallas\/Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix, and Washington, D.C., as well as through partner gateways in London, Doha, Madrid, Seattle\/Tacoma, Sydney, and Tokyo. It operates a mainline fleet of 965 aircraft. The company was formerly known as AMR Corporation and changed its name to American Airlines Group Inc. in December 2013. American Airlines Group Inc. was founded in 1926 and is headquartered in Fort Worth, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"28-01-2025 16:49:51"},{"Company Name":"Freeport-McMoRan, Inc.","Symbol":"FCX","Current Price":"36.35","Latest MA":"44.11","Price Target":48.66,"Difference from MA":"-17.59%","Difference from Open":"-1.44%","Change from Yesterday":"-0.94%","Change from Last Report":"-0.38","Latest Volume":"1,399,844","Market Cap":"52,232,404,992","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.208574,"PB Ratio":2.9765804,"ROE":0.16870001,"DTE":33.531,"Industry":"Copper","Sector":"Basic Materials","Beta":1.91,"Trailing PEG":9.8896,"Trailing PE":27.961538,"Trailing PS":2.0371454,"Quick Ratio":1.048,"Day High":37.0,"Day Low":36.315,"VS Average Volume":0.1164718541,"Company Summary":"Freeport-McMoRan Inc. engages in the mining of mineral properties in North America, South America, and Indonesia. It primarily explores for copper, gold, molybdenum, silver, and other metals. The company's assets include the Grasberg minerals district in Indonesia; Morenci, Bagdad, Safford, Sierrita, and Miami in Arizona; Chino and Tyrone in New Mexico; and Henderson and Climax in Colorado, North America, as well as Cerro Verde in Peru and El Abra in Chile. The company was formerly known as Freeport-McMoRan Copper & Gold Inc. and changed its name to Freeport-McMoRan Inc. in July 2014. Freeport-McMoRan Inc. was incorporated in 1987 and is headquartered in Phoenix, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"28-01-2025 16:49:51"},{"Company Name":"Halliburton Company","Symbol":"HAL","Current Price":"27.19","Latest MA":"30.06","Price Target":34.41481,"Difference from MA":"-9.53%","Difference from Open":"-0.55%","Change from Yesterday":"-0.22%","Change from Last Report":"-0.22","Latest Volume":"1,124,254","Market Cap":"23,886,471,168","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.822623,"PB Ratio":2.318581,"ROE":0.26293,"DTE":83.993,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.905,"Trailing PEG":2.2547,"Trailing PE":9.607775,"Trailing PS":1.0352564,"Quick Ratio":1.377,"Day High":27.52,"Day Low":27.16,"VS Average Volume":0.1131390244,"Company Summary":"Halliburton Company provides products and services to the energy industry worldwide. It operates through two segments, Completion and Production, and Drilling and Evaluation. The Completion and Production segment offers production enhancement services that include stimulation and sand control services; cementing services, such as well bonding and casing, and casing equipment; and completion tools that offer downhole solutions and services, including well completion products and services, intelligent well completions, and service tools, as well as liner hanger, sand control, and multilateral systems. This segment also provides electrical submersible pumps, as well as artificial lift services; production solutions comprising coiled tubing, hydraulic workover units, downhole tools, and pumping and nitrogen services; pipeline and process services, such as pre-commissioning, commissioning, maintenance, and decommissioning; and specialty chemicals and services. The Drilling and Evaluation segment offers drilling fluid systems, performance additives, completion fluids, solids control, specialized testing equipment, and waste management services; drilling systems and services; wireline and perforating services consists of open-hole logging, and cased-hole and slickline; and drill bits and services comprising roller cone rock bits, fixed cutter bits, hole enlargement, and related downhole tools and services, as well as coring equipment and services. This segment also provides cloud based digital services and artificial intelligence solutions on an open architecture for subsurface insights, integrated well construction, and reservoir and production management; testing and subsea services, such as acquisition and analysis of reservoir information and optimization solutions; and project management and integrated asset management services. Halliburton Company was founded in 1919 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"28-01-2025 16:49:51"},{"Company Name":"Kinder Morgan, Inc.","Symbol":"KMI","Current Price":"27.11","Latest MA":"23.86","Price Target":29.41833,"Difference from MA":"13.60%","Difference from Open":"-1.60%","Change from Yesterday":"-1.29%","Change from Last Report":"-0.28","Latest Volume":"1,925,980","Market Cap":"60,228,661,248","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.045252,"PB Ratio":1.9808564,"ROE":0.083500005,"DTE":101.433,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.907,"Trailing PEG":2.2164,"Trailing PE":23.170942,"Trailing PS":3.9752269,"Quick Ratio":0.291,"Day High":27.595,"Day Low":27.08,"VS Average Volume":0.1410391914,"Company Summary":"Kinder Morgan, Inc. operates as an energy infrastructure company primarily in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas gasification, liquefaction, and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and\/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, renewable fuel and feedstocks, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; owns interests in\/or operates oil fields and gasoline processing plants; and operates a crude oil pipeline system in West Texas, as well as owns and operates RNG and LNG facilities. It owns and operates approximately 82,000 miles of pipelines and 139 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1997 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"28-01-2025 16:49:51"},{"Company Name":"GE Vernova Inc.","Symbol":"GEV","Current Price":"322.22","Latest MA":"264.05","Price Target":418.21542,"Difference from MA":"22.03%","Difference from Open":"-8.31%","Change from Yesterday":"-1.96%","Change from Last Report":"-0.20","Latest Volume":"1,901,651","Market Cap":"88,821,235,712","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":30.953287,"PB Ratio":9.337275,"ROE":"N\/A","DTE":9.346,"Industry":"Utilities - Renewable","Sector":"Utilities","Beta":"N\/A","Trailing PEG":3.6444,"Trailing PE":57.642216,"Trailing PS":2.5803623,"Quick Ratio":0.717,"Day High":353.6,"Day Low":319.1958,"VS Average Volume":0.6478102923,"Company Summary":"GE Vernova Inc., an energy company, engages in the provision of various products and services that generate, transfer, orchestrate, convert, and store electricity in the United States, Europe, Asia, the Americas, the Middle East, and Africa. The company operates through three segments: Power, Wind, and Electrification. The Power segment designs, manufactures, and services gas, nuclear, hydro, and steam technologies. The Wind segment offers wind generation technologies, including onshore and offshore wind turbines and blades. The Electrification segment provides grid solutions, power conversion, solar, and storage solutions; and electrification software for the transmission, distribution, conversion, storage, and orchestration of electricity from point of generation to point of consumption. The company was incorporated in 2023 and is headquartered in Cambridge, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"28-01-2025 16:49:51"},{"Company Name":"Amphenol Corporation","Symbol":"APH","Current Price":"67.00","Latest MA":"67.68","Price Target":84.65,"Difference from MA":"-1.01%","Difference from Open":"-2.72%","Change from Yesterday":"-0.95%","Change from Last Report":"0.74","Latest Volume":"1,325,831","Market Cap":"80,769,843,200","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":26.73032,"PB Ratio":8.543101,"ROE":0.25293,"DTE":57.565,"Industry":"Electronic Components","Sector":"Technology","Beta":1.238,"Trailing PEG":2.7285,"Trailing PE":34.89323,"Trailing PS":5.6750684,"Quick Ratio":1.208,"Day High":68.93,"Day Low":66.37,"VS Average Volume":0.2057964063,"Company Summary":"Amphenol Corporation, together with its subsidiaries, primarily designs, manufactures, and markets electrical, electronic, and fiber optic connectors in the United States, China, and internationally. It operates through three segments: Harsh Environment Solutions, Communications Solutions, and Interconnect and Sensor Systems. The company offers connectors and connector systems, including harsh environment data, power, high-speed, fiber optic, and radio frequency interconnect products; busbars and power distribution systems; and other connectors. It also provides value-add products, such as backplane interconnect systems, cable assemblies and harnesses, and cable management products; other products comprising flexible and rigid printed circuit boards, hinges, other mechanical, and production related products. In addition, the company offers consumer device, network infrastructure, and other antennas; coaxial, power, and specialty cables; and sensors and sensor-based products. It sells its products through its sales force, independent representatives, and a network of electronics distributors to original equipment manufacturers, electronic manufacturing services companies, original design manufacturers, and service providers in the automotive, broadband communication, commercial aerospace, industrial, information technology and data communication, military, mobile device, and mobile network markets. Amphenol Corporation was founded in 1932 and is headquartered in Wallingford, Connecticut.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"28-01-2025 16:49:51"},{"Company Name":"Huntington Bancshares Incorpora","Symbol":"HBAN","Current Price":"17.21","Latest MA":"15.23","Price Target":18.69526,"Difference from MA":"13.02%","Difference from Open":"0.47%","Change from Yesterday":"0.26%","Change from Last Report":"0.06","Latest Volume":"1,920,585","Market Cap":"25,017,288,704","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":11.082627,"PB Ratio":1.3728541,"ROE":0.08545,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.057,"Trailing PEG":2.908,"Trailing PE":14.106639,"Trailing PS":3.739505,"Quick Ratio":"N\/A","Day High":17.29,"Day Low":17.115,"VS Average Volume":0.124443681,"Company Summary":"Huntington Bancshares Incorporated operates as the bank holding company for The Huntington National Bank that provides commercial, consumer, and mortgage banking services in the United States. The company offers financial products and services to consumer and business customers, including deposits, lending, payments, mortgage banking, dealer financing, investment management, trust, brokerage, insurance, and other financial products and services. It also provides 24-hour grace, asterisk-free checking, money scout, $50 safety zone, standby cash, early pay, instant access, savings goal getter, and Huntington heads up; digitally powered consumer and business financial solutions to consumer lending, regional banking, branch banking, and wealth management customers; direct and indirect consumer loans, as well as dealer finance loans and deposits; and private banking, wealth management and legacy planning through investment and portfolio management, fiduciary administration and trust, institutional custody, and full-service retail brokerage investment services. The company offers equipment financing, asset-based lending, distribution finance, structured lending, and municipal financing solutions, as well as Huntington ChoicePay. In addition, it offers lending, liquidity, treasury management and other payment services, and capital markets; government and non-profits, healthcare, technology and telecommunications, franchises, financial sponsors, and global services; and corporate risk management, institutional sales and trading, debt and equity issuance, and additional advisory services. The company offers its products through a network of channels, including branches and ATMs, online and mobile banking, and through customer call centers to customers in middle market banking, corporate, specialty, and government banking, asset finance, commercial real estate banking, and capital markets. The company was founded in 1866 and is headquartered in Columbus, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"28-01-2025 16:49:51"},{"Company Name":"Bank of America Corporation","Symbol":"BAC","Current Price":"47.16","Latest MA":"42.14","Price Target":51.92857,"Difference from MA":"11.91%","Difference from Open":"0.16%","Change from Yesterday":"0.17%","Change from Last Report":"-0.16","Latest Volume":"4,025,038","Market Cap":"358,890,110,976","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.886956,"PB Ratio":1.3331543,"ROE":0.08092,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.325,"Trailing PEG":2.0611,"Trailing PE":14.690031,"Trailing PS":3.7927222,"Quick Ratio":"N\/A","Day High":47.4358,"Day Low":46.91,"VS Average Volume":0.1130952689,"Company Summary":"Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. It operates in four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, non-interest and interest-bearing checking accounts, and investment accounts and products; credit and debit cards; residential mortgages, and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research, and certain market-based services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"28-01-2025 16:49:51"},{"Company Name":"Walgreens Boots Alliance, Inc.","Symbol":"WBA","Current Price":"11.06","Latest MA":"9.82","Price Target":12.414,"Difference from MA":"12.66%","Difference from Open":"-1.78%","Change from Yesterday":"-2.38%","Change from Last Report":"-0.09","Latest Volume":"1,365,931","Market Cap":"9,557,532,672","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":6.897283,"PB Ratio":0.91488135,"ROE":-0.75969005,"DTE":277.898,"Industry":"Pharmaceutical Retailers","Sector":"Healthcare","Beta":0.669,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.0647275,"Quick Ratio":0.332,"Day High":11.32,"Day Low":11.025,"VS Average Volume":0.0567443884,"Company Summary":"Walgreens Boots Alliance, Inc. operates as a healthcare, pharmacy, and retail company in the United States, Germany, the United Kingdom, and internationally. It operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The U.S. Retail Pharmacy segment engages in operation of the retail drugstores, health and wellness services, specialty, and home delivery pharmacy services, which offers health and wellness, beauty, personal care and consumables, and general merchandise. The International segment offers sale of prescription drugs and health and wellness, beauty, personal care, and other consumer products outside the United States; and operates pharmacy-led health and beauty retail businesses under the Boots brand stores in the United Kingdom, the Republic of Ireland, and Thailand, as well as the Benavides brand in Mexico and the Ahumada brand in Chile. The U.S. Healthcare segment provides VillageMD, a national provider of value-based care with primary, multi-specialty, and urgent care providers serving patients in traditional clinic settings, in patients' homes and online appointments; Shields, a specialty pharmacy integrator and accelerator for hospitals; and CareCentrix, a participant in the post-acute and home care management sectors. Walgreens Boots Alliance, Inc. was founded in 1909 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"28-01-2025 16:49:51"},{"Company Name":"Exxon Mobil Corporation","Symbol":"XOM","Current Price":"110.08","Latest MA":"114.52","Price Target":129.55537,"Difference from MA":"-3.87%","Difference from Open":"-0.29%","Change from Yesterday":"-0.05%","Change from Last Report":"-0.17","Latest Volume":"1,341,996","Market Cap":"483,833,479,168","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":13.96681,"PB Ratio":1.8013647,"ROE":0.14513999,"DTE":15.394,"Industry":"Oil & Gas Integrated","Sector":"Energy","Beta":0.88,"Trailing PEG":4.1659,"Trailing PE":13.709216,"Trailing PS":1.4072372,"Quick Ratio":0.978,"Day High":110.87,"Day Low":109.7,"VS Average Volume":0.0858780102,"Company Summary":"Exxon Mobil Corporation engages in the exploration and production of crude oil and natural gas in the United States and internationally. It operates through Upstream, Energy Products, Chemical Products, and Specialty Products segments. The Upstream segment explores for and produces crude oil and natural gas. The Energy Products segment offers fuels, aromatics, and catalysts, as well as licensing services. It sells its products under the Exxon, Esso, and Mobil brands. The Chemical Products segment manufactures and markets petrochemicals including olefins, polyolefins, and intermediates. The Specialty Products segment offers performance products, including lubricants, basestocks, waxes, synthetics, elastomers, and resins. The company also involves in the manufacturing, trade, transport, and sale of crude oil, natural gas, petroleum products, petrochemicals, and other specialty products; and pursuit lower-emission business opportunities, including carbon capture and storage, hydrogen, lower-emission fuels, and lithium. Exxon Mobil Corporation was founded in 1870 and is based in Spring, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"28-01-2025 16:49:51"},{"Company Name":"Intel Corporation","Symbol":"INTC","Current Price":"19.88","Latest MA":"23.56","Price Target":23.82824,"Difference from MA":"-15.61%","Difference from Open":"-2.07%","Change from Yesterday":"-1.88%","Change from Last Report":"-0.13","Latest Volume":"7,478,661","Market Cap":"85,742,436,352","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":21.078747,"PB Ratio":0.86064327,"ROE":-0.15597,"DTE":47.906,"Industry":"Semiconductors","Sector":"Technology","Beta":1.026,"Trailing PEG":0.6182,"Trailing PE":"N\/A","Trailing PS":1.5805932,"Quick Ratio":0.833,"Day High":20.342,"Day Low":19.86,"VS Average Volume":0.1010229063,"Company Summary":"Intel Corporation designs, develops, manufactures, markets, and sells computing and related products and services worldwide. It operates through Client Computing Group, Data Center and AI, Network and Edge, Mobileye, and Intel Foundry Services segments. The company's products portfolio comprises central processing units and chipsets, system-on-chips (SoCs), and multichip packages; mobile and desktop processors; hardware products comprising graphics processing units (GPUs), domain-specific accelerators, and field programmable gate arrays (FPGAs); and memory and storage, connectivity and networking, and other semiconductor products. It also offers silicon devices and software products; and optimization solutions for workloads, such as AI, cryptography, security, storage, networking, and leverages various features supporting diverse compute environments. In addition, the company develops and deploys advanced driver assistance systems (ADAS), and autonomous driving technologies and solutions; and provides advanced process technologies backed by an ecosystem of IP, EDA, and design services, as well as systems of chips, including advanced packaging technologies, software and accelerate bring-up, and integration of chips and driving standards. Further, it delivers and deploys intelligent edge platforms that allow developers to achieve agility and drive automation using AI for efficient operations with data integrity, as well as provides hardware and software platforms, tools, and ecosystem partnerships for digital transformation from the cloud to edge. The company serves original equipment manufacturers, original design manufacturers, cloud service providers, and other manufacturers and service providers. It has a strategic agreement with Synopsys, Inc. to develop EDA and IP solutions; and ARM that enables chip designers to build optimized compute SoCs on the Intel 18A process. Intel Corporation was incorporated in 1968 and is headquartered in Santa Clara, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"28-01-2025 16:49:51"},{"Company Name":"Apple Inc.","Symbol":"AAPL","Current Price":"234.98","Latest MA":"229.16","Price Target":245.89659,"Difference from MA":"2.54%","Difference from Open":"1.78%","Change from Yesterday":"2.31%","Change from Last Report":"0.01","Latest Volume":"11,576,727","Market Cap":"3,533,605,699,584","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":28.338531,"PB Ratio":62.37855,"ROE":1.5741299,"DTE":209.059,"Industry":"Consumer Electronics","Sector":"Technology","Beta":1.24,"Trailing PEG":2.0302,"Trailing PE":38.648026,"Trailing PS":9.036546,"Quick Ratio":0.745,"Day High":235.58,"Day Low":230.88,"VS Average Volume":0.240177879,"Company Summary":"Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod. It also provides AppleCare support and cloud services; and operates various platforms, including the App Store that allow customers to discover and download applications and digital content, such as books, music, video, games, and podcasts, as well as advertising services include third-party licensing arrangements and its own advertising platforms. In addition, the company offers various subscription-based services, such as Apple Arcade, a game subscription service; Apple Fitness+, a personalized fitness service; Apple Music, which offers users a curated listening experience with on-demand radio stations; Apple News+, a subscription news and magazine service; Apple TV+, which offers exclusive original content; Apple Card, a co-branded credit card; and Apple Pay, a cashless payment service, as well as licenses its intellectual property. The company serves consumers, and small and mid-sized businesses; and the education, enterprise, and government markets. It distributes third-party applications for its products through the App Store. The company also sells its products through its retail and online stores, and direct sales force; and third-party cellular network carriers, wholesalers, retailers, and resellers. Apple Inc. was founded in 1976 and is headquartered in Cupertino, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"28-01-2025 16:49:51"},{"Company Name":"Comcast Corporation","Symbol":"CMCSA","Current Price":"38.01","Latest MA":"39.59","Price Target":47.7025,"Difference from MA":"-3.98%","Difference from Open":"0.21%","Change from Yesterday":"-0.63%","Change from Last Report":"-0.14","Latest Volume":"1,623,385","Market Cap":"145,446,780,928","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":8.6907015,"PB Ratio":1.6991506,"ROE":0.16884,"DTE":117.127,"Industry":"Telecom Services","Sector":"Communication Services","Beta":1.004,"Trailing PEG":1.1673,"Trailing PE":10.245282,"Trailing PS":1.1818216,"Quick Ratio":0.605,"Day High":38.175,"Day Low":37.77,"VS Average Volume":0.0770854919,"Company Summary":"Comcast Corporation operates as a media and technology company worldwide. It operates through Residential Connectivity & Platforms, Business Services Connectivity, Media, Studios, and Theme Parks segments. The Residential Connectivity & Platforms segment provides residential broadband and wireless connectivity services, residential and business video services, sky-branded entertainment television networks, and advertising. The Business Services Connectivity segment offers connectivity services for small business locations, which include broadband, wireline voice, and wireless services, as well as solutions for medium-sized customers and larger enterprises; and small business connectivity services in the United Kingdom. The Media segment operates NBCUniversal's television and streaming business, including national and regional cable networks; the NBC and Telemundo broadcast networks and owned local broadcast television stations; and Peacock, a direct-to-consumer streaming services. It also operates international television networks comprising the Sky Sports networks, as well as other digital properties. The Studios segment operates NBCUniversal and Sky film and television studio production and distribution operations. The Theme Parks segment operates Universal theme parks in Orlando, Florida; Hollywood, California; Osaka, Japan; and Beijing, China. The company also offers a consolidated streaming platforms under the Philadelphia Flyers and the Wells Fargo Center arena in Philadelphia, Pennsylvania; and Xumo. Comcast Corporation was founded in 1963 and is headquartered in Philadelphia, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"28-01-2025 16:49:51"},{"Company Name":"Tesla, Inc.","Symbol":"TSLA","Current Price":"389.43","Latest MA":"286.97","Price Target":319.46732,"Difference from MA":"35.70%","Difference from Open":"-1.88%","Change from Yesterday":"-2.04%","Change from Last Report":"0.22","Latest Volume":"7,497,417","Market Cap":"1,250,093,301,760","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":119.411606,"PB Ratio":17.85884,"ROE":0.20389,"DTE":18.078,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":2.295,"Trailing PEG":4.9826,"Trailing PE":106.40161,"Trailing PS":12.867661,"Quick Ratio":1.214,"Day High":397.1499,"Day Low":386.5,"VS Average Volume":0.0826816428,"Company Summary":"Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners; and provision of service and repairs to its energy product customers, including under warranty, as well as various financing options to its solar customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was incorporated in 2003 and is headquartered in Austin, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"28-01-2025 16:49:51"},{"Company Name":"QUALCOMM Incorporated","Symbol":"QCOM","Current Price":"170.18","Latest MA":"169.35","Price Target":202.92969,"Difference from MA":"0.49%","Difference from Open":"-0.02%","Change from Yesterday":"-0.58%","Change from Last Report":"-0.09","Latest Volume":"1,247,216","Market Cap":"188,115,255,296","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":13.934081,"PB Ratio":7.2091837,"ROE":0.42253,"DTE":58.765,"Industry":"Semiconductors","Sector":"Technology","Beta":1.286,"Trailing PEG":1.6999,"Trailing PE":19.05711,"Trailing PS":4.8281727,"Quick Ratio":1.64,"Day High":173.49,"Day Low":169.94,"VS Average Volume":0.1519649491,"Company Summary":"QUALCOMM Incorporated engages in the development and commercialization of foundational technologies for the wireless industry worldwide. It operates through three segments: Qualcomm CDMA Technologies (QCT); Qualcomm Technology Licensing (QTL); and Qualcomm Strategic Initiatives (QSI). The QCT segment develops and supplies integrated circuits and system software with advanced connectivity and high-performance, and low-power computing technologies for use in mobile devices; automotive systems for connectivity, digital cockpit, and ADAS\/AD; and IoT, including consumer electronic devices, industrial devices, and edge networking products. The QTL segment grants licenses or provides rights to use portions of its intellectual property portfolio, which include various patent rights useful in the manufacture and sale of wireless products comprising products implementing CDMA2000, WCDMA, LTE and\/or OFDMA-based 5G products. The QSI segment invests in early-stage companies in various industries, including 5G, artificial intelligence, automotive, consumer, enterprise, cloud, IoT, and extended reality, and investments, including non-marketable equity securities and, to a lesser extent, marketable equity securities, and convertible debt instruments. It also provides development, and other services and sells related products to the United States government agencies and their contractors. The company was incorporated in 1985 and is headquartered in San Diego, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"28-01-2025 16:49:51"},{"Company Name":"Microsoft Corporation","Symbol":"MSFT","Current Price":"433.21","Latest MA":"426.88","Price Target":509.1236,"Difference from MA":"1.48%","Difference from Open":"-0.32%","Change from Yesterday":"-0.26%","Change from Last Report":"-0.11","Latest Volume":"2,299,899","Market Cap":"3,220,901,462,016","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":28.904549,"PB Ratio":11.196211,"ROE":0.35604,"DTE":33.657,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.904,"Trailing PEG":2.3302,"Trailing PE":35.743813,"Trailing PS":12.671236,"Quick Ratio":1.163,"Day High":434.6,"Day Low":431.425,"VS Average Volume":0.1064590575,"Company Summary":"Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services. This segment also provides LinkedIn; and dynamics business solutions, including Dynamics 365, a set of intelligent, cloud-based applications across ERP, CRM, power apps, and power automate; and on-premises ERP and CRM applications. The Intelligent Cloud segment offers server products and cloud services, such as azure and other cloud services; SQL and windows server, visual studio, system center, and related client access licenses, as well as nuance and GitHub; and enterprise services including enterprise support services, industry solutions, and nuance professional services. The More Personal Computing segment offers Windows, including windows OEM licensing and other non-volume licensing of the Windows operating system; Windows commercial comprising volume licensing of the Windows operating system, windows cloud services, and other Windows commercial offerings; patent licensing; and windows Internet of Things; and devices, such as surface, HoloLens, and PC accessories. Additionally, this segment provides gaming, which includes Xbox hardware and content, and first- and third-party content; Xbox game pass and other subscriptions, cloud gaming, advertising, third-party disc royalties, and other cloud services; and search and news advertising, which includes Bing, Microsoft News and Edge, and third-party affiliates. The company sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online, and retail stores. The company was founded in 1975 and is headquartered in Redmond, Washington.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"28-01-2025 16:49:51"},{"Company Name":"Alibaba Group Holding Limited","Symbol":"BABA","Current Price":"89.96","Latest MA":"87.29","Price Target":120.953445,"Difference from MA":"3.06%","Difference from Open":"-1.08%","Change from Yesterday":"0.09%","Change from Last Report":"-0.11","Latest Volume":"1,707,038","Market Cap":"213,754,855,424","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":1.2690983,"PB Ratio":0.22191633,"ROE":0.05668,"DTE":22.796,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":0.349,"Trailing PEG":0.5927,"Trailing PE":18.62526,"Trailing PS":0.22494638,"Quick Ratio":0.97,"Day High":91.45,"Day Low":89.9,"VS Average Volume":0.1226017685,"Company Summary":"Alibaba Group Holding Limited, through its subsidiaries, provides technology infrastructure and marketing reach to help merchants, brands, retailers, and other businesses to engage with their users and customers in the People's Republic of China and internationally. The company operates through seven segments: China Commerce, International Commerce, Local Consumer Services, Cainiao, Cloud, Digital Media and Entertainment, and Innovation Initiatives and Others. It operates Taobao and Tmall, which are digital retail platforms; Alimama, a proprietary monetization platform; 1688.com and Alibaba.com, which are online wholesale marketplaces; AliExpress, a retail marketplace; Lazada, Trendyol, and Daraz that are e-commerce platforms; Freshippo, a retail platform for groceries and fresh goods; and Tmall Global, an import e-commerce platform. The company also operates Cainiao Network logistic services platform; Ele.me, an on-demand delivery and local services platform; Koubei, a restaurant and local services guide platform; and Fliggy, an online travel platform. In addition, it offers pay-for-performance, in-feed, and display marketing services; and Taobao Ad Network and Exchange, a real-time online bidding marketing exchange. Further, the company provides elastic computing, storage, network, security, database, big data, and IoT services; and hardware, software license, software installation, and application development and maintenance services. Additionally, it operates Youku, an online video platform; Quark, a platform for information search, storage, and consumption; Alibaba Pictures and other content platforms that provide online videos, films, live events, news feeds, literature, music, and others; Amap, a mobile digital map, navigation, and real-time traffic information app; DingTalk, a business efficiency mobile app; and Tmall Genie smart speaker. The company was incorporated in 1999 and is based in Hangzhou, the People's Republic of China.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"28-01-2025 16:49:51"},{"Company Name":"Meta Platforms, Inc.","Symbol":"META","Current Price":"665.45","Latest MA":"556.89","Price Target":670.74805,"Difference from MA":"19.49%","Difference from Open":"-0.08%","Change from Yesterday":"0.82%","Change from Last Report":"-0.70","Latest Volume":"3,714,460","Market Cap":"1,679,927,017,472","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":26.150078,"PB Ratio":10.208512,"ROE":0.36134,"DTE":29.811,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.215,"Trailing PEG":1.3752,"Trailing PE":31.433727,"Trailing PS":10.753117,"Quick Ratio":2.568,"Day High":675.48,"Day Low":664.46,"VS Average Volume":0.2859910681,"Company Summary":"Meta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and wearables worldwide. It operates in two segments, Family of Apps and Reality Labs. The Family of Apps segment offers Facebook, which enables people to share, discuss, discover, and connect with interests; Instagram, a community for sharing photos, videos, and private messages, as well as feed, stories, reels, video, live, and shops; Messenger, a messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls; and WhatsApp, a messaging application that is used by people and businesses to communicate and transact privately. The Reality Labs segment provides augmented and virtual reality related products comprising consumer hardware, software, and content that help people feel connected, anytime, and anywhere. The company was formerly known as Facebook, Inc. and changed its name to Meta Platforms, Inc. in October 2021. The company was incorporated in 2004 and is headquartered in Menlo Park, California","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"28-01-2025 16:49:51"}]