[{"Company Name":"Webster Financial Corporation","Symbol":"WBS","Current Price":"57.94","Latest MA":"49.73","Price Target":67.78571,"Difference from MA":"16.51%","Difference from Open":"0.49%","Change from Yesterday":"-0.38%","Change from Last Report":"0.00","Latest Volume":"1,632,686","Market Cap":"9,931,495,424","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":10.073018,"PB Ratio":1.1142522,"ROE":0.08925,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.257,"Trailing PEG":null,"Trailing PE":13.108597,"Trailing PS":4.192367,"Quick Ratio":"N\/A","Day High":58.4,"Day Low":57.21,"VS Average Volume":1.415506286,"Company Summary":"Webster Financial Corporation operates as the bank holding company for Webster Bank, National Association that provides a range of financial products and services to individuals, families, and businesses in the United States. It operates through three segments: Commercial Banking, HSA Bank, and Consumer Banking. The Commercial Banking segment offers commercial real estate and equipment financing, business banking, asset-based lending, and commercial services; public sector finance; mortgage warehouse financing; sponsor and specialty financing services; credit, deposit, and cash flow management services; and wealth management solutions to business owners and operators, including trust, asset management, financial planning, insurance, retirement, and investment products, as well as treasury management services comprising derivative, treasury, accounts payable, accounts receivable, and trade products and services. This segment also provides commercial services, such as accounts receivable factoring and trade financing, payroll funding, and business process outsourcing. The HSA Bank segment offers health savings accounts, health reimbursement arrangements, flexible spending accounts, and commuter benefit services that are distributed directly to employers and individual consumers, as well as through national and regional insurance carriers, benefit consultants, and financial advisors. The Consumer Banking segment provides consumer deposit and fee-based services, residential mortgages, home equity lines, secured and unsecured loans, and credit cards to consumers; and small business banking products, such as credit, deposit, and cash flow management products to businesses and professional service firms. The company offers online and mobile banking services. Webster Financial Corporation was founded in 1935 and is headquartered in Stamford, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"Fastenal Company","Symbol":"FAST","Current Price":"74.77","Latest MA":"71.86","Price Target":75.86385,"Difference from MA":"4.05%","Difference from Open":"0.63%","Change from Yesterday":"0.67%","Change from Last Report":"0.00","Latest Volume":"3,941,472","Market Cap":"42,834,685,952","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":34.213257,"PB Ratio":11.907947,"ROE":0.32698002,"DTE":14.644,"Industry":"Industrial Distribution","Sector":"Industrials","Beta":0.979,"Trailing PEG":4.0674,"Trailing PE":37.199005,"Trailing PS":5.7264857,"Quick Ratio":2.013,"Day High":75.04,"Day Low":73.94,"VS Average Volume":1.4544230791,"Company Summary":"Fastenal Company, together with its subsidiaries, engages in the wholesale distribution of industrial and construction supplies in the United States, Canada, Mexico, North America, and internationally. It offers fasteners, and related industrial and construction supplies under the Fastenal name. The company's fastener products include threaded fasteners, bolts, nuts, screws, studs, and related washers that are used in manufactured products and construction projects, as well as in the maintenance and repair of machines. It also offers miscellaneous supplies and hardware, including pins, machinery keys, concrete anchors, metal framing systems, wire ropes, strut products, rivets, and related accessories. The company serves the manufacturing market comprising original equipment manufacturers; maintenance, repair, and operations customers; non-residential construction market; farmers, truckers, railroads, mining companies, schools, and retail trades; and oil exploration, production, and refinement companies, as well as federal, state, and local governmental entities. Fastenal Company was founded in 1967 and is headquartered in Winona, Minnesota.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"Citizens Financial Group, Inc.","Symbol":"CFG","Current Price":"46.80","Latest MA":"41.55","Price Target":51.21579,"Difference from MA":"12.62%","Difference from Open":"0.21%","Change from Yesterday":"-0.59%","Change from Last Report":"0.00","Latest Volume":"6,053,085","Market Cap":"20,624,805,888","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":12.185945,"PB Ratio":0.9130638,"ROE":0.05426,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.32,"Trailing PEG":null,"Trailing PE":18.352942,"Trailing PS":2.8987782,"Quick Ratio":"N\/A","Day High":47.03,"Day Low":45.71,"VS Average Volume":1.5130684988,"Company Summary":"Citizens Financial Group, Inc. operates as the bank holding company that provides retail and commercial banking products and services to individuals, small businesses, middle-market companies, corporations, and institutions in the United States. The company operates in two segments, Consumer Banking and Commercial Banking. The Consumer Banking segment offers deposit products, mortgage and home equity lending products, credit cards, business loans, wealth management, and investment services; and auto, education, and point-of-sale finance loans, as well as digital deposit products. This segment serves its customers through telephone service centers, as well as through its online and mobile platforms. The Commercial Banking segment provides various financial products and solutions, including lending and leasing, deposit and treasury management services, foreign exchange, and interest rate and commodity risk management solutions, as well as syndicated loans, corporate finance, mergers and acquisitions, and debt and equity capital markets services. This segment serves corporate banking, healthcare, technology, asset finance, franchise finance, leasing, asset-based lending, commercial real estate, mid-corporate, and private equity sponsor industries. The company was formerly known as RBS Citizens Financial Group, Inc. and changed its name to Citizens Financial Group, Inc. in April 2014. Citizens Financial Group, Inc. was founded in 1828 and is headquartered in Providence, Rhode Island.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"Truist Financial Corporation","Symbol":"TFC","Current Price":"44.98","Latest MA":"42.48","Price Target":50.033,"Difference from MA":"5.88%","Difference from Open":"0.09%","Change from Yesterday":"-0.90%","Change from Last Report":"0.00","Latest Volume":"11,153,252","Market Cap":"59,711,848,448","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":11.407442,"PB Ratio":1.0116732,"ROE":-0.09505,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.035,"Trailing PEG":1.9441,"Trailing PE":"N\/A","Trailing PS":4.118911,"Quick Ratio":"N\/A","Day High":45.49,"Day Low":44.44,"VS Average Volume":1.4475076514,"Company Summary":"Truist Financial Corporation, a financial services company, provides banking and trust services in the Southeastern and Mid-Atlantic United States. The company operates through three segments: Consumer Banking and Wealth, Corporate and Commercial Banking, and Insurance Holdings.Its deposit products include noninterest-bearing checking, interest-bearing checking, savings, and money market deposit accounts, as well as certificates of deposit and individual retirement accounts. The company also provides funding; asset management; automobile lending; credit card lending; consumer finance; home equity and mortgage lending; other direct retail lending; insurance; investment brokerage; mobile\/online banking; payment solutions; point-of-sale lending; retail and small business deposit products; small business lending; and wealth management\/private banking services. In addition, it offers asset based lending, investment banking and capital market, institutional trust, insurance premium finance, derivatives, commercial lending, international banking, leasing, merchant, commercial deposit and treasury, floor plan, mortgage warehouse lending, real estate lending, and supply chain financing services. Further, the company provides insurance brokerage, retail and wholesale brokerage, securities underwriting and market making, loan syndication, and investment management and advisory services. The company was formerly known as BB&T Corporation and changed its name to Truist Financial Corporation in December 2019. Truist Financial Corporation was founded in 1872 and is headquartered in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"Regions Financial Corporation","Symbol":"RF","Current Price":"24.52","Latest MA":"22.73","Price Target":27.41955,"Difference from MA":"7.87%","Difference from Open":"0.53%","Change from Yesterday":"-0.73%","Change from Last Report":"0.00","Latest Volume":"9,876,675","Market Cap":"22,285,344,768","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":10.923558,"PB Ratio":1.3163687,"ROE":0.10042,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.182,"Trailing PEG":4.7518,"Trailing PE":13.853107,"Trailing PS":3.3992288,"Quick Ratio":"N\/A","Day High":24.67,"Day Low":24.17,"VS Average Volume":1.2301757327,"Company Summary":"Regions Financial Corporation, a financial holding company, provides banking and bank-related services to individual and corporate customers. It operates through three segments: Corporate Bank, Consumer Bank, and Wealth Management. The Corporate Bank segment offers commercial banking services, such as commercial and industrial, commercial real estate, and investor real estate lending; equipment lease financing; deposit products; and securities underwriting and placement, loan syndication and placement, foreign exchange, derivatives, merger and acquisition, and other advisory services. It serves corporate, middle market, and commercial real estate developers and investors. The Consumer Bank segment provides consumer banking products and services related to residential first mortgages, home equity lines and loans, consumer credit cards, and other consumer loans, as well as deposits. The Wealth Management segment offers credit related products, and retirement and savings solutions; and trust and investment management, asset management, and estate planning services to individuals, businesses, governmental institutions, and non-profit entities. It also provides investment and insurance products; low-income housing tax credit corporate fund syndication services; and other specialty financing services. The company was founded in 1971 and is headquartered in Birmingham, Alabama.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"Huntington Bancshares Incorpora","Symbol":"HBAN","Current Price":"16.84","Latest MA":"15.00","Price Target":18.6605,"Difference from MA":"12.29%","Difference from Open":"-0.30%","Change from Yesterday":"-1.17%","Change from Last Report":"0.00","Latest Volume":"22,858,361","Market Cap":"24,465,319,936","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":12.369347,"PB Ratio":1.3433312,"ROE":0.08545,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.057,"Trailing PEG":2.881,"Trailing PE":16.349516,"Trailing PS":3.6569986,"Quick Ratio":"N\/A","Day High":17.04,"Day Low":16.66,"VS Average Volume":1.5582931717,"Company Summary":"Huntington Bancshares Incorporated operates as the bank holding company for The Huntington National Bank that provides commercial, consumer, and mortgage banking services in the United States. The company offers financial products and services to consumer and business customers, including deposits, lending, payments, mortgage banking, dealer financing, investment management, trust, brokerage, insurance, and other financial products and services. It also provides 24-hour grace, asterisk-free checking, money scout, $50 safety zone, standby cash, early pay, instant access, savings goal getter, and Huntington heads up; digitally powered consumer and business financial solutions to consumer lending, regional banking, branch banking, and wealth management customers; direct and indirect consumer loans, as well as dealer finance loans and deposits; and private banking, wealth management and legacy planning through investment and portfolio management, fiduciary administration and trust, institutional custody, and full-service retail brokerage investment services. The company offers equipment financing, asset-based lending, distribution finance, structured lending, and municipal financing solutions, as well as Huntington ChoicePay. In addition, it offers lending, liquidity, treasury management and other payment services, and capital markets; government and non-profits, healthcare, technology and telecommunications, franchises, financial sponsors, and global services; and corporate risk management, institutional sales and trading, debt and equity issuance, and additional advisory services. The company offers its products through a network of channels, including branches and ATMs, online and mobile banking, and through customer call centers to customers in middle market banking, corporate, specialty, and government banking, asset finance, commercial real estate banking, and capital markets. The company was founded in 1866 and is headquartered in Columbus, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"UnitedHealth Group Incorporated","Symbol":"UNH","Current Price":"510.59","Latest MA":"555.14","Price Target":637.8546,"Difference from MA":"-8.02%","Difference from Open":"-3.73%","Change from Yesterday":"-6.04%","Change from Last Report":"0.00","Latest Volume":"9,047,343","Market Cap":"469,887,811,584","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":15.203927,"PB Ratio":4.985208,"ROE":0.15252,"DTE":74.683,"Industry":"Healthcare Plans","Sector":"Healthcare","Beta":0.591,"Trailing PEG":1.5042,"Trailing PE":32.898838,"Trailing PS":1.1929175,"Quick Ratio":0.833,"Day High":539.475,"Day Low":510.06,"VS Average Volume":1.9275113208,"Company Summary":"UnitedHealth Group Incorporated operates as a diversified health care company in the United States. The company operates through four segments: UnitedHealthcare, Optum Health, Optum Insight, and Optum Rx. The UnitedHealthcare segment offers consumer-oriented health benefit plans and services for national employers, public sector employers, mid-sized employers, small businesses, and individuals; health care coverage, and health and well-being services to individuals age 50 and older addressing their needs; Medicaid plans, children's health insurance and health care programs; and health and dental benefits, and hospital and clinical services, as well as health care benefits products and services to state programs caring for the economically disadvantaged, medically underserved, and those without the benefit of employer-funded health care coverage. The Optum Health segment provides care delivery, care management, wellness and consumer engagement, and health financial services patients, consumers, care delivery systems, providers, employers, payers, and public-sector entities. The Optum Insight segment offers software and information products, advisory consulting arrangements, and managed services outsourcing contracts to hospital systems, physicians, health plans, governments, life sciences companies, and other organizations. The Optum Rx segment provides pharmacy care services and programs, including retail network contracting, home delivery, specialty and community health pharmacy services, infusion, and purchasing and clinical capabilities, as well as develops programs in the areas of step therapy, formulary management, drug adherence, and disease\/drug therapy management. UnitedHealth Group Incorporated was founded in 1974 and is based in Minnetonka, Minnesota.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"State Street Corporation","Symbol":"STT","Current Price":"100.49","Latest MA":"86.84","Price Target":108.9375,"Difference from MA":"15.72%","Difference from Open":"1.23%","Change from Yesterday":"0.72%","Change from Last Report":"0.00","Latest Volume":"2,218,011","Market Cap":"29,458,743,296","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":10.406279,"PB Ratio":1.2846934,"ROE":0.0855,"DTE":"N\/A","Industry":"Asset Management","Sector":"Financial Services","Beta":1.48,"Trailing PEG":0.6382,"Trailing PE":15.750783,"Trailing PS":2.3476844,"Quick Ratio":"N\/A","Day High":100.49,"Day Low":99.14,"VS Average Volume":1.0741181427,"Company Summary":"State Street Corporation, through its subsidiaries, provides a range of financial products and services to institutional investors worldwide. The company offers investment servicing products and services, including custody, accounting, regulatory reporting, investor, and performance and analytics; middle office products, such as IBOR, transaction management, loans, cash, derivatives and collateral, record keeping, and client reporting and investment analytics; finance leasing; foreign exchange, and brokerage and other trading services; securities finance and enhanced custody products; deposit and short-term investment facilities; investment manager and alternative investment manager operations outsourcing; performance, risk, and compliance analytics; and financial data management to support institutional investors. It also engages in the provision of portfolio management and risk analytics, as well as trading and post-trade settlement services with integrated compliance and managed data. In addition, the company offers investment management strategies and products, such as core and enhanced indexing, multi-asset strategies, active quantitative and fundamental active capabilities, and alternative investment strategies. Further, it provides services and solutions, including environmental, social, and governance investing; defined benefit and defined contribution; and global fiduciary solutions, as well as exchange-traded funds under the SPDR ETF brand. The company provides its products and services to mutual funds, collective investment funds, UCITS, hedge funds and other investment pools, corporate and public retirement plans, insurance companies, foundations, endowments, and investment managers. State Street Corporation was founded in 1792 and is headquartered in Boston, Massachusetts.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"PNC Financial Services Group, I","Symbol":"PNC","Current Price":"196.54","Latest MA":"181.39","Price Target":218.256,"Difference from MA":"8.35%","Difference from Open":"5.95%","Change from Yesterday":"-1.95%","Change from Last Report":"0.00","Latest Volume":"5,063,985","Market Cap":"77,817,454,592","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":11.400206,"PB Ratio":1.5778234,"ROE":0.099020004,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.121,"Trailing PEG":1.9776,"Trailing PE":14.304221,"Trailing PS":3.7989385,"Quick Ratio":"N\/A","Day High":196.98,"Day Low":183.44,"VS Average Volume":2.6082310949,"Company Summary":"The PNC Financial Services Group, Inc. operates as a diversified financial services company in the United States. It operates through three segments: Retail Banking, Corporate & Institutional Banking, and Asset Management Group segments. The company's Retail Banking segment offers checking, savings, and money market accounts, as well as time deposit; residential mortgages, home equity loans and lines of credit, auto loans, credit cards, education loans, and personal and small business loans and lines of credit; and brokerage, insurance, and investment and cash management services. This segment serves consumer and small business customers through a network of branches, digital channels, ATMs, and through phone-based customer contact centers. Its Corporate & Institutional Banking segment provides secured and unsecured loans, letters of credit, and equipment leases; cash and investment management services, receivables and disbursement management services, funds transfer services, international payment services, and access to online\/mobile information management and reporting; securities underwriting, loan syndications, customer-related trading, and mergers and acquisitions and equity capital markets advisory related services; and commercial loan servicing and technology solutions. It serves mid-sized and large corporations, and government and not-for-profit entities. The company's Asset Management Group segment offers investment and retirement planning, customized investment management, credit and cash management solutions, and trust management and administration services for high net worth and ultra high net worth individuals, and their families; and multi-generational family planning services for ultra high net worth individuals and their families. It also provides outsourced chief investment officer, custody, private real estate, cash and fixed income client solutions, and retirement plan fiduciary investment services for institutional clients. The company was founded in 1852 and is headquartered in Pittsburgh, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"M&T Bank Corporation","Symbol":"MTB","Current Price":"196.10","Latest MA":"178.82","Price Target":221.8158,"Difference from MA":"9.66%","Difference from Open":"0.20%","Change from Yesterday":"-2.37%","Change from Last Report":"0.00","Latest Volume":"2,392,870","Market Cap":"32,537,108,480","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.621565,"PB Ratio":1.2303156,"ROE":0.08676,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.732,"Trailing PEG":null,"Trailing PE":13.385666,"Trailing PS":3.8283455,"Quick Ratio":"N\/A","Day High":198.54,"Day Low":193.095,"VS Average Volume":2.0711858421,"Company Summary":"M&T Bank Corporation operates as a bank holding company for Manufacturers and Traders Trust Company and Wilmington Trust, National Association that engages in the provision of retail and commercial banking products and services in the United States. The company operates through three segments: Commercial Bank, Retail Bank, and Institutional Services and Wealth Management. It offers a range of credit products and banking services, such as commercial lending and leasing, letters of credits, commercial real estate loans, and credit facilities secured by various commercial real estate to middle-market and large commercial customers. The company also provides customers deposit products, including demand, savings and time accounts, and other services; automobile and recreational finance loans, home equity loans and lines of credit, credit cards, and other loan products, as well as residential mortgage and real estate loans; business loans, cash management, payroll, and direct deposit services to consumers and small businesses through branch network, telephone banking, internet banking, and automated teller machines. In addition, it offers trustee, agency, investment management, security brokerage, and administrative services; personal trust, planning, fiduciary, asset management, family office, and other services; and investment products, including mutual funds and annuities, and other services for corporations and institutions, investment bankers, corporate tax, finance and legal executives, and other institutional clients. The company was founded in 1856 and is headquartered in Buffalo, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"Schlumberger N.V.","Symbol":"SLB","Current Price":"41.09","Latest MA":"42.84","Price Target":53.89433,"Difference from MA":"-4.08%","Difference from Open":"1.58%","Change from Yesterday":"1.11%","Change from Last Report":"0.00","Latest Volume":"16,064,049","Market Cap":"58,025,242,624","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":11.976449,"PB Ratio":2.6974332,"ROE":0.21722999,"DTE":57.141,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.532,"Trailing PEG":1.8117,"Trailing PE":13.212219,"Trailing PS":1.6120361,"Quick Ratio":1.003,"Day High":41.22,"Day Low":40.33,"VS Average Volume":1.3218453115,"Company Summary":"Schlumberger Limited engages in the provision of technology for the energy industry worldwide. The company operates through four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company provides field development and hydrocarbon production, carbon management, and integration of adjacent energy systems; reservoir interpretation and data processing services for exploration data; and well construction and production improvement services and products. It also offers subsurface geology and fluids evaluation information; open and cased hole services; exploration and production pressure, and flow-rate measurement services; and pressure pumping, well stimulation, and coiled tubing equipment solutions. In addition, the company offers mud logging, directional drilling, measurement-while-drilling, and logging-while-drilling services, as well as engineering support services; supplies drilling fluid systems; designs, manufactures, and markets roller cone and fixed cutter drill bits; bottom-hole-assembly and borehole enlargement technologies; well cementing products and services; well planning, well drilling, engineering, supervision, logistics, procurement, and contracting of third parties, as well as drilling rig management solutions; and drilling equipment and services, as well as land drilling rigs and related services. Further, it provides artificial lift production equipment and optimization services; supplies packers, safety valves, sand control technology, and various intelligent well completions technology and equipment; designs and manufactures valves, chokes, actuators, and surface trees; and OneSubsea, an integrated solutions, products, systems, and services, including wellheads, subsea trees, manifolds and flowline connectors, control systems, connectors, and services. The company was formerly known as Socie´te´ de Prospection E´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"Bank OZK","Symbol":"OZK","Current Price":"45.34","Latest MA":"43.02","Price Target":52.25,"Difference from MA":"5.40%","Difference from Open":"1.48%","Change from Yesterday":"0.27%","Change from Last Report":"0.00","Latest Volume":"1,477,550","Market Cap":"5,143,687,168","Earning Date":"2025-01-16","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":7.0471354,"PB Ratio":0.97905415,"ROE":0.13515,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.152,"Trailing PEG":null,"Trailing PE":7.457237,"Trailing PS":3.5249205,"Quick Ratio":"N\/A","Day High":45.52,"Day Low":44.645,"VS Average Volume":1.2018552275,"Company Summary":"Bank OZK provides various retail and commercial banking services for individuals and businesses in the United States. The company offers deposit services, including non-interest bearing checking, interest bearing transaction, business sweep, savings, money market, individual retirement, and other accounts, as well as time and reciprocal deposits. It also provides trust and wealth services, such as personal trusts, custodial accounts, investment management accounts, and retirement accounts, as well as corporate trust services, including trustee, paying agent and registered transfer agent services, and other related services. In addition, the company offers treasury management services comprising automated clearing house, wire transfer, transaction reporting, wholesale lockbox, remote deposit capture, automated credit line transfer, reconciliation, positive pay, commercial card, and other services, as well as zero balance and investment sweep accounts. Further, it provides real estate, consumer, small business, indirect recreational vehicle and marine, equipment, agricultural, commercial and industrial, government guaranteed, lines of credit, homebuilder, and affordable housing loans; lender and structured, business aviation, and subscription financing services; and mortgage and other lending products. Additionally, the company offers ATMs; telephone, online, and mobile banking services; credit and debit cards; safe deposit boxes; and other products and services. The company was formerly known as Bank of the Ozarks and changed its name to Bank OZK in July 2018. Bank OZK was founded in 1903 and is headquartered in Little Rock, Arkansas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"U.S. Bancorp","Symbol":"USB","Current Price":"48.03","Latest MA":"45.40","Price Target":56.82773,"Difference from MA":"5.80%","Difference from Open":"0.29%","Change from Yesterday":"-5.64%","Change from Last Report":"0.00","Latest Volume":"17,253,699","Market Cap":"74,926,800,896","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":9.869759,"PB Ratio":1.4401367,"ROE":0.09779,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.04,"Trailing PEG":1.2382,"Trailing PE":12.672823,"Trailing PS":3.0094712,"Quick Ratio":"N\/A","Day High":49.21,"Day Low":47.2,"VS Average Volume":2.2519013719,"Company Summary":"U.S. Bancorp, a financial services holding company, provides various financial services to individuals, businesses, institutional organizations, governmental entities, and other financial institutions in the United States. It operates through Wealth, Corporate, Commercial and Institutional Banking; Consumer and Business Banking; Payment Services; and Treasury and Corporate Support segments. The company offers depository services, including checking accounts, savings accounts, and time certificate contracts; and lending services, such as traditional credit products and credit card services, lease financing and import\/export trade, asset-backed lending, agricultural finance, and other products. It also provides ancillary services comprising capital markets, treasury management, and receivable lock-box collection services to corporate and governmental entity customers. In addition, the company offers asset management and fiduciary services for individuals, estates, foundations, business corporations, and charitable organizations. Further, it provides investment and insurance products to its customers principally within its domestic markets, as well as fund administration services to mutual and other funds. Additionally, the company provides corporate and purchasing card, and corporate trust services. Furthermore, it offers trust and investment management, merchant and ATM processing, mortgage banking, insurance, and brokerage and leasing services. U.S. Bancorp was founded in 1863 and is headquartered in Minneapolis, Minnesota.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"Bank of America Corporation","Symbol":"BAC","Current Price":"46.64","Latest MA":"41.79","Price Target":50.80136,"Difference from MA":"11.61%","Difference from Open":"-0.77%","Change from Yesterday":"-0.98%","Change from Last Report":"0.00","Latest Volume":"51,401,321","Market Cap":"354,970,501,120","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.764302,"PB Ratio":1.3185943,"ROE":0.08092,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.325,"Trailing PEG":2.0868,"Trailing PE":14.529594,"Trailing PS":3.7513,"Quick Ratio":"N\/A","Day High":47.5,"Day Low":45.82,"VS Average Volume":1.4887216305,"Company Summary":"Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. It operates in four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, non-interest and interest-bearing checking accounts, and investment accounts and products; credit and debit cards; residential mortgages, and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research, and certain market-based services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"J.B. Hunt Transport Services, I","Symbol":"JBHT","Current Price":"186.20","Latest MA":"172.10","Price Target":190.42857,"Difference from MA":"8.19%","Difference from Open":"0.19%","Change from Yesterday":"-0.19%","Change from Last Report":"0.00","Latest Volume":"1,316,472","Market Cap":"18,774,546,432","Earning Date":"2025-01-16","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":22.174877,"PB Ratio":4.693368,"ROE":0.14192,"DTE":47.555,"Industry":"Integrated Freight & Logistics","Sector":"Industrials","Beta":1.141,"Trailing PEG":2.7074,"Trailing PE":33.42908,"Trailing PS":1.5332974,"Quick Ratio":0.677,"Day High":187.5,"Day Low":184.335,"VS Average Volume":1.6146215585,"Company Summary":"J.B. Hunt Transport Services, Inc. provides surface transportation, delivery, and logistic services in the United States. It operates through five segments: Intermodal (JBI), Dedicated Contract Services (DCS), Integrated Capacity Solutions (ICS), Final Mile Services (FMS), and Truckload (JBT). The JBI segment offers intermodal freight solutions. It operates 118,171 pieces of company-owned trailing equipment; owns and maintains its chassis fleet of 100,825 units; and manages a fleet of 5,944 company-owned tractors, 436 independent contractor trucks, and 7,567 company drivers. The DCS segment designs, develops, and executes supply chain solutions that support various transportation networks. As of December 31, 2023, it operated 12,574 company-owned trucks, 674 customer-owned trucks, and 4 contractor trucks. The company also operates 27,194 owned pieces of trailing equipment and 5,406 customer-owned trailers. The ICS segment provides freight brokerage and transportation logistics solutions; flatbed, refrigerated, expedited, and less-than-truckload, as well as dry-van and intermodal solutions; online multimodal marketplace; and logistics management for customers to outsource their transportation functions. The FMS segment offers delivery services through 1,166 company-owned trucks, 225 customer-owned trucks, and 20 independent contractor trucks; and 1,212 owned pieces of trailing equipment and 102 customer-owned trailers. The JBT segment provides dry-van freight services by utilizing tractors and trailers operating over roads and highways through 27 company-owned tractors and 13,561 company-owned trailers. It also transports or arranges for the transportation of freight, such as general merchandise, specialty consumer items, appliances, forest and paper products, food and beverages, building materials, soaps and cosmetics, automotive parts, agricultural products, electronics, and chemicals. The company was incorporated in 1961 and is headquartered in Lowell, Arkansas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"First Horizon Corporation","Symbol":"FHN","Current Price":"21.31","Latest MA":"17.18","Price Target":22.73333,"Difference from MA":"24.03%","Difference from Open":"1.48%","Change from Yesterday":"-0.37%","Change from Last Report":"0.00","Latest Volume":"9,945,400","Market Cap":"11,166,439,424","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":11.334865,"PB Ratio":1.319423,"ROE":0.08979,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.882,"Trailing PEG":null,"Trailing PE":15.669117,"Trailing PS":3.6360922,"Quick Ratio":"N\/A","Day High":21.615,"Day Low":20.38,"VS Average Volume":1.6090521357,"Company Summary":"First Horizon Corporation operates as the bank holding company for First Horizon Bank that provides various financial services. The company operates through Regional Banking and Specialty Banking segments. It offers general banking services for consumers, businesses, financial institutions, and governments. The company also accepts deposits; provides underwriting services for bank-eligible securities and other fixed-income securities by financial subsidiaries; sells loans and derivatives; financial planning; and offers investment and financial advisory services. In addition, it offers mortgage banking; loan syndications; brokerage services; commercial and business banking for business enterprises, consumer banking, and private client and wealth management services; capital markets, professional commercial real estate, mortgage warehouse and asset-based lending, franchise and equipment finance, tax credit finance, energy and healthcare finance, asset management, and corporate and correspondent banking services. Further, the company provides transaction processing services including check clearing services and remittance processing, credit cards, investment, and sale of mutual fund and retail insurances, as well as trust, fiduciary, and agency services. First Horizon Corporation was founded in 1864 and is headquartered in Memphis, Tennessee.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"Wells Fargo & Company","Symbol":"WFC","Current Price":"75.95","Latest MA":"62.36","Price Target":79.45091,"Difference from MA":"21.80%","Difference from Open":"0.13%","Change from Yesterday":"0.00%","Change from Last Report":"0.00","Latest Volume":"17,202,578","Market Cap":"249,794,985,984","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":11.120645,"PB Ratio":1.5431346,"ROE":0.099139996,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.136,"Trailing PEG":3.528,"Trailing PE":14.143389,"Trailing PS":3.2076402,"Quick Ratio":"N\/A","Day High":76.435,"Day Low":74.69,"VS Average Volume":1.0059000058,"Company Summary":"Wells Fargo & Company, a financial services company, provides diversified banking, investment, mortgage, and consumer and commercial finance products and services in the United States and internationally. The company operates through four segments: Consumer Banking and Lending; Commercial Banking; Corporate and Investment Banking; and Wealth and Investment Management. The Consumer Banking and Lending segment offers diversified financial products and services for consumers and small businesses. Its financial products and services include checking and savings accounts, and credit and debit cards, as well as home, auto, personal, and small business lending services. The Commercial Banking segment provides financial solutions to private, family owned, and certain public companies. Its products and services include banking and credit products across various industry sectors and municipalities, secured lending and lease products, and treasury management services. The Corporate and Investment Banking segment offers a suite of capital markets, banking, and financial products and services, such as corporate banking, investment banking, treasury management, commercial real estate lending and servicing, equity, and fixed income solutions, as well as sales, trading, and research capabilities services to corporate, commercial real estate, government, and institutional clients. The Wealth and Investment Management segment provides personalized wealth management, brokerage, financial planning, lending, private banking, and trust and fiduciary products and services to affluent, high-net worth, and ultra-high-net worth clients. It also operates through financial advisors in brokerage and wealth offices, consumer bank branches, independent offices, and digitally through WellsTrade and Intuitive Investor. The company was founded in 1852 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"Citigroup, Inc.","Symbol":"C","Current Price":"78.51","Latest MA":"64.40","Price Target":87.7355,"Difference from MA":"21.91%","Difference from Open":"0.87%","Change from Yesterday":"0.31%","Change from Last Report":"0.00","Latest Volume":"17,793,852","Market Cap":"147,371,130,880","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.532082,"PB Ratio":0.77040833,"ROE":0.03874,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.426,"Trailing PEG":0.7067,"Trailing PE":13.194959,"Trailing PS":2.126322,"Quick Ratio":"N\/A","Day High":78.76,"Day Low":77.76,"VS Average Volume":1.2510181744,"Company Summary":"Citigroup Inc., a diversified financial service holding company, provides various financial product and services to consumers, corporations, governments, and institutions worldwide. It operates through five segments: Services, Markets, Banking, U.S. Personal Banking, and Wealth. The Services segment includes Treasury and Trade Solutions, which provides cash management, trade, and working capital solutions to multinational corporations, financial institutions, and public sector organizations; and Securities Services, such as cross-border support for clients, local market expertise, post-trade technologies, data solutions, and various securities services solutions. The Markets segment offers sales and trading services for equities, foreign exchange, rates, spread products, and commodities to corporate, institutional, and public sector clients; and market-making services, including asset classes, risk management solutions, financing, prime brokerage, research, securities clearing, and settlement. The banking segment includes investment banking; advisory services related to mergers and acquisitions, divestitures, restructurings, and corporate defense activities; and corporate lending, which includes corporate and commercial banking. The U.S. Personal Banking segment provides co-branded cards and retail banking services. The Wealth segment provides financial services to high-net-worth clients through banking, lending, mortgages, investment, custody, and trust product offerings; and to professional industries, including law firms, consulting groups, accounting, and asset management. The company was founded in 1812 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"Morgan Stanley","Symbol":"MS","Current Price":"135.81","Latest MA":"111.00","Price Target":133.0,"Difference from MA":"22.35%","Difference from Open":"2.61%","Change from Yesterday":"4.03%","Change from Last Report":"0.00","Latest Volume":"13,849,695","Market Cap":"218,246,676,480","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":14.890386,"PB Ratio":2.3316622,"ROE":0.11079001,"DTE":405.772,"Industry":"Capital Markets","Sector":"Financial Services","Beta":1.336,"Trailing PEG":3.7088,"Trailing PE":17.104534,"Trailing PS":3.7446668,"Quick Ratio":1.83,"Day High":136.15,"Day Low":131.9,"VS Average Volume":2.1055887052,"Company Summary":"Morgan Stanley, a financial holding company, provides various financial products and services to corporations, governments, financial institutions, and individuals in the Americas, Europe, the Middle East, Africa, and Asia. It operates through Institutional Securities, Wealth Management, and Investment Management segments. The Institutional Securities segment offers capital raising and financial advisory services, including services related to the underwriting of debt, equity, and other securities, as well as advice on mergers and acquisitions, restructurings, real estate, and project finance. This segment also provides equity and fixed income products comprising sales, financing, prime brokerage, and market-making services; foreign exchange and commodities; corporate and commercial real estate loans, commercial mortgage and secured lending facilities, and financing for sales and trading customers, and asset-backed and mortgage lending; and wealth management services, investment, and research services. The Wealth Management segment offers financial advisor-led brokerage, custody, administrative, and investment advisory services; self-directed brokerage services; financial and wealth planning services; workplace services, including stock plan administration; annuity and insurance products; securities-based lending, residential real estate loans, and other lending products; banking; and retirement plan services to individual investors and small to medium-sized businesses and institutions. The Investment Management segment provides equity, fixed income, alternatives and solutions, and liquidity and overlay services to benefit\/defined contribution plans, foundations, endowments, government entities, sovereign wealth funds, insurance companies, third-party fund sponsors, corporations, and individuals through institutional and intermediary channels. The company was founded in 1924 and is headquartered in New York, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"Synovus Financial Corp.","Symbol":"SNV","Current Price":"54.23","Latest MA":"46.81","Price Target":62.88235,"Difference from MA":"15.85%","Difference from Open":"-0.42%","Change from Yesterday":"-3.13%","Change from Last Report":"0.00","Latest Volume":"2,807,456","Market Cap":"7,655,432,192","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":10.148475,"PB Ratio":1.5980079,"ROE":0.07237,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.392,"Trailing PEG":null,"Trailing PE":17.89769,"Trailing PS":4.3728037,"Quick Ratio":"N\/A","Day High":55.66,"Day Low":53.44,"VS Average Volume":2.0976570877,"Company Summary":"Synovus Financial Corp. operates as the bank holding company for Synovus Bank that provides commercial and consumer banking products and services. It operates through four segments: Community Banking, Wholesale Banking, Consumer Banking, and Financial Management Services. The company's commercial banking services include treasury and asset management, capital market, and institutional trust services, as well as commercial, financial, and real estate lending services. Its consumer banking services comprise accepting customary types of demand and savings deposits accounts; mortgage, installment, and other consumer loans; investment and brokerage services; safe deposit services; automated banking services; automated fund transfers; internet-based banking services; and bank credit and debit card services, including Visa and MasterCard services. The company also offers various other financial services, including portfolio management for fixed-income securities, investment banking, execution of securities transactions as a broker\/dealer, trust management, and financial planning services, as well as provides individual investment advice on equity and other securities. The company was founded in 1888 and is headquartered in Columbus, Georgia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"Concentrix Corporation","Symbol":"CNXC","Current Price":"48.78","Latest MA":"55.08","Price Target":68.83333,"Difference from MA":"-11.43%","Difference from Open":"3.88%","Change from Yesterday":"2.76%","Change from Last Report":"0.00","Latest Volume":"1,996,913","Market Cap":"3,133,529,600","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":3.834152,"PB Ratio":0.75349873,"ROE":0.05799,"DTE":139.233,"Industry":"Information Technology Services","Sector":"Technology","Beta":0.674,"Trailing PEG":0.3775,"Trailing PE":13.148248,"Trailing PS":0.33329615,"Quick Ratio":1.204,"Day High":50.2,"Day Low":45.7,"VS Average Volume":2.9060759571,"Company Summary":"Concentrix Corporation engages in the provision of technology-infused customer experience (CX) solutions worldwide. The company provides CX process optimization, technology innovation, front- and back-office automation, analytics, and business transformation services, across various channels of communication, such as voice, chat, email, social media, asynchronous messaging, and custom applications. It also offers customer lifecycle management; customer experience\/user experience strategy and design; analytics and actionable insights; digital transformation services that design and engineer CX solutions to enable efficient customer self-service and build customer loyalty; customer engagement solutions and services that address the entirety of the customer lifecycle; AI technology that can intelligently act on customer intent to improve customer experience with non-human engagement; voice of the customer and analytics solutions to gather and analyze customer feedback to foster loyalty to, and growth with, clients; analytics and consulting solutions that synthesize data and provide professional insight to improve clients' customer experience strategies; vertical business process outsourcing (BPO) services; and back office BPO services that support clients in non-customer facing areas. The company's clients include technology and consumer electronics, retail, travel and e-commerce, communications and media, banking, financial services and insurance, healthcare, and others, as well as global IPOs, social brands, and banks. Concentrix Corporation was founded in 2004 and is based in Newark, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"JP Morgan Chase & Co.","Symbol":"JPM","Current Price":"254.27","Latest MA":"219.47","Price Target":262.4343,"Difference from MA":"15.86%","Difference from Open":"0.11%","Change from Yesterday":"0.76%","Change from Last Report":"0.00","Latest Volume":"15,279,324","Market Cap":"711,345,766,400","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.221573,"PB Ratio":2.2081633,"ROE":0.16216,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.091,"Trailing PEG":4.9626,"Trailing PE":12.867915,"Trailing PS":4.3870153,"Quick Ratio":"N\/A","Day High":257.035,"Day Low":252.33,"VS Average Volume":1.6886268602,"Company Summary":"JPMorgan Chase & Co. operates as a financial services company worldwide. It operates through three segments: Consumer & Community Banking, Commercial & Investment Bank, and Asset & Wealth Management. It offers deposit, investment and lending products, cash management, and payments and services; mortgage origination and servicing activities; residential mortgages and home equity loans; and credit cards, auto loans, leases, and travel services to consumers and small businesses through bank branches, ATMs, and digital and telephone banking. The company also provides investment banking products and services, including corporate strategy and structure advisory, and equity and debt market capital-raising services, as well as loan origination and syndication; payments; and cash and derivative instruments, risk management solutions, prime brokerage, and research, as well as offers securities services, including custody, fund accounting and administration, and securities lending products for asset managers, insurance companies, and public and private investment funds. In addition, it provides financial solutions, including lending, payments, investment banking, and asset management to small and midsized companies, local governments, nonprofit clients, and large corporations, as well as investors, developers, and owners of multifamily, office, retail, industrial, and affordable housing properties. Further, the company offers multi-asset investment management solutions in equities, fixed income, alternatives, and money market funds to institutional clients and retail investors; and retirement products and services, brokerage, custody, estate planning, lending, deposits, and investment management products to high net worth clients. JPMorgan Chase & Co. was founded in 1799 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"Goldman Sachs Group, Inc. (The)","Symbol":"GS","Current Price":"612.99","Latest MA":"518.62","Price Target":634.65,"Difference from MA":"18.20%","Difference from Open":"0.49%","Change from Yesterday":"1.17%","Change from Last Report":"0.00","Latest Volume":"2,859,196","Market Cap":"192,423,690,240","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":12.0457,"PB Ratio":1.871091,"ROE":0.1017,"DTE":609.793,"Industry":"Capital Markets","Sector":"Financial Services","Beta":1.342,"Trailing PEG":3.8305,"Trailing PE":15.128084,"Trailing PS":3.8962417,"Quick Ratio":1.458,"Day High":616.84,"Day Low":606.09,"VS Average Volume":1.3479773005,"Company Summary":"The Goldman Sachs Group, Inc., a financial institution, provides a range of financial services for corporations, financial institutions, governments, and individuals worldwide. It operates through Global Banking & Markets, Asset & Wealth Management, and Platform Solutions segments. The Global Banking & Markets segment provides financial advisory services, including strategic advisory assignments related to mergers and acquisitions, divestitures, corporate defense activities, restructurings, and spin-offs; and relationship lending, and acquisition financing, as well as secured lending, through structured credit and asset-backed lending and involved in financing under securities to resale agreements. This segment also offers client execution activities for cash and derivative instruments; credit and interest rate products; and provision of mortgages, currencies, commodities, and equities related products, as well as underwriting services. The Asset & Wealth Management segment manages assets across various classes, including equity, fixed income, hedge funds, credit funds, private equity, real estate, currencies, and commodities; and provides customized investment advisory solutions, wealth advisory services, personalized financial planning, and private banking services, as well as invests in corporate equity, credit, real estate, and infrastructure assets. The Platform Solutions segment offers credit cards and point-of-sale financing for purchase of goods or services. This segment also provides cash management services, such as deposit-taking and payment solutions for corporate and institutional clients. The Goldman Sachs Group, Inc. was founded in 1869 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"The Bank of New York Mellon Cor","Symbol":"BK","Current Price":"82.25","Latest MA":"70.62","Price Target":89.04438,"Difference from MA":"16.46%","Difference from Open":"0.65%","Change from Yesterday":"0.26%","Change from Last Report":"0.00","Latest Volume":"5,143,061","Market Cap":"59,029,180,416","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":10.667673,"PB Ratio":1.5884205,"ROE":0.08563,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.06,"Trailing PEG":0.7376,"Trailing PE":14.181034,"Trailing PS":3.3160596,"Quick Ratio":"N\/A","Day High":82.47,"Day Low":81.0405,"VS Average Volume":1.3680271144,"Company Summary":"The Bank of New York Mellon Corporation provides a range of financial products and services in the United States and internationally. The company operates through Securities Services, Market and Wealth Services, Investment and Wealth Management, and other segments. The Securities Services segment offers custody, trust and depositary, accounting, exchange-traded funds, middle-office solutions, transfer agency, services for private equity and real estate funds, foreign exchange, securities lending, liquidity\/lending services, and data analytics. This segment also provides trustee, paying agency, fiduciary, escrow and other financial, issuer, and support services for brokers and investors. The Market and Wealth Services segment offers clearing and custody, investment, wealth and retirement solutions, technology and enterprise data management, trading, and prime brokerage services. This segment also provides integrated cash management solutions, including payments, foreign exchange, liquidity management, receivables processing and payables management, and trade finance and processing services. The Investment and Wealth Management segment offers investment management strategies and distribution of investment products, investment management, custody, wealth and estate planning, private banking, investment, and information management services. The Other segment engages in the provision of leasing, corporate treasury, derivative and other trading, corporate and bank-owned life insurance, renewable energy investment, and business exit services. It serves central banks and sovereigns, financial institutions, asset managers, insurance companies, corporations, local authorities and high net-worth individuals, and family offices. The Bank of New York Mellon Corporation was founded in 1784 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"Devon Energy Corporation","Symbol":"DVN","Current Price":"38.42","Latest MA":"40.51","Price Target":49.508,"Difference from MA":"-5.16%","Difference from Open":"1.03%","Change from Yesterday":"-0.03%","Change from Last Report":"0.00","Latest Volume":"7,006,848","Market Cap":"25,238,095,872","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":8.14924,"PB Ratio":1.77067,"ROE":0.26279,"DTE":64.021,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":2.071,"Trailing PEG":14.898,"Trailing PE":7.1148143,"Trailing PS":1.7370842,"Quick Ratio":0.834,"Day High":38.6378,"Day Low":37.924,"VS Average Volume":0.7040847549,"Company Summary":"Devon Energy Corporation, an independent energy company, engages in the exploration, development, and production of oil, natural gas, and natural gas liquids in the United States. It operates in Delaware, Eagle Ford, Anadarko, Williston, and Powder River Basins. The company was founded in 1971 and is headquartered in Oklahoma City, Oklahoma.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"KB Home","Symbol":"KBH","Current Price":"68.25","Latest MA":"77.19","Price Target":77.70833,"Difference from MA":"-11.58%","Difference from Open":"0.37%","Change from Yesterday":"-0.39%","Change from Last Report":"0.00","Latest Volume":"1,459,901","Market Cap":"4,927,649,792","Earning Date":"2025-01-13","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":7.6008315,"PB Ratio":1.2553109,"ROE":0.15727,"DTE":42.959,"Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":1.815,"Trailing PEG":null,"Trailing PE":8.076923,"Trailing PS":0.7461416,"Quick Ratio":0.788,"Day High":68.38,"Day Low":66.1382,"VS Average Volume":1.2416003443,"Company Summary":"KB Home operates as a homebuilding company in the United States. It operates through four segments: West Coast, Southwest, Central, and Southeast. It builds and sells various homes, including attached and detached single-family residential homes, townhomes, and condominiums primarily for first-time, first move-up, second move-up, and active adult homebuyers. The company also provides financial services, such as insurance products and title services, as well as mortgage banking services, including residential consumer mortgage loans to homebuyers. It has operations in Arizona, California, Colorado, Florida, Idaho, Nevada, North Carolina, Texas, and Washington. The company was formerly known as Kaufman and Broad Home Corporation and changed its name to KB Home in January 2001. KB Home was founded in 1957 and is based in Los Angeles, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"Constellation Brands, Inc.","Symbol":"STZ","Current Price":"184.57","Latest MA":"240.36","Price Target":248.12917,"Difference from MA":"-23.21%","Difference from Open":"2.36%","Change from Yesterday":"2.13%","Change from Last Report":"0.00","Latest Volume":"2,989,589","Market Cap":"33,362,137,088","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":12.634546,"PB Ratio":3.464607,"ROE":0.07111,"DTE":149.155,"Industry":"Beverages - Brewers","Sector":"Consumer Defensive","Beta":0.893,"Trailing PEG":0.9732,"Trailing PE":49.21867,"Trailing PS":3.2737505,"Quick Ratio":0.321,"Day High":186.465,"Day Low":180.01,"VS Average Volume":1.7381270763,"Company Summary":"Constellation Brands, Inc., together with its subsidiaries, produces, imports, markets, and sells beer, wine, and spirits in the United States, Canada, Mexico, New Zealand, and Italy. The company provides beer primarily under the Corona Extra, Corona Familiar, Corona Hard Seltzer, Corona Light, Corona Non-Alcoholic, Corona Premier, Corona Refresca, Modelo Especial, Modelo Chelada, Modelo Negra, Modelo Oro, Victoria, Vicky Chamoy, and Pacifico brands. It also offers wine under the Cook's California Champagne, Kim Crawford, Meiomi, Mount Veeder, Ruffino, SIMI, My Favorite Neighbor, Robert Mondavi Winery, Schrader, and The Prisoner Wine Company brands; and spirits under the Casa Noble, Copper & Kings, High West, Mi CAMPO, Nelson's Green Brier, and SVEDKA brands. The company provides its products to wholesale distributors, retailers, on-premise locations, and state alcohol beverage control agencies. Constellation Brands, Inc. was founded in 1945 and is headquartered in Victor, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"Delta Air Lines, Inc.","Symbol":"DAL","Current Price":"66.18","Latest MA":"51.82","Price Target":79.79182,"Difference from MA":"27.72%","Difference from Open":"1.13%","Change from Yesterday":"1.04%","Change from Last Report":"0.00","Latest Volume":"6,378,647","Market Cap":"42,704,699,392","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":7.83135,"PB Ratio":3.109232,"ROE":0.4067,"DTE":186.78,"Industry":"Airlines","Sector":"Industrials","Beta":1.341,"Trailing PEG":null,"Trailing PE":12.416511,"Trailing PS":0.7081218,"Quick Ratio":0.268,"Day High":66.43,"Day Low":64.84,"VS Average Volume":0.7981414874,"Company Summary":"Delta Air Lines, Inc. provides scheduled air transportation for passengers and cargo in the United States and internationally. The company operates through two segments, Airline and Refinery. Its domestic network centered on core hubs in Atlanta, Minneapolis-St. Paul, Detroit, and Salt Lake City, as well as coastal hub positions in Boston, Los Angeles, New York-LaGuardia, New York-JFK, and Seattle; and international network centered on hubs and market presence in Amsterdam, Bogota, Lima, Mexico City, London-Heathrow, Paris-Charles de Gaulle, Sao Paulo, Seoul-Incheon, and Tokyo. The company sells its tickets through various distribution channels, including delta.com and the Fly Delta app; acts as a reservations specialists; and operates online travel and traditional brick and mortar agencies. It also provides aircraft maintenance and engineering support, repair, and overhaul services; and vacation packages to third-party consumers. The company operates through a fleet of approximately 1,273 aircrafts. Delta Air Lines, Inc. was founded in 1924 and is based in Atlanta, Georgia.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"Walgreens Boots Alliance, Inc.","Symbol":"WBA","Current Price":"12.93","Latest MA":"9.97","Price Target":12.414,"Difference from MA":"29.73%","Difference from Open":"4.27%","Change from Yesterday":"3.19%","Change from Last Report":"0.00","Latest Volume":"18,353,948","Market Cap":"11,173,498,880","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.06346,"PB Ratio":1.0695674,"ROE":-0.75969005,"DTE":277.898,"Industry":"Pharmaceutical Retailers","Sector":"Healthcare","Beta":0.669,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.07567148,"Quick Ratio":0.332,"Day High":12.97,"Day Low":12.315,"VS Average Volume":0.7760332976,"Company Summary":"Walgreens Boots Alliance, Inc. operates as a healthcare, pharmacy, and retail company in the United States, Germany, the United Kingdom, and internationally. It operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The U.S. Retail Pharmacy segment engages in operation of the retail drugstores, health and wellness services, specialty, and home delivery pharmacy services, which offers health and wellness, beauty, personal care and consumables, and general merchandise. The International segment offers sale of prescription drugs and health and wellness, beauty, personal care, and other consumer products outside the United States; and operates pharmacy-led health and beauty retail businesses under the Boots brand stores in the United Kingdom, the Republic of Ireland, and Thailand, as well as the Benavides brand in Mexico and the Ahumada brand in Chile. The U.S. Healthcare segment provides VillageMD, a national provider of value-based care with primary, multi-specialty, and urgent care providers serving patients in traditional clinic settings, in patients' homes and online appointments; Shields, a specialty pharmacy integrator and accelerator for hospitals; and CareCentrix, a participant in the post-acute and home care management sectors. Walgreens Boots Alliance, Inc. was founded in 1909 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"Jefferies Financial Group Inc.","Symbol":"JEF","Current Price":"74.46","Latest MA":"63.37","Price Target":87.5,"Difference from MA":"17.50%","Difference from Open":"-0.40%","Change from Yesterday":"0.19%","Change from Last Report":"0.00","Latest Volume":"1,235,140","Market Cap":"15,301,827,584","Earning Date":"2025-01-08","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":13.116221,"PB Ratio":1.5231354,"ROE":0.056739997,"DTE":295.803,"Industry":"Capital Markets","Sector":"Financial Services","Beta":1.292,"Trailing PEG":null,"Trailing PE":25.155405,"Trailing PS":2.448055,"Quick Ratio":1.511,"Day High":76.05,"Day Low":74.41,"VS Average Volume":0.7710078958,"Company Summary":"Jefferies Financial Group Inc. operates as an investment banking and capital markets firm in the Americas, Europe, the Middle East, and the Asia-Pacific. The company operates in two segments, Investment Banking and Capital Markets, and Asset Management. It provides investment banking, advisory services with respect to mergers or acquisitions, debt financing, restructurings or recapitalizations, and private capital advisory transactions; underwriting and placement services related to corporate debt, municipal bonds, mortgage-backed and asset-backed securities, equity and equity-linked securities, and loan syndication services; and corporate lending services. The company also offers financing, securities lending, and other prime brokerage services; equities research, sales, and trading services; wealth management services; and online foreign exchange trading services. In addition, it provides investment grade distressed debt securities, U.S. and European government and agency securities, municipal bonds, leveraged loans, emerging markets debt, and interest rate and credit index derivative products; and manages and offers services to a diverse group of alternative asset management platforms across a spectrum of investment strategies and asset classes. The company was formerly known as Leucadia National Corporation and changed its name to Jefferies Financial Group Inc. in May 2018. Jefferies Financial Group Inc. was founded in 1962 and is headquartered in New York, New York.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"The Simply Good Foods Company","Symbol":"SMPL","Current Price":"33.31","Latest MA":"35.39","Price Target":40.9,"Difference from MA":"-5.87%","Difference from Open":"0.82%","Change from Yesterday":"1.00%","Change from Last Report":"0.00","Latest Volume":"1,062,625","Market Cap":"3,365,376,000","Earning Date":"2025-01-08","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":15.449047,"PB Ratio":1.9311265,"ROE":0.08447,"DTE":25.315,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.644,"Trailing PEG":null,"Trailing PE":23.624115,"Trailing PS":2.5278473,"Quick Ratio":2.608,"Day High":33.3475,"Day Low":32.61,"VS Average Volume":1.0844207731,"Company Summary":"The Simply Good Foods Company, a consumer-packaged food and beverage company, engages in the development, marketing, and sale of snacks and meal replacements, and other products in North America and internationally. The company offers protein bars, ready-to-drink shakes, sweet and salty snacks, cookies, muffins, protein chips and crackers, protein powders, and recipes under the Quest, Atkins, and OWYN brand names. It also provides confectionery products, such as full-size and mini peanut butter cups, brownies, caramel candy bites, chocolatey coated peanut candies, and caramel candy bars. In addition, the company licenses certain products that contain its brands and logos; and distributes its products to various retail channels, such as mass merchandise, grocery and drug stores, club and convenience stores, gas stations, and other channels. It also sells its products through e-commerce channels, including questnutrition.com, atkins.com, liveowyn.com, amazon.com and others. The company was incorporated in 2017 and is headquartered in Denver, Colorado.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"Bruker Corporation","Symbol":"BRKR","Current Price":"59.01","Latest MA":"61.96","Price Target":73.80077,"Difference from MA":"-4.76%","Difference from Open":"3.36%","Change from Yesterday":"2.57%","Change from Last Report":"0.00","Latest Volume":"2,036,378","Market Cap":"8,945,798,144","Earning Date":"2025-01-06","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":21.450615,"PB Ratio":4.9505033,"ROE":0.19725999,"DTE":132.635,"Industry":"Medical Devices","Sector":"Healthcare","Beta":1.204,"Trailing PEG":null,"Trailing PE":28.507246,"Trailing PS":2.7599413,"Quick Ratio":0.658,"Day High":59.695,"Day Low":54.61,"VS Average Volume":1.391791866,"Company Summary":"Bruker Corporation, together with its subsidiaries, develops, manufactures, and distributes scientific instruments, and analytical and diagnostic solutions in the United States, Europe, the Asia Pacific, and internationally. The company operates through four segments: Bruker Scientific Instruments (BSI) BioSpin, BSI CALID, BSI Nano, and Bruker Energy & Supercon Technologies. It offers life science tools, and single and multiple modality systems; life science mass spectrometry; MALDI Biotyper rapid pathogen identification platform and related test kits, DNA test strips, and fluorescence-based polymerase chain reaction technology; genotype and fluorotype molecular diagnostics kits; research, analytical, and process analysis instruments and solutions; SARS-CoV 2 testing for the diagnosis of COVID-19 infection; and Fluorotyper-SARS-CoV 2 plus kits. It also provides range of portable analytical and bioanalytical detection systems, and related products; X-ray instruments; analytical tools for electron microscopes, as well as handheld, portable, and mobile X-ray fluorescence spectrometry instruments; atomic force microscopy instrumentation; non-contact nanometer resolution solution topography; and automated X-ray metrology, automated AFM defect-detection, and photomask repair and cleaning equipment. In addition, the company offers advanced optical fluorescence microscopy instruments; products and services to support the multi-omics needs of researchers in translational research, drug, and biomarker discovery; superconducting materials, such as metallic low temperature superconductors; devices and complex tools based on metallic low temperature superconductors; and non-superconducting high technology tools, such as synchrotron and beamline instrumentation. The company was incorporated in 1991 and is headquartered in Billerica, Massachusetts.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"Lamb Weston Holdings, Inc.","Symbol":"LW","Current Price":"59.07","Latest MA":"70.59","Price Target":68.86143,"Difference from MA":"-16.33%","Difference from Open":"0.02%","Change from Yesterday":"0.08%","Change from Last Report":"0.00","Latest Volume":"2,530,584","Market Cap":"8,425,803,264","Earning Date":"2025-01-02","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":15.610424,"PB Ratio":4.7468657,"ROE":0.37015,"DTE":221.158,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.715,"Trailing PEG":3.6389,"Trailing PE":23.255905,"Trailing PS":1.3050312,"Quick Ratio":0.486,"Day High":59.91,"Day Low":58.3,"VS Average Volume":0.9900427811,"Company Summary":"Lamb Weston Holdings, Inc. engages in the production, distribution, and marketing of frozen potato products in the United States, Canada, Mexico, and internationally. It offers frozen potatoes, commercial ingredients, and appetizers under the Lamb Weston brand, as well as under various customer labels. The company also provides its products under its owned or licensed brands, such as Grown in Idaho and Alexia, and other licensed brands, as well as under retailers' own brands. It sells its products through a network of internal sales personnel and independent brokers, agents, and distributors to quick service and full-service restaurants and chains, wholesale, grocery, mass merchants, club retailers, and specialty retailers, as well as foodservice distributors and institutions, including businesses, educational institutions, independent restaurants, regional chain restaurants, and convenience stores. The company was incorporated in 1950 and is headquartered in Eagle, Idaho.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"17-01-2025 12:13:20"},{"Company Name":"ConAgra Brands, Inc.","Symbol":"CAG","Current Price":"25.79","Latest MA":"28.95","Price Target":29.47944,"Difference from MA":"-10.90%","Difference from Open":"1.46%","Change from Yesterday":"1.10%","Change from Last Report":"0.00","Latest Volume":"4,998,778","Market Cap":"12,310,083,584","Earning Date":"2025-01-02","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.007684,"PB Ratio":1.4611071,"ROE":0.05605,"DTE":100.881,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.332,"Trailing PEG":5.2694,"Trailing PE":25.038837,"Trailing PS":1.0308399,"Quick Ratio":0.291,"Day High":25.82,"Day Low":25.35,"VS Average Volume":1.0119055499,"Company Summary":"Conagra Brands, Inc., together with its subsidiaries, operates as a consumer packaged goods food company primarily in the United States. The company operates through four segments: Grocery & Snacks, Refrigerated & Frozen, International, and Foodservice. The Grocery & Snacks segment primarily offers shelf stable food products through various retail channels. The Refrigerated & Frozen segment provides temperature-controlled food products through various retail channels. The International segment offers food products in various temperature states through retail and foodservice channels outside of the United States. The Foodservice segment offers branded and customized food products, including meals, entrees, sauces, and various custom-manufactured culinary products packaged for restaurants and other foodservice establishments. The company sells its products under the Birds Eye, Marie Callender's, Duncan Hines, Healthy Choice, Slim Jim, Reddi-wip, Angie's, BOOMCHICKAPOP brands. The company was incorporated in 1919 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"17-01-2025 12:13:20"}]