[{"Company Name":"Walmart Inc.","Symbol":"WMT","Current Price":"94.44","Latest MA":"92.95","Latest MA 5":96.4970001831,"Latest MA 9":97.7272220527,"Latest MA 20":97.4697498474,"RSI":24.4541173489,"Price Target":108.95053,"Difference from MA":"1.61%","Difference from Open":"-0.47%","Change from Yesterday":"-1.42%","Change from Last Report":"0.04","Latest Volume":"10,839,476","Market Cap":"753,710,792,704","Earning Date":"21-08-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":34.722427,"PB Ratio":9.00162,"Previous Close":95.8,"ROE":0.21783,"DTE":75.78,"Industry":"Discount Stores","Sector":"Consumer Defensive","Beta":0.693,"Trailing PEG":3.6565,"Trailing PE":40.36111,"Trailing PS":40.36111,"Quick Ratio":0.185,"Day High":95.26,"Day Low":93.44,"VS Average Volume":0.5092864463,"Company Summary":"Walmart Inc. engages in the operation of retail and wholesale stores and clubs, eCommerce websites, and mobile applications worldwide. The company operates through three segments: Walmart U.S., Walmart International, and Sam's Club. It operates supercenters, supermarkets, warehouse clubs, cash and carry stores, and discount stores under Walmart and Walmart Neighborhood Market brands; membership-only warehouse clubs; and ecommerce websites, such as walmart.com.mx, walmart.ca, flipkart.com, PhonePe and other sites. The company also offers grocery items, including dry grocery, snacks, dairy, meat, produce, deli and bakery, frozen foods, alcoholic and nonalcoholic beverages, as well as consumables, such as health and beauty aids, pet supplies, household chemicals, paper goods, and baby products; and fuel and other categories. In addition, it is involved in the provision of health and wellness products covering pharmacy, optical and hearing services, over-the-counter drugs, and protein and nutrition products; and home, hardlines, and seasonal items, including home improvement, outdoor living, gardening, furniture, apparel, jewelry, tools and power equipment, housewares, toys, and mattresses. Further, the company offers consumer electronics and accessories, software, video games, office supplies, appliances, and third-party gift cards. Additionally, it operates digital payment platforms; offers financial services and related products, including money transfers, bill payments, money orders, check cashing, prepaid access, co-branded credit cards, installment lending, and earned wage access; and markets lines of merchandise under private and licensed brands. The company was formerly known as Wal-Mart Stores, Inc. and changed its name to Walmart Inc. in February 2018. Walmart Inc. was founded in 1945 and is based in Bentonville, Arkansas.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:38:11"},{"Company Name":"Visa Inc.","Symbol":"V","Current Price":"371.44","Latest MA":"334.31","Latest MA 5":370.4660029297,"Latest MA 9":368.6977773709,"Latest MA 20":364.8434981079,"RSI":64.6797507965,"Price Target":382.43976,"Difference from MA":"11.11%","Difference from Open":"-0.21%","Change from Yesterday":"-0.50%","Change from Last Report":"0.02","Latest Volume":"1,780,599","Market Cap":"711,556,464,640","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":29.339653,"PB Ratio":18.758648,"Previous Close":373.31,"ROE":0.50655,"DTE":54.594,"Industry":"Credit Services","Sector":"Financial Services","Beta":0.943,"Trailing PEG":2.145,"Trailing PE":37.255768,"Trailing PS":37.255768,"Quick Ratio":0.682,"Day High":374.17,"Day Low":370.86,"VS Average Volume":0.2750969738,"Company Summary":"Visa Inc. operates as a payment technology company in the United States and internationally. The company operates VisaNet, a transaction processing network that enables authorization, clearing, and settlement of payment transactions. It also offers credit, debit, and prepaid card products; tap to pay, tokenization, and click to pay services; Visa Direct, a solution that facilitates the delivery of funds to eligible cards, bank accounts, and digital wallets; Visa B2B Connect, a multilateral business-to-business cross-border payments network; Visa Cross-Border Solution, a cross-border consumer payments solution; and Visa DPS that provides a range of value-added services, including fraud mitigation, dispute management, data analytics, campaign management, a suite of digital solutions, and contact center services. The company also provides acceptance solutions, which include Cybersource and Authorize.net that provides new and enhanced payment integrations with ecommerce platforms, enabling sellers and acquirers to offer tailored commerce experiences; risk and identity solutions, such as Visa Advanced Authorization, Visa Secure, Visa Consumer Authentication Service, Visa Protect Authentication Intelligence, and Visa Provisioning Intelligence; and Visa Consulting and Analytics, a payment consulting advisory services. It provides its services under the Visa, Visa Electron, Interlink, V PAY, and PLUS brands. The company serves merchants, financial institutions, and government entities. Visa Inc. was founded in 1958 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:38:11"},{"Company Name":"Bank of America Corporation","Symbol":"BAC","Current Price":"44.56","Latest MA":"43.28","Latest MA 5":44.8440199695,"Latest MA 9":44.5167108554,"Latest MA 20":44.1374698361,"RSI":57.7246709736,"Price Target":49.54167,"Difference from MA":"2.96%","Difference from Open":"0.36%","Change from Yesterday":"-0.38%","Change from Last Report":"0.00","Latest Volume":"14,517,649","Market Cap":"335,621,324,800","Earning Date":"16-07-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":12.1748905,"PB Ratio":1.2246495,"Previous Close":44.73,"ROE":0.094560005,"DTE":null,"Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.307,"Trailing PEG":1.6831,"Trailing PE":13.301523,"Trailing PS":13.301523,"Quick Ratio":null,"Day High":44.62,"Day Low":44.02,"VS Average Volume":0.3117648998,"Company Summary":"Bank of America Corporation, through its subsidiaries, provides various financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. The company operates through four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, checking accounts, and investment accounts and products; credit and debit cards; residential mortgages and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:38:11"},{"Company Name":"Philip Morris International Inc","Symbol":"PM","Current Price":"182.57","Latest MA":"146.29","Latest MA 5":181.4659989014,"Latest MA 9":181.6744444444,"Latest MA 20":178.3239986572,"RSI":62.8316800581,"Price Target":177.15312,"Difference from MA":"24.80%","Difference from Open":"-0.68%","Change from Yesterday":"-0.44%","Change from Last Report":"0.05","Latest Volume":"2,756,053","Market Cap":"284,173,860,864","Earning Date":"22-07-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":25.356947,"PB Ratio":-26.066534,"Previous Close":183.37,"ROE":null,"DTE":null,"Industry":"Tobacco","Sector":"Consumer Defensive","Beta":0.544,"Trailing PEG":1.347,"Trailing PE":28.79653,"Trailing PS":28.79653,"Quick Ratio":0.364,"Day High":184.06,"Day Low":181.63,"VS Average Volume":0.4507759216,"Company Summary":"Philip Morris International Inc. operates as a tobacco company. The company offers cigarettes and smoke-free products, including heat-not-burn, vapor, and oral nicotine products under the IQOS and ZYN brands; and consumer accessories, such as lighters and matches. It also offers wellness and healthcare products. Philip Morris International Inc. was incorporated in 1987 and is headquartered in Stamford, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:38:11"},{"Company Name":"Cisco Systems, Inc.","Symbol":"CSCO","Current Price":"65.16","Latest MA":"59.98","Latest MA 5":65.2910006104,"Latest MA 9":64.8527782525,"Latest MA 20":64.0872501984,"RSI":60.5241177154,"Price Target":69.32818,"Difference from MA":"8.63%","Difference from Open":"1.31%","Change from Yesterday":"1.50%","Change from Last Report":"0.15","Latest Volume":"7,420,418","Market Cap":"258,013,790,208","Earning Date":"14-05-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":16.70641,"PB Ratio":5.61681,"Previous Close":64.19,"ROE":0.21356001,"DTE":66.932,"Industry":"Communication Equipment","Sector":"Technology","Beta":0.882,"Trailing PEG":2.1386,"Trailing PE":26.593876,"Trailing PS":26.593876,"Quick Ratio":0.714,"Day High":65.17,"Day Low":64.11,"VS Average Volume":0.3269853569,"Company Summary":"Cisco Systems, Inc. designs, manufactures, and sells Internet Protocol based networking and other products related to the communications and information technology industry in the Americas, Europe, the Middle East, Africa, the Asia Pacific, Japan, and China. The company also offers switching portfolio encompasses campus switching as well as data center switching; enterprise routing portfolio interconnects public and private wireline and mobile networks, delivering highly secure, and reliable connectivity to campus, data center and branch networks; and wireless products include indoor and outdoor wireless coverage designed for seamless roaming use of voice, video, and data applications. In addition, it provides security, which comprising network security, identity and access management, secure access service edge, and threat intelligence, detection, and response offerings; collaboration products, such as Webex Suite, collaboration devices, contact center, and communication platform as a service; end-to-end collaboration solutions that can be delivered from the cloud, on-premise or within hybrid cloud environments allowing customers to transition their collaboration solutions from on-premise to the cloud; and observability offers network assurance, monitoring and analytics and observability suite. Further, the company offers a range of service and support options for its customers, including technical support and advanced services and advisory services. It serves businesses of various sizes, public institutions, governments, and service providers. The company sells its products and services directly, as well as through systems integrators, service providers, other resellers, and distributors. Cisco Systems, Inc. has strategic alliances with other companies. Cisco Systems, Inc. was incorporated in 1984 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:38:11"},{"Company Name":"Linde plc","Symbol":"LIN","Current Price":"470.65","Latest MA":"447.97","Latest MA 5":471.9255021973,"Latest MA 9":470.7856183539,"Latest MA 20":464.4324680786,"RSI":56.519263686,"Price Target":491.68582,"Difference from MA":"5.06%","Difference from Open":"0.55%","Change from Yesterday":"0.45%","Change from Last Report":"0.02","Latest Volume":"702,582","Market Cap":"221,545,070,592","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":27.766813,"PB Ratio":5.83228,"Previous Close":468.54,"ROE":0.17013,"DTE":60.555,"Industry":"Specialty Chemicals","Sector":"Basic Materials","Beta":0.979,"Trailing PEG":2.5941,"Trailing PE":34.154392,"Trailing PS":34.154392,"Quick Ratio":0.727,"Day High":472.06,"Day Low":466.77,"VS Average Volume":0.3199665907,"Company Summary":"Linde plc operates as an industrial gas company in the United States, China, Germany, the United Kingdom, Australia, Mexico, Brazil, and internationally. It offers atmospheric gases, including oxygen, nitrogen, argon, and rare gases; and process gases, such as hydrogen, helium, carbon dioxide, carbon monoxide, electronic gases, specialty gases, acetylene, etc. The company also designs and constructs turnkey process plants for third-party customers, as well as for the gas businesses in various locations consist of air separation, hydrogen, synthesis, olefin, and natural gas plants. It serves a range of industries comprising healthcare, chemicals and energy, manufacturing, metals and mining, food and beverage, and electronics. Linde plc was founded in 1879 and is based in Woking, the United Kingdom.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:38:11"},{"Company Name":"Merck & Company, Inc.","Symbol":"MRK","Current Price":"81.77","Latest MA":"89.77","Latest MA 5":80.3470002441,"Latest MA 9":79.0016666667,"Latest MA 20":77.8237499542,"RSI":69.5534414363,"Price Target":101.78708,"Difference from MA":"-8.92%","Difference from Open":"1.96%","Change from Yesterday":"1.80%","Change from Last Report":"-0.01","Latest Volume":"5,309,283","Market Cap":"205,314,375,680","Earning Date":"29-07-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":8.698404,"PB Ratio":4.256377,"Previous Close":80.32,"ROE":0.39293,"DTE":71.992,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.441,"Trailing PEG":0.7364,"Trailing PE":11.884447,"Trailing PS":11.884447,"Quick Ratio":0.827,"Day High":81.94,"Day Low":80.07,"VS Average Volume":0.3278987633,"Company Summary":"Merck & Co., Inc. operates as a healthcare company worldwide. It operates through two segments, Pharmaceutical and Animal Health. The company offers human health pharmaceutical for various areas, including oncology, vaccines, hospital acute care, cardiovascular, virology, neuroscience, and diabetes under the Keytruda, Welireg, Gardasil, ProQuad, M-M-R II, Varivax, Vaxneuvance, RotaTeq, Pneumovax 23, Bridion, Dificid, Zerbaxa, Noxafil, Winrevair, Adempas, Verquvo, Lagevrio, Isentress\/Isentress HD, Delstrigo, Pifeltro, Belsomra, Januvia, and Janumet brands. It also provides veterinary pharmaceuticals, vaccines and health management solutions and services, such as livestock products under the Nuflor, Bovilis\/Vista, Bovilis Cryptium, Banamine, Estrumate, Matrix, Resflor, Zuprevo, Revalor, Safe-Guard, M+Pac, Porcilis, Circumvent, Nobilis\/Innovax, Paracox and Coccivac, Exzolt, Slice, Imvixa, Clynav, Aquavac\/Norvax, Aquaflor, Flexolt brands; Allflex Livestock Intelligence solutions for animal identification, monitoring and traceability; and companion animal products under the Bravecto One-Month, Bravecto Injectable\/Quantum, Bravecto Plus, Sentinel Spectrum, Sentinel Flavor Tabs, Optimmune, Nobivac NXT, GilvetMab, Otomax, Mometamax, Mometamax Ultra, Posatex, Caninsulin\/Vetsulin, Panacur, Regumate, Prestige, Scalibor\/Exspot, Sure Petcare, and Home Again brands. The company has development and commercialization agreement for three of Daiichi Sankyo's deruxtecan ADC candidates; AstraZeneca PLC to co-development and co-commercialize AstraZeneca's Lynparza products for multiple cancer types, and Koselugo for multiple indications; licensed to develop, manufacture and commercialize LM-299, a novel investigational PD-1\/VEGF bispecific antibody from LaNova; and collaboration agreement with Eisai Co., Ltd., Bayer AG, and Ridgeback Biotherapeutics LP, as well Moderna, Inc. It has a collaboration agreement with Antengene Corporation Limited to evaluate the combination of ATG-022, a CLDN18.2-targeting antibody-drug conjugate, and anti-PD-1 therapy, as well as KEYTRUDA (pembrolizumab) in patients with advanced solid tumors. Merck & Co., Inc. was founded in 1891 and is headquartered in Rahway, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:38:11"},{"Company Name":"Palo Alto Networks, Inc.","Symbol":"PANW","Current Price":"198.72","Latest MA":"186.50","Latest MA 5":196.9980008545,"Latest MA 9":196.4611119927,"Latest MA 20":192.5230002747,"RSI":62.7969940349,"Price Target":211.57632,"Difference from MA":"6.55%","Difference from Open":"2.24%","Change from Yesterday":"2.23%","Change from Last Report":"-0.16","Latest Volume":"2,485,030","Market Cap":"132,506,492,928","Earning Date":"20-05-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":27.6,"PB Ratio":18.301714,"Previous Close":194.39,"ROE":0.21162,"DTE":11.147,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.973,"Trailing PEG":2.4143,"Trailing PE":113.55428,"Trailing PS":113.55428,"Quick Ratio":0.777,"Day High":199.3985,"Day Low":194.31,"VS Average Volume":0.4634331421,"Company Summary":"Palo Alto Networks, Inc. provides cybersecurity solutions worldwide. The company's network security platforms include Prisma Access, a security services edge (SSE) solution, as well as Strata Cloud Manager, a network security management solution. It also provides cloud security solutions, including Prisma Cloud, a cloud native application protection platform; and Code to Cloud platform, as well as offers VM-Series and CN-Series virtual firewalls for inline network security on multi- and hybrid-cloud environments. In addition, the company provides security operation solutions through Cortex platform that includes Cortex XSIAM, an AI-driven security operations platform; Cortex XDR for the prevention, detection, and response to complex cybersecurity attacks; and Cortex XSOAR for security orchestration, automation, and response; and Cortex Xpanse for attack surface management, as well as offers threat intelligence and advisory services under the Unit 42 name. Further, it provides subscription services covering the areas of threat prevention, malware and persistent threat, URL filtering, laptop and mobile device protection, DNS security, Internet of Things security, SaaS security API, and SaaS security inline, as well as threat intelligence, and data loss prevention. Additionally, the company offers professional services, including architecture design and planning, implementation, configuration, and firewall migration; education services, such as certifications, as well as online and in-classroom training; and support services. It sells its products and services through its channel partners, as well as directly to medium to large enterprises, service providers, and government entities operating in various industries, including education, energy, financial services, government entities, healthcare, Internet and media, manufacturing, public sector, and telecommunications. The company was incorporated in 2005 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:38:11"},{"Company Name":"Chubb Limited","Symbol":"CB","Current Price":"287.54","Latest MA":"281.54","Latest MA 5":288.6039960937,"Latest MA 9":291.4066627333,"Latest MA 20":291.4634974976,"RSI":42.1154447845,"Price Target":304.061,"Difference from MA":"2.13%","Difference from Open":"0.96%","Change from Yesterday":"0.68%","Change from Last Report":"0.10","Latest Volume":"480,890","Market Cap":"115,231,080,448","Earning Date":"22-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":12.178738,"PB Ratio":1.7532072,"Previous Close":285.61,"ROE":0.12855,"DTE":29.874,"Industry":"Insurance - Property & Casualty","Sector":"Financial Services","Beta":0.555,"Trailing PEG":2.4413,"Trailing PE":13.850675,"Trailing PS":13.850675,"Quick Ratio":0.177,"Day High":287.59,"Day Low":284.785,"VS Average Volume":0.2754168853,"Company Summary":"Chubb Limited provides insurance and reinsurance products worldwide. The company operates through six segments: North America Commercial P&C Insurance, North America Personal P&C Insurance, North America Agricultural Insurance, Overseas General Insurance, Global Reinsurance, and Life Insurance. The company provides package policies, property and general liability, workers' compensation, automobile, umbrella, financial lines, professional and management liability, environmental, international coverages, property and casualty, commercial marine, and risk management products and services. It also offers homeowners, automobile and collector cars, valuable articles, personal and excess liability, travel insurance, cyber, and recreational marine insurance and services. In addition, the company provides multiple peril crop insurance and crop-hail insurance for farm, ranch, and specialty property and casualty, and commercial agriculture products; and property insurance products, including traditional commercial fire coverage, as well as energy industry-related, construction, and other technical coverages; personal accident and supplemental medical coverages, such as accidental death, business\/holiday travel, specified disease, disability, medical and hospital indemnity, and income protection; and professional indemnity, cyber, surety, aviation, political risk, and specialty personal lines products. Further, the company offers property catastrophe reinsurance, traditional and specialty P&C reinsurance; and protection and savings products, which includes whole life, universal life, unit linked contracts, endowment plans, individual and group term life, dental, critical illness, dementia, hospital cash, personal accident, credit life, and group employee benefits. The company was formerly known as ACE Limited and changed its name to Chubb Limited in January 2016. Chubb Limited was incorporated in 1985 and is headquartered in Zurich, Switzerland.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"12-06-2025 20:38:11"},{"Company Name":"KKR & Co. Inc.","Symbol":"KKR","Current Price":"125.64","Latest MA":"133.73","Latest MA 5":124.4609996338,"Latest MA 9":122.8672228665,"Latest MA 20":122.2932501678,"RSI":69.0312165707,"Price Target":143.447,"Difference from MA":"-6.06%","Difference from Open":"0.97%","Change from Yesterday":"-0.29%","Change from Last Report":"0.10","Latest Volume":"1,178,567","Market Cap":"116,238,761,984","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":20.697693,"PB Ratio":4.4768915,"Previous Close":126.0,"ROE":0.07145,"DTE":74.627,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.884,"Trailing PEG":1.275,"Trailing PE":54.15302,"Trailing PS":54.15302,"Quick Ratio":0.819,"Day High":125.915,"Day Low":124.43,"VS Average Volume":0.2135439504,"Company Summary":"KKR & Co. Inc. is a private equity and real estate investment firm specializing in direct and fund of fund investments. It specializes in acquisitions, leveraged buyouts, management buyouts, credit special situations, growth equity, mature, mezzanine, distressed, turnaround, lower middle market, and middle market investments. The firm considers investments in all industries with a focus on software, fintech, data and information, security, semiconductors, consumer electronics, internet of things (iot), internet, information services, information technology infrastructure, financial technology, network and cyber security architecture, engineering and operations, content, technology and hardware, energy and infrastructure, real estate, services industry with a focus on business services, intelligence, industry-leading franchises and companies in natural resource, containers and packaging, agriculture, airports, ports, forestry, electric utilities, textiles, apparel and luxury goods, household durables, digital media, insurance, brokerage houses, non-durable goods distribution, supermarket retailing, grocery stores, food, beverage, and tobacco, hospitals, entertainment venues and production companies, publishing, printing services, capital goods, financial services, specialized finance, pipelines, and renewable energy. In energy and infrastructure, it focuses on the upstream oil and gas and equipment, minerals and royalties and services verticals. In real estate, the firm seeks to invest in private and public real estate securities including property-level equity, debt and special situations transactions and businesses with significant real estate holdings, and oil and natural gas properties. The firm also invests in asset services sector that encompasses a broad array of B2B, B2C and B2G services verticals including asset-based, transport, logistics, leisure\/hospitality, resource and utility support, infra-like, mission-critical, and environmental services. Within Americas, the firm prefers to invest in consumer products; chemicals, metals and mining; energy and natural resources; financial services; healthcare; biopharmaceutical; medical device; health care services; life science tools\/diagnostics; health care information technology sub-sectors; industrials; media and communications; retail; and technology. Within Europe, the firm invests in consumer and retail; energy; financial services; health care; industrials and chemicals; media and digital; and telecom and technologies. Within Asia, it invests in consumer products; energy and resources; financial services; healthcare; industrials; logistics; media and telecom; retail; real estate; and technology. It also seeks to make impact investments focused on identifying and investing behind businesses with positive social or environmental impact. The firm seeks to invest in mid to high-end residential developments but can invest in other projects throughout Mainland China through outright ownership, joint ventures, and merger. It invests globally with a focus on Australia, emerging and developed Asia, Middle East and Africa, Nordic, Southeast Asia, Asia Pacific, Ireland, Hong Kong, Japan, Taiwan, India, Vietnam, Malaysia, Singapore, Indonesia, France, Germany, Netherlands, United Kingdom, Caribbean, Mexico, South America, North America, Israel, Brazil, Latin America, Korea with a focus on South Korea, and United States of America. In the United States and Europe, the firm focuses on buyouts of large, publicly traded companies. For middle market private equity it seeks to invest in companies with enterprise values between $200 million and $1 billion ($1000 million). The firm prefers to invest in a range of debt and public equity investing and may co-invest. It seeks a board seat in its portfolio companies and a controlling ownership of a company or a strategic minority position. The firm may acquire majority and minority equity interests, particularly when making private equity investments in Asia or sponsoring investments as part of a large investor consortium. The firm typically holds its investment for a period of five to seven years and more and exits through initial public offerings, secondary offerings, and sales to strategic buyers. KKR & Co. Inc. was founded in May 1, 1976 and is based in New York, New York with additional offices across North America, Europe, Australia, Middle East and Asia Pacific.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:38:11"},{"Company Name":"Marsh & McLennan Companies, Inc","Symbol":"MMC","Current Price":"218.84","Latest MA":"224.81","Latest MA 5":221.3559974365,"Latest MA 9":226.3977766927,"Latest MA 20":228.593499939,"RSI":28.5469918663,"Price Target":233.22157,"Difference from MA":"-2.66%","Difference from Open":"0.53%","Change from Yesterday":"0.73%","Change from Last Report":"-0.00","Latest Volume":"938,793","Market Cap":"107,828,592,640","Earning Date":"17-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":23.206785,"PB Ratio":7.6656857,"Previous Close":217.29,"ROE":0.30532,"DTE":157.128,"Industry":"Insurance Brokers","Sector":"Financial Services","Beta":0.827,"Trailing PEG":2.3334,"Trailing PE":26.851534,"Trailing PS":26.851534,"Quick Ratio":0.505,"Day High":219.17,"Day Low":216.13,"VS Average Volume":0.4245521209,"Company Summary":"Marsh & McLennan Companies, Inc., a professional services company, provides advisory services and insurance solutions to clients in the areas of risk, strategy, and people worldwide. It operates through Risk and Insurance Services, and Consulting segments. The Risk and Insurance Services segment offers risk management services, such as risk advice, risk transfer, and risk control and mitigation solutions, as well as insurance and reinsurance broking, strategic advisory services, and analytics solutions, and insurance program management services. It serves businesses, public entities, insurance companies, associations, professional services organizations, and private clients. The Consulting segment provides health, wealth and career advice, solutions and products; and specialized management, strategic, economic, and brand consulting services. Marsh & McLennan Companies, Inc. was founded in 1871 and is headquartered in New York, New York.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:38:11"},{"Company Name":"General Dynamics Corporation","Symbol":"GD","Current Price":"278.50","Latest MA":"268.02","Latest MA 5":277.0979980469,"Latest MA 9":276.2988891602,"Latest MA 20":277.2445022583,"RSI":58.6120199049,"Price Target":293.484,"Difference from MA":"3.91%","Difference from Open":"1.19%","Change from Yesterday":"0.97%","Change from Last Report":"0.04","Latest Volume":"302,159","Market Cap":"74,748,289,024","Earning Date":"23-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":17.319653,"PB Ratio":3.358173,"Previous Close":275.83,"ROE":0.18228,"DTE":51.775,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":0.467,"Trailing PEG":2.0723,"Trailing PE":19.340279,"Trailing PS":19.340279,"Quick Ratio":0.729,"Day High":278.6117,"Day Low":274.9151,"VS Average Volume":0.2219079772,"Company Summary":"General Dynamics Corporation operates as an aerospace and defense company worldwide. It operates through four segments: Aerospace, Marine Systems, Combat Systems, and Technologies. The Aerospace segment produces and sells business jets; and offers aircraft maintenance and repair, management, aircraft-on-ground support and completion, charter, staffing, and fixed-base operator services. The Marine Systems segment designs and builds nuclear-powered submarines, surface combatants, and auxiliary ships for the United States Navy and Jones Act ships for commercial customers, as well as builds crude oil and product tankers, and container and cargo ships; provides maintenance, modernization, and lifecycle support services for navy ships; offers and program management, planning, engineering, and design support services for submarine construction programs. The Combat Systems segment manufactures land combat solutions, such as wheeled and tracked combat vehicles, Stryker wheeled combat vehicles, piranha vehicles, weapons systems, munitions, mobile bridge systems with payloads, tactical vehicles, main battle tanks, and armored vehicles; and offers modernization programs, engineering, support, and sustainment services. The Technologies segment provides information technology solutions and mission support services; mobile communication, computers, and command-and-control mission systems; intelligence, surveillance, and reconnaissance solutions to military, intelligence, and federal civilian customers; cloud services, cybersecurity, network modernization, artificial intelligence; machine learning; application development, high-performance computing, and 5G and next-generation wireless communications services; and unmanned undersea vehicle manufacturing and assembly services. The company was founded in 1899 and is headquartered in Reston, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:38:11"},{"Company Name":"Williams Companies, Inc. (The)","Symbol":"WMB","Current Price":"59.73","Latest MA":"56.98","Latest MA 5":59.6669996948,"Latest MA 9":60.154999983,"Latest MA 20":59.6217500381,"RSI":49.6921623481,"Price Target":61.045,"Difference from MA":"4.83%","Difference from Open":"0.53%","Change from Yesterday":"0.53%","Change from Last Report":"0.18","Latest Volume":"2,591,320","Market Cap":"72,937,037,824","Earning Date":"05-05-2025","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":28.58134,"PB Ratio":5.857521,"Previous Close":59.42,"ROE":0.16197,"DTE":184.4,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.679,"Trailing PEG":2.575,"Trailing PE":32.115593,"Trailing PS":32.115593,"Quick Ratio":0.245,"Day High":60.09,"Day Low":59.2272,"VS Average Volume":0.3459179316,"Company Summary":"The Williams Companies, Inc., together with its subsidiaries, operates as an energy infrastructure company primarily in the United States. It operates through Transmission & Gulf of America, Northeast G&P, West, and Gas & NGL Marketing Services segments. The Transmission & Gulf of America segment comprises Transco, NWP, and MountainWest interstate natural gas pipelines, and their related natural gas storage facilities, as well as natural gas gathering and processing; and crude oil production handling and transportation assets in the Gulf Coast region. The Northeast G&P segment engages in the midstream gathering, processing, and fractionation activities in the Marcellus Shale region primarily in Pennsylvania and New York, and the Utica Shale region of eastern Ohio. The West segment consists of gas gathering, processing, and treating operations in the Rocky Mountain region of Colorado and Wyoming, the Barnett Shale region of north-central Texas, the Eagle Ford Shale region of South Texas, the Haynesville Shale region of northwest Louisiana, the Mid-Continent region that includes the Anadarko and Permian basins, and the DJ Basin of Colorado; and operates natural gas liquid (NGL) fractionation and storage assets in central Kansas near Conway. The Gas & NGL Marketing Services segment provides wholesale marketing, trading, storage, and transportation of natural gas for natural gas utilities, municipalities, power generators, and producers; asset management services; and transports and markets NGLs. The company owns and operates approximately 33,000 miles of pipelines. The Williams Companies, Inc. was founded in 1908 and is headquartered in Tulsa, Oklahoma.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:38:11"},{"Company Name":"Howmet Aerospace Inc.","Symbol":"HWM","Current Price":"171.25","Latest MA":"131.04","Latest MA 5":171.7699981689,"Latest MA 9":172.5622202555,"Latest MA 20":168.966999054,"RSI":56.4809973571,"Price Target":169.86682,"Difference from MA":"30.69%","Difference from Open":"1.52%","Change from Yesterday":"0.30%","Change from Last Report":"0.05","Latest Volume":"1,230,231","Market Cap":"69,129,166,848","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":54.02208,"PB Ratio":14.605543,"Previous Close":170.74,"ROE":0.28295,"DTE":72.684,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.432,"Trailing PEG":null,"Trailing PE":55.964054,"Trailing PS":55.964054,"Quick Ratio":0.928,"Day High":171.49,"Day Low":168.5,"VS Average Volume":0.4244006639,"Company Summary":"Howmet Aerospace Inc. provides advanced engineered solutions for the aerospace and transportation industries in the United States, Japan, France, Germany, the United Kingdom, Mexico, Italy, Canada, Poland, China, and internationally. It operates through four segments: Engine Products, Fastening Systems, Engineered Structures, and Forged Wheels. The Engine Products segment offers airfoils and seamless rolled rings primarily for aircraft engines and industrial gas turbines; and rotating and structural parts. The Fastening Systems segment produces aerospace fastening systems, as well as commercial transportation, industrial, and other fasteners; and latches, bearings, fluid fittings, and installation tools. The Engineered Structures segment provides titanium ingots and mill products, aluminum and nickel forgings, and machined components and assemblies for aerospace and defense applications; and titanium forgings, extrusions, and forming and machining services for airframe, wing, aero-engine, and landing gear components. The Forged Wheels segment offers forged aluminum wheels and related products for heavy-duty trucks and commercial transportation markets. The company was formerly known as Arconic Inc. Howmet Aerospace Inc. was founded in 1888 and is based in Pittsburgh, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:38:11"},{"Company Name":"Coinbase Global, Inc.","Symbol":"COIN","Current Price":"244.13","Latest MA":"247.03","Latest MA 5":251.5300008545,"Latest MA 9":251.4977784559,"Latest MA 20":255.4999989929,"RSI":42.4449995668,"Price Target":260.29715,"Difference from MA":"-1.18%","Difference from Open":"-1.06%","Change from Yesterday":"-2.61%","Change from Last Report":"-0.18","Latest Volume":"3,990,093","Market Cap":"62,181,130,240","Earning Date":"08-05-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":68.38376,"PB Ratio":5.9373026,"Previous Close":250.68,"ROE":0.15841,"DTE":43.892,"Industry":"Financial Data & Stock Exchanges","Sector":"Financial Services","Beta":3.62,"Trailing PEG":70.976,"Trailing PE":45.97552,"Trailing PS":45.97552,"Quick Ratio":1.197,"Day High":247.7125,"Day Low":242.65,"VS Average Volume":0.3824756429,"Company Summary":"Coinbase Global, Inc. operates platform for crypto assets in the United States and internationally. It offers the primary financial account in the crypto economy for consumers; a brokerage platform with a pool of liquidity across the crypto marketplace for institutions; and a suite of products granting access to build onchain for developers. The company was founded in 2012 and is based in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:38:11"},{"Company Name":"Norfolk Southern Corporation","Symbol":"NSC","Current Price":"251.00","Latest MA":"241.31","Latest MA 5":251.3190023193,"Latest MA 9":249.3505548774,"Latest MA 20":246.0922498169,"RSI":65.8605601339,"Price Target":258.04166,"Difference from MA":"4.02%","Difference from Open":"0.38%","Change from Yesterday":"-0.13%","Change from Last Report":"0.04","Latest Volume":"261,201","Market Cap":"56,587,571,200","Earning Date":"23-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":18.483433,"PB Ratio":3.8996522,"Previous Close":251.33,"ROE":0.24542,"DTE":122.314,"Industry":"Railroads","Sector":"Industrials","Beta":1.31,"Trailing PEG":2.3593,"Trailing PE":17.133448,"Trailing PS":17.133448,"Quick Ratio":0.648,"Day High":251.405,"Day Low":249.315,"VS Average Volume":0.1959000643,"Company Summary":"Norfolk Southern Corporation, together with its subsidiaries, engages in the rail transportation of raw materials, intermediate products, and finished goods in the United States. The company transports agriculture, forest, and consumer products comprising soybeans, wheat, corn, fertilizers, livestock and poultry feed, food products, food oils, flour, sweeteners, ethanol, lumber and wood products, pulp board and paper products, wood fibers, wood pulp, beverages, and canned goods; chemicals consist of sulfur and related chemicals, petroleum products comprising crude oil, chlorine and bleaching compounds, plastics, rubber, industrial chemicals, chemical wastes, sand, and natural gas liquids; metals and construction materials, such as steel, aluminum products, machinery, scrap metals, cement, aggregates, minerals, clay, transportation equipment, and military-related products; and automotive, including finished motor vehicles and automotive parts, as well as coal. It also transports overseas freight through various Atlantic and Gulf Coast ports; and operates an intermodal network. Norfolk Southern Corporation was incorporated in 1980 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:38:11"},{"Company Name":"Becton, Dickinson and Company","Symbol":"BDX","Current Price":"174.60","Latest MA":"212.83","Latest MA 5":173.3259967041,"Latest MA 9":171.6189500597,"Latest MA 20":172.2632633972,"RSI":59.3602378257,"Price Target":221.75357,"Difference from MA":"-17.96%","Difference from Open":"1.27%","Change from Yesterday":"1.09%","Change from Last Report":"-0.01","Latest Volume":"798,342","Market Cap":"50,041,585,664","Earning Date":"07-08-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":11.09981,"PB Ratio":1.982559,"Previous Close":172.72,"ROE":0.058870003,"DTE":76.344,"Industry":"Medical Instruments & Supplies","Sector":"Healthcare","Beta":0.279,"Trailing PEG":0.7529,"Trailing PE":33.83721,"Trailing PS":33.83721,"Quick Ratio":0.483,"Day High":175.23,"Day Low":171.7,"VS Average Volume":0.2718218974,"Company Summary":"Becton, Dickinson and Company develops, manufactures, and sells medical supplies, devices, laboratory equipment, and diagnostic products for healthcare institutions, physicians, life science researchers, clinical laboratories, pharmaceutical industry, and the general public worldwide. The BD Medical segment provides peripheral intravenous (IV) and advanced peripheral catheters, central lines, acute dialysis catheters, vascular access technology, vascular care and preparation products, needle-free IV connectors and extensions sets, closed-system drug transfer devices, hazardous drug detections, hypodermic syringes and needles, anesthesia needles and trays, enteral syringes, and sharps disposal systems; IV medication safety and infusion therapy delivery systems, medication compounding workflow systems, automated medication dispensing and supply management systems, informatics and analytics and pharmacy automation systems, and medication inventory optimization and tracking systems; hemodynamic monitoring systems; and prefillable drug delivery systems. The BD Life Sciences segment offers specimen and blood collection products; automated blood and tuberculosis culturing, molecular testing, microorganism identification and drug susceptibility, and liquid-based cytology systems, as well as rapid diagnostic assays, microbiology laboratory automation products, and plated media products; and fluorescence-activated cell sorters and analyzers, antibodies and kits, reagent systems, and solutions for single-cell gene expression analysis, as well as clinical oncology, immunological, and transplantation diagnostic\/monitoring reagents and analyzers. The BD Interventional segment provides hernia and soft tissue repair, biological and bioresorbable grafts, biosurgery, and other surgical products; surgical infection prevention; peripheral intervention products; and urology and critical care products. The company was founded in 1897 and is headquartered in Franklin Lakes, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:38:11"},{"Company Name":"Nasdaq, Inc.","Symbol":"NDAQ","Current Price":"86.88","Latest MA":"78.60","Latest MA 5":86.2001205493,"Latest MA 9":85.1867336724,"Latest MA 20":83.4905300153,"RSI":88.8233910367,"Price Target":84.22222,"Difference from MA":"10.53%","Difference from Open":"0.32%","Change from Yesterday":"0.10%","Change from Last Report":"0.01","Latest Volume":"1,049,881","Market Cap":"49,880,064,000","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":27.66898,"PB Ratio":4.318765,"Previous Close":86.79,"ROE":0.11415,"DTE":84.587,"Industry":"Financial Data & Stock Exchanges","Sector":"Financial Services","Beta":1.013,"Trailing PEG":1.7527,"Trailing PE":39.31249,"Trailing PS":39.31249,"Quick Ratio":0.212,"Day High":87.07,"Day Low":85.935,"VS Average Volume":0.2933638056,"Company Summary":"Nasdaq, Inc. operates as a technology company that serves capital markets and other industries worldwide. It operates in three segments: Capital Access Platforms, Financial Technology, and Market Services. The company distributes historical and real-time market data; develops and licenses Nasdaq-branded indices and financial products; investor relations intelligence, governance solutions, and sustainability solution products for public and private companies and organizations; and insights and workflow solutions, as well as operates listing platforms. It also offers Verafin, a cloud-based platform to detect, investigate, and report money laundering and financial frauds; AxiomSL, a risk data management and regulatory reporting solution; surveillance solutions, including a SaaS platform to assist in complying with market rules, regulations, and internal market surveillance policies; Calypso, a platform providing cross-asset, front-to-back trading, treasury, risk, and collateral management solutions; and handles assets comprising cash equities, equity derivatives, currencies, various interest-bearing securities, commodities, energy products, and digital currencies; and trade management and colocation services. In addition, the company provides equity derivative trading and clearing, cash equity trading, fixed income and commodities trading and clearing, and currency trading services; and operates various exchanges, including derivatives, commodities, cash equity, debt, structured products, and exchange traded products; and clearing, settlement, and central depository services. The company was formerly known as The NASDAQ OMX Group, Inc. and changed its name to Nasdaq, Inc. in September 2015. Nasdaq, Inc. was founded in 1971 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:38:11"},{"Company Name":"L3Harris Technologies, Inc.","Symbol":"LHX","Current Price":"248.19","Latest MA":"220.02","Latest MA 5":245.8659998779,"Latest MA 9":244.3166670736,"Latest MA 20":239.7064360352,"RSI":78.0659152829,"Price Target":261.1159,"Difference from MA":"12.80%","Difference from Open":"0.79%","Change from Yesterday":"0.62%","Change from Last Report":"0.05","Latest Volume":"558,171","Market Cap":"46,398,128,128","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":17.247395,"PB Ratio":2.4336886,"Previous Close":246.67,"ROE":0.085209996,"DTE":64.046,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":0.752,"Trailing PEG":0.3653,"Trailing PE":29.4064,"Trailing PS":29.4064,"Quick Ratio":0.787,"Day High":248.44,"Day Low":245.38,"VS Average Volume":0.3620943661,"Company Summary":"L3Harris Technologies, Inc. provides mission-critical solutions for government and commercial customers worldwide. It operates through Space & Airborne Systems (SAS), Integrated Mission Systems (IMS), Communication Systems (CS), and Aerojet Rocketdyne (AR) segments. The SAS segment provides satellite space payloads, sensors, and full-mission solutions; classified intelligence and cyber; airborne combat systems; and mission networks for air traffic management operations. The IMS segment offers intelligence, surveillance, and reconnaissance (ISR) systems; passive sensing and targeting; electronic attack platforms; autonomy; power and communications; networks; and sensors. The CS segment provides tactical radios, software, waveforms, satellite terminals, and end-to-end battlefield systems for the U.S. Department of Defense, international, federal, and state agency customers; broadband communications; integrated vision solutions, including helmet-mounted integrated night vision goggles with image intensifier tubes and weapon-mounted sights, aiming lasers, and range finders; and public safety radios, and system applications and equipment. The AR segment offers propulsion technologies and armament systems for strategic defense, missile defense, hypersonic, and tactical systems; and space propulsion and power systems for national security space and exploration missions. The company was formerly known as Harris Corporation and changed its name to L3Harris Technologies, Inc. in June 2019. L3Harris Technologies, Inc. was founded in 1895 and is based in Melbourne, Florida.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:38:11"},{"Company Name":"Kimberly-Clark Corporation","Symbol":"KMB","Current Price":"133.28","Latest MA":"133.30","Latest MA 5":133.0830009766,"Latest MA 9":135.0174793837,"Latest MA 20":137.7511167603,"RSI":32.2597874787,"Price Target":142.40167,"Difference from MA":"-0.01%","Difference from Open":"0.03%","Change from Yesterday":"0.33%","Change from Last Report":"0.01","Latest Volume":"664,460","Market Cap":"44,226,097,152","Earning Date":"22-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":17.468546,"PB Ratio":40.170284,"Previous Close":132.85,"ROE":2.0706,"DTE":595.098,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":0.398,"Trailing PEG":5.8543,"Trailing PE":18.134014,"Trailing PS":18.134014,"Quick Ratio":0.396,"Day High":133.645,"Day Low":132.52,"VS Average Volume":0.2831046843,"Company Summary":"Kimberly-Clark Corporation, together with its subsidiaries, manufactures and markets personal care products in the United States. It operates through three segments: North America, International Personal Care, and International Family Care and Professional. The company North America segment offers disposable diapers, training and youth pants, swimpants, baby wipes, feminine and incontinence care products, reusable underwear, facial and bathroom tissue, paper towels, napkins, wipers, tissue, towels, soaps and sanitizers, and other related products under the Huggies, Pull-Ups, GoodNites, Kotex, Poise, Depend, Kleenex, Scott, Cottonelle, Viva, Wypall, and other brand names. The International Personal Care segment provides baby and child care, adult care and feminine care, including disposable diapers, training and youth pants, swimpants, baby wipes, feminine and incontinence care products, reusable underwear, and other related products under the Huggies, Kotex, Goodfeel, Intimus, Depend and other brand names. The International Family Care and Professional segment offers facial and bathroom tissue, paper towels, napkins, wipers, tissue, towels, soaps and sanitizers, and other related products under the Kleenex, Scott, Viva, Andrex, Scottex, Wypall, and other brand names. It also sells household use products directly to supermarkets, mass merchandisers, drugstores, warehouse clubs, variety and department stores, and other retail outlets, as well as through other distributors and e-commerce; and professional use products directly to distributors, manufacturing, lodging, office building, food service, and public facilities, as well as through e-commerce. Kimberly-Clark Corporation was founded in 1872 and is headquartered in Dallas, Texas.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:38:11"},{"Company Name":"Ross Stores, Inc.","Symbol":"ROST","Current Price":"133.47","Latest MA":"141.89","Latest MA 5":139.0170682373,"Latest MA 9":140.5175593397,"Latest MA 20":143.7782775269,"RSI":24.8179568244,"Price Target":149.53896,"Difference from MA":"-5.94%","Difference from Open":"-2.00%","Change from Yesterday":"-2.14%","Change from Last Report":"-0.41","Latest Volume":"2,689,916","Market Cap":"43,654,168,576","Earning Date":"22-05-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":19.950672,"PB Ratio":7.836426,"Previous Close":136.39,"ROE":0.39566,"DTE":89.95,"Industry":"Apparel Retail","Sector":"Consumer Cyclical","Beta":1.157,"Trailing PEG":2.6866,"Trailing PE":21.085308,"Trailing PS":21.085308,"Quick Ratio":0.894,"Day High":136.59,"Day Low":133.17,"VS Average Volume":0.7872237497,"Company Summary":"Ross Stores, Inc., together with its subsidiaries, operates off-price retail apparel and home fashion stores under the Ross Dress for Less and dd's DISCOUNTS brands in the United States. The company offers apparel, accessories, footwear, and home fashions products. It sells its products to middle income households and households with lower to more moderate incomes. Ross Stores, Inc. was incorporated in 1957 and is headquartered in Dublin, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:38:11"},{"Company Name":"Corning Incorporated","Symbol":"GLW","Current Price":"50.58","Latest MA":"47.42","Latest MA 5":50.6479999695,"Latest MA 9":50.6311109416,"Latest MA 20":49.4447123566,"RSI":67.6266688436,"Price Target":52.33077,"Difference from MA":"6.66%","Difference from Open":"1.00%","Change from Yesterday":"0.26%","Change from Last Report":"-0.26","Latest Volume":"1,785,812","Market Cap":"43,320,303,616","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":21.896105,"PB Ratio":3.8231294,"Previous Close":50.45,"ROE":0.048660003,"DTE":73.266,"Industry":"Electronic Components","Sector":"Technology","Beta":1.096,"Trailing PEG":0.5001,"Trailing PE":97.26924,"Trailing PS":97.26924,"Quick Ratio":0.753,"Day High":50.79,"Day Low":49.94,"VS Average Volume":0.2914285369,"Company Summary":"Corning Incorporated engages in the optical communications, display technologies, environmental technologies, specialty materials, and life sciences businesses in the United States and internationally. The company's Optical Communications segment provides optical fibers and cables; and hardware and equipment products, such as cable assemblies, fiber optic hardware and connectors, optical components and couplers, closures, network interface devices, and other accessories for the telecommunications industry, businesses, governments, and individuals. Its Display Technologies segment offers glass substrates for flat panel displays, including liquid crystal displays and organic light-emitting diodes that are used in televisions, notebook computers, desktop monitors, tablets, and handheld devices. The company's Specialty Materials segment manufactures products that offer material formulations for glass, glass ceramics, crystals, precision metrology instruments, and software, as well as glass wafers and substrates, tinted sunglasses, and radiation shielding products for various markets comprising mobile consumer electronics, semiconductor equipment optics and consumables, aerospace and defense optics, radiation shielding products, sunglasses, and telecommunications components. Its Environmental Technologies segment provides ceramic substrates and filter products for emissions control in mobile, gasoline, and diesel applications. The company's Life Sciences segment offers laboratory products, including consumables, such as plastic vessels, liquid handling plastics, specialty surfaces, cell culture media, and serum, as well as general labware, and glassware and equipment under the Corning, Pyrex, Falcon, and Axygen brands. The company was formerly known as Corning Glass Works and changed its name to Corning Incorporated in April 1989. Corning Incorporated was founded in 1851 and is headquartered in Corning, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:38:11"},{"Company Name":"Valero Energy Corporation","Symbol":"VLO","Current Price":"133.02","Latest MA":"127.53","Latest MA 5":131.1239981689,"Latest MA 9":129.8099987793,"Latest MA 20":130.1684701691,"RSI":63.4566320826,"Price Target":144.42255,"Difference from MA":"4.30%","Difference from Open":"0.20%","Change from Yesterday":"-0.78%","Change from Last Report":"-0.02","Latest Volume":"882,286","Market Cap":"41,662,664,704","Earning Date":"24-07-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":13.784457,"PB Ratio":1.7735764,"Previous Close":134.06,"ROE":0.03714,"DTE":41.246,"Industry":"Oil & Gas Refining & Marketing","Sector":"Energy","Beta":0.972,"Trailing PEG":6.1907,"Trailing PE":45.2449,"Trailing PS":45.2449,"Quick Ratio":1.046,"Day High":133.5,"Day Low":131.28,"VS Average Volume":0.2589229772,"Company Summary":"Valero Energy Corporation manufactures, markets, and sells petroleum-based and low-carbon liquid transportation fuels and petrochemical products in the United States, Canada, the United Kingdom, Ireland, Latin America, Mexico, Peru, and internationally. It operates through three segments: Refining, Renewable Diesel, and Ethanol. The company produces California Reformulated Gasoline Blendstock for Oxygenate Blending (CARBOB) and Conventional Blendstock for Oxygenate Blending (CBOB) gasolines, CARB diesel, diesel, jet fuel, heating oil, and asphalt; feedstocks; aromatics; sulfur and residual fuel oil; intermediate oils; and sulfur, sweet, and sour crude oils. It sells its refined products through wholesale rack and bulk markets; and through outlets under the Valero, Beacon, Diamond Shamrock, Shamrock, Ultramar, and Texaco brand names. The company owns and operates renewable diesel and ethanol plants, as well as produces renewable diesel and naphtha under the Diamond Green Diesel brand name. In addition, it offers ethanol and various co-products, including dry distiller grains, syrup, and inedible distillers corn oil to animal feed customers. The company was formerly known as Valero Refining and Marketing Company and changed its name to Valero Energy Corporation in August 1997. Valero Energy Corporation was founded in 1980 and is headquartered in San Antonio, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:38:11"},{"Company Name":"CBRE Group Inc","Symbol":"CBRE","Current Price":"135.96","Latest MA":"131.60","Latest MA 5":132.0100023193,"Latest MA 9":129.4000016276,"Latest MA 20":127.2500015717,"RSI":84.4167374678,"Price Target":143.83333,"Difference from MA":"3.32%","Difference from Open":"1.06%","Change from Yesterday":"1.59%","Change from Last Report":"0.20","Latest Volume":"713,554","Market Cap":"40,530,358,272","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":22.660002,"PB Ratio":4.844814,"Previous Close":133.83,"ROE":0.11921,"DTE":100.422,"Industry":"Real Estate Services","Sector":"Real Estate","Beta":1.29,"Trailing PEG":0.9507,"Trailing PE":41.577984,"Trailing PS":41.577984,"Quick Ratio":0.796,"Day High":136.815,"Day Low":133.7487,"VS Average Volume":0.367227562,"Company Summary":"CBRE Group, Inc. operates as a commercial real estate services and investment company in the United States, the United Kingdom, and internationally. The Advisory Services segment offers strategic advice and execution to owners, investors, and occupiers of real estate in connection with leasing of offices, and industrial and retail space; clients fully integrated property sales services under the CBRE Capital Markets brand; clients commercial mortgage and structured financing services; originates and sells commercial mortgage loans; property management services, such as marketing, building engineering, accounting, and financial services on a contractual basis for owners of and investors in office, industrial, and retail properties; and valuation services that include market value appraisals, litigation support, discounted cash flow analyses, and feasibility studies, as well as consulting services, such as property condition reports, hotel advisory, and environmental consulting. The Global Workplace Solutions segment provides facilities management, including day-to-day management of client-occupied space, headquarters, regional offices, administrative offices, data centers and other critical facilities, manufacturing and laboratory facilities, and distribution facilities and retail space; and project management services comprising building consulting, program, and project and cost management services under the Turner & Townsend brand name. The Real Estate Investments segment offers investment management services under the CBRE Investment Management brand to pension funds, insurance companies, sovereign wealth funds, foundations, endowments, and other institutional investors; and development services, such as real estate development and investment activities under the Trammell Crow Company and Telford Homes brands to users and investors in commercial real estate, and for their own account. CBRE Group, Inc. was founded in 1906 and is headquartered in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:38:11"},{"Company Name":"Yum! Brands, Inc.","Symbol":"YUM","Current Price":"143.16","Latest MA":"141.73","Latest MA 5":143.6920006104,"Latest MA 9":143.7722231717,"Latest MA 20":144.7658201294,"RSI":41.5950384012,"Price Target":159.63834,"Difference from MA":"1.01%","Difference from Open":"-0.03%","Change from Yesterday":"-0.17%","Change from Last Report":"0.16","Latest Volume":"383,904","Market Cap":"39,793,467,392","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":23.546053,"PB Ratio":-5.0997434,"Previous Close":143.41,"ROE":null,"DTE":null,"Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":0.736,"Trailing PEG":1.972,"Trailing PE":28.51793,"Trailing PS":28.51793,"Quick Ratio":1.111,"Day High":143.595,"Day Low":142.51,"VS Average Volume":0.1780152733,"Company Summary":"Yum! Brands, Inc., together with its subsidiaries, develops, operates, and franchises quick service restaurants worldwide. It operates through four segments: KFC Division, Taco Bell Division, Pizza Hut Division, and Habit Burger & Grill Division segments. The company also operates restaurants under the KFC, Pizza Hut, Taco Bell, and Habit Burger & Grill brands, which specialize in chicken, made-to-order chargrilled burgers, sandwiches, Mexican-style food and pizza categories, and other products. The company was formerly known as TRICON Global Restaurants, Inc. and changed its name to Yum! Brands, Inc. in May 2002. Yum! Brands, Inc. was incorporated in 1997 and is based in Louisville, Kentucky.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"12-06-2025 20:38:11"},{"Company Name":"Prudential Financial, Inc.","Symbol":"PRU","Current Price":"104.56","Latest MA":"110.75","Latest MA 5":105.3319996948,"Latest MA 9":104.6877774726,"Latest MA 20":104.401519516,"RSI":50.4856926369,"Price Target":113.28571,"Difference from MA":"-5.59%","Difference from Open":"0.14%","Change from Yesterday":"-0.05%","Change from Last Report":"0.10","Latest Volume":"617,317","Market Cap":"37,014,970,368","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":7.1177673,"PB Ratio":1.238657,"Previous Close":104.61,"ROE":0.07908,"DTE":148.073,"Industry":"Insurance - Life","Sector":"Financial Services","Beta":1.047,"Trailing PEG":0.6882,"Trailing PE":16.492113,"Trailing PS":16.492113,"Quick Ratio":0.881,"Day High":104.58,"Day Low":103.01,"VS Average Volume":0.3286391,"Company Summary":"Prudential Financial, Inc., together with its subsidiaries, provides insurance, investment management, and other financial products and services in the United States, Japan and internationally. It operates through PGIM, Retirement Strategies, Group Insurance, Individual Life, and International Businesses segments. The PGIM segment offers investment management services and solutions related to public fixed income, public equity, real estate debt and equity, private credit and other alternatives, and multi-asset class strategies to institutional and retail clients, as well as its insurance and retirement businesses. The Retirement Strategies segment provides a range of retirement investment, and income products and services to retirement plan sponsors in the public, private, and not-for-profit sectors; develops and distributes individual variable and fixed annuity products. The Group Insurance segment offers various group life, and long-term and short-term group disability, as well as group corporate-, bank-, and trust-owned life insurance in the United States primarily for institutional clients for use in connection with employee and membership benefits plans; sells accidental death and dismemberment, and other supplemental health solutions; and plan administration services in connection with its insurance coverages. The Individual Life segment develops and distributes variable life, universal life, and term life insurance products. The International Businesses segment develops and distributes life insurance, retirement products, investment products, and certain accident and health products; and advisory and administration services . The company provides its products and services to individual and institutional customers through its proprietary and third-party distribution networks. Prudential Financial, Inc. was founded in 1875 and is headquartered in Newark, New Jersey.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:38:11"},{"Company Name":"VICI Properties Inc.","Symbol":"VICI","Current Price":"32.51","Latest MA":"30.84","Latest MA 5":32.1850000153,"Latest MA 9":31.9183333588,"Latest MA 20":31.78775,"RSI":72.6938240239,"Price Target":36.11957,"Difference from MA":"5.41%","Difference from Open":"0.05%","Change from Yesterday":"0.08%","Change from Last Report":"-0.03","Latest Volume":"1,511,790","Market Cap":"34,348,359,680","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":11.906593,"PB Ratio":1.2908031,"Previous Close":32.48,"ROE":0.1012,"DTE":65.738,"Industry":"REIT - Diversified","Sector":"Real Estate","Beta":0.724,"Trailing PEG":null,"Trailing PE":13.002001,"Trailing PS":13.002001,"Quick Ratio":21.502,"Day High":32.56,"Day Low":32.305,"VS Average Volume":0.2166308168,"Company Summary":"VICI Properties Inc. is an S&P 500 experiential real estate investment trust that owns one of the largest portfolios of market-leading gaming, hospitality and entertainment destinations, including Caesars Palace Las Vegas, MGM Grand and the Venetian Resort Las Vegas, three of the most iconic entertainment facilities on the Las Vegas Strip. VICI Properties owns 93 experiential assets across a geographically diverse portfolio consisting of 54 gaming properties and 39 other experiential properties across the United States and Canada. The portfolio is comprised of approximately 127 million square feet and features approximately 60,300 hotel rooms and over 500 restaurants, bars, nightclubs and sportsbooks. Its properties are occupied by industry-leading gaming, leisure and hospitality operators under long-term, triple-net lease agreements. VICI Properties has a growing array of real estate and financing partnerships with leading operators in other experiential sectors, including Bowlero, Cabot, Canyon Ranch, Chelsea Piers, Great Wolf Resorts, Homefield and Kalahari Resorts. VICI Properties also owns four championship golf courses and 33 acres of undeveloped and underdeveloped land adjacent to the Las Vegas Strip. VICI Properties' goal is to own the highest quality and most productive experiential real estate portfolio through a strategy of partnering with the highest quality experiential place makers and operators.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:40:25"},{"Company Name":"The Kraft Heinz Company","Symbol":"KHC","Current Price":"26.41","Latest MA":"29.05","Latest MA 5":26.5259998627,"Latest MA 9":26.5966667769,"Latest MA 20":26.6460338669,"RSI":39.9481531393,"Price Target":31.48182,"Difference from MA":"-9.10%","Difference from Open":"0.04%","Change from Yesterday":"-0.04%","Change from Last Report":"0.19","Latest Volume":"3,324,493","Market Cap":"31,257,290,752","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":8.602606,"PB Ratio":0.6354209,"Previous Close":26.42,"ROE":0.0535,"DTE":43.55,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.231,"Trailing PEG":0.9266,"Trailing PE":12.0593605,"Trailing PS":12.0593605,"Quick Ratio":0.697,"Day High":26.43,"Day Low":26.175,"VS Average Volume":0.2956908998,"Company Summary":"The Kraft Heinz Company, together with its subsidiaries, manufactures and markets food and beverage products in North America and internationally. Its products include condiments and sauces, cheese and dairy products, meals, meats, refreshment beverages, coffee, and other grocery products under the Kraft, Oscar Mayer, Heinz, Philadelphia, Lunchables, Velveeta, Ore-Ida, Maxwell House, Kool-Aid, Jell-O, Heinz, ABC, Master, Quero, Kraft, Golden Circle, Wattie's, Pudliszki, and Plasmon brands. It sells its products through its own sales organizations, as well as through independent brokers, agents, and distributors to chain, wholesale, cooperative, and independent grocery accounts; convenience, value, and club stores; pharmacies and drug stores; mass merchants; foodservice distributors; institutions, including hotels, restaurants, bakeries, hospitals, health care facilities, and government agencies; and c various e-commerce platforms and retailers. The company was formerly known as H.J. Heinz Holding Corporation and changed its name to The Kraft Heinz Company in July 2015. The company was founded in 1869 and is based in Pittsburgh, Pennsylvania.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:40:25"},{"Company Name":"Brown & Brown, Inc.","Symbol":"BRO","Current Price":"106.28","Latest MA":"111.00","Latest MA 5":106.9360003052,"Latest MA 9":109.0988889567,"Latest MA 20":110.4229996338,"RSI":34.5104006808,"Price Target":118.37727,"Difference from MA":"-4.25%","Difference from Open":"1.19%","Change from Yesterday":"1.72%","Change from Last Report":"-0.07","Latest Volume":"4,274,394","Market Cap":"30,468,349,952","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":25.985329,"PB Ratio":4.4717464,"Previous Close":104.48,"ROE":0.16519,"DTE":59.026,"Industry":"Insurance Brokers","Sector":"Financial Services","Beta":0.839,"Trailing PEG":null,"Trailing PE":29.604458,"Trailing PS":29.604458,"Quick Ratio":0.446,"Day High":107.1,"Day Low":104.355,"VS Average Volume":2.03249505,"Company Summary":"Brown & Brown, Inc. markets and sells insurance products and services in the United States, Canada, Ireland, the United Kingdom, and internationally. It operates through four segments: Retail, Programs, Wholesale Brokerage, and Services. The Retail segment provides property and casualty, employee benefits insurance products, personal insurance products, specialties insurance products, risk management strategies, loss control survey and analysis, consultancy, and claims processing services. It serves commercial, public and quasi-public entities, professional, and individual customers. The Programs segment offers professional liability and related package insurance products for dentistry, legal, eyecare, insurance, financial, physicians, real estate title professionals, as well as supplementary insurance products related to weddings, events, medical facilities, and cyber liabilities. This segment also provides public entity-related and specialty programs through a network of independent agents; and program management services for insurance carrier partners. The Wholesale Brokerage segment markets and sells excess and surplus commercial and personal lines insurance through independent agents and brokers. The Services segment offers third-party claims administration and medical utilization management services in the workers' compensation and all-lines liability arenas, Medicare Set-aside, Social Security disability, Medicare benefits advocacy, and claims adjusting services. Brown & Brown, Inc. was founded in 1939 and is headquartered in Daytona Beach, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:40:25"},{"Company Name":"Lennar Corporation","Symbol":"LEN","Current Price":"112.13","Latest MA":"126.53","Latest MA 5":111.2160009155,"Latest MA 9":109.7822226291,"Latest MA 20":108.6105000916,"RSI":61.4024861571,"Price Target":132.68933,"Difference from MA":"-11.38%","Difference from Open":"1.29%","Change from Yesterday":"0.57%","Change from Last Report":"0.10","Latest Volume":"997,557","Market Cap":"29,433,337,856","Earning Date":"16-06-2025","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":6.9473357,"PB Ratio":1.3014462,"Previous Close":111.5,"ROE":0.15213999,"DTE":16.9,"Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":1.354,"Trailing PEG":1.5316,"Trailing PE":8.184671,"Trailing PS":8.184671,"Quick Ratio":3.159,"Day High":112.23,"Day Low":109.675,"VS Average Volume":0.3419818662,"Company Summary":"Lennar Corporation, together with its subsidiaries, operates as a homebuilder primarily under the Lennar brand in the United States. It operates through Homebuilding East, Homebuilding Central, Homebuilding Texas, Homebuilding West, Financial Services, Multifamily, and Lennar Other segments. The company's homebuilding operations include the construction and sale of single-family attached and detached homes, as well as the purchase, development, and sale of residential land; and development, construction, and management of multifamily rental properties. It also offers residential mortgage financing, title, insurance, and closing services for home buyers and others, as well as originates and sells securitization commercial mortgage loans. In addition, the company is involved in the fund investment activity. It primarily serves first-time, move-up, active adult, and luxury homebuyers. The company was founded in 1954 and is based in Miami, Florida.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:40:25"},{"Company Name":"FirstEnergy Corp.","Symbol":"FE","Current Price":"40.70","Latest MA":"40.16","Latest MA 5":40.2970001831,"Latest MA 9":40.6472223409,"Latest MA 20":41.4912498627,"RSI":44.6892896723,"Price Target":44.6,"Difference from MA":"1.33%","Difference from Open":"0.83%","Change from Yesterday":"1.21%","Change from Last Report":"0.14","Latest Volume":"1,714,609","Market Cap":"23,487,361,024","Earning Date":"23-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":14.081314,"PB Ratio":1.8689722,"Previous Close":40.21,"ROE":0.09274,"DTE":178.805,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.382,"Trailing PEG":1.2226,"Trailing PE":21.646276,"Trailing PS":21.646276,"Quick Ratio":0.284,"Day High":40.735,"Day Low":40.2713,"VS Average Volume":0.329647489,"Company Summary":"FirstEnergy Corp., together with its subsidiaries, engages in the generation, distribution, and transmission of electricity in the United States. It operates through Distribution, Integrated, and Stand-Alone Transmission segments. The company owns and operates coal-fired, nuclear, hydroelectric, wind, and solar power generating facilities. It operates 252,244 distribution line miles and 24,143 transmission line miles, including overhead pole line and underground conduit carrying primary, secondary, and street lighting circuits. The company serves customers in Ohio, Pennsylvania, New Jersey, West Virginia, Maryland, and New York. FirstEnergy Corp. was incorporated in 1996 and is headquartered in Akron, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:40:25"},{"Company Name":"NVR, Inc.","Symbol":"NVR","Current Price":"7365.45","Latest MA":"7774.69","Latest MA 5":7263.1699804687,"Latest MA 9":7203.726703559,"Latest MA 20":7180.5445458984,"RSI":62.466936146,"Price Target":7700.0,"Difference from MA":"-5.26%","Difference from Open":"0.97%","Change from Yesterday":"0.94%","Change from Last Report":"0.00","Latest Volume":"6,720","Market Cap":"21,535,324,160","Earning Date":"22-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":14.217644,"PB Ratio":5.484261,"Previous Close":7296.57,"ROE":0.38251,"DTE":26.986,"Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":0.995,"Trailing PEG":null,"Trailing PE":15.179609,"Trailing PS":15.179609,"Quick Ratio":2.644,"Day High":7369.24,"Day Low":7250.0,"VS Average Volume":0.3137254902,"Company Summary":"NVR, Inc. operates as a homebuilder in the United States. The company operates through, Homebuilding and Mortgage Banking segments. It engages in the construction and sale of single-family detached homes, townhomes, and condominium buildings under the Ryan Homes, NVHomes, and Heartland Homes names. The company markets its Ryan Homes products to first-time and first-time move-up buyers; and NVHomes and Heartland Homes products to move-up and luxury buyers. It also provides various mortgage related services to its homebuilding customers, as well as brokers title insurance; performs title searches; and sells mortgage loans to investors in the secondary markets on a servicing released basis. The company primarily serves in Maryland, Virginia, West Virginia, Delaware, New Jersey, Eastern Pennsylvania, New York, Ohio, Western Pennsylvania, Indiana, Illinois, North Carolina, Georgia, Kentucky, South Carolina, Florida, Tennessee, and Washington, D.C. NVR, Inc. was founded in 1948 and is headquartered in Reston, Virginia.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"12-06-2025 20:40:25"},{"Company Name":"CMS Energy Corporation","Symbol":"CMS","Current Price":"70.32","Latest MA":"69.22","Latest MA 5":70.0260010376,"Latest MA 9":70.036666904,"Latest MA 20":70.2385009918,"RSI":52.8711252709,"Price Target":75.27125,"Difference from MA":"1.59%","Difference from Open":"0.36%","Change from Yesterday":"0.46%","Change from Last Report":"0.19","Latest Volume":"453,844","Market Cap":"21,034,399,744","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":19.642458,"PB Ratio":2.5931115,"Previous Close":70.0,"ROE":0.11234,"DTE":190.138,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.379,"Trailing PEG":2.8351,"Trailing PE":20.804733,"Trailing PS":20.804733,"Quick Ratio":0.568,"Day High":70.43,"Day Low":70.0,"VS Average Volume":0.1638070585,"Company Summary":"CMS Energy Corporation operates as an energy company primarily in Michigan. The company operates through three segments: Electric Utility; Gas Utility; and NorthStar Clean Energy. The Electric Utility segment is involved in the generation, purchase, distribution, and sale of electricity. This segment generates electricity through coal, wind, gas, renewable energy, oil, and nuclear sources. Its distribution system comprises 270 miles of high-voltage distribution overhead lines; 4 miles of high-voltage distribution underground lines; 4,646 miles of high-voltage distribution overhead lines; 18 miles of high-voltage distribution underground lines; 81,924 miles of electric distribution overhead lines; 9,775 miles of underground distribution lines; and 1,098 substations. The Gas Utility segment engages in the purchase, transmission, storage, distribution, and sale of natural gas, which includes 2,342 miles of transmission lines; 15 gas storage fields; 28,368 miles of distribution mains; and 8 compressor stations. The NorthStar Clean Energy segment is involved in the independent power production and marketing, including the development and operation of renewable generation. The company serves 1.9 million electric and 1.8 million gas customers, including residential, commercial, and diversified industrial customers. The company was incorporated in 1987 and is headquartered in Jackson, Michigan.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:40:25"},{"Company Name":"Invitation Homes Inc.","Symbol":"INVH","Current Price":"33.70","Latest MA":"32.75","Latest MA 5":33.404999176,"Latest MA 9":33.3694439019,"Latest MA 20":33.5482497253,"RSI":56.3329428503,"Price Target":37.84091,"Difference from MA":"2.91%","Difference from Open":"1.16%","Change from Yesterday":"1.16%","Change from Last Report":"-0.03","Latest Volume":"1,238,748","Market Cap":"20,659,447,808","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":45.5473,"PB Ratio":2.1255598,"Previous Close":33.32,"ROE":0.048070002,"DTE":83.399,"Industry":"REIT - Residential","Sector":"Real Estate","Beta":0.817,"Trailing PEG":12.9681,"Trailing PE":43.211544,"Trailing PS":43.211544,"Quick Ratio":0.721,"Day High":33.73,"Day Low":33.1,"VS Average Volume":0.3776289649,"Company Summary":"Invitation Homes, an S&P 500 company, is the nation's premier single-family home leasing and management company, meeting changing lifestyle demands by providing access to high-quality, updated homes with valued features such as close proximity to jobs and access to good schools.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:40:25"},{"Company Name":"Quest Diagnostics Incorporated","Symbol":"DGX","Current Price":"177.74","Latest MA":"164.55","Latest MA 5":176.4789976807,"Latest MA 9":175.3161077881,"Latest MA 20":174.5157478027,"RSI":67.8183258448,"Price Target":183.92294,"Difference from MA":"8.01%","Difference from Open":"0.34%","Change from Yesterday":"0.43%","Change from Last Report":"-0.03","Latest Volume":"233,444","Market Cap":"19,841,445,888","Earning Date":"22-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":18.210552,"PB Ratio":2.8729026,"Previous Close":176.98,"ROE":0.13951999,"DTE":93.369,"Industry":"Diagnostics & Research","Sector":"Healthcare","Beta":0.491,"Trailing PEG":1.5696,"Trailing PE":22.46966,"Trailing PS":22.46966,"Quick Ratio":1.105,"Day High":177.96,"Day Low":176.505,"VS Average Volume":0.183191179,"Company Summary":"Quest Diagnostics Incorporated provides diagnostic testing and services in the United States and internationally. The company develops and delivers diagnostic information services, such as routine, non-routine and advanced clinical testing, anatomic pathology testing, and other diagnostic information services. It also provides diagnostic information services primarily under the Quest Diagnostics brand, as well as under the AmeriPath, Dermpath Diagnostics, ExamOne, and Quanum brands to physicians, hospitals, patients and consumers, health plans, government agencies, employers, emerging retail healthcare providers, pharmaceutical companies and insurers, commercial clinical laboratories, and accountable care organizations through a network of laboratories, patient service centers, phlebotomists in physician offices, call centers and mobile phlebotomists, nurses, and other health and wellness professionals. In addition, the company offers risk assessment services for the life insurance industry; and healthcare organizations and clinicians information technology solutions. Quest Diagnostics Incorporated was founded in 1967 and is headquartered in Secaucus, New Jersey.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:40:25"},{"Company Name":"Regions Financial Corporation","Symbol":"RF","Current Price":"22.04","Latest MA":"22.64","Latest MA 5":22.1660001831,"Latest MA 9":21.7877779049,"Latest MA 20":21.6537028809,"RSI":59.3123094177,"Price Target":24.09091,"Difference from MA":"-2.64%","Difference from Open":"-0.23%","Change from Yesterday":"-1.12%","Change from Last Report":"0.02","Latest Volume":"4,288,219","Market Cap":"19,812,417,536","Earning Date":"18-07-2025","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":9.752213,"PB Ratio":1.1783576,"Previous Close":22.29,"ROE":0.11306,"DTE":null,"Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.978,"Trailing PEG":2.8817,"Trailing PE":10.647344,"Trailing PS":10.647344,"Quick Ratio":null,"Day High":22.155,"Day Low":21.805,"VS Average Volume":0.4765249548,"Company Summary":"Regions Financial Corporation, a financial holding company, provides various banking and related products and services to individual and corporate customers. It operates through three segments: Corporate Bank, Consumer Bank, and Wealth Management. The Corporate Bank segment offers commercial banking services, such as commercial and industrial, commercial real estate, and investor real estate lending; equipment lease financing; deposit products; capital markets activities, such as securities underwriting and placement; and loan syndication and placement, foreign exchange, derivatives, merger and acquisition, and other advisory services to corporate, middle market, and commercial real estate developers and investors. The Consumer Bank segment provides consumer banking products and services related to residential first mortgages, home equity lines and loans, consumer credit cards, and other consumer loans, as well as the corresponding deposit relationships. The Wealth Management segment offers credit related products, and retirement and savings solutions; and trust and investment management, asset management, and estate planning to individuals, businesses, governmental institutions, and non-profit entities. It also provides investment and insurance products; home improvement lending, investment advisory services, equipment financing for commercial clients, small business customers, low-income housing tax credit corporate fund syndication services, financing to CRA-qualified customers, and broker-dealer services to commercial clients; and other specialty financing services. The company was founded in 1971 and is headquartered in Birmingham, Alabama.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:40:25"},{"Company Name":"Jabil Inc.","Symbol":"JBL","Current Price":"179.21","Latest MA":"148.74","Latest MA 5":177.9359971924,"Latest MA 9":175.0333329264,"Latest MA 20":170.6859997253,"RSI":86.5550740321,"Price Target":172.76375,"Difference from MA":"20.48%","Difference from Open":"1.29%","Change from Yesterday":"0.44%","Change from Last Report":"-0.24","Latest Volume":"531,089","Market Cap":"19,237,298,176","Earning Date":"17-06-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":17.903097,"PB Ratio":14.455917,"Previous Close":178.43,"ROE":0.24104,"DTE":242.489,"Industry":"Electronic Components","Sector":"Technology","Beta":1.139,"Trailing PEG":null,"Trailing PE":40.362614,"Trailing PS":40.362614,"Quick Ratio":0.519,"Day High":180.16,"Day Low":176.93,"VS Average Volume":0.3916582657,"Company Summary":"Jabil Inc. provides manufacturing services and solutions worldwide. It operates in two segments, Electronics Manufacturing Services and Diversified Manufacturing Services. The company offers electronics design, production, and product management services; electronic circuit design services, such as application-specific integrated circuit design, firmware development, and rapid prototyping services; and designs plastic and metal enclosures that include the electro-mechanics, such as the printed circuit board assemblies (PCBA). It also provides three-dimensional mechanical design comprising the analysis of electronic, electro-mechanical, and optical assemblies, as well as various industrial design, mechanism development, and tooling management services. In addition, the company provides computer-assisted design services consisting of PCBA design, as well as PCBA design validation and verification services; and other consulting services, such as the generation of a bill of materials, approved vendor list, and assembly equipment configuration for various PCBA designs. Further, it offers product and process validation services, such as product system, product safety, regulatory compliance, and reliability tests, as well as manufacturing test solution development services. Additionally, the company provides systems assembly, test, direct-order fulfillment, and configure-to-order services. It serves 5G, wireless and cloud, digital print and retail, industrial and semi-cap, networking and storage, automotive and transportation, connected devices, healthcare and packaging, and mobility industries. The company was formerly known as Jabil Circuit, Inc. and changed its name to Jabil Inc. in June 2017. Jabil Inc. was founded in 1966 and is headquartered in Saint Petersburg, Florida.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:40:25"},{"Company Name":"Southwest Airlines Company","Symbol":"LUV","Current Price":"32.80","Latest MA":"31.18","Latest MA 5":33.5390003052,"Latest MA 9":33.1261111281,"Latest MA 20":32.7152499161,"RSI":48.8035038609,"Price Target":30.15045,"Difference from MA":"5.18%","Difference from Open":"-0.59%","Change from Yesterday":"-2.08%","Change from Last Report":"0.12","Latest Volume":"4,746,790","Market Cap":"18,688,753,664","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":20.625784,"PB Ratio":1.9955579,"Previous Close":33.49,"ROE":0.05593,"DTE":85.371,"Industry":"Airlines","Sector":"Industrials","Beta":1.227,"Trailing PEG":0.5674,"Trailing PE":36.848312,"Trailing PS":36.848312,"Quick Ratio":0.671,"Day High":33.17,"Day Low":32.41,"VS Average Volume":0.3565077369,"Company Summary":"Southwest Airlines Co. operates as a passenger airline company that provides scheduled air transportation services in the United States and near-international markets. As of December 31, 2024, the company operated a total fleet of 803 Boeing 737 aircraft; and served 117 destinations in 42 states, the District of Columbia, and the Commonwealth of Puerto Rico, as well as ten near-international countries, including Mexico, Jamaica, the Bahamas, Aruba, the Dominican Republic, Costa Rica, Belize, Cuba, the Cayman Islands, and Turks and Caicos. It also provides inflight entertainment and connectivity services; and Rapid Rewards loyalty program that enables program members to earn points for dollars spent on Southwest base fares. In addition, the company offers a suite of digital platforms to support customers' travel needs, including websites and apps; and SWABIZ, an online booking tool. Further, it provides ancillary services, such as Southwest's EarlyBird Check-In, upgraded boarding, and transportation of pets and unaccompanied minors. Southwest Airlines Co. was incorporated in 1967 and is headquartered in Dallas, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"12-06-2025 20:40:25"},{"Company Name":"NiSource Inc","Symbol":"NI","Current Price":"39.63","Latest MA":"37.92","Latest MA 5":39.4629992981,"Latest MA 9":39.3783333842,"Latest MA 20":39.2267498856,"RSI":59.6625664855,"Price Target":43.225,"Difference from MA":"4.53%","Difference from Open":"0.44%","Change from Yesterday":"0.44%","Change from Last Report":"0.06","Latest Volume":"1,069,059","Market Cap":"18,656,313,344","Earning Date":"07-05-2025","Earning Time":"Before","Earning Day of Week":"Saturday","PE Ratio":21.30914,"PB Ratio":2.0966463,"Previous Close":39.46,"ROE":0.09364,"DTE":136.355,"Industry":"Utilities - Regulated Gas","Sector":"Utilities","Beta":0.549,"Trailing PEG":2.4255,"Trailing PE":21.424324,"Trailing PS":21.424324,"Quick Ratio":0.338,"Day High":39.695,"Day Low":39.29,"VS Average Volume":0.2250875614,"Company Summary":"NiSource Inc., an energy holding company, operates as a regulated natural gas and electric utility company in the United States. It operates in two segments, Columbia Operations and NIPSCO Operations. The company provides natural gas to approximately 2.4 million residential, commercial, and industrial customers through approximately 37,200 miles of distribution main pipeline and the associated individual customer service lines; and 330 miles of transmission main pipeline in Ohio, Pennsylvania, Virginia, Kentucky, and Maryland. It also generates, transmits, and distributes electricity to approximately 0.5 million customers in various counties in the northern part of Indiana, as well as engages in wholesale electric and transmission transactions. It owns and operates steam coal generating stations in Wheatfield and Michigan City; combined cycle gas turbine in West Terre Haute; natural gas generating units in Wheatfield; hydro generating plants in Carroll County and White County; wind generating units in White County, Indiana; and solar generating units in Jasper County and White County. The company was formerly known as NIPSCO Industries, Inc. and changed its name to NiSource Inc. in April 1999. NiSource Inc. was founded in 1847 and is headquartered in Merrillville, Indiana.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:40:25"},{"Company Name":"Textron Inc.","Symbol":"TXT","Current Price":"77.83","Latest MA":"75.54","Latest MA 5":77.0260006104,"Latest MA 9":75.7933330621,"Latest MA 20":75.1899996796,"RSI":70.4128887839,"Price Target":86.10647,"Difference from MA":"3.03%","Difference from Open":"2.13%","Change from Yesterday":"1.34%","Change from Last Report":"0.26","Latest Volume":"524,049","Market Cap":"14,051,351,552","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":11.616419,"PB Ratio":1.9318888,"Previous Close":76.8,"ROE":0.11699,"DTE":56.371,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.163,"Trailing PEG":0.8991,"Trailing PE":17.52928,"Trailing PS":17.52928,"Quick Ratio":0.637,"Day High":77.84,"Day Low":75.75,"VS Average Volume":0.3464860083,"Company Summary":"Textron Inc. operates in the aircraft, defense, industrial, and finance businesses worldwide. It operates in six segments: Textron Aviation, Bell, Textron Systems, Industrial, Textron eAviation, and Finance. The Textron Aviation segment manufactures, sells, and services business jets, turboprop and piston engine aircraft, and military trainer and defense aircraft; and offers maintenance, inspection, and repair services, as well as sells commercial parts. The Bell segment supplies military and commercial helicopters, tiltrotor aircrafts, and related spare parts and services. The Textron Systems segment offers unmanned aircraft systems, electronic systems and solutions, advanced marine crafts, piston aircraft engines, live military air-to-air and air-to-ship training, weapons and related components, and armored and specialty vehicles. The Industrial segment offers blow-molded solutions, including conventional plastic fuel tanks and pressurized fuel tanks for hybrid vehicle applications, clear-vision systems, plastic tanks for catalytic reduction systems, and battery housing systems for use in electric vehicles primarily to automobile original equipment manufacturers (OEMs); and golf cars, off-road utility vehicles, powersports products, light transportation vehicles, aviation ground support equipment, professional turf-maintenance equipment, and turf-care vehicles to golf courses and resorts, government agencies and municipalities, consumers, outdoor enthusiasts, and commercial and industrial users. The Textron eAviation segment manufactures and sells light aircraft and gliders with electric and combustion engines; and provides other research and development initiatives related to sustainable aviation solutions. The Finance segment offers financing services to purchase new and pre-owned aviation aircraft and Bell helicopters. Textron Inc. was founded in 1923 and is headquartered in Providence, Rhode Island.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:40:25"},{"Company Name":"Akamai Technologies, Inc.","Symbol":"AKAM","Current Price":"79.12","Latest MA":"86.94","Latest MA 5":78.137999939,"Latest MA 9":77.4099991184,"Latest MA 20":77.1129992065,"RSI":66.0588337205,"Price Target":100.90652,"Difference from MA":"-9.00%","Difference from Open":"1.47%","Change from Yesterday":"1.19%","Change from Last Report":"-0.42","Latest Volume":"1,315,134","Market Cap":"11,261,624,320","Earning Date":"08-05-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":11.844312,"PB Ratio":2.5211906,"Previous Close":78.19,"ROE":0.09821,"DTE":100.746,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.769,"Trailing PEG":1.0907,"Trailing PE":26.550337,"Trailing PS":26.550337,"Quick Ratio":1.032,"Day High":79.57,"Day Low":77.88,"VS Average Volume":0.5581707446,"Company Summary":"Akamai Technologies, Inc. engages in the provision of security, delivery, and cloud computing solutions in the United States and internationally. The company offers security solutions that include web application and application programming interfaces (API) protection solutions, which protect web, API, and mobile app traffic from attacks; Bot & Abuse portfolio, which provides solutions to help customers protect against threats; Akamai Account Protector, which offers full account lifecycle protections including the ability to defend against account takeover and opening abuse, adversarial bot protection, protection against credential stuffing, inventory scalping, and hoarding; Akamai Content Protector, which provides solutions designed to stop persistent scrapers from stealing content; API security, which discovers, audits, and monitors API; and microservice and application component protection that analyzes and protects application traffic that moves between application components. It also offers cloud computing services, which include compute, storage, networking, database, and container management services; and Akamai App Platform, provides ready-to-run templates that address challenges in deploying, managing and scaling Kubernetes clusters at scale. In addition, the company offers delivery solutions that include web and mobile performance solutions, which enables dynamic websites and applications, as well as global traffic management, site acceleration, application load balancing, large-scale load testing, and real-user monitoring; and media delivery solutions, including video streaming and video player services, game and software delivery, broadcast operations, authoritative domain name system, resolution, and data and analytics. Akamai Technologies, Inc. was incorporated in 1998 and is headquartered in Cambridge, Massachusetts.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:40:25"},{"Company Name":"Hasbro, Inc.","Symbol":"HAS","Current Price":"69.12","Latest MA":"60.30","Latest MA 5":68.1794997559,"Latest MA 9":66.9708336385,"Latest MA 20":66.7935237732,"RSI":75.2482668467,"Price Target":76.34231,"Difference from MA":"14.62%","Difference from Open":"0.23%","Change from Yesterday":"0.11%","Change from Last Report":"0.04","Latest Volume":"980,791","Market Cap":"9,685,365,760","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":15.602145,"PB Ratio":8.278537,"Previous Close":69.04,"ROE":0.39041,"DTE":280.61,"Industry":"Leisure","Sector":"Consumer Cyclical","Beta":0.556,"Trailing PEG":1.7784,"Trailing PE":22.811056,"Trailing PS":22.811056,"Quick Ratio":1.205,"Day High":69.71,"Day Low":68.42,"VS Average Volume":0.461370237,"Company Summary":"Hasbro, Inc., together with its subsidiaries, operates as a toy and game company in the United States, Europe, Canada, Mexico, Latin America, Australia, China, and Hong Kong. The company offers trading cards and collectibles, action figures, arts and crafts and creative play products, dolls, play sets, preschool toys, plush products, vehicles and toy-related specialty products, sports action products and accessories, and other consumer products; and licensed products, such as apparel, publishing products, home goods and electronics, and toy products. It also engages in the sourcing, marketing, and sale of toy and game products; and promotes its brands through the out-licensing of trademarks, characters, and other brand and intellectual property rights to third parties through the sale of branded consumer products, such as toys and apparel. In addition, the company is involved in the promotion of its brands through the development of trading cards, role-playing, and digital game experiences based on Hasbro and Wizards of the Coast games; and license certain brands to other third-party digital game developers who transform Hasbro brand-based characters and other intellectual properties, into digital gaming experiences. Further, it develops and produces of Hasbro-branded entertainment content, including film, television, children's programming, digital content, and live entertainment. The company sells its products to retailers, distributors, wholesalers, discount stores, specialty hobby stores, drug stores, mail order houses, catalog stores, department stores, and other traditional retailers, as well as ecommerce retailers under the MAGIC: THE GATHERING, Hasbro Gaming, PLAY-DOH, TRANSFORMERS, DUNGEONS & DRAGONS, PEPPA PIG, and NERF as well as LUCASFILMS' STAR WARS, BEYBLADE, Final Fantasy, The Lord of the Rings, Fallout, SPIDER-MAN, and THE AVENGERS brands. Hasbro, Inc. was founded in 1923 and is headquartered in Pawtucket, Rhode Island.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:40:25"},{"Company Name":"A.O. Smith Corporation","Symbol":"AOS","Current Price":"63.89","Latest MA":"67.75","Latest MA 5":64.8459992676,"Latest MA 9":64.371110772,"Latest MA 20":66.1380001373,"RSI":38.9300809238,"Price Target":76.17667,"Difference from MA":"-5.70%","Difference from Open":"-1.66%","Change from Yesterday":"-2.35%","Change from Last Report":"-0.37","Latest Volume":"688,368","Market Cap":"9,079,343,104","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":15.697788,"PB Ratio":4.894285,"Previous Close":65.43,"ROE":0.27969998,"DTE":15.945,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":1.213,"Trailing PEG":1.7516,"Trailing PE":17.846369,"Trailing PS":17.846369,"Quick Ratio":0.954,"Day High":65.22,"Day Low":63.81,"VS Average Volume":0.4094764537,"Company Summary":"A. O. Smith Corporation manufactures and markets residential and commercial gas and electric water heaters, boilers, heat pumps, tanks, and water treatment products in North America, China, Europe, and India. The company offers water heaters for residences, restaurants, hotels, office buildings, laundries, car washes, and small businesses; boilers for hospitals, schools, hotels, and other large commercial buildings, as well as homes, apartments, and condominiums; and water treatment products comprising point-of-entry water softeners, well water solutions, and whole-home water filtration products, and point-of-use carbon and reverse osmosis products for residences, restaurants, hotels, and offices. It also provides commercial water treatment and filtration products; expansion tanks, commercial solar water heating systems, swimming pool and spa heaters, and related products and parts; and electric wall-hung, gas tankless, combi-boiler, and heat pump and solar water heaters. The company offers its products under the A. O. Smith, State, Lochinvar, Hague, Water-Right, Master Water, Atlantic Filter, and Water Tec brands. It distributes its products through independent wholesale plumbing distributors, as well as to retail channels consisting of hardware and home center chains, and manufacturer representative firms; and offers Aquasana branded products directly to consumers through e-commerce channels. A. O. Smith Corporation was founded in 1874 and is headquartered in Milwaukee, Wisconsin.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:40:25"}]