[{"Company Name":"SoFi Technologies, Inc.","Symbol":"SOFI","Current Price":"14.87","Latest MA":"9.84","Price Target":12.1,"Difference from MA":"51.14%","Difference from Open":"-3.00%","Change from Yesterday":"-3.01%","Change from Last Report":"-0.40","Latest Volume":"6,812,638","Market Cap":"16,136,179,712","Earning Date":"2025-01-27","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":61.319584,"ROE":0.037249997,"DTE":54.394,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.613,"Trailing PEG":null,"Trailing PE":123.91667,"Trailing PS":6.4052515,"Quick Ratio":0.47,"Day High":15.6189,"Day Low":14.86,"VS Average Volume":0.1276104806,"Company Summary":"SoFi Technologies, Inc. provides various financial services in the United States, Latin America, and Canada. It operates through three segments: Lending, Technology Platform, and Financial Services. The company offers lending and financial services and products that allows its members to borrow, save, spend, invest, and protect money. It offers personal loans, student loans, home loans, and related services. The company also operates Galileo, a technology platform that offers services to financial and non-financial institution; and Technisys, a cloud-native digital and core banking platform with financial services customers. In addition, it provides SoFi Money offers checking and savings accounts, debit cards, and cash management products; and SoFi Invest, a mobile-first investment platform that provides access to trading and advisory solutions, such as investing and robo-advisory. Further, the company offers SoFi Credit Card that provides cash backs on every purchase; Sofi Relay, a personal finance management product that allows to track all of their financial accounts comprising credit score and spending behaviors; SoFi Protect, which offers insurance product; SoFi Travel, an application that manages travel search and booking experience; SoFi At Work provides financial benefits to employees, including student loan payments made on their employees' behalf; Lantern Credit, a financial services marketplace platform for seeking alternative products and provide product comparisons; and other lending as a service that offers pre-qualified borrower referrals and sells loans to third-party partner. The company was founded in 2011 and is based in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"07-01-2025 17:05:15"},{"Company Name":"AT&T Inc.","Symbol":"T","Current Price":"22.57","Latest MA":"20.69","Price Target":25.91885,"Difference from MA":"9.08%","Difference from Open":"0.13%","Change from Yesterday":"-0.13%","Change from Last Report":"-0.02","Latest Volume":"2,997,907","Market Cap":"161,946,288,128","Earning Date":"2025-01-27","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":10.344148,"ROE":0.08759,"DTE":125.151,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.73,"Trailing PEG":1.7395,"Trailing PE":18.349592,"Trailing PS":1.3267761,"Quick Ratio":0.42,"Day High":22.645,"Day Low":22.5,"VS Average Volume":0.0885565601,"Company Summary":"AT&T Inc. provides telecommunications and technology services worldwide. The company operates through two segments, Communications and Latin America. The Communications segment offers wireless voice and data communications services; and sells handsets, wireless data cards, wireless computing devices, carrying cases\/protective covers, and wireless chargers through its own company-owned stores, agents, and third-party retail stores. It also provides Virtual Private Networks, AT&T Dedicated Internet, Ethernet, data services, cloud solutions, outsourcing, and managed professional services, as well as customer premises equipment for multinational corporations, small and mid-sized businesses, governmental, and wholesale customers. In addition, this segment offers broadband services, including fiber connections, legacy telephony voice communication services, and other VoIP services and equipment to residential customers. This segment markets its communications services and products under the AT&T, AT&T Business, Cricket, AT&T PREPAID, and AT&T Fiber brand names. The Latin America segment provides postpaid and prepaid wireless services in Mexico under the AT&T and Unefon brand names, as well as sells smartphones through its owned stores, agents and third-party retail stores. The company was formerly known as SBC Communications Inc. and changed its name to AT&T Inc. in 2005. AT&T Inc. was incorporated in 1983 and is based in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-01-2025 17:05:15"},{"Company Name":"Verizon Communications Inc.","Symbol":"VZ","Current Price":"39.77","Latest MA":"41.26","Price Target":47.49583,"Difference from MA":"-3.60%","Difference from Open":"0.16%","Change from Yesterday":"0.42%","Change from Last Report":"-0.18","Latest Volume":"4,488,734","Market Cap":"167,438,041,088","Earning Date":"2025-01-24","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":8.412399,"ROE":0.10431,"DTE":182.615,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.418,"Trailing PEG":1.0511,"Trailing PE":17.218616,"Trailing PS":1.2473315,"Quick Ratio":0.51,"Day High":39.975,"Day Low":39.54,"VS Average Volume":0.2553855609,"Company Summary":"Verizon Communications Inc., through its subsidiaries, engages in the provision of communications, technology, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide. It operates in two segments, Verizon Consumer Group (Consumer) and Verizon Business Group (Business). The Consumer segment provides wireless services across the wireless networks in the United States under the Verizon and TracFone brands and through wholesale and other arrangements; and fixed wireless access (FWA) broadband through its wireless networks, as well as related equipment and devices, such as smartphones, tablets, smart watches, and other wireless-enabled connected devices. The segment also offers wireline services in the Mid-Atlantic and Northeastern United States, as well as Washington D.C. through its fiber-optic network, Verizon Fios product portfolio, and a copper-based network. The Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and conferencing, corporate networking, security and managed network, local and long-distance voice, and network access services to deliver various IoT services and products to businesses, government customers, and wireless and wireline carriers in the United States and internationally. The company was formerly known as Bell Atlantic Corporation and changed its name to Verizon Communications Inc. in June 2000. Verizon Communications Inc. was incorporated in 1983 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"07-01-2025 17:05:15"},{"Company Name":"Mobileye Global Inc.","Symbol":"MBLY","Current Price":"21.89","Latest MA":"18.12","Price Target":20.22852,"Difference from MA":"20.81%","Difference from Open":"-0.77%","Change from Yesterday":"0.00%","Change from Last Report":"-0.80","Latest Volume":"1,098,890","Market Cap":"17,753,839,616","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":52.0348,"ROE":-0.21936001,"DTE":0.439,"Industry":"Auto Parts","Sector":"Consumer Cyclical","Beta":0.059,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":9.857768,"Quick Ratio":4.215,"Day High":22.51,"Day Low":21.821,"VS Average Volume":0.1650810638,"Company Summary":"Mobileye Global Inc. develops and deploys advanced driver assistance systems (ADAS) and autonomous driving technologies and solutions worldwide. The company operates through Mobileye and Other segments. It offers Driver Assist comprising ADAS and autonomous vehicle solutions that covers safety features, such as real-time detection of road users, geometry, semantics, and markings to provide safety alerts and emergency interventions; Cloud-Enhanced Driver Assist, a solution for drivers with interpretations of a scene in real-time; Mobileye SuperVision Lite, a navigation and assisted driving solution; and Mobileye SuperVision, an operational point-to-point assisted driving navigation solution on various road types and includes cloud-based enhancements, such as road experience management. The company also provides Mobileye Chauffeur, a first-generation solution for eyes-off\/hands-off driving with a human driver still in the driver's seat; Mobileye Drive, a self-driving system comprising of radar and lidar subsystems, as well as collision avoidance systems, including Mobileye 8 Connect for light and medium-duty vehicles, and Mobileye Shield+ for large vehicles. It serves original equipment manufacturers. The company was founded in 1999 and is headquartered in Jerusalem, Israel. Mobileye Global Inc. operates as a subsidiary of Intel Overseas Funding Corporation.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-01-2025 17:05:15"},{"Company Name":"Intel Corporation","Symbol":"INTC","Current Price":"19.96","Latest MA":"24.43","Price Target":24.29882,"Difference from MA":"-18.29%","Difference from Open":"-0.27%","Change from Yesterday":"0.45%","Change from Last Report":"0.13","Latest Volume":"9,554,214","Market Cap":"86,109,044,736","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":20.46307,"ROE":-0.15597,"DTE":47.906,"Industry":"Semiconductors","Sector":"Technology","Beta":1.026,"Trailing PEG":0.5367,"Trailing PE":"N\/A","Trailing PS":1.5873513,"Quick Ratio":0.833,"Day High":20.25,"Day Low":19.905,"VS Average Volume":0.1387346133,"Company Summary":"Intel Corporation designs, develops, manufactures, markets, and sells computing and related products and services worldwide. It operates through Client Computing Group, Data Center and AI, Network and Edge, Mobileye, and Intel Foundry Services segments. The company's products portfolio comprises central processing units and chipsets, system-on-chips (SoCs), and multichip packages; mobile and desktop processors; hardware products comprising graphics processing units (GPUs), domain-specific accelerators, and field programmable gate arrays (FPGAs); and memory and storage, connectivity and networking, and other semiconductor products. It also offers silicon devices and software products; and optimization solutions for workloads, such as AI, cryptography, security, storage, networking, and leverages various features supporting diverse compute environments. In addition, the company develops and deploys advanced driver assistance systems (ADAS), and autonomous driving technologies and solutions; and provides advanced process technologies backed by an ecosystem of IP, EDA, and design services, as well as systems of chips, including advanced packaging technologies, software and accelerate bring-up, and integration of chips and driving standards. Further, it delivers and deploys intelligent edge platforms that allow developers to achieve agility and drive automation using AI for efficient operations with data integrity, as well as provides hardware and software platforms, tools, and ecosystem partnerships for digital transformation from the cloud to edge. The company serves original equipment manufacturers, original design manufacturers, cloud service providers, and other manufacturers and service providers. It has a strategic agreement with Synopsys, Inc. to develop EDA and IP solutions; and ARM that enables chip designers to build optimized compute SoCs on the Intel 18A process. Intel Corporation was incorporated in 1968 and is headquartered in Santa Clara, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"07-01-2025 17:05:15"},{"Company Name":"American Airlines Group, Inc.","Symbol":"AAL","Current Price":"17.64","Latest MA":"12.47","Price Target":18.64682,"Difference from MA":"41.51%","Difference from Open":"0.37%","Change from Yesterday":"0.68%","Change from Last Report":"-0.28","Latest Volume":"4,035,778","Market Cap":"11,595,076,608","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":7.4003706,"ROE":"N\/A","DTE":"N\/A","Industry":"Airlines","Sector":"Industrials","Beta":1.399,"Trailing PEG":0.2133,"Trailing PE":42.011906,"Trailing PS":0.2162736,"Quick Ratio":0.422,"Day High":17.99,"Day Low":17.58,"VS Average Volume":0.1481096358,"Company Summary":"American Airlines Group Inc., through its subsidiaries, operates as a network air carrier. The company provides scheduled air transportation services for passengers and cargo through its hubs in Charlotte, Chicago, Dallas\/Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix, and Washington, D.C., as well as through partner gateways in London, Doha, Madrid, Seattle\/Tacoma, Sydney, and Tokyo. It operates a mainline fleet of 965 aircraft. The company was formerly known as AMR Corporation and changed its name to American Airlines Group Inc. in December 2013. American Airlines Group Inc. was founded in 1926 and is headquartered in Fort Worth, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-01-2025 17:05:15"},{"Company Name":"Freeport-McMoRan, Inc.","Symbol":"FCX","Current Price":"38.48","Latest MA":"45.13","Price Target":51.72667,"Difference from MA":"-14.73%","Difference from Open":"-0.90%","Change from Yesterday":"-0.25%","Change from Last Report":"-0.05","Latest Volume":"2,750,393","Market Cap":"55,293,067,264","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":18.833294,"ROE":0.16870001,"DTE":33.531,"Industry":"Copper","Sector":"Basic Materials","Beta":1.91,"Trailing PEG":10.0884,"Trailing PE":27.884058,"Trailing PS":2.1565158,"Quick Ratio":1.048,"Day High":39.07,"Day Low":38.4058,"VS Average Volume":0.2531898747,"Company Summary":"Freeport-McMoRan Inc. engages in the mining of mineral properties in North America, South America, and Indonesia. It primarily explores for copper, gold, molybdenum, silver, and other metals. The company's assets include the Grasberg minerals district in Indonesia; Morenci, Bagdad, Safford, Sierrita, and Miami in Arizona; Chino and Tyrone in New Mexico; and Henderson and Climax in Colorado, North America, as well as Cerro Verde in Peru and El Abra in Chile. The company was formerly known as Freeport-McMoRan Copper & Gold Inc. and changed its name to Freeport-McMoRan Inc. in July 2014. Freeport-McMoRan Inc. was incorporated in 1987 and is headquartered in Phoenix, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"07-01-2025 17:05:15"},{"Company Name":"CSX Corporation","Symbol":"CSX","Current Price":"32.12","Latest MA":"33.87","Price Target":38.54308,"Difference from MA":"-5.17%","Difference from Open":"0.34%","Change from Yesterday":"0.39%","Change from Last Report":"-0.06","Latest Volume":"1,990,636","Market Cap":"61,940,846,592","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":16.012842,"ROE":0.29458,"DTE":147.913,"Industry":"Railroads","Sector":"Industrials","Beta":1.191,"Trailing PEG":2.0177,"Trailing PE":17.085106,"Trailing PS":4.219116,"Quick Ratio":1.195,"Day High":32.1962,"Day Low":31.96,"VS Average Volume":0.1658069394,"Company Summary":"CSX Corporation, together with its subsidiaries, provides rail-based freight transportation services. The company offers rail services; and transportation of intermodal containers and trailers, as well as other transportation services, such as rail-to-truck transfers and bulk commodity operations. It also transports chemicals, agricultural and food products, minerals, automotive, forest products, fertilizers, and metals and equipment; and coal, coke, and iron ore to electricity-generating power plants, steel manufacturers, and industrial plants, as well as exports coal to deep-water port facilities. In addition, the company provides intermodal services through a network of approximately 30 terminals transporting manufactured consumer goods in containers; and drayage services, including the pickup and delivery of intermodal shipments. It serves the automotive industry with distribution centers and storage locations, as well as connects non-rail served customers through transferring products, such as plastics and ethanol from rail to trucks. The company operates approximately 20,000 route mile rail network, which serves various population centers in 26 states east of the Mississippi River, the District of Columbia, and the Canadian provinces of Ontario and Quebec, as well as owns and leases approximately 3,500 locomotives. It serves production and distribution facilities through track connections. CSX Corporation was incorporated in 1978 and is headquartered in Jacksonville, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"07-01-2025 17:05:15"},{"Company Name":"Robinhood Markets, Inc.","Symbol":"HOOD","Current Price":"40.82","Latest MA":"26.55","Price Target":46.52941,"Difference from MA":"53.74%","Difference from Open":"-3.57%","Change from Yesterday":"-4.40%","Change from Last Report":"-0.35","Latest Volume":"4,089,007","Market Cap":"36,083,900,416","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":29.472073,"ROE":0.07619,"DTE":102.747,"Industry":"Capital Markets","Sector":"Financial Services","Beta":1.839,"Trailing PEG":null,"Trailing PE":70.37931,"Trailing PS":14.985008,"Quick Ratio":0.547,"Day High":43.1876,"Day Low":40.8,"VS Average Volume":0.1840577374,"Company Summary":"Robinhood Markets, Inc. operates financial services platform in the United States. Its platform allows users to invest in stocks, exchange-traded funds (ETFs), American depository receipts, options, gold, and cryptocurrencies. The company offers fractional trading, recurring investments, fully-paid securities lending, access to investing on margin, cash sweep, instant withdrawals, retirement program, around-the-clock trading, and initial public offerings participation services. It also provides various learning and education solutions comprise Snacks, an accessible digest of business news stories for a new generation of investors.; Learn, which is an online collection of beginners' guides, feature tutorials, and financial dictionary; Newsfeeds that offer access to free, premium news from sites from various sites, such as Barron's, Reuters, and Dow Jones. In addition, the company offers In-App Education, a resource that covers investing fundamentals, including why people invest, a stock market overview, and tips on how to define investing goals, as well as allows customers to understand the basics of investing before their first trade; and Crypto Learn and Earn, an educational module available to various crypto customers through Robinhood Learn to teach customers the basics related to cryptocurrency. Further, it provides Robinhood credit cards, cash card and spending accounts, and wallets. Robinhood Markets, Inc. was incorporated in 2013 and is headquartered in Menlo Park, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-01-2025 17:05:15"},{"Company Name":"Procter & Gamble Company (The)","Symbol":"PG","Current Price":"162.33","Latest MA":"168.68","Price Target":180.99692,"Difference from MA":"-3.76%","Difference from Open":"0.54%","Change from Yesterday":"1.08%","Change from Last Report":"0.00","Latest Volume":"1,013,567","Market Cap":"382,303,305,728","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":21.903652,"ROE":0.28766,"DTE":69.338,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":0.414,"Trailing PEG":3.396,"Trailing PE":27.988638,"Trailing PS":4.5563827,"Quick Ratio":0.507,"Day High":162.61,"Day Low":161.257,"VS Average Volume":0.1497367039,"Company Summary":"The Procter & Gamble Company engages in the provision of branded consumer packaged goods worldwide. The company operates through five segments: Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care. The Beauty segment offers conditioners, shampoos, styling aids, and treatments under the Head & Shoulders, Herbal Essences, Pantene, and Rejoice brands; and antiperspirants and deodorants, personal cleansing, and skin care products under the Olay, Old Spice, Safeguard, Secret, SK-II, and Native brands. The Grooming segment provides blades and razors, shave products, appliances, and other grooming products under the Braun, Gillette, and Venus brand names. The Health Care segment offers toothbrushes, toothpastes, and other oral care products under the Crest and Oral-B brand names; and gastrointestinal, pain relief, rapid diagnostics, respiratory, vitamins\/minerals\/supplements, and other personal health care products under Metamucil, Neurobion, Pepto-Bismol, and Vicks brands. The Fabric & Home Care segment provides fabric enhancers, laundry additives, and laundry detergents under the Ariel, Downy, Gain, and Tide brands; and air care, dish care, P&G professional, and surface care products under the Cascade, Dawn, Fairy, Febreze, Mr. Clean, and Swiffer brands. The Baby, Feminine & Family Care segment offers baby wipes, and taped diapers and pants under the Luvs and Pampers brands; adult incontinence and feminine care products under the Always, Always Discreet, and Tampax brands; and paper towels, tissues, and toilet papers under the Bounty, Charmin, and Puffs brands. It sells its products primarily through mass merchandisers, e-commerce, grocery stores, membership club stores, drug stores, department stores, distributors, wholesalers, specialty beauty stores, high-frequency stores, pharmacies, electronics stores, and professional channels, as well as directly to consumers. The company was founded in 1837 and is headquartered in Cincinnati, Ohio.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"07-01-2025 17:05:15"},{"Company Name":"Abbott Laboratories","Symbol":"ABT","Current Price":"114.39","Latest MA":"111.31","Price Target":130.53792,"Difference from MA":"2.77%","Difference from Open":"0.90%","Change from Yesterday":"1.22%","Change from Last Report":"-0.01","Latest Volume":"1,412,852","Market Cap":"198,404,882,432","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":22.192776,"ROE":0.14840001,"DTE":37.589,"Industry":"Medical Devices","Sector":"Healthcare","Beta":0.722,"Trailing PEG":2.1907,"Trailing PE":34.768997,"Trailing PS":4.8136663,"Quick Ratio":0.996,"Day High":114.51,"Day Low":113.17,"VS Average Volume":0.2812492597,"Company Summary":"Abbott Laboratories, together with its subsidiaries, discovers, develops, manufactures, and sells health care products worldwide. It operates in four segments: Established Pharmaceutical Products, Diagnostic Products, Nutritional Products, and Medical Devices. The company provides generic pharmaceuticals for the treatment of pancreatic exocrine insufficiency, irritable bowel syndrome or biliary spasm, intrahepatic cholestasis or depressive symptoms, gynecological disorder, hormone replacement therapy, dyslipidemia, hypertension, hypothyroidism, Ménière's disease and vestibular vertigo, pain, fever, inflammation, and migraine, as well as provides anti-infective clarithromycin, influenza vaccine, and products to regulate physiological rhythm of the colon. It also offers laboratory and transfusion medicine systems in the areas of immunoassay, clinical chemistry, hematology, and transfusion; molecular diagnostics polymerase chain reaction instrument systems that automate the extraction, purification, and preparation of DNA and RNA from patient samples, and detect and measure infectious agents; point of care systems; cartridges for testing blood gas, chemistry, electrolytes, coagulation, and immunoassay; rapid diagnostics lateral flow testing products; molecular point-of-care testing for HIV, SARS-CoV-2, influenza A and B, RSV, and strep A; cardiometabolic test systems; drug and alcohol test, and remote patient monitoring and consumer self-test systems; and informatics and automation solutions for laboratories. In addition, the company provides pediatric and adult nutritional products; rhythm management, electrophysiology, heart failure, vascular, and structural heart devices for the treatment of cardiovascular diseases; diabetes care products, such as glucose and blood glucose monitoring systems; and neuromodulation devices for the management of chronic pain and movement disorders. Abbott Laboratories was founded in 1888 and is based in North Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-01-2025 17:05:15"},{"Company Name":"Lam Research Corporation","Symbol":"LRCX","Current Price":"78.36","Latest MA":"83.31","Price Target":92.82013,"Difference from MA":"-5.94%","Difference from Open":"-0.63%","Change from Yesterday":"0.49%","Change from Last Report":"-0.19","Latest Volume":"1,887,681","Market Cap":"100,825,030,656","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":18.791231,"ROE":0.49116,"DTE":58.827,"Industry":"Semiconductor Equipment & Materials","Sector":"Technology","Beta":1.486,"Trailing PEG":1.499,"Trailing PE":25.359224,"Trailing PS":6.466749,"Quick Ratio":1.685,"Day High":80.13,"Day Low":78.35,"VS Average Volume":0.1567088795,"Company Summary":"Lam Research Corporation designs, manufactures, markets, refurbishes, and services semiconductor processing equipment used in the fabrication of integrated circuits. The company offers ALTUS systems to deposit conformal films for tungsten metallization applications; SABRE electrochemical deposition products for copper interconnect transition that offers copper damascene manufacturing; and VECTOR plasma-enhanced CVD products. It also provides SPEED gapfill high-density plasma chemical vapor deposition products; and Striker single-wafer atomic layer deposition products for dielectric film solutions. In addition, the company offers Flex for dielectric etch applications; Vantex, a dielectric etch system that provides RF technology and repeatable wafer-to-wafer performance enabled by Equipment Intelligence solutions; Kiyo for conductor etch applications; Syndion for through-silicon via etch applications; and Versys metal products for metal etch processes. Further, it provides Coronus bevel clean products to enhance die yield; and Da Vinci, DV-Prime, EOS, and SP series products to address various wafer cleaning applications. The company sells its products in the United States, China, Europe, Japan, Korea, Southeast Asia, and Taiwan. Lam Research Corporation was incorporated in 1980 and is headquartered in Fremont, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"07-01-2025 17:05:15"},{"Company Name":"Charles Schwab Corporation (The","Symbol":"SCHW","Current Price":"72.59","Latest MA":"70.49","Price Target":84.61905,"Difference from MA":"2.98%","Difference from Open":"-3.19%","Change from Yesterday":"-2.43%","Change from Last Report":"0.41","Latest Volume":"2,281,398","Market Cap":"132,880,343,040","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":18.353657,"ROE":0.12111,"DTE":144.242,"Industry":"Capital Markets","Sector":"Financial Services","Beta":0.952,"Trailing PEG":0.9567,"Trailing PE":28.355469,"Trailing PS":7.092247,"Quick Ratio":0.481,"Day High":75.029,"Day Low":71.46,"VS Average Volume":0.291199188,"Company Summary":"The Charles Schwab Corporation, together with its subsidiaries, operates as a savings and loan holding company that provides wealth management, securities brokerage, banking, asset management, custody, and financial advisory services in the United States and internationally. The company operates in two segments, Investor Services and Advisor Services. It offers brokerage accounts with equity and fixed income trading, margin lending, options trading, futures and forex trading, and cash management capabilities, including certificates of deposit; third-party mutual funds through the Mutual Fund Marketplace and Mutual Fund OneSource service, as well as mutual fund trading and clearing services to broker-dealers; exchange-traded funds; advisory solutions for managed portfolios, separately managed accounts, customized personal advice for tailored portfolios, specialized planning, and full-time portfolio management; banking products comprising checking and savings accounts, first lien residential real estate mortgage loans, home equity lines of credit, and pledged asset lines; and trust custody services, personal trust reporting services, and administrative trustee services. It also provides digital retirement calculators; integrated web-, mobile-, and software-based trading platforms, real-time market data, options trading, premium research, and multi-channel access; self-service education and support tools; online research and analysis tools; equity compensation plan sponsors full-service recordkeeping for stock plans, stock options, restricted stock, performance shares, and stock appreciation rights; retirement plan services; mutual fund clearing services; and advisor services, including interactive tools and educational content. The Company operates through branch offices. The Charles Schwab Corporation was founded in 1971 and is headquartered in Westlake, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-01-2025 17:05:15"},{"Company Name":"Huntington Bancshares Incorpora","Symbol":"HBAN","Current Price":"16.44","Latest MA":"14.84","Price Target":18.5855,"Difference from MA":"10.77%","Difference from Open":"-1.31%","Change from Yesterday":"-0.48%","Change from Last Report":"0.00","Latest Volume":"1,214,837","Market Cap":"23,887,101,952","Earning Date":"2025-01-17","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":12.183229,"ROE":0.08545,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.057,"Trailing PEG":2.806,"Trailing PE":15.963107,"Trailing PS":3.5705683,"Quick Ratio":"N\/A","Day High":16.765,"Day Low":16.4403,"VS Average Volume":0.0844883419,"Company Summary":"Huntington Bancshares Incorporated operates as the bank holding company for The Huntington National Bank that provides commercial, consumer, and mortgage banking services in the United States. The company offers financial products and services to consumer and business customers, including deposits, lending, payments, mortgage banking, dealer financing, investment management, trust, brokerage, insurance, and other financial products and services. It also provides 24-hour grace, asterisk-free checking, money scout, $50 safety zone, standby cash, early pay, instant access, savings goal getter, and Huntington heads up; digitally powered consumer and business financial solutions to consumer lending, regional banking, branch banking, and wealth management customers; direct and indirect consumer loans, as well as dealer finance loans and deposits; and private banking, wealth management and legacy planning through investment and portfolio management, fiduciary administration and trust, institutional custody, and full-service retail brokerage investment services. The company offers equipment financing, asset-based lending, distribution finance, structured lending, and municipal financing solutions, as well as Huntington ChoicePay. In addition, it offers lending, liquidity, treasury management and other payment services, and capital markets; government and non-profits, healthcare, technology and telecommunications, franchises, financial sponsors, and global services; and corporate risk management, institutional sales and trading, debt and equity issuance, and additional advisory services. The company offers its products through a network of channels, including branches and ATMs, online and mobile banking, and through customer call centers to customers in middle market banking, corporate, specialty, and government banking, asset finance, commercial real estate banking, and capital markets. The company was founded in 1866 and is headquartered in Columbus, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-01-2025 17:05:15"},{"Company Name":"Bank of America Corporation","Symbol":"BAC","Current Price":"45.90","Latest MA":"41.51","Price Target":50.93773,"Difference from MA":"10.58%","Difference from Open":"-0.82%","Change from Yesterday":"1.15%","Change from Last Report":"0.13","Latest Volume":"7,276,177","Market Cap":"352,185,221,120","Earning Date":"2025-01-16","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":12.381246,"ROE":0.08092,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.325,"Trailing PEG":2.0115,"Trailing PE":16.630436,"Trailing PS":3.7218654,"Quick Ratio":"N\/A","Day High":46.65,"Day Low":45.805,"VS Average Volume":0.2154467729,"Company Summary":"Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. It operates in four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, non-interest and interest-bearing checking accounts, and investment accounts and products; credit and debit cards; residential mortgages, and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research, and certain market-based services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-01-2025 17:05:15"},{"Company Name":"Wells Fargo & Company","Symbol":"WFC","Current Price":"72.12","Latest MA":"61.75","Price Target":76.34435,"Difference from MA":"16.79%","Difference from Open":"-1.17%","Change from Yesterday":"0.12%","Change from Last Report":"0.07","Latest Volume":"1,698,328","Market Cap":"240,122,822,656","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":12.946147,"ROE":0.099139996,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.136,"Trailing PEG":3.358,"Trailing PE":14.993764,"Trailing PS":3.083439,"Quick Ratio":"N\/A","Day High":73.12,"Day Low":71.96,"VS Average Volume":0.0982086853,"Company Summary":"Wells Fargo & Company, a financial services company, provides diversified banking, investment, mortgage, and consumer and commercial finance products and services in the United States and internationally. The company operates through four segments: Consumer Banking and Lending; Commercial Banking; Corporate and Investment Banking; and Wealth and Investment Management. The Consumer Banking and Lending segment offers diversified financial products and services for consumers and small businesses. Its financial products and services include checking and savings accounts, and credit and debit cards, as well as home, auto, personal, and small business lending services. The Commercial Banking segment provides financial solutions to private, family owned, and certain public companies. Its products and services include banking and credit products across various industry sectors and municipalities, secured lending and lease products, and treasury management services. The Corporate and Investment Banking segment offers a suite of capital markets, banking, and financial products and services, such as corporate banking, investment banking, treasury management, commercial real estate lending and servicing, equity, and fixed income solutions, as well as sales, trading, and research capabilities services to corporate, commercial real estate, government, and institutional clients. The Wealth and Investment Management segment provides personalized wealth management, brokerage, financial planning, lending, private banking, and trust and fiduciary products and services to affluent, high-net worth, and ultra-high-net worth clients. It also operates through financial advisors in brokerage and wealth offices, consumer bank branches, independent offices, and digitally through WellsTrade and Intuitive Investor. The company was founded in 1852 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-01-2025 17:05:15"},{"Company Name":"Citigroup, Inc.","Symbol":"C","Current Price":"72.93","Latest MA":"63.81","Price Target":83.0855,"Difference from MA":"14.28%","Difference from Open":"-1.31%","Change from Yesterday":"0.29%","Change from Last Report":"-0.26","Latest Volume":"2,738,035","Market Cap":"137,929,588,736","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":9.938797,"ROE":0.03874,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.426,"Trailing PEG":0.7067,"Trailing PE":20.777779,"Trailing PS":1.9900962,"Quick Ratio":"N\/A","Day High":74.21,"Day Low":72.905,"VS Average Volume":0.2010192382,"Company Summary":"Citigroup Inc., a diversified financial service holding company, provides various financial product and services to consumers, corporations, governments, and institutions worldwide. It operates through five segments: Services, Markets, Banking, U.S. Personal Banking, and Wealth. The Services segment includes Treasury and Trade Solutions, which provides cash management, trade, and working capital solutions to multinational corporations, financial institutions, and public sector organizations; and Securities Services, such as cross-border support for clients, local market expertise, post-trade technologies, data solutions, and various securities services solutions. The Markets segment offers sales and trading services for equities, foreign exchange, rates, spread products, and commodities to corporate, institutional, and public sector clients; and market-making services, including asset classes, risk management solutions, financing, prime brokerage, research, securities clearing, and settlement. The banking segment includes investment banking; advisory services related to mergers and acquisitions, divestitures, restructurings, and corporate defense activities; and corporate lending, which includes corporate and commercial banking. The U.S. Personal Banking segment provides co-branded cards and retail banking services. The Wealth segment provides financial services to high-net-worth clients through banking, lending, mortgages, investment, custody, and trust product offerings; and to professional industries, including law firms, consulting groups, accounting, and asset management. The company was founded in 1812 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-01-2025 17:05:15"},{"Company Name":"The Bank of New York Mellon Cor","Symbol":"BK","Current Price":"77.30","Latest MA":"69.84","Price Target":85.60688,"Difference from MA":"10.68%","Difference from Open":"-1.06%","Change from Yesterday":"-0.80%","Change from Last Report":"-0.31","Latest Volume":"1,103,940","Market Cap":"56,203,132,928","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":11.655521,"ROE":0.08563,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.06,"Trailing PEG":0.7032,"Trailing PE":17.293066,"Trailing PS":3.157302,"Quick Ratio":"N\/A","Day High":78.47,"Day Low":77.3,"VS Average Volume":0.2907945867,"Company Summary":"The Bank of New York Mellon Corporation provides a range of financial products and services in the United States and internationally. The company operates through Securities Services, Market and Wealth Services, Investment and Wealth Management, and other segments. The Securities Services segment offers custody, trust and depositary, accounting, exchange-traded funds, middle-office solutions, transfer agency, services for private equity and real estate funds, foreign exchange, securities lending, liquidity\/lending services, and data analytics. This segment also provides trustee, paying agency, fiduciary, escrow and other financial, issuer, and support services for brokers and investors. The Market and Wealth Services segment offers clearing and custody, investment, wealth and retirement solutions, technology and enterprise data management, trading, and prime brokerage services. This segment also provides integrated cash management solutions, including payments, foreign exchange, liquidity management, receivables processing and payables management, and trade finance and processing services. The Investment and Wealth Management segment offers investment management strategies and distribution of investment products, investment management, custody, wealth and estate planning, private banking, investment, and information management services. The Other segment engages in the provision of leasing, corporate treasury, derivative and other trading, corporate and bank-owned life insurance, renewable energy investment, and business exit services. It serves central banks and sovereigns, financial institutions, asset managers, insurance companies, corporations, local authorities and high net-worth individuals, and family offices. The Bank of New York Mellon Corporation was founded in 1784 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-01-2025 17:05:15"},{"Company Name":"JP Morgan Chase & Co.","Symbol":"JPM","Current Price":"241.44","Latest MA":"217.37","Price Target":252.706,"Difference from MA":"11.07%","Difference from Open":"-0.29%","Change from Yesterday":"0.30%","Change from Last Report":"0.00","Latest Volume":"1,037,133","Market Cap":"679,735,721,984","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":13.912049,"ROE":0.16216,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.091,"Trailing PEG":4.7505,"Trailing PE":13.42079,"Trailing PS":4.1920695,"Quick Ratio":"N\/A","Day High":243.79,"Day Low":240.96,"VS Average Volume":0.1193986946,"Company Summary":"JPMorgan Chase & Co. operates as a financial services company worldwide. It operates through three segments: Consumer & Community Banking, Commercial & Investment Bank, and Asset & Wealth Management. It offers deposit, investment and lending products, cash management, and payments and services; mortgage origination and servicing activities; residential mortgages and home equity loans; and credit cards, auto loans, leases, and travel services to consumers and small businesses through bank branches, ATMs, and digital and telephone banking. The company also provides investment banking products and services, including corporate strategy and structure advisory, and equity and debt market capital-raising services, as well as loan origination and syndication; payments; and cash and derivative instruments, risk management solutions, prime brokerage, and research, as well as offers securities services, including custody, fund accounting and administration, and securities lending products for asset managers, insurance companies, and public and private investment funds. In addition, it provides financial solutions, including lending, payments, investment banking, and asset management to small and midsized companies, local governments, nonprofit clients, and large corporations, as well as investors, developers, and owners of multifamily, office, retail, industrial, and affordable housing properties. Further, the company offers multi-asset investment management solutions in equities, fixed income, alternatives, and money market funds to institutional clients and retail investors; and retirement products and services, brokerage, custody, estate planning, lending, deposits, and investment management products to high net worth clients. JPMorgan Chase & Co. was founded in 1799 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-01-2025 17:05:15"},{"Company Name":"Delta Air Lines, Inc.","Symbol":"DAL","Current Price":"60.18","Latest MA":"51.20","Price Target":76.01909,"Difference from MA":"17.55%","Difference from Open":"-0.20%","Change from Yesterday":"0.29%","Change from Last Report":"-0.51","Latest Volume":"1,362,685","Market Cap":"38,833,012,736","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.105421,"ROE":0.4067,"DTE":186.78,"Industry":"Airlines","Sector":"Industrials","Beta":1.341,"Trailing PEG":null,"Trailing PE":8.346741,"Trailing PS":0.64392215,"Quick Ratio":0.268,"Day High":61.16,"Day Low":60.165,"VS Average Volume":0.1701197643,"Company Summary":"Delta Air Lines, Inc. provides scheduled air transportation for passengers and cargo in the United States and internationally. The company operates through two segments, Airline and Refinery. Its domestic network centered on core hubs in Atlanta, Minneapolis-St. Paul, Detroit, and Salt Lake City, as well as coastal hub positions in Boston, Los Angeles, New York-LaGuardia, New York-JFK, and Seattle; and international network centered on hubs and market presence in Amsterdam, Bogota, Lima, Mexico City, London-Heathrow, Paris-Charles de Gaulle, Sao Paulo, Seoul-Incheon, and Tokyo. The company sells its tickets through various distribution channels, including delta.com and the Fly Delta app; acts as a reservations specialists; and operates online travel and traditional brick and mortar agencies. It also provides aircraft maintenance and engineering support, repair, and overhaul services; and vacation packages to third-party consumers. The company operates through a fleet of approximately 1,273 aircrafts. Delta Air Lines, Inc. was founded in 1924 and is based in Atlanta, Georgia.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"07-01-2025 17:05:15"},{"Company Name":"Walgreens Boots Alliance, Inc.","Symbol":"WBA","Current Price":"9.85","Latest MA":"10.34","Price Target":10.35714,"Difference from MA":"-4.78%","Difference from Open":"2.82%","Change from Yesterday":"4.01%","Change from Last Report":"-0.45","Latest Volume":"4,972,806","Market Cap":"8,505,529,344","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":6.142822,"ROE":-0.75969005,"DTE":277.898,"Industry":"Pharmaceutical Retailers","Sector":"Healthcare","Beta":0.669,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.057602905,"Quick Ratio":0.332,"Day High":10.1,"Day Low":9.55,"VS Average Volume":0.211203453,"Company Summary":"Walgreens Boots Alliance, Inc. operates as a healthcare, pharmacy, and retail company in the United States, Germany, the United Kingdom, and internationally. It operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The U.S. Retail Pharmacy segment engages in operation of the retail drugstores, health and wellness services, specialty, and home delivery pharmacy services, which offers health and wellness, beauty, personal care and consumables, and general merchandise. The International segment offers sale of prescription drugs and health and wellness, beauty, personal care, and other consumer products outside the United States; and operates pharmacy-led health and beauty retail businesses under the Boots brand stores in the United Kingdom, the Republic of Ireland, and Thailand, as well as the Benavides brand in Mexico and the Ahumada brand in Chile. The U.S. Healthcare segment provides VillageMD, a national provider of value-based care with primary, multi-specialty, and urgent care providers serving patients in traditional clinic settings, in patients' homes and online appointments; Shields, a specialty pharmacy integrator and accelerator for hospitals; and CareCentrix, a participant in the post-acute and home care management sectors. Walgreens Boots Alliance, Inc. was founded in 1909 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"07-01-2025 17:05:15"}]