[{"Company Name":"Carnival Corporation","Symbol":"CCL","Current Price":"24.91","Latest MA":"19.57","Price Target":29.23682,"Difference from MA":"27.27%","Difference from Open":"1.51%","Change from Yesterday":"-0.64%","Change from Last Report":"-0.24","Latest Volume":"5,961,601","Market Cap":"32,582,279,168","Earning Date":"2024-12-20","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":12.776651,"ROE":0.20120001,"DTE":352.355,"Industry":"Travel Services","Sector":"Consumer Cyclical","Beta":2.668,"Trailing PEG":null,"Trailing PE":17.29861,"Trailing PS":1.3310298,"Quick Ratio":0.202,"Day High":25.04,"Day Low":24.32,"VS Average Volume":0.2465793409,"Company Summary":"Carnival Corporation & plc engages in the provision of leisure travel services in North America, Australia, Europe, Asia, and internationally. The company operates through four segments: NAA Cruise Operations, Europe Cruise Operations, Cruise Support, and Tour and Other. It operates port destinations, private islands, and a solar park, as well as owns and operates hotels, lodges, glass-domed railcars, and motor coaches. The company offers its services under the Carnival Cruise Line, Princess Cruises, Holland America Line, Seabourn, Costa Cruises, AIDA Cruises, P&O Cruises, and Cunard brand. Additionally, it sells its cruises primarily through travel agents, tour operators, vacation planners, and websites. Carnival Corporation & plc was founded in 1972 and is headquartered in Miami, Florida.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-12-2024 18:23:56"},{"Company Name":"Nike, Inc.","Symbol":"NKE","Current Price":"74.83","Latest MA":"80.87","Price Target":86.47971,"Difference from MA":"-7.47%","Difference from Open":"-1.02%","Change from Yesterday":"-2.08%","Change from Last Report":"-0.01","Latest Volume":"2,870,513","Market Cap":"111,384,453,120","Earning Date":"2024-12-19","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":28.59993,"ROE":0.3798,"DTE":86.962,"Industry":"Footwear & Accessories","Sector":"Consumer Cyclical","Beta":1.035,"Trailing PEG":3.9808,"Trailing PE":23.09568,"Trailing PS":2.2271545,"Quick Ratio":1.417,"Day High":75.77,"Day Low":74.55,"VS Average Volume":0.2425244429,"Company Summary":"NIKE, Inc., together with its subsidiaries, engages in the design, development, marketing, and sale of athletic footwear, apparel, equipment, accessories, and services worldwide. The company provides athletic and casual footwear, apparel, and accessories under the NIKE, Jumpman, Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks. It also sells a line of performance equipment and accessories comprising bags, sport balls, socks, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities under the NIKE brand; and various plastic products to other manufacturers. In addition, the company markets apparel with licensed college and professional team, and league logos, as well as sells sports apparel; licenses unaffiliated parties to manufacture and sell apparel, digital devices, and applications and other equipment for sports activities under NIKE-owned trademarks; and operates digital platforms, including fitness and activity apps; sport, fitness, and wellness content; and digital services and features in retail stores. It sells its products to footwear stores; sporting goods stores; athletic specialty stores; department stores; skate, tennis, and golf shops; and other retail accounts through NIKE-owned retail stores, digital platforms, independent distributors, licensees, and sales representatives. The company was founded in 1964 and is headquartered in Beaverton, Oregon.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-12-2024 18:23:56"},{"Company Name":"Micron Technology, Inc.","Symbol":"MU","Current Price":"85.73","Latest MA":"108.34","Price Target":131.7403,"Difference from MA":"-20.86%","Difference from Open":"-1.37%","Change from Yesterday":"-3.27%","Change from Last Report":"-0.23","Latest Volume":"10,098,364","Market Cap":"95,523,364,864","Earning Date":"2024-12-18","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":9.006354,"ROE":0.01743,"DTE":31.194,"Industry":"Semiconductors","Sector":"Technology","Beta":1.179,"Trailing PEG":0.2252,"Trailing PE":24.565903,"Trailing PS":3.8040447,"Quick Ratio":1.592,"Day High":87.05,"Day Low":84.58,"VS Average Volume":0.4814863307,"Company Summary":"Micron Technology, Inc. designs, develops, manufactures, and sells memory and storage products in the United States, Taiwan, Mainland China, rest of the Asia Pacific, Hong Kong, Japan, Europe, and internationally. The company operates through four segments: Compute and Networking Business Unit, Mobile Business Unit, Embedded Business Unit, and Storage Business Unit. It provides memory and storage technologies comprising dynamic random access memory semiconductor devices with low latency that provide high-speed data retrieval; non-volatile and re-writeable semiconductor storage devices; and non-volatile re-writable semiconductor memory devices that provide fast read speeds under the Micron and Crucial brands, as well as through private labels. The company offers serves the data center, PC, graphics, networking, automotive, industrial, and consumer embedded markets, as well as for smartphone and other mobile-device markets. It markets its products through its direct sales force, independent sales representatives, distributors, and retailers; and web-based customer direct sales channel, as well as through channel and distribution partners. Micron Technology, Inc. was founded in 1978 and is headquartered in Boise, Idaho.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-12-2024 18:23:56"},{"Company Name":"QUALCOMM Incorporated","Symbol":"QCOM","Current Price":"154.58","Latest MA":"176.21","Price Target":204.70387,"Difference from MA":"-12.28%","Difference from Open":"-0.42%","Change from Yesterday":"-1.70%","Change from Last Report":"-0.08","Latest Volume":"1,199,044","Market Cap":"171,738,398,720","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":14.853679,"ROE":0.42253,"DTE":58.765,"Industry":"Semiconductors","Sector":"Technology","Beta":1.286,"Trailing PEG":1.553,"Trailing PE":17.27151,"Trailing PS":4.4078436,"Quick Ratio":1.64,"Day High":155.61,"Day Low":153.815,"VS Average Volume":0.1481581614,"Company Summary":"QUALCOMM Incorporated engages in the development and commercialization of foundational technologies for the wireless industry worldwide. It operates through three segments: Qualcomm CDMA Technologies (QCT); Qualcomm Technology Licensing (QTL); and Qualcomm Strategic Initiatives (QSI). The QCT segment develops and supplies integrated circuits and system software with advanced connectivity and high-performance, and low-power computing technologies for use in mobile devices; automotive systems for connectivity, digital cockpit, and ADAS\/AD; and IoT, including consumer electronic devices, industrial devices, and edge networking products. The QTL segment grants licenses or provides rights to use portions of its intellectual property portfolio, which include various patent rights useful in the manufacture and sale of wireless products comprising products implementing CDMA2000, WCDMA, LTE and\/or OFDMA-based 5G products. The QSI segment invests in early-stage companies in various industries, including 5G, artificial intelligence, automotive, consumer, enterprise, cloud, IoT, and extended reality, and investments, including non-marketable equity securities and, to a lesser extent, marketable equity securities, and convertible debt instruments. It also provides development, and other services and sells related products to the United States government agencies and their contractors. The company was incorporated in 1985 and is headquartered in San Diego, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-12-2024 18:23:56"}]