[{"Company Name":"DraftKings Inc.","Symbol":"DKNG","Current Price":"45.59","Latest MA":"38.52","Price Target":51.84286,"Difference from MA":"18.37%","Difference from Open":"1.32%","Change from Yesterday":"0.34%","Change from Last Report":"-0.01","Latest Volume":"1,488,274","Market Cap":"22,233,399,296","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":33.40538,"PB Ratio":20.64056,"Previous Close":45.44,"ROE":-0.44426,"DTE":124.782,"Industry":"Gambling","Sector":"Consumer Cyclical","Beta":1.819,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":4.8272777,"Quick Ratio":0.572,"Day High":45.84,"Day Low":44.845,"VS Average Volume":0.1954655097,"Company Summary":"DraftKings Inc. operates as a digital sports entertainment and gaming company in the United States and internationally. It provides online sports betting and casino, daily fantasy sports, media, and other consumer products, as well as retails sportsbooks. The company also engages in the design and development of sports betting and casino gaming software for online and retail sportsbooks, and iGaming operators. In addition, it offers DraftKings marketplace, a digital collectibles ecosystem designed for mainstream accessibility that offers curated NFT drops and supports secondary-market transactions. The company was founded in 2012 and is headquartered in Boston, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"GE HealthCare Technologies Inc.","Symbol":"GEHC","Current Price":"91.52","Latest MA":"85.12","Price Target":96.507,"Difference from MA":"7.52%","Difference from Open":"1.69%","Change from Yesterday":"6.54%","Change from Last Report":"0.27","Latest Volume":"1,406,674","Market Cap":"41,813,016,576","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":17.559847,"PB Ratio":5.02719,"Previous Close":85.9,"ROE":0.21853,"DTE":126.093,"Industry":"Health Information Services","Sector":"Healthcare","Beta":"N\/A","Trailing PEG":2.2684,"Trailing PE":25.07397,"Trailing PS":2.137789,"Quick Ratio":0.883,"Day High":93.05,"Day Low":89.64,"VS Average Volume":0.4834109021,"Company Summary":"GE HealthCare Technologies Inc. engages in the development, manufacture, and marketing of products, services, and complementary digital solutions used in the diagnosis, treatment, and monitoring of patients in the United States, Canada, and internationally. The company operates through four segments: Imaging, Ultrasound, Patient Care Solutions, and Pharmaceutical Diagnostics. The Imaging segment offers molecular imaging, computed tomography (CT) scanning, magnetic resonance (MR) imaging, image-guided therapy, X-ray systems, and women's health products. The Ultrasound segment provides medical devices and solutions for screening, diagnosis, treatment, and monitoring of certain diseases in clinical areas, such as radiology and primary care, women's health, cardiovascular, and point of care and handheld ultrasound solutions, as well as surgical visualization and guidance products. The Patient Care Solutions segment provides medical devices, consumables, services, and digital solutions. Its portfolio includes patient monitoring solutions, anesthesia delivery and respiratory care products, electrocardiogram solutions, maternal infant care products, and consumables and services. The Pharmaceutical Diagnostics supplies diagnostic agents, including CT, angiography and X-ray, MR, single-photon emission computed tomography, positron emission tomography, and ultrasound to the radiology and nuclear medicine industry. The segment also provides contrast media pharmaceuticals that are administered to a patient prior to certain diagnostic scans to increase the visibility of tissues or structures during imaging exams; and molecular imaging agents or radiopharmaceuticals, which are molecular tracers labeled with radioisotopes. It has an AI collaboration with Mass General Brigham. The company was formerly known as GE Healthcare Holding LLC and changed its name to GE HealthCare Technologies Inc. in December 2022. The company was incorporated in 2022 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"Crocs, Inc.","Symbol":"CROX","Current Price":"104.49","Latest MA":"120.91","Price Target":129.66643,"Difference from MA":"-13.58%","Difference from Open":"-5.57%","Change from Yesterday":"17.36%","Change from Last Report":"-0.37","Latest Volume":"2,311,934","Market Cap":"6,089,907,200","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":8.1036,"PB Ratio":3.542274,"Previous Close":88.83,"ROE":0.57069,"DTE":102.834,"Industry":"Footwear & Accessories","Sector":"Consumer Cyclical","Beta":2.017,"Trailing PEG":null,"Trailing PE":7.5937495,"Trailing PS":1.495398,"Quick Ratio":0.826,"Day High":110.8,"Day Low":103.65,"VS Average Volume":1.6618929012,"Company Summary":"Crocs, Inc., together with its subsidiaries, designs, develops, manufactures, markets, distributes, and sells casual lifestyle footwear and accessories for men, women, and children under Crocs and HEYDUDE Brand in the United States and internationally. The company offers various footwear products, including clogs, sandals, slides, flips, wedges, platforms, socks, boots, charms, flip flops, sneakers, and slippers. It sells its products through wholesalers, retail stores, e-commerce sites, third-party marketplaces, and kiosks\/store-in-store locations. Crocs, Inc. was founded in 1999 and is headquartered in Broomfield, Colorado.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"PPL Corporation","Symbol":"PPL","Current Price":"34.38","Latest MA":"31.98","Price Target":35.38938,"Difference from MA":"7.52%","Difference from Open":"0.54%","Change from Yesterday":"-0.39%","Change from Last Report":"-0.06","Latest Volume":"747,121","Market Cap":"25,375,096,832","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":18.75242,"PB Ratio":1.8001674,"Previous Close":34.52,"ROE":0.05864,"DTE":117.528,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.834,"Trailing PEG":1.1265,"Trailing PE":30.977476,"Trailing PS":3.0638852,"Quick Ratio":0.807,"Day High":34.85,"Day Low":34.175,"VS Average Volume":0.1744163136,"Company Summary":"PPL Corporation, an energy company, focuses on providing electricity and natural gas to approximately 3.6 million customers in the United States. It operates through three segments: Kentucky Regulated, Pennsylvania Regulated, and Rhode Island Regulated. The company delivers electricity to customers in Pennsylvania, Kentucky, Virginia, and Rhode Island; delivers natural gas to customers in Kentucky and Rhode Island; and generates electricity from power plants in Kentucky. PPL Corporation was founded in 1920 and is headquartered in Allentown, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"Digital Realty Trust, Inc.","Symbol":"DLR","Current Price":"163.01","Latest MA":"166.09","Price Target":189.33333,"Difference from MA":"-1.85%","Difference from Open":"0.92%","Change from Yesterday":"-0.13%","Change from Last Report":"0.01","Latest Volume":"165,963","Market Cap":"55,116,836,864","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":184.19774,"PB Ratio":2.6330113,"Previous Close":163.22,"ROE":0.01956,"DTE":79.825,"Industry":"REIT - Specialty","Sector":"Real Estate","Beta":0.609,"Trailing PEG":10.3992,"Trailing PE":133.61885,"Trailing PS":10.254574,"Quick Ratio":1.6,"Day High":163.55,"Day Low":161.75,"VS Average Volume":0.0791025106,"Company Summary":"Digital Realty brings companies and data together by delivering the full spectrum of data center, colocation, and interconnection solutions. PlatformDIGITAL, the company's global data center platform, provides customers with a secure data meeting place and a proven Pervasive Datacenter Architecture (PDx) solution methodology for powering innovation and efficiently managing Data Gravity challenges. Digital Realty gives its customers access to the connected data communities that matter to them with a global data center footprint of 300+ facilities in 50+ metros across 25+ countries on six continents.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"Palo Alto Networks, Inc.","Symbol":"PANW","Current Price":"198.09","Latest MA":"180.09","Price Target":206.40184,"Difference from MA":"9.99%","Difference from Open":"-0.54%","Change from Yesterday":"0.74%","Change from Last Report":"0.28","Latest Volume":"1,026,643","Market Cap":"129,983,381,504","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":54.903893,"PB Ratio":12.45661,"Previous Close":196.73,"ROE":0.74517995,"DTE":27.28,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.118,"Trailing PEG":2.1939,"Trailing PE":51.31736,"Trailing PS":16.192263,"Quick Ratio":0.771,"Day High":199.53,"Day Low":195.35,"VS Average Volume":0.1805354818,"Company Summary":"Palo Alto Networks, Inc. provides cybersecurity solutions worldwide. The company's network security platforms include Prisma Access, a security services edge (SSE) solution, as well as Strata Cloud Manager, a network security management solution. It also provides cloud security solutions, including Prisma Cloud, a cloud native application protection platform; and Code to Cloud platform, as well as offers VM-Series and CN-Series virtual firewalls for inline network security on multi- and hybrid-cloud environments. In addition, the company provides security operation solutions through Cortex platform that includes Cortex XSIAM, an AI-driven security operations platform; Cortex XDR for the prevention, detection, and response to complex cybersecurity attacks; and Cortex XSOAR for security orchestration, automation, and response; and Cortex Xpanse for attack surface management, as well as offers threat intelligence and advisory services under the Unit 42 name. Further, it provides subscription services covering the areas of threat prevention, malware and persistent threat, URL filtering, laptop and mobile device protection, DNS security, Internet of Things security, SaaS security API, and SaaS security inline, as well as threat intelligence, and data loss prevention. Additionally, the company offers professional services, including architecture design and planning, implementation, configuration, and firewall migration; education services, such as certifications, as well as online and in-classroom training; and support services. It sells its products and services through its channel partners, as well as directly to medium to large enterprises, service providers, and government entities operating in various industries, including education, energy, financial services, government entities, healthcare, Internet and media, manufacturing, public sector, and telecommunications. The company was incorporated in 2005 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"DexCom, Inc.","Symbol":"DXCM","Current Price":"84.09","Latest MA":"77.77","Price Target":97.51333,"Difference from MA":"8.12%","Difference from Open":"0.15%","Change from Yesterday":"0.26%","Change from Last Report":"0.18","Latest Volume":"636,004","Market Cap":"32,845,131,776","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":41.821465,"PB Ratio":16.59562,"Previous Close":83.87,"ROE":0.32061002,"DTE":130.935,"Industry":"Medical Devices","Sector":"Healthcare","Beta":1.173,"Trailing PEG":1.3082,"Trailing PE":50.963634,"Trailing PS":8.306811,"Quick Ratio":2.033,"Day High":84.58,"Day Low":83.9,"VS Average Volume":0.1865209544,"Company Summary":"DexCom, Inc., a medical device company, focuses on the design, development, and commercialization of continuous glucose monitoring (CGM) systems in the United States and internationally. The company provides its systems for use by people with diabetes, as well as for use by healthcare providers. Its products include Dexcom G6 and Dexcom G7, integrated CGM systems for diabetes management; Dexcom Share, a remote monitoring system; Dexcom Real-Time API, which enables authorized third-party software developers to integrate real-time CGM data into their digital health apps and devices; and Dexcom ONE, that is designed to replace finger stick blood glucose testing for diabetes treatment decisions. It has also submitted FDA review for Dexcom Stelo for people with type 2 diabetes. The company has a collaboration and license agreement with Verily Life Sciences LLC and Verily Ireland Limited to develop blood-based or interstitial glucose monitoring products. It markets its products directly to endocrinologists, physicians, and diabetes educators. The company was incorporated in 1999 and is headquartered in San Diego, California.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"Ingersoll Rand Inc.","Symbol":"IR","Current Price":"92.26","Latest MA":"95.56","Price Target":104.32312,"Difference from MA":"-3.45%","Difference from Open":"1.21%","Change from Yesterday":"1.00%","Change from Last Report":"0.04","Latest Volume":"137,302","Market Cap":"37,181,886,464","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":26.644178,"PB Ratio":3.6244354,"Previous Close":91.35,"ROE":0.08479,"DTE":47.256,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":1.422,"Trailing PEG":1.3178,"Trailing PE":45.00488,"Trailing PS":5.1945972,"Quick Ratio":1.606,"Day High":92.38,"Day Low":91.05,"VS Average Volume":0.066978121,"Company Summary":"Ingersoll Rand Inc. provides various mission-critical air, gas, liquid, and solid flow creation technologies services and solutions worldwide. It operates through two segments, Industrial Technologies and Services, and Precision and Science Technologies. The Industrial Technologies and Services segment designs, manufactures, markets, and services air and gas compression, vacuum, and blower products; fluid transfer equipment and loading systems; and power tools and lifting equipment, including associated aftermarket parts, consumables, air treatment equipment, controls, other accessories, and services under the under the Ingersoll Rand, Gardner Denver, Nash, CompAir, Elmo Rietschle brands, etc. The Precision and Science Technologies segment designs, manufactures, and markets diaphragm, piston, water-powered, peristaltic, gear, vane, progressive cavity, and syringe pumps; and gas boosters, hydrogen compression systems, automated liquid handling systems, odorant injection systems, controls, software, and other related components and accessories for liquid and gas dosing, transfer, dispensing, compression, sampling, pressure management, and flow control in specialized or critical applications under the Air Dimensions, Albin, ARO, Dosatron, Haskel, Ingersoll Rand, LMI, Maximus, Milton Roy, MP, Oberdorfer, Seepex, Thomas, Welch, Williams, YZ, and Zinnser Analytic brand names. This segment's products are used in medical, life sciences, industrial manufacturing, water and wastewater, chemical processing, energy, food and beverage, agriculture, and other markets. It sells through an integrated network of direct sales representatives and independent distributors. The company was formerly known as Gardner Denver Holdings, Inc. and changed its name to Ingersoll Rand Inc. in March 2020. Ingersoll Rand Inc. was founded in 1859 and is headquartered in Davidson, North Carolina.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"Datadog, Inc.","Symbol":"DDOG","Current Price":"134.31","Latest MA":"129.91","Price Target":162.80682,"Difference from MA":"3.39%","Difference from Open":"-1.64%","Change from Yesterday":"-9.30%","Change from Last Report":"0.45","Latest Volume":"6,232,078","Market Cap":"45,628,538,880","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":70.32432,"PB Ratio":17.296974,"Previous Close":148.09,"ROE":0.08663999,"DTE":36.865,"Industry":"Software - Application","Sector":"Technology","Beta":1.095,"Trailing PEG":0.934,"Trailing PE":244.20183,"Trailing PS":17.990927,"Quick Ratio":2.07,"Day High":136.71,"Day Low":132.01,"VS Average Volume":1.3085890198,"Company Summary":"Datadog, Inc. operates an observability and security platform for cloud applications in North America and internationally. The company's products comprise infrastructure and application performance monitoring, log management, digital experience monitoring, continuous profiler, database monitoring, data streams and universal service monitoring, network monitoring, incident management, workflow automation, observability pipelines, cloud cost and cloud security management, application security management, cloud SIEM, sensitive data scanner, and CI visibility. Datadog, Inc. was incorporated in 2010 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"Coinbase Global, Inc.","Symbol":"COIN","Current Price":"287.64","Latest MA":"237.17","Price Target":298.68,"Difference from MA":"21.28%","Difference from Open":"1.19%","Change from Yesterday":"4.63%","Change from Last Report":"0.05","Latest Volume":"2,925,009","Market Cap":"72,010,498,048","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":54.34129,"PB Ratio":8.248431,"Previous Close":274.9,"ROE":0.21316,"DTE":51.515,"Industry":"Financial Data & Stock Exchanges","Sector":"Financial Services","Beta":3.343,"Trailing PEG":0.7863,"Trailing PE":48.91825,"Trailing PS":14.399594,"Quick Ratio":0.029,"Day High":290.744,"Day Low":282.5,"VS Average Volume":0.283146641,"Company Summary":"Coinbase Global, Inc. provides financial infrastructure and technology for the crypto economy in the United States and internationally. The company offers the primary financial account in the crypto economy for consumers; and a marketplace with a pool of liquidity for transacting in crypto assets for institutions. It also provides technology and services that enable developers to build crypto products and securely accept crypto assets as payment. The company was founded in 2012 and is based in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"Cisco Systems, Inc.","Symbol":"CSCO","Current Price":"64.06","Latest MA":"54.23","Price Target":67.12042,"Difference from MA":"18.13%","Difference from Open":"-3.09%","Change from Yesterday":"2.43%","Change from Last Report":"0.05","Latest Volume":"10,735,356","Market Cap":"255,155,519,488","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":16.064726,"PB Ratio":5.647479,"Previous Close":62.53,"ROE":0.20761,"DTE":70.647,"Industry":"Communication Equipment","Sector":"Technology","Beta":"N\/A","Trailing PEG":2.8084,"Trailing PE":28.098686,"Trailing PS":4.816436,"Quick Ratio":0.648,"Day High":66.5,"Day Low":63.94,"VS Average Volume":0.542099265,"Company Summary":"Cisco Systems, Inc. designs, manufactures, and sells Internet Protocol based networking and other products related to the communications and information technology industry in the Americas, Europe, the Middle East, Africa, the Asia Pacific, Japan, and China. The company also offers switching portfolio encompasses campus switching as well as data center switching; enterprise routing portfolio interconnects public and private wireline and mobile networks, delivering highly secure, and reliable connectivity to campus, data center and branch networks; and wireless products include indoor and outdoor wireless coverage designed for seamless roaming use of voice, video, and data applications. In addition, it provides security, which comprising network security, identity and access management, secure access service edge, and threat intelligence, detection, and response offerings; collaboration products, such as Webex Suite, collaboration devices, contact center, and communication platform as a service; end-to-end collaboration solutions that can be delivered from the cloud, on-premise or within hybrid cloud environments allowing customers to transition their collaboration solutions from on-premise to the cloud; and observability offers network assurance, monitoring and analytics and observability suite. Further, the company offers a range of service and support options for its customers, including technical support and advanced services and advisory services. It serves businesses of various sizes, public institutions, governments, and service providers. The company sells its products and services directly, as well as through systems integrators, service providers, other resellers, and distributors. Cisco Systems, Inc. has strategic alliances with other companies. Cisco Systems, Inc. was incorporated in 1984 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"Eversource Energy (D\/B\/A)","Symbol":"ES","Current Price":"60.36","Latest MA":"61.83","Price Target":69.60176,"Difference from MA":"-2.38%","Difference from Open":"0.94%","Change from Yesterday":"1.08%","Change from Last Report":"0.07","Latest Volume":"162,521","Market Cap":"22,153,000,960","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":11.961192,"PB Ratio":1.4600393,"Previous Close":59.72,"ROE":-0.03491,"DTE":187.768,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.622,"Trailing PEG":2.0758,"Trailing PE":26.591366,"Trailing PS":1.9058707,"Quick Ratio":0.326,"Day High":60.495,"Day Low":59.7317,"VS Average Volume":0.0647522401,"Company Summary":"Eversource Energy, a public utility holding company, engages in the energy delivery business. The company operates through Electric Distribution, Electric Transmission, Natural Gas Distribution, and Water Distribution segments. It is involved in the transmission and distribution of electricity; solar power facilities; and distribution of natural gas. The company operates regulated water utilities that provide water services to approximately 241,000 customers. It serves residential, commercial, industrial, municipal and fire protection, and other customers in Connecticut, Massachusetts, and New Hampshire. The company was formerly known as Northeast Utilities and changed its name to Eversource Energy in April 2015. Eversource Energy was incorporated in 1927 and is headquartered in Springfield, Massachusetts.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"Summit Materials, Inc.","Symbol":"SUM","Current Price":"52.49","Latest MA":"44.31","Price Target":"N\/A","Difference from MA":"18.47%","Difference from Open":"0.19%","Change from Yesterday":"-0.08%","Change from Last Report":"0.00","Latest Volume":"4,694,636","Market Cap":"9,228,477,440","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":24.99524,"PB Ratio":2.0728192,"Previous Close":52.45,"ROE":0.04364,"DTE":65.584,"Industry":"Building Materials","Sector":"Basic Materials","Beta":1.142,"Trailing PEG":null,"Trailing PE":61.75294,"Trailing PS":2.457947,"Quick Ratio":2.431,"Day High":54.07,"Day Low":52.4,"VS Average Volume":1.1939838893,"Company Summary":"Summit Materials, Inc. operates as a vertically integrated construction materials company in the United States and Canada. It operates in three segments: West, East, and Cement. The company offers aggregates, cement, ready-mix concrete, asphalt paving mixes, and concrete products, as well as plastics components. It also provides asphalt paving and related services. In addition, the company operates municipal waste, construction, and demolition debris landfills; and liquid asphalt terminals. The company serves the public infrastructure, and residential and nonresidential end markets. Summit Materials, Inc. was founded in 2009 and is headquartered in Denver, Colorado. As of February 10, 2025, Summit Materials, Inc. operates as a subsidiary of Quikrete Holdings, Inc.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"Antero Resources Corporation","Symbol":"AR","Current Price":"39.37","Latest MA":"30.94","Price Target":42.13636,"Difference from MA":"27.24%","Difference from Open":"1.56%","Change from Yesterday":"-0.04%","Change from Last Report":"-0.06","Latest Volume":"1,132,035","Market Cap":"12,248,971,264","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":11.612403,"PB Ratio":1.7541554,"Previous Close":39.38,"ROE":0.0130900005,"DTE":59.551,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":3.378,"Trailing PEG":0.9129,"Trailing PE":281.1786,"Trailing PS":2.8670204,"Quick Ratio":0.261,"Day High":39.98,"Day Low":38.61,"VS Average Volume":0.2688492657,"Company Summary":"Antero Resources Corporation, an independent oil and natural gas company, engages in the development, production, exploration, and acquisition of natural gas, natural gas liquids (NGLs), and oil properties in the United States. It operates in three segments: Exploration and Development; Marketing; and Equity Method Investment in Antero Midstream. As of December 31, 2023, the company had approximately 515,000 net acres in the Appalachian Basin; and approximately 172,000 net acres in the Upper Devonian Shale. Its gathering and compression systems also comprise 631 miles of gas gathering pipelines in the Appalachian Basin. The company was formerly known as Antero Resources Appalachian Corporation and changed its name to Antero Resources Corporation in June 2013. Antero Resources Corporation was incorporated in 2002 and is headquartered in Denver, Colorado.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"Tenet Healthcare Corporation","Symbol":"THC","Current Price":"127.59","Latest MA":"147.81","Price Target":174.11,"Difference from MA":"-13.67%","Difference from Open":"-0.31%","Change from Yesterday":"1.11%","Change from Last Report":"0.88","Latest Volume":"154,498","Market Cap":"12,133,902,336","Earning Date":"2025-02-12","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":9.8406315,"PB Ratio":3.164323,"Previous Close":126.19,"ROE":0.59564996,"DTE":159.393,"Industry":"Medical Care Facilities","Sector":"Healthcare","Beta":2.15,"Trailing PEG":0.5854,"Trailing PE":3.9019878,"Trailing PS":0.5785763,"Quick Ratio":1.383,"Day High":127.89,"Day Low":125.15,"VS Average Volume":0.1176313834,"Company Summary":"Tenet Healthcare Corporation operates as a diversified healthcare services company in the United States. The company operates through two segments: Hospital Operations and Services, and Ambulatory Care. Its general hospitals offer acute care services, operating and recovery rooms, radiology and respiratory therapy services, clinical laboratories, and pharmacies. The company also provides intensive and critical care, and\/or coronary care units; cardiovascular, digestive disease, neurosciences, musculoskeletal, and obstetrics services; outpatient services, including physical therapy; tertiary care services, such as cardiothoracic surgery, complex spinal surgery, neonatal intensive care, and neurosurgery services; quaternary care services in heart and kidney transplants; and limb salvaging vascular procedure, acute level 1 trauma, intravascular stroke care, minimally invasive cardiac valve replacement, imaging, surgical robotic, and telemedicine access services. In addition, it offers a range of procedures and services, such as orthopedics, total joint replacement, and spinal and other musculoskeletal procedures; gastroenterology; pain management; otolaryngology; ophthalmology; and urology. It operates hospitals, ambulatory surgery centers, imaging centers, surgical hospitals, off-campus emergency departments, and micro-hospitals. Tenet Healthcare Corporation was founded in 1967 and is headquartered in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"Williams Companies, Inc. (The)","Symbol":"WMB","Current Price":"56.08","Latest MA":"50.29","Price Target":57.055,"Difference from MA":"11.51%","Difference from Open":"5.47%","Change from Yesterday":"2.26%","Change from Last Report":"0.56","Latest Volume":"1,704,303","Market Cap":"68,362,084,352","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":24.048029,"PB Ratio":5.515885,"Previous Close":54.82,"ROE":0.20583001,"DTE":182.368,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":1.062,"Trailing PEG":9.1746,"Trailing PE":30.813187,"Trailing PS":6.594837,"Quick Ratio":0.406,"Day High":56.09,"Day Low":53.17,"VS Average Volume":0.2332966887,"Company Summary":"The Williams Companies, Inc., together with its subsidiaries, operates as an energy infrastructure company primarily in the United States. It operates through Transmission & Gulf of Mexico, Northeast G&P, West, and Gas & NGL Marketing Services segments. The Transmission & Gulf of Mexico segment comprises natural gas pipelines; Transco, Northwest pipeline, MountainWest, and related natural gas storage facilities; and natural gas gathering and processing, and crude oil production handling and transportation assets in the Gulf Coast region. The Northeast G&P segment engages in the midstream gathering, processing, and fractionation activities in the Marcellus Shale region primarily in Pennsylvania and New York, and the Utica Shale region of eastern Ohio. The West segment consists of gas gathering, processing, and treating operations in the Rocky Mountain region of Colorado and Wyoming, the Barnett Shale region of north-central Texas, the Eagle Ford Shale region of South Texas, the Haynesville Shale region of northwest Louisiana, the Mid-Continent region that includes the Anadarko and Permian basins, and the DJ Basin of Colorado; and operates natural gas liquid (NGL) fractionation and storage facilities in central Kansas near Conway. The Gas & NGL Marketing Services segment provides wholesale marketing, trading, storage, and transportation of natural gas for natural gas utilities, municipalities, power generators, and producers; asset management services; and transports and markets NGLs. The company owns and operates 33,000 miles of pipelines. The Williams Companies, Inc. was founded in 1908 and is headquartered in Tulsa, Oklahoma.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"Dominion Energy, Inc.","Symbol":"D","Current Price":"56.28","Latest MA":"55.36","Price Target":58.48312,"Difference from MA":"1.67%","Difference from Open":"0.19%","Change from Yesterday":"0.63%","Change from Last Report":"-0.12","Latest Volume":"192,654","Market Cap":"47,279,960,064","Earning Date":"2025-02-12","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":15.653594,"PB Ratio":1.8057427,"Previous Close":55.93,"ROE":0.085030004,"DTE":156.351,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.596,"Trailing PEG":2.1187,"Trailing PE":25.584091,"Trailing PS":3.2399068,"Quick Ratio":0.381,"Day High":56.41,"Day Low":55.66,"VS Average Volume":0.0422178541,"Company Summary":"Dominion Energy, Inc. produces and distributes energy in the United States. It operates through three operating segments: Dominion Energy Virginia, Dominion Energy South Carolina, and Contracted Energy. The Dominion Energy Virginia segment generates, transmits, and distributes regulated electricity to approximately 2.8 million residential, commercial, industrial, and governmental customers in Virginia and North Carolina. The Dominion Energy South Carolina segment generates, transmits, and distributes electricity to approximately 0.8 million customers in the central, southern, and southwestern portions of South Carolina; and distributes natural gas to approximately 0.4 million residential, commercial, and industrial customers in South Carolina. The Contracted Energy segment is involved in the nonregulated long-term contracted renewable electric generation and renewable natural gas facility. As of December 31, 2023, the company's portfolio of assets included approximately 29.5 gigawatt of electric generating capacity; 10,600 miles of electric transmission lines; 79,300 miles of electric distribution lines; and 94,800 miles of gas distribution mains and related service facilities. The company was formerly known as Dominion Resources, Inc. Dominion Energy, Inc. was incorporated in 1983 and is headquartered in Richmond, Virginia.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"MGM Resorts International","Symbol":"MGM","Current Price":"39.12","Latest MA":"37.52","Price Target":48.70095,"Difference from MA":"4.28%","Difference from Open":"1.49%","Change from Yesterday":"13.83%","Change from Last Report":"0.50","Latest Volume":"3,708,094","Market Cap":"11,648,868,352","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":14.019026,"PB Ratio":3.5940013,"Previous Close":34.37,"ROE":0.2901,"DTE":841.031,"Industry":"Resorts & Casinos","Sector":"Consumer Cyclical","Beta":2.241,"Trailing PEG":1.9047,"Trailing PE":16.30179,"Trailing PS":0.6764081,"Quick Ratio":1.062,"Day High":39.47,"Day Low":38.06,"VS Average Volume":0.89690585,"Company Summary":"MGM Resorts International, through its subsidiaries, owns and operates casino, hotel, and entertainment resorts in the United States and internationally. The company operates through three segments: Las Vegas Strip Resorts, Regional Operations, and MGM China. Its casino resorts offer gaming, hotel, convention, dining, entertainment, retail, and other resort amenities. The company's casino operations include slots and table games, as well as online sports betting and iGaming through BetMGM. Its customers include premium gaming customers; leisure and wholesale travel customers; business travelers; and group customers, including conventions, trade associations, and small meetings. The company was formerly known as MGM MIRAGE and changed its name to MGM Resorts International in June 2010. MGM Resorts International was incorporated in 1986 and is based in Las Vegas, Nevada.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"The Kraft Heinz Company","Symbol":"KHC","Current Price":"28.41","Latest MA":"32.46","Price Target":33.85238,"Difference from MA":"-12.51%","Difference from Open":"0.32%","Change from Yesterday":"-0.75%","Change from Last Report":"0.21","Latest Volume":"2,091,118","Market Cap":"34,346,475,520","Earning Date":"2025-02-12","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":9.800336,"PB Ratio":0.7105869,"Previous Close":28.62,"ROE":0.027999999,"DTE":41.451,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.475,"Trailing PEG":0.7733,"Trailing PE":12.568584,"Trailing PS":1.3144461,"Quick Ratio":0.448,"Day High":28.51,"Day Low":28.08,"VS Average Volume":0.1991566558,"Company Summary":"The Kraft Heinz Company, together with its subsidiaries, manufactures and markets food and beverage products in North America and internationally. Its products include condiments and sauces, cheese and dairy products, meals, meats, refreshment beverages, coffee, and other grocery products under the Kraft, Oscar Mayer, Heinz, Philadelphia, Lunchables, Velveeta, Ore-Ida, Maxwell House, Kool-Aid, Jell-O, Heinz, ABC, Master, Quero, Kraft, Golden Circle, Wattie's, Pudliszki, and Plasmon brands. It sells its products through its own sales organizations, as well as through independent brokers, agents, and distributors to chain, wholesale, cooperative, and independent grocery accounts; convenience, value, and club stores; pharmacies and drug stores; mass merchants; foodservice distributors; institutions, including hotels, restaurants, bakeries, hospitals, health care facilities, and government agencies; and online through various e-commerce platforms and retailers. The company was formerly known as H.J. Heinz Holding Corporation and changed its name to The Kraft Heinz Company in July 2015. The Kraft Heinz Company was founded in 1869 and is based in Pittsburgh, Pennsylvania.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"Paramount Global","Symbol":"PARA","Current Price":"10.70","Latest MA":"10.72","Price Target":12.75429,"Difference from MA":"-0.22%","Difference from Open":"0.38%","Change from Yesterday":"0.56%","Change from Last Report":"0.00","Latest Volume":"374,575","Market Cap":"7,622,091,776","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":7.113463,"PB Ratio":0.42920175,"Previous Close":10.64,"ROE":-0.30080998,"DTE":91.924,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.767,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.2640417,"Quick Ratio":0.938,"Day High":10.725,"Day Low":10.61,"VS Average Volume":0.0380148895,"Company Summary":"Paramount Global operates as a media, streaming, and entertainment company worldwide. It operates through TV Media, Direct-to-Consumer, and Filmed Entertainment segments. The TV Media segment operates CBS Television Network, a domestic broadcast television network; CBS Stations, a television station; and international free-to-air networks comprising Network 10, Channel 5, Telefe, and Chilevisión; domestic premium and basic cable networks, such as Paramount+ with Showtime, MTV, Comedy Central, Paramount Network, The Smithsonian Channel, Nickelodeon, BET Media Group, and CBS Sports Network; and international extensions of these brands. This segment also offers domestic and international television studio operations, including CBS Studios, Paramount Television Studios, and Showtime\/MTV Entertainment Studios; CBS Media Ventures, which produces and distributes first-run syndicated programming; and digital properties consisting of CBS News Streaming and CBS Sports HQ. The Direct-to-Consumer segment provides a portfolio of domestic and international pay and free streaming services, including Paramount+, Pluto TV, BET+, and Noggin. The Filmed Entertainment segment produces and acquires films, series, and short-form content for release and licensing around the world, including in theaters, on streaming services, on television, through digital home entertainment, and DVDs\/Blu-rays; and operates a portfolio consisting of Paramount Pictures, Paramount Players, Paramount Animation, Nickelodeon Studio, Awesomeness, and Miramax. It also offers production, distribution, and advertising solutions. The company was formerly known as ViacomCBS Inc. and changed its name to Paramount Global in February 2022. The company was founded in 1914 and is headquartered in New York, New York. Paramount Global is a subsidiary of National Amusements, Inc.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"Exelon Corporation","Symbol":"EXC","Current Price":"43.04","Latest MA":"38.39","Price Target":43.33375,"Difference from MA":"12.11%","Difference from Open":"0.23%","Change from Yesterday":"0.35%","Change from Last Report":"0.09","Latest Volume":"543,791","Market Cap":"43,264,667,648","Earning Date":"2025-02-12","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":15.421936,"PB Ratio":1.6245189,"Previous Close":42.89,"ROE":0.0933,"DTE":173.221,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.61,"Trailing PEG":2.5433,"Trailing PE":17.567347,"Trailing PS":1.8873088,"Quick Ratio":0.579,"Day High":43.08,"Day Low":42.54,"VS Average Volume":0.0830304509,"Company Summary":"Exelon Corporation, a utility services holding company, engages in the energy distribution and transmission businesses in the United States and Canada. The company is involved in the purchase and regulated retail sale of electricity and natural gas, transmission and distribution of electricity, and distribution of natural gas to retail customers. It also offers support services, including legal, human resources, information technology, supply management, financial, engineering, customer operations, transmission and distribution planning, asset management, system operations, and power procurement services. It serves distribution utilities, municipalities, and financial institutions, as well as commercial, industrial, governmental, and residential customers. Exelon Corporation was incorporated in 1999 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"NiSource Inc","Symbol":"NI","Current Price":"38.97","Latest MA":"34.41","Price Target":40.47143,"Difference from MA":"13.23%","Difference from Open":"-0.09%","Change from Yesterday":"0.43%","Change from Last Report":"-0.24","Latest Volume":"206,807","Market Cap":"18,311,213,056","Earning Date":"2025-02-12","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":19.367361,"PB Ratio":2.1791286,"Previous Close":38.8,"ROE":0.08756,"DTE":131.811,"Industry":"Utilities - Regulated Gas","Sector":"Utilities","Beta":0.507,"Trailing PEG":2.1958,"Trailing PE":24.05247,"Trailing PS":3.461935,"Quick Ratio":0.207,"Day High":39.1599,"Day Low":38.85,"VS Average Volume":0.055700113,"Company Summary":"NiSource Inc., an energy holding company, operates as a regulated natural gas and electric utility company in the United States. It operates in two segments, Gas Distribution Operations and Electric Operations. The company distributes natural gas to approximately 3.3 million customers through approximately 55,000 miles of distribution main pipeline and the associated individual customer service lines; and 1,000 miles of transmission main pipeline in northern Indiana, Ohio, Pennsylvania, Virginia, Kentucky, and Maryland. It also generates, transmits, and distributes electricity to approximately 0.5 million customers in various counties in the northern part of Indiana, as well as engages in wholesale electric and transmission transactions. It owns and operates coal-fired electric generating stations in Wheatfield and Michigan City; combined cycle gas turbine in West Terre Haute; natural gas generating units in Wheatfield; hydro generating plants in Carroll County and White County; wind generating units in White County, Indiana; and solar generating units in Jasper County and White County. The company was formerly known as NIPSCO Industries, Inc. and changed its name to NiSource Inc. in April 1999. NiSource Inc. was founded in 1847 and is headquartered in Merrillville, Indiana.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"CME Group Inc.","Symbol":"CME","Current Price":"251.51","Latest MA":"217.69","Price Target":248.6875,"Difference from MA":"15.54%","Difference from Open":"0.43%","Change from Yesterday":"1.02%","Change from Last Report":"0.17","Latest Volume":"320,177","Market Cap":"90,634,641,408","Earning Date":"2025-02-12","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":22.765598,"PB Ratio":3.2050107,"Previous Close":248.96,"ROE":0.12297,"DTE":13.621,"Industry":"Financial Data & Stock Exchanges","Sector":"Financial Services","Beta":0.559,"Trailing PEG":8.655,"Trailing PE":26.036232,"Trailing PS":15.01966,"Quick Ratio":0.03,"Day High":251.71,"Day Low":248.95,"VS Average Volume":0.1538156664,"Company Summary":"CME Group Inc., together with its subsidiaries, operates contract markets for the trading of futures and options on futures contracts worldwide. It offers futures and options products based on interest rates, equity indexes, foreign exchange, agricultural commodities, energy, and metals, as well as fixed income and foreign currency trading services. The company also provides clearing house services, including clearing, settling, and guaranteeing futures and options contracts, and cleared swaps products traded through its exchanges; and trade processing and risk mitigation services. In addition, the company offers a range of market data services, including real-time and historical data services. It serves professional traders, financial institutions, institutional and individual investors, corporations, manufacturers, producers, governments, and central banks. The company was formerly known as Chicago Mercantile Exchange Holdings Inc. and changed its name to CME Group Inc. in July 2007. The company was founded in 1898 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"Reddit, Inc.","Symbol":"RDDT","Current Price":"205.34","Latest MA":"112.64","Price Target":199.63158,"Difference from MA":"82.29%","Difference from Open":"0.70%","Change from Yesterday":"-5.14%","Change from Last Report":"-0.42","Latest Volume":"7,001,491","Market Cap":"36,053,151,744","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":52.360695,"PB Ratio":18.083647,"Previous Close":216.47,"ROE":-0.31801,"DTE":1.364,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":"N\/A","Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":32.125835,"Quick Ratio":11.834,"Day High":207.25,"Day Low":195.98,"VS Average Volume":1.2101637988,"Company Summary":"Reddit, Inc. operates a website that organizes digital communities. It organizes communities based on specific interests that enable users to engage in conversations by sharing experiences, submitting links, uploading images and videos, and replying to one another. The company was founded in 2005 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"The Trade Desk, Inc.","Symbol":"TTD","Current Price":"83.84","Latest MA":"113.64","Price Target":118.33333,"Difference from MA":"-26.22%","Difference from Open":"-1.23%","Change from Yesterday":"-31.41%","Change from Last Report":"-0.08","Latest Volume":"13,511,472","Market Cap":"41,380,802,560","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":37.36745,"PB Ratio":15.756268,"Previous Close":122.23,"ROE":0.12891,"DTE":11.167,"Industry":"Software - Application","Sector":"Technology","Beta":1.47,"Trailing PEG":2.4036,"Trailing PE":107.48603,"Trailing PS":17.916744,"Quick Ratio":1.805,"Day High":85.18,"Day Low":82.61,"VS Average Volume":3.5073160197,"Company Summary":"The Trade Desk, Inc. operates as a technology company in the United States and internationally. The company offers a self-service cloud-based platform that allows buyers to plan, manage, optimize, and measure data-driven digital advertising campaigns across various ad formats and channels, including video, display, audio, digital-out-of-home, native, and social on various devices, such as computers, mobile devices, televisions, and streaming devices. It provides data and other value-added services. The company serves advertising agencies, brands, and other service providers for advertisers. The Trade Desk, Inc. was incorporated in 2009 and is headquartered in Ventura, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"Coca-Cola Company (The)","Symbol":"KO","Current Price":"69.47","Latest MA":"65.84","Price Target":73.7932,"Difference from MA":"5.52%","Difference from Open":"0.69%","Change from Yesterday":"1.11%","Change from Last Report":"0.17","Latest Volume":"3,298,386","Market Cap":"298,881,449,984","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":21.753696,"PB Ratio":11.29124,"Previous Close":68.71,"ROE":0.3723,"DTE":167.358,"Industry":"Beverages - Non-Alcoholic","Sector":"Consumer Defensive","Beta":0.62,"Trailing PEG":2.8252,"Trailing PE":28.241869,"Trailing PS":6.446134,"Quick Ratio":0.784,"Day High":69.61,"Day Low":69.0,"VS Average Volume":0.1870775084,"Company Summary":"The Coca-Cola Company, a beverage company, manufactures, markets, and sells various nonalcoholic beverages worldwide. The company provides sparkling soft drinks, sparkling flavors; water, sports, coffee, and tea; juice, value-added dairy, and plant-based beverages; and other beverages. It also offers beverage concentrates and syrups, as well as fountain syrups to fountain retailers, such as restaurants and convenience stores. The company sells its products under the Coca-Cola, Diet Coke\/Coca-Cola Light, Coca-Cola Zero Sugar, caffeine free Diet Coke, Cherry Coke, Fanta Orange, Fanta Zero Orange, Fanta Zero Sugar, Fanta Apple, Sprite, Sprite Zero Sugar, Simply Orange, Simply Apple, Simply Grapefruit, Fresca, Schweppes, Thums Up, Aquarius, Ayataka, BODYARMOR, Ciel, Costa, Dasani, dogadan, FUZE TEA, Georgia, glacéau smartwater, glacéau vitaminwater, Gold Peak, Ice Dew, I LOHAS, Powerade, Topo Chico, AdeS, Del Valle, fairlife, innocent, Minute Maid, and Minute Maid Pulpy brands. It operates through a network of independent bottling partners, distributors, wholesalers, and retailers, as well as through bottling and distribution operators. The company was founded in 1886 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"ChampionX Corporation","Symbol":"CHX","Current Price":"29.55","Latest MA":"30.12","Price Target":41.14286,"Difference from MA":"-1.91%","Difference from Open":"1.30%","Change from Yesterday":"1.34%","Change from Last Report":"0.37","Latest Volume":"107,374","Market Cap":"5,638,139,904","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":12.432472,"PB Ratio":3.1030138,"Previous Close":29.16,"ROE":0.18280001,"DTE":39.049,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":2.39,"Trailing PEG":1.9626,"Trailing PE":17.90909,"Trailing PS":1.5381635,"Quick Ratio":1.112,"Day High":29.55,"Day Low":29.17,"VS Average Volume":0.0464509218,"Company Summary":"ChampionX Corporation provides chemistry solutions, artificial lift systems, and engineered equipment and technologies to oil and gas companies worldwide. The company operates through four segments: Production Chemical Technologies, Production & Automation Technologies, Drilling Technologies, and Reservoir Chemical Technologies. The Production Chemical Technologies segment offers onshore, offshore, and oil sands chemical solutions, such as corrosion inhibitors, scale inhibitors, emulsion breakers, and biocides to oil and natural gas production and midstream markets to manage and control corrosion, oil and water separation, flow assurance, sour gas treatment, and water-related issues. The Production & Automation Technologies segment provides artificial lift equipment, end-to-end digital automation solutions, and other production equipment and emissions monitoring solutions, including electrical submersible pumping systems, gas lift systems, jet pumps, multiplex surface pumps, plunger lift equipment, progressive cavity pumping systems, downhole rod lift systems, methane emissions monitoring solutions, chemical injection systems, flow control valves, and gauges under the Harbison-Fischer, Norris, Alberta Oil Tool, Oil Lift Technology, PCS Ferguson, Pro-Rod, Upco, Unbridled ESP, Norriseal-Wellmark, Quartzdyne, Spirit, Theta, Timberline, and Windrock brands. The Drilling Technologies segment offers polycrystalline diamond cutter inserts, bearings, valves, nozzles, and mining tools used in oil and gas drill bits under the US Synthetic brand; and high-density ceramic roof bolt mining tools for underground mining operations. The Reservoir Chemical Technologies segment provides chemistry-oriented solutions and technologies for well drilling, cementing, fracturing, acidizing, and other well interventions, as well as fracturing, drilling, cementing, acidizing additives. The company was founded in 1882 and is headquartered in The Woodlands, Texas.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"Sensata Technologies Holding pl","Symbol":"ST","Current Price":"28.72","Latest MA":"33.02","Price Target":37.22375,"Difference from MA":"-13.02%","Difference from Open":"2.57%","Change from Yesterday":"2.53%","Change from Last Report":"0.77","Latest Volume":"162,881","Market Cap":"4,295,535,616","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.9656963,"PB Ratio":1.4567587,"Previous Close":28.01,"ROE":-0.04232,"DTE":108.127,"Industry":"Scientific & Technical Instruments","Sector":"Technology","Beta":1.253,"Trailing PEG":0.8081,"Trailing PE":33.788235,"Trailing PS":1.069188,"Quick Ratio":1.562,"Day High":28.74,"Day Low":27.94,"VS Average Volume":0.0956335744,"Company Summary":"Sensata Technologies Holding plc develops, manufactures, and sells sensors and sensor-rich solutions, electrical protection components and systems, and other products used in mission-critical systems and applications in the United States and internationally. It operates in two segments, Performance Sensing and Sensing Solutions. The Performance Sensing segment offers pressure, temperature, and position sensors, high-voltage solutions, and other solutions used in mission-critical systems and applications, such as tire pressure monitoring, thermal management, electrical protection, regenerative braking, powertrain for engine\/transmission, and exhaust management for automobiles, on-road trucks, and off-road equipment customers. The Sensing Solutions segment provides application-specific sensor and electrical protection products, such as pressure, temperature, and position sensors; motor and compressor protectors; high-voltage contactors; solid state relays; bimetal electromechanical controls; power inverters; charge controllers; battery management systems; operator controls; and power conversion systems. It serves automotive, on-road truck, construction, and original equipment manufacturers in agriculture, control, appliance, medical, energy and charging infrastructure, data\/telecom, and aerospace and defense industries, as well as systems integrators, aerospace, and motor and compressor distributors. Sensata Technologies Holding plc was founded in 1916 and is headquartered in Attleboro, Massachusetts.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"Royalty Pharma plc","Symbol":"RPRX","Current Price":"32.26","Latest MA":"27.61","Price Target":40.36444,"Difference from MA":"16.85%","Difference from Open":"-0.65%","Change from Yesterday":"-0.25%","Change from Last Report":"0.03","Latest Volume":"399,440","Market Cap":"18,596,372,480","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":6.584036,"PB Ratio":2.094533,"Previous Close":32.34,"ROE":0.17276,"DTE":74.157,"Industry":"Biotechnology","Sector":"Healthcare","Beta":0.466,"Trailing PEG":7.018,"Trailing PE":16.89005,"Trailing PS":8.206685,"Quick Ratio":1.532,"Day High":32.47,"Day Low":32.1822,"VS Average Volume":0.1069604348,"Company Summary":"Royalty Pharma plc operates as a buyer of biopharmaceutical royalties and a funder of innovations in the biopharmaceutical industry in the United States. It is also involved in the identification, evaluation, and acquisition of royalties on various biopharmaceutical therapies. In addition, the company collaborates with innovators from academic institutions, research hospitals and not-for-profits, small and mid-cap biotechnology companies, and pharmaceutical companies. Its portfolio consists of royalties on approximately 35 commercial products and 14 development-stage product candidates that address various therapeutic areas, such as rare disease, cancer, neuroscience, immunology, respiratory, infectious disease, hematology, and diabetes. The company was founded in 1996 and is based in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"Super Micro Computer, Inc.","Symbol":"SMCI","Current Price":"38.38","Latest MA":"43.76","Price Target":47.51909,"Difference from MA":"-12.30%","Difference from Open":"-1.62%","Change from Yesterday":"-3.28%","Change from Last Report":"0.16","Latest Volume":"16,108,291","Market Cap":"22,471,057,408","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":10.2544985,"PB Ratio":4.1174893,"Previous Close":39.68,"ROE":0.32469,"DTE":39.749,"Industry":"Computer Hardware","Sector":"Technology","Beta":1.279,"Trailing PEG":null,"Trailing PE":19.09204,"Trailing PS":1.5037996,"Quick Ratio":1.805,"Day High":39.85,"Day Low":37.51,"VS Average Volume":0.2206724544,"Company Summary":"Super Micro Computer, Inc., together with its subsidiaries, develops and manufactures high performance server and storage solutions based on modular and open architecture in the United States, Europe, Asia, and internationally. Its solutions range from complete server, storage systems, modular blade servers, blades, workstations, full racks, networking devices, server sub-systems, server management software, and security software. The company provides application-optimized server solutions, rackmount and blade servers, storage, and subsystems and accessories; and server software management solutions, such as Server Management Suite, including Supermicro Server Manager, Supermicro Power Management software, Supermicro Update Manager, SuperCloud Composer, and SuperDoctor 5. In addition, it offers server subsystems and accessories comprising server boards, chassis, power supplies, and other accessories. Further, the company provides server and storage system integration, configuration, and software upgrade and update services; and technical documentation services, as well as identifies service requirements, creates and executes project plans, and conducts verification testing and technical documentation, and training services. Additionally, it offers help desk and on-site product support services for its server and storage systems; and customer support services, including ongoing maintenance and technical support for its products. The company provides its products to enterprise data centers, cloud computing, artificial intelligence, and 5G and edge computing markets. It sells its products through direct and indirect sales force, distributors, value-added resellers, system integrators, and original equipment manufacturers. The company was incorporated in 1993 and is headquartered in San Jose, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"DuPont de Nemours, Inc.","Symbol":"DD","Current Price":"82.50","Latest MA":"80.80","Price Target":96.35294,"Difference from MA":"2.10%","Difference from Open":"-0.60%","Change from Yesterday":"0.91%","Change from Last Report":"0.13","Latest Volume":"163,291","Market Cap":"34,484,502,528","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":17.012028,"PB Ratio":1.4239359,"Previous Close":81.76,"ROE":0.02187,"DTE":31.03,"Industry":"Specialty Chemicals","Sector":"Basic Materials","Beta":1.338,"Trailing PEG":0.4444,"Trailing PE":46.61017,"Trailing PS":2.8284533,"Quick Ratio":1.403,"Day High":83.2098,"Day Low":82.24,"VS Average Volume":0.0748920701,"Company Summary":"DuPont de Nemours, Inc. provides technology-based materials and solutions in the United States, Canada, the Asia Pacific, Latin America, Europe, the Middle East, and Africa. It operates through Electronics & Industrial, Water & Protection, and Corporate & Other segments. The Electronics & Industrial segment supplies materials and solutions for the fabrication of semiconductors and integrated circuits. This segment also provides semiconductor and advanced packaging materials; dielectric and metallization solutions for chip packaging; and silicones for light emitting diode packaging and semiconductor applications; permanent and process chemistries for the fabrication of printed circuit boards to include laminates and substrates, and electroless and electrolytic metallization solutions, and electromagnetic shielding and thermal management solutions, as well as patterning solutions, and materials and metallization processes for metal finishing, decorative, and industrial applications. In addition, it offers various materials to manufacture rigid and flexible displays for organic light emitting diode, and other display applications; provides high performance parts, and specialty silicone elastomers, and lubricants to automotive, aerospace, electronics, industrial, and healthcare markets; and photopolymer plates and platemaking systems used in flexographic printing, and digital inks for textile, commercial, and home-office printing applications. The Water & Protection segment provides engineered products and integrated systems for worker safety, water purification and separation, transportation, energy, medical packaging and building materials. The Corporate & Other segment offers auto adhesives and fluids; Multibase; and Tedlar products. The company was formerly known as DowDuPont Inc. and changed its name to DuPont de Nemours, Inc. in June 2019. DuPont de Nemours, Inc. was incorporated in 2015 and is headquartered in Wilmington, Delaware.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"GlobalFoundries Inc.","Symbol":"GFS","Current Price":"44.01","Latest MA":"43.25","Price Target":47.79,"Difference from MA":"1.75%","Difference from Open":"1.06%","Change from Yesterday":"1.06%","Change from Last Report":"0.18","Latest Volume":"354,878","Market Cap":"24,322,344,960","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":17.823729,"PB Ratio":2.1089706,"Previous Close":43.55,"ROE":0.066479996,"DTE":24.599,"Industry":"Semiconductors","Sector":"Technology","Beta":1.527,"Trailing PEG":1.6912,"Trailing PE":"N\/A","Trailing PS":3.590544,"Quick Ratio":1.74,"Day High":44.8,"Day Low":43.54,"VS Average Volume":0.1970700328,"Company Summary":"GlobalFoundries Inc., a semiconductor foundry, provides range of mainstream wafer fabrication services and technologies worldwide. It manufactures various semiconductor devices, including microprocessors, mobile application processors, baseband processors, network processors, radio frequency modems, microcontrollers, and power management units. GlobalFoundries Inc. has a strategic partnership with Efficient Computer to develop high-performance computer processors. The company was incorporated in 2008 and is headquartered in Malta, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"Edwards Lifesciences Corporatio","Symbol":"EW","Current Price":"75.82","Latest MA":"70.43","Price Target":80.25567,"Difference from MA":"7.66%","Difference from Open":"-0.68%","Change from Yesterday":"0.00%","Change from Last Report":"0.15","Latest Volume":"621,877","Market Cap":"44,718,637,056","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":27.688309,"PB Ratio":4.684874,"Previous Close":75.82,"ROE":0.19139,"DTE":7.353,"Industry":"Medical Devices","Sector":"Healthcare","Beta":1.12,"Trailing PEG":6.9624,"Trailing PE":32.40171,"Trailing PS":7.081448,"Quick Ratio":2.704,"Day High":76.59,"Day Low":75.3,"VS Average Volume":0.1278250662,"Company Summary":"Edwards Lifesciences Corporation provides products and technologies for structural heart disease and critical care monitoring in the United States, Europe, Japan, and internationally. It offers transcatheter heart valve replacement products for the minimally invasive replacement of aortic heart valves under the Edwards SAPIEN family of valves system; and transcatheter heart valve repair and replacement products to treat mitral and tricuspid valve diseases under the PASCAL PRECISION and Cardioband names. The company also provides surgical structural heart solutions, such as aortic surgical valve under the INSPIRIS name; INSPIRIS RESILLA aortic valve, which offers RESILIA tissue and VFit technology; KONECT RESILIA, a pre-assembled tissue valves conduit for complex combined procedures; and MITRIS RESILIA valve. In addition, it offers critical care solutions, including hemodynamic monitoring systems to measure a patient's heart function and fluid status in surgical and intensive care settings under the FloTrac, Acumen IQ sensors, ClearSight, Acumen IQ cuffs, and ForeSight names; HemoSphere, a monitoring platform that displays physiological information; and Acumen Hypotension Prediction Index software that alerts clinicians in advance of a patient developing dangerously low blood pressure. The company distributes its products through a direct sales force and independent distributors. Edwards Lifesciences Corporation was founded in 1958 and is headquartered in Irvine, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"Carrier Global Corporation","Symbol":"CARR","Current Price":"63.80","Latest MA":"71.63","Price Target":77.88368,"Difference from MA":"-10.94%","Difference from Open":"-0.37%","Change from Yesterday":"0.31%","Change from Last Report":"0.09","Latest Volume":"559,480","Market Cap":"55,400,087,552","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":18.682283,"PB Ratio":3.898326,"Previous Close":63.6,"ROE":0.13931,"DTE":85.607,"Industry":"Building Products & Equipment","Sector":"Industrials","Beta":1.212,"Trailing PEG":1.191,"Trailing PE":52.29508,"Trailing PS":2.2337844,"Quick Ratio":0.513,"Day High":64.04,"Day Low":63.45,"VS Average Volume":0.1063317044,"Company Summary":"Carrier Global Corporation provides heating, ventilating, and air conditioning (HVAC), refrigeration, fire, security, and building automation technologies in the United States, Europe, the Asia Pacific, and internationally. It operates through three segments: HVAC, Refrigeration, and Fire & Security. The HVAC segment provides products, controls, services, and solutions to meet the heating, cooling, and ventilation needs of residential and commercial customers. Its products include air conditioners, heating systems, heat pumps, controls, and aftermarket components, as well as aftermarket repair and maintenance services and building automation solutions. The Refrigeration segment offers transport refrigeration and monitoring products and services, as well as digital solutions for trucks, trailers, shipping containers, intermodal applications, food retail, and warehouse cooling; and commercial refrigeration solutions, such as refrigerated cabinets, freezers, systems, and controls. The Fire & Security segment provides various residential, commercial, and industrial technologies, including fire, flame, gas, smoke, and carbon monoxide detection; portable fire extinguishers; fire suppression systems; intruder alarms; access control systems; video management systems; and electronic controls. This segment also offers fire and security service, such as audit, design, installation, and system integration, as well as aftermarket maintenance and repair and monitoring services. It offers its products under the Autronica, Det-Tronics, Edwards, Aritech, Fireye, GST, Kidde, LenelS2, Marioff, Onity, and Supra; Carrier, Toshiba, Automated Logic, Bryant, CIAT, Day & Night, Heil, NORESCO, and Riello; and Carrier Commercial Refrigeration, Carrier Transicold, and Sensitech brands. Carrier Global Corporation was incorporated in 2019 and is headquartered in Palm Beach Gardens, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"Humana Inc.","Symbol":"HUM","Current Price":"257.66","Latest MA":"301.80","Price Target":296.8143,"Difference from MA":"-14.62%","Difference from Open":"-1.65%","Change from Yesterday":"-0.91%","Change from Last Report":"0.25","Latest Volume":"74,869","Market Cap":"31,084,617,728","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":18.273409,"PB Ratio":1.7663068,"Previous Close":260.03,"ROE":0.078379996,"DTE":75.908,"Industry":"Healthcare Plans","Sector":"Healthcare","Beta":0.52,"Trailing PEG":1.5269,"Trailing PE":25.791792,"Trailing PS":0.2702775,"Quick Ratio":1.404,"Day High":263.25,"Day Low":256.48,"VS Average Volume":0.0435055721,"Company Summary":"Humana Inc., together with its subsidiaries, provides medical and specialty insurance products in the United States. It operates through two segments, Insurance and CenterWell. The company offers medical and supplemental benefit plans to individuals. It has a contract with Centers for Medicare and Medicaid Services to administer the Limited Income Newly Eligible Transition prescription drug plan program; and contracts with various states to provide Medicaid, dual eligible, and long-term support services benefits. In addition, the company provides commercial fully-insured medical and specialty health insurance benefits comprising dental, vision, life insurance, and other supplemental health benefits, as well as administrative services only products to individuals and employer groups; military services, such as TRICARE T2017 East Region contract; and engages in the operations of pharmacy benefit manager business. Further, it operates pharmacies and senior focused primary care centers; and offers home solutions services, such as home health, hospice, and other services to its health plan members, as well as to third parties. The company sells its products through employers and employees, independent brokers and agents, sales representatives, and digital insurance agencies. The company was formerly known as Extendicare Inc. and changed its name to Humana Inc. in April 1974. Humana Inc. was founded in 1961 and is headquartered in Louisville, Kentucky.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"DoorDash, Inc.","Symbol":"DASH","Current Price":"200.59","Latest MA":"152.13","Price Target":215.60675,"Difference from MA":"31.85%","Difference from Open":"-0.21%","Change from Yesterday":"-0.15%","Change from Last Report":"-0.11","Latest Volume":"538,702","Market Cap":"83,322,208,256","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":32.079075,"PB Ratio":11.002414,"Previous Close":200.89,"ROE":-0.02517,"DTE":7.02,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.671,"Trailing PEG":null,"Trailing PE":668.61664,"Trailing PS":8.207468,"Quick Ratio":1.364,"Day High":201.13,"Day Low":195.62,"VS Average Volume":0.1889157671,"Company Summary":"DoorDash, Inc., together with its subsidiaries, operates a commerce platform that connects merchants, consumers, and independent contractors in the United States and internationally. The company operates DoorDash Marketplace and Wolt Marketplace, which provide various services, such as customer acquisition, demand generation, order fulfillment, merchandising, payment processing, and customer support. It also offers membership products, including DashPass and Wolt+; DoorDash Drive and Wolt Drive, which are white-label delivery fulfillment services that enable merchants that have generated consumer demand through their channels to fulfill demand using its platform; DoorDash Storefront that enables merchants to offer consumers on-demand access to e-commerce; and Bbot, which offers merchants digital ordering and payment solutions for in-store and online channels. In addition, the company enables merchants to advertise and promote on its platform to acquire consumers. The company was formerly known as Palo Alto Delivery Inc. and changed its name to DoorDash, Inc. in 2015. DoorDash, Inc. was founded in 2013 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"Masco Corporation","Symbol":"MAS","Current Price":"77.05","Latest MA":"78.12","Price Target":84.76842,"Difference from MA":"-1.37%","Difference from Open":"-0.39%","Change from Yesterday":"0.43%","Change from Last Report":"-0.08","Latest Volume":"42,110","Market Cap":"16,333,312,000","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":16.118694,"PB Ratio":"N\/A","Previous Close":76.72,"ROE":5.70874,"DTE":2238.028,"Industry":"Building Products & Equipment","Sector":"Industrials","Beta":1.25,"Trailing PEG":1.8773,"Trailing PE":20.492048,"Trailing PS":2.0722294,"Quick Ratio":1.111,"Day High":77.705,"Day Low":76.93,"VS Average Volume":0.0292221333,"Company Summary":"Masco Corporation designs, manufactures, and distributes home improvement and building products in North America, Europe, and internationally. The company's Plumbing Products segment offers faucets, showerheads, handheld showers, valves, bath hardware and accessories, bathing units, shower bases and enclosures, sinks, toilets, acrylic tubs, shower trays, spas, exercise pools, and fitness systems; brass, copper, and composite plumbing system components; connected water products; thermoplastic solutions, extruded plastic profiles, specialized fabrications, and PEX tubing products; and other non-decorative plumbing products. This segment provides its products under the DELTA, BRIZO, PEERLESS, HANSGROHE, AXOR, KRAUS, EASY DRAIN, STEAMIST, ELITESTEAM, GINGER, NEWPORT BRASS, BRASSTECH, WALTEC, BRISTAN, HERITAGE, MIROLIN, HOT SPRING, CALDERA, FREEFLOW SPAS, FANTASY SPAS, ENDLESS POOLS, BRASSCRAFT, PLUMB SHOP, COBRA, COBRA PRO, and MASTER PLUMBER brands. Its Decorative Architectural Products segment offers paints, primers, specialty coatings, stains, and waterproofing products, as well as paint applicators and accessories; cabinet and door hardware, functional hardware, wall plates, hook and rail products, closet organization systems, and picture hanging accessories; decorative bath hardware, mirrors, and shower accessories and doors; and decorative indoor and outdoor lighting fixtures, ceiling fans, landscape lighting, and LED lighting systems. This segment provides its products under the BEHR, KILZ, WHIZZ, Elder & Jenks, LIBERTY, BRAINERD, FRANKLIN BRASS, KICHLER, and ÉLAN brands. It sells its products to the plumbing, heating, and hardware wholesalers; home centers and online retailers; hardware stores; electrical and landscape distributors; lighting showrooms; building supply outlets; and other mass merchandisers. Masco Corporation was incorporated in 1929 and is headquartered in Livonia, Michigan.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"Marriott International","Symbol":"MAR","Current Price":"290.00","Latest MA":"259.81","Price Target":293.12,"Difference from MA":"11.62%","Difference from Open":"-0.23%","Change from Yesterday":"-0.16%","Change from Last Report":"-0.02","Latest Volume":"78,530","Market Cap":"79,950,176,256","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":25.162758,"PB Ratio":"N\/A","Previous Close":290.45,"ROE":"N\/A","DTE":"N\/A","Industry":"Lodging","Sector":"Consumer Cyclical","Beta":1.585,"Trailing PEG":2.5476,"Trailing PE":34.77158,"Trailing PS":12.168977,"Quick Ratio":0.389,"Day High":291.4611,"Day Low":288.16,"VS Average Volume":0.0584776596,"Company Summary":"Marriott International, Inc. engages in operating, franchising, and licensing hotel, residential, timeshare, and other lodging properties worldwide. It operates its properties under the JW Marriott, The Ritz-Carlton, The Luxury Collection, W Hotels, St. Regis, EDITION, Bvlgari, Marriott Hotels, Sheraton, Westin, Autograph Collection, Renaissance Hotels, Le Méridien, Delta Hotels by Marriott, Tribute Portfolio, Gaylord Hotels, Design Hotels, Marriott Executive Apartments, Apartments by Marriott Bonvoy, Courtyard by Marriott, Marriott BonvoyÂ, Fairfield by Marriott, Residence Inn by Marriott, SpringHill Suites by Marriott, Four Points by Sheraton, TownePlace Suites by Marriott, Aloft Hotels, AC Hotels by Marriott, Moxy Hotels, Element Hotels, Protea Hotels by Marriott, City Express by Marriott, and St. Regis Longboat Key brand names, as well as operates residences, timeshares, and yachts. The company was founded in 1927 and is headquartered in Bethesda, Maryland.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"Exelixis, Inc.","Symbol":"EXEL","Current Price":"33.50","Latest MA":"29.99","Price Target":36.88522,"Difference from MA":"11.71%","Difference from Open":"1.76%","Change from Yesterday":"2.13%","Change from Last Report":"-0.48","Latest Volume":"185,022","Market Cap":"9,376,013,312","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":11.783203,"PB Ratio":4.2074857,"Previous Close":32.8,"ROE":0.202,"DTE":8.545,"Industry":"Biotechnology","Sector":"Healthcare","Beta":0.511,"Trailing PEG":2.2685,"Trailing PE":19.034092,"Trailing PS":4.504238,"Quick Ratio":3.732,"Day High":33.68,"Day Low":32.84,"VS Average Volume":0.0815527202,"Company Summary":"Exelixis, Inc., an oncology company, focuses on the discovery, development, and commercialization of new medicines for difficult-to-treat cancers in the United States. The company offers CABOMETYX tablets for the treatment of patients with advanced renal cell carcinoma who received prior anti-angiogenic therapy; and COMETRIQ capsules for the treatment of progressive and metastatic medullary thyroid cancer. Its CABOMETYX and COMETRIQ are derived from cabozantinib, an inhibitor of multiple tyrosine kinases, including MET, AXL, RET, and VEGF receptors. The company also offers COTELLIC, an inhibitor of MEK as a combination regimen to treat specific forms of advanced melanoma; and MINNEBRO, an oral non-steroidal selective blocker of the mineralocorticoid receptor for the treatment of hypertension in Japan. It develops zanzalintinib, a novel, potent, next-generation oral tyrosine kinase inhibitor (TKI) that targets VEGF receptors, MET and the TAM kinases (TYRO3, AXL and MER); and XB002, a next-generation tissue factor (TF)-targeting ADC, administered via intravenous infusion and composed of a human monoclonal antibody (mAb) against TF that is conjugated to an auristatin-based microtubulin inhibitor (MTI) payload. It has research collaborations and license agreements with Ipsen Pharma SAS; Takeda Pharmaceutical Company Ltd.; F. Hoffmann-La Roche Ltd.; Redwood Bioscience, Inc.; R.P. Scherer Technologies, LLC; Catalent Pharma Solutions, Inc.; NBE Therapeutics AG; Aurigene Discovery Technologies Limited; Iconic Therapeutics, Inc.; Invenra, Inc.; StemSynergy Therapeutics, Inc.; Genentech, Inc.; Bristol-Myers Squibb Company; and Daiichi Sankyo Company, Limited, as well as clinical development agreement and collaboration with Sairopa B.V. and Merck & Co., Inc. The company was formerly known as Exelixis Pharmaceuticals, Inc. and changed its name to Exelixis, Inc. in February 2000. Exelixis, Inc. was incorporated in 1994 and is headquartered in Alameda, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"Lyft, Inc.","Symbol":"LYFT","Current Price":"13.27","Latest MA":"13.45","Price Target":17.68605,"Difference from MA":"-1.34%","Difference from Open":"-0.41%","Change from Yesterday":"0.11%","Change from Last Report":"-0.07","Latest Volume":"5,429,944","Market Cap":"5,544,836,608","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":9.4613495,"PB Ratio":8.39026,"Previous Close":13.25,"ROE":-0.1161,"DTE":189.385,"Industry":"Software - Application","Sector":"Technology","Beta":2.041,"Trailing PEG":null,"Trailing PE":221.08334,"Trailing PS":1.0154777,"Quick Ratio":0.58,"Day High":13.345,"Day Low":12.7901,"VS Average Volume":0.3275396224,"Company Summary":"Lyft, Inc. operates a peer-to-peer marketplace for on-demand ridesharing in the United States and Canada. It operates multimodal transportation networks that offer access to various transportation options through the Lyft platform and mobile-based applications. The company's platform provides a ridesharing marketplace, which connects drivers with riders; Express Drive, a car rental program for drivers; and a network of shared bikes and scooters in various cities to address the needs of riders for short trips. It also offers centralized tools and enterprise transportation solutions, such as concierge transportation solutions for organizations; Lyft Pink subscription plans; Lyft Pass commuter programs; first-mile and last-mile services; and university safe rides programs. The company was formerly known as Zimride, Inc. and changed its name to Lyft, Inc. in April 2013. Lyft, Inc. was incorporated in 2007 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"Arch Capital Group Ltd.","Symbol":"ACGL","Current Price":"88.23","Latest MA":"97.63","Price Target":115.66667,"Difference from MA":"-9.62%","Difference from Open":"-0.54%","Change from Yesterday":"-0.03%","Change from Last Report":"0.02","Latest Volume":"107,874","Market Cap":"33,211,502,592","Earning Date":"2025-02-10","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":9.190711,"PB Ratio":1.5416465,"Previous Close":88.26,"ROE":0.30441,"DTE":12.243,"Industry":"Insurance - Diversified","Sector":"Financial Services","Beta":0.613,"Trailing PEG":null,"Trailing PE":7.8851295,"Trailing PS":1.9690225,"Quick Ratio":0.321,"Day High":89.14,"Day Low":88.19,"VS Average Volume":0.0561250053,"Company Summary":"Arch Capital Group Ltd., together with its subsidiaries, provides insurance, reinsurance, and mortgage insurance products worldwide. The company's Insurance segment offers primary and excess casualty coverages; loss sensitive primary casualty insurance programs; directors' and officers' liability, errors and omissions liability, employment practices and fiduciary liability, crime, professional indemnity, and other financial related coverages; medical professional and general liability insurance coverages; and workers' compensation and umbrella liability, as well as commercial automobile and inland marine products. It also provides property, energy, marine, and aviation insurance; travel insurance; accident, disability, and medical plan insurance coverages; captive insurance programs; employer's liability; contract and commercial surety coverages; and collateral protection, debt cancellation, and service contract reimbursement products. This segment markets its products through a group of licensed independent retail and wholesale brokers. Its Reinsurance segment provides casualty reinsurance for third party liability exposures; marine and aviation; motor reinsurance, whole account multi-line treaties, cyber, trade credit, surety, accident and health, workers' compensation catastrophe, agriculture, trade credit, and political risk products; reinsurance protection for catastrophic losses, and personal lines and commercial property exposures; life reinsurance; casualty clash; and risk management solutions. This segment markets its reinsurance products through brokers. The company's Mortgage segment offers direct mortgage insurance and mortgage reinsurance. The company was founded in 1995 and is based in Pembroke, Bermuda.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"Arista Networks, Inc.","Symbol":"ANET","Current Price":"109.98","Latest MA":"99.17","Price Target":113.53698,"Difference from MA":"10.90%","Difference from Open":"0.24%","Change from Yesterday":"0.31%","Change from Last Report":"0.14","Latest Volume":"1,084,867","Market Cap":"138,554,703,872","Earning Date":"2025-02-10","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":44.498077,"PB Ratio":3.745318,"Previous Close":109.64,"ROE":0.33833998,"DTE":0.755,"Industry":"Computer Hardware","Sector":"Technology","Beta":1.077,"Trailing PEG":2.5468,"Trailing PE":52.877407,"Trailing PS":20.951403,"Quick Ratio":3.516,"Day High":111.47,"Day Low":109.305,"VS Average Volume":0.1352251806,"Company Summary":"Arista Networks Inc engages in the development, marketing, and sale of data-driven, client to cloud networking solutions for data center, campus, and routing environments in the Americas, Europe, the Middle East, Africa, and the Asia-Pacific. Its cloud networking solutions consist of Extensible Operating System (EOS), a publish-subscribe state-sharing networking operating system offered in combination with a set of network applications. The company offers data center and cloud networking systems, including newer artificial intelligence (AI) ethernet switching platforms; campus wired and wireless products, and routing systems addressing Core Routing, Edge Routing, Data Center Interconnect (DCI), Multi-cloud and Wide Area Networking (WAN) use cases; and a suite of value-add software solutions that leverage EOS to provide end-to-end orchestration, automation, analytics, network monitoring, and security. It also provides post contract customer support services, such as technical support, hardware repair and replacement parts beyond standard warranty, bug fixes, patches, and upgrade services. The company serves a range of industries comprising internet companies, service providers, financial services organizations, government agencies, media and entertainment companies, telecommunication service providers, and others. It markets and sells its products through distributors, system integrators, value-added resellers, and original equipment manufacturer partners, as well as through its direct sales force. The company was formerly known as Arastra, Inc. and changed its name to Arista Networks Inc in October 2008. Arista Networks Inc was incorporated in 2004 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"Coty Inc.","Symbol":"COTY","Current Price":"5.67","Latest MA":"8.23","Price Target":8.68095,"Difference from MA":"-31.04%","Difference from Open":"-0.79%","Change from Yesterday":"-0.09%","Change from Last Report":"-0.35","Latest Volume":"1,331,126","Market Cap":"4,948,560,384","Earning Date":"2025-02-10","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":10.320809,"PB Ratio":1.2868482,"Previous Close":5.68,"ROE":0.04405,"DTE":94.436,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":1.914,"Trailing PEG":0.1949,"Trailing PE":"Infinity","Trailing PS":0.8048926,"Quick Ratio":0.391,"Day High":5.75,"Day Low":5.665,"VS Average Volume":0.2473935992,"Company Summary":"Coty Inc., together with its subsidiaries, manufactures, markets, distributes, and sells beauty products worldwide. It operates through Prestige and Consumer Beauty segments. The company provides fragrance, color cosmetics, and skin and body care products. It offers Prestige segment products primarily through prestige retailers, including perfumeries, department stores, e-retailers, direct-to-consumer websites, and duty-free shops under the Burberry, Calvin Klein, Chloe, Davidoff, Escada, Gucci, Hugo Boss, Infiniment Coty Paris, Jil Sander, Joop!, Kylie Jenner, Lancaster, Marc Jacobs, Miu Miu, Orveda, philosophy, SKKN BY KIM, and Tiffany & Co. brands. The company provides Consumer Beauty segment products primarily through hypermarkets, supermarkets, drug stores, pharmacies, mid-tier department stores, traditional food and drug retailers, and e-commerce retailers under the Adidas, Beckham, Bozzano, Bourjois, Bruno Banani, CoverGirl, Jovan, Max Factor, Mexx, Monange, Nautica, Paixao, LeGer by Lena Gercke, Rimmel, Risque, Vera Wang, and Sally Hansen brands. It also sells its products through third-party distributors. The company was founded in 1904 and is headquartered in New York, New York. Coty Inc. is a subsidiary of JAB Beauty B.V.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"Amkor Technology, Inc.","Symbol":"AMKR","Current Price":"21.92","Latest MA":"28.78","Price Target":29.943,"Difference from MA":"-23.82%","Difference from Open":"0.05%","Change from Yesterday":"0.32%","Change from Last Report":"0.37","Latest Volume":"149,974","Market Cap":"5,406,127,104","Earning Date":"2025-02-10","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":10.914709,"PB Ratio":1.2984185,"Previous Close":21.845,"ROE":0.09133001,"DTE":32.538,"Industry":"Semiconductor Equipment & Materials","Sector":"Technology","Beta":1.852,"Trailing PEG":null,"Trailing PE":15.328603,"Trailing PS":0.83941054,"Quick Ratio":1.795,"Day High":22.07,"Day Low":21.82,"VS Average Volume":0.1089756259,"Company Summary":"Amkor Technology, Inc. provides outsourced semiconductor packaging and test services in the United States, Japan, Europe, and the Asia Pacific. It offers turnkey packaging and test services, including semiconductor wafer bump, wafer probe, wafer back-grind, package design, packaging, system-level and final test, and drop shipment services; flip chip scale package products for smartphones, tablets, and other mobile consumer electronic devices; flip chip stacked chip scale packages that are used to stack memory digital baseband, and as applications processors in mobile devices; flip-chip ball grid array packages for various networking, storage, computing, automotive, and consumer applications; and memory products for system memory or platform data storage. The company also provides wafer-level CSP packages for power management, transceivers, sensors, wireless charging, codecs, radar, and specialty silicon; wafer-level fan-out packages used in power management, transceivers, radar, and specialty silicon; silicon wafer integrated fan-out technology that replaces a laminate substrate with a thinner structure; leadframe packages for electronic devices and mixed-signal applications; and substrate-based wirebond packages used to connect a die to a substrate. In addition, it offers micro-electro-mechanical systems packages that are miniaturized mechanical and electromechanical devices; and advanced system-in-package modules used in radio frequency and front end modules, basebands, connectivity, fingerprint sensors, display and touch screen drivers, sensors and MEMS, and NAND memory and solid-state drives. Further, the company provides wafer, package, and system level test services, as well as burn-in test and test development services. It serves integrated device manufacturers, fabless semiconductor companies, original equipment manufacturers, and contract foundries. The company was founded in 1968 and is headquartered in Tempe, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"ON Semiconductor Corporation","Symbol":"ON","Current Price":"49.85","Latest MA":"67.58","Price Target":61.59448,"Difference from MA":"-26.22%","Difference from Open":"-0.41%","Change from Yesterday":"-0.41%","Change from Last Report":"0.22","Latest Volume":"599,624","Market Cap":"21,009,942,528","Earning Date":"2025-02-10","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":12.905238,"PB Ratio":2.472108,"Previous Close":50.06,"ROE":0.2183,"DTE":42.376,"Industry":"Semiconductors","Sector":"Technology","Beta":1.654,"Trailing PEG":1.8007,"Trailing PE":13.734159,"Trailing PS":2.847686,"Quick Ratio":1.875,"Day High":50.55,"Day Low":49.7001,"VS Average Volume":0.0771720038,"Company Summary":"ON Semiconductor Corporation provides intelligent sensing and power solutions in the United States and internationally. The company operates through Power Solutions Group, Advanced Solutions Group, and Intelligent Sensing Group. Its intelligent power technologies enable the electrification of the automotive industry that allows for lighter and longer-range electric vehicles, empowers fast-charging systems, and propels sustainable energy for the solar strings, industrial power, and storage systems. In addition, the company offers analog, discrete, module, and integrated semiconductor products that perform multiple application functions, includes power switching and conversion, signal conditioning, circuit protection, signal amplification, and voltage regulation functions. Further, it designs and develops analog, mixed-signal, power management ICs and sensor interface devices for automotive, industrial, compute and mobile markets. Additionally, the company offers single photon detectors, including silicon photomultipliers and single photon avalanche diode arrays, as well as actuator drivers for autofocus and image stabilization for a broad base of end-users in the different end-markets. ON Semiconductor Corporation was incorporated in 1992 and is headquartered in Scottsdale, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"McDonald's Corporation","Symbol":"MCD","Current Price":"307.23","Latest MA":"287.84","Price Target":327.2971,"Difference from MA":"6.74%","Difference from Open":"-0.09%","Change from Yesterday":"-0.12%","Change from Last Report":"-0.11","Latest Volume":"154,106","Market Cap":"220,167,176,192","Earning Date":"2025-02-10","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":23.020933,"PB Ratio":"N\/A","Previous Close":307.6,"ROE":"N\/A","DTE":"N\/A","Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":0.735,"Trailing PEG":2.6899,"Trailing PE":26.997364,"Trailing PS":8.48798,"Quick Ratio":0.584,"Day High":308.155,"Day Low":305.63,"VS Average Volume":0.0499056008,"Company Summary":"McDonald's Corporation operates and franchises restaurants under the McDonald's brand in the United States and internationally. It offers food and beverages, including hamburgers and cheeseburgers, various chicken sandwiches, fries, shakes, desserts, sundaes, cookies, pies, soft drinks, coffee, and other beverages; and full or limited breakfast, as well as sells various other products during limited-time promotions. The company owns and operates under various structures comprising conventional franchise, developmental license, or affiliate. McDonald's Corporation was founded in 1940 and is based in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-02-2025 16:56:23"},{"Company Name":"BGC Group, Inc.","Symbol":"BGC","Current Price":"9.53","Latest MA":"9.50","Price Target":12.0,"Difference from MA":"0.23%","Difference from Open":"0.37%","Change from Yesterday":"0.69%","Change from Last Report":"0.00","Latest Volume":"261,881","Market Cap":"4,638,493,696","Earning Date":"2025-02-14","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.985849,"PB Ratio":5.3692217,"Previous Close":9.46,"ROE":0.12765999,"DTE":152.907,"Industry":"Capital Markets","Sector":"Financial Services","Beta":1.486,"Trailing PEG":null,"Trailing PE":41.41304,"Trailing PS":2.1883414,"Quick Ratio":1.424,"Day High":9.64,"Day Low":9.46,"VS Average Volume":0.087082926,"Company Summary":"BGC Group, Inc. operates as a financial brokerage and technology company in the United States and internationally. The company offers various brokerage products, such as fixed income, such as government bonds, corporate bonds, and other debt instruments, as well as related interest rate derivatives and credit derivatives; equities, energy and commodities, shipping, insurance, and futures and options. It also provides trade execution, connectivity solutions, brokerage services, clearing, trade compression and other post-trade services, information, and other back-office services to an assortment of financial and non-financial institutions. In addition, the company offers electronic and hybrid brokerage, other financial technology solutions, market data and related information services. Further, its integrated platform is designed to provide flexibility to customers with regard to price discovery, execution and processing of transactions, Hybrid, or in various markets, as well as fully electronic brokerage services in connection with transactions executed either OTC or through an exchange. The company primarily serves banks, broker-dealers, investment banks, trading firms, hedge funds, governments, and corporations, as well as investment firms. BGC Group, Inc. was founded in 1945 and is headquartered in New York, New York.","Stock Sentiment":"N\/A","Row Color":"positive-row","Last Updated":"13-02-2025 16:56:23"}]