[{"Company Name":"American Airlines Group, Inc.","Symbol":"AAL","Current Price":"17.14","Latest MA":"12.22","Price Target":"18.30","Difference from MA":"40.34%","Difference from Open":"0.85%","Change from Yesterday":"-0.61%","Change from Last Report":"0.06","Latest Volume":"10,103,414","Market Cap":"11,266,511,872","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":7.5422645,"ROE":"N\/A","DTE":"N\/A","Industry":"Airlines","Sector":"Industrials","Beta":1.399,"Trailing PEG":0.21,"Trailing PE":40.82143,"Trailing PS":0.21014516,"Quick Ratio":0.422,"Day High":17.27,"Day Low":16.8,"VS Average Volume":0.3417815279,"Company Summary":"American Airlines Group Inc., through its subsidiaries, operates as a network air carrier. The company provides scheduled air transportation services for passengers and cargo through its hubs in Charlotte, Chicago, Dallas\/Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix, and Washington, D.C., as well as through partner gateways in London, Doha, Madrid, Seattle\/Tacoma, Sydney, and Tokyo. It operates a mainline fleet of 965 aircraft. The company was formerly known as AMR Corporation and changed its name to American Airlines Group Inc. in December 2013. American Airlines Group Inc. was founded in 1926 and is headquartered in Fort Worth, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-12-2024 18:52:21"},{"Company Name":"Broadcom Inc.","Symbol":"AVGO","Current Price":"239.25","Latest MA":"166.40","Price Target":"243.78","Difference from MA":"43.78%","Difference from Open":"-0.39%","Change from Yesterday":"2.97%","Change from Last Report":"-0.04","Latest Volume":"15,583,521","Market Cap":"1,121,404,059,648","Earning Date":"2024-12-12","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":31.439194,"ROE":0.12509,"DTE":166.032,"Industry":"Semiconductors","Sector":"Technology","Beta":1.187,"Trailing PEG":0.6586,"Trailing PE":184.03078,"Trailing PS":23.953949,"Quick Ratio":0.841,"Day High":240.228,"Day Low":234.8,"VS Average Volume":0.5753850507,"Company Summary":"Broadcom Inc. designs, develops, and supplies various semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products worldwide. The company operates in two segments, Semiconductor Solutions and Infrastructure Software. It provides set-top box system-on-chips (SoCs); cable, digital subscriber line, and passive optical networking central office\/consumer premise equipment SoCs; wireless local area network access point SoCs; Ethernet switching and routing custom silicon solutions; serializer\/deserializer application specific integrated circuits; optical and copper, and physical layer devices; and fiber optic components and RF semiconductor devices. The company also offers RF front end modules and filter; Wi-Fi, Bluetooth, and global positioning system\/global navigation satellite system SoCs; custom touch controllers; inductive charging; attached small computer system interface, and redundant array of independent disks controllers and adapters; peripheral component interconnect express; fiber channel host bus adapters; read channel based SoCs; custom flash controllers; preamplifiers; optocouplers, industrial fiber optics, and motion control encoders and subsystems; light emitting diode, ethernet PHYs, switch ICs, and camera microcontrollers. Its products are used in various applications, including enterprise and data center networking, home connectivity, set-top boxes, broadband access, telecommunication equipment, smartphones and base stations, data center servers and storage systems, factory automation, power generation and alternative energy systems, and electronic displays. Broadcom Inc. was founded in 1961 and is headquartered in Palo Alto, California.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"24-12-2024 18:52:21"},{"Company Name":"Micron Technology, Inc.","Symbol":"MU","Current Price":"89.41","Latest MA":"109.02","Price Target":"132.73","Difference from MA":"-17.99%","Difference from Open":"-0.19%","Change from Yesterday":"-0.40%","Change from Last Report":"-0.05","Latest Volume":"8,107,294","Market Cap":"99,562,233,856","Earning Date":"2024-12-18","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":6.9623322,"ROE":0.01743,"DTE":31.194,"Industry":"Semiconductors","Sector":"Technology","Beta":1.179,"Trailing PEG":0.2279,"Trailing PE":25.604584,"Trailing PS":3.9648855,"Quick Ratio":1.592,"Day High":89.7,"Day Low":88.23,"VS Average Volume":0.3408131978,"Company Summary":"Micron Technology, Inc. designs, develops, manufactures, and sells memory and storage products in the United States, Taiwan, Mainland China, rest of the Asia Pacific, Hong Kong, Japan, Europe, and internationally. The company operates through four segments: Compute and Networking Business Unit, Mobile Business Unit, Embedded Business Unit, and Storage Business Unit. It provides memory and storage technologies comprising dynamic random access memory semiconductor devices with low latency that provide high-speed data retrieval; non-volatile and re-writeable semiconductor storage devices; and non-volatile re-writable semiconductor memory devices that provide fast read speeds under the Micron and Crucial brands, as well as through private labels. The company offers serves the data center, PC, graphics, networking, automotive, industrial, and consumer embedded markets, as well as for smartphone and other mobile-device markets. It markets its products through its direct sales force, independent sales representatives, distributors, and retailers; and web-based customer direct sales channel, as well as through channel and distribution partners. Micron Technology, Inc. was founded in 1978 and is headquartered in Boise, Idaho.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"24-12-2024 18:52:21"},{"Company Name":"Mobileye Global Inc.","Symbol":"MBLY","Current Price":"19.07","Latest MA":"18.43","Price Target":"19.40","Difference from MA":"3.47%","Difference from Open":"2.09%","Change from Yesterday":"2.97%","Change from Last Report":"0.08","Latest Volume":"1,591,893","Market Cap":"15,458,574,336","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":45.26241,"ROE":-0.21936001,"DTE":0.439,"Industry":"Auto Parts","Sector":"Consumer Cyclical","Beta":0.059,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":8.583328,"Quick Ratio":4.215,"Day High":19.21,"Day Low":18.54,"VS Average Volume":0.2372779822,"Company Summary":"Mobileye Global Inc. develops and deploys advanced driver assistance systems (ADAS) and autonomous driving technologies and solutions worldwide. The company operates through Mobileye and Other segments. It offers Driver Assist comprising ADAS and autonomous vehicle solutions that covers safety features, such as real-time detection of road users, geometry, semantics, and markings to provide safety alerts and emergency interventions; Cloud-Enhanced Driver Assist, a solution for drivers with interpretations of a scene in real-time; Mobileye SuperVision Lite, a navigation and assisted driving solution; and Mobileye SuperVision, an operational point-to-point assisted driving navigation solution on various road types and includes cloud-based enhancements, such as road experience management. The company also provides Mobileye Chauffeur, a first-generation solution for eyes-off\/hands-off driving with a human driver still in the driver's seat; Mobileye Drive, a self-driving system comprising of radar and lidar subsystems, as well as collision avoidance systems, including Mobileye 8 Connect for light and medium-duty vehicles, and Mobileye Shield+ for large vehicles. It serves original equipment manufacturers. The company was founded in 1999 and is headquartered in Jerusalem, Israel. Mobileye Global Inc. operates as a subsidiary of Intel Overseas Funding Corporation.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"24-12-2024 18:52:21"},{"Company Name":"Comcast Corporation","Symbol":"CMCSA","Current Price":"38.28","Latest MA":"39.98","Price Target":"47.89","Difference from MA":"-4.27%","Difference from Open":"1.04%","Change from Yesterday":"0.78%","Change from Last Report":"0.06","Latest Volume":"2,985,433","Market Cap":"146,460,819,456","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":8.751292,"ROE":0.16884,"DTE":117.127,"Industry":"Telecom Services","Sector":"Communication Services","Beta":1.004,"Trailing PEG":1.1784,"Trailing PE":10.316711,"Trailing PS":1.1900611,"Quick Ratio":0.605,"Day High":38.2775,"Day Low":37.71,"VS Average Volume":0.1551615998,"Company Summary":"Comcast Corporation operates as a media and technology company worldwide. It operates through Residential Connectivity & Platforms, Business Services Connectivity, Media, Studios, and Theme Parks segments. The Residential Connectivity & Platforms segment provides residential broadband and wireless connectivity services, residential and business video services, sky-branded entertainment television networks, and advertising. The Business Services Connectivity segment offers connectivity services for small business locations, which include broadband, wireline voice, and wireless services, as well as solutions for medium-sized customers and larger enterprises; and small business connectivity services in the United Kingdom. The Media segment operates NBCUniversal's television and streaming business, including national and regional cable networks; the NBC and Telemundo broadcast networks and owned local broadcast television stations; and Peacock, a direct-to-consumer streaming services. It also operates international television networks comprising the Sky Sports networks, as well as other digital properties. The Studios segment operates NBCUniversal and Sky film and television studio production and distribution operations. The Theme Parks segment operates Universal theme parks in Orlando, Florida; Hollywood, California; Osaka, Japan; and Beijing, China. The company also offers a consolidated streaming platforms under the Philadelphia Flyers and the Wells Fargo Center arena in Philadelphia, Pennsylvania; and Xumo. Comcast Corporation was founded in 1963 and is headquartered in Philadelphia, Pennsylvania.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"24-12-2024 18:52:21"},{"Company Name":"Carnival Corporation","Symbol":"CCL","Current Price":"25.68","Latest MA":"19.37","Price Target":"28.30","Difference from MA":"32.59%","Difference from Open":"-1.21%","Change from Yesterday":"-0.19%","Change from Last Report":"-0.02","Latest Volume":"5,608,895","Market Cap":"33,589,440,512","Earning Date":"2024-12-20","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":12.710417,"ROE":0.20120001,"DTE":352.355,"Industry":"Travel Services","Sector":"Consumer Cyclical","Beta":2.668,"Trailing PEG":null,"Trailing PE":17.833332,"Trailing PS":1.3721737,"Quick Ratio":0.202,"Day High":26.05,"Day Low":25.49,"VS Average Volume":0.2168898862,"Company Summary":"Carnival Corporation & plc engages in the provision of leisure travel services in North America, Australia, Europe, Asia, and internationally. The company operates through four segments: NAA Cruise Operations, Europe Cruise Operations, Cruise Support, and Tour and Other. It operates port destinations, private islands, and a solar park, as well as owns and operates hotels, lodges, glass-domed railcars, and motor coaches. The company offers its services under the Carnival Cruise Line, Princess Cruises, Holland America Line, Seabourn, Costa Cruises, AIDA Cruises, P&O Cruises, and Cunard brand. Additionally, it sells its cruises primarily through travel agents, tour operators, vacation planners, and websites. Carnival Corporation & plc was founded in 1972 and is headquartered in Miami, Florida.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"24-12-2024 18:52:21"},{"Company Name":"Nike, Inc.","Symbol":"NKE","Current Price":"76.65","Latest MA":"80.63","Price Target":"85.64","Difference from MA":"-4.93%","Difference from Open":"-0.13%","Change from Yesterday":"-0.16%","Change from Last Report":"0.03","Latest Volume":"2,645,257","Market Cap":"114,071,199,744","Earning Date":"2024-12-19","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":29.148094,"ROE":0.3798,"DTE":86.962,"Industry":"Footwear & Accessories","Sector":"Consumer Cyclical","Beta":1.035,"Trailing PEG":3.9985,"Trailing PE":23.652779,"Trailing PS":2.2808766,"Quick Ratio":1.417,"Day High":77.1099,"Day Low":76.36,"VS Average Volume":0.218300557,"Company Summary":"NIKE, Inc., together with its subsidiaries, engages in the design, development, marketing, and sale of athletic footwear, apparel, equipment, accessories, and services worldwide. The company provides athletic and casual footwear, apparel, and accessories under the NIKE, Jumpman, Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks. It also sells a line of performance equipment and accessories comprising bags, sport balls, socks, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities under the NIKE brand; and various plastic products to other manufacturers. In addition, the company markets apparel with licensed college and professional team, and league logos, as well as sells sports apparel; licenses unaffiliated parties to manufacture and sell apparel, digital devices, and applications and other equipment for sports activities under NIKE-owned trademarks; and operates digital platforms, including fitness and activity apps; sport, fitness, and wellness content; and digital services and features in retail stores. It sells its products to footwear stores; sporting goods stores; athletic specialty stores; department stores; skate, tennis, and golf shops; and other retail accounts through NIKE-owned retail stores, digital platforms, independent distributors, licensees, and sales representatives. The company was founded in 1964 and is headquartered in Beaverton, Oregon.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"24-12-2024 18:52:21"},{"Company Name":"NextEra Energy, Inc.","Symbol":"NEE","Current Price":"72.53","Latest MA":"76.80","Price Target":"87.78","Difference from MA":"-5.56%","Difference from Open":"0.16%","Change from Yesterday":"0.06%","Change from Last Report":"0.06","Latest Volume":"1,388,109","Market Cap":"149,160,984,576","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":19.71794,"ROE":0.09887999,"DTE":139.015,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.561,"Trailing PEG":2.9521,"Trailing PE":21.52374,"Trailing PS":5.683189,"Quick Ratio":0.258,"Day High":72.71,"Day Low":72.03,"VS Average Volume":0.1315545609,"Company Summary":"NextEra Energy, Inc., through its subsidiaries, generates, transmits, distributes, and sells electric power to retail and wholesale customers in North America. The company generates electricity through wind, solar, nuclear,natural gas, and other clean energy. It also develops, constructs, and operates long-term contracted assets that consists of clean energy solutions, such as renewable generation facilities, battery storage projects, and electric transmission facilities; sells energy commodities; and owns, develops, constructs, manages and operates electric generation facilities in wholesale energy markets. The company had approximately 33,276 megawatts of net generating capacity; approximately 90,000 circuit miles of transmission and distribution lines; and 883 substations. It serves approximately 12 million people through approximately 5.9 million customer accounts in the east and lower west coasts of Florida. The company was formerly known as FPL Group, Inc. and changed its name to NextEra Energy, Inc. in 2010. NextEra Energy, Inc. was founded in 1925 and is headquartered in Juno Beach, Florida.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"24-12-2024 18:52:21"},{"Company Name":"Lennar Corporation","Symbol":"LEN","Current Price":"138.46","Latest MA":"168.12","Price Target":"168.21","Difference from MA":"-17.64%","Difference from Open":"0.71%","Change from Yesterday":"0.33%","Change from Last Report":"0.01","Latest Volume":"1,183,362","Market Cap":"37,420,199,936","Earning Date":"2024-12-18","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":8.44949,"ROE":0.15878001,"DTE":14.665,"Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":1.619,"Trailing PEG":1.033,"Trailing PE":9.675752,"Trailing PS":1.0262583,"Quick Ratio":3.257,"Day High":139.31,"Day Low":137.49,"VS Average Volume":0.5438831859,"Company Summary":"Lennar Corporation, together with its subsidiaries, operates as a homebuilder primarily under the Lennar brand in the United States. It operates through Homebuilding East, Homebuilding Central, Homebuilding Texas, Homebuilding West, Financial Services, Multifamily, and Lennar Other segments. The company's homebuilding operations include the construction and sale of single-family attached and detached homes, as well as the purchase, development, and sale of residential land; and development, construction, and management of multifamily rental properties. It also offers residential mortgage financing, title, insurance, and closing services for home buyers and others, as well as originates and sells securitization commercial mortgage loans. In addition, the company is involved in the fund investment activity. It primarily serves first-time, move-up, active adult, and luxury homebuyers. Lennar Corporation was founded in 1954 and is based in Miami, Florida.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"24-12-2024 18:52:21"},{"Company Name":"Southwest Airlines Company","Symbol":"LUV","Current Price":"34.15","Latest MA":"29.25","Price Target":"31.92","Difference from MA":"16.72%","Difference from Open":"0.91%","Change from Yesterday":"0.84%","Change from Last Report":"-0.02","Latest Volume":"1,154,500","Market Cap":"20,478,021,632","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":20.902075,"ROE":-0.00447,"DTE":87.36,"Industry":"Airlines","Sector":"Industrials","Beta":1.153,"Trailing PEG":0.5083,"Trailing PE":"N\/A","Trailing PS":0.7480282,"Quick Ratio":0.783,"Day High":34.18,"Day Low":33.755,"VS Average Volume":0.1486930531,"Company Summary":"Southwest Airlines Co. operates as a passenger airline company that provides scheduled air transportation services in the United States and near-international markets. As of December 31, 2023, the company operated a total fleet of 817 Boeing 737 aircraft; and served 121 destinations in 42 states, the District of Columbia, and the Commonwealth of Puerto Rico, as well as ten near-international countries, including Mexico, Jamaica, the Bahamas, Aruba, the Dominican Republic, Costa Rica, Belize, Cuba, the Cayman Islands, and Turks and Caicos. It also provides inflight entertainment and connectivity services on Wi-Fi enabled aircraft; and Rapid Rewards loyalty program that enables program members to earn points for dollars spent on Southwest base fares. In addition, the company offers a suite of digital platforms to support customers' travel needs, including websites and apps; and SWABIZ, an online booking tool. Further, it provides ancillary services, such as Southwest's EarlyBird Check-In, upgraded boarding, and transportation of pets and unaccompanied minors. Southwest Airlines Co. was incorporated in 1967 and is headquartered in Dallas, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"24-12-2024 18:52:21"}]