[{"Company Name":"Moderna, Inc.","Symbol":"MRNA","Current Price":"30.96","Latest MA":"55.53","Latest MA 5":32.5620004578,"Latest MA 9":33.746666904,"Latest MA 20":33.6647499542,"Price Target":56.00545,"Difference from MA":"-44.25%","Difference from Open":"0.60%","Change from Yesterday":"-0.42%","Change from Last Report":"0.00","Latest Volume":"8,748,005","Market Cap":"11,944,862,720","Earning Date":"2025-02-27","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":-3.5586207,"PB Ratio":1.0962784,"Previous Close":31.09,"ROE":-0.2877,"DTE":6.853,"Industry":"Biotechnology","Sector":"Healthcare","Beta":1.585,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":3.6912432,"Quick Ratio":3.453,"Day High":31.305,"Day Low":30.2007,"VS Average Volume":0.7925308809,"Company Summary":"Moderna, Inc., a biotechnology company, provides messenger RNA medicines in the United States, Europe, and internationally. The company's respiratory vaccines include spikevax, mRESVIA, COVID, RSV, seasonal influenza, combination, and pandemic influenza vaccine; latent vaccines comprise cytomegalovirus, epstein-barr virus, herpes simplex virus, varicella zoster virus, and human immunodeficiency virus vaccines; enteric viruses include norovirus; public health vaccines consist of Zika, Nipah, and Mpox vaccines; and bacterial diseases vaccines, such as lyme vaccines. It also provides oncology therapeutics, such as individualized neoantigen and checkpoint adaptive immune modulation therapy; and rare disease products, including propionic and methylmalonic acidemia, glycogen storage disease type 1a, ornithine transcarbamylase deficiency, phenylketonuria, crigler-najjar syndrome type 1, and cystic fibrosis. It has strategic alliances and collaborations with AstraZeneca; Merck & Co., Inc; Vertex Pharmaceuticals Incorporated; Vertex Pharmaceuticals (Europe) Limited; Generation Bio Co.; immatics N.V.; Life Edit Therapeutics; Carisma Therapeutics, Inc.; CytomX Therapeutics; Defense Advanced Research Projects Agency; Biomedical Advanced Research and Development Authority; Institute for Life Changing Medicines; The Bill & Melinda Gates Foundation; and OpenAI. The company was formerly known as Moderna Therapeutics, Inc. and changed its name to Moderna, Inc. in August 2018. Moderna, Inc. was founded in 2010 and is headquartered in Cambridge, Massachusetts.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"03-03-2025 01:40:34"}]