[{"Company Name":"Arista Networks, Inc.","Symbol":"ANET","Current Price":"120.23","Latest MA":"98.77","Price Target":112.49531,"Difference from MA":"21.73%","Difference from Open":"0.19%","Change from Yesterday":"1.49%","Change from Last Report":"0.00","Latest Volume":"4,003,380","Market Cap":"151,460,954,112","Earning Date":"2025-02-10","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":48.72365,"PB Ratio":4.0941906,"Previous Close":118.47,"ROE":0.33833998,"DTE":0.755,"Industry":"Computer Hardware","Sector":"Technology","Beta":1.077,"Trailing PEG":2.6776,"Trailing PE":57.52632,"Trailing PS":22.903008,"Quick Ratio":3.516,"Day High":121.01,"Day Low":118.673,"VS Average Volume":0.4867307044,"Company Summary":"Arista Networks Inc engages in the development, marketing, and sale of data-driven, client to cloud networking solutions for data center, campus, and routing environments in the Americas, Europe, the Middle East, Africa, and the Asia-Pacific. Its cloud networking solutions consist of Extensible Operating System (EOS), a publish-subscribe state-sharing networking operating system offered in combination with a set of network applications. The company offers data center and cloud networking systems, including newer artificial intelligence (AI) ethernet switching platforms; campus wired and wireless products, and routing systems addressing Core Routing, Edge Routing, Data Center Interconnect (DCI), Multi-cloud and Wide Area Networking (WAN) use cases; and a suite of value-add software solutions that leverage EOS to provide end-to-end orchestration, automation, analytics, network monitoring, and security. It also provides post contract customer support services, such as technical support, hardware repair and replacement parts beyond standard warranty, bug fixes, patches, and upgrade services. The company serves a range of industries comprising internet companies, service providers, financial services organizations, government agencies, media and entertainment companies, telecommunication service providers, and others. It markets and sells its products through distributors, system integrators, value-added resellers, and original equipment manufacturer partners, as well as through its direct sales force. The company was formerly known as Arastra, Inc. and changed its name to Arista Networks Inc in October 2008. Arista Networks Inc was incorporated in 2004 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"10-02-2025 23:53:22"},{"Company Name":"Coty Inc.","Symbol":"COTY","Current Price":"6.77","Latest MA":"8.31","Price Target":9.9381,"Difference from MA":"-18.54%","Difference from Open":"-0.59%","Change from Yesterday":"0.15%","Change from Last Report":"0.00","Latest Volume":"10,517,019","Market Cap":"5,889,209,344","Earning Date":"2025-02-10","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":11.112752,"PB Ratio":1.452478,"Previous Close":6.76,"ROE":0.04405,"DTE":94.436,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":1.914,"Trailing PEG":0.2187,"Trailing PE":37.61111,"Trailing PS":0.9578909,"Quick Ratio":0.391,"Day High":6.83,"Day Low":6.65,"VS Average Volume":2.0899370814,"Company Summary":"Coty Inc., together with its subsidiaries, manufactures, markets, distributes, and sells beauty products worldwide. It operates through Prestige and Consumer Beauty segments. The company provides fragrance, color cosmetics, and skin and body care products. It offers Prestige segment products primarily through prestige retailers, including perfumeries, department stores, e-retailers, direct-to-consumer websites, and duty-free shops under the Burberry, Calvin Klein, Chloe, Davidoff, Escada, Gucci, Hugo Boss, Infiniment Coty Paris, Jil Sander, Joop!, Kylie Jenner, Lancaster, Marc Jacobs, Miu Miu, Orveda, philosophy, SKKN BY KIM, and Tiffany & Co. brands. The company provides Consumer Beauty segment products primarily through hypermarkets, supermarkets, drug stores, pharmacies, mid-tier department stores, traditional food and drug retailers, and e-commerce retailers under the Adidas, Beckham, Bozzano, Bourjois, Bruno Banani, CoverGirl, Jovan, Max Factor, Mexx, Monange, Nautica, Paixao, LeGer by Lena Gercke, Rimmel, Risque, Vera Wang, and Sally Hansen brands. It also sells its products through third-party distributors. The company was founded in 1904 and is headquartered in New York, New York. Coty Inc. is a subsidiary of JAB Beauty B.V.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"10-02-2025 23:53:22"},{"Company Name":"Amkor Technology, Inc.","Symbol":"AMKR","Current Price":"24.36","Latest MA":"29.16","Price Target":33.928,"Difference from MA":"-16.47%","Difference from Open":"-0.65%","Change from Yesterday":"0.12%","Change from Last Report":"0.00","Latest Volume":"2,566,881","Market Cap":"6,007,931,392","Earning Date":"2025-02-10","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":12.430157,"PB Ratio":1.442957,"Previous Close":24.33,"ROE":0.09133001,"DTE":32.538,"Industry":"Semiconductor Equipment & Materials","Sector":"Technology","Beta":1.852,"Trailing PEG":null,"Trailing PE":16.45946,"Trailing PS":0.9328528,"Quick Ratio":1.795,"Day High":24.9577,"Day Low":24.2,"VS Average Volume":2.080501386,"Company Summary":"Amkor Technology, Inc. provides outsourced semiconductor packaging and test services in the United States, Japan, Europe, and the Asia Pacific. It offers turnkey packaging and test services, including semiconductor wafer bump, wafer probe, wafer back-grind, package design, packaging, system-level and final test, and drop shipment services; flip chip scale package products for smartphones, tablets, and other mobile consumer electronic devices; flip chip stacked chip scale packages that are used to stack memory digital baseband, and as applications processors in mobile devices; flip-chip ball grid array packages for various networking, storage, computing, automotive, and consumer applications; and memory products for system memory or platform data storage. The company also provides wafer-level CSP packages for power management, transceivers, sensors, wireless charging, codecs, radar, and specialty silicon; wafer-level fan-out packages used in power management, transceivers, radar, and specialty silicon; silicon wafer integrated fan-out technology that replaces a laminate substrate with a thinner structure; leadframe packages for electronic devices and mixed-signal applications; and substrate-based wirebond packages used to connect a die to a substrate. In addition, it offers micro-electro-mechanical systems packages that are miniaturized mechanical and electromechanical devices; and advanced system-in-package modules used in radio frequency and front end modules, basebands, connectivity, fingerprint sensors, display and touch screen drivers, sensors and MEMS, and NAND memory and solid-state drives. Further, the company provides wafer, package, and system level test services, as well as burn-in test and test development services. It serves integrated device manufacturers, fabless semiconductor companies, original equipment manufacturers, and contract foundries. The company was founded in 1968 and is headquartered in Tempe, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"10-02-2025 23:53:22"},{"Company Name":"ON Semiconductor Corporation","Symbol":"ON","Current Price":"47.04","Latest MA":"68.09","Price Target":78.62897,"Difference from MA":"-30.92%","Difference from Open":"-7.26%","Change from Yesterday":"-8.21%","Change from Last Report":"0.00","Latest Volume":"23,629,228","Market Cap":"20,029,491,200","Earning Date":"2025-02-10","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":9.044989,"PB Ratio":2.3325236,"Previous Close":51.25,"ROE":0.2183,"DTE":42.376,"Industry":"Semiconductors","Sector":"Technology","Beta":1.654,"Trailing PEG":1.5985,"Trailing PE":11.672456,"Trailing PS":2.7147956,"Quick Ratio":1.875,"Day High":51.0,"Day Low":46.57,"VS Average Volume":3.2293058351,"Company Summary":"ON Semiconductor Corporation provides intelligent sensing and power solutions in the United States and internationally. The company operates through Power Solutions Group, Advanced Solutions Group, and Intelligent Sensing Group. Its intelligent power technologies enable the electrification of the automotive industry that allows for lighter and longer-range electric vehicles, empowers fast-charging systems, and propels sustainable energy for the solar strings, industrial power, and storage systems. In addition, the company offers analog, discrete, module, and integrated semiconductor products that perform multiple application functions, includes power switching and conversion, signal conditioning, circuit protection, signal amplification, and voltage regulation functions. Further, it designs and develops analog, mixed-signal, power management ICs and sensor interface devices for automotive, industrial, compute and mobile markets. Additionally, the company offers single photon detectors, including silicon photomultipliers and single photon avalanche diode arrays, as well as actuator drivers for autofocus and image stabilization for a broad base of end-users in the different end-markets. ON Semiconductor Corporation was incorporated in 1992 and is headquartered in Scottsdale, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"10-02-2025 23:53:22"},{"Company Name":"McDonald's Corporation","Symbol":"MCD","Current Price":"308.42","Latest MA":"286.57","Price Target":320.74872,"Difference from MA":"7.62%","Difference from Open":"2.03%","Change from Yesterday":"4.80%","Change from Last Report":"0.00","Latest Volume":"7,106,893","Market Cap":"221,019,963,392","Earning Date":"2025-02-10","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":22.869576,"PB Ratio":"N\/A","Previous Close":294.3,"ROE":"N\/A","DTE":"N\/A","Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":0.735,"Trailing PEG":2.8271,"Trailing PE":27.078138,"Trailing PS":8.520857,"Quick Ratio":0.584,"Day High":310.28,"Day Low":301.51,"VS Average Volume":2.4011550179,"Company Summary":"McDonald's Corporation operates and franchises restaurants under the McDonald's brand in the United States and internationally. It offers food and beverages, including hamburgers and cheeseburgers, various chicken sandwiches, fries, shakes, desserts, sundaes, cookies, pies, soft drinks, coffee, and other beverages; and full or limited breakfast, as well as sells various other products during limited-time promotions. The company owns and operates under various structures comprising conventional franchise, developmental license, or affiliate. McDonald's Corporation was founded in 1940 and is based in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"10-02-2025 23:53:22"},{"Company Name":"Incyte Corporation","Symbol":"INCY","Current Price":"68.30","Latest MA":"68.63","Price Target":79.92167,"Difference from MA":"-0.48%","Difference from Open":"-6.92%","Change from Yesterday":"-7.86%","Change from Last Report":"0.00","Latest Volume":"3,720,266","Market Cap":"13,157,995,520","Earning Date":"2025-02-10","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":9.090619,"PB Ratio":4.1524806,"Previous Close":74.13,"ROE":0.00802,"DTE":1.151,"Industry":"Biotechnology","Sector":"Healthcare","Beta":0.71,"Trailing PEG":0.6535,"Trailing PE":758.8889,"Trailing PS":3.2282746,"Quick Ratio":1.687,"Day High":73.42,"Day Low":67.58,"VS Average Volume":2.01065028,"Company Summary":"Incyte Corporation, a biopharmaceutical company, engages in the discovery, development, and commercialization of therapeutics for hematology\/oncology, and inflammation and autoimmunity areas in the United States and internationally. The company offers JAKAFI (ruxolitinib) for treatment of intermediate or high-risk myelofibrosis, polycythemia vera, and steroid-refractory acute graft-versus-host disease; MONJUVI (tafasitamab-cxix)\/MINJUVI (tafasitamab) for relapsed or refractory diffuse large B-cell lymphoma; PEMAZYRE (pemigatinib), a fibroblast growth factor receptor kinase inhibitor that act as oncogenic drivers in liquid and solid tumor types; ICLUSIG (ponatinib) to treat chronic myeloid leukemia and Philadelphia-chromosome positive acute lymphoblastic leukemia; and ZYNYZ (retifanlimab-dlwr) to treat adults with metastatic or recurrent locally advanced Merkel cell carcinoma, as well as OPZELURA cream for treatment of atopic dermatitis. Its clinical stage products include retifanlimab under Phase 3 clinical trials for squamous cell carcinoma of the anal canal and non-small cell lung cancer; axatilimab, an anti-CSF-1R monoclonal antibody under Phase 2 that is being developed as a therapy for patients with chronic GVHD; INCA033989 to inhibit oncogenesis; INCB160058, which is being developed as a disease-modifying therapeutic; and INCB99280 and INCB99318 for the treatment solid tumors. The company also develops INCB123667, INCA32459, and INCA33890, as well as Ruxolitinib cream, Povorcitinib, and INCA034460. It has collaboration out-license agreements with Novartis and Lilly; in-license agreements with Agenus, Merus, MacroGenics, and Syndax; and collaboration and license agreement with China Medical System Holdings Limited for the development and commercialization of povorcitinib. The company sells its products to specialty, retail, and hospital pharmacies, distributors, and wholesalers. The company was formerly known as Incyte Genomics Inc and changed its name to Incyte Corporation in March 2003. Incyte Corporation was incorporated in 1991 and is headquartered in Wilmington, Delaware.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"10-02-2025 23:53:22"},{"Company Name":"Kimco Realty Corporation (HC)","Symbol":"KIM","Current Price":"22.14","Latest MA":"22.90","Price Target":25.75,"Difference from MA":"-3.32%","Difference from Open":"-0.58%","Change from Yesterday":"-1.12%","Change from Last Report":"0.00","Latest Volume":"3,485,344","Market Cap":"15,043,996,672","Earning Date":"2025-02-07","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":28.606867,"PB Ratio":1.4182307,"Previous Close":22.39,"ROE":0.03829,"DTE":78.638,"Industry":"REIT - Retail","Sector":"Real Estate","Beta":1.485,"Trailing PEG":87.8824,"Trailing PE":40.254543,"Trailing PS":7.6629195,"Quick Ratio":3.264,"Day High":22.38,"Day Low":21.965,"VS Average Volume":0.8396737906,"Company Summary":"Kimco Realty (NYSE: KIM) is a real estate investment trust (REIT) and leading owner and operator of high-quality, open-air, grocery-anchored shopping centers and mixed-use properties in the United States. The company's portfolio is strategically concentrated in the first-ring suburbs of the top major metropolitan markets, including high-barrier-to-entry coastal markets and rapidly expanding Sun Belt cities. Its tenant mix is focused on essential, necessity-based goods and services that drive multiple shopping trips per week. Publicly traded on the NYSE since 1991 and included in the S&P 500 Index, the company has specialized in shopping center ownership, management, acquisitions, and value-enhancing redevelopment activities for more than 60 years. With a proven commitment to corporate responsibility, Kimco Realty is a recognized industry leader in this area. As of September 30, 2024, the company owned interests in 567 U.S. shopping centers and mixed-use assets comprising 101 million square feet of gross leasable space.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"10-02-2025 23:53:22"},{"Company Name":"Avantor, Inc.","Symbol":"AVTR","Current Price":"19.01","Latest MA":"23.28","Price Target":24.84737,"Difference from MA":"-18.35%","Difference from Open":"-2.51%","Change from Yesterday":"-0.78%","Change from Last Report":"0.00","Latest Volume":"9,272,383","Market Cap":"12,943,966,208","Earning Date":"2025-02-07","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":15.758932,"PB Ratio":2.3299422,"Previous Close":19.16,"ROE":0.058130004,"DTE":88.619,"Industry":"Medical Instruments & Supplies","Sector":"Healthcare","Beta":1.348,"Trailing PEG":null,"Trailing PE":18.278847,"Trailing PS":1.8979979,"Quick Ratio":0.842,"Day High":19.525,"Day Low":18.5,"VS Average Volume":1.6284391497,"Company Summary":"Avantor, Inc. engages in the provision of mission-critical products and services to customers in the biopharma, healthcare, education and government, advanced technologies, and applied materials industries in the Americas, Europe, Asia, the Middle East, and Africa. The company offers materials and consumables, such as purity chemicals and reagents, lab products and supplies, formulated silicone materials, customized excipients, customized single-use assemblies, process chromatography resins and columns, analytical sample prep kits, education and microbiology products, clinical trial kits, peristaltic pumps, and fluid handling tips. It also provides equipment and instrumentation products, including filtration systems, virus inactivation systems, incubators, analytical instruments, evaporators, ultra-low-temperature freezers, biological safety cabinets, and critical environment supplies. In addition, the company offers services and specialty procurements comprising onsite lab and production, clinical, equipment, procurement and sourcing, and biopharmaceutical material scale-up and development services. Further, it provides scientific research support services, such as DNA extraction, bioreactor servicing, clinical and biorepository, and compound management services. The company was founded in 1904 and is headquartered in Radnor, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"10-02-2025 23:53:22"},{"Company Name":"Coca-Cola Company (The)","Symbol":"KO","Current Price":"64.55","Latest MA":"65.71","Price Target":71.7132,"Difference from MA":"-1.76%","Difference from Open":"0.70%","Change from Yesterday":"1.11%","Change from Last Report":"0.00","Latest Volume":"12,400,130","Market Cap":"278,068,494,336","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":21.87446,"PB Ratio":10.490818,"Previous Close":63.84,"ROE":0.3723,"DTE":167.358,"Industry":"Beverages - Non-Alcoholic","Sector":"Consumer Defensive","Beta":0.62,"Trailing PEG":2.7031,"Trailing PE":26.784233,"Trailing PS":5.99725,"Quick Ratio":0.784,"Day High":64.65,"Day Low":63.66,"VS Average Volume":0.7242425685,"Company Summary":"The Coca-Cola Company, a beverage company, manufactures, markets, and sells various nonalcoholic beverages worldwide. The company provides sparkling soft drinks, sparkling flavors; water, sports, coffee, and tea; juice, value-added dairy, and plant-based beverages; and other beverages. It also offers beverage concentrates and syrups, as well as fountain syrups to fountain retailers, such as restaurants and convenience stores. The company sells its products under the Coca-Cola, Diet Coke\/Coca-Cola Light, Coca-Cola Zero Sugar, caffeine free Diet Coke, Cherry Coke, Fanta Orange, Fanta Zero Orange, Fanta Zero Sugar, Fanta Apple, Sprite, Sprite Zero Sugar, Simply Orange, Simply Apple, Simply Grapefruit, Fresca, Schweppes, Thums Up, Aquarius, Ayataka, BODYARMOR, Ciel, Costa, Dasani, dogadan, FUZE TEA, Georgia, glacéau smartwater, glacéau vitaminwater, Gold Peak, Ice Dew, I LOHAS, Powerade, Topo Chico, AdeS, Del Valle, fairlife, innocent, Minute Maid, and Minute Maid Pulpy brands. It operates through a network of independent bottling partners, distributors, wholesalers, and retailers, as well as through bottling and distribution operators. The company was founded in 1886 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"10-02-2025 23:53:22"},{"Company Name":"Royalty Pharma plc","Symbol":"RPRX","Current Price":"31.72","Latest MA":"27.47","Price Target":40.69778,"Difference from MA":"15.48%","Difference from Open":"-0.03%","Change from Yesterday":"-0.03%","Change from Last Report":"0.00","Latest Volume":"3,300,880","Market Cap":"18,688,882,688","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":7.5404773,"PB Ratio":2.0594728,"Previous Close":31.73,"ROE":0.17276,"DTE":74.157,"Industry":"Biotechnology","Sector":"Healthcare","Beta":0.466,"Trailing PEG":6.814,"Trailing PE":12.488189,"Trailing PS":8.24751,"Quick Ratio":1.532,"Day High":31.79,"Day Low":31.345,"VS Average Volume":0.909085401,"Company Summary":"Royalty Pharma plc operates as a buyer of biopharmaceutical royalties and a funder of innovations in the biopharmaceutical industry in the United States. It is also involved in the identification, evaluation, and acquisition of royalties on various biopharmaceutical therapies. In addition, the company collaborates with innovators from academic institutions, research hospitals and not-for-profits, small and mid-cap biotechnology companies, and pharmaceutical companies. Its portfolio consists of royalties on approximately 35 commercial products and 14 development-stage product candidates that address various therapeutic areas, such as rare disease, cancer, neuroscience, immunology, respiratory, infectious disease, hematology, and diabetes. The company was founded in 1996 and is based in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"10-02-2025 23:53:22"},{"Company Name":"Super Micro Computer, Inc.","Symbol":"SMCI","Current Price":"42.65","Latest MA":"44.78","Price Target":40.79182,"Difference from MA":"-4.75%","Difference from Open":"12.24%","Change from Yesterday":"17.56%","Change from Last Report":"0.00","Latest Volume":"128,477,605","Market Cap":"24,974,348,288","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":11.687526,"PB Ratio":4.5761805,"Previous Close":36.28,"ROE":0.32469,"DTE":39.749,"Industry":"Computer Hardware","Sector":"Technology","Beta":1.279,"Trailing PEG":null,"Trailing PE":21.218906,"Trailing PS":1.6713238,"Quick Ratio":1.805,"Day High":42.8785,"Day Low":37.36,"VS Average Volume":1.8795448385,"Company Summary":"Super Micro Computer, Inc., together with its subsidiaries, develops and manufactures high performance server and storage solutions based on modular and open architecture in the United States, Europe, Asia, and internationally. Its solutions range from complete server, storage systems, modular blade servers, blades, workstations, full racks, networking devices, server sub-systems, server management software, and security software. The company provides application-optimized server solutions, rackmount and blade servers, storage, and subsystems and accessories; and server software management solutions, such as Server Management Suite, including Supermicro Server Manager, Supermicro Power Management software, Supermicro Update Manager, SuperCloud Composer, and SuperDoctor 5. In addition, it offers server subsystems and accessories comprising server boards, chassis, power supplies, and other accessories. Further, the company provides server and storage system integration, configuration, and software upgrade and update services; and technical documentation services, as well as identifies service requirements, creates and executes project plans, and conducts verification testing and technical documentation, and training services. Additionally, it offers help desk and on-site product support services for its server and storage systems; and customer support services, including ongoing maintenance and technical support for its products. The company provides its products to enterprise data centers, cloud computing, artificial intelligence, and 5G and edge computing markets. It sells its products through direct and indirect sales force, distributors, value-added resellers, system integrators, and original equipment manufacturers. The company was incorporated in 1993 and is headquartered in San Jose, California.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"10-02-2025 23:53:22"},{"Company Name":"Energy Transfer LP","Symbol":"ET","Current Price":"20.09","Latest MA":"17.00","Price Target":22.20235,"Difference from MA":"18.19%","Difference from Open":"-1.66%","Change from Yesterday":"0.80%","Change from Last Report":"0.00","Latest Volume":"20,796,309","Market Cap":"68,786,552,832","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":14.553858,"PB Ratio":2.1939502,"Previous Close":19.93,"ROE":0.15253,"DTE":128.9,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":1.643,"Trailing PEG":0.7081,"Trailing PE":14.7720585,"Trailing PS":0.82219595,"Quick Ratio":0.835,"Day High":20.55,"Day Low":20.0,"VS Average Volume":1.2485637617,"Company Summary":"Energy Transfer LP provides energy-related services. The company owns and operates natural gas transportation pipeline, and natural gas storage facilities in Texas and Oklahoma; and approximately 20,090 miles of interstate natural gas pipeline. It also sells natural gas to electric utilities, independent power plants, local distribution and other marketing companies, and industrial end-users. In addition, the company owns and operates natural gas gathering pipelines, processing plant, and treating and conditioning facilities in Texas, New Mexico, West Virginia, Pennsylvania, Ohio, Oklahoma, Arkansas, Kansas, Montana, North Dakota, Wyoming, and Louisiana; natural gas gathering, oil pipeline, and oil stabilization facilities in South Texas; and transports and supplies water to natural gas producer in Pennsylvania. Further, it owns 5,700 miles of natural gas liquid (NGL) pipeline; NGL fractionation facilities; NGL storage facilities; and other NGL storage assets and terminal. Additionally, the company provides crude oil transportation, terminalling, acquisition, and marketing activities; owns and operates approximately 14,500 miles of crude oil trunk and gathering pipelines in the Southwest, Midcontinent, and Midwest United States; and sells and distributes gasoline, middle distillate, and motor fuels and other petroleum products. It also offers natural gas compression services; carbon dioxide and hydrogen sulfide removal services; and manages coal and natural resources properties, as well as sells standing timber, leases coal-related infrastructure facilities, collects oil and gas royalty, and generate electrical power. The company was formerly known as Energy Transfer Equity, L.P. and changed its name to Energy Transfer LP in October 2018. Energy Transfer LP was founded in 1996 and is headquartered in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"10-02-2025 23:53:22"},{"Company Name":"GlobalFoundries Inc.","Symbol":"GFS","Current Price":"37.74","Latest MA":"43.48","Price Target":48.56842,"Difference from MA":"-13.21%","Difference from Open":"-2.28%","Change from Yesterday":"-1.85%","Change from Last Report":"0.00","Latest Volume":"4,203,509","Market Cap":"20,857,200,640","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":21.445498,"PB Ratio":1.8085107,"Previous Close":38.45,"ROE":0.066479996,"DTE":24.599,"Industry":"Semiconductors","Sector":"Technology","Beta":1.527,"Trailing PEG":1.499,"Trailing PE":28.59091,"Trailing PS":3.079008,"Quick Ratio":1.74,"Day High":39.57,"Day Low":37.59,"VS Average Volume":2.5982133034,"Company Summary":"GlobalFoundries Inc., a semiconductor foundry, provides range of mainstream wafer fabrication services and technologies worldwide. It manufactures various semiconductor devices, including microprocessors, mobile application processors, baseband processors, network processors, radio frequency modems, microcontrollers, and power management units. GlobalFoundries Inc. has a strategic partnership with Efficient Computer to develop high-performance computer processors. The company was incorporated in 2008 and is headquartered in Malta, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"10-02-2025 23:53:22"},{"Company Name":"Edwards Lifesciences Corporatio","Symbol":"EW","Current Price":"71.10","Latest MA":"70.80","Price Target":79.489,"Difference from MA":"0.42%","Difference from Open":"0.67%","Change from Yesterday":"1.07%","Change from Last Report":"0.00","Latest Volume":"2,163,968","Market Cap":"41,934,778,368","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":29.066916,"PB Ratio":4.3932276,"Previous Close":70.35,"ROE":0.19139,"DTE":7.353,"Industry":"Medical Devices","Sector":"Healthcare","Beta":1.12,"Trailing PEG":6.5188,"Trailing PE":27.451738,"Trailing PS":6.6406083,"Quick Ratio":2.704,"Day High":71.31,"Day Low":70.0965,"VS Average Volume":0.4466600726,"Company Summary":"Edwards Lifesciences Corporation provides products and technologies for structural heart disease and critical care monitoring in the United States, Europe, Japan, and internationally. It offers transcatheter heart valve replacement products for the minimally invasive replacement of aortic heart valves under the Edwards SAPIEN family of valves system; and transcatheter heart valve repair and replacement products to treat mitral and tricuspid valve diseases under the PASCAL PRECISION and Cardioband names. The company also provides surgical structural heart solutions, such as aortic surgical valve under the INSPIRIS name; INSPIRIS RESILLA aortic valve, which offers RESILIA tissue and VFit technology; KONECT RESILIA, a pre-assembled tissue valves conduit for complex combined procedures; and MITRIS RESILIA valve. In addition, it offers critical care solutions, including hemodynamic monitoring systems to measure a patient's heart function and fluid status in surgical and intensive care settings under the FloTrac, Acumen IQ sensors, ClearSight, Acumen IQ cuffs, and ForeSight names; HemoSphere, a monitoring platform that displays physiological information; and Acumen Hypotension Prediction Index software that alerts clinicians in advance of a patient developing dangerously low blood pressure. The company distributes its products through a direct sales force and independent distributors. Edwards Lifesciences Corporation was founded in 1958 and is headquartered in Irvine, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"10-02-2025 23:53:22"},{"Company Name":"Carrier Global Corporation","Symbol":"CARR","Current Price":"66.23","Latest MA":"71.60","Price Target":80.0895,"Difference from MA":"-7.50%","Difference from Open":"2.22%","Change from Yesterday":"3.21%","Change from Last Report":"0.00","Latest Volume":"6,193,029","Market Cap":"59,423,346,688","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":22.171339,"PB Ratio":4.046805,"Previous Close":64.17,"ROE":0.13931,"DTE":85.607,"Industry":"Building Products & Equipment","Sector":"Industrials","Beta":1.212,"Trailing PEG":1.2212,"Trailing PE":38.958824,"Trailing PS":2.396006,"Quick Ratio":0.513,"Day High":66.38,"Day Low":64.51,"VS Average Volume":1.2087477955,"Company Summary":"Carrier Global Corporation provides heating, ventilating, and air conditioning (HVAC), refrigeration, fire, security, and building automation technologies in the United States, Europe, the Asia Pacific, and internationally. It operates through three segments: HVAC, Refrigeration, and Fire & Security. The HVAC segment provides products, controls, services, and solutions to meet the heating, cooling, and ventilation needs of residential and commercial customers. Its products include air conditioners, heating systems, heat pumps, controls, and aftermarket components, as well as aftermarket repair and maintenance services and building automation solutions. The Refrigeration segment offers transport refrigeration and monitoring products and services, as well as digital solutions for trucks, trailers, shipping containers, intermodal applications, food retail, and warehouse cooling; and commercial refrigeration solutions, such as refrigerated cabinets, freezers, systems, and controls. The Fire & Security segment provides various residential, commercial, and industrial technologies, including fire, flame, gas, smoke, and carbon monoxide detection; portable fire extinguishers; fire suppression systems; intruder alarms; access control systems; video management systems; and electronic controls. This segment also offers fire and security service, such as audit, design, installation, and system integration, as well as aftermarket maintenance and repair and monitoring services. It offers its products under the Autronica, Det-Tronics, Edwards, Aritech, Fireye, GST, Kidde, LenelS2, Marioff, Onity, and Supra; Carrier, Toshiba, Automated Logic, Bryant, CIAT, Day & Night, Heil, NORESCO, and Riello; and Carrier Commercial Refrigeration, Carrier Transicold, and Sensitech brands. Carrier Global Corporation was incorporated in 2019 and is headquartered in Palm Beach Gardens, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"10-02-2025 23:53:22"},{"Company Name":"Zillow Group, Inc.","Symbol":"Z","Current Price":"87.97","Latest MA":"65.91","Price Target":84.25,"Difference from MA":"33.47%","Difference from Open":"0.25%","Change from Yesterday":"0.74%","Change from Last Report":"0.00","Latest Volume":"2,494,785","Market Cap":"20,769,982,464","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":43.83836,"PB Ratio":4.408861,"Previous Close":87.32,"ROE":-0.028959999,"DTE":25.0,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":2.017,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":9.633573,"Quick Ratio":2.689,"Day High":88.76,"Day Low":87.32,"VS Average Volume":0.9943125998,"Company Summary":"Zillow Group, Inc. operates real estate brands in mobile applications and Websites in the United States. The company offers premier agent and rentals marketplaces, new construction marketplaces, advertising, display advertising, and business technology solutions, as well as dotloop and floor plans. It also provides mortgage originations and the sale of mortgages, and advertising to mortgage lenders and other mortgage professionals; and title and escrow services. In addition, the company's brand portfolio includes Zillow Premier Agent, Zillow Home Loans, Zillow Rentals, Trulia, StreetEasy, HotPads, and Out East; and a suite of marketing software and technology solutions for the real estate industry, including ShowingTime+, Spruce, and Follow Up Boss. Zillow Group, Inc. was incorporated in 2004 and is headquartered in Seattle, Washington.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"10-02-2025 23:53:22"},{"Company Name":"Welltower Inc.","Symbol":"WELL","Current Price":"143.11","Latest MA":"125.54","Price Target":148.47368,"Difference from MA":"13.99%","Difference from Open":"0.65%","Change from Yesterday":"0.36%","Change from Last Report":"0.00","Latest Volume":"1,468,652","Market Cap":"89,113,165,824","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":76.73458,"PB Ratio":2.9174566,"Previous Close":142.59,"ROE":0.03417,"DTE":52.153,"Industry":"REIT - Healthcare Facilities","Sector":"Real Estate","Beta":1.194,"Trailing PEG":2.5897,"Trailing PE":91.15286,"Trailing PS":11.794401,"Quick Ratio":2.224,"Day High":143.8419,"Day Low":140.8023,"VS Average Volume":0.5333132885,"Company Summary":"Welltower Inc. (NYSE:WELL), a real estate investment trust (\"REIT\") and S&P 500 company headquartered in Toledo, Ohio, is driving the transformation of health care infrastructure. Welltower invests with leading seniors housing operators, post-acute providers and health systems to fund the real estate infrastructure needed to scale innovative care delivery models and improve people's wellness and overall health care experience. Welltower owns interests in properties concentrated in major, high-growth markets in the United States, Canada and the United Kingdom, consisting of seniors housing and post-acute communities and outpatient medical properties.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"10-02-2025 23:53:22"},{"Company Name":"Humana Inc.","Symbol":"HUM","Current Price":"266.80","Latest MA":"304.07","Price Target":297.59546,"Difference from MA":"-12.26%","Difference from Open":"-2.18%","Change from Yesterday":"-2.74%","Change from Last Report":"0.00","Latest Volume":"2,574,706","Market Cap":"32,125,652,992","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":15.782126,"PB Ratio":1.828963,"Previous Close":274.33,"ROE":0.078379996,"DTE":75.908,"Industry":"Healthcare Plans","Sector":"Healthcare","Beta":0.52,"Trailing PEG":1.2953,"Trailing PE":23.26068,"Trailing PS":0.2793292,"Quick Ratio":1.404,"Day High":272.74,"Day Low":259.07,"VS Average Volume":1.558415162,"Company Summary":"Humana Inc., together with its subsidiaries, provides medical and specialty insurance products in the United States. It operates through two segments, Insurance and CenterWell. The company offers medical and supplemental benefit plans to individuals. It has a contract with Centers for Medicare and Medicaid Services to administer the Limited Income Newly Eligible Transition prescription drug plan program; and contracts with various states to provide Medicaid, dual eligible, and long-term support services benefits. In addition, the company provides commercial fully-insured medical and specialty health insurance benefits comprising dental, vision, life insurance, and other supplemental health benefits, as well as administrative services only products to individuals and employer groups; military services, such as TRICARE T2017 East Region contract; and engages in the operations of pharmacy benefit manager business. Further, it operates pharmacies and senior focused primary care centers; and offers home solutions services, such as home health, hospice, and other services to its health plan members, as well as to third parties. The company sells its products through employers and employees, independent brokers and agents, sales representatives, and digital insurance agencies. The company was formerly known as Extendicare Inc. and changed its name to Humana Inc. in April 1974. Humana Inc. was founded in 1961 and is headquartered in Louisville, Kentucky.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"10-02-2025 23:53:22"},{"Company Name":"Plains GP Holdings, L.P.","Symbol":"PAGP","Current Price":"21.05","Latest MA":"18.59","Price Target":21.60714,"Difference from MA":"13.21%","Difference from Open":"1.06%","Change from Yesterday":"1.54%","Change from Last Report":"0.00","Latest Volume":"2,300,722","Market Cap":"4,901,618,688","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":12.167629,"PB Ratio":2.8430579,"Previous Close":20.73,"ROE":0.090270005,"DTE":55.928,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":1.517,"Trailing PEG":0.7738,"Trailing PE":28.835615,"Trailing PS":0.097314194,"Quick Ratio":0.896,"Day High":21.24,"Day Low":20.79,"VS Average Volume":1.3480885123,"Company Summary":"Plains GP Holdings, L.P., through its subsidiary, Plains All American Pipeline, L.P., owns and operates midstream infrastructure systems in the United States and Canada. It operates in two segments, Crude Oil and Natural Gas Liquids (NGLs). The company engages in the gathering and transporting crude oil and NGLs using pipelines, gathering systems, and trucks. It engages in the loading and unloading services at terminals; NGL fractionation and isomerization services; and natural gas and condensate processing services. The company offers logistics services to producers, refiners, and other customers. PAA GP Holdings LLC operates as a general partner of the company. Plains GP Holdings, L.P. was incorporated in 2013 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"10-02-2025 23:53:22"},{"Company Name":"Shopify Inc.","Symbol":"SHOP","Current Price":"119.90","Latest MA":"88.39","Price Target":121.4825,"Difference from MA":"35.65%","Difference from Open":"-1.28%","Change from Yesterday":"2.12%","Change from Last Report":"0.00","Latest Volume":"11,981,035","Market Cap":"154,625,441,792","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":78.03703,"PB Ratio":15.3070345,"Previous Close":117.41,"ROE":0.15031,"DTE":11.277,"Industry":"Software - Application","Sector":"Technology","Beta":2.365,"Trailing PEG":null,"Trailing PE":112.05607,"Trailing PS":18.829206,"Quick Ratio":5.62,"Day High":123.4099,"Day Low":119.14,"VS Average Volume":1.472791483,"Company Summary":"Shopify Inc., a commerce company, provides a commerce platform and services in Canada, the United States, Europe, the Middle East, Africa, the Asia Pacific, Australia, China, and Latin America. The company's platform enables merchants to displays, manages, markets, and sells its products through various sales channels, including web and mobile storefronts, physical retail locations, pop-up shops, social media storefronts, native mobile apps, buy buttons, and marketplaces; and enables to manage products and inventory, process orders and payments, fulfill and ship orders, new buyers and build customer relationships, source products, leverage analytics and reporting, manage cash, payments and transactions, and access financing. It also sells custom themes and apps, and registration of domain names; and merchant solutions, which include accepting payments, shipping, and securing working capital. The company was formerly known as Jaded Pixel Technologies Inc. and changed its name to Shopify Inc. in November 2011. Shopify Inc. was incorporated in 2004 and is headquartered in Ottawa, Canada.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"10-02-2025 23:53:22"},{"Company Name":"DoorDash, Inc.","Symbol":"DASH","Current Price":"192.63","Latest MA":"150.32","Price Target":186.48425,"Difference from MA":"28.14%","Difference from Open":"-3.05%","Change from Yesterday":"-1.49%","Change from Last Report":"0.00","Latest Volume":"4,918,728","Market Cap":"80,017,735,680","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":41.738712,"PB Ratio":10.566069,"Previous Close":195.54,"ROE":-0.02517,"DTE":7.02,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.671,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":7.881968,"Quick Ratio":1.364,"Day High":198.69,"Day Low":192.39,"VS Average Volume":1.8644292784,"Company Summary":"DoorDash, Inc., together with its subsidiaries, operates a commerce platform that connects merchants, consumers, and independent contractors in the United States and internationally. The company operates DoorDash Marketplace and Wolt Marketplace, which provide various services, such as customer acquisition, demand generation, order fulfillment, merchandising, payment processing, and customer support. It also offers membership products, including DashPass and Wolt+; DoorDash Drive and Wolt Drive, which are white-label delivery fulfillment services that enable merchants that have generated consumer demand through their channels to fulfill demand using its platform; DoorDash Storefront that enables merchants to offer consumers on-demand access to e-commerce; and Bbot, which offers merchants digital ordering and payment solutions for in-store and online channels. In addition, the company enables merchants to advertise and promote on its platform to acquire consumers. The company was formerly known as Palo Alto Delivery Inc. and changed its name to DoorDash, Inc. in 2015. DoorDash, Inc. was founded in 2013 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"10-02-2025 23:53:22"},{"Company Name":"Masco Corporation","Symbol":"MAS","Current Price":"77.58","Latest MA":"77.88","Price Target":84.50526,"Difference from MA":"-0.38%","Difference from Open":"-0.33%","Change from Yesterday":"0.43%","Change from Last Report":"0.00","Latest Volume":"2,156,299","Market Cap":"16,737,807,360","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":17.609726,"PB Ratio":"N\/A","Previous Close":77.25,"ROE":5.70874,"DTE":2238.028,"Industry":"Building Products & Equipment","Sector":"Industrials","Beta":1.25,"Trailing PEG":1.8902,"Trailing PE":20.632978,"Trailing PS":2.1235483,"Quick Ratio":1.111,"Day High":78.49,"Day Low":77.27,"VS Average Volume":1.5412616293,"Company Summary":"Masco Corporation designs, manufactures, and distributes home improvement and building products in North America, Europe, and internationally. The company's Plumbing Products segment offers faucets, showerheads, handheld showers, valves, bath hardware and accessories, bathing units, shower bases and enclosures, sinks, toilets, acrylic tubs, shower trays, spas, exercise pools, and fitness systems; brass, copper, and composite plumbing system components; connected water products; thermoplastic solutions, extruded plastic profiles, specialized fabrications, and PEX tubing products; and other non-decorative plumbing products. This segment provides its products under the DELTA, BRIZO, PEERLESS, HANSGROHE, AXOR, KRAUS, EASY DRAIN, STEAMIST, ELITESTEAM, GINGER, NEWPORT BRASS, BRASSTECH, WALTEC, BRISTAN, HERITAGE, MIROLIN, HOT SPRING, CALDERA, FREEFLOW SPAS, FANTASY SPAS, ENDLESS POOLS, BRASSCRAFT, PLUMB SHOP, COBRA, COBRA PRO, and MASTER PLUMBER brands. Its Decorative Architectural Products segment offers paints, primers, specialty coatings, stains, and waterproofing products, as well as paint applicators and accessories; cabinet and door hardware, functional hardware, wall plates, hook and rail products, closet organization systems, and picture hanging accessories; decorative bath hardware, mirrors, and shower accessories and doors; and decorative indoor and outdoor lighting fixtures, ceiling fans, landscape lighting, and LED lighting systems. This segment provides its products under the BEHR, KILZ, WHIZZ, Elder & Jenks, LIBERTY, BRAINERD, FRANKLIN BRASS, KICHLER, and ÉLAN brands. It sells its products to the plumbing, heating, and hardware wholesalers; home centers and online retailers; hardware stores; electrical and landscape distributors; lighting showrooms; building supply outlets; and other mass merchandisers. Masco Corporation was incorporated in 1929 and is headquartered in Livonia, Michigan.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"10-02-2025 23:53:22"},{"Company Name":"Gilead Sciences, Inc.","Symbol":"GILD","Current Price":"95.48","Latest MA":"84.68","Price Target":101.2368,"Difference from MA":"12.75%","Difference from Open":"-0.58%","Change from Yesterday":"-0.58%","Change from Last Report":"0.00","Latest Volume":"9,625,593","Market Cap":"118,993,862,656","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":12.555542,"PB Ratio":6.439604,"Previous Close":96.04,"ROE":0.00561,"DTE":126.415,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.192,"Trailing PEG":0.5673,"Trailing PE":1060.8889,"Trailing PS":4.204879,"Quick Ratio":0.962,"Day High":96.165,"Day Low":94.56,"VS Average Volume":1.3807140828,"Company Summary":"Gilead Sciences, Inc., a biopharmaceutical company, discovers, develops, and commercializes medicines in the areas of unmet medical need in the United States, Europe, and internationally. The company provides Biktarvy, Genvoya, Descovy, Odefsey, Truvada, Complera\/ Eviplera, Stribild, Sunlencs, and Atripla products for the treatment of HIV\/AIDS; Veklury, an injection for intravenous use, for the treatment of COVID-19; and Epclusa, Harvoni, Vemlidy, and Viread for the treatment of viral hepatitis. It also offers Yescarta, Tecartus, and Trodelvy products for the treatment of oncology; Letairis, an oral formulation for the treatment of pulmonary arterial hypertension; and AmBisome, a liposomal formulation for the treatment of serious invasive fungal infections. The company has collaboration agreements with Arcus Biosciences, Inc.; Merck Sharp & Dohme Corp.; Pionyr Immunotherapeutics Inc.; Tizona Therapeutics, Inc.; Galapagos NV; Janssen Sciences Ireland Unlimited Company; Japan Tobacco, Inc.; Dragonfly Therapeutics, Inc.; Arcellx, Inc.; Everest Medicines; Merck & Co, Inc.; Tentarix Biotherapeutics Inc.; Marengo Therapeutics; and Assembly Biosciences, Inc. It also has research collaboration, option, and license agreement with Merus N.V. for the discovery of novel dual tumor-associated antigens (TAA) targeting trispecific antibodies. The company has a collaboration with Terray Therapeutics, Inc. to discover and develop small molecule therapies; and LEO Pharma to develop, manufacture, and commercialize the small molecule oral STAT6 program. The company was incorporated in 1987 and is headquartered in Foster City, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"10-02-2025 23:53:22"},{"Company Name":"American International Group, I","Symbol":"AIG","Current Price":"75.09","Latest MA":"74.22","Price Target":83.29,"Difference from MA":"1.17%","Difference from Open":"0.37%","Change from Yesterday":"0.54%","Change from Last Report":"0.00","Latest Volume":"3,001,881","Market Cap":"46,838,812,672","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":11.431329,"PB Ratio":1.050827,"Previous Close":74.69,"ROE":0.085,"DTE":22.306,"Industry":"Insurance - Diversified","Sector":"Financial Services","Beta":1.069,"Trailing PEG":1.0651,"Trailing PE":14.928428,"Trailing PS":1.0339922,"Quick Ratio":0.232,"Day High":75.43,"Day Low":74.7,"VS Average Volume":0.7498126643,"Company Summary":"American International Group, Inc. offers insurance products for commercial, institutional, and individual customers in North America and internationally. It operates through three segments: General Insurance, Life and Retirement, and Other Operations. The General Insurance segment provides commercial and industrial property insurance, including business interruption and package insurance that cover exposure to made and natural disasters; general liability, environmental, commercial automobile liability, workers' compensation, excess casualty, and crisis management insurance products; and professional liability insurance. This segment offers marine, energy-related property insurance, aviation, political risk, trade credit, trade finance, and portfolio solutions, as well as operates reinsurance business; voluntary and sponsor-paid personal accident, and supplemental health products; and personal auto and personal property insurance. Its Life and Retirement segment offers individual retirement products, including variable, fixed index, and fixed annuities, as well as retail mutual funds; group retirement products comprising record-keeping, plan administrative and compliance services, financial planning, and advisory solutions; life insurance, including term and universal life insurance; and institutional markets products, which includes wrap products, structured settlement, pension risk transfer annuities, corporate and bank-owned life insurance, high net worth, and guaranteed investment contract products. It distributes its products through a network of brokers, agents, advisors, banks, and other distributors. The company was founded in 1919 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"10-02-2025 23:53:22"},{"Company Name":"Lyft, Inc.","Symbol":"LYFT","Current Price":"15.12","Latest MA":"13.44","Price Target":18.80447,"Difference from MA":"12.51%","Difference from Open":"1.58%","Change from Yesterday":"6.70%","Change from Last Report":"0.00","Latest Volume":"28,002,731","Market Cap":"6,272,032,768","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":13.95117,"PB Ratio":9.563567,"Previous Close":14.17,"ROE":-0.1161,"DTE":189.385,"Industry":"Software - Application","Sector":"Technology","Beta":2.041,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":1.1486558,"Quick Ratio":0.58,"Day High":15.185,"Day Low":14.54,"VS Average Volume":1.9343910934,"Company Summary":"Lyft, Inc. operates a peer-to-peer marketplace for on-demand ridesharing in the United States and Canada. It operates multimodal transportation networks that offer access to various transportation options through the Lyft platform and mobile-based applications. The company's platform provides a ridesharing marketplace, which connects drivers with riders; Express Drive, a car rental program for drivers; and a network of shared bikes and scooters in various cities to address the needs of riders for short trips. It also offers centralized tools and enterprise transportation solutions, such as concierge transportation solutions for organizations; Lyft Pink subscription plans; Lyft Pass commuter programs; first-mile and last-mile services; and university safe rides programs. The company was formerly known as Zimride, Inc. and changed its name to Lyft, Inc. in April 2013. Lyft, Inc. was incorporated in 2007 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"10-02-2025 23:53:22"}]