[{"Company Name":"Broadcom Inc.","Symbol":"AVGO","Current Price":"229.29","Latest MA":"166.50","Price Target":"242.35","Difference from MA":"37.71%","Difference from Open":"1.15%","Change from Yesterday":"4.43%","Change from Last Report":"-0.82","Latest Volume":"5,988,861","Market Cap":"1,077,035,859,968","Earning Date":"2024-12-12","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":43.782955,"ROE":0.12509,"DTE":166.032,"Industry":"Semiconductors","Sector":"Technology","Beta":1.187,"Trailing PEG":0.6259,"Trailing PE":180.15627,"Trailing PS":23.006214,"Quick Ratio":0.841,"Day High":231.69,"Day Low":225.13,"VS Average Volume":0.2219591274,"Company Summary":"Broadcom Inc. designs, develops, and supplies various semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products worldwide. The company operates in two segments, Semiconductor Solutions and Infrastructure Software. It provides set-top box system-on-chips (SoCs); cable, digital subscriber line, and passive optical networking central office\/consumer premise equipment SoCs; wireless local area network access point SoCs; Ethernet switching and routing custom silicon solutions; serializer\/deserializer application specific integrated circuits; optical and copper, and physical layer devices; and fiber optic components and RF semiconductor devices. The company also offers RF front end modules and filter; Wi-Fi, Bluetooth, and global positioning system\/global navigation satellite system SoCs; custom touch controllers; inductive charging; attached small computer system interface, and redundant array of independent disks controllers and adapters; peripheral component interconnect express; fiber channel host bus adapters; read channel based SoCs; custom flash controllers; preamplifiers; optocouplers, industrial fiber optics, and motion control encoders and subsystems; light emitting diode, ethernet PHYs, switch ICs, and camera microcontrollers. Its products are used in various applications, including enterprise and data center networking, home connectivity, set-top boxes, broadband access, telecommunication equipment, smartphones and base stations, data center servers and storage systems, factory automation, power generation and alternative energy systems, and electronic displays. Broadcom Inc. was founded in 1961 and is headquartered in Palo Alto, California.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"23-12-2024 16:45:33"},{"Company Name":"Lam Research Corporation","Symbol":"LRCX","Current Price":"73.23","Latest MA":"85.06","Price Target":"93.98","Difference from MA":"-13.91%","Difference from Open":"1.22%","Change from Yesterday":"2.05%","Change from Last Report":"-0.75","Latest Volume":"604,390","Market Cap":"94,262,919,168","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":17.647058,"ROE":0.49116,"DTE":58.827,"Industry":"Semiconductor Equipment & Materials","Sector":"Technology","Beta":1.486,"Trailing PEG":1.38,"Trailing PE":23.708738,"Trailing PS":6.0458665,"Quick Ratio":1.685,"Day High":73.82,"Day Low":72.0,"VS Average Volume":0.0483850928,"Company Summary":"Lam Research Corporation designs, manufactures, markets, refurbishes, and services semiconductor processing equipment used in the fabrication of integrated circuits. The company offers ALTUS systems to deposit conformal films for tungsten metallization applications; SABRE electrochemical deposition products for copper interconnect transition that offers copper damascene manufacturing; and VECTOR plasma-enhanced CVD products. It also provides SPEED gapfill high-density plasma chemical vapor deposition products; and Striker single-wafer atomic layer deposition products for dielectric film solutions. In addition, the company offers Flex for dielectric etch applications; Vantex, a dielectric etch system that provides RF technology and repeatable wafer-to-wafer performance enabled by Equipment Intelligence solutions; Kiyo for conductor etch applications; Syndion for through-silicon via etch applications; and Versys metal products for metal etch processes. Further, it provides Coronus bevel clean products to enhance die yield; and Da Vinci, DV-Prime, EOS, and SP series products to address various wafer cleaning applications. The company sells its products in the United States, China, Europe, Japan, Korea, Southeast Asia, and Taiwan. Lam Research Corporation was incorporated in 1980 and is headquartered in Fremont, California.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"23-12-2024 16:45:33"},{"Company Name":"Micron Technology, Inc.","Symbol":"MU","Current Price":"89.54","Latest MA":"109.38","Price Target":"133.33","Difference from MA":"-18.14%","Difference from Open":"-0.67%","Change from Yesterday":"-0.61%","Change from Last Report":"-0.64","Latest Volume":"2,871,837","Market Cap":"99,796,205,568","Earning Date":"2024-12-18","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":9.311973,"ROE":0.01743,"DTE":31.194,"Industry":"Semiconductors","Sector":"Technology","Beta":1.179,"Trailing PEG":0.2286,"Trailing PE":25.664757,"Trailing PS":3.9742029,"Quick Ratio":1.592,"Day High":91.1,"Day Low":89.4,"VS Average Volume":0.1209799579,"Company Summary":"Micron Technology, Inc. designs, develops, manufactures, and sells memory and storage products in the United States, Taiwan, Mainland China, rest of the Asia Pacific, Hong Kong, Japan, Europe, and internationally. The company operates through four segments: Compute and Networking Business Unit, Mobile Business Unit, Embedded Business Unit, and Storage Business Unit. It provides memory and storage technologies comprising dynamic random access memory semiconductor devices with low latency that provide high-speed data retrieval; non-volatile and re-writeable semiconductor storage devices; and non-volatile re-writable semiconductor memory devices that provide fast read speeds under the Micron and Crucial brands, as well as through private labels. The company offers serves the data center, PC, graphics, networking, automotive, industrial, and consumer embedded markets, as well as for smartphone and other mobile-device markets. It markets its products through its direct sales force, independent sales representatives, distributors, and retailers; and web-based customer direct sales channel, as well as through channel and distribution partners. Micron Technology, Inc. was founded in 1978 and is headquartered in Boise, Idaho.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"23-12-2024 16:45:33"},{"Company Name":"CSX Corporation","Symbol":"CSX","Current Price":"31.87","Latest MA":"33.99","Price Target":"38.92","Difference from MA":"-6.23%","Difference from Open":"0.57%","Change from Yesterday":"0.13%","Change from Last Report":"-0.05","Latest Volume":"854,435","Market Cap":"61,497,311,232","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":15.746747,"ROE":0.29458,"DTE":147.913,"Industry":"Railroads","Sector":"Industrials","Beta":1.191,"Trailing PEG":2.0083,"Trailing PE":16.962765,"Trailing PS":4.188905,"Quick Ratio":1.195,"Day High":32.01,"Day Low":31.65,"VS Average Volume":0.0716753528,"Company Summary":"CSX Corporation, together with its subsidiaries, provides rail-based freight transportation services. The company offers rail services; and transportation of intermodal containers and trailers, as well as other transportation services, such as rail-to-truck transfers and bulk commodity operations. It also transports chemicals, agricultural and food products, minerals, automotive, forest products, fertilizers, and metals and equipment; and coal, coke, and iron ore to electricity-generating power plants, steel manufacturers, and industrial plants, as well as exports coal to deep-water port facilities. In addition, the company provides intermodal services through a network of approximately 30 terminals transporting manufactured consumer goods in containers; and drayage services, including the pickup and delivery of intermodal shipments. It serves the automotive industry with distribution centers and storage locations, as well as connects non-rail served customers through transferring products, such as plastics and ethanol from rail to trucks. The company operates approximately 20,000 route mile rail network, which serves various population centers in 26 states east of the Mississippi River, the District of Columbia, and the Canadian provinces of Ontario and Quebec, as well as owns and leases approximately 3,500 locomotives. It serves production and distribution facilities through track connections. CSX Corporation was incorporated in 1978 and is headquartered in Jacksonville, Florida.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"23-12-2024 16:45:33"},{"Company Name":"Truist Financial Corporation","Symbol":"TFC","Current Price":"43.06","Latest MA":"42.28","Price Target":"50.24","Difference from MA":"1.84%","Difference from Open":"0.14%","Change from Yesterday":"-0.53%","Change from Last Report":"-0.06","Latest Volume":"517,444","Market Cap":"57,202,835,456","Earning Date":"2025-01-17","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":10.888985,"ROE":-0.09505,"DTE":"N\/A","Industry":"Banks—Regional","Sector":"Financial Services","Beta":1.035,"Trailing PEG":1.9441,"Trailing PE":"N\/A","Trailing PS":3.9458394,"Quick Ratio":"N\/A","Day High":43.31,"Day Low":42.92,"VS Average Volume":0.0634073129,"Company Summary":"Truist Financial Corporation, a financial services company, provides banking and trust services in the Southeastern and Mid-Atlantic United States. The company operates through three segments: Consumer Banking and Wealth, Corporate and Commercial Banking, and Insurance Holdings.Its deposit products include noninterest-bearing checking, interest-bearing checking, savings, and money market deposit accounts, as well as certificates of deposit and individual retirement accounts. The company also provides funding; asset management; automobile lending; credit card lending; consumer finance; home equity and mortgage lending; other direct retail lending; insurance; investment brokerage; mobile\/online banking; payment solutions; point-of-sale lending; retail and small business deposit products; small business lending; and wealth management\/private banking services. In addition, it offers asset based lending, investment banking and capital market, institutional trust, insurance premium finance, derivatives, commercial lending, international banking, leasing, merchant, commercial deposit and treasury, floor plan, mortgage warehouse lending, real estate lending, and supply chain financing services. Further, the company provides insurance brokerage, retail and wholesale brokerage, securities underwriting and market making, loan syndication, and investment management and advisory services. The company was formerly known as BB&T Corporation and changed its name to Truist Financial Corporation in December 2019. Truist Financial Corporation was founded in 1872 and is headquartered in Charlotte, North Carolina.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"23-12-2024 16:45:33"},{"Company Name":"Carnival Corporation","Symbol":"CCL","Current Price":"25.54","Latest MA":"19.31","Price Target":"27.66","Difference from MA":"32.26%","Difference from Open":"-3.71%","Change from Yesterday":"-4.74%","Change from Last Report":"-0.22","Latest Volume":"5,795,356","Market Cap":"33,391,409,152","Earning Date":"2024-12-20","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":13.180134,"ROE":0.20120001,"DTE":352.355,"Industry":"Travel Services","Sector":"Consumer Cyclical","Beta":2.668,"Trailing PEG":null,"Trailing PE":17.728193,"Trailing PS":1.3640839,"Quick Ratio":0.202,"Day High":26.54,"Day Low":25.5,"VS Average Volume":0.2245438427,"Company Summary":"Carnival Corporation & plc engages in the provision of leisure travel services in North America, Australia, Europe, Asia, and internationally. The company operates through four segments: NAA Cruise Operations, Europe Cruise Operations, Cruise Support, and Tour and Other. It operates port destinations, private islands, and a solar park, as well as owns and operates hotels, lodges, glass-domed railcars, and motor coaches. The company offers its services under the Carnival Cruise Line, Princess Cruises, Holland America Line, Seabourn, Costa Cruises, AIDA Cruises, P&O Cruises, and Cunard brand. Additionally, it sells its cruises primarily through travel agents, tour operators, vacation planners, and websites. Carnival Corporation & plc was founded in 1972 and is headquartered in Miami, Florida.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"23-12-2024 16:45:33"},{"Company Name":"Johnson & Johnson","Symbol":"JNJ","Current Price":"143.99","Latest MA":"155.73","Price Target":"176.21","Difference from MA":"-7.54%","Difference from Open":"-0.44%","Change from Yesterday":"-0.35%","Change from Last Report":"-0.11","Latest Volume":"668,138","Market Cap":"346,613,022,720","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":16.620218,"ROE":0.20889,"DTE":50.958,"Industry":"Drug Manufacturers—General","Sector":"Healthcare","Beta":0.518,"Trailing PEG":0.8661,"Trailing PE":23.795866,"Trailing PS":3.9524384,"Quick Ratio":0.705,"Day High":144.845,"Day Low":143.73,"VS Average Volume":0.0912821052,"Company Summary":"Johnson & Johnson, together with its subsidiaries, researches, develops, manufactures, and sells various products in the healthcare field worldwide. The company's Innovative Medicine segment offers products for various therapeutic areas, such as immunology, including rheumatoid arthritis, psoriatic arthritis, inflammatory bowel disease, and psoriasis; infectious diseases comprising HIV\/AIDS; neuroscience, consisting of mood disorders, neurodegenerative disorders, and schizophrenia; oncology, such as prostate cancer, hematologic malignancies, lung cancer, and bladder cancer; cardiovascular and metabolism, including thrombosis, diabetes, and macular degeneration; and pulmonary hypertension comprising pulmonary arterial hypertension through retailers, wholesalers, distributors, hospitals, and healthcare professionals for prescription use. Its MedTech segment provides Interventional Solutions, including electrophysiology products to treat heart rhythm disorders; the heart recovery portfolio, which includes technologies to treat severe coronary artery disease requiring high-risk PCI or AMI cardiogenic shock; and neurovascular care that treats hemorrhagic and ischemic stroke. this segment also offers an orthopaedics portfolio that includes products and enabling technologies that support hips, knees, trauma, spine, sports, and other; surgery portfolios comprising advanced and general surgery technologies, as well as solutions for breast aesthetics, ear, nose, and throat procedures; contact lenses under the ACUVUE Brand; and TECNIS intraocular lenses for cataract surgery. It distributes its products to wholesalers, hospitals, and retailers, as well as physicians, nurses, hospitals, eye care professionals, and clinics. The company has a collaboration agreement with Stand Up To Cancer for research testing a combination of teclistamab and daratumumab to treat a rare disease AL amyloidosis. Johnson & Johnson was founded in 1886 and is based in New Brunswick, New Jersey.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"23-12-2024 16:45:33"},{"Company Name":"Nike, Inc.","Symbol":"NKE","Current Price":"78.15","Latest MA":"81.30","Price Target":"85.63","Difference from MA":"-3.87%","Difference from Open":"2.39%","Change from Yesterday":"1.50%","Change from Last Report":"0.13","Latest Volume":"1,818,462","Market Cap":"116,192,305,152","Earning Date":"2024-12-19","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":28.964857,"ROE":0.3798,"DTE":86.962,"Industry":"Footwear & Accessories","Sector":"Consumer Cyclical","Beta":1.035,"Trailing PEG":4.0079,"Trailing PE":24.092592,"Trailing PS":2.3232884,"Quick Ratio":1.417,"Day High":78.25,"Day Low":76.31,"VS Average Volume":0.148723292,"Company Summary":"NIKE, Inc., together with its subsidiaries, engages in the design, development, marketing, and sale of athletic footwear, apparel, equipment, accessories, and services worldwide. The company provides athletic and casual footwear, apparel, and accessories under the NIKE, Jumpman, Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks. It also sells a line of performance equipment and accessories comprising bags, sport balls, socks, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities under the NIKE brand; and various plastic products to other manufacturers. In addition, the company markets apparel with licensed college and professional team, and league logos, as well as sells sports apparel; licenses unaffiliated parties to manufacture and sell apparel, digital devices, and applications and other equipment for sports activities under NIKE-owned trademarks; and operates digital platforms, including fitness and activity apps; sport, fitness, and wellness content; and digital services and features in retail stores. It sells its products to footwear stores; sporting goods stores; athletic specialty stores; department stores; skate, tennis, and golf shops; and other retail accounts through NIKE-owned retail stores, digital platforms, independent distributors, licensees, and sales representatives. The company was founded in 1964 and is headquartered in Beaverton, Oregon.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"23-12-2024 16:45:33"},{"Company Name":"Freeport-McMoRan, Inc.","Symbol":"FCX","Current Price":"38.82","Latest MA":"46.07","Price Target":"55.66","Difference from MA":"-15.74%","Difference from Open":"-0.26%","Change from Yesterday":"-0.26%","Change from Last Report":"-0.08","Latest Volume":"717,700","Market Cap":"55,695,839,232","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":16.977942,"ROE":0.16870001,"DTE":33.531,"Industry":"Copper","Sector":"Basic Materials","Beta":1.91,"Trailing PEG":10.1643,"Trailing PE":28.087173,"Trailing PS":2.1722248,"Quick Ratio":1.048,"Day High":38.94,"Day Low":38.68,"VS Average Volume":0.0609726985,"Company Summary":"Freeport-McMoRan Inc. engages in the mining of mineral properties in North America, South America, and Indonesia. It primarily explores for copper, gold, molybdenum, silver, and other metals. The company's assets include the Grasberg minerals district in Indonesia; Morenci, Bagdad, Safford, Sierrita, and Miami in Arizona; Chino and Tyrone in New Mexico; and Henderson and Climax in Colorado, North America, as well as Cerro Verde in Peru and El Abra in Chile. The company was formerly known as Freeport-McMoRan Copper & Gold Inc. and changed its name to Freeport-McMoRan Inc. in July 2014. Freeport-McMoRan Inc. was incorporated in 1987 and is headquartered in Phoenix, Arizona.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"23-12-2024 16:45:33"},{"Company Name":"AT&T Inc.","Symbol":"T","Current Price":"22.67","Latest MA":"20.57","Price Target":"25.48","Difference from MA":"10.21%","Difference from Open":"0.00%","Change from Yesterday":"-0.35%","Change from Last Report":"0.04","Latest Volume":"1,462,672","Market Cap":"162,663,825,408","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":10.32087,"ROE":0.08759,"DTE":125.151,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.73,"Trailing PEG":6.428,"Trailing PE":18.430895,"Trailing PS":1.3326547,"Quick Ratio":0.42,"Day High":22.75,"Day Low":22.62,"VS Average Volume":0.0426198042,"Company Summary":"AT&T Inc. provides telecommunications and technology services worldwide. The company operates through two segments, Communications and Latin America. The Communications segment offers wireless voice and data communications services; and sells handsets, wireless data cards, wireless computing devices, carrying cases\/protective covers, and wireless chargers through its own company-owned stores, agents, and third-party retail stores. It also provides Virtual Private Networks, AT&T Dedicated Internet, Ethernet, data services, cloud solutions, outsourcing, and managed professional services, as well as customer premises equipment for multinational corporations, small and mid-sized businesses, governmental, and wholesale customers. In addition, this segment offers broadband services, including fiber connections, legacy telephony voice communication services, and other VoIP services and equipment to residential customers. This segment markets its communications services and products under the AT&T, AT&T Business, Cricket, AT&T PREPAID, and AT&T Fiber brand names. The Latin America segment provides postpaid and prepaid wireless services in Mexico under the AT&T and Unefon brand names, as well as sells smartphones through its owned stores, agents and third-party retail stores. The company was formerly known as SBC Communications Inc. and changed its name to AT&T Inc. in 2005. AT&T Inc. was incorporated in 1983 and is based in Dallas, Texas.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"23-12-2024 16:45:33"},{"Company Name":"Bank of America Corporation","Symbol":"BAC","Current Price":"43.92","Latest MA":"41.51","Price Target":"50.10","Difference from MA":"5.82%","Difference from Open":"0.06%","Change from Yesterday":"-0.54%","Change from Last Report":"0.00","Latest Volume":"1,752,720","Market Cap":"337,069,637,632","Earning Date":"2025-01-16","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":12.072794,"ROE":0.08092,"DTE":"N\/A","Industry":"Banks—Diversified","Sector":"Financial Services","Beta":1.325,"Trailing PEG":1.957,"Trailing PE":15.916667,"Trailing PS":3.5621252,"Quick Ratio":"N\/A","Day High":44.11,"Day Low":43.85,"VS Average Volume":0.0501588728,"Company Summary":"Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. It operates in four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, non-interest and interest-bearing checking accounts, and investment accounts and products; credit and debit cards; residential mortgages, and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research, and certain market-based services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"23-12-2024 16:45:33"},{"Company Name":"Devon Energy Corporation","Symbol":"DVN","Current Price":"30.66","Latest MA":"42.29","Price Target":"50.04","Difference from MA":"-27.50%","Difference from Open":"-0.16%","Change from Yesterday":"-0.34%","Change from Last Report":"-0.07","Latest Volume":"563,820","Market Cap":"20,143,837,184","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":6.3904986,"ROE":0.26279,"DTE":64.021,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":2.071,"Trailing PEG":14.898,"Trailing PE":5.678704,"Trailing PS":1.3864572,"Quick Ratio":0.834,"Day High":30.83,"Day Low":30.52,"VS Average Volume":0.0582800953,"Company Summary":"Devon Energy Corporation, an independent energy company, engages in the exploration, development, and production of oil, natural gas, and natural gas liquids in the United States. It operates in Delaware, Eagle Ford, Anadarko, Williston, and Powder River Basins. The company was founded in 1971 and is headquartered in Oklahoma City, Oklahoma.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"23-12-2024 16:45:33"},{"Company Name":"Citigroup, Inc.","Symbol":"C","Current Price":"69.35","Latest MA":"63.86","Price Target":"82.14","Difference from MA":"8.59%","Difference from Open":"-0.01%","Change from Yesterday":"0.19%","Change from Last Report":"0.06","Latest Volume":"564,330","Market Cap":"131,105,366,016","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":9.533579,"ROE":0.03874,"DTE":"N\/A","Industry":"Banks—Diversified","Sector":"Financial Services","Beta":1.426,"Trailing PEG":0.7633,"Trailing PE":19.749773,"Trailing PS":1.891634,"Quick Ratio":"N\/A","Day High":69.75,"Day Low":68.975,"VS Average Volume":0.0410910368,"Company Summary":"Citigroup Inc., a diversified financial service holding company, provides various financial product and services to consumers, corporations, governments, and institutions worldwide. It operates through five segments: Services, Markets, Banking, U.S. Personal Banking, and Wealth. The Services segment includes Treasury and Trade Solutions, which provides cash management, trade, and working capital solutions to multinational corporations, financial institutions, and public sector organizations; and Securities Services, such as cross-border support for clients, local market expertise, post-trade technologies, data solutions, and various securities services solutions. The Markets segment offers sales and trading services for equities, foreign exchange, rates, spread products, and commodities to corporate, institutional, and public sector clients; and market-making services, including asset classes, risk management solutions, financing, prime brokerage, research, securities clearing, and settlement. The banking segment includes investment banking; advisory services related to mergers and acquisitions, divestitures, restructurings, and corporate defense activities; and corporate lending, which includes corporate and commercial banking. The U.S. Personal Banking segment provides co-branded cards and retail banking services. The Wealth segment provides financial services to high-net-worth clients through banking, lending, mortgages, investment, custody, and trust product offerings; and to professional industries, including law firms, consulting groups, accounting, and asset management. The company was founded in 1812 and is headquartered in New York, New York.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"23-12-2024 16:45:33"},{"Company Name":"Schlumberger N.V.","Symbol":"SLB","Current Price":"37.04","Latest MA":"43.82","Price Target":"55.29","Difference from MA":"-15.46%","Difference from Open":"0.73%","Change from Yesterday":"0.52%","Change from Last Report":"0.35","Latest Volume":"702,552","Market Cap":"52,277,792,768","Earning Date":"2025-01-17","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":10.275683,"ROE":0.21722999,"DTE":57.141,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.532,"Trailing PEG":1.6565,"Trailing PE":11.903538,"Trailing PS":1.4523625,"Quick Ratio":1.003,"Day High":37.06,"Day Low":36.65,"VS Average Volume":0.056348882,"Company Summary":"Schlumberger Limited engages in the provision of technology for the energy industry worldwide. The company operates through four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company provides field development and hydrocarbon production, carbon management, and integration of adjacent energy systems; reservoir interpretation and data processing services for exploration data; and well construction and production improvement services and products. It also offers subsurface geology and fluids evaluation information; open and cased hole services; exploration and production pressure, and flow-rate measurement services; and pressure pumping, well stimulation, and coiled tubing equipment solutions. In addition, the company offers mud logging, directional drilling, measurement-while-drilling, and logging-while-drilling services, as well as engineering support services; supplies drilling fluid systems; designs, manufactures, and markets roller cone and fixed cutter drill bits; bottom-hole-assembly and borehole enlargement technologies; well cementing products and services; well planning, well drilling, engineering, supervision, logistics, procurement, and contracting of third parties, as well as drilling rig management solutions; and drilling equipment and services, as well as land drilling rigs and related services. Further, it provides artificial lift production equipment and optimization services; supplies packers, safety valves, sand control technology, and various intelligent well completions technology and equipment; designs and manufactures valves, chokes, actuators, and surface trees; and OneSubsea, an integrated solutions, products, systems, and services, including wellheads, subsea trees, manifolds and flowline connectors, control systems, connectors, and services. The company was formerly known as Socie´te´ de Prospection E´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"23-12-2024 16:45:33"},{"Company Name":"Walgreens Boots Alliance, Inc.","Symbol":"WBA","Current Price":"9.40","Latest MA":"10.84","Price Target":"9.94","Difference from MA":"-13.26%","Difference from Open":"-0.79%","Change from Yesterday":"-1.62%","Change from Last Report":"-0.11","Latest Volume":"1,121,736","Market Cap":"8,112,470,016","Earning Date":"2025-01-02","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":22.60424,"ROE":-0.75969005,"DTE":277.898,"Industry":"Pharmaceutical Retailers","Sector":"Healthcare","Beta":0.669,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.054940946,"Quick Ratio":0.332,"Day High":9.54,"Day Low":9.38,"VS Average Volume":0.0466927586,"Company Summary":"Walgreens Boots Alliance, Inc. operates as a healthcare, pharmacy, and retail company in the United States, Germany, the United Kingdom, and internationally. It operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The U.S. Retail Pharmacy segment engages in operation of the retail drugstores, health and wellness services, specialty, and home delivery pharmacy services, which offers health and wellness, beauty, personal care and consumables, and general merchandise. The International segment offers sale of prescription drugs and health and wellness, beauty, personal care, and other consumer products outside the United States; and operates pharmacy-led health and beauty retail businesses under the Boots brand stores in the United Kingdom, the Republic of Ireland, and Thailand, as well as the Benavides brand in Mexico and the Ahumada brand in Chile. The U.S. Healthcare segment provides VillageMD, a national provider of value-based care with primary, multi-specialty, and urgent care providers serving patients in traditional clinic settings, in patients' homes and online appointments; Shields, a specialty pharmacy integrator and accelerator for hospitals; and CareCentrix, a participant in the post-acute and home care management sectors. Walgreens Boots Alliance, Inc. was founded in 1909 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"23-12-2024 16:45:33"},{"Company Name":"Kinder Morgan, Inc.","Symbol":"KMI","Current Price":"26.86","Latest MA":"22.73","Price Target":"26.87","Difference from MA":"18.19%","Difference from Open":"0.06%","Change from Yesterday":"-0.06%","Change from Last Report":"0.21","Latest Volume":"568,711","Market Cap":"59,617,705,984","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.793459,"ROE":0.083500005,"DTE":101.433,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.907,"Trailing PEG":1.966,"Trailing PE":23.747787,"Trailing PS":3.9349024,"Quick Ratio":0.291,"Day High":26.97,"Day Low":26.74,"VS Average Volume":0.0403735306,"Company Summary":"Kinder Morgan, Inc. operates as an energy infrastructure company primarily in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas gasification, liquefaction, and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and\/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, renewable fuel and feedstocks, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; owns interests in\/or operates oil fields and gasoline processing plants; and operates a crude oil pipeline system in West Texas, as well as owns and operates RNG and LNG facilities. It owns and operates approximately 82,000 miles of pipelines and 139 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1997 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-12-2024 16:45:33"},{"Company Name":"JP Morgan Chase & Co.","Symbol":"JPM","Current Price":"235.91","Latest MA":"216.83","Price Target":"250.33","Difference from MA":"8.80%","Difference from Open":"-0.07%","Change from Yesterday":"-0.68%","Change from Last Report":"-0.08","Latest Volume":"1,468,316","Market Cap":"664,392,105,984","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":13.883112,"ROE":0.16216,"DTE":"N\/A","Industry":"Banks—Diversified","Sector":"Financial Services","Beta":1.091,"Trailing PEG":4.673,"Trailing PE":13.117844,"Trailing PS":4.097442,"Quick Ratio":"N\/A","Day High":237.0,"Day Low":234.91,"VS Average Volume":0.1666485262,"Company Summary":"JPMorgan Chase & Co. operates as a financial services company worldwide. It operates through three segments: Consumer & Community Banking, Commercial & Investment Bank, and Asset & Wealth Management. It offers deposit, investment and lending products, cash management, and payments and services; mortgage origination and servicing activities; residential mortgages and home equity loans; and credit cards, auto loans, leases, and travel services to consumers and small businesses through bank branches, ATMs, and digital and telephone banking. The company also provides investment banking products and services, including corporate strategy and structure advisory, and equity and debt market capital-raising services, as well as loan origination and syndication; payments; and cash and derivative instruments, risk management solutions, prime brokerage, and research, as well as offers securities services, including custody, fund accounting and administration, and securities lending products for asset managers, insurance companies, and public and private investment funds. In addition, it provides financial solutions, including lending, payments, investment banking, and asset management to small and midsized companies, local governments, nonprofit clients, and large corporations, as well as investors, developers, and owners of multifamily, office, retail, industrial, and affordable housing properties. Further, the company offers multi-asset investment management solutions in equities, fixed income, alternatives, and money market funds to institutional clients and retail investors; and retirement products and services, brokerage, custody, estate planning, lending, deposits, and investment management products to high net worth clients. JPMorgan Chase & Co. was founded in 1799 and is headquartered in New York, New York.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"23-12-2024 16:45:33"}]