[{"Company Name":"Prologis, Inc.","Symbol":"PLD","Current Price":"113.67","Latest MA":"116.69","Price Target":127.2381,"Difference from MA":"-2.58%","Difference from Open":"3.10%","Change from Yesterday":"3.79%","Change from Last Report":"3.83","Latest Volume":"1,017,295","Market Cap":"105,282,945,024","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":42.68121,"PB Ratio":1.98611,"ROE":0.05662,"DTE":57.079,"Industry":"REIT - Industrial","Sector":"Real Estate","Beta":1.094,"Trailing PEG":0.536,"Trailing PE":34.342903,"Trailing PS":12.778281,"Quick Ratio":0.417,"Day High":113.675,"Day Low":110.17,"VS Average Volume":0.2456166401,"Company Summary":"Prologis, Inc. is the global leader in logistics real estate with a focus on high-barrier, high-growth markets. At September 30, 2024, the company owned or had investments in, on a wholly owned basis or through co-investment ventures, properties and development projects expected to total approximately 1.2 billion square feet (116 million square meters) in 20 countries. Prologis leases modern logistics facilities to a diverse base of approximately 6,700 customers principally across two major categories: business-to-business and retail\/online fulfilment.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"Netflix, Inc.","Symbol":"NFLX","Current Price":"862.92","Latest MA":"750.50","Price Target":873.80664,"Difference from MA":"14.98%","Difference from Open":"-0.15%","Change from Yesterday":"0.60%","Change from Last Report":"0.06","Latest Volume":"1,463,857","Market Cap":"368,862,035,968","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":36.17059,"PB Ratio":16.234644,"ROE":0.34714,"DTE":81.461,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.25,"Trailing PEG":1.7568,"Trailing PE":48.80769,"Trailing PS":9.81348,"Quick Ratio":0.975,"Day High":871.0,"Day Low":854.745,"VS Average Volume":0.4872823201,"Company Summary":"Netflix, Inc. provides entertainment services. It offers TV series, documentaries, feature films, and games across various genres and languages. The company also provides members the ability to receive streaming content through a host of internet-connected devices, including TVs, digital video players, TV set-top boxes, and mobile devices. It has operations in approximately 190 countries. The company was incorporated in 1997 and is headquartered in Los Gatos, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"KeyCorp","Symbol":"KEY","Current Price":"17.43","Latest MA":"16.53","Price Target":21.17368,"Difference from MA":"5.42%","Difference from Open":"-0.09%","Change from Yesterday":"-4.81%","Change from Last Report":"-0.29","Latest Volume":"6,594,215","Market Cap":"19,281,285,120","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":9.905858,"PB Ratio":1.203467,"ROE":0.0096700005,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.231,"Trailing PEG":0.7586,"Trailing PE":"Infinity","Trailing PS":3.973884,"Quick Ratio":"N\/A","Day High":17.88,"Day Low":17.3003,"VS Average Volume":0.6658703881,"Company Summary":"KeyCorp operates as the holding company for KeyBank National Association that provides various retail and commercial banking products and services in the United States. It operates in two segments, Consumer Bank and Commercial Bank. The company offers various deposits, investment products and services; commercial leasing, investment management, consumer finance; and personal finance and financial wellness, student loan refinancing, mortgage and home equity, lending, credit card, treasury, business advisory, wealth management, asset management, cash management, portfolio management, and trust and related services to individuals and small and medium-sized businesses. It also provides a suite of banking and capital market products, such as syndicated finance, debt and equity capital market products, commercial payments, equipment finance, commercial mortgage banking, derivatives, foreign exchange, financial advisory, and public finance, as well as commercial mortgage loans to consumer, energy, healthcare, industrial, public sector, real estate, and technology sectors for middle market clients. In addition, the company offers community development financing, securities underwriting, brokerage, and investment banking services. The company was founded in 1849 and is headquartered in Cleveland, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"D.R. Horton, Inc.","Symbol":"DHI","Current Price":"147.47","Latest MA":"166.71","Price Target":173.85126,"Difference from MA":"-11.54%","Difference from Open":"-2.92%","Change from Yesterday":"-0.13%","Change from Last Report":"-0.37","Latest Volume":"1,865,453","Market Cap":"47,311,044,608","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":9.438346,"PB Ratio":1.8876969,"ROE":0.19631,"DTE":22.915,"Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":1.744,"Trailing PEG":0.5484,"Trailing PE":10.283472,"Trailing PS":1.2855773,"Quick Ratio":0.766,"Day High":154.2175,"Day Low":147.2906,"VS Average Volume":0.6084295794,"Company Summary":"D.R. Horton, Inc. operates as a homebuilding company in East, North, Southeast, South Central, Southwest, and Northwest regions in the United States. It engages in the acquisition and development of land; and construction and sale of residential homes in 125 markets across 36 states under the names of D.R. Horton. The company constructs and sells single-family detached homes; and attached homes, such as townhomes, duplexes, and triplexes. It provides mortgage financing services; and title insurance policies, and examination and closing services, as well as engages in the residential lot development business. In addition, the company develops, constructs, owns, leases, and sells multi-family and single-family rental properties; and owns non-residential real estate, including ranch land and improvements. It primarily serves homebuyers. D.R. Horton, Inc. was founded in 1978 and is headquartered in Arlington, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"Fifth Third Bancorp","Symbol":"FITB","Current Price":"44.77","Latest MA":"41.82","Price Target":50.625,"Difference from MA":"7.06%","Difference from Open":"-0.40%","Change from Yesterday":"0.96%","Change from Last Report":"-0.04","Latest Volume":"2,111,060","Market Cap":"29,721,997,312","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":10.998,"PB Ratio":1.6218665,"ROE":0.119160004,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.231,"Trailing PEG":3.5729,"Trailing PE":14.923333,"Trailing PS":3.6862206,"Quick Ratio":"N\/A","Day High":45.31,"Day Low":43.93,"VS Average Volume":0.4689680176,"Company Summary":"Fifth Third Bancorp operates as the bank holding company for Fifth Third Bank, National Association that engages in the provision of a range of financial products and services in the United States. It operates through three segments: Commercial Banking, Consumer and Small Business Banking, and Wealth and Asset Management. The Commercial Banking segment offers credit intermediation, cash management, and financial services; lending and depository products; and cash management, foreign exchange and international trade finance, derivatives and capital markets services, asset-based lending, real estate finance, public finance, commercial leasing, and syndicated finance for business, government, and professional customers. The Consumer and Small Banking segment provides a range of deposit and loan products to individuals and small businesses; home equity loans and lines of credit; credit cards; and cash management services. This segment also engages in the residential mortgage that include origination, retention and servicing of residential mortgage loans, sales and securitizations of loans, and hedging activities; indirect lending, including extending loans to consumers through automobile dealers, motorcycle dealers, powersport dealers, recreational vehicle dealers, and marine dealers; and home improvement and solar energy installation loans through contractors and installers. The Wealth & Asset Management segment provides various wealth management services for individuals, companies, and not-for-profit organizations. It offers retail brokerage services to individual clients; and broker dealer services to the institutional marketplace. This segment also provides wealth planning, investment management, banking, insurance, and trust and estate services; and advisory services for institutional clients comprising middle market businesses, non-profits, states, and municipalities. The company was founded in 1858 and is headquartered in Cincinnati, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"United Airlines Holdings, Inc.","Symbol":"UAL","Current Price":"108.92","Latest MA":"67.36","Price Target":123.00435,"Difference from MA":"61.70%","Difference from Open":"-0.02%","Change from Yesterday":"1.44%","Change from Last Report":"-0.01","Latest Volume":"2,690,123","Market Cap":"35,822,817,280","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":8.55898,"PB Ratio":3.131919,"ROE":0.27245,"DTE":291.676,"Industry":"Airlines","Sector":"Industrials","Beta":1.393,"Trailing PEG":0.8529,"Trailing PE":12.9827175,"Trailing PS":0.63976175,"Quick Ratio":0.694,"Day High":110.09,"Day Low":108.13,"VS Average Volume":0.4847955076,"Company Summary":"United Airlines Holdings, Inc., through its subsidiaries, provides air transportation services in North America, Asia, Europe, Africa, the Pacific, the Middle East, and Latin America. The company transports people and cargo through its mainline and regional fleets. It also offers catering, ground handling, flight academy, and maintenance services for third parties. The company was formerly known as United Continental Holdings, Inc. and changed its name to United Airlines Holdings, Inc. in June 2019. United Airlines Holdings, Inc. was incorporated in 1968 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"Seagate Technology Holdings PLC","Symbol":"STX","Current Price":"100.77","Latest MA":"99.88","Price Target":113.2905,"Difference from MA":"0.89%","Difference from Open":"0.87%","Change from Yesterday":"3.18%","Change from Last Report":"3.17","Latest Volume":"1,031,092","Market Cap":"21,315,876,864","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":10.931042,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Computer Hardware","Sector":"Technology","Beta":1.07,"Trailing PEG":0.3098,"Trailing PE":26.03876,"Trailing PS":2.9340506,"Quick Ratio":0.63,"Day High":101.34,"Day Low":99.23,"VS Average Volume":0.3844675544,"Company Summary":"Seagate Technology Holdings plc engages in the provision of data storage technology and infrastructure solutions in Singapore, the United States, the Netherlands, and internationally. The company offers mass capacity storage products, including enterprise nearline hard disk drives (HDDs), enterprise nearline solid state drives (SSDs), enterprise nearline systems, video and image HDDs, and network-attached storage drives. It also offers legacy applications comprising Mission Critical HDDs and SSDs; external storage solutions under the Seagate Ultra Touch, One Touch, Expansion, and Basics product lines, as well as under the LaCie brand name; desktop drives for personal computers and workstation applications; notebook drives traditional notebooks, convertible systems, and external storage applications, DVR HDDs for video streaming applications, and gaming SSDs for gaming rigs. In addition, the company provides Lyve edge-to-cloud mass capacity platform, that includes modular hardware and software to support enterprises' on-premise and cloud storage infrastructure needs. It sells its products primarily to original equipment manufacturers, distributors, and retailers. The company was founded in 1978 and is based in Singapore.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"3M Company","Symbol":"MMM","Current Price":"147.35","Latest MA":"125.15","Price Target":146.0711,"Difference from MA":"17.73%","Difference from Open":"1.27%","Change from Yesterday":"4.48%","Change from Last Report":"-0.03","Latest Volume":"3,773,626","Market Cap":"80,240,771,072","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":17.262062,"PB Ratio":17.286486,"ROE":1.1329399,"DTE":295.441,"Industry":"Conglomerates","Sector":"Industrials","Beta":1.001,"Trailing PEG":null,"Trailing PE":15.348958,"Trailing PS":2.4585078,"Quick Ratio":0.95,"Day High":150.0,"Day Low":145.0,"VS Average Volume":1.0717422792,"Company Summary":"3M Company provides diversified technology services in the United States and internationally. The company's Safety and Industrial segment offers industrial abrasives and finishing for metalworking applications; autobody repair solutions; closure systems for personal hygiene products, masking, and packaging materials; electrical products and materials for construction and maintenance, power distribution, and electrical original equipment manufacturers; structural adhesives and tapes; respiratory, hearing, eye, and fall protection solutions; and natural and color-coated mineral granules for shingles. Its Transportation and Electronics segment provides ceramic solutions; attachment\/bonding products, films, sound, and temperature management for transportation vehicles; premium large format graphic films for advertising and fleet signage; light management films and electronics assembly solutions; packaging and interconnection solutions; semiconductor production materials; data centers solutions; and reflective signage for highway, and vehicle safety. The company's Consumer segment provides consumer bandages, braces, supports, and consumer respirators; home cleaning products; retail abrasives, paint accessories, car care DIY products, picture hanging, and consumer air quality solutions; and stationery products. It offers its products through e-commerce and traditional wholesalers, retailers, jobbers, distributors, and dealers. 3M Company was founded in 1902 and is headquartered in Saint Paul, Minnesota.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"Charles Schwab Corporation (The","Symbol":"SCHW","Current Price":"80.88","Latest MA":"70.57","Price Target":86.25,"Difference from MA":"14.61%","Difference from Open":"2.60%","Change from Yesterday":"5.83%","Change from Last Report":"-0.29","Latest Volume":"5,806,698","Market Cap":"148,055,687,168","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":20.195412,"PB Ratio":3.8916419,"ROE":0.12111,"DTE":144.242,"Industry":"Capital Markets","Sector":"Financial Services","Beta":0.952,"Trailing PEG":0.9497,"Trailing PE":31.59375,"Trailing PS":7.902203,"Quick Ratio":0.481,"Day High":82.6,"Day Low":78.27,"VS Average Volume":0.753589111,"Company Summary":"The Charles Schwab Corporation, together with its subsidiaries, operates as a savings and loan holding company that provides wealth management, securities brokerage, banking, asset management, custody, and financial advisory services in the United States and internationally. The company operates in two segments, Investor Services and Advisor Services. It offers brokerage accounts with equity and fixed income trading, margin lending, options trading, futures and forex trading, and cash management capabilities, including certificates of deposit; third-party mutual funds through the Mutual Fund Marketplace and Mutual Fund OneSource service, as well as mutual fund trading and clearing services to broker-dealers; exchange-traded funds; advisory solutions for managed portfolios, separately managed accounts, customized personal advice for tailored portfolios, specialized planning, and full-time portfolio management; banking products comprising checking and savings accounts, first lien residential real estate mortgage loans, home equity lines of credit, and pledged asset lines; and trust custody services, personal trust reporting services, and administrative trustee services. It also provides digital retirement calculators; integrated web-, mobile-, and software-based trading platforms, real-time market data, options trading, premium research, and multi-channel access; self-service education and support tools; online research and analysis tools; equity compensation plan sponsors full-service recordkeeping for stock plans, stock options, restricted stock, performance shares, and stock appreciation rights; retirement plan services; mutual fund clearing services; and advisor services, including interactive tools and educational content. The Company operates through branch offices. The Charles Schwab Corporation was founded in 1971 and is headquartered in Westlake, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"Regions Financial Corporation","Symbol":"RF","Current Price":"24.61","Latest MA":"22.81","Price Target":27.20143,"Difference from MA":"7.86%","Difference from Open":"1.42%","Change from Yesterday":"1.67%","Change from Last Report":"-0.02","Latest Volume":"1,223,228","Market Cap":"22,362,597,376","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":9.931222,"PB Ratio":1.3209319,"ROE":0.10042,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.182,"Trailing PEG":4.6556,"Trailing PE":13.90113,"Trailing PS":3.4110122,"Quick Ratio":"N\/A","Day High":24.715,"Day Low":24.13,"VS Average Volume":0.1521499583,"Company Summary":"Regions Financial Corporation, a financial holding company, provides banking and bank-related services to individual and corporate customers. It operates through three segments: Corporate Bank, Consumer Bank, and Wealth Management. The Corporate Bank segment offers commercial banking services, such as commercial and industrial, commercial real estate, and investor real estate lending; equipment lease financing; deposit products; and securities underwriting and placement, loan syndication and placement, foreign exchange, derivatives, merger and acquisition, and other advisory services. It serves corporate, middle market, and commercial real estate developers and investors. The Consumer Bank segment provides consumer banking products and services related to residential first mortgages, home equity lines and loans, consumer credit cards, and other consumer loans, as well as deposits. The Wealth Management segment offers credit related products, and retirement and savings solutions; and trust and investment management, asset management, and estate planning services to individuals, businesses, governmental institutions, and non-profit entities. It also provides investment and insurance products; low-income housing tax credit corporate fund syndication services; and other specialty financing services. The company was founded in 1971 and is headquartered in Birmingham, Alabama.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"Schlumberger N.V.","Symbol":"SLB","Current Price":"44.20","Latest MA":"42.84","Price Target":53.34935,"Difference from MA":"3.17%","Difference from Open":"0.57%","Change from Yesterday":"1.40%","Change from Last Report":"-0.29","Latest Volume":"5,803,976","Market Cap":"61,924,196,352","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":11.781797,"PB Ratio":2.9015954,"ROE":0.21722999,"DTE":57.141,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.532,"Trailing PEG":1.9428,"Trailing PE":14.212219,"Trailing PS":1.7203555,"Quick Ratio":1.003,"Day High":44.66,"Day Low":43.66,"VS Average Volume":0.47259665,"Company Summary":"Schlumberger Limited engages in the provision of technology for the energy industry worldwide. The company operates through four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company provides field development and hydrocarbon production, carbon management, and integration of adjacent energy systems; reservoir interpretation and data processing services for exploration data; and well construction and production improvement services and products. It also offers subsurface geology and fluids evaluation information; open and cased hole services; exploration and production pressure, and flow-rate measurement services; and pressure pumping, well stimulation, and coiled tubing equipment solutions. In addition, the company offers mud logging, directional drilling, measurement-while-drilling, and logging-while-drilling services, as well as engineering support services; supplies drilling fluid systems; designs, manufactures, and markets roller cone and fixed cutter drill bits; bottom-hole-assembly and borehole enlargement technologies; well cementing products and services; well planning, well drilling, engineering, supervision, logistics, procurement, and contracting of third parties, as well as drilling rig management solutions; and drilling equipment and services, as well as land drilling rigs and related services. Further, it provides artificial lift production equipment and optimization services; supplies packers, safety valves, sand control technology, and various intelligent well completions technology and equipment; designs and manufactures valves, chokes, actuators, and surface trees; and OneSubsea, an integrated solutions, products, systems, and services, including wellheads, subsea trees, manifolds and flowline connectors, control systems, connectors, and services. The company was formerly known as Socie´te´ de Prospection E´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"Truist Financial Corporation","Symbol":"TFC","Current Price":"48.47","Latest MA":"42.65","Price Target":50.833,"Difference from MA":"13.66%","Difference from Open":"0.98%","Change from Yesterday":"1.73%","Change from Last Report":"-0.07","Latest Volume":"1,999,901","Market Cap":"63,783,612,416","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":10.538262,"PB Ratio":1.090169,"ROE":-0.09505,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.035,"Trailing PEG":1.9441,"Trailing PE":"N\/A","Trailing PS":4.39978,"Quick Ratio":"N\/A","Day High":48.5278,"Day Low":47.87,"VS Average Volume":0.254692885,"Company Summary":"Truist Financial Corporation, a financial services company, provides banking and trust services in the Southeastern and Mid-Atlantic United States. The company operates through three segments: Consumer Banking and Wealth, Corporate and Commercial Banking, and Insurance Holdings.Its deposit products include noninterest-bearing checking, interest-bearing checking, savings, and money market deposit accounts, as well as certificates of deposit and individual retirement accounts. The company also provides funding; asset management; automobile lending; credit card lending; consumer finance; home equity and mortgage lending; other direct retail lending; insurance; investment brokerage; mobile\/online banking; payment solutions; point-of-sale lending; retail and small business deposit products; small business lending; and wealth management\/private banking services. In addition, it offers asset based lending, investment banking and capital market, institutional trust, insurance premium finance, derivatives, commercial lending, international banking, leasing, merchant, commercial deposit and treasury, floor plan, mortgage warehouse lending, real estate lending, and supply chain financing services. Further, the company provides insurance brokerage, retail and wholesale brokerage, securities underwriting and market making, loan syndication, and investment management and advisory services. The company was formerly known as BB&T Corporation and changed its name to Truist Financial Corporation in December 2019. Truist Financial Corporation was founded in 1872 and is headquartered in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"Huntington Bancshares Incorpora","Symbol":"HBAN","Current Price":"17.08","Latest MA":"15.06","Price Target":18.69526,"Difference from MA":"13.38%","Difference from Open":"0.41%","Change from Yesterday":"0.41%","Change from Last Report":"0.03","Latest Volume":"2,597,956","Market Cap":"24,828,170,240","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":11.009695,"PB Ratio":1.362476,"ROE":0.08545,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.057,"Trailing PEG":2.8759,"Trailing PE":16.582525,"Trailing PS":3.7112362,"Quick Ratio":"N\/A","Day High":17.18,"Day Low":16.91,"VS Average Volume":0.1748147676,"Company Summary":"Huntington Bancshares Incorporated operates as the bank holding company for The Huntington National Bank that provides commercial, consumer, and mortgage banking services in the United States. The company offers financial products and services to consumer and business customers, including deposits, lending, payments, mortgage banking, dealer financing, investment management, trust, brokerage, insurance, and other financial products and services. It also provides 24-hour grace, asterisk-free checking, money scout, $50 safety zone, standby cash, early pay, instant access, savings goal getter, and Huntington heads up; digitally powered consumer and business financial solutions to consumer lending, regional banking, branch banking, and wealth management customers; direct and indirect consumer loans, as well as dealer finance loans and deposits; and private banking, wealth management and legacy planning through investment and portfolio management, fiduciary administration and trust, institutional custody, and full-service retail brokerage investment services. The company offers equipment financing, asset-based lending, distribution finance, structured lending, and municipal financing solutions, as well as Huntington ChoicePay. In addition, it offers lending, liquidity, treasury management and other payment services, and capital markets; government and non-profits, healthcare, technology and telecommunications, franchises, financial sponsors, and global services; and corporate risk management, institutional sales and trading, debt and equity issuance, and additional advisory services. The company offers its products through a network of channels, including branches and ATMs, online and mobile banking, and through customer call centers to customers in middle market banking, corporate, specialty, and government banking, asset finance, commercial real estate banking, and capital markets. The company was founded in 1866 and is headquartered in Columbus, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"Bank of America Corporation","Symbol":"BAC","Current Price":"46.99","Latest MA":"41.89","Price Target":51.92857,"Difference from MA":"12.17%","Difference from Open":"0.79%","Change from Yesterday":"0.98%","Change from Last Report":"-0.03","Latest Volume":"10,036,445","Market Cap":"357,634,310,144","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.848863,"PB Ratio":1.3284895,"ROE":0.08092,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.325,"Trailing PEG":2.0616,"Trailing PE":14.63863,"Trailing PS":3.779451,"Quick Ratio":"N\/A","Day High":47.15,"Day Low":46.545,"VS Average Volume":0.2876696788,"Company Summary":"Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. It operates in four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, non-interest and interest-bearing checking accounts, and investment accounts and products; credit and debit cards; residential mortgages, and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research, and certain market-based services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"U.S. Bancorp","Symbol":"USB","Current Price":"48.89","Latest MA":"45.54","Price Target":56.82773,"Difference from MA":"7.36%","Difference from Open":"0.47%","Change from Yesterday":"1.08%","Change from Last Report":"-0.06","Latest Volume":"1,731,224","Market Cap":"76,268,396,544","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.069616,"PB Ratio":1.465923,"ROE":0.09779,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.04,"Trailing PEG":1.1765,"Trailing PE":12.899736,"Trailing PS":3.0633569,"Quick Ratio":"N\/A","Day High":49.15,"Day Low":48.3261,"VS Average Volume":0.2235950465,"Company Summary":"U.S. Bancorp, a financial services holding company, provides various financial services to individuals, businesses, institutional organizations, governmental entities, and other financial institutions in the United States. It operates through Wealth, Corporate, Commercial and Institutional Banking; Consumer and Business Banking; Payment Services; and Treasury and Corporate Support segments. The company offers depository services, including checking accounts, savings accounts, and time certificate contracts; and lending services, such as traditional credit products and credit card services, lease financing and import\/export trade, asset-backed lending, agricultural finance, and other products. It also provides ancillary services comprising capital markets, treasury management, and receivable lock-box collection services to corporate and governmental entity customers. In addition, the company offers asset management and fiduciary services for individuals, estates, foundations, business corporations, and charitable organizations. Further, it provides investment and insurance products to its customers principally within its domestic markets, as well as fund administration services to mutual and other funds. Additionally, the company provides corporate and purchasing card, and corporate trust services. Furthermore, it offers trust and investment management, merchant and ATM processing, mortgage banking, insurance, and brokerage and leasing services. U.S. Bancorp was founded in 1863 and is headquartered in Minneapolis, Minnesota.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"Citigroup, Inc.","Symbol":"C","Current Price":"81.27","Latest MA":"64.69","Price Target":88.8355,"Difference from MA":"25.62%","Difference from Open":"1.04%","Change from Yesterday":"1.64%","Change from Last Report":"0.15","Latest Volume":"4,373,697","Market Cap":"152,542,527,488","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.786906,"PB Ratio":0.7974428,"ROE":0.03874,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.426,"Trailing PEG":0.8824,"Trailing PE":13.657984,"Trailing PS":2.2009368,"Quick Ratio":"N\/A","Day High":81.44,"Day Low":79.9204,"VS Average Volume":0.3038416329,"Company Summary":"Citigroup Inc., a diversified financial service holding company, provides various financial product and services to consumers, corporations, governments, and institutions worldwide. It operates through five segments: Services, Markets, Banking, U.S. Personal Banking, and Wealth. The Services segment includes Treasury and Trade Solutions, which provides cash management, trade, and working capital solutions to multinational corporations, financial institutions, and public sector organizations; and Securities Services, such as cross-border support for clients, local market expertise, post-trade technologies, data solutions, and various securities services solutions. The Markets segment offers sales and trading services for equities, foreign exchange, rates, spread products, and commodities to corporate, institutional, and public sector clients; and market-making services, including asset classes, risk management solutions, financing, prime brokerage, research, securities clearing, and settlement. The banking segment includes investment banking; advisory services related to mergers and acquisitions, divestitures, restructurings, and corporate defense activities; and corporate lending, which includes corporate and commercial banking. The U.S. Personal Banking segment provides co-branded cards and retail banking services. The Wealth segment provides financial services to high-net-worth clients through banking, lending, mortgages, investment, custody, and trust product offerings; and to professional industries, including law firms, consulting groups, accounting, and asset management. The company was founded in 1812 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"Wells Fargo & Company","Symbol":"WFC","Current Price":"77.72","Latest MA":"62.63","Price Target":82.52381,"Difference from MA":"24.09%","Difference from Open":"0.04%","Change from Yesterday":"0.84%","Change from Last Report":"-0.20","Latest Volume":"2,504,288","Market Cap":"255,616,417,792","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":11.36249,"PB Ratio":1.5790972,"ROE":0.099139996,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.136,"Trailing PEG":3.5805,"Trailing PE":14.472999,"Trailing PS":3.2823937,"Quick Ratio":"N\/A","Day High":78.29,"Day Low":77.33,"VS Average Volume":0.1460245567,"Company Summary":"Wells Fargo & Company, a financial services company, provides diversified banking, investment, mortgage, and consumer and commercial finance products and services in the United States and internationally. The company operates through four segments: Consumer Banking and Lending; Commercial Banking; Corporate and Investment Banking; and Wealth and Investment Management. The Consumer Banking and Lending segment offers diversified financial products and services for consumers and small businesses. Its financial products and services include checking and savings accounts, and credit and debit cards, as well as home, auto, personal, and small business lending services. The Commercial Banking segment provides financial solutions to private, family owned, and certain public companies. Its products and services include banking and credit products across various industry sectors and municipalities, secured lending and lease products, and treasury management services. The Corporate and Investment Banking segment offers a suite of capital markets, banking, and financial products and services, such as corporate banking, investment banking, treasury management, commercial real estate lending and servicing, equity, and fixed income solutions, as well as sales, trading, and research capabilities services to corporate, commercial real estate, government, and institutional clients. The Wealth and Investment Management segment provides personalized wealth management, brokerage, financial planning, lending, private banking, and trust and fiduciary products and services to affluent, high-net worth, and ultra-high-net worth clients. It also operates through financial advisors in brokerage and wealth offices, consumer bank branches, independent offices, and digitally through WellsTrade and Intuitive Investor. The company was founded in 1852 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"Goldman Sachs Group, Inc. (The)","Symbol":"GS","Current Price":"618.09","Latest MA":"521.01","Price Target":634.0952,"Difference from MA":"18.63%","Difference from Open":"0.21%","Change from Yesterday":"-1.22%","Change from Last Report":"0.04","Latest Volume":"1,747,491","Market Cap":"194,023,079,936","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":12.113227,"PB Ratio":1.886643,"ROE":0.1017,"DTE":609.793,"Industry":"Capital Markets","Sector":"Financial Services","Beta":1.342,"Trailing PEG":3.9236,"Trailing PE":15.238782,"Trailing PS":3.9286265,"Quick Ratio":1.458,"Day High":622.49,"Day Low":609.0,"VS Average Volume":0.8110726962,"Company Summary":"The Goldman Sachs Group, Inc., a financial institution, provides a range of financial services for corporations, financial institutions, governments, and individuals worldwide. It operates through Global Banking & Markets, Asset & Wealth Management, and Platform Solutions segments. The Global Banking & Markets segment provides financial advisory services, including strategic advisory assignments related to mergers and acquisitions, divestitures, corporate defense activities, restructurings, and spin-offs; and relationship lending, and acquisition financing, as well as secured lending, through structured credit and asset-backed lending and involved in financing under securities to resale agreements. This segment also offers client execution activities for cash and derivative instruments; credit and interest rate products; and provision of mortgages, currencies, commodities, and equities related products, as well as underwriting services. The Asset & Wealth Management segment manages assets across various classes, including equity, fixed income, hedge funds, credit funds, private equity, real estate, currencies, and commodities; and provides customized investment advisory solutions, wealth advisory services, personalized financial planning, and private banking services, as well as invests in corporate equity, credit, real estate, and infrastructure assets. The Platform Solutions segment offers credit cards and point-of-sale financing for purchase of goods or services. This segment also provides cash management services, such as deposit-taking and payment solutions for corporate and institutional clients. The Goldman Sachs Group, Inc. was founded in 1869 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"Morgan Stanley","Symbol":"MS","Current Price":"136.65","Latest MA":"111.58","Price Target":134.61111,"Difference from MA":"22.47%","Difference from Open":"0.15%","Change from Yesterday":"-0.90%","Change from Last Report":"-0.02","Latest Volume":"3,578,135","Market Cap":"219,596,554,240","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":14.535038,"PB Ratio":2.3460839,"ROE":0.11079001,"DTE":405.772,"Industry":"Capital Markets","Sector":"Financial Services","Beta":1.336,"Trailing PEG":3.9168,"Trailing PE":17.167084,"Trailing PS":3.767828,"Quick Ratio":1.83,"Day High":137.61,"Day Low":135.29,"VS Average Volume":0.5376459688,"Company Summary":"Morgan Stanley, a financial holding company, provides various financial products and services to corporations, governments, financial institutions, and individuals in the Americas, Europe, the Middle East, Africa, and Asia. It operates through Institutional Securities, Wealth Management, and Investment Management segments. The Institutional Securities segment offers capital raising and financial advisory services, including services related to the underwriting of debt, equity, and other securities, as well as advice on mergers and acquisitions, restructurings, real estate, and project finance. This segment also provides equity and fixed income products comprising sales, financing, prime brokerage, and market-making services; foreign exchange and commodities; corporate and commercial real estate loans, commercial mortgage and secured lending facilities, and financing for sales and trading customers, and asset-backed and mortgage lending; and wealth management services, investment, and research services. The Wealth Management segment offers financial advisor-led brokerage, custody, administrative, and investment advisory services; self-directed brokerage services; financial and wealth planning services; workplace services, including stock plan administration; annuity and insurance products; securities-based lending, residential real estate loans, and other lending products; banking; and retirement plan services to individual investors and small to medium-sized businesses and institutions. The Investment Management segment provides equity, fixed income, alternatives and solutions, and liquidity and overlay services to benefit\/defined contribution plans, foundations, endowments, government entities, sovereign wealth funds, insurance companies, third-party fund sponsors, corporations, and individuals through institutional and intermediary channels. The company was founded in 1924 and is headquartered in New York, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"JP Morgan Chase & Co.","Symbol":"JPM","Current Price":"260.86","Latest MA":"220.41","Price Target":266.29144,"Difference from MA":"18.35%","Difference from Open":"0.30%","Change from Yesterday":"0.67%","Change from Last Report":"0.02","Latest Volume":"2,218,148","Market Cap":"729,781,895,168","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.435214,"PB Ratio":2.2653928,"ROE":0.16216,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.091,"Trailing PEG":4.9934,"Trailing PE":13.2081,"Trailing PS":4.5007143,"Quick Ratio":"N\/A","Day High":262.15,"Day Low":259.5037,"VS Average Volume":0.2390584184,"Company Summary":"JPMorgan Chase & Co. operates as a financial services company worldwide. It operates through three segments: Consumer & Community Banking, Commercial & Investment Bank, and Asset & Wealth Management. It offers deposit, investment and lending products, cash management, and payments and services; mortgage origination and servicing activities; residential mortgages and home equity loans; and credit cards, auto loans, leases, and travel services to consumers and small businesses through bank branches, ATMs, and digital and telephone banking. The company also provides investment banking products and services, including corporate strategy and structure advisory, and equity and debt market capital-raising services, as well as loan origination and syndication; payments; and cash and derivative instruments, risk management solutions, prime brokerage, and research, as well as offers securities services, including custody, fund accounting and administration, and securities lending products for asset managers, insurance companies, and public and private investment funds. In addition, it provides financial solutions, including lending, payments, investment banking, and asset management to small and midsized companies, local governments, nonprofit clients, and large corporations, as well as investors, developers, and owners of multifamily, office, retail, industrial, and affordable housing properties. Further, the company offers multi-asset investment management solutions in equities, fixed income, alternatives, and money market funds to institutional clients and retail investors; and retirement products and services, brokerage, custody, estate planning, lending, deposits, and investment management products to high net worth clients. JPMorgan Chase & Co. was founded in 1799 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"Walgreens Boots Alliance, Inc.","Symbol":"WBA","Current Price":"11.07","Latest MA":"9.93","Price Target":12.414,"Difference from MA":"11.46%","Difference from Open":"-5.58%","Change from Yesterday":"-11.58%","Change from Last Report":"-1.02","Latest Volume":"16,542,391","Market Cap":"9,562,458,112","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":6.900837,"PB Ratio":0.91535276,"ROE":-0.75969005,"DTE":277.898,"Industry":"Pharmaceutical Retailers","Sector":"Healthcare","Beta":0.669,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.06476086,"Quick Ratio":0.332,"Day High":11.7371,"Day Low":10.775,"VS Average Volume":0.6916689479,"Company Summary":"Walgreens Boots Alliance, Inc. operates as a healthcare, pharmacy, and retail company in the United States, Germany, the United Kingdom, and internationally. It operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The U.S. Retail Pharmacy segment engages in operation of the retail drugstores, health and wellness services, specialty, and home delivery pharmacy services, which offers health and wellness, beauty, personal care and consumables, and general merchandise. The International segment offers sale of prescription drugs and health and wellness, beauty, personal care, and other consumer products outside the United States; and operates pharmacy-led health and beauty retail businesses under the Boots brand stores in the United Kingdom, the Republic of Ireland, and Thailand, as well as the Benavides brand in Mexico and the Ahumada brand in Chile. The U.S. Healthcare segment provides VillageMD, a national provider of value-based care with primary, multi-specialty, and urgent care providers serving patients in traditional clinic settings, in patients' homes and online appointments; Shields, a specialty pharmacy integrator and accelerator for hospitals; and CareCentrix, a participant in the post-acute and home care management sectors. Walgreens Boots Alliance, Inc. was founded in 1909 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"Delta Air Lines, Inc.","Symbol":"DAL","Current Price":"67.81","Latest MA":"52.04","Price Target":79.92864,"Difference from MA":"30.31%","Difference from Open":"1.57%","Change from Yesterday":"3.09%","Change from Last Report":"0.00","Latest Volume":"2,260,333","Market Cap":"43,756,503,040","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.024235,"PB Ratio":3.1858115,"ROE":0.4067,"DTE":186.78,"Industry":"Airlines","Sector":"Industrials","Beta":1.341,"Trailing PEG":null,"Trailing PE":12.722326,"Trailing PS":0.7255626,"Quick Ratio":0.268,"Day High":68.055,"Day Low":66.78,"VS Average Volume":0.2834934543,"Company Summary":"Delta Air Lines, Inc. provides scheduled air transportation for passengers and cargo in the United States and internationally. The company operates through two segments, Airline and Refinery. Its domestic network centered on core hubs in Atlanta, Minneapolis-St. Paul, Detroit, and Salt Lake City, as well as coastal hub positions in Boston, Los Angeles, New York-LaGuardia, New York-JFK, and Seattle; and international network centered on hubs and market presence in Amsterdam, Bogota, Lima, Mexico City, London-Heathrow, Paris-Charles de Gaulle, Sao Paulo, Seoul-Incheon, and Tokyo. The company sells its tickets through various distribution channels, including delta.com and the Fly Delta app; acts as a reservations specialists; and operates online travel and traditional brick and mortar agencies. It also provides aircraft maintenance and engineering support, repair, and overhaul services; and vacation packages to third-party consumers. The company operates through a fleet of approximately 1,273 aircrafts. Delta Air Lines, Inc. was founded in 1924 and is based in Atlanta, Georgia.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"Verizon Communications Inc.","Symbol":"VZ","Current Price":"39.30","Latest MA":"40.52","Price Target":47.1625,"Difference from MA":"-3.01%","Difference from Open":"1.09%","Change from Yesterday":"1.34%","Change from Last Report":"0.03","Latest Volume":"5,517,343","Market Cap":"165,417,402,368","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.324489,"PB Ratio":1.7172886,"ROE":0.10431,"DTE":182.615,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.418,"Trailing PEG":1.0291,"Trailing PE":17.010822,"Trailing PS":1.2322787,"Quick Ratio":0.51,"Day High":39.58,"Day Low":38.79,"VS Average Volume":0.2854290075,"Company Summary":"Verizon Communications Inc., through its subsidiaries, engages in the provision of communications, technology, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide. It operates in two segments, Verizon Consumer Group (Consumer) and Verizon Business Group (Business). The Consumer segment provides wireless services across the wireless networks in the United States under the Verizon and TracFone brands and through wholesale and other arrangements; and fixed wireless access (FWA) broadband through its wireless networks, as well as related equipment and devices, such as smartphones, tablets, smart watches, and other wireless-enabled connected devices. The segment also offers wireline services in the Mid-Atlantic and Northeastern United States, as well as Washington D.C. through its fiber-optic network, Verizon Fios product portfolio, and a copper-based network. The Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and conferencing, corporate networking, security and managed network, local and long-distance voice, and network access services to deliver various IoT services and products to businesses, government customers, and wireless and wireline carriers in the United States and internationally. The company was formerly known as Bell Atlantic Corporation and changed its name to Verizon Communications Inc. in June 2000. Verizon Communications Inc. was incorporated in 1983 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"NextEra Energy, Inc.","Symbol":"NEE","Current Price":"71.53","Latest MA":"76.33","Price Target":85.41818,"Difference from MA":"-6.29%","Difference from Open":"0.24%","Change from Yesterday":"1.10%","Change from Last Report":"0.11","Latest Volume":"2,074,674","Market Cap":"147,094,290,432","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":19.431955,"PB Ratio":2.9389045,"ROE":0.09887999,"DTE":139.015,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.561,"Trailing PEG":2.8816,"Trailing PE":21.22552,"Trailing PS":5.604446,"Quick Ratio":0.258,"Day High":71.88,"Day Low":70.955,"VS Average Volume":0.1954755424,"Company Summary":"NextEra Energy, Inc., through its subsidiaries, generates, transmits, distributes, and sells electric power to retail and wholesale customers in North America. The company generates electricity through wind, solar, nuclear,natural gas, and other clean energy. It also develops, constructs, and operates long-term contracted assets that consists of clean energy solutions, such as renewable generation facilities, battery storage projects, and electric transmission facilities; sells energy commodities; and owns, develops, constructs, manages and operates electric generation facilities in wholesale energy markets. The company had approximately 33,276 megawatts of net generating capacity; approximately 90,000 circuit miles of transmission and distribution lines; and 883 substations. It serves approximately 12 million people through approximately 5.9 million customer accounts in the east and lower west coasts of Florida. The company was formerly known as FPL Group, Inc. and changed its name to NextEra Energy, Inc. in 2010. NextEra Energy, Inc. was founded in 1925 and is headquartered in Juno Beach, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"American Airlines Group, Inc.","Symbol":"AAL","Current Price":"18.36","Latest MA":"12.82","Price Target":20.10636,"Difference from MA":"43.14%","Difference from Open":"-0.86%","Change from Yesterday":"0.50%","Change from Last Report":"0.16","Latest Volume":"4,731,973","Market Cap":"12,061,639,680","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":7.456381,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Airlines","Sector":"Industrials","Beta":1.399,"Trailing PEG":0.2224,"Trailing PE":43.70238,"Trailing PS":0.22497603,"Quick Ratio":0.422,"Day High":18.6399,"Day Low":18.27,"VS Average Volume":0.180880736,"Company Summary":"American Airlines Group Inc., through its subsidiaries, operates as a network air carrier. The company provides scheduled air transportation services for passengers and cargo through its hubs in Charlotte, Chicago, Dallas\/Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix, and Washington, D.C., as well as through partner gateways in London, Doha, Madrid, Seattle\/Tacoma, Sydney, and Tokyo. It operates a mainline fleet of 965 aircraft. The company was formerly known as AMR Corporation and changed its name to American Airlines Group Inc. in December 2013. American Airlines Group Inc. was founded in 1926 and is headquartered in Fort Worth, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"TAL Education Group","Symbol":"TAL","Current Price":"9.34","Latest MA":"9.89","Price Target":13.85947,"Difference from MA":"-5.56%","Difference from Open":"-0.11%","Change from Yesterday":"-5.37%","Change from Last Report":"0.76","Latest Volume":"5,005,337","Market Cap":"5,644,003,328","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":20.492794,"PB Ratio":1.5045103,"ROE":0.019609999,"DTE":9.291,"Industry":"Education & Training Services","Sector":"Consumer Defensive","Beta":0.033,"Trailing PEG":0.7989,"Trailing PE":77.833336,"Trailing PS":3.0730433,"Quick Ratio":2.67,"Day High":9.5,"Day Low":9.205,"VS Average Volume":0.7937564672,"Company Summary":"TAL Education Group provides K-12 after-school tutoring services in the People's Republic of China. It provides learning services primarily through small-classes services; personalized premium services; and learning content solutions, such as print books, smart books, mobile apps, and AI-driven learning devices. The company also operates www.xueersi.com, an online education platform; provides investment management and consulting services; develops and sells software and networks, as well as related consulting services; and sells educational materials and products. It offers its services under the Haoweilai and Think Academy brands. TAL Education Group was founded in 2003 and is headquartered in Beijing, the People's Republic of China.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"Freeport-McMoRan, Inc.","Symbol":"FCX","Current Price":"40.38","Latest MA":"44.45","Price Target":50.18381,"Difference from MA":"-9.16%","Difference from Open":"-0.93%","Change from Yesterday":"0.41%","Change from Last Report":"0.24","Latest Volume":"2,055,752","Market Cap":"58,023,235,584","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":21.547607,"PB Ratio":3.306584,"ROE":0.16870001,"DTE":33.531,"Industry":"Copper","Sector":"Basic Materials","Beta":1.91,"Trailing PEG":10.52,"Trailing PE":29.26087,"Trailing PS":2.2629967,"Quick Ratio":1.048,"Day High":40.94,"Day Low":40.19,"VS Average Volume":0.1820379159,"Company Summary":"Freeport-McMoRan Inc. engages in the mining of mineral properties in North America, South America, and Indonesia. It primarily explores for copper, gold, molybdenum, silver, and other metals. The company's assets include the Grasberg minerals district in Indonesia; Morenci, Bagdad, Safford, Sierrita, and Miami in Arizona; Chino and Tyrone in New Mexico; and Henderson and Climax in Colorado, North America, as well as Cerro Verde in Peru and El Abra in Chile. The company was formerly known as Freeport-McMoRan Copper & Gold Inc. and changed its name to Freeport-McMoRan Inc. in July 2014. Freeport-McMoRan Inc. was incorporated in 1987 and is headquartered in Phoenix, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"CSX Corporation","Symbol":"CSX","Current Price":"32.92","Latest MA":"33.77","Price Target":37.96615,"Difference from MA":"-2.50%","Difference from Open":"-0.23%","Change from Yesterday":"0.60%","Change from Last Report":"0.03","Latest Volume":"1,136,464","Market Cap":"63,493,226,496","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":16.730947,"PB Ratio":4.9105144,"ROE":0.29458,"DTE":147.913,"Industry":"Railroads","Sector":"Industrials","Beta":1.191,"Trailing PEG":2.0951,"Trailing PE":17.513298,"Trailing PS":4.324857,"Quick Ratio":1.195,"Day High":33.08,"Day Low":32.775,"VS Average Volume":0.0928670305,"Company Summary":"CSX Corporation, together with its subsidiaries, provides rail-based freight transportation services. The company offers rail services; and transportation of intermodal containers and trailers, as well as other transportation services, such as rail-to-truck transfers and bulk commodity operations. It also transports chemicals, agricultural and food products, minerals, automotive, forest products, fertilizers, and metals and equipment; and coal, coke, and iron ore to electricity-generating power plants, steel manufacturers, and industrial plants, as well as exports coal to deep-water port facilities. In addition, the company provides intermodal services through a network of approximately 30 terminals transporting manufactured consumer goods in containers; and drayage services, including the pickup and delivery of intermodal shipments. It serves the automotive industry with distribution centers and storage locations, as well as connects non-rail served customers through transferring products, such as plastics and ethanol from rail to trucks. The company operates approximately 20,000 route mile rail network, which serves various population centers in 26 states east of the Mississippi River, the District of Columbia, and the Canadian provinces of Ontario and Quebec, as well as owns and leases approximately 3,500 locomotives. It serves production and distribution facilities through track connections. CSX Corporation was incorporated in 1978 and is headquartered in Jacksonville, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"Procter & Gamble Company (The)","Symbol":"PG","Current Price":"161.61","Latest MA":"168.43","Price Target":179.49692,"Difference from MA":"-4.05%","Difference from Open":"0.40%","Change from Yesterday":"0.33%","Change from Last Report":"-0.05","Latest Volume":"1,535,789","Market Cap":"380,598,026,240","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":21.91548,"PB Ratio":7.4557114,"ROE":0.28766,"DTE":69.338,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":0.414,"Trailing PEG":3.4094,"Trailing PE":27.863792,"Trailing PS":4.536059,"Quick Ratio":0.507,"Day High":162.15,"Day Low":160.96,"VS Average Volume":0.2274844949,"Company Summary":"The Procter & Gamble Company engages in the provision of branded consumer packaged goods worldwide. The company operates through five segments: Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care. The Beauty segment offers conditioners, shampoos, styling aids, and treatments under the Head & Shoulders, Herbal Essences, Pantene, and Rejoice brands; and antiperspirants and deodorants, personal cleansing, and skin care products under the Olay, Old Spice, Safeguard, Secret, SK-II, and Native brands. The Grooming segment provides blades and razors, shave products, appliances, and other grooming products under the Braun, Gillette, and Venus brand names. The Health Care segment offers toothbrushes, toothpastes, and other oral care products under the Crest and Oral-B brand names; and gastrointestinal, pain relief, rapid diagnostics, respiratory, vitamins\/minerals\/supplements, and other personal health care products under Metamucil, Neurobion, Pepto-Bismol, and Vicks brands. The Fabric & Home Care segment provides fabric enhancers, laundry additives, and laundry detergents under the Ariel, Downy, Gain, and Tide brands; and air care, dish care, P&G professional, and surface care products under the Cascade, Dawn, Fairy, Febreze, Mr. Clean, and Swiffer brands. The Baby, Feminine & Family Care segment offers baby wipes, and taped diapers and pants under the Luvs and Pampers brands; adult incontinence and feminine care products under the Always, Always Discreet, and Tampax brands; and paper towels, tissues, and toilet papers under the Bounty, Charmin, and Puffs brands. It sells its products primarily through mass merchandisers, e-commerce, grocery stores, membership club stores, drug stores, department stores, distributors, wholesalers, specialty beauty stores, high-frequency stores, pharmacies, electronics stores, and professional channels, as well as directly to consumers. The company was founded in 1837 and is headquartered in Cincinnati, Ohio.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"Abbott Laboratories","Symbol":"ABT","Current Price":"115.67","Latest MA":"111.23","Price Target":130.62125,"Difference from MA":"3.99%","Difference from Open":"1.24%","Change from Yesterday":"1.93%","Change from Last Report":"0.03","Latest Volume":"1,263,836","Market Cap":"200,624,996,352","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":22.4378,"PB Ratio":5.041405,"ROE":0.14840001,"DTE":37.589,"Industry":"Medical Devices","Sector":"Healthcare","Beta":0.722,"Trailing PEG":2.1992,"Trailing PE":35.158054,"Trailing PS":4.8675303,"Quick Ratio":0.996,"Day High":115.96,"Day Low":114.135,"VS Average Volume":0.2532032159,"Company Summary":"Abbott Laboratories, together with its subsidiaries, discovers, develops, manufactures, and sells health care products worldwide. It operates in four segments: Established Pharmaceutical Products, Diagnostic Products, Nutritional Products, and Medical Devices. The company provides generic pharmaceuticals for the treatment of pancreatic exocrine insufficiency, irritable bowel syndrome or biliary spasm, intrahepatic cholestasis or depressive symptoms, gynecological disorder, hormone replacement therapy, dyslipidemia, hypertension, hypothyroidism, Ménière's disease and vestibular vertigo, pain, fever, inflammation, and migraine, as well as provides anti-infective clarithromycin, influenza vaccine, and products to regulate physiological rhythm of the colon. It also offers laboratory and transfusion medicine systems in the areas of immunoassay, clinical chemistry, hematology, and transfusion; molecular diagnostics polymerase chain reaction instrument systems that automate the extraction, purification, and preparation of DNA and RNA from patient samples, and detect and measure infectious agents; point of care systems; cartridges for testing blood gas, chemistry, electrolytes, coagulation, and immunoassay; rapid diagnostics lateral flow testing products; molecular point-of-care testing for HIV, SARS-CoV-2, influenza A and B, RSV, and strep A; cardiometabolic test systems; drug and alcohol test, and remote patient monitoring and consumer self-test systems; and informatics and automation solutions for laboratories. In addition, the company provides pediatric and adult nutritional products; rhythm management, electrophysiology, heart failure, vascular, and structural heart devices for the treatment of cardiovascular diseases; diabetes care products, such as glucose and blood glucose monitoring systems; and neuromodulation devices for the management of chronic pain and movement disorders. Abbott Laboratories was founded in 1888 and is based in North Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"Alcoa Corporation","Symbol":"AA","Current Price":"39.18","Latest MA":"37.77","Price Target":48.04615,"Difference from MA":"3.73%","Difference from Open":"-2.03%","Change from Yesterday":"-0.89%","Change from Last Report":"0.37","Latest Volume":"1,145,148","Market Cap":"10,121,935,872","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":9.741605,"PB Ratio":1.927976,"ROE":-0.07142,"DTE":56.095,"Industry":"Aluminum","Sector":"Basic Materials","Beta":2.419,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.91984147,"Quick Ratio":0.671,"Day High":40.62,"Day Low":38.8502,"VS Average Volume":0.2663859701,"Company Summary":"Alcoa Corporation, together with its subsidiaries, produces and sells bauxite, alumina, and aluminum products in the United States, Spain, Australia, Iceland, Norway, Brazil, Canada, and internationally. The company operates through two segments, Alumina and Aluminum. It engages in bauxite mining operations; and processes bauxite into alumina and sells it to customers who process it into industrial chemical products, as well as aluminum smelting and casting businesses. The company offers primary aluminum in the form of alloy ingot or value-add ingot to customers that produce products for the transportation, building and construction, packaging, wire, and other industrial markets; and flat-rolled aluminum in the form of sheet, which is sold primarily to customers that produce beverage and food cans. In addition, it owns hydro power plants that generates and sells electricity in the wholesale market to traders, large industrial consumers, distribution companies, and other generation companies. The company was formerly known as Alcoa Upstream Corporation and changed its name to Alcoa Corporation in October 2016. The company was founded in 1886 and is headquartered in Pittsburgh, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"Lam Research Corporation","Symbol":"LRCX","Current Price":"80.79","Latest MA":"82.30","Price Target":90.85239,"Difference from MA":"-1.84%","Difference from Open":"-0.04%","Change from Yesterday":"0.63%","Change from Last Report":"-0.26","Latest Volume":"1,466,433","Market Cap":"103,951,687,680","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":19.792109,"PB Ratio":12.321183,"ROE":0.49116,"DTE":58.827,"Industry":"Semiconductor Equipment & Materials","Sector":"Technology","Beta":1.486,"Trailing PEG":1.5436,"Trailing PE":26.145632,"Trailing PS":6.667288,"Quick Ratio":1.685,"Day High":81.15,"Day Low":79.915,"VS Average Volume":0.125585285,"Company Summary":"Lam Research Corporation designs, manufactures, markets, refurbishes, and services semiconductor processing equipment used in the fabrication of integrated circuits. The company offers ALTUS systems to deposit conformal films for tungsten metallization applications; SABRE electrochemical deposition products for copper interconnect transition that offers copper damascene manufacturing; and VECTOR plasma-enhanced CVD products. It also provides SPEED gapfill high-density plasma chemical vapor deposition products; and Striker single-wafer atomic layer deposition products for dielectric film solutions. In addition, the company offers Flex for dielectric etch applications; Vantex, a dielectric etch system that provides RF technology and repeatable wafer-to-wafer performance enabled by Equipment Intelligence solutions; Kiyo for conductor etch applications; Syndion for through-silicon via etch applications; and Versys metal products for metal etch processes. Further, it provides Coronus bevel clean products to enhance die yield; and Da Vinci, DV-Prime, EOS, and SP series products to address various wafer cleaning applications. The company sells its products in the United States, China, Europe, Japan, Korea, Southeast Asia, and Taiwan. Lam Research Corporation was incorporated in 1980 and is headquartered in Fremont, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"Halliburton Company","Symbol":"HAL","Current Price":"29.79","Latest MA":"30.23","Price Target":36.28519,"Difference from MA":"-1.45%","Difference from Open":"-1.36%","Change from Yesterday":"-0.37%","Change from Last Report":"-0.05","Latest Volume":"2,223,419","Market Cap":"26,170,662,912","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":9.777344,"PB Ratio":2.5403001,"ROE":0.26293,"DTE":83.993,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.905,"Trailing PEG":2.3699,"Trailing PE":10.41612,"Trailing PS":1.1342549,"Quick Ratio":1.377,"Day High":30.26,"Day Low":29.66,"VS Average Volume":0.2369833726,"Company Summary":"Halliburton Company provides products and services to the energy industry worldwide. It operates through two segments, Completion and Production, and Drilling and Evaluation. The Completion and Production segment offers production enhancement services that include stimulation and sand control services; cementing services, such as well bonding and casing, and casing equipment; and completion tools that offer downhole solutions and services, including well completion products and services, intelligent well completions, and service tools, as well as liner hanger, sand control, and multilateral systems. This segment also provides electrical submersible pumps, as well as artificial lift services; production solutions comprising coiled tubing, hydraulic workover units, downhole tools, and pumping and nitrogen services; pipeline and process services, such as pre-commissioning, commissioning, maintenance, and decommissioning; and specialty chemicals and services. The Drilling and Evaluation segment offers drilling fluid systems, performance additives, completion fluids, solids control, specialized testing equipment, and waste management services; drilling systems and services; wireline and perforating services consists of open-hole logging, and cased-hole and slickline; and drill bits and services comprising roller cone rock bits, fixed cutter bits, hole enlargement, and related downhole tools and services, as well as coring equipment and services. This segment also provides cloud based digital services and artificial intelligence solutions on an open architecture for subsurface insights, integrated well construction, and reservoir and production management; testing and subsea services, such as acquisition and analysis of reservoir information and optimization solutions; and project management and integrated asset management services. Halliburton Company was founded in 1919 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"Kinder Morgan, Inc.","Symbol":"KMI","Current Price":"30.96","Latest MA":"23.53","Price Target":27.91833,"Difference from MA":"31.58%","Difference from Open":"1.26%","Change from Yesterday":"2.13%","Change from Last Report":"0.31","Latest Volume":"3,260,656","Market Cap":"68,781,752,320","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":24.472488,"PB Ratio":2.2621584,"ROE":0.083500005,"DTE":101.433,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.907,"Trailing PEG":2.2194,"Trailing PE":27.398142,"Trailing PS":4.53975,"Quick Ratio":0.291,"Day High":31.015,"Day Low":30.5514,"VS Average Volume":0.248378892,"Company Summary":"Kinder Morgan, Inc. operates as an energy infrastructure company primarily in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas gasification, liquefaction, and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and\/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, renewable fuel and feedstocks, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; owns interests in\/or operates oil fields and gasoline processing plants; and operates a crude oil pipeline system in West Texas, as well as owns and operates RNG and LNG facilities. It owns and operates approximately 82,000 miles of pipelines and 139 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1997 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"Las Vegas Sands Corp.","Symbol":"LVS","Current Price":"45.34","Latest MA":"46.18","Price Target":59.59579,"Difference from MA":"-1.83%","Difference from Open":"1.14%","Change from Yesterday":"2.11%","Change from Last Report":"-0.13","Latest Volume":"1,451,867","Market Cap":"32,872,677,376","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":16.313988,"PB Ratio":9.593738,"ROE":0.45166,"DTE":384.206,"Industry":"Resorts & Casinos","Sector":"Consumer Cyclical","Beta":1.117,"Trailing PEG":0.6638,"Trailing PE":22.445545,"Trailing PS":2.9047165,"Quick Ratio":0.864,"Day High":45.565,"Day Low":44.86,"VS Average Volume":0.301067623,"Company Summary":"Las Vegas Sands Corp., together with its subsidiaries, develops, owns, and operates integrated resorts in Macao and Singapore. It owns and operates The Venetian Macao Resort Hotel, the Londoner Macao, The Parisian Macao, The Plaza Macao and Four Seasons Hotel Macao, Cotai Strip, and the Sands Macao in Macao, the People's Republic of China; and Marina Bay Sands in Singapore. The company's integrated resorts feature accommodations, gaming, entertainment and retail malls, convention and exhibition facilities, celebrity chef restaurants, and other amenities. Las Vegas Sands Corp. was founded in 1988 and is based in Las Vegas, Nevada.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"Johnson & Johnson","Symbol":"JNJ","Current Price":"148.09","Latest MA":"154.14","Price Target":171.29272,"Difference from MA":"-3.93%","Difference from Open":"0.36%","Change from Yesterday":"0.72%","Change from Last Report":"0.06","Latest Volume":"1,789,023","Market Cap":"356,544,446,464","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.970213,"PB Ratio":5.0813203,"ROE":0.20889,"DTE":50.958,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.518,"Trailing PEG":0.8581,"Trailing PE":24.518211,"Trailing PS":4.0656867,"Quick Ratio":0.705,"Day High":148.85,"Day Low":147.05,"VS Average Volume":0.225991035,"Company Summary":"Johnson & Johnson, together with its subsidiaries, researches, develops, manufactures, and sells various products in the healthcare field worldwide. The company's Innovative Medicine segment offers products for various therapeutic areas, such as immunology, including rheumatoid arthritis, psoriatic arthritis, inflammatory bowel disease, and psoriasis; infectious diseases comprising HIV\/AIDS; neuroscience, consisting of mood disorders, neurodegenerative disorders, and schizophrenia; oncology, such as prostate cancer, hematologic malignancies, lung cancer, and bladder cancer; cardiovascular and metabolism, including thrombosis, diabetes, and macular degeneration; and pulmonary hypertension comprising pulmonary arterial hypertension through retailers, wholesalers, distributors, hospitals, and healthcare professionals for prescription use. Its MedTech segment provides Interventional Solutions, including electrophysiology products to treat heart rhythm disorders; the heart recovery portfolio, which includes technologies to treat severe coronary artery disease requiring high-risk PCI or AMI cardiogenic shock; and neurovascular care that treats hemorrhagic and ischemic stroke. this segment also offers an orthopaedics portfolio that includes products and enabling technologies that support hips, knees, trauma, spine, sports, and other; surgery portfolios comprising advanced and general surgery technologies, as well as solutions for breast aesthetics, ear, nose, and throat procedures; contact lenses under the ACUVUE Brand; and TECNIS intraocular lenses for cataract surgery. It distributes its products to wholesalers, hospitals, and retailers, as well as physicians, nurses, hospitals, eye care professionals, and clinics. The company has a collaboration agreement with Stand Up To Cancer for research testing a combination of teclistamab and daratumumab to treat a rare disease AL amyloidosis. Johnson & Johnson was founded in 1886 and is based in New Brunswick, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"New Oriental Education & Techno","Symbol":"EDU","Current Price":"47.67","Latest MA":"66.10","Price Target":85.49,"Difference from MA":"-27.88%","Difference from Open":"-4.79%","Change from Yesterday":"-21.76%","Change from Last Report":"1.82","Latest Volume":"4,926,699","Market Cap":"7,795,426,816","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":10.84057,"PB Ratio":1.980309,"ROE":0.09543,"DTE":16.761,"Industry":"Education & Training Services","Sector":"Consumer Defensive","Beta":0.487,"Trailing PEG":1.0065,"Trailing PE":20.726086,"Trailing PS":1.6768034,"Quick Ratio":1.634,"Day High":50.63,"Day Low":44.46,"VS Average Volume":3.193442251,"Company Summary":"New Oriental Education & Technology Group Inc. provides private educational services under the New Oriental brand in the People's Republic of China. The company operates through four segments: Educational Services and Test Preparation Courses; Online Education and Other Services; Overseas Study Consulting Services; and Educational Materials and Distribution. It offers test preparation courses to students taking language and entrance exams used by educational institutions in the United States, the Commonwealth countries, and the People's Republic of China. The company also provides non-academic tutoring courses; intelligent learning systems and devices to offer a digital learning experience for students; and overseas studies consulting services. In addition, it offers online education services through the Koolearn.com platform. Further, the company develops and edits educational materials for language training and test preparation. In addition, it offers educational programs, services, and products to students through schools; learning centers; and bookstores, as well as through its online learning platforms. The company was founded in 1993 and is headquartered in Beijing, the People's Republic of China.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"21-01-2025 17:24:41"},{"Company Name":"Amphenol Corporation","Symbol":"APH","Current Price":"71.32","Latest MA":"67.50","Price Target":77.91529,"Difference from MA":"5.66%","Difference from Open":"0.88%","Change from Yesterday":"2.74%","Change from Last Report":"0.01","Latest Volume":"2,393,460","Market Cap":"85,984,100,352","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":32.961903,"PB Ratio":9.094619,"ROE":0.25293,"DTE":57.565,"Industry":"Electronic Components","Sector":"Technology","Beta":1.238,"Trailing PEG":2.1533,"Trailing PE":40.988506,"Trailing PS":6.041434,"Quick Ratio":1.208,"Day High":71.38,"Day Low":70.2,"VS Average Volume":0.3750614078,"Company Summary":"Amphenol Corporation, together with its subsidiaries, primarily designs, manufactures, and markets electrical, electronic, and fiber optic connectors in the United States, China, and internationally. It operates through three segments: Harsh Environment Solutions, Communications Solutions, and Interconnect and Sensor Systems. The company offers connectors and connector systems, including harsh environment data, power, high-speed, fiber optic, and radio frequency interconnect products; busbars and power distribution systems; and other connectors. It also provides value-add products, such as backplane interconnect systems, cable assemblies and harnesses, and cable management products; other products comprising flexible and rigid printed circuit boards, hinges, other mechanical, and production related products. In addition, the company offers consumer device, network infrastructure, and other antennas; coaxial, power, and specialty cables; and sensors and sensor-based products. It sells its products through its sales force, independent representatives, and a network of electronics distributors to original equipment manufacturers, electronic manufacturing services companies, original design manufacturers, and service providers in the automotive, broadband communication, commercial aerospace, industrial, information technology and data communication, military, mobile device, and mobile network markets. Amphenol Corporation was founded in 1932 and is headquartered in Wallingford, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 17:24:41"}]