[{"Company Name":"Micron Technology, Inc.","Symbol":"MU","Current Price":"93.63","Latest MA":"98.82","Latest MA 5":94.3580007324,"Latest MA 9":98.3288890923,"Latest MA 20":95.7045003357,"Price Target":130.10394,"Difference from MA":"-5.25%","Difference from Open":"2.89%","Change from Yesterday":"1.97%","Change from Last Report":"0.00","Latest Volume":"23,359,055","Market Cap":"104,319,729,664","Earning Date":"2025-02-27","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":7.2750583,"PB Ratio":2.228861,"Previous Close":91.82,"ROE":0.086569995,"DTE":30.863,"Industry":"Semiconductors","Sector":"Technology","Beta":1.18,"Trailing PEG":0.1857,"Trailing PE":26.82808,"Trailing PS":3.5856097,"Quick Ratio":1.665,"Day High":94.46,"Day Low":89.87,"VS Average Volume":0.9584833931,"Company Summary":"Micron Technology, Inc. designs, develops, manufactures, and sells memory and storage products in the United States, Taiwan, Mainland China, rest of the Asia Pacific, Hong Kong, Japan, Europe, and internationally. The company operates through four segments: Compute and Networking Business Unit, Mobile Business Unit, Embedded Business Unit, and Storage Business Unit. It provides memory and storage technologies comprising dynamic random access memory semiconductor devices with low latency that provide high-speed data retrieval; non-volatile and re-writeable semiconductor storage devices; and non-volatile re-writable semiconductor memory devices that provide fast read speeds under the Micron and Crucial brands, as well as through private labels. The company offers serves the data center, PC, graphics, networking, automotive, industrial, and consumer embedded markets, as well as for smartphone and other mobile-device markets. It markets its products through its direct sales force, independent sales representatives, distributors, and retailers; and web-based customer direct sales channel, as well as through channel and distribution partners. Micron Technology, Inc. was founded in 1978 and is headquartered in Boise, Idaho.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-03-2025 01:38:39"}]