[{"Company Name":"Kimco Realty Corporation (HC)","Symbol":"KIM","Current Price":"22.39","Latest MA":"22.88","Price Target":25.75,"Difference from MA":"-2.14%","Difference from Open":"-2.35%","Change from Yesterday":"-0.09%","Change from Last Report":"0.00","Latest Volume":"6,934,953","Market Cap":"15,092,673,536","Earning Date":"2025-02-07","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":28.707335,"PB Ratio":1.434245,"Previous Close":22.41,"ROE":0.03829,"DTE":78.638,"Industry":"REIT - Retail","Sector":"Real Estate","Beta":1.485,"Trailing PEG":87.8824,"Trailing PE":41.46296,"Trailing PS":7.687714,"Quick Ratio":3.264,"Day High":23.03,"Day Low":22.02,"VS Average Volume":1.6993839293,"Company Summary":"Kimco Realty (NYSE: KIM) is a real estate investment trust (REIT) and leading owner and operator of high-quality, open-air, grocery-anchored shopping centers and mixed-use properties in the United States. The company's portfolio is strategically concentrated in the first-ring suburbs of the top major metropolitan markets, including high-barrier-to-entry coastal markets and rapidly expanding Sun Belt cities. Its tenant mix is focused on essential, necessity-based goods and services that drive multiple shopping trips per week. Publicly traded on the NYSE since 1991 and included in the S&P 500 Index, the company has specialized in shopping center ownership, management, acquisitions, and value-enhancing redevelopment activities for more than 60 years. With a proven commitment to corporate responsibility, Kimco Realty is a recognized industry leader in this area. As of September 30, 2024, the company owned interests in 567 U.S. shopping centers and mixed-use assets comprising 101 million square feet of gross leasable space.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Avantor, Inc.","Symbol":"AVTR","Current Price":"19.16","Latest MA":"23.29","Price Target":26.05789,"Difference from MA":"-17.75%","Difference from Open":"-12.91%","Change from Yesterday":"-11.71%","Change from Last Report":"0.00","Latest Volume":"14,231,263","Market Cap":"13,040,564,224","Earning Date":"2025-02-07","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":15.281666,"PB Ratio":2.348327,"Previous Close":21.7,"ROE":0.058130004,"DTE":88.619,"Industry":"Medical Instruments & Supplies","Sector":"Healthcare","Beta":1.348,"Trailing PEG":null,"Trailing PE":42.577778,"Trailing PS":1.9121623,"Quick Ratio":0.842,"Day High":22.44,"Day Low":19.09,"VS Average Volume":2.565658811,"Company Summary":"Avantor, Inc. engages in the provision of mission-critical products and services to customers in the biopharma, healthcare, education and government, advanced technologies, and applied materials industries in the Americas, Europe, Asia, the Middle East, and Africa. The company offers materials and consumables, such as purity chemicals and reagents, lab products and supplies, formulated silicone materials, customized excipients, customized single-use assemblies, process chromatography resins and columns, analytical sample prep kits, education and microbiology products, clinical trial kits, peristaltic pumps, and fluid handling tips. It also provides equipment and instrumentation products, including filtration systems, virus inactivation systems, incubators, analytical instruments, evaporators, ultra-low-temperature freezers, biological safety cabinets, and critical environment supplies. In addition, the company offers services and specialty procurements comprising onsite lab and production, clinical, equipment, procurement and sourcing, and biopharmaceutical material scale-up and development services. Further, it provides scientific research support services, such as DNA extraction, bioreactor servicing, clinical and biorepository, and compound management services. The company was founded in 1904 and is headquartered in Radnor, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Flowers Foods, Inc.","Symbol":"FLO","Current Price":"19.09","Latest MA":"21.67","Price Target":23.28571,"Difference from MA":"-11.92%","Difference from Open":"-5.54%","Change from Yesterday":"-1.29%","Change from Last Report":"0.00","Latest Volume":"3,530,738","Market Cap":"4,020,315,904","Earning Date":"2025-02-07","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":14.204186,"PB Ratio":2.8365529,"Previous Close":19.34,"ROE":0.17307,"DTE":87.609,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.361,"Trailing PEG":null,"Trailing PE":16.745615,"Trailing PS":0.785005,"Quick Ratio":0.725,"Day High":20.25,"Day Low":18.85,"VS Average Volume":1.9862208711,"Company Summary":"Flowers Foods, Inc. produces and markets packaged bakery food products in the United States. Its principal products include fresh breads, buns, rolls, snack items, bagels, English muffins, and tortillas, as well as frozen breads and rolls under the Nature's Own, Dave's Killer Bread, Wonder, Canyon Bakehouse, Mrs. Freshley's, and Tastykake brand names. The company distributes its products through a direct-store-delivery distribution and a warehouse delivery system, as well as operates bakeries. Its customers include national and regional restaurants, institutions and foodservice distributors, and retail in-store bakeries; wholesale distributors; mass merchandisers, supermarkets, vending outlets, and convenience stores; quick-serve chains, food wholesalers, institutions, dollar stores, and vending companies; and public health care, military commissaries, and prisons, and other governmental institutions. The company was formerly known as Flowers Industries and changed its name to Flowers Foods, Inc. in 2001. Flowers Foods, Inc. was founded in 1919 and is headquartered in Thomasville, Georgia.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Valvoline Inc.","Symbol":"VVV","Current Price":"38.70","Latest MA":"40.43","Price Target":43.80769,"Difference from MA":"-4.29%","Difference from Open":"-1.23%","Change from Yesterday":"-2.22%","Change from Last Report":"0.00","Latest Volume":"2,724,120","Market Cap":"4,964,706,816","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":19.947323,"PB Ratio":46.852303,"Previous Close":39.58,"ROE":1.0227101,"DTE":"N\/A","Industry":"Auto & Truck Dealerships","Sector":"Consumer Cyclical","Beta":1.462,"Trailing PEG":null,"Trailing PE":18.428572,"Trailing PS":3.1551998,"Quick Ratio":0.468,"Day High":39.35,"Day Low":38.6,"VS Average Volume":1.7639117228,"Company Summary":"Valvoline Inc. engages in the operation and franchising of vehicle service centers and retail stores in the United States and Canada. The company, through its service centers, provides fluid exchange for motor oil, transmission and differential fluid, and coolant; parts replacement for batteries, filters, wiper blades, and belts; and safety services, such as tire inflation and rotation, bulbs, and safety checks. It offers its services for passenger cars, hybrid and battery electric vehicles, and light and medium duty vehicles. The company was founded in 1866 and is headquartered in Lexington, Kentucky.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Monolithic Power Systems, Inc.","Symbol":"MPWR","Current Price":"720.25","Latest MA":"764.40","Price Target":827.9429,"Difference from MA":"-5.78%","Difference from Open":"5.15%","Change from Yesterday":"8.98%","Change from Last Report":"0.00","Latest Volume":"2,530,776","Market Cap":"35,133,796,352","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":35.681446,"PB Ratio":14.939537,"Previous Close":660.9,"ROE":0.20214,"DTE":0.693,"Industry":"Semiconductors","Sector":"Technology","Beta":1.148,"Trailing PEG":1.7615,"Trailing PE":19.673586,"Trailing PS":17.22712,"Quick Ratio":4.834,"Day High":723.99,"Day Low":677.0,"VS Average Volume":2.4731612358,"Company Summary":"Monolithic Power Systems, Inc. engages in the design, development, marketing, and sale of semiconductor-based power electronics solutions for the storage and computing, automotive, enterprise data, consumer, communications, and industrial markets. The company provides direct current (DC) to DC integrated circuits (ICs) that are used to convert and control voltages of various electronic systems, such as cloud-based CPU servers, server artificial intelligence applications, storage applications, commercial notebooks, digital cockpit, power sources, home appliances, 4G and 5G infrastructure, and satellite communications applications. It offers lighting control ICs for backlighting that are used in systems, which provide the light source for LCD panels in computers and notebooks, monitors, car navigation systems, and televisions, as well as for general illumination products. The company sells its products through third-party distributors, value-added resellers, directly to original equipment manufacturers, original design manufacturers, electronic manufacturing service providers, and other end customers. It serves China, Taiwan, South Korea, Europe, Japan, Southeast Asia, the United States, and internationally. Monolithic Power Systems, Inc. was incorporated in 1997 and is headquartered in Kirkland, Washington.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Fortune Brands Innovations, Inc","Symbol":"FBIN","Current Price":"68.09","Latest MA":"77.27","Price Target":82.3075,"Difference from MA":"-11.89%","Difference from Open":"2.39%","Change from Yesterday":"-1.40%","Change from Last Report":"0.00","Latest Volume":"3,799,377","Market Cap":"8,458,547,712","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":14.104433,"PB Ratio":3.530357,"Previous Close":69.06,"ROE":0.1942,"DTE":121.253,"Industry":"Building Products & Equipment","Sector":"Industrials","Beta":1.576,"Trailing PEG":2.0401,"Trailing PE":18.157331,"Trailing PS":1.812766,"Quick Ratio":0.588,"Day High":68.46,"Day Low":65.35,"VS Average Volume":3.079523082,"Company Summary":"Fortune Brands Innovations, Inc. provides home and security products for residential home repair, remodeling, new construction, and security applications in the United States and internationally. The company operates through three segments: Water, Outdoors, and Security. The Water segment manufactures or assembles, and sells faucets, accessories, kitchen sinks, and waste disposals under the Moen, ROHL, Riobel, Victoria+Albert, Perrin & Rowe, Aqualisa, Shaws, Emtek, and Schaub brands. The Outdoors segment manufactures and sells fiberglass and steel entry door systems under the Therma-Tru brand; storm, screen, and security doors under the Larson brand; composite decking, railing, and cladding under the Fiberon brand; and urethane millwork under the Fypon brand. The Security segment manufactures, sources, and distributes locks, safety and security devices, and electronic security products under the Master Lock, American Lock, Yale, and August brands; and fire-resistant safes, security containers, and commercial cabinets under the SentrySafe brand. The company sells its products through various sales channels, including kitchen and bath dealers, wholesalers oriented toward builders or professional remodelers, industrial and locksmith distributors, do-it-yourself remodeling-oriented home centers, showrooms, e-commerce, and other retail outlets. Fortune Brands Innovations, Inc. was incorporated in 1988 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"FirstEnergy Corp.","Symbol":"FE","Current Price":"40.16","Latest MA":"41.33","Price Target":46.21467,"Difference from MA":"-2.84%","Difference from Open":"1.21%","Change from Yesterday":"0.07%","Change from Last Report":"0.00","Latest Volume":"3,416,526","Market Cap":"23,144,890,368","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":13.921194,"PB Ratio":1.8624495,"Previous Close":39.705,"ROE":0.083050005,"DTE":173.13,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.495,"Trailing PEG":1.2111,"Trailing PE":25.909678,"Trailing PS":1.7458619,"Quick Ratio":0.406,"Day High":40.315,"Day Low":39.57,"VS Average Volume":1.1245922911,"Company Summary":"FirstEnergy Corp., through its subsidiaries, generates, transmits, and distributes electricity in the United States. It operates through Regulated Distribution and Regulated Transmission segments. The company owns and operates coal-fired, nuclear, hydroelectric, wind, and solar power generating facilities. It operates 24,080 circuit miles of overhead and underground transmission lines; and electric distribution systems, including 274,518 miles of overhead pole line and underground conduit carrying primary, secondary, and street lighting circuits. The company serves approximately 6 million customers in Ohio, Pennsylvania, West Virginia, Maryland, New Jersey, and New York. FirstEnergy Corp. was incorporated in 1996 and is headquartered in Akron, Ohio.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Honeywell International Inc.","Symbol":"HON","Current Price":"205.52","Latest MA":"213.96","Price Target":242.46043,"Difference from MA":"-3.94%","Difference from Open":"-3.06%","Change from Yesterday":"-2.05%","Change from Last Report":"0.00","Latest Volume":"6,432,856","Market Cap":"133,638,758,400","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":17.53609,"PB Ratio":7.6778245,"Previous Close":209.82,"ROE":0.31865,"DTE":177.821,"Industry":"Conglomerates","Sector":"Industrials","Beta":1.025,"Trailing PEG":1.7742,"Trailing PE":23.595867,"Trailing PS":3.5307465,"Quick Ratio":0.972,"Day High":213.4,"Day Low":205.38,"VS Average Volume":1.5673588328,"Company Summary":"Honeywell International Inc. engages in the aerospace technologies, building automation, energy and sustainable solutions, and industrial automation businesses in the United States, Europe, and internationally. The company's Aerospace segment offers auxiliary power units, propulsion engines, integrated avionics, environmental control and electric power systems, engine controls, flight safety, communications, navigation hardware, data and software applications, radar and surveillance systems, aircraft lighting, advanced systems and instruments, satellite and space components, and aircraft wheels and brakes; spare parts; repair, overhaul, and maintenance services; and thermal systems, as well as wireless connectivity services. Its Honeywell Building Technologies segment provides software applications for building control and optimization; sensors, switches, control systems, and instruments for energy management; access control; video surveillance; fire products; and installation, maintenance, and upgrades of systems. The company's Performance Materials and Technologies segment offers automation control, instrumentation, and software and related services; catalysts and adsorbents, equipment, and consulting; and materials to manufacture end products, such as bullet-resistant armor, nylon, computer chips, and pharmaceutical packaging, as well as provides materials based on hydrofluoro-olefin technology. Its Safety and Productivity Solutions segment provides personal protective equipment, apparel, gear, and footwear; gas detection technology; custom-engineered sensors, switches, and controls for sensing and productivity solution; cloud-based notification and emergency messaging; mobile devices and software; custom-engineered sensors, switches, and controls; and data and asset management productivity solutions. Honeywell International Inc. was founded in 1885 and is headquartered in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Xcel Energy Inc.","Symbol":"XEL","Current Price":"66.60","Latest MA":"63.32","Price Target":72.66,"Difference from MA":"5.18%","Difference from Open":"-1.20%","Change from Yesterday":"-0.77%","Change from Last Report":"0.00","Latest Volume":"3,781,664","Market Cap":"38,244,515,840","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.092981,"PB Ratio":1.975792,"Previous Close":67.12,"ROE":0.10262,"DTE":154.33,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.398,"Trailing PEG":2.1698,"Trailing PE":19.360464,"Trailing PS":2.7787921,"Quick Ratio":0.64,"Day High":67.89,"Day Low":66.435,"VS Average Volume":1.0816312288,"Company Summary":"Xcel Energy Inc., through its subsidiaries, engages in the generation, purchasing, transmission, distribution, and sale of electricity. It operates through Regulated Electric Utility, Regulated Natural Gas Utility, and All Other segments. The company generates electricity through wind, nuclear, hydroelectric, biomass, and solar energy sources, as well as coal, natural gas, oil, wood, and refuse-derived fuels. It also purchases, transports, distributes, and sells natural gas to retail customers, as well as transports customer-owned natural gas. In addition, the company develops and leases natural gas pipelines, and storage and compression facilities; and invests in rental housing projects and nonregulated assets, as well as procures equipment for the construction of renewable generation facilities. It serves residential, commercial, and industrial customers in the portions of Colorado, Michigan, Minnesota, New Mexico, North Dakota, South Dakota, Texas, and Wisconsin. The company was incorporated in 1909 and is headquartered in Minneapolis, Minnesota.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Cloudflare, Inc.","Symbol":"NET","Current Price":"166.66","Latest MA":"95.31","Price Target":137.20667,"Difference from MA":"74.87%","Difference from Open":"8.57%","Change from Yesterday":"17.76%","Change from Last Report":"0.00","Latest Volume":"15,053,343","Market Cap":"57,196,711,936","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":158.83575,"PB Ratio":58.745155,"Previous Close":141.52,"ROE":-0.1122,"DTE":149.085,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.097,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":36.381138,"Quick Ratio":3.258,"Day High":171.38,"Day Low":152.33,"VS Average Volume":4.8038020431,"Company Summary":"Cloudflare, Inc. operates as a cloud services provider that delivers a range of services to businesses worldwide. The company provides an integrated cloud-based security solution to secure a range of combination of platforms, including public cloud, private cloud, on-premise, software-as-a-service applications, and IoT devices; and website and application security products comprising web application firewall, bot management, distributed denial of service, API gateways, SSL\/TLS encryption, script management, security center, and rate limiting products. It offers website and application performance solutions, including content delivery, load balancing, DNS, agro smart routing, video stream delivery, web optimization, cache reserve, cloudfare waiting room, and cloudfare data localization suite; SASE platform through cloudfare one that provides a cloud-based network-as-a-service; network services which deliver network connectivity, security, and performance, including magic WAN, magic transit, magic firewall, cloudflare network interconnect, and spectrum. In addition, the company provides zero trust services, such as cloudflare access, cloudflare gateway, remote browser isolation, cloud access security broker, cloud email security, and data loss prevention products that protects, inspects, and provides privilege rules to grant access to data and application. Further, it provides developer-based solutions consisting of cloudflare workers, R2 object storage, workers KV, durable objects, cloudfare pages, cloudfare stream, and cloudfare images; and consumer products comprising of 1.1.1.1, a DNS resolver, WARP, a virtual private network, and cloudfare registrar that secures registration and management of domain names. The company serves customers in the technology, healthcare, financial services, consumer and retail, industrial, and non-profit industries, as well as government. Cloudflare, Inc. was incorporated in 2009 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Philip Morris International Inc","Symbol":"PM","Current Price":"144.41","Latest MA":"120.80","Price Target":142.145,"Difference from MA":"19.54%","Difference from Open":"-0.75%","Change from Yesterday":"-0.63%","Change from Last Report":"0.00","Latest Volume":"7,207,049","Market Cap":"224,537,346,048","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":18.440271,"PB Ratio":"N\/A","Previous Close":145.32,"ROE":"N\/A","DTE":"N\/A","Industry":"Tobacco","Sector":"Consumer Defensive","Beta":0.56,"Trailing PEG":1.803,"Trailing PE":23.988373,"Trailing PS":6.032869,"Quick Ratio":0.404,"Day High":145.6498,"Day Low":143.8,"VS Average Volume":1.4079319931,"Company Summary":"Philip Morris International Inc. operates as a tobacco company working to delivers a smoke-free future and evolving portfolio for the long-term to include products outside of the tobacco and nicotine sector. The company's product portfolio primarily consists of cigarettes and smoke-free products, including heat-not-burn, vapor, and oral nicotine products primarily under the IQOS and ZYN brands; and consumer accessories, such as lighters and matches. It also offers wellness and healthcare products. Philip Morris International Inc. was incorporated in 1987 and is headquartered in Stamford, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Warner Music Group Corp.","Symbol":"WMG","Current Price":"32.72","Latest MA":"30.67","Price Target":35.4555,"Difference from MA":"6.69%","Difference from Open":"1.90%","Change from Yesterday":"3.06%","Change from Last Report":"0.00","Latest Volume":"2,450,821","Market Cap":"17,026,211,840","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":21.280748,"PB Ratio":35.069668,"Previous Close":31.75,"ROE":1.25054,"DTE":669.764,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.365,"Trailing PEG":1.2705,"Trailing PE":33.387756,"Trailing PS":2.6678488,"Quick Ratio":0.512,"Day High":32.76,"Day Low":31.74,"VS Average Volume":1.3962397332,"Company Summary":"Warner Music Group Corp. operates as a music entertainment company in the United States, the United Kingdom, Germany, and internationally. It operates through Recorded Music and Music Publishing segments. The Recorded Music segment is involved in the discovery and development of recording artists, as well as related marketing, promotion, distribution, sale, and licensing of music created by such recording artists; markets its music catalog through compilations and reissuances of previously released music and video titles, as well as previously unreleased materials; and conducts its operation primarily through a collection of record labels, such as Warner Records and Atlantic Records, as well as Asylum, Big Beat, Canvasback, East West, Erato, FFRR, Fueled by Ramen, Nonesuch, Parlophone, Reprise, Roadrunner, Sire, Spinnin' Records, Warner Classics, and Warner Music Nashville. This segment markets, distributes, and sells music and video products to retailers and wholesale distributors; independent labels to retail and wholesale distributors; and various distribution centers and ventures, as well as retail outlets, online physical retailers, streaming services, and download services. The Music Publishing segment owns and acquires rights to approximately one million musical compositions comprising pop hits, American standards, folk songs, and motion picture and theatrical compositions. Its catalog includes approximately 150,000 songwriters and composers; and various genres, including pop, rock, jazz, classical, country, R&B, hip-hop, rap, reggae, Latin, folk, blues, symphonic, soul, Broadway, electronic, alternative, and gospel. This segment also administers the music and soundtracks of various third-party television and film producers and studios. The company was founded in 1929 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Eli Lilly and Company","Symbol":"LLY","Current Price":"878.31","Latest MA":"849.50","Price Target":978.3165,"Difference from MA":"3.39%","Difference from Open":"0.20%","Change from Yesterday":"0.91%","Change from Last Report":"0.00","Latest Volume":"3,668,639","Market Cap":"789,878,210,560","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":29.998495,"PB Ratio":55.501423,"Previous Close":870.37,"ROE":0.65318,"DTE":218.081,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.43,"Trailing PEG":0.8227,"Trailing PE":74.74979,"Trailing PS":19.32977,"Quick Ratio":0.63,"Day High":889.36,"Day Low":869.6186,"VS Average Volume":0.9289426913,"Company Summary":"Eli Lilly and Company discovers, develops, and markets human pharmaceuticals worldwide. The company offers Basaglar, Humalog, Humalog Mix 75\/25, Humalog U-100, Humalog U-200, Humalog Mix 50\/50, insulin lispro, insulin lispro protamine, insulin lispro mix 75\/25, Humulin, Humulin 70\/30, Humulin N, Humulin R, and Humulin U-500 for diabetes; Jardiance, Mounjaro, and Trulicity for type 2 diabetes; and Zepbound for obesity. It provides oncology products, including Alimta, Cyramza, Erbitux, Jaypirca, Retevmo, Tyvyt, and Verzenio. In addition, the company offers Olumiant for rheumatoid arthritis, atopic dermatitis, severe alopecia areata, and COVID-19; Taltz for plaque psoriasis, psoriatic arthritis, ankylosing spondylitis, and non-radiographic axial spondylarthritis; Omvoh for ulcerative colitis; Cymbalta for depressive disorder, diabetic peripheral neuropathic pain, generalized anxiety disorder, fibromyalgia, and chronic musculoskeletal pain; Ebglyss for severe atopic dermatitis; and Emgality for migraine prevention and episodic cluster headache. Further, it provides Cialis for erectile dysfunction and benign prostatic hyperplasia; and Forteo for osteoporosis. It operates Lilly Seaport Innovation Center (LSC), a research and development facility in the Boston Seaport to advancing Lilly's efforts in RNA and DNA-based therapies as well as discovering new drug targets to create life-changing medicines across several disease states, including diabetes, obesity, cardiovascular diseases, neurodegeneration, and chronic pain. It has collaborations with Incyte Corporation; Boehringer Ingelheim Pharmaceuticals, Inc.; F. Hoffmann-La Roche Ltd and Genentech, Inc.; Biologics, Inc., AbCellera Biologics Inc.; Verge Genomics; and Chugai Pharmaceutical Co., Ltd, as well as development collaboration with Eli Lilly and Company for developing QIAstat-Dx IVD panel, for the detection of various APOE genotypes. The company was founded in 1876 and is headquartered in Indianapolis, Indiana.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Principal Financial Group Inc","Symbol":"PFG","Current Price":"82.33","Latest MA":"81.57","Price Target":87.38462,"Difference from MA":"0.93%","Difference from Open":"-0.70%","Change from Yesterday":"2.91%","Change from Last Report":"0.00","Latest Volume":"2,956,271","Market Cap":"18,831,011,840","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":8.922157,"PB Ratio":1.6798956,"Previous Close":80.0,"ROE":-0.01274,"DTE":36.258,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.203,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":1.3387134,"Quick Ratio":0.549,"Day High":82.95,"Day Low":80.5,"VS Average Volume":2.3211234275,"Company Summary":"Principal Financial Group, Inc. provides retirement, asset management, and insurance products and services to businesses, individuals, and institutional clients worldwide. The company operates through Retirement and Income Solutions, Principal Asset Management, and Benefits and Protection segments. The Retirement and Income Solutions segment provides retirement, and related financial products and services. It offers products and services for defined contribution plans, including 401(k) and 403(b) plans, defined benefit plans, nonqualified executive benefit plans, employee stock ownership plans, equity compensation, and pension risk transfer services; individual retirement accounts; investment only products; and mutual funds, individual variable annuities, registered index-linked annuities, and bank products, as well as trust and custody services. The Principal Asset Management segment provides equity, fixed income, real estate, and other alternative investments, as well as asset allocation, stable value management, and other structured investment strategies. It also offers pension accumulation products and services, mutual funds, asset management, income annuities, and life insurance accumulation products, as well as voluntary savings plans in Brazil, Chile, Mexico, Asia, China, Hong Kong Special Administrative Region, and Southeast Asia. The Benefits and Protection segment provides specialty benefits, such as group dental and vision insurance, group life insurance, and group and individual disability insurance, as well as administers group dental, disability, and vision benefits; and individual life insurance products comprising universal, variable universal, indexed universal, and term life insurance products. It also offers insurance solutions for small and medium-sized businesses and their owners, as well as employees. Principal Financial Group, Inc. was founded in 1879 and is based in Des Moines, Iowa.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Linde plc","Symbol":"LIN","Current Price":"455.05","Latest MA":"451.72","Price Target":493.24847,"Difference from MA":"0.74%","Difference from Open":"-0.40%","Change from Yesterday":"-1.22%","Change from Last Report":"0.00","Latest Volume":"1,656,179","Market Cap":"216,675,696,640","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":24.827631,"PB Ratio":5.531245,"Previous Close":460.68,"ROE":0.1619,"DTE":54.828,"Industry":"Specialty Chemicals","Sector":"Basic Materials","Beta":0.949,"Trailing PEG":2.6194,"Trailing PE":34.525795,"Trailing PS":6.56096,"Quick Ratio":0.734,"Day High":458.16,"Day Low":452.57,"VS Average Volume":0.720940447,"Company Summary":"Linde plc operates as an industrial gas company in the Americas, Europe, the Middle East, Africa, Asia, and South Pacific. It offers atmospheric gases, including oxygen, nitrogen, argon, and rare gases; and process gases, such as carbon dioxide, helium, hydrogen, electronic gases, specialty gases, and acetylene. The company also designs and constructs turnkey process plants for third-party customers, as well as for the gas businesses in various locations, such as air separation, hydrogen, synthesis, olefin, and natural gas plants. It serves a range of industries, including healthcare, chemicals and energy, manufacturing, metals and mining, food and beverage, and electronics. The company was founded in 1879 and is based in Woking, the United Kingdom.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Yum! Brands, Inc.","Symbol":"YUM","Current Price":"143.56","Latest MA":"132.84","Price Target":147.70042,"Difference from MA":"8.07%","Difference from Open":"1.32%","Change from Yesterday":"-0.31%","Change from Last Report":"0.00","Latest Volume":"2,694,286","Market Cap":"40,063,574,016","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":21.488573,"PB Ratio":"N\/A","Previous Close":144.01,"ROE":"N\/A","DTE":"N\/A","Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":1.095,"Trailing PEG":2.6235,"Trailing PE":27.554703,"Trailing PS":5.5466666,"Quick Ratio":1.105,"Day High":144.68,"Day Low":140.95,"VS Average Volume":1.4724942246,"Company Summary":"Yum! Brands, Inc., together with its subsidiaries, develops, operates, and franchises quick service restaurants worldwide. The company operates through the KFC Division, the Taco Bell Division, the Pizza Hut Division, and the Habit Burger Grill Division segments. It also operates restaurants under the KFC, Pizza Hut, Taco Bell, and The Habit Burger Grill brands, which specialize in chicken, pizza, made-to-order chargrilled burgers, sandwiches, Mexican-style food categories, and other food products. The company was formerly known as TRICON Global Restaurants, Inc. and changed its name to Yum! Brands, Inc. in May 2002. Yum! Brands, Inc. was incorporated in 1997 and is headquartered in Louisville, Kentucky.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"nVent Electric plc","Symbol":"NVT","Current Price":"67.88","Latest MA":"70.54","Price Target":81.8,"Difference from MA":"-3.77%","Difference from Open":"1.78%","Change from Yesterday":"3.15%","Change from Last Report":"0.00","Latest Volume":"3,579,240","Market Cap":"11,187,709,952","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":20.137352,"PB Ratio":3.4071171,"Previous Close":65.81,"ROE":0.18530001,"DTE":72.196,"Industry":"Electrical Equipment & Parts","Sector":"Industrials","Beta":1.25,"Trailing PEG":null,"Trailing PE":47.468533,"Trailing PS":3.1611738,"Quick Ratio":0.917,"Day High":68.0,"Day Low":66.32,"VS Average Volume":2.0388941834,"Company Summary":"nVent Electric plc, together with its subsidiaries, designs, manufactures, markets, installs, and services electrical connection and protection solutions in North America, Europe, the Middle East, Africa, the Asia Pacific, and internationally. The company operates through three segments: Enclosures, Electrical & Fastening Solutions, and Thermal Management. The Enclosures segment provides solutions to protect electronics and data in mission critical applications, including data solutions. This segment also offers digital and automation solutions, system integrations, and global services. The Electrical & Fastening Solutions segment provides solutions that connect and protect power and data infrastructure. This segment also offers power connections, fastening solutions, cable management solutions, grounding and bonding systems, and tools and test instruments. The Thermal Management segment offers heat management solutions that protect people and assets. This segment includes heat tracing for freeze protection and process temperature maintenance and control; pipe freeze protection, surface deicing, hot water temperature maintenance, floor heating, fire-rated wiring, and leak detection; and heat trace systems, connected controls, remote monitoring, and annual service programs. The company markets its products through electrical distributors, contractors, and original equipment manufacturers under the CADDY, ERICO, GARDNER BENDER, HOFFMAN, ILSCO, RAYCHEM, SCHROFF, and TRACER brand names. Its products are used for various applications, such as industrial, commercial and residential, infrastructure, and energy. nVent Electric plc was founded in 1903 and is based in London, the United Kingdom.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Roblox Corporation","Symbol":"RBLX","Current Price":"66.28","Latest MA":"49.54","Price Target":65.91129,"Difference from MA":"33.80%","Difference from Open":"-0.61%","Change from Yesterday":"-1.25%","Change from Last Report":"0.00","Latest Volume":"23,364,646","Market Cap":"44,170,252,288","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":-51.087578,"PB Ratio":229.34256,"Previous Close":67.12,"ROE":-7.00543,"DTE":985.81,"Industry":"Electronic Gaming & Multimedia","Sector":"Communication Services","Beta":1.561,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":13.131311,"Quick Ratio":0.792,"Day High":69.15,"Day Low":64.335,"VS Average Volume":2.8028555611,"Company Summary":"Roblox Corporation develops and operates an online entertainment platform in the United States and internationally. It offers Roblox Studio, a free toolset that allows developers and creators to build, publish, and operate 3D experiences, and other content; Roblox Client, an application that allows users to explore 3D experience; and Roblox Cloud, which provides services and infrastructure that power the platform. Roblox Corporation was incorporated in 2004 and is headquartered in San Mateo, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Lincoln National Corporation","Symbol":"LNC","Current Price":"37.04","Latest MA":"31.83","Price Target":36.72727,"Difference from MA":"16.37%","Difference from Open":"4.51%","Change from Yesterday":"3.55%","Change from Last Report":"0.00","Latest Volume":"2,451,511","Market Cap":"6,309,505,024","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":4.4158325,"PB Ratio":0.786028,"Previous Close":35.77,"ROE":0.05781,"DTE":71.918,"Industry":"Insurance - Life","Sector":"Financial Services","Beta":1.783,"Trailing PEG":null,"Trailing PE":2.01195,"Trailing PS":0.46581802,"Quick Ratio":2.177,"Day High":37.239,"Day Low":35.175,"VS Average Volume":1.9179850881,"Company Summary":"Lincoln National Corporation, through its subsidiaries, operates multiple insurance and retirement businesses in the United States. It operates in four segments: Life Insurance, Annuities, Group Protection, and Retirement Plan Services. The Life Insurance segment provides life insurance products, including term insurance, universal life insurance (UL), indexed universal life insurance, variable universal life insurance (VUL), linked-benefit UL and VUL products, and critical illness and long-term care riders. The Annuities segment offers variable, fixed, and registered index-linked annuities. The Group Protection segment offers group non-medical insurance products consisting of short and long-term disability and statutory disability; paid family medical leave administration and absence management services; term life; dental and vision; and accident, critical illness, and hospital indemnity benefits and services to the employer marketplace through various forms of employee-paid and employer-paid plans. The Retirement Plan Services segment provides employers with retirement plan products and services primarily in the defined contribution retirement plan marketplace; individual and group variable annuities, group fixed annuities, and mutual fund-based programs; and various plan services, including plan recordkeeping, compliance testing, participant education, and trust and custodial services. The company distributes its products through consultants, brokers, planners, agents, financial advisors, third-party administrators, and other intermediaries. Lincoln National Corporation was founded in 1905 and is headquartered in Radnor, Pennsylvania.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"SS&C Technologies Holdings, Inc","Symbol":"SSNC","Current Price":"86.71","Latest MA":"73.88","Price Target":92.79818,"Difference from MA":"17.36%","Difference from Open":"0.18%","Change from Yesterday":"6.00%","Change from Last Report":"0.00","Latest Volume":"3,989,220","Market Cap":"21,476,765,696","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":13.4232025,"PB Ratio":3.1469114,"Previous Close":81.8,"ROE":0.10818,"DTE":107.114,"Industry":"Software - Application","Sector":"Technology","Beta":1.385,"Trailing PEG":0.8368,"Trailing PE":28.903334,"Trailing PS":3.7260823,"Quick Ratio":0.521,"Day High":87.5,"Day Low":85.36,"VS Average Volume":3.1722032038,"Company Summary":"SS&C Technologies Holdings, Inc., together with its subsidiaries, provides software products and software-enabled services to financial services and healthcare industries. The company owns and operates technology stack across securities accounting; front-office functions, such as trading and modeling; middle-office functions comprising portfolio management and reporting; back-office functions, such as accounting, performance measurement, reconciliation, reporting, processing and clearing, and compliance and tax reporting; and healthcare solutions consisting of claims adjudication, benefit management, care management, and business intelligence solutions. Its products and services allow professionals in the financial services and healthcare industries to automate complex business processes and are instrumental in helping its clients to manage information processing requirements. The company's software-enabled services include SS&C GlobeOp, Global Investor and Distribution Solutions, SS&C Retirement Solutions, Black Diamond Wealth Platform, CRM Solutions, Advent Managed Services, Advent Data Solutions, ALPS Advisors, and Virtual Data Rooms, as well as pharmacy, healthcare administration, and health outcomes optimization solutions. Its software products comprise portfolio\/investment accounting and analytics software, portfolio management software, trading software, automation solutions, and banking and lending solutions, as well as research, analytics, risk, and training solutions. The company also provides professional services that includes consulting and implementation services consisting of initial system installation, conversion of historical data, and ongoing training and support, as well as product support services. It operates in the United States; Europe, the Middle East, and Africa; the Asia Pacific and Japan; Canada; and the Americas. The company was founded in 1986 and is headquartered in Windsor, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Zimmer Biomet Holdings, Inc.","Symbol":"ZBH","Current Price":"100.93","Latest MA":"107.81","Price Target":122.08154,"Difference from MA":"-6.38%","Difference from Open":"-1.95%","Change from Yesterday":"-1.71%","Change from Last Report":"0.00","Latest Volume":"2,800,648","Market Cap":"20,092,538,880","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":11.400565,"PB Ratio":1.627982,"Previous Close":102.69,"ROE":0.08713,"DTE":53.611,"Industry":"Medical Devices","Sector":"Healthcare","Beta":1.021,"Trailing PEG":1.3471,"Trailing PE":22.783297,"Trailing PS":2.6453214,"Quick Ratio":0.574,"Day High":103.3,"Day Low":99.93,"VS Average Volume":1.7199849168,"Company Summary":"Zimmer Biomet Holdings, Inc., together with its subsidiaries, operates as a medical technology company worldwide. The company designs, manufactures, and markets orthopedic reconstructive products, such as knee and hip products; S.E.T. products, including sports medicine, biologics, foot and ankle, extremities, and trauma products; craniomaxillofacial and thoracic products comprising face and skull reconstruction products, as well as products that fixate and stabilize the bones of the chest to facilitate healing or reconstruction after open heart surgery, trauma, or for deformities of the chest. It also offers robotic, surgical, and bone cement products. The company's products and solutions are used to treat patients suffering from disorders of, or injuries to, bones, joints, or supporting soft tissues. It serves orthopedic surgeons, neurosurgeons, hospitals, stocking distributors, healthcare dealers, and other specialists, as well as agents, healthcare purchasing organizations, or buying groups. The company was formerly known as Zimmer Holdings, Inc. and changed its name to Zimmer Biomet Holdings, Inc. in June 2015. Zimmer Biomet Holdings, Inc. was founded in 1927 and is headquartered in Warsaw, Indiana.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Rithm Capital Corp.","Symbol":"RITM","Current Price":"11.85","Latest MA":"10.83","Price Target":13.18182,"Difference from MA":"9.41%","Difference from Open":"0.00%","Change from Yesterday":"-0.50%","Change from Last Report":"0.00","Latest Volume":"2,992,851","Market Cap":"6,169,773,568","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":5.70323,"PB Ratio":0.9623975,"Previous Close":11.91,"ROE":0.07756,"DTE":389.996,"Industry":"REIT - Mortgage","Sector":"Real Estate","Beta":1.788,"Trailing PEG":null,"Trailing PE":12.091837,"Trailing PS":2.0521748,"Quick Ratio":0.722,"Day High":11.89,"Day Low":11.74,"VS Average Volume":0.8267930188,"Company Summary":"Rithm Capital Corp. operates as an asset manager focused on real estate, credit, and financial services. It operates through Origination and Servicing, Investment Portfolio, Mortgage Loans Receivable, and Asset Management segments. Its investment portfolio primarily comprises of mortgage servicing rights (MSR), and MSR financing receivables, title, appraisal and property preservation, excess MSRs, and services advance investments; real estate securities, call rights, SFR properties, and residential mortgage loans; consumer and business purpose loans; and asset management related investments. The company qualifies as a real estate investment trust for federal income tax purposes. It generally would not be subject to federal corporate income taxes if it distributes at least 90% of its taxable income to its stockholders. The company was formerly known as New Residential Investment Corp. and changed its name to Rithm Capital Corp. in August 2022. Rithm Capital Corp. was incorporated in 2011 and is based in New York, New York.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"ConocoPhillips","Symbol":"COP","Current Price":"98.36","Latest MA":"106.28","Price Target":131.93517,"Difference from MA":"-7.45%","Difference from Open":"-1.70%","Change from Yesterday":"-1.58%","Change from Last Report":"0.00","Latest Volume":"5,022,281","Market Cap":"127,234,572,288","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.811821,"PB Ratio":2.269497,"Previous Close":99.94,"ROE":0.20376,"DTE":36.695,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":1.22,"Trailing PEG":8.2377,"Trailing PE":12.5941105,"Trailing PS":2.2351656,"Quick Ratio":1.078,"Day High":100.45,"Day Low":98.27,"VS Average Volume":0.7342161855,"Company Summary":"ConocoPhillips explores for, produces, transports, and markets crude oil, bitumen, natural gas, liquefied natural gas (LNG), and natural gas liquids in the United States, Canada, China, Libya, Malaysia, Norway, the United Kingdom, and internationally. The company's portfolio includes unconventional plays in North America; conventional assets in North America, Europe, Asia, and Australia; global LNG developments; oil sands assets in Canada; and an inventory of global exploration prospects. ConocoPhillips was founded in 1917 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Yum China Holdings, Inc.","Symbol":"YUMC","Current Price":"48.44","Latest MA":"41.31","Price Target":58.2656,"Difference from MA":"17.25%","Difference from Open":"-1.72%","Change from Yesterday":"-2.44%","Change from Last Report":"0.00","Latest Volume":"4,227,360","Market Cap":"18,237,659,136","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.905851,"PB Ratio":3.0677643,"Previous Close":49.65,"ROE":0.13741,"DTE":33.383,"Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":0.353,"Trailing PEG":1.4226,"Trailing PE":20.7897,"Trailing PS":1.628217,"Quick Ratio":1.012,"Day High":49.55,"Day Low":47.84,"VS Average Volume":1.9501429614,"Company Summary":"Yum China Holdings, Inc. owns, operates, and franchises restaurants in the People's Republic of China. The company operates through KFC, Pizza Hut, and All Other segments. It operates restaurants under the KFC, Pizza Hut, Taco Bell, Lavazza, Little Sheep, and Huang Ji Huang concepts. The company also operates V-Gold Mall, a mobile e-commerce platform to sell products; and offers online food deliver services. Yum China Holdings, Inc. was founded in 1987 and is headquartered in Shanghai, the People's Republic of China.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Tapestry, Inc.","Symbol":"TPR","Current Price":"80.38","Latest MA":"51.75","Price Target":84.492,"Difference from MA":"55.32%","Difference from Open":"-3.77%","Change from Yesterday":"-2.21%","Change from Last Report":"0.00","Latest Volume":"7,807,327","Market Cap":"16,639,865,856","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":15.168785,"PB Ratio":6.387476,"Previous Close":82.2,"ROE":0.29924,"DTE":295.298,"Industry":"Luxury Goods","Sector":"Consumer Cyclical","Beta":1.556,"Trailing PEG":2.5656,"Trailing PE":23.366278,"Trailing PS":2.4964168,"Quick Ratio":4.233,"Day High":83.7,"Day Low":78.99,"VS Average Volume":1.5592338246,"Company Summary":"Tapestry, Inc. provides luxury accessories and branded lifestyle products in North America, Greater China, rest of Asia, and internationally. The company operates in three segments: Coach, Kate Spade, and Stuart Weitzman. It offers women's handbags; and women's accessories, such as small leather goods which includes mini and micro handbags, money pieces, wristlets, pouches, and cosmetic cases, as well as novelty accessories including address books, time management and travel accessories, sketchbooks, and portfolios; and belts, key rings, and charms. The company also provides men products, which includes bag collections, such as business cases, computer bags, messenger-style bags, backpacks, and totes; small leather goods including wallets, card cases, travel organizers, and belts; and footwear, watches, fragrances, sunglasses, novelty accessories, and ready-to-wear items. In addition, it offers other products including women's footwear and fragrances; eyewear and sunglasses; and jewelry, such as bracelets, necklaces, rings, and earrings, watches, and other women's seasonal lifestyle apparel collections, including outerwear, ready-to-wear and cold weather accessories, such as gloves, scarves, and hats. Further, the company provides kids items, housewares, and home accessories, such as fashion bedding and tableware, stationery, and gifts. It offers its products through retail and outlet stores, brand e-commerce sites, and concession shop-in-shops, wholesale, and third-party distributors under the Coach, Kate Spade, and Stuart Weitzman brand names. The company was formerly known as Coach, Inc. and changed its name to Tapestry, Inc. in October 2017. Tapestry, Inc. was founded in 1941 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Kenvue Inc.","Symbol":"KVUE","Current Price":"20.18","Latest MA":"21.50","Price Target":23.47,"Difference from MA":"-6.15%","Difference from Open":"1.41%","Change from Yesterday":"1.92%","Change from Last Report":"0.00","Latest Volume":"17,734,139","Market Cap":"38,690,308,096","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.23792,"PB Ratio":3.6327634,"Previous Close":19.8,"ROE":0.098809995,"DTE":82.929,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":"N\/A","Trailing PEG":1.8386,"Trailing PE":37.37037,"Trailing PS":2.502769,"Quick Ratio":0.58,"Day High":20.23,"Day Low":19.855,"VS Average Volume":1.4103619195,"Company Summary":"Kenvue Inc. operates as a consumer health company worldwide. The company operates through three segments: Self Care, Skin Health and Beauty, and Essential Health. The Self Care segment offers cough, cold and allergy, pain care, digestive health, smoking cessation, eye care, and other products under the Tylenol, Motrin, Benadryl, Nicorette, Zarbee's, ORSLTM, Rhinocort, Calpol, and Zyrtec brands. The Skin Health and Beauty segment provides face and body care, hair, sun, and other care products under the Neutrogena, Aveeno, Dr.Ci:Labo, Le Petit Marseillais, Lubriderm, Rogaine, and OGX brand names. The Essential Health segment offers oral and baby, women's health, wound, and other care products under the Listerine, Johnson's, Band-Aid, and Stayfree, o.b., tampons, Carefree, and Desitin Diaper Rash brands. The company was incorporated in 2022 and is headquartered in Skillman, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Affirm Holdings, Inc.","Symbol":"AFRM","Current Price":"75.22","Latest MA":"47.24","Price Target":70.79474,"Difference from MA":"59.23%","Difference from Open":"7.63%","Change from Yesterday":"21.81%","Change from Last Report":"0.00","Latest Volume":"28,638,239","Market Cap":"23,358,066,688","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":-219.08951,"PB Ratio":8.564272,"Previous Close":61.75,"ROE":-0.16519,"DTE":251.092,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":3.477,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":9.250972,"Quick Ratio":12.914,"Day High":76.88,"Day Low":68.3,"VS Average Volume":3.5808783094,"Company Summary":"Affirm Holdings, Inc. operates payment network in the United States, Canada, and internationally. The company's platform includes point-of-sale payment solution for consumers, merchant commerce solutions, and a consumer-focused app. Its commerce platform, agreements with originating banks, and capital markets partners enables consumers to pay for a purchase over time. The company has active merchants covering small businesses, large enterprises, direct-to-consumer brands, brick-and-mortar stores, and companies with an omni-channel presence. Its merchants represent a range of industries, including sporting goods and outdoors, home and lifestyle, travel and ticketing, electronics, fashion and beauty, equipment and auto, and general merchandise. Affirm Holdings, Inc. was founded in 2012 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Bristol-Myers Squibb Company","Symbol":"BMY","Current Price":"56.85","Latest MA":"51.96","Price Target":61.57714,"Difference from MA":"9.41%","Difference from Open":"-1.06%","Change from Yesterday":"-0.99%","Change from Last Report":"0.00","Latest Volume":"14,214,628","Market Cap":"115,302,031,360","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":9.189571,"PB Ratio":6.725423,"Previous Close":57.42,"ROE":-0.3133,"DTE":299.052,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.441,"Trailing PEG":2.018,"Trailing PE":"N\/A","Trailing PS":2.4307373,"Quick Ratio":1.016,"Day High":57.71,"Day Low":56.19,"VS Average Volume":1.2704108258,"Company Summary":"Bristol-Myers Squibb Company discovers, develops, licenses, manufactures, markets, distributes, and sells biopharmaceutical products worldwide. It offers products for hematology, oncology, cardiovascular, immunology, fibrotic, and neuroscience diseases. The company's products include Eliquis for reduction in risk of stroke\/systemic embolism in non-valvular atrial fibrillation, and for the treatment of DVT\/PE; Opdivo for various anti-cancer indications, including bladder, blood, CRC, head and neck, RCC, HCC, lung, melanoma, MPM, stomach and esophageal cancer; Pomalyst\/Imnovid for multiple myeloma; Orencia for active rheumatoid arthritis and psoriatic arthritis; and Sprycel for the treatment of Philadelphia chromosome-positive chronic myeloid leukemia. It also provides Yervoy for the treatment of patients with unresectable or metastatic melanoma; Empliciti for the treatment of multiple myeloma; Abecma for the treatment of relapsed or refractory multiple myeloma; Reblozyl for the treatment of anemia; Opdualag for the treatment of unresectable or metastatic melanoma; and Zeposia to treat relapsing forms of multiple sclerosis. In addition, the company offers Breyanzi for the treatment of relapsed or refractory large B-cell lymphoma; Onureg for the treatment of AML; Inrebic for the treatment of myelofibrosis; Camzyos for the treatment of symptomatic obstructive HCM to enhance functional capacity and symptom; Sotyktu for the treatment of moderate-to-severe plaque psoriasis; Augtyro for the treatment of locally advanced or metastatic ROS1-positive NSCLC; Revlimid, an oral immunomodulatory drug for the treatment of multiple myeloma; and Abraxane to treat breast cancer, NSCLC and pancreatic cancer. It sells products to wholesalers, distributors, pharmacies, retailers, hospitals, clinics, and government agencies. The company was formerly known as Bristol-Myers Company. Bristol-Myers Squibb Company was founded in 1887 and is headquartered in Princeton, New Jersey.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Fortinet, Inc.","Symbol":"FTNT","Current Price":"107.66","Latest MA":"82.24","Price Target":109.48806,"Difference from MA":"30.91%","Difference from Open":"-1.67%","Change from Yesterday":"2.81%","Change from Last Report":"0.00","Latest Volume":"10,746,552","Market Cap":"82,516,328,448","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":38.127686,"PB Ratio":90.77572,"Previous Close":104.72,"ROE":3.1152499,"DTE":118.588,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.995,"Trailing PEG":1.8078,"Trailing PE":47.63717,"Trailing PS":14.449172,"Quick Ratio":1.222,"Day High":110.53,"Day Low":102.37,"VS Average Volume":2.2952207995,"Company Summary":"Fortinet, Inc. provides cybersecurity and convergence of networking and security solutions worldwide. It offers secure networking solutions focus on the convergence of networking and security; network firewall solutions that consist of FortiGate data centers, hyperscale, and distributed firewalls, as well as encrypted applications; wireless LAN solutions; and secure connectivity solutions, including FortiSwitch secure ethernet switches, FortiAP wireless local area network access points, FortiExtender 5G connectivity gateways, and other products. The company also provides the Fortinet Unified SASE solutions that include firewall, SD-WAN, Secure web gateway, cloud access services broker, data loss prevention, zero trust network access, and cloud security, including web application firewalls, virtualized firewalls, and cloud-native firewalls. In addition, it offers security operations solutions comprising FortiAI generative AI assistant, FortiSIEM security information and event management, FortiSOAR security orchestration, automation and response, FortiEDR endpoint detection and response, FortiXDR extended detection and response, FortiMDR managed detection and response service, FortiNDR network detection and response, FortiRecon digital risk protection, FortiDeceptor deception technology, FortiGuard SoCaaS, FortiSandbox sandboxing, FortiGuard incident response, and other products. Further, the company offers FortiGuard security services consisting of FortiGuard application security, content security, device security, NOC\/SOC security, and web security services; FortiCare technical support services; and training services to customers and channel partners, as well as operates a FortiGuard Lab, a cybersecurity threat intelligence and research organization. It serves enterprise, communication and security service providers, government organizations, and small and medium-sized businesses. The company was incorporated in 2000 and is headquartered in Sunnyvale, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Genpact Limited","Symbol":"G","Current Price":"54.95","Latest MA":"40.47","Price Target":56.33333,"Difference from MA":"35.77%","Difference from Open":"0.04%","Change from Yesterday":"11.23%","Change from Last Report":"0.00","Latest Volume":"4,185,541","Market Cap":"9,691,036,672","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":14.132722,"PB Ratio":4.0466895,"Previous Close":49.4,"ROE":0.30111,"DTE":77.585,"Industry":"Information Technology Services","Sector":"Technology","Beta":1.141,"Trailing PEG":null,"Trailing PE":15.096153,"Trailing PS":2.0775483,"Quick Ratio":1.732,"Day High":56.755,"Day Low":54.33,"VS Average Volume":2.8144940147,"Company Summary":"Genpact Limited provides business process outsourcing and information technology services in India, rest of Asia, North and Latin America, and Europe. It operates through three segments: Financial services; Consumer and Healthcare; and High Tech and Manufacturing. The Financial Services segment offers retail customer onboarding, customer service, collections, card servicing operations, loan and payment operations, commercial loan, equipment and auto loan, mortgage origination, compliance services, reporting and monitoring, and wealth management operations support; financial crime and risk management services; and underwriting support, new business processing, policy administration, claims management, catastrophe modeling and actuarial services, as well as property and casualty claims. The Consumer and Healthcare segment provides demand generation, sensing and planning, supply chain planning and management, pricing and trade promotion management, deduction recovery management, order management, and digital commerce; and end-to-end claim lifecycle management, from claims processing and adjudication to claims recovery and payment integrity, revenue cycle management, health equity analytics, and care services. The High Tech and Manufacturing segment offers industry-specific solutions for trust and safety, advertising sales support, customer and user experience, and customer care support; and direct and indirect procurement, logistics, field, aftermarket support, and engineering services. It also provides digital operation services; data-tech-Al services; finance and accounting services, such as accounts payable, invoice-to-cash, record to report, financial planning and analysis, and enterprise risk and compliance; CFO advisory services; supply chain, and sourcing and procurement services; sales and commercial, and marketing and experience services; and environmental, social and governance services. The company was founded in 1997 and is based in Hamilton, Bermuda.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"The Hershey Company","Symbol":"HSY","Current Price":"154.93","Latest MA":"180.33","Price Target":161.44957,"Difference from MA":"-14.08%","Difference from Open":"0.56%","Change from Yesterday":"1.70%","Change from Last Report":"0.00","Latest Volume":"2,092,017","Market Cap":"31,350,859,776","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":22.121225,"PB Ratio":7.4553676,"Previous Close":152.34,"ROE":0.43405998,"DTE":134.227,"Industry":"Confectioners","Sector":"Consumer Defensive","Beta":0.374,"Trailing PEG":4.7237,"Trailing PE":14.187728,"Trailing PS":2.8573945,"Quick Ratio":0.419,"Day High":156.56,"Day Low":153.5539,"VS Average Volume":0.8792495842,"Company Summary":"The Hershey Company, together with its subsidiaries, engages in the manufacture and sale of confectionery products and pantry items in the United States and internationally. The company operates through three segments: North America Confectionery, North America Salty Snacks, and International. It offers chocolate and non-chocolate confectionery products; gum and mint refreshment products, including mints, chewing gums, and bubble gums; protein bars; pantry items, such as baking ingredients, toppings, beverages, and sundae syrups; and snack items comprising spreads, bars, snack bites, mixes, popcorn, and pretzels. The company provides its products primarily under the Hershey's, Reese's, Kisses, Jolly Rancher, Almond Joy, Brookside, barkTHINS, Cadbury, Good & Plenty, Heath, Kit Kat, Payday, Rolo, Twizzlers, Whoppers, York, Ice Breakers, Breath Savers, Bubble Yum, Lily's, SkinnyPop, Pirates Booty, Dot's Homestyle Pretzels, and ONE Bar brands, as well as under the Pelon Pelo Rico, IO-IO, and Sofit brands. It markets and sells its products to wholesale distributors, chain grocery stores, mass merchandisers, chain drug stores, vending companies, wholesale clubs, convenience stores, dollar stores, concessionaires, and department stores. The company exports its products in approximately 80 countries worldwide. The Hershey Company was founded in 1894 and is headquartered in Hershey, Pennsylvania.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Darling Ingredients Inc.","Symbol":"DAR","Current Price":"39.75","Latest MA":"37.49","Price Target":52.53857,"Difference from MA":"6.04%","Difference from Open":"3.27%","Change from Yesterday":"3.25%","Change from Last Report":"0.00","Latest Volume":"3,122,013","Market Cap":"6,322,158,080","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":11.82529,"PB Ratio":1.3890345,"Previous Close":38.5,"ROE":0.059180003,"DTE":96.332,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":1.232,"Trailing PEG":null,"Trailing PE":22.97688,"Trailing PS":1.069456,"Quick Ratio":0.688,"Day High":40.58,"Day Low":38.405,"VS Average Volume":1.3926485237,"Company Summary":"Darling Ingredients Inc. develops, produces, and sells natural ingredients from edible and inedible bio-nutrients in North America, Europe, China, South America, and internationally. The company operates through three segments: Feed Ingredients, Food Ingredients, and Fuel Ingredients. It offers ingredients and customized specialty solutions for customers in the pharmaceutical, food, pet food, feed, industrial, fuel, bioenergy, and fertilizer industries. The company also collects and transforms various animal by-product streams into useable and specialty ingredients, such as collagen, edible fats, feed-grade fats, animal proteins and meals, plasma, pet food ingredients, organic fertilizers, yellow grease, fuel feedstock, green energy, natural casings, and hides. In addition, it recovers and converts used cooking oil and animal fats, and residual bakery products into valuable feed and fuel ingredients. Further, the company provides environmental services, including grease trap collection and disposal services to food service establishments. It primarily operates under the Rendac, Sonac, FASA, Ecoson, Rousselot, Gelnex, and CTH brand names. The company was formerly known as Darling International Inc. and changed its name to Darling Ingredients Inc. in May 2014. Darling Ingredients Inc. was founded in 1882 and is headquartered in Irving, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Blue Owl Capital Inc.","Symbol":"OWL","Current Price":"23.56","Latest MA":"20.96","Price Target":26.28333,"Difference from MA":"12.38%","Difference from Open":"-4.73%","Change from Yesterday":"-4.88%","Change from Last Report":"0.00","Latest Volume":"8,357,843","Market Cap":"35,187,331,072","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":21.405144,"PB Ratio":6.6817923,"Previous Close":24.77,"ROE":0.07691,"DTE":49.396,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.142,"Trailing PEG":null,"Trailing PE":130.88889,"Trailing PS":16.304766,"Quick Ratio":1.923,"Day High":24.92,"Day Low":23.3825,"VS Average Volume":1.3443297109,"Company Summary":"Blue Owl Capital Inc. operates as an asset manager in the United States. The company offers permanent capital base solutions that enables it to offer holistic framework of capital solutions to middle market companies, large alternative asset managers, and corporate real estate owners and tenants. It also provides direct lending products that offer private credit products comprising diversified, technology, first lien, and opportunistic lending to middle-market companies; liquid credit; GP strategic capital products, which offers capital solutions, including GP minority stakes, GP debt financing, and professional sports minority stakes; and real estate products that focuses on acquiring triple net lease real estate by investment grade or creditworthy tenants. It offers its solutions through permanent capital vehicles, as well as long-dated private funds. Blue Owl Capital Inc. is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Pinterest, Inc.","Symbol":"PINS","Current Price":"40.00","Latest MA":"32.43","Price Target":44.93421,"Difference from MA":"23.35%","Difference from Open":"-2.18%","Change from Yesterday":"19.08%","Change from Last Report":"0.00","Latest Volume":"50,813,980","Market Cap":"27,033,038,848","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":17.898375,"PB Ratio":9.330534,"Previous Close":33.59,"ROE":0.07572,"DTE":5.335,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.017,"Trailing PEG":0.4574,"Trailing PE":14.981273,"Trailing PS":7.783104,"Quick Ratio":7.63,"Day High":40.8999,"Day Low":38.85,"VS Average Volume":4.502642714,"Company Summary":"Pinterest, Inc. operates as a visual search and discovery platform in the United States and internationally. Its platform allows people to find ideas, such as recipes, home and style inspiration, and others; and to search, save, and shop the ideas. The company was formerly known as Cold Brew Labs Inc. and changed its name to Pinterest, Inc. in April 2012. Pinterest, Inc. was incorporated in 2008 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"BorgWarner Inc.","Symbol":"BWA","Current Price":"30.02","Latest MA":"33.16","Price Target":39.18235,"Difference from MA":"-9.47%","Difference from Open":"-1.51%","Change from Yesterday":"-0.73%","Change from Last Report":"0.00","Latest Volume":"4,107,050","Market Cap":"6,565,373,952","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":6.136976,"PB Ratio":1.0665056,"Previous Close":30.24,"ROE":0.15923999,"DTE":74.606,"Industry":"Auto Parts","Sector":"Consumer Cyclical","Beta":1.186,"Trailing PEG":1.2103,"Trailing PE":18.41718,"Trailing PS":0.46336186,"Quick Ratio":1.407,"Day High":30.48,"Day Low":29.33,"VS Average Volume":1.766999038,"Company Summary":"BorgWarner Inc., together with its subsidiaries, provides solutions for combustion, hybrid, and electric vehicles worldwide. It offers turbochargers, eBoosters, eTurbos, timing systems, emissions systems, thermal systems, gasoline ignition technology, smart remote actuators, powertrain sensors, cabin heaters, battery modules and systems, battery heaters, and battery charging. The company provides power electronics, control modules, software, friction, and mechanical products for automatic transmissions and torque-management products. It sells its products to original equipment manufacturers of light vehicles, which comprise passenger cars, sport-utility vehicles, vans, and light trucks; commercial vehicles, including medium-duty and heavy-duty trucks, and buses; and off-highway vehicles, such as agricultural and construction machinery, and marine applications, as well as to tier one vehicle systems suppliers and the aftermarket for light, commercial, and off-highway vehicles. The company was formerly known as Borg-Warner Automotive, Inc. BorgWarner Inc. was incorporated in 1987 and is headquartered in Auburn Hills, Michigan.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Microchip Technology Incorporat","Symbol":"MCHP","Current Price":"51.89","Latest MA":"71.58","Price Target":65.696,"Difference from MA":"-27.51%","Difference from Open":"-0.44%","Change from Yesterday":"-2.30%","Change from Last Report":"0.00","Latest Volume":"17,476,359","Market Cap":"27,865,448,448","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":34.850998,"PB Ratio":4.1826534,"Previous Close":53.11,"ROE":0.118030004,"DTE":102.895,"Industry":"Semiconductors","Sector":"Technology","Beta":1.526,"Trailing PEG":8.8734,"Trailing PE":91.03509,"Trailing PS":5.069579,"Quick Ratio":0.405,"Day High":53.25,"Day Low":50.21,"VS Average Volume":2.009030912,"Company Summary":"Microchip Technology Incorporated engages in the development, manufacture, and sale of smart, connected, and secure embedded control solutions in the Americas, Europe, and Asia. The company offers general purpose 8-bit, 16-bit, and 32-bit mixed-signal microcontrollers; 32-bit embedded mixed-signal microprocessors; and specialized microcontrollers for automotive, industrial, computing, communications, lighting, power supplies, motor control, human machine interface, security, wired connectivity, and wireless connectivity applications. It also provides analog, interface, mixed signal, and timing products comprising power management, linear, mixed-signal, high-voltage, thermal management, discrete diodes, and metal oxide semiconductor field effect transistors (MOSFETS), radio frequency (RF), drivers, safety, security, timing, USB, Ethernet, wireless, and other interface products; field-programmable gate array (FPGA) products; and application development tools that enable system designers to program microcontroller, FPGA, and microprocessor products for specific applications. In addition, the company offers serial electrically erasable programmable read-only memory, serial flash memories, parallel flash memories, serial static random access memories, and serial electrically erasable random access memories for the production of very small footprint devices; and licenses its SuperFlash embedded flash and non-volatile memory technologies to foundries, integrated device manufacturers, and design partners for use in the manufacture of microcontroller products, gate array, RF, analog, and neuromorphic compute products that require embedded non-volatile memory, as well as provides engineering services. Further, it offers wafer foundry and assembly, and test subcontracting manufacturing services; and timing systems products, application specific integrated circuits, and aerospace products. The company was incorporated in 1989 and is headquartered in Chandler, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Air Products and Chemicals, Inc","Symbol":"APD","Current Price":"310.44","Latest MA":"295.82","Price Target":355.4582,"Difference from MA":"4.94%","Difference from Open":"-2.96%","Change from Yesterday":"-5.39%","Change from Last Report":"0.00","Latest Volume":"2,902,773","Market Cap":"69,065,449,472","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":22.12222,"PB Ratio":4.0562367,"Previous Close":328.13,"ROE":0.2258,"DTE":79.822,"Industry":"Specialty Chemicals","Sector":"Basic Materials","Beta":0.826,"Trailing PEG":12.1347,"Trailing PE":17.954885,"Trailing PS":5.7076054,"Quick Ratio":1.296,"Day High":320.06,"Day Low":307.59,"VS Average Volume":1.9463788688,"Company Summary":"Air Products and Chemicals, Inc. provides atmospheric gases, process and specialty gases, equipment, and related services in the Americas, Asia, Europe, the Middle East, India, and internationally. The company produces atmospheric gases, including oxygen, nitrogen, and argon; process gases, such as hydrogen, helium, carbon dioxide, carbon monoxide, and syngas; and specialty gases for customers in various industries, including refining, chemical, manufacturing, electronics, energy production, medical, food, and metals. It also designs and manufactures equipment for air separation, hydrocarbon recovery and purification, natural gas liquefaction, and liquid helium and liquid hydrogen transport and storage. The company was founded in 1940 and is headquartered in Allentown, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Expedia Group, Inc.","Symbol":"EXPE","Current Price":"202.37","Latest MA":"157.37","Price Target":203.33061,"Difference from MA":"28.59%","Difference from Open":"4.05%","Change from Yesterday":"17.27%","Change from Last Report":"0.00","Latest Volume":"9,179,250","Market Cap":"25,973,379,072","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":11.992921,"PB Ratio":19.72225,"Previous Close":172.57,"ROE":0.38564998,"DTE":255.417,"Industry":"Travel Services","Sector":"Consumer Cyclical","Beta":1.785,"Trailing PEG":0.4646,"Trailing PE":22.585938,"Trailing PS":1.9391801,"Quick Ratio":0.592,"Day High":205.1152,"Day Low":194.0621,"VS Average Volume":6.0228690883,"Company Summary":"Expedia Group, Inc. operates as an online travel company in the United States and internationally. The company operates through B2C, B2B, and trivago segments. Its B2C segment includes Brand Expedia, a full-service online travel brand offers various travel products and services; Hotels.com for lodging accommodations; Vrbo, an online marketplace for the alternative accommodations; Orbitz, Travelocity, Wotif Group, ebookers, CheapTickets, Hotwire.com and CarRentals.com. The company's B2B segment provides various travel and non-travel companies including airlines, offline travel agents, online retailers, corporate travel management, and financial institutions who leverage its travel technology and tap into its diverse supply to augment their offerings and market Expedia Group rates and availabilities to its travelers. Its trivago segment, a hotel metasearch website, which send referrals to online travel companies and travel service providers from hotel metasearch websites. In addition, the company provides brand advertising through online and offline channels, loyalty programs, mobile apps, and search engine marketing, as well as metasearch, social media, direct and personalized traveler communications on its websites, and through direct e-mail communication with its travelers. The company was formerly known as Expedia, Inc. and changed its name to Expedia Group, Inc. in March 2018. Expedia Group, Inc. was founded in 1996 and is headquartered in Seattle, Washington.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Skechers U.S.A., Inc.","Symbol":"SKX","Current Price":"66.03","Latest MA":"66.40","Price Target":80.64867,"Difference from MA":"-0.55%","Difference from Open":"-4.30%","Change from Yesterday":"-12.68%","Change from Last Report":"0.00","Latest Volume":"10,536,033","Market Cap":"9,968,680,960","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":12.520574,"PB Ratio":2.2869117,"Previous Close":75.62,"ROE":0.15761,"DTE":42.625,"Industry":"Footwear & Accessories","Sector":"Consumer Cyclical","Beta":1.233,"Trailing PEG":null,"Trailing PE":15.872597,"Trailing PS":1.143476,"Quick Ratio":1.149,"Day High":73.63,"Day Low":64.705,"VS Average Volume":5.6788500688,"Company Summary":"Skechers U.S.A., Inc. designs, develops, markets, and distributes footwear for men, women, and children worldwide. The company operates through Wholesale and Direct-to-Consumer segments. It offers footwear under Skechers Hands Free Slip-ins, Skechers Arch Fit, and Skechers Air-Cooled Memory Foam brands. In addition, the company provides men's and women's slip-resistant and safety-toe casuals, and boots for protective footwear in their work environments. It sells its products through department stores, family shoe stores, specialty running and sporting goods retailers, and big box club stores; franchisee and licensee third-party store operators; company-owned retail stores; digital commerce sites and mobile applications; and concept, factory outlet, and big box stores. The company licenses its Skechers brand. Skechers U.S.A., Inc. was incorporated in 1992 and is headquartered in Manhattan Beach, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Amazon.com, Inc.","Symbol":"AMZN","Current Price":"229.15","Latest MA":"199.47","Price Target":259.02344,"Difference from MA":"14.88%","Difference from Open":"-1.54%","Change from Yesterday":"-4.05%","Change from Last Report":"0.00","Latest Volume":"77,324,451","Market Cap":"2,409,512,304,640","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":30.412947,"PB Ratio":9.29426,"Previous Close":238.83,"ROE":0.22558,"DTE":61.175,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":1.146,"Trailing PEG":1.9612,"Trailing PE":41.362816,"Trailing PS":3.885508,"Quick Ratio":0.827,"Day High":234.8099,"Day Low":228.07,"VS Average Volume":2.1171800752,"Company Summary":"Amazon.com, Inc. engages in the retail sale of consumer products, advertising, and subscriptions service through online and physical stores in North America and internationally. The company operates through three segments: North America, International, and Amazon Web Services (AWS). It also manufactures and sells electronic devices, including Kindle, Fire tablets, Fire TVs, Echo, Ring, Blink, and eero; and develops and produces media content. In addition, the company offers programs that enable sellers to sell their products in its stores; and programs that allow authors, independent publishers, musicians, filmmakers, Twitch streamers, skill and app developers, and others to publish and sell content. Further, it provides compute, storage, database, analytics, machine learning, and other services, as well as advertising services through programs, such as sponsored ads, display, and video advertising. Additionally, the company offers Amazon Prime, a membership program. The company's products offered through its stores include merchandise and content purchased for resale and products offered by third-party sellers. It serves consumers, sellers, developers, enterprises, content creators, advertisers, and employees. Amazon.com, Inc. was incorporated in 1994 and is headquartered in Seattle, Washington.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Intercontinental Exchange Inc.","Symbol":"ICE","Current Price":"166.83","Latest MA":"155.76","Price Target":186.3125,"Difference from MA":"7.11%","Difference from Open":"0.22%","Change from Yesterday":"-0.51%","Change from Last Report":"0.00","Latest Volume":"3,072,840","Market Cap":"95,854,682,112","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":22.307472,"PB Ratio":3.5163562,"Previous Close":167.68,"ROE":0.09408,"DTE":78.899,"Industry":"Financial Data & Stock Exchanges","Sector":"Financial Services","Beta":1.092,"Trailing PEG":2.7036,"Trailing PE":34.901672,"Trailing PS":10.467913,"Quick Ratio":0.027,"Day High":167.87,"Day Low":164.14,"VS Average Volume":1.0147454517,"Company Summary":"Intercontinental Exchange, Inc., together with its subsidiaries, engages in the provision of market infrastructure, data services, and technology solutions for financial institutions, corporations, and government entities in the United States, the United Kingdom, the European Union, Singapore, India, Abu Dhabi, Israel, and Canada. It operates through three segments: Exchanges, Fixed Income and Data Services, and Mortgage Technology. The company operates regulated marketplaces for listing, trading, and clearing an array of derivatives contracts and financial securities, such as commodities, interest rates, foreign exchange, and equities, as well as corporate and exchange-traded funds; and trading venues, including regulated exchanges and clearing houses. It also offers energy, agricultural and metals, and financial futures and options; and cash equities and equity options, and over-the-counter and other markets, as well as listings and data and connectivity services. In addition, the company provides fixed income data and analytic, fixed income execution, CDS clearing, and other multi-asset class data and network services. Further, it offers proprietary and comprehensive mortgage origination platform, which serves residential mortgage loans; closing solutions that provides customers connectivity to the mortgage supply chain and facilitates the secure exchange of information; data and analytics services; and Data as a Service for lenders to access data and origination information. Intercontinental Exchange, Inc. was founded in 2000 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Skyworks Solutions, Inc.","Symbol":"SWKS","Current Price":"65.69","Latest MA":"95.93","Price Target":72.82667,"Difference from MA":"-31.52%","Difference from Open":"-0.36%","Change from Yesterday":"0.14%","Change from Last Report":"0.00","Latest Volume":"6,877,337","Market Cap":"10,559,076,352","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":14.884689,"PB Ratio":1.6565795,"Previous Close":65.6,"ROE":0.12777,"DTE":15.691,"Industry":"Semiconductors","Sector":"Technology","Beta":1.205,"Trailing PEG":0.8477,"Trailing PE":20.212309,"Trailing PS":2.4152696,"Quick Ratio":3.333,"Day High":67.8026,"Day Low":65.0643,"VS Average Volume":2.3990782995,"Company Summary":"Skyworks Solutions, Inc., together with its subsidiaries, designs, develops, manufactures, and markets proprietary semiconductor products in the United States, China, South Korea, Taiwan, Europe, the Middle East, Africa, and the rest of Asia-Pacific. Its product portfolio includes amplifiers, antenna tuners, attenuators, automotive tuners and digital radios, DC\/DC converters, demodulators, detectors, diodes, wireless analog system on chip products, directional couplers, diversity receive modules, filters, front-end modules, hybrids, light emitting diode drivers, low noise amplifiers, mixers, modulators, optocouplers\/optoisolators, phase locked loops, phase shifters, power dividers\/combiners, power over ethernet, power isolators, receivers, switches, synthesizers, timing devices, voltage controlled oscillators\/synthesizers, and voltage regulators. The company products are the used in aerospace, automotive, broadband, cellular infrastructure, connected home, defense, entertainment and gaming, industrial, medical, military, smartphone, tablet, and wearable markets. It sells its products through direct sales force, electronic component distributors, and independent sales representatives. Skyworks Solutions, Inc. was founded in 1962 and is based in Irvine, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"New York Times Company (The)","Symbol":"NYT","Current Price":"48.84","Latest MA":"53.78","Price Target":56.12333,"Difference from MA":"-9.19%","Difference from Open":"-1.03%","Change from Yesterday":"-0.73%","Change from Last Report":"0.00","Latest Volume":"2,054,072","Market Cap":"8,007,513,600","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":21.16292,"PB Ratio":4.327102,"Previous Close":49.2,"ROE":0.15986,"DTE":"N\/A","Industry":"Publishing","Sector":"Communication Services","Beta":1.019,"Trailing PEG":null,"Trailing PE":27.593222,"Trailing PS":3.1913826,"Quick Ratio":1.157,"Day High":49.37,"Day Low":48.245,"VS Average Volume":1.3506913667,"Company Summary":"The New York Times Company, together with its subsidiaries, creates, collects, and distributes news and information worldwide. The company operates through two segments, The New York Times Group and The Athletic. It offers The New York Times (The Times) through company's mobile application, website, printed newspaper, and associated content, such as podcast. The company also offers The Athletic, a sports media product; Cooking, a recipe product; Games, a puzzle games product; and Audio, an audio product. In addition, it offers a portfolio of advertising products and services to advertisers, such as luxury goods, technology, and financial companies, to promote products, services or brands on digital platforms in the form of display ads, audio and video, in print in the form of column-inch ads, and at live events; and Wirecutter, a product review and recommendation product. Further, the company licenses content to digital aggregators in the business, professional, academic and library markets, and third-party digital platforms; articles, graphics, and photographs, including newspapers, magazines, and websites; and for use in television, films, and books, as well as provide rights to reprint articles, and create and sell new digests. Additionally, it engages in commercial printing and distribution for third parties; and operates the NYTimes.com website. The company was founded in 1851 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Cognizant Technology Solutions ","Symbol":"CTSH","Current Price":"86.20","Latest MA":"76.84","Price Target":86.69957,"Difference from MA":"12.19%","Difference from Open":"-1.16%","Change from Yesterday":"-1.02%","Change from Last Report":"0.00","Latest Volume":"3,838,262","Market Cap":"42,668,998,656","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":16.032288,"PB Ratio":2.9584377,"Previous Close":87.09,"ROE":0.16478,"DTE":12.891,"Industry":"Information Technology Services","Sector":"Technology","Beta":1.052,"Trailing PEG":1.4529,"Trailing PE":19.113081,"Trailing PS":2.1980731,"Quick Ratio":1.839,"Day High":87.345,"Day Low":85.795,"VS Average Volume":1.2889974883,"Company Summary":"Cognizant Technology Solutions Corporation, a professional services company, provides consulting and technology, and outsourcing services in North America, Europe, and internationally. It operates through four segments: Financial Services, Health Sciences, Products and Resources, and Communications, Media and Technology. The company provides customer experience, robotic process automation, analytics, and AI services in areas, such as digital lending, fraud detection, and next generation payments; the shift towards consumerism, outcome-based contracting, digital health, delivering integrated seamless, omni-channel, and patient-centered experience; and services that drive operational improvements in areas, such as clinical development, pharmacovigilance, and manufacturing, as well as claims processing, enrollment, membership, and billing to healthcare providers and payers, and life sciences companies, including pharmaceutical, biotech, and medical device companies. It offers solution to manufacturers, automakers, retailers and travel and hospitality companies, as well as companies providing logistics, energy and utility services; and digital content, business process improvement, technology modernization, and the creation of unified and compelling user experience services to communications, media and entertainment, education, and information services and technology companies. The company was incorporated in 1988 and is headquartered in Teaneck, New Jersey.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Fiserv, Inc.","Symbol":"FI","Current Price":"230.06","Latest MA":"189.71","Price Target":251.7103,"Difference from MA":"21.27%","Difference from Open":"-0.64%","Change from Yesterday":"-0.51%","Change from Last Report":"0.00","Latest Volume":"2,714,205","Market Cap":"130,885,500,928","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":19.197231,"PB Ratio":4.725383,"Previous Close":231.24,"ROE":0.10618,"DTE":89.406,"Industry":"Information Technology Services","Sector":"Technology","Beta":0.919,"Trailing PEG":1.1983,"Trailing PE":42.682747,"Trailing PS":6.504597,"Quick Ratio":0.215,"Day High":233.255,"Day Low":229.785,"VS Average Volume":0.9931011394,"Company Summary":"Fiserv, Inc., together with its subsidiaries, provides payments and financial services technology services in the United States, Europe, the Middle East and Africa, Latin America, the Asia-Pacific, and internationally. It operates through Merchant Acceptance, Financial Technology, and Payments and Network segments. The Merchant Acceptance segment provides merchant acquiring and digital commerce services; mobile payment services; security and fraud protection products; Clover, a cloud based POS and integrated commerce operating system for small and mid-sized businesses and independent software vendors; and Carat, an integrated operating system for large businesses. This segment distributes through various channels, including direct sales teams, strategic partnerships with agent sales forces, independent software vendors, financial institutions, and other strategic partners in the form of joint venture alliances, revenue sharing alliances, and referral agreement. The Financial Technology segment offers customer deposit and loan accounts, as well as manages an institution's general ledger and central information files. This segment also provides digital banking, financial and risk management, professional services and consulting, check processing, and other products and services. The Payments and Network segment offers card transactions, such as debit, credit, and prepaid card processing and services; funds access, debit payments, cardless ATM access, and surcharge-free ATM network; security and fraud protection products; card production; print services; and various network services, as well as non-card digital payment software and services, including bill payment, account-to-account transfers, person-to-person payments, electronic billing, and security and fraud protection products. It serves merchants, banks, credit unions, other financial institutions, and corporate clients. Fiserv, Inc. was incorporated in 1984 and is headquartered in Milwaukee, Wisconsin.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Hologic, Inc.","Symbol":"HOLX","Current Price":"64.58","Latest MA":"77.81","Price Target":80.53188,"Difference from MA":"-17.01%","Difference from Open":"-1.78%","Change from Yesterday":"-1.33%","Change from Last Report":"0.00","Latest Volume":"3,802,482","Market Cap":"14,491,106,304","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":13.969738,"PB Ratio":2.9429457,"Previous Close":65.45,"ROE":0.13846,"DTE":49.407,"Industry":"Medical Instruments & Supplies","Sector":"Healthcare","Beta":0.986,"Trailing PEG":1.3265,"Trailing PE":20.436708,"Trailing PS":3.6340423,"Quick Ratio":3.069,"Day High":66.07,"Day Low":63.875,"VS Average Volume":1.663324837,"Company Summary":"Hologic, Inc. engages in the development, manufacture, and supply of diagnostics products, medical imaging systems, and surgical products for women's health through early detection and treatment worldwide. The company operates through four segments: Diagnostics, Breast Health, GYN Surgical, and Skeletal Health. It provides Aptima molecular diagnostic assays to detect the infectious microorganisms; Aptima viral load assays for Hepatitis B virus, Hepatitis C virus, human immunodeficiency virus, and human cytomegalo virus; Aptima bacterial vaginosis and candida vaginitis assays for the diagnosis of vaginitis; Aptima SARS-CoV-2 and Panther Fusion SARS-CoV-2 assays to detect SARS-CoV-2; ThinPrep System for cytology applications; and Rapid Fetal Fibronectin Test that assists physicians in assessing the risk of pre-term birth. The company also offers breast cancer care solutions in the areas of radiology, breast surgery, pathology, and treatment, such as 3D digital mammography systems, image analytics software, reading workstations, minimally invasive breast biopsy guidance systems, breast biopsy site markers, localization, and specimen radiology solutions; and breast conserving surgery products. In addition, it provides MyoSure Hysteroscopic Tissue Removal System for the removal of fibroids and polyps in the uterus; NovaSure Endometrial Ablation System to treat abnormal uterine bleeding; Fluent Fluid Management System that provides liquid distention during diagnostic and operative hysteroscopic procedures; Acessa ProVu system to treat various fibroids; and CoolSeal portfolio, such as bipolar vessel sealing devices. Further, it offers Horizon DXA, a dual energy X-ray system; and Fluoroscan Insight FD mini C-arm to perform minimally invasive orthopedic surgical procedures. It sells its products through direct sales, service forces, independent distributors, and sales representatives. The company was incorporated in 1985 and is headquartered in Marlborough, Massachusetts.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"MetLife, Inc.","Symbol":"MET","Current Price":"83.92","Latest MA":"79.19","Price Target":95.14286,"Difference from MA":"5.97%","Difference from Open":"0.10%","Change from Yesterday":"0.30%","Change from Last Report":"0.00","Latest Volume":"3,908,185","Market Cap":"57,837,662,208","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":7.830988,"PB Ratio":1.8847837,"Previous Close":83.67,"ROE":0.13260001,"DTE":151.463,"Industry":"Insurance - Life","Sector":"Financial Services","Beta":1.039,"Trailing PEG":0.1477,"Trailing PE":13.690048,"Trailing PS":0.8106872,"Quick Ratio":1.349,"Day High":84.71,"Day Low":82.895,"VS Average Volume":1.1254840965,"Company Summary":"MetLife, Inc., a financial services company, provides insurance, annuities, employee benefits, and asset management services worldwide. It operates through six segments: Retirement and Income Solutions; Group Benefits; Asia; Latin America; Europe, the Middle East and Africa; and MetLife Holdings. The company offers life, dental, group short-and long-term disability, individual disability, pet insurance, accidental death and dismemberment, vision, and accident and health coverages, as well as prepaid legal plans; administrative services-only arrangements to employers; and general and separate account, and synthetic guaranteed interest contracts, as well as private floating rate funding agreements. It also provides pension risk transfers, institutional income annuities, structured settlements, and capital markets investment products; and other products and services, such as life insurance products and funding agreements for funding postretirement benefits, as well as company, bank, or trust-owned life insurance used to finance nonqualified benefit programs for executives. In addition, it provides fixed, indexed-linked, and variable annuities; pension products; regular savings products; whole and term life, endowments, universal and variable life, and group life products; longevity reinsurance solutions; credit insurance products; and protection against long-term health care services. MetLife, Inc. was incorporated in 1999 and is based in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Uber Technologies, Inc.","Symbol":"UBER","Current Price":"74.60","Latest MA":"70.29","Price Target":88.23857,"Difference from MA":"6.14%","Difference from Open":"6.03%","Change from Yesterday":"6.59%","Change from Last Report":"0.00","Latest Volume":"81,606,111","Market Cap":"157,085,958,144","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":17.272438,"PB Ratio":10.6207285,"Previous Close":69.99,"ROE":0.34326,"DTE":80.343,"Industry":"Software - Application","Sector":"Technology","Beta":1.337,"Trailing PEG":0.7352,"Trailing PE":16.35965,"Trailing PS":3.7441535,"Quick Ratio":1.223,"Day High":76.775,"Day Low":70.13,"VS Average Volume":3.0398590669,"Company Summary":"Uber Technologies, Inc. develops and operates proprietary technology applications in the United States, Canada, Latin America, Europe, the Middle East, Africa, and Asia excluding China and Southeast Asia. It operates through three segments: Mobility, Delivery, and Freight. The Mobility segment connects consumers with a range of transportation modalities, such as ridesharing, carsharing, micromobility, rentals, public transit, taxis, and other modalities; and offers riders in a variety of vehicle types, as well as financial partnerships products and advertising services. The Delivery segment allows to search for and discover restaurants to grocery, alcohol, convenience, and other retails; order a meal or other items; and Uber direct, a white-label Delivery-as-a-Service for retailers and restaurants, as well as advertising. The Freight segment manages transportation and logistics network, which connects shippers and carriers in digital marketplace including carriers upfronts, pricing, and shipment booking; and provides on-demand platform to automate logistics end-to-end transactions for small-and medium-sized business to global enterprises. The company was formerly known as Ubercab, Inc. and changed its name to Uber Technologies, Inc. in February 2011. Uber Technologies, Inc. was founded in 2009 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Coherent Corp.","Symbol":"COHR","Current Price":"95.89","Latest MA":"88.94","Price Target":115.97222,"Difference from MA":"7.82%","Difference from Open":"-5.13%","Change from Yesterday":"-4.55%","Change from Last Report":"0.00","Latest Volume":"5,594,320","Market Cap":"14,859,786,240","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":21.925432,"PB Ratio":2.8118584,"Previous Close":100.46,"ROE":-0.00863,"DTE":50.88,"Industry":"Scientific & Technical Instruments","Sector":"Technology","Beta":1.654,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":2.9703293,"Quick Ratio":1.371,"Day High":101.46,"Day Low":94.0,"VS Average Volume":1.8571078113,"Company Summary":"Coherent Corp. develops, manufactures, and markets engineered materials, optoelectronic components and devices, and optical and laser systems and subsystems for the use in the industrial, communications, electronics, and instrumentation markets worldwide. It operates through three segments: Networking, Materials, and Lasers. The Networking segment offers telecommunication products for fiber-optic transmission; datacom transceivers, including pluggable transceivers for ethernet and fiber channel applications; and advanced optics, such as fiber and precision optics used in projection displays, crystal materials and components for optical communications, filters and assemblies for life sciences, sensors, instrumentation, and semiconductor equipment, as well as ultraviolet (UV), visible, and near-infrared spectroscopy optics for industrial lasers. The Materials segments provides laser optics and accessories; infrared thermal imaging optics and assemblies; polycrystalline materials; thermoelectric components, subassemblies, and systems; ceramic and metal-matrix composite products; semiconductor lasers and laser bars; Q-switched laser modules, uncooled pump laser modules, and laser systems for superhard materials processing; laser processing heads and beam delivery systems; EELs, VCSELs, and detectors; pumps for amplifiers; precision optical assemblies, infrared optics, thin-film coatings and optical materials; optical solutions; and integrated circuits for transceivers. The Lasers segment offers UV gas and solid-state lasers; UV optical systems, line beams, and mask-based imaging systems; UV nanosecond lasers; continuous-wave lasers and systems; amplifiers; subsystems and standard systems; IR lasers; crystals and diode lasers, and specialty polishing and coating solutions. The company was formerly known as II-VI Incorporated and changed its name to Coherent Corp. in September 2022. Coherent Corp. was incorporated in 1971 and is headquartered in Saxonburg, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Corteva, Inc.","Symbol":"CTVA","Current Price":"62.34","Latest MA":"57.62","Price Target":67.68182,"Difference from MA":"8.20%","Difference from Open":"-0.26%","Change from Yesterday":"-0.03%","Change from Last Report":"0.00","Latest Volume":"5,084,627","Market Cap":"42,739,994,624","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":17.810104,"PB Ratio":1.7367805,"Previous Close":62.36,"ROE":0.02704,"DTE":22.883,"Industry":"Agricultural Inputs","Sector":"Basic Materials","Beta":0.773,"Trailing PEG":1.2451,"Trailing PE":51.09836,"Trailing PS":2.5689726,"Quick Ratio":0.88,"Day High":64.615,"Day Low":61.99,"VS Average Volume":1.4026712019,"Company Summary":"Corteva, Inc. operates in the agriculture business. It operates through two segments, Seed and Crop Protection. The Seed segment develops and supplies advanced germplasm and traits that produce optimum yield for farms. It offers trait technologies that enhance resistance to weather, disease, insects, and herbicides used to control weeds, as well as food and nutritional characteristics. This segment also provides digital solutions that assist farmer decision-making with a view to optimize product selection, and maximize yield and profitability. The Crop Protection segment offers products that protect against weeds, insects and other pests, and diseases, as well as enhances crop health above and below ground through nitrogen management and seed-applied technologies. This segment provides herbicides, insecticides, nitrogen stabilizers, and pasture and range management herbicides. It serves agricultural input industry. The company operates in the United States, Canada, Latin America, the Asia Pacific, Europe, the Middle East, and Africa. Corteva, Inc. was incorporated in 2018 and is headquartered in Indianapolis, Indiana.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Johnson Controls International ","Symbol":"JCI","Current Price":"87.65","Latest MA":"75.81","Price Target":93.4381,"Difference from MA":"15.61%","Difference from Open":"-0.86%","Change from Yesterday":"-0.40%","Change from Last Report":"0.00","Latest Volume":"6,275,990","Market Cap":"57,861,185,536","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":20.964285,"PB Ratio":3.62235,"Previous Close":88.0,"ROE":0.0805,"DTE":54.68,"Industry":"Building Products & Equipment","Sector":"Industrials","Beta":1.306,"Trailing PEG":1.5006,"Trailing PE":41.150234,"Trailing PS":2.5209649,"Quick Ratio":0.557,"Day High":88.74,"Day Low":87.37,"VS Average Volume":1.5990423056,"Company Summary":"Johnson Controls International plc, together with its subsidiaries, engages in engineering, manufacturing, commissioning, and retrofitting building products and systems in the United States, Europe, the Asia Pacific, and internationally. It operates through four segments: Building Solutions North America, Building Solutions EMEA\/LA, Building Solutions Asia Pacific, and Global Products. The company designs, sells, installs, and services heating, ventilating, air conditioning, controls, building management, refrigeration, integrated electronic security, integrated fire detection and suppression systems, and fire protection and security products. It also provides energy efficiency solutions and technical services, including inspection, scheduled maintenance, and repair and replacement of mechanical and control systems, as well as data-driven smart building solutions. In addition, the company offers control software and software services. It sells its products and services to commercial, institutional, industrial, data center, and governmental customers. Johnson Controls International plc was incorporated in 1885 and is headquartered in Cork, Ireland.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Ford Motor Company","Symbol":"F","Current Price":"9.24","Latest MA":"10.71","Price Target":11.24417,"Difference from MA":"-13.76%","Difference from Open":"-0.96%","Change from Yesterday":"-0.22%","Change from Last Report":"0.00","Latest Volume":"126,424,339","Market Cap":"36,622,278,656","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":5.4447746,"PB Ratio":0.8286996,"Previous Close":9.26,"ROE":0.0799,"DTE":359.359,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":1.636,"Trailing PEG":0.8035,"Trailing PE":6.328767,"Trailing PS":0.20040317,"Quick Ratio":0.942,"Day High":9.34,"Day Low":9.18,"VS Average Volume":1.9509916514,"Company Summary":"Ford Motor Company develops, delivers, and services a range of Ford trucks, commercial cars and vans, sport utility vehicles, and Lincoln luxury vehicles worldwide. It operates through Ford Blue, Ford Model e, and Ford Pro; Ford Next; and Ford Credit segments. The company sells Ford and Lincoln vehicles, service parts, and accessories through distributors and dealers, as well as through dealerships to commercial fleet customers, daily rental car companies, and governments. It also engages in vehicle-related financing and leasing activities to and through automotive dealers. In addition, the company provides retail installment sale contracts for new and used vehicles; and direct financing leases for new vehicles to retail and commercial customers, such as leasing companies, government entities, daily rental companies, and fleet customers. Further, it offers wholesale loans to dealers to finance the purchase of vehicle inventory; and loans to dealers to finance working capital and enhance dealership facilities, purchase dealership real estate, and other dealer vehicle programs. The company was incorporated in 1903 and is based in Dearborn, Michigan.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Ares Capital Corporation","Symbol":"ARCC","Current Price":"22.74","Latest MA":"20.97","Price Target":23.34615,"Difference from MA":"8.45%","Difference from Open":"0.00%","Change from Yesterday":"0.04%","Change from Last Report":"0.00","Latest Volume":"3,687,978","Market Cap":"15,269,499,904","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":10.560879,"PB Ratio":1.1501113,"Previous Close":22.73,"ROE":0.1338,"DTE":106.255,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.054,"Trailing PEG":null,"Trailing PE":9.319672,"Trailing PS":5.197243,"Quick Ratio":1.29,"Day High":22.88,"Day Low":22.6,"VS Average Volume":0.7846511282,"Company Summary":"Ares Capital Corporation is a business development company specializing in acquisition, recapitalization, mezzanine debt, restructurings, rescue financing, and leveraged buyout transactions of middle market companies. It also makes growth capital and general refinancing. It prefers to make investments in companies engaged in the basic and growth manufacturing, business services, consumer products, health care products and services, and information technology service sectors. The fund will also consider investments in industries such as restaurants, retail, oil and gas, and technology sectors. It focuses on investments in Northeast, Mid-Atlantic, Southeast and Southwest regions from its New York office, the Midwest region, from the Chicago office, and the Western region from the Los Angeles office. The fund typically invests between $20 million and $200 million and a maximum of $400 million in companies with an EBITDA between $10 million and $250 million. It makes debt investments between $10 million and $100 million The fund invests through revolvers, first lien loans, warrants, unitranche structures, second lien loans, mezzanine debt, private high yield, junior capital, subordinated debt, and non-control preferred and common equity. The fund also selectively considers third-party-led senior and subordinated debt financings and opportunistically considers the purchase of stressed and discounted debt positions. The fund prefers to be an agent and\/or lead the transactions in which it invests. The fund also seeks board representation in its portfolio companies.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Boston Scientific Corporation","Symbol":"BSX","Current Price":"105.25","Latest MA":"86.18","Price Target":114.67906,"Difference from MA":"22.12%","Difference from Open":"0.48%","Change from Yesterday":"0.22%","Change from Last Report":"0.00","Latest Volume":"5,471,794","Market Cap":"155,120,615,424","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":32.394283,"PB Ratio":7.488971,"Previous Close":105.02,"ROE":0.08916,"DTE":53.722,"Industry":"Medical Devices","Sector":"Healthcare","Beta":0.797,"Trailing PEG":1.9039,"Trailing PE":84.2,"Trailing PS":9.749269,"Quick Ratio":0.847,"Day High":105.91,"Day Low":104.2901,"VS Average Volume":0.9971013362,"Company Summary":"Boston Scientific Corporation develops, manufactures, and markets medical devices for use in various interventional medical specialties worldwide. It operates through two segments, MedSurg and Cardiovascular. The company offers devices to diagnose and treat gastrointestinal and pulmonary conditions, such as resolution clips, biliary stent systems, stents and electrocautery enhanced delivery systems, direct visualization systems, digital catheters, and single-use duodenoscopes; devices to treat urological conditions, including ureteral stents, catheters, baskets, guidewires, sheaths, balloons, single-use digital flexible ureteroscopes, holmium laser systems, artificial urinary sphincter, laser system, fiber, and hydrogel systems; and devices to treat neurological movement disorders and manage chronic pain, such as spinal cord stimulator system, proprietary programming software, radiofrequency generator, indirect decompression systems, practice optimization tools, and deep brain stimulation system. It also provides technologies for diagnosing and treating coronary artery disease and aortic valve conditions; WATCHMAN FLX, a Left Atrial Appendage Closure Device; and implantable devices that monitor the heart and deliver electricity to treat cardiac abnormalities, such as cardioverter and cardiac resynchronization therapy defibrillators, MRI S-ICD systems, cardiac resynchronization therapy pacemakers, quadripolar LV leads, ICD leads, pacing leads, remote patient management systems, insertable cardiac monitor systems, and remote cardiac monitoring systems. In addition, the company offers diagnosis and treatment of rate and rhythm disorders of the heart; peripheral arterial and venous diseases; and products to diagnose, treat and ease forms of cancer. The company was incorporated in 1979 and is headquartered in Marlborough, Massachusetts.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"AFLAC Incorporated","Symbol":"AFL","Current Price":"103.58","Latest MA":"105.19","Price Target":105.28571,"Difference from MA":"-1.53%","Difference from Open":"0.01%","Change from Yesterday":"0.49%","Change from Last Report":"0.00","Latest Volume":"2,761,584","Market Cap":"56,965,275,648","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":14.206031,"PB Ratio":2.3223693,"Previous Close":103.08,"ROE":0.16038,"DTE":50.141,"Industry":"Insurance - Life","Sector":"Financial Services","Beta":0.958,"Trailing PEG":null,"Trailing PE":10.755971,"Trailing PS":3.29241,"Quick Ratio":1.349,"Day High":104.49,"Day Low":102.54,"VS Average Volume":1.4517651697,"Company Summary":"Aflac Incorporated, through its subsidiaries, provides supplemental health and life insurance products. The company operates through Aflac Japan and Aflac U.S. segments. The Aflac Japan segment offers cancer, medical, nursing care, work leave, GIFT, and whole and term life insurance products, as well as WAYS and child endowment plans under saving type insurance products in Japan. The Aflac U.S. segment provides cancer, accident, short-term disability, critical illness, hospital indemnity, dental, vision, long-term care and disability, and term and whole life insurance products in the United States. It sells its products through sales associates, brokers, independent corporate agencies, individual agencies, and affiliated corporate agencies. Aflac Incorporated was founded in 1955 and is headquartered in Columbus, Georgia.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Emerson Electric Company","Symbol":"EMR","Current Price":"124.37","Latest MA":"115.98","Price Target":141.93286,"Difference from MA":"7.23%","Difference from Open":"-3.02%","Change from Yesterday":"-2.44%","Change from Last Report":"0.00","Latest Volume":"2,977,425","Market Cap":"70,132,244,480","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":19.119286,"PB Ratio":3.2776387,"Previous Close":127.48,"ROE":0.05933,"DTE":30.376,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":1.292,"Trailing PEG":1.6937,"Trailing PE":35.13277,"Trailing PS":4.0093894,"Quick Ratio":1.323,"Day High":128.24,"Day Low":123.79,"VS Average Volume":0.9747201476,"Company Summary":"Emerson Electric Co., a technology and software company, provides various solutions in the Americas, Asia, the Middle East, Africa, and Europe. It operates through seven segments: Final Control, Measurement & Analytical, Discrete Automation, Safety & Productivity, Control Systems & Software, Test & Measurement, and AspenTech. The Final Control segment provides control, isolation, shutoff, pressure relief, and pressure safety valves, actuators, and regulators for process and hybrid industries. The Measurement & Analytical segment offers intelligent instrumentation measuring the physical properties of liquids or gases, such as pressure, temperature, level, flow, acoustics, corrosion, pH, conductivity, water quality, toxic gases, and flame. The Discrete Automation segment offers solenoid and pneumatic valves, valve position indicators, pneumatic cylinders, actuators, air preparation equipment, pressure and temperature switches, electric linear motion solutions, programmable automation control systems, electrical distribution equipment, and materials joining solutions. The Safety & Productivity segment offers tools for professionals and homeowners; pipe-working tools, including pipe wrenches, pipe cutters, pipe threading and roll grooving equipment, battery hydraulic tools; electrical tools; and other professional tools. The Control Systems & Software segment provides control systems, safety instrumented systems, SCADA systems, application software, digital twins, asset performance management, and cybersecurity. The Test & Measurement provides software-connected automated test and measurement systems. The AspenTech segment provides asset optimization software that enables industrial manufacturers to design, operate, and maintain operations for enhancing performance through a combination of decades of modeling, simulation, and optimization capabilities. The company was incorporated in 1890 and is based in Saint Louis, Missouri.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Cencora, Inc.","Symbol":"COR","Current Price":"247.88","Latest MA":"235.25","Price Target":277.678,"Difference from MA":"5.37%","Difference from Open":"0.94%","Change from Yesterday":"0.71%","Change from Last Report":"0.00","Latest Volume":"3,697,173","Market Cap":"48,068,145,152","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":14.738488,"PB Ratio":61.84631,"Previous Close":246.13,"ROE":2.0911798,"DTE":557.753,"Industry":"Medical Distribution","Sector":"Healthcare","Beta":0.436,"Trailing PEG":0.9518,"Trailing PE":35.210228,"Trailing PS":0.16352011,"Quick Ratio":0.498,"Day High":249.47,"Day Low":244.75,"VS Average Volume":2.9458466064,"Company Summary":"Cencora, Inc. sources and distributes pharmaceutical products in the United States and internationally. The company's U.S. Healthcare Solutions segment distributes pharmaceuticals, over-the-counter healthcare products, home healthcare supplies and equipment, and related services to acute care hospitals and health systems, independent and chain retail pharmacies, mail order pharmacies, medical clinics, long-term care and alternate site pharmacies, and other customers; provides pharmacy management, staffing, and other consulting services; supply management software to retail and institutional healthcare providers; packaging solutions to institutional and retail healthcare providers; clinical trial support, product post-approval, and commercialization support services; data analytics, outcomes research, and other services for biotechnology and pharmaceutical manufacturers; pharmaceuticals, vaccines, parasiticides, diagnostics, micro feed ingredients, and other products to the companion animal and production animal markets; and sales force services to manufacturers. This segment also distributes plasma and other blood products, injectable pharmaceuticals, vaccines, and other specialty products; and offers other services to physicians who specialize in various disease states, such as oncology, as well as to other healthcare providers, including hospitals and dialysis clinics. Its International Healthcare Solutions segment provides international pharmaceutical wholesale and related service, and global commercialization services; distributes pharmaceuticals, other healthcare products, and related services to pharmacies, doctors, health centers, and hospitals; and offers specialty transportation and logistics services for the biopharmaceutical industry. The company was formerly known as AmerisourceBergen Corporation and changed its name to Cencora, Inc. in August 2023. Cencora, Inc. was founded in 1871 and is headquartered in Conshohocken, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"},{"Company Name":"Walt Disney Company (The)","Symbol":"DIS","Current Price":"110.86","Latest MA":"100.23","Price Target":125.34643,"Difference from MA":"10.60%","Difference from Open":"-0.67%","Change from Yesterday":"-1.10%","Change from Last Report":"0.00","Latest Volume":"6,143,394","Market Cap":"200,411,594,752","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":18.181402,"PB Ratio":2.000758,"Previous Close":112.09,"ROE":0.0546,"DTE":45.188,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.398,"Trailing PEG":0.9845,"Trailing PE":35.993507,"Trailing PS":2.226103,"Quick Ratio":0.531,"Day High":112.55,"Day Low":110.8101,"VS Average Volume":0.6322022102,"Company Summary":"The Walt Disney Company operates as an entertainment company worldwide. It operates through three segments: Entertainment, Sports, and Experiences. The company produces and distributes film and television video streaming content under the ABC Television Network, Disney, Freeform, FX, Fox, National Geographic, and Star brand television channels, as well as ABC television stations and A+E television networks; and produces original content under the ABC Signature, Disney Branded Television, FX Productions, Lucasfilm, Marvel, National Geographic Studios, Pixar, Searchlight Pictures, Twentieth Century Studios, 20th Television, and Walt Disney Pictures banners. It also offers direct-to-consumer streaming services through Disney+, Disney+ Hotstar, Hulu, and Star+; sports-related entertainment services through ESPN, ESPN on ABC, ESPN+ DTC, and Star; sale\/licensing of film and episodic content to third-party television and VOD services; theatrical, home entertainment, and music distribution services; DVD and Blu-ray discs, electronic home video licenses, and VOD rental services; staging and licensing of live entertainment events; and post-production services. In addition, the company operates theme parks and resorts comprising Walt Disney World Resort, Disneyland Resort, Disneyland Paris, Hong Kong Disneyland Resort, Shanghai Disney Resort, Disney Cruise Line, Disney Vacation Club, National Geographic Expeditions, and Adventures by Disney, as well as Aulani, a Disney resort and spa in Hawaii. It also licenses its intellectual property to a third party for operations of the Tokyo Disney Resort; licenses trade names, characters, visual, literary, and other IP for use on merchandise, published materials, and games; operates a direct-to-home satellite distribution platform; sells branded merchandise through retail, online, and wholesale businesses; and develops and publishes books, comic books, and magazines. The company was founded in 1923 and is based in Burbank, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"08-02-2025 01:10:38"}]