[{"Company Name":"Johnson & Johnson","Symbol":"JNJ","Current Price":"143.10","Latest MA":"154.14","Price Target":171.29272,"Difference from MA":"-7.16%","Difference from Open":"-3.02%","Change from Yesterday":"-3.28%","Change from Last Report":"-3.41","Latest Volume":"1,047,042","Market Cap":"344,530,452,480","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":12.789451,"PB Ratio":4.910102,"ROE":0.20889,"DTE":50.958,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.518,"Trailing PEG":0.8647,"Trailing PE":23.692055,"Trailing PS":3.9286907,"Quick Ratio":0.705,"Day High":144.48,"Day Low":143.1,"VS Average Volume":0.1307457453,"Company Summary":"Johnson & Johnson, together with its subsidiaries, researches, develops, manufactures, and sells various products in the healthcare field worldwide. The company's Innovative Medicine segment offers products for various therapeutic areas, such as immunology, including rheumatoid arthritis, psoriatic arthritis, inflammatory bowel disease, and psoriasis; infectious diseases comprising HIV\/AIDS; neuroscience, consisting of mood disorders, neurodegenerative disorders, and schizophrenia; oncology, such as prostate cancer, hematologic malignancies, lung cancer, and bladder cancer; cardiovascular and metabolism, including thrombosis, diabetes, and macular degeneration; and pulmonary hypertension comprising pulmonary arterial hypertension through retailers, wholesalers, distributors, hospitals, and healthcare professionals for prescription use. Its MedTech segment provides Interventional Solutions, including electrophysiology products to treat heart rhythm disorders; the heart recovery portfolio, which includes technologies to treat severe coronary artery disease requiring high-risk PCI or AMI cardiogenic shock; and neurovascular care that treats hemorrhagic and ischemic stroke. this segment also offers an orthopaedics portfolio that includes products and enabling technologies that support hips, knees, trauma, spine, sports, and other; surgery portfolios comprising advanced and general surgery technologies, as well as solutions for breast aesthetics, ear, nose, and throat procedures; contact lenses under the ACUVUE Brand; and TECNIS intraocular lenses for cataract surgery. It distributes its products to wholesalers, hospitals, and retailers, as well as physicians, nurses, hospitals, eye care professionals, and clinics. The company has a collaboration agreement with Stand Up To Cancer for research testing a combination of teclistamab and daratumumab to treat a rare disease AL amyloidosis. Johnson & Johnson was founded in 1886 and is based in New Brunswick, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"22-01-2025 16:31:14"},{"Company Name":"Amphenol Corporation","Symbol":"APH","Current Price":"74.07","Latest MA":"67.55","Price Target":77.91529,"Difference from MA":"9.65%","Difference from Open":"4.77%","Change from Yesterday":"1.82%","Change from Last Report":"1.86","Latest Volume":"1,088,364","Market Cap":"89,299,533,824","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":30.868933,"PB Ratio":9.445294,"ROE":0.25293,"DTE":57.565,"Industry":"Electronic Components","Sector":"Technology","Beta":1.238,"Trailing PEG":2.2556,"Trailing PE":42.325714,"Trailing PS":6.2743835,"Quick Ratio":1.208,"Day High":75.7,"Day Low":73.86,"VS Average Volume":0.1690118798,"Company Summary":"Amphenol Corporation, together with its subsidiaries, primarily designs, manufactures, and markets electrical, electronic, and fiber optic connectors in the United States, China, and internationally. It operates through three segments: Harsh Environment Solutions, Communications Solutions, and Interconnect and Sensor Systems. The company offers connectors and connector systems, including harsh environment data, power, high-speed, fiber optic, and radio frequency interconnect products; busbars and power distribution systems; and other connectors. It also provides value-add products, such as backplane interconnect systems, cable assemblies and harnesses, and cable management products; other products comprising flexible and rigid printed circuit boards, hinges, other mechanical, and production related products. In addition, the company offers consumer device, network infrastructure, and other antennas; coaxial, power, and specialty cables; and sensors and sensor-based products. It sells its products through its sales force, independent representatives, and a network of electronics distributors to original equipment manufacturers, electronic manufacturing services companies, original design manufacturers, and service providers in the automotive, broadband communication, commercial aerospace, industrial, information technology and data communication, military, mobile device, and mobile network markets. Amphenol Corporation was founded in 1932 and is headquartered in Wallingford, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"22-01-2025 16:31:14"},{"Company Name":"Netflix, Inc.","Symbol":"NFLX","Current Price":"980.80","Latest MA":"752.62","Price Target":986.1922,"Difference from MA":"30.32%","Difference from Open":"-1.69%","Change from Yesterday":"12.23%","Change from Last Report":"12.78","Latest Volume":"1,416,726","Market Cap":"419,250,798,592","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":32.964233,"PB Ratio":18.452393,"ROE":0.34714,"DTE":81.461,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.25,"Trailing PEG":1.7805,"Trailing PE":49.460415,"Trailing PS":11.15406,"Quick Ratio":0.975,"Day High":999.0,"Day Low":976.45,"VS Average Volume":0.4545985747,"Company Summary":"Netflix, Inc. provides entertainment services. It offers TV series, documentaries, feature films, and games across various genres and languages. The company also provides members the ability to receive streaming content through a host of internet-connected devices, including TVs, digital video players, TV set-top boxes, and mobile devices. It has operations in approximately 190 countries. The company was incorporated in 1997 and is headquartered in Los Gatos, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"22-01-2025 16:31:14"},{"Company Name":"Bank of America Corporation","Symbol":"BAC","Current Price":"46.64","Latest MA":"41.94","Price Target":51.92857,"Difference from MA":"11.20%","Difference from Open":"0.04%","Change from Yesterday":"-0.04%","Change from Last Report":"-0.04","Latest Volume":"1,090,560","Market Cap":"354,970,501,120","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.768055,"PB Ratio":1.3185943,"ROE":0.08092,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.325,"Trailing PEG":2.0673,"Trailing PE":14.529594,"Trailing PS":3.7513,"Quick Ratio":"N\/A","Day High":46.66,"Day Low":46.53,"VS Average Volume":0.031033594,"Company Summary":"Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. It operates in four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, non-interest and interest-bearing checking accounts, and investment accounts and products; credit and debit cards; residential mortgages, and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research, and certain market-based services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"22-01-2025 16:31:14"},{"Company Name":"SoFi Technologies, Inc.","Symbol":"SOFI","Current Price":"17.85","Latest MA":"10.37","Price Target":12.6,"Difference from MA":"72.18%","Difference from Open":"-1.11%","Change from Yesterday":"0.21%","Change from Last Report":"-0.28","Latest Volume":"4,658,648","Market Cap":"19,369,926,656","Earning Date":"2025-01-27","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":72.85714,"PB Ratio":3.1615305,"ROE":0.037249997,"DTE":54.394,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.613,"Trailing PEG":null,"Trailing PE":148.75,"Trailing PS":7.688886,"Quick Ratio":0.47,"Day High":18.05,"Day Low":17.59,"VS Average Volume":0.090601138,"Company Summary":"SoFi Technologies, Inc. provides various financial services in the United States, Latin America, and Canada. It operates through three segments: Lending, Technology Platform, and Financial Services. The company offers lending and financial services and products that allows its members to borrow, save, spend, invest, and protect money. It offers personal loans, student loans, home loans, and related services. The company also operates Galileo, a technology platform that offers services to financial and non-financial institution; and Technisys, a cloud-native digital and core banking platform with financial services customers. In addition, it provides SoFi Money offers checking and savings accounts, debit cards, and cash management products; and SoFi Invest, a mobile-first investment platform that provides access to trading and advisory solutions, such as investing and robo-advisory. Further, the company offers SoFi Credit Card that provides cash backs on every purchase; Sofi Relay, a personal finance management product that allows to track all of their financial accounts comprising credit score and spending behaviors; SoFi Protect, which offers insurance product; SoFi Travel, an application that manages travel search and booking experience; SoFi At Work provides financial benefits to employees, including student loan payments made on their employees' behalf; Lantern Credit, a financial services marketplace platform for seeking alternative products and provide product comparisons; and other lending as a service that offers pre-qualified borrower referrals and sells loans to third-party partner. The company was founded in 2011 and is based in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"22-01-2025 16:31:14"},{"Company Name":"Texas Instruments Incorporated","Symbol":"TXN","Current Price":"196.31","Latest MA":"198.24","Price Target":208.31448,"Difference from MA":"-0.97%","Difference from Open":"0.27%","Change from Yesterday":"0.56%","Change from Last Report":"0.56","Latest Volume":"1,372,162","Market Cap":"179,081,887,744","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":32.43959,"PB Ratio":10.368385,"ROE":0.29293,"DTE":84.399,"Industry":"Semiconductors","Sector":"Technology","Beta":0.98,"Trailing PEG":3.1313,"Trailing PE":36.42208,"Trailing PS":11.398503,"Quick Ratio":3.048,"Day High":196.49,"Day Low":195.3,"VS Average Volume":0.2371605759,"Company Summary":"Texas Instruments Incorporated designs, manufactures, and sells semiconductors to electronics designers and manufacturers in the United States and internationally. The company operates through Analog and Embedded Processing segments. The Analog segment offers power products to manage power requirements across various voltage levels, including battery-management solutions, DC\/DC switching regulators, AC\/DC and isolated controllers and converters, power switches, linear regulators, voltage references, and lighting products. This segment provides signal chain products that sense, condition, and measure signals to allow information to be transferred or converted for further processing and control, including amplifiers, data converters, interface products, motor drives, clocks, and logic and sensing products. The Embedded Processing segment offers microcontrollers that are used in electronic equipment; digital signal processors for mathematical computations; and applications processors for specific computing activity. This segment offers products for use in various markets, such as industrial, automotive, personal electronics, communications equipment, enterprise systems, and calculators and other. It provides DLP products primarily for use in project high-definition images; calculators; and application-specific integrated circuits. The company markets and sells its semiconductor products through direct sales and distributors, as well as through its website. Texas Instruments Incorporated was founded in 1930 and is headquartered in Dallas, Texas.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"22-01-2025 16:31:14"},{"Company Name":"American Airlines Group, Inc.","Symbol":"AAL","Current Price":"18.88","Latest MA":"12.88","Price Target":20.24273,"Difference from MA":"46.64%","Difference from Open":"-0.89%","Change from Yesterday":"1.23%","Change from Last Report":"1.29","Latest Volume":"2,175,630","Market Cap":"12,406,632,448","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":7.710843,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Airlines","Sector":"Industrials","Beta":1.399,"Trailing PEG":0.2269,"Trailing PE":44.95238,"Trailing PS":0.2314109,"Quick Ratio":0.422,"Day High":19.0761,"Day Low":18.85,"VS Average Volume":0.0828224415,"Company Summary":"American Airlines Group Inc., through its subsidiaries, operates as a network air carrier. The company provides scheduled air transportation services for passengers and cargo through its hubs in Charlotte, Chicago, Dallas\/Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix, and Washington, D.C., as well as through partner gateways in London, Doha, Madrid, Seattle\/Tacoma, Sydney, and Tokyo. It operates a mainline fleet of 965 aircraft. The company was formerly known as AMR Corporation and changed its name to American Airlines Group Inc. in December 2013. American Airlines Group Inc. was founded in 1926 and is headquartered in Fort Worth, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"22-01-2025 16:31:14"},{"Company Name":"Alexandria Real Estate Equities","Symbol":"ARE","Current Price":"102.81","Latest MA":"111.08","Price Target":119.69231,"Difference from MA":"-7.44%","Difference from Open":"0.52%","Change from Yesterday":"-0.90%","Change from Last Report":"0.00","Latest Volume":"1,164,730","Market Cap":"17,967,280,128","Earning Date":"2025-01-27","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":39.72627,"PB Ratio":0.9720515,"ROE":0.02132,"DTE":58.757,"Industry":"REIT - Office","Sector":"Real Estate","Beta":1.176,"Trailing PEG":null,"Trailing PE":62.689022,"Trailing PS":5.8232245,"Quick Ratio":2.62,"Day High":103.49,"Day Low":102.18,"VS Average Volume":0.8906365896,"Company Summary":"Alexandria Real Estate Equities, Inc. (NYSE: ARE), an S&P 500 company, is a best-in-class, mission-driven life science REIT making a positive and lasting impact on the world. As the pioneer of the life science real estate niche with our founding in 1994, Alexandria is the preeminent and longest-tenured owner, operator, and developer of collaborative mega campuses in AAA life science innovation cluster locations, including Greater Boston, the San Francisco Bay Area, San Diego, Seattle, Maryland, Research Triangle, and New York City. As of September 30, 2024, Alexandria has a total market capitalization of $33.1 billion and an asset base in North America that includes 41.8 million RSF of operating properties, 5.3 million RSF of Class A\/A+ properties undergoing construction, and one committed near-term project expected to commence construction in the next two years. Alexandria has a longstanding and proven track record of developing Class A\/A+ properties clustered in mega campuses that provide our innovative tenants with highly dynamic and collaborative environments that enhance their ability to successfully recruit and retain world-class talent and inspire productivity, efficiency, creativity, and success. Alexandria also provides strategic capital to transformative life science companies through our venture capital platform. We believe our unique business model and diligent underwriting ensure a high-quality and diverse tenant base that results in higher occupancy levels, longer lease terms, higher rental income, higher returns, and greater long-term asset value.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"22-01-2025 16:31:14"}]