[{"Company Name":"Danaher Corporation","Symbol":"DHR","Current Price":"228.47","Latest MA":"252.91","Price Target":283.31155,"Difference from MA":"-9.66%","Difference from Open":"-11.33%","Change from Yesterday":"-7.78%","Change from Last Report":"-1.91","Latest Volume":"2,174,710","Market Cap":"165,018,238,976","Earning Date":"2025-01-29","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":24.902729,"PB Ratio":3.216439,"ROE":0.07586,"DTE":36.69,"Industry":"Diagnostics & Research","Sector":"Healthcare","Beta":0.881,"Trailing PEG":3.3095,"Trailing PE":43.107563,"Trailing PS":6.950478,"Quick Ratio":0.916,"Day High":235.53,"Day Low":228.47,"VS Average Volume":0.7066468757,"Company Summary":"Danaher Corporation designs, manufactures, and markets professional, medical, industrial, and commercial products and services worldwide. The Biotechnology segments offers bioprocess technologies, consumables, and services that advance, accelerate, and integrate the development and manufacture of therapeutics; cell line and cell culture media development services; cell culture media, process liquids and buffers for manufacturing, chromatography resins, filtration technologies, aseptic fill finish; single-use hardware and consumables and services, such as the design and installation of full manufacturing suites; lab filtration, separation, and purification; lab-scale protein purification and analytical tools; reagents, membranes, and services; and healthcare filtration solutions. The Life Sciences segment provides mass spectrometers; flow cytometry, genomics, lab automation, centrifugation, liquid handling automation instruments, antibodies and reagents, and particle counting and characterization; microscopes; protein consumables; industrial filtration products; and genomic medicines, such as custom nucleic acid products, plasmid DNA, RNA, and proteins under the ABCAM, ALDEVRON, BECKMAN COULTER, IDT, LEICA MICROSYSTEMS, MOLECULAR DEVICES, PALL, PHENOMENEX and SCIEX brands. The Diagnostics segment offers chemistry, immunoassay, microbiology, and automation systems; and molecular, acute care, and pathology diagnostics products. This segment also provides clinical instruments, reagents, consumables, software, and services for hospitals, physicians' offices, reference laboratories, and other critical care settings. The company has a research  collaboration  with Stanford  University's Department  of  Bioengineering for cancer drug development. The company was formerly known as Diversified Mortgage Investors, Inc. and changed its name to Danaher Corporation in 1984. Danaher Corporation was founded in 1969 and is based in Washington, the District of Columbia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 16:45:28"},{"Company Name":"Tesla, Inc.","Symbol":"TSLA","Current Price":"394.26","Latest MA":"288.44","Price Target":319.46732,"Difference from MA":"36.69%","Difference from Open":"-0.23%","Change from Yesterday":"-0.95%","Change from Last Report":"-0.85","Latest Volume":"5,252,774","Market Cap":"1,265,614,323,712","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":120.8942,"PB Ratio":18.080576,"ROE":0.20389,"DTE":18.078,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":2.295,"Trailing PEG":4.8786,"Trailing PE":107.72268,"Trailing PS":13.027425,"Quick Ratio":1.214,"Day High":398.5899,"Day Low":392.1418,"VS Average Volume":0.058617819,"Company Summary":"Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners; and provision of service and repairs to its energy product customers, including under warranty, as well as various financing options to its solar customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was incorporated in 2003 and is headquartered in Austin, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"29-01-2025 16:45:28"},{"Company Name":"Microsoft Corporation","Symbol":"MSFT","Current Price":"442.32","Latest MA":"426.95","Price Target":509.0436,"Difference from MA":"3.60%","Difference from Open":"-0.98%","Change from Yesterday":"-1.19%","Change from Last Report":"-1.09","Latest Volume":"1,656,168","Market Cap":"3,288,596,217,856","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":29.50734,"PB Ratio":11.431525,"ROE":0.35604,"DTE":33.657,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.904,"Trailing PEG":2.3466,"Trailing PE":36.495052,"Trailing PS":12.9375515,"Quick Ratio":1.163,"Day High":446.88,"Day Low":442.07,"VS Average Volume":0.075503707,"Company Summary":"Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services. This segment also provides LinkedIn; and dynamics business solutions, including Dynamics 365, a set of intelligent, cloud-based applications across ERP, CRM, power apps, and power automate; and on-premises ERP and CRM applications. The Intelligent Cloud segment offers server products and cloud services, such as azure and other cloud services; SQL and windows server, visual studio, system center, and related client access licenses, as well as nuance and GitHub; and enterprise services including enterprise support services, industry solutions, and nuance professional services. The More Personal Computing segment offers Windows, including windows OEM licensing and other non-volume licensing of the Windows operating system; Windows commercial comprising volume licensing of the Windows operating system, windows cloud services, and other Windows commercial offerings; patent licensing; and windows Internet of Things; and devices, such as surface, HoloLens, and PC accessories. Additionally, this segment provides gaming, which includes Xbox hardware and content, and first- and third-party content; Xbox game pass and other subscriptions, cloud gaming, advertising, third-party disc royalties, and other cloud services; and search and news advertising, which includes Bing, Microsoft News and Edge, and third-party affiliates. The company sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online, and retail stores. The company was founded in 1975 and is headquartered in Redmond, Washington.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"29-01-2025 16:45:28"}]