[{"Company Name":"Dayforce, Inc.","Symbol":"DAY","Current Price":"67.95","Latest MA":"64.98","Price Target":83.17333,"Difference from MA":"4.58%","Difference from Open":"1.37%","Change from Yesterday":"-5.28%","Change from Last Report":"-0.03","Latest Volume":"2,689,866","Market Cap":"10,715,714,560","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":24.917765,"PB Ratio":4.194962,"Previous Close":71.74,"ROE":0.02194,"DTE":48.404,"Industry":"Software - Application","Sector":"Technology","Beta":1.271,"Trailing PEG":null,"Trailing PE":199.85294,"Trailing PS":6.323821,"Quick Ratio":0.175,"Day High":68.1,"Day Low":63.07,"VS Average Volume":1.7915658999,"Company Summary":"Dayforce Inc., together with its subsidiaries, operates as a human capital management (HCM) software company in the United States, Canada, and internationally. It offers Dayforce, a cloud HCM platform that provides human resources, payroll and tax, workforce management, wallet, benefits, and talent intelligence functionalities; and Powerpay, a cloud HR and payroll solution for the small business market. The company also provides payroll and payroll-related services; and implementation and professional services. It sells its solutions through direct sales force and third-party channels. The company was formerly known as Ceridian HCM Holding Inc. and changed its name to Dayforce Inc. in February 2024. Dayforce Inc. was founded in 1992 and is headquartered in Minneapolis, Minnesota.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"05-02-2025 18:51:44"},{"Company Name":"New York Times Company (The)","Symbol":"NYT","Current Price":"49.91","Latest MA":"53.82","Price Target":57.12333,"Difference from MA":"-7.27%","Difference from Open":"-6.27%","Change from Yesterday":"-10.68%","Change from Last Report":"0.00","Latest Volume":"2,656,327","Market Cap":"8,182,944,256","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":21.483763,"PB Ratio":4.421901,"Previous Close":55.89,"ROE":0.15986,"DTE":"N\/A","Industry":"Publishing","Sector":"Communication Services","Beta":1.019,"Trailing PEG":null,"Trailing PE":29.532543,"Trailing PS":3.2613,"Quick Ratio":1.157,"Day High":53.56,"Day Low":48.35,"VS Average Volume":1.876557365,"Company Summary":"The New York Times Company, together with its subsidiaries, creates, collects, and distributes news and information worldwide. The company operates through two segments, The New York Times Group and The Athletic. It offers The New York Times (The Times) through company's mobile application, website, printed newspaper, and associated content, such as podcast. The company also offers The Athletic, a sports media product; Cooking, a recipe product; Games, a puzzle games product; and Audio, an audio product. In addition, it offers a portfolio of advertising products and services to advertisers, such as luxury goods, technology, and financial companies, to promote products, services or brands on digital platforms in the form of display ads, audio and video, in print in the form of column-inch ads, and at live events; and Wirecutter, a product review and recommendation product. Further, the company licenses content to digital aggregators in the business, professional, academic and library markets, and third-party digital platforms; articles, graphics, and photographs, including newspapers, magazines, and websites; and for use in television, films, and books, as well as provide rights to reprint articles, and create and sell new digests. Additionally, it engages in commercial printing and distribution for third parties; and operates the NYTimes.com website. The company was founded in 1851 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"05-02-2025 18:51:44"},{"Company Name":"Fiserv, Inc.","Symbol":"FI","Current Price":"227.93","Latest MA":"188.61","Price Target":234.87941,"Difference from MA":"20.85%","Difference from Open":"1.57%","Change from Yesterday":"6.42%","Change from Last Report":"0.12","Latest Volume":"2,415,546","Market Cap":"129,673,699,328","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":19.092093,"PB Ratio":4.681633,"Previous Close":214.22,"ROE":0.10618,"DTE":89.406,"Industry":"Information Technology Services","Sector":"Technology","Beta":0.919,"Trailing PEG":1.4412,"Trailing PE":44.00193,"Trailing PS":6.4443746,"Quick Ratio":0.215,"Day High":231.2099,"Day Low":221.7,"VS Average Volume":0.8989861059,"Company Summary":"Fiserv, Inc., together with its subsidiaries, provides payments and financial services technology services in the United States, Europe, the Middle East and Africa, Latin America, the Asia-Pacific, and internationally. It operates through Merchant Acceptance, Financial Technology, and Payments and Network segments. The Merchant Acceptance segment provides merchant acquiring and digital commerce services; mobile payment services; security and fraud protection products; Clover, a cloud based POS and integrated commerce operating system for small and mid-sized businesses and independent software vendors; and Carat, an integrated operating system for large businesses. This segment distributes through various channels, including direct sales teams, strategic partnerships with agent sales forces, independent software vendors, financial institutions, and other strategic partners in the form of joint venture alliances, revenue sharing alliances, and referral agreement. The Financial Technology segment offers customer deposit and loan accounts, as well as manages an institution's general ledger and central information files. This segment also provides digital banking, financial and risk management, professional services and consulting, check processing, and other products and services. The Payments and Network segment offers card transactions, such as debit, credit, and prepaid card processing and services; funds access, debit payments, cardless ATM access, and surcharge-free ATM network; security and fraud protection products; card production; print services; and various network services, as well as non-card digital payment software and services, including bill payment, account-to-account transfers, person-to-person payments, electronic billing, and security and fraud protection products. It serves merchants, banks, credit unions, other financial institutions, and corporate clients. Fiserv, Inc. was incorporated in 1984 and is headquartered in Milwaukee, Wisconsin.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"05-02-2025 18:51:44"},{"Company Name":"Uber Technologies, Inc.","Symbol":"UBER","Current Price":"65.27","Latest MA":"70.27","Price Target":88.6338,"Difference from MA":"-7.12%","Difference from Open":"-1.85%","Change from Yesterday":"-6.41%","Change from Last Report":"0.02","Latest Volume":"43,054,894","Market Cap":"137,433,366,528","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":16.120483,"PB Ratio":9.291999,"Previous Close":69.75,"ROE":0.34326,"DTE":80.343,"Industry":"Software - Application","Sector":"Technology","Beta":1.337,"Trailing PEG":0.7384,"Trailing PE":32.15123,"Trailing PS":3.2757328,"Quick Ratio":1.223,"Day High":66.75,"Day Low":63.65,"VS Average Volume":1.6903853448,"Company Summary":"Uber Technologies, Inc. develops and operates proprietary technology applications in the United States, Canada, Latin America, Europe, the Middle East, Africa, and Asia excluding China and Southeast Asia. It operates through three segments: Mobility, Delivery, and Freight. The Mobility segment connects consumers with a range of transportation modalities, such as ridesharing, carsharing, micromobility, rentals, public transit, taxis, and other modalities; and offers riders in a variety of vehicle types, as well as financial partnerships products and advertising services. The Delivery segment allows to search for and discover restaurants to grocery, alcohol, convenience, and other retails; order a meal or other items; and Uber direct, a white-label Delivery-as-a-Service for retailers and restaurants, as well as advertising. The Freight segment manages transportation and logistics network, which connects shippers and carriers in digital marketplace including carriers upfronts, pricing, and shipment booking; and provides on-demand platform to automate logistics end-to-end transactions for small-and medium-sized business to global enterprises. The company was formerly known as Ubercab, Inc. and changed its name to Uber Technologies, Inc. in February 2011. Uber Technologies, Inc. was founded in 2009 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"05-02-2025 18:51:44"},{"Company Name":"Corteva, Inc.","Symbol":"CTVA","Current Price":"64.85","Latest MA":"57.49","Price Target":67.09091,"Difference from MA":"12.81%","Difference from Open":"2.35%","Change from Yesterday":"-1.29%","Change from Last Report":"0.11","Latest Volume":"2,020,548","Market Cap":"44,570,947,584","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.34076,"PB Ratio":1.8067086,"Previous Close":65.7,"ROE":0.02704,"DTE":22.883,"Industry":"Agricultural Inputs","Sector":"Basic Materials","Beta":0.773,"Trailing PEG":1.3118,"Trailing PE":67.552086,"Trailing PS":2.6790257,"Quick Ratio":0.88,"Day High":65.01,"Day Low":63.18,"VS Average Volume":0.5791845917,"Company Summary":"Corteva, Inc. operates in the agriculture business. It operates through two segments, Seed and Crop Protection. The Seed segment develops and supplies advanced germplasm and traits that produce optimum yield for farms. It offers trait technologies that enhance resistance to weather, disease, insects, and herbicides used to control weeds, as well as food and nutritional characteristics. This segment also provides digital solutions that assist farmer decision-making with a view to optimize product selection, and maximize yield and profitability. The Crop Protection segment offers products that protect against weeds, insects and other pests, and diseases, as well as enhances crop health above and below ground through nitrogen management and seed-applied technologies. This segment provides herbicides, insecticides, nitrogen stabilizers, and pasture and range management herbicides. It serves agricultural input industry. The company operates in the United States, Canada, Latin America, the Asia Pacific, Europe, the Middle East, and Africa. Corteva, Inc. was incorporated in 2018 and is headquartered in Indianapolis, Indiana.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"05-02-2025 18:51:44"},{"Company Name":"Stanley Black & Decker, Inc.","Symbol":"SWK","Current Price":"84.81","Latest MA":"92.19","Price Target":101.73,"Difference from MA":"-8.00%","Difference from Open":"2.18%","Change from Yesterday":"-2.13%","Change from Last Report":"0.00","Latest Volume":"2,270,405","Market Cap":"13,075,018,752","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":12.404043,"PB Ratio":1.4757168,"Previous Close":86.66,"ROE":-0.02031,"DTE":79.081,"Industry":"Tools & Accessories","Sector":"Industrials","Beta":1.255,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.85003734,"Quick Ratio":0.34,"Day High":84.915,"Day Low":82.087,"VS Average Volume":1.3051807583,"Company Summary":"Stanley Black & Decker, Inc. provides hand tools, power tools, outdoor products, and related accessories in the United States, Canada, Other Americas, Europe, and Asia. Its Tools & Outdoor segment offers professional grade corded and cordless electric power tools and equipment, including drills, impact wrenches and drivers, grinders, saws, routers, and sanders; pneumatic tools and fasteners, such as nail guns, nails, staplers and staples, and concrete and masonry anchors; corded and cordless electric power tools; hand-held vacuums, paint tools, and cleaning appliances; leveling and layout tools, planes, hammers, demolition tools, clamps, vises, knives, saws, chisels, and industrial and automotive tools; drill, screwdriver, router bits, abrasives, saw blades, and threading products; tool boxes, sawhorses, medical cabinets, and engineered storage solutions; and electric and gas-powered lawn and garden products. This segment sells its products under the DEWALT, CRAFTSMAN, CUB ADET, BLACK+DECKER, and HUSTLER brands through retailers, third-party distributors, independent dealers, and a direct sales force. The company's Industrial segment provides threaded fasteners, blind rivets and tools, blind inserts and tools, drawn arc weld studs and systems, engineered plastic and mechanical fasteners, self-piercing riveting systems, precision nut running systems, micro fasteners, high-strength structural fasteners, axel swage, latches, heat shields, pins, couplings, fitting, and other engineered products; and attachments used on excavators and handheld tools. This segment sells its products through direct sales force and third-party distributors to the automotive, manufacturing, electronics, construction, aerospace, and other industries. The company was formerly known as The Stanley Works and changed its name to Stanley Black & Decker, Inc. in March 2010. Stanley Black & Decker, Inc. was founded in 1843 and is headquartered in New Britain, Connecticut.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"05-02-2025 18:51:44"},{"Company Name":"Johnson Controls International ","Symbol":"JCI","Current Price":"86.43","Latest MA":"75.52","Price Target":88.53333,"Difference from MA":"14.44%","Difference from Open":"-0.78%","Change from Yesterday":"11.83%","Change from Last Report":"0.18","Latest Volume":"5,205,762","Market Cap":"57,055,813,632","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":21.218824,"PB Ratio":3.5719304,"Previous Close":77.29,"ROE":0.0805,"DTE":54.68,"Industry":"Building Products & Equipment","Sector":"Industrials","Beta":1.306,"Trailing PEG":1.318,"Trailing PE":41.552887,"Trailing PS":2.4858756,"Quick Ratio":0.557,"Day High":88.9,"Day Low":85.41,"VS Average Volume":1.3908264842,"Company Summary":"Johnson Controls International plc, together with its subsidiaries, engages in engineering, manufacturing, commissioning, and retrofitting building products and systems in the United States, Europe, the Asia Pacific, and internationally. It operates through four segments: Building Solutions North America, Building Solutions EMEA\/LA, Building Solutions Asia Pacific, and Global Products. The company designs, sells, installs, and services heating, ventilating, air conditioning, controls, building management, refrigeration, integrated electronic security, integrated fire detection and suppression systems, and fire protection and security products. It also provides energy efficiency solutions and technical services, including inspection, scheduled maintenance, and repair and replacement of mechanical and control systems, as well as data-driven smart building solutions. In addition, the company offers control software and software services. It sells its products and services to commercial, institutional, industrial, data center, and governmental customers. Johnson Controls International plc was incorporated in 1885 and is headquartered in Cork, Ireland.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"05-02-2025 18:51:44"},{"Company Name":"Ares Capital Corporation","Symbol":"ARCC","Current Price":"22.87","Latest MA":"20.93","Price Target":22.82143,"Difference from MA":"9.27%","Difference from Open":"-2.64%","Change from Yesterday":"-3.91%","Change from Last Report":"-0.11","Latest Volume":"8,330,877","Market Cap":"15,338,359,808","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":10.59164,"PB Ratio":1.1566863,"Previous Close":23.81,"ROE":0.1338,"DTE":106.255,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.054,"Trailing PEG":null,"Trailing PE":8.796154,"Trailing PS":5.2206807,"Quick Ratio":1.29,"Day High":23.5759,"Day Low":22.46,"VS Average Volume":1.8498035485,"Company Summary":"Ares Capital Corporation is a business development company specializing in acquisition, recapitalization, mezzanine debt, restructurings, rescue financing, and leveraged buyout transactions of middle market companies. It also makes growth capital and general refinancing. It prefers to make investments in companies engaged in the basic and growth manufacturing, business services, consumer products, health care products and services, and information technology service sectors. The fund will also consider investments in industries such as restaurants, retail, oil and gas, and technology sectors. It focuses on investments in Northeast, Mid-Atlantic, Southeast and Southwest regions from its New York office, the Midwest region, from the Chicago office, and the Western region from the Los Angeles office. The fund typically invests between $20 million and $200 million and a maximum of $400 million in companies with an EBITDA between $10 million and $250 million. It makes debt investments between $10 million and $100 million The fund invests through revolvers, first lien loans, warrants, unitranche structures, second lien loans, mezzanine debt, private high yield, junior capital, subordinated debt, and non-control preferred and common equity. The fund also selectively considers third-party-led senior and subordinated debt financings and opportunistically considers the purchase of stressed and discounted debt positions. The fund prefers to be an agent and\/or lead the transactions in which it invests. The fund also seeks board representation in its portfolio companies.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"05-02-2025 18:51:44"},{"Company Name":"Ford Motor Company","Symbol":"F","Current Price":"10.26","Latest MA":"10.76","Price Target":11.68125,"Difference from MA":"-4.64%","Difference from Open":"0.98%","Change from Yesterday":"0.97%","Change from Last Report":"0.10","Latest Volume":"38,431,057","Market Cap":"40,776,216,576","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":6.167125,"PB Ratio":0.9201794,"Previous Close":10.16,"ROE":0.0799,"DTE":359.359,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":1.636,"Trailing PEG":0.8816,"Trailing PE":11.659091,"Trailing PS":0.2231342,"Quick Ratio":0.942,"Day High":10.31,"Day Low":10.11,"VS Average Volume":0.6248491087,"Company Summary":"Ford Motor Company develops, delivers, and services a range of Ford trucks, commercial cars and vans, sport utility vehicles, and Lincoln luxury vehicles worldwide. It operates through Ford Blue, Ford Model e, and Ford Pro; Ford Next; and Ford Credit segments. The company sells Ford and Lincoln vehicles, service parts, and accessories through distributors and dealers, as well as through dealerships to commercial fleet customers, daily rental car companies, and governments. It also engages in vehicle-related financing and leasing activities to and through automotive dealers. In addition, the company provides retail installment sale contracts for new and used vehicles; and direct financing leases for new vehicles to retail and commercial customers, such as leasing companies, government entities, daily rental companies, and fleet customers. Further, it offers wholesale loans to dealers to finance the purchase of vehicle inventory; and loans to dealers to finance working capital and enhance dealership facilities, purchase dealership real estate, and other dealer vehicle programs. The company was incorporated in 1903 and is based in Dearborn, Michigan.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"05-02-2025 18:51:44"},{"Company Name":"Boston Scientific Corporation","Symbol":"BSX","Current Price":"105.30","Latest MA":"85.80","Price Target":103.49156,"Difference from MA":"22.73%","Difference from Open":"2.29%","Change from Yesterday":"1.69%","Change from Last Report":"-0.14","Latest Volume":"3,683,422","Market Cap":"155,194,310,656","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":32.98769,"PB Ratio":7.492529,"Previous Close":103.54,"ROE":0.08916,"DTE":53.722,"Industry":"Medical Devices","Sector":"Healthcare","Beta":0.797,"Trailing PEG":1.8771,"Trailing PE":87.024796,"Trailing PS":9.753901,"Quick Ratio":0.847,"Day High":107.17,"Day Low":102.44,"VS Average Volume":0.6932346693,"Company Summary":"Boston Scientific Corporation develops, manufactures, and markets medical devices for use in various interventional medical specialties worldwide. It operates through two segments, MedSurg and Cardiovascular. The company offers devices to diagnose and treat gastrointestinal and pulmonary conditions, such as resolution clips, biliary stent systems, stents and electrocautery enhanced delivery systems, direct visualization systems, digital catheters, and single-use duodenoscopes; devices to treat urological conditions, including ureteral stents, catheters, baskets, guidewires, sheaths, balloons, single-use digital flexible ureteroscopes, holmium laser systems, artificial urinary sphincter, laser system, fiber, and hydrogel systems; and devices to treat neurological movement disorders and manage chronic pain, such as spinal cord stimulator system, proprietary programming software, radiofrequency generator, indirect decompression systems, practice optimization tools, and deep brain stimulation system. It also provides technologies for diagnosing and treating coronary artery disease and aortic valve conditions; WATCHMAN FLX, a Left Atrial Appendage Closure Device; and implantable devices that monitor the heart and deliver electricity to treat cardiac abnormalities, such as cardioverter and cardiac resynchronization therapy defibrillators, MRI S-ICD systems, cardiac resynchronization therapy pacemakers, quadripolar LV leads, ICD leads, pacing leads, remote patient management systems, insertable cardiac monitor systems, and remote cardiac monitoring systems. In addition, the company offers diagnosis and treatment of rate and rhythm disorders of the heart; peripheral arterial and venous diseases; and products to diagnose, treat and ease forms of cancer. The company was incorporated in 1979 and is headquartered in Marlborough, Massachusetts.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"05-02-2025 18:51:44"},{"Company Name":"Walt Disney Company (The)","Symbol":"DIS","Current Price":"111.89","Latest MA":"100.05","Price Target":124.56071,"Difference from MA":"11.83%","Difference from Open":"-3.29%","Change from Yesterday":"-1.22%","Change from Last Report":"0.09","Latest Volume":"11,733,102","Market Cap":"202,349,854,720","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":18.354773,"PB Ratio":2.0193596,"Previous Close":113.3,"ROE":0.0546,"DTE":45.188,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.398,"Trailing PEG":0.9948,"Trailing PE":41.136288,"Trailing PS":2.2476325,"Quick Ratio":0.531,"Day High":118.58,"Day Low":110.76,"VS Average Volume":1.2521054461,"Company Summary":"The Walt Disney Company operates as an entertainment company worldwide. It operates through three segments: Entertainment, Sports, and Experiences. The company produces and distributes film and television video streaming content under the ABC Television Network, Disney, Freeform, FX, Fox, National Geographic, and Star brand television channels, as well as ABC television stations and A+E television networks; and produces original content under the ABC Signature, Disney Branded Television, FX Productions, Lucasfilm, Marvel, National Geographic Studios, Pixar, Searchlight Pictures, Twentieth Century Studios, 20th Television, and Walt Disney Pictures banners. It also offers direct-to-consumer streaming services through Disney+, Disney+ Hotstar, Hulu, and Star+; sports-related entertainment services through ESPN, ESPN on ABC, ESPN+ DTC, and Star; sale\/licensing of film and episodic content to third-party television and VOD services; theatrical, home entertainment, and music distribution services; DVD and Blu-ray discs, electronic home video licenses, and VOD rental services; staging and licensing of live entertainment events; and post-production services. In addition, the company operates theme parks and resorts comprising Walt Disney World Resort, Disneyland Resort, Disneyland Paris, Hong Kong Disneyland Resort, Shanghai Disney Resort, Disney Cruise Line, Disney Vacation Club, National Geographic Expeditions, and Adventures by Disney, as well as Aulani, a Disney resort and spa in Hawaii. It also licenses its intellectual property to a third party for operations of the Tokyo Disney Resort; licenses trade names, characters, visual, literary, and other IP for use on merchandise, published materials, and games; operates a direct-to-home satellite distribution platform; sells branded merchandise through retail, online, and wholesale businesses; and develops and publishes books, comic books, and magazines. The company was founded in 1923 and is based in Burbank, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"05-02-2025 18:51:44"}]