[{"Company Name":"State Street Corporation","Symbol":"STT","Current Price":"97.18","Latest MA":"87.02","Price Target":109.8125,"Difference from MA":"11.68%","Difference from Open":"1.59%","Change from Yesterday":"-3.29%","Change from Last Report":"-3.29","Latest Volume":"1,013,609","Market Cap":"28,488,415,232","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":9.069968,"PB Ratio":1.2423774,"ROE":0.0855,"DTE":"N\/A","Industry":"Asset Management","Sector":"Financial Services","Beta":1.48,"Trailing PEG":0.6382,"Trailing PE":15.231975,"Trailing PS":2.270355,"Quick Ratio":"N\/A","Day High":97.435,"Day Low":94.51,"VS Average Volume":0.4908613242,"Company Summary":"State Street Corporation, through its subsidiaries, provides a range of financial products and services to institutional investors worldwide. The company offers investment servicing products and services, including custody, accounting, regulatory reporting, investor, and performance and analytics; middle office products, such as IBOR, transaction management, loans, cash, derivatives and collateral, record keeping, and client reporting and investment analytics; finance leasing; foreign exchange, and brokerage and other trading services; securities finance and enhanced custody products; deposit and short-term investment facilities; investment manager and alternative investment manager operations outsourcing; performance, risk, and compliance analytics; and financial data management to support institutional investors. It also engages in the provision of portfolio management and risk analytics, as well as trading and post-trade settlement services with integrated compliance and managed data. In addition, the company offers investment management strategies and products, such as core and enhanced indexing, multi-asset strategies, active quantitative and fundamental active capabilities, and alternative investment strategies. Further, it provides services and solutions, including environmental, social, and governance investing; defined benefit and defined contribution; and global fiduciary solutions, as well as exchange-traded funds under the SPDR ETF brand. The company provides its products and services to mutual funds, collective investment funds, UCITS, hedge funds and other investment pools, corporate and public retirement plans, insurance companies, foundations, endowments, and investment managers. State Street Corporation was founded in 1792 and is headquartered in Boston, Massachusetts.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"17-01-2025 17:01:23"},{"Company Name":"Citizens Financial Group, Inc.","Symbol":"CFG","Current Price":"47.98","Latest MA":"41.64","Price Target":51.11667,"Difference from MA":"15.21%","Difference from Open":"3.65%","Change from Yesterday":"2.52%","Change from Last Report":"-0.08","Latest Volume":"1,328,558","Market Cap":"21,144,834,048","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":12.493197,"PB Ratio":0.9360855,"ROE":0.05426,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.32,"Trailing PEG":null,"Trailing PE":18.815687,"Trailing PS":2.971867,"Quick Ratio":"N\/A","Day High":48.25,"Day Low":45.9,"VS Average Volume":0.3293247613,"Company Summary":"Citizens Financial Group, Inc. operates as the bank holding company that provides retail and commercial banking products and services to individuals, small businesses, middle-market companies, corporations, and institutions in the United States. The company operates in two segments, Consumer Banking and Commercial Banking. The Consumer Banking segment offers deposit products, mortgage and home equity lending products, credit cards, business loans, wealth management, and investment services; and auto, education, and point-of-sale finance loans, as well as digital deposit products. This segment serves its customers through telephone service centers, as well as through its online and mobile platforms. The Commercial Banking segment provides various financial products and solutions, including lending and leasing, deposit and treasury management services, foreign exchange, and interest rate and commodity risk management solutions, as well as syndicated loans, corporate finance, mergers and acquisitions, and debt and equity capital markets services. This segment serves corporate banking, healthcare, technology, asset finance, franchise finance, leasing, asset-based lending, commercial real estate, mid-corporate, and private equity sponsor industries. The company was formerly known as RBS Citizens Financial Group, Inc. and changed its name to Citizens Financial Group, Inc. in April 2014. Citizens Financial Group, Inc. was founded in 1828 and is headquartered in Providence, Rhode Island.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"17-01-2025 17:01:23"},{"Company Name":"Huntington Bancshares Incorpora","Symbol":"HBAN","Current Price":"16.93","Latest MA":"15.03","Price Target":18.6605,"Difference from MA":"12.67%","Difference from Open":"-0.27%","Change from Yesterday":"0.56%","Change from Last Report":"0.06","Latest Volume":"6,467,511","Market Cap":"24,603,336,704","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":11.083695,"PB Ratio":1.3509094,"ROE":0.08545,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.057,"Trailing PEG":2.881,"Trailing PE":16.441748,"Trailing PS":3.677629,"Quick Ratio":"N\/A","Day High":17.0599,"Day Low":16.625,"VS Average Volume":0.4409011752,"Company Summary":"Huntington Bancshares Incorporated operates as the bank holding company for The Huntington National Bank that provides commercial, consumer, and mortgage banking services in the United States. The company offers financial products and services to consumer and business customers, including deposits, lending, payments, mortgage banking, dealer financing, investment management, trust, brokerage, insurance, and other financial products and services. It also provides 24-hour grace, asterisk-free checking, money scout, $50 safety zone, standby cash, early pay, instant access, savings goal getter, and Huntington heads up; digitally powered consumer and business financial solutions to consumer lending, regional banking, branch banking, and wealth management customers; direct and indirect consumer loans, as well as dealer finance loans and deposits; and private banking, wealth management and legacy planning through investment and portfolio management, fiduciary administration and trust, institutional custody, and full-service retail brokerage investment services. The company offers equipment financing, asset-based lending, distribution finance, structured lending, and municipal financing solutions, as well as Huntington ChoicePay. In addition, it offers lending, liquidity, treasury management and other payment services, and capital markets; government and non-profits, healthcare, technology and telecommunications, franchises, financial sponsors, and global services; and corporate risk management, institutional sales and trading, debt and equity issuance, and additional advisory services. The company offers its products through a network of channels, including branches and ATMs, online and mobile banking, and through customer call centers to customers in middle market banking, corporate, specialty, and government banking, asset finance, commercial real estate banking, and capital markets. The company was founded in 1866 and is headquartered in Columbus, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"17-01-2025 17:01:23"},{"Company Name":"Schlumberger N.V.","Symbol":"SLB","Current Price":"43.66","Latest MA":"42.84","Price Target":53.72767,"Difference from MA":"1.93%","Difference from Open":"3.58%","Change from Yesterday":"6.28%","Change from Last Report":"0.34","Latest Volume":"6,438,277","Market Cap":"61,654,470,656","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":12.747482,"PB Ratio":2.8661458,"ROE":0.21722999,"DTE":57.141,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.532,"Trailing PEG":1.8117,"Trailing PE":14.038586,"Trailing PS":1.712862,"Quick Ratio":1.003,"Day High":43.82,"Day Low":41.61,"VS Average Volume":0.5297796506,"Company Summary":"Schlumberger Limited engages in the provision of technology for the energy industry worldwide. The company operates through four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company provides field development and hydrocarbon production, carbon management, and integration of adjacent energy systems; reservoir interpretation and data processing services for exploration data; and well construction and production improvement services and products. It also offers subsurface geology and fluids evaluation information; open and cased hole services; exploration and production pressure, and flow-rate measurement services; and pressure pumping, well stimulation, and coiled tubing equipment solutions. In addition, the company offers mud logging, directional drilling, measurement-while-drilling, and logging-while-drilling services, as well as engineering support services; supplies drilling fluid systems; designs, manufactures, and markets roller cone and fixed cutter drill bits; bottom-hole-assembly and borehole enlargement technologies; well cementing products and services; well planning, well drilling, engineering, supervision, logistics, procurement, and contracting of third parties, as well as drilling rig management solutions; and drilling equipment and services, as well as land drilling rigs and related services. Further, it provides artificial lift production equipment and optimization services; supplies packers, safety valves, sand control technology, and various intelligent well completions technology and equipment; designs and manufactures valves, chokes, actuators, and surface trees; and OneSubsea, an integrated solutions, products, systems, and services, including wellheads, subsea trees, manifolds and flowline connectors, control systems, connectors, and services. The company was formerly known as Socie´te´ de Prospection E´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"17-01-2025 17:01:23"},{"Company Name":"Fastenal Company","Symbol":"FAST","Current Price":"73.59","Latest MA":"71.93","Price Target":75.93583,"Difference from MA":"2.32%","Difference from Open":"-3.58%","Change from Yesterday":"-1.57%","Change from Last Report":"0.46","Latest Volume":"2,158,517","Market Cap":"42,161,545,216","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":31.027737,"PB Ratio":11.720816,"ROE":0.32698002,"DTE":14.644,"Industry":"Industrial Distribution","Sector":"Industrials","Beta":0.979,"Trailing PEG":4.0674,"Trailing PE":36.61443,"Trailing PS":5.636495,"Quick Ratio":2.013,"Day High":76.39,"Day Low":72.52,"VS Average Volume":0.7965036771,"Company Summary":"Fastenal Company, together with its subsidiaries, engages in the wholesale distribution of industrial and construction supplies in the United States, Canada, Mexico, North America, and internationally. It offers fasteners, and related industrial and construction supplies under the Fastenal name. The company's fastener products include threaded fasteners, bolts, nuts, screws, studs, and related washers that are used in manufactured products and construction projects, as well as in the maintenance and repair of machines. It also offers miscellaneous supplies and hardware, including pins, machinery keys, concrete anchors, metal framing systems, wire ropes, strut products, rivets, and related accessories. The company serves the manufacturing market comprising original equipment manufacturers; maintenance, repair, and operations customers; non-residential construction market; farmers, truckers, railroads, mining companies, schools, and retail trades; and oil exploration, production, and refinement companies, as well as federal, state, and local governmental entities. Fastenal Company was founded in 1967 and is headquartered in Winona, Minnesota.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"17-01-2025 17:01:23"},{"Company Name":"Regions Financial Corporation","Symbol":"RF","Current Price":"24.33","Latest MA":"22.77","Price Target":27.41955,"Difference from MA":"6.85%","Difference from Open":"-3.14%","Change from Yesterday":"-0.77%","Change from Last Report":"-0.02","Latest Volume":"2,156,943","Market Cap":"22,112,661,504","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":9.853194,"PB Ratio":1.3061684,"ROE":0.10042,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.182,"Trailing PEG":4.7518,"Trailing PE":13.745763,"Trailing PS":3.372889,"Quick Ratio":"N\/A","Day High":24.98,"Day Low":24.25,"VS Average Volume":0.2686550823,"Company Summary":"Regions Financial Corporation, a financial holding company, provides banking and bank-related services to individual and corporate customers. It operates through three segments: Corporate Bank, Consumer Bank, and Wealth Management. The Corporate Bank segment offers commercial banking services, such as commercial and industrial, commercial real estate, and investor real estate lending; equipment lease financing; deposit products; and securities underwriting and placement, loan syndication and placement, foreign exchange, derivatives, merger and acquisition, and other advisory services. It serves corporate, middle market, and commercial real estate developers and investors. The Consumer Bank segment provides consumer banking products and services related to residential first mortgages, home equity lines and loans, consumer credit cards, and other consumer loans, as well as deposits. The Wealth Management segment offers credit related products, and retirement and savings solutions; and trust and investment management, asset management, and estate planning services to individuals, businesses, governmental institutions, and non-profit entities. It also provides investment and insurance products; low-income housing tax credit corporate fund syndication services; and other specialty financing services. The company was founded in 1971 and is headquartered in Birmingham, Alabama.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"17-01-2025 17:01:23"},{"Company Name":"Truist Financial Corporation","Symbol":"TFC","Current Price":"47.55","Latest MA":"42.56","Price Target":50.033,"Difference from MA":"11.73%","Difference from Open":"1.13%","Change from Yesterday":"5.71%","Change from Last Report":"0.13","Latest Volume":"3,620,756","Market Cap":"63,123,574,784","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":10.443847,"PB Ratio":1.0694766,"ROE":-0.09505,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.035,"Trailing PEG":1.9441,"Trailing PE":"N\/A","Trailing PS":4.354251,"Quick Ratio":"N\/A","Day High":47.745,"Day Low":46.55,"VS Average Volume":0.4699142469,"Company Summary":"Truist Financial Corporation, a financial services company, provides banking and trust services in the Southeastern and Mid-Atlantic United States. The company operates through three segments: Consumer Banking and Wealth, Corporate and Commercial Banking, and Insurance Holdings.Its deposit products include noninterest-bearing checking, interest-bearing checking, savings, and money market deposit accounts, as well as certificates of deposit and individual retirement accounts. The company also provides funding; asset management; automobile lending; credit card lending; consumer finance; home equity and mortgage lending; other direct retail lending; insurance; investment brokerage; mobile\/online banking; payment solutions; point-of-sale lending; retail and small business deposit products; small business lending; and wealth management\/private banking services. In addition, it offers asset based lending, investment banking and capital market, institutional trust, insurance premium finance, derivatives, commercial lending, international banking, leasing, merchant, commercial deposit and treasury, floor plan, mortgage warehouse lending, real estate lending, and supply chain financing services. Further, the company provides insurance brokerage, retail and wholesale brokerage, securities underwriting and market making, loan syndication, and investment management and advisory services. The company was formerly known as BB&T Corporation and changed its name to Truist Financial Corporation in December 2019. Truist Financial Corporation was founded in 1872 and is headquartered in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"17-01-2025 17:01:23"},{"Company Name":"UnitedHealth Group Incorporated","Symbol":"UNH","Current Price":"514.06","Latest MA":"555.32","Price Target":637.3546,"Difference from MA":"-7.43%","Difference from Open":"1.67%","Change from Yesterday":"0.68%","Change from Last Report":"-0.16","Latest Volume":"1,651,048","Market Cap":"473,081,217,024","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":15.306078,"PB Ratio":5.019088,"ROE":0.15252,"DTE":74.683,"Industry":"Healthcare Plans","Sector":"Healthcare","Beta":0.591,"Trailing PEG":1.5042,"Trailing PE":33.12242,"Trailing PS":1.2010247,"Quick Ratio":0.833,"Day High":516.4,"Day Low":503.39,"VS Average Volume":0.3517511949,"Company Summary":"UnitedHealth Group Incorporated operates as a diversified health care company in the United States. The company operates through four segments: UnitedHealthcare, Optum Health, Optum Insight, and Optum Rx. The UnitedHealthcare segment offers consumer-oriented health benefit plans and services for national employers, public sector employers, mid-sized employers, small businesses, and individuals; health care coverage, and health and well-being services to individuals age 50 and older addressing their needs; Medicaid plans, children's health insurance and health care programs; and health and dental benefits, and hospital and clinical services, as well as health care benefits products and services to state programs caring for the economically disadvantaged, medically underserved, and those without the benefit of employer-funded health care coverage. The Optum Health segment provides care delivery, care management, wellness and consumer engagement, and health financial services patients, consumers, care delivery systems, providers, employers, payers, and public-sector entities. The Optum Insight segment offers software and information products, advisory consulting arrangements, and managed services outsourcing contracts to hospital systems, physicians, health plans, governments, life sciences companies, and other organizations. The Optum Rx segment provides pharmacy care services and programs, including retail network contracting, home delivery, specialty and community health pharmacy services, infusion, and purchasing and clinical capabilities, as well as develops programs in the areas of step therapy, formulary management, drug adherence, and disease\/drug therapy management. UnitedHealth Group Incorporated was founded in 1974 and is based in Minnetonka, Minnesota.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"17-01-2025 17:01:23"},{"Company Name":"Bank of America Corporation","Symbol":"BAC","Current Price":"46.74","Latest MA":"41.84","Price Target":50.80136,"Difference from MA":"11.71%","Difference from Open":"0.28%","Change from Yesterday":"0.21%","Change from Last Report":"0.10","Latest Volume":"8,539,914","Market Cap":"355,731,603,456","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.809411,"PB Ratio":1.3214216,"ROE":0.08092,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.325,"Trailing PEG":2.0868,"Trailing PE":14.560748,"Trailing PS":3.7593431,"Quick Ratio":"N\/A","Day High":46.76,"Day Low":46.08,"VS Average Volume":0.2473390654,"Company Summary":"Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. It operates in four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, non-interest and interest-bearing checking accounts, and investment accounts and products; credit and debit cards; residential mortgages, and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research, and certain market-based services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"17-01-2025 17:01:23"},{"Company Name":"U.S. Bancorp","Symbol":"USB","Current Price":"48.16","Latest MA":"45.47","Price Target":56.87318,"Difference from MA":"5.91%","Difference from Open":"-1.28%","Change from Yesterday":"0.26%","Change from Last Report":"0.17","Latest Volume":"3,111,691","Market Cap":"75,121,795,072","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":9.906724,"PB Ratio":1.4438846,"ROE":0.09779,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.04,"Trailing PEG":1.2382,"Trailing PE":12.705805,"Trailing PS":3.0173032,"Quick Ratio":"N\/A","Day High":48.605,"Day Low":47.41,"VS Average Volume":0.4061286355,"Company Summary":"U.S. Bancorp, a financial services holding company, provides various financial services to individuals, businesses, institutional organizations, governmental entities, and other financial institutions in the United States. It operates through Wealth, Corporate, Commercial and Institutional Banking; Consumer and Business Banking; Payment Services; and Treasury and Corporate Support segments. The company offers depository services, including checking accounts, savings accounts, and time certificate contracts; and lending services, such as traditional credit products and credit card services, lease financing and import\/export trade, asset-backed lending, agricultural finance, and other products. It also provides ancillary services comprising capital markets, treasury management, and receivable lock-box collection services to corporate and governmental entity customers. In addition, the company offers asset management and fiduciary services for individuals, estates, foundations, business corporations, and charitable organizations. Further, it provides investment and insurance products to its customers principally within its domestic markets, as well as fund administration services to mutual and other funds. Additionally, the company provides corporate and purchasing card, and corporate trust services. Furthermore, it offers trust and investment management, merchant and ATM processing, mortgage banking, insurance, and brokerage and leasing services. U.S. Bancorp was founded in 1863 and is headquartered in Minneapolis, Minnesota.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"17-01-2025 17:01:23"},{"Company Name":"Morgan Stanley","Symbol":"MS","Current Price":"136.01","Latest MA":"111.28","Price Target":133.94118,"Difference from MA":"22.22%","Difference from Open":"-0.11%","Change from Yesterday":"0.15%","Change from Last Report":"0.07","Latest Volume":"2,213,700","Market Cap":"218,567,278,592","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":14.71493,"PB Ratio":2.3350875,"ROE":0.11079001,"DTE":405.772,"Industry":"Capital Markets","Sector":"Financial Services","Beta":1.336,"Trailing PEG":3.7088,"Trailing PE":17.129662,"Trailing PS":3.7501678,"Quick Ratio":1.83,"Day High":136.32,"Day Low":134.5297,"VS Average Volume":0.3365519397,"Company Summary":"Morgan Stanley, a financial holding company, provides various financial products and services to corporations, governments, financial institutions, and individuals in the Americas, Europe, the Middle East, Africa, and Asia. It operates through Institutional Securities, Wealth Management, and Investment Management segments. The Institutional Securities segment offers capital raising and financial advisory services, including services related to the underwriting of debt, equity, and other securities, as well as advice on mergers and acquisitions, restructurings, real estate, and project finance. This segment also provides equity and fixed income products comprising sales, financing, prime brokerage, and market-making services; foreign exchange and commodities; corporate and commercial real estate loans, commercial mortgage and secured lending facilities, and financing for sales and trading customers, and asset-backed and mortgage lending; and wealth management services, investment, and research services. The Wealth Management segment offers financial advisor-led brokerage, custody, administrative, and investment advisory services; self-directed brokerage services; financial and wealth planning services; workplace services, including stock plan administration; annuity and insurance products; securities-based lending, residential real estate loans, and other lending products; banking; and retirement plan services to individual investors and small to medium-sized businesses and institutions. The Investment Management segment provides equity, fixed income, alternatives and solutions, and liquidity and overlay services to benefit\/defined contribution plans, foundations, endowments, government entities, sovereign wealth funds, insurance companies, third-party fund sponsors, corporations, and individuals through institutional and intermediary channels. The company was founded in 1924 and is headquartered in New York, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"17-01-2025 17:01:23"},{"Company Name":"Citigroup, Inc.","Symbol":"C","Current Price":"79.01","Latest MA":"64.54","Price Target":87.7355,"Difference from MA":"22.43%","Difference from Open":"0.59%","Change from Yesterday":"0.66%","Change from Last Report":"0.10","Latest Volume":"3,426,701","Market Cap":"148,309,671,936","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.586419,"PB Ratio":0.7753148,"ROE":0.03874,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.426,"Trailing PEG":0.7067,"Trailing PE":13.278993,"Trailing PS":2.1398637,"Quick Ratio":"N\/A","Day High":79.15,"Day Low":78.16,"VS Average Volume":0.2409183368,"Company Summary":"Citigroup Inc., a diversified financial service holding company, provides various financial product and services to consumers, corporations, governments, and institutions worldwide. It operates through five segments: Services, Markets, Banking, U.S. Personal Banking, and Wealth. The Services segment includes Treasury and Trade Solutions, which provides cash management, trade, and working capital solutions to multinational corporations, financial institutions, and public sector organizations; and Securities Services, such as cross-border support for clients, local market expertise, post-trade technologies, data solutions, and various securities services solutions. The Markets segment offers sales and trading services for equities, foreign exchange, rates, spread products, and commodities to corporate, institutional, and public sector clients; and market-making services, including asset classes, risk management solutions, financing, prime brokerage, research, securities clearing, and settlement. The banking segment includes investment banking; advisory services related to mergers and acquisitions, divestitures, restructurings, and corporate defense activities; and corporate lending, which includes corporate and commercial banking. The U.S. Personal Banking segment provides co-branded cards and retail banking services. The Wealth segment provides financial services to high-net-worth clients through banking, lending, mortgages, investment, custody, and trust product offerings; and to professional industries, including law firms, consulting groups, accounting, and asset management. The company was founded in 1812 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"17-01-2025 17:01:23"},{"Company Name":"Wells Fargo & Company","Symbol":"WFC","Current Price":"75.90","Latest MA":"62.49","Price Target":79.76909,"Difference from MA":"21.47%","Difference from Open":"-0.11%","Change from Yesterday":"-0.07%","Change from Last Report":"-0.12","Latest Volume":"3,268,488","Market Cap":"249,630,556,160","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":11.113324,"PB Ratio":1.5421188,"ROE":0.099139996,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.136,"Trailing PEG":3.528,"Trailing PE":14.134079,"Trailing PS":3.2055287,"Quick Ratio":"N\/A","Day High":76.1954,"Day Low":75.67,"VS Average Volume":0.1911208947,"Company Summary":"Wells Fargo & Company, a financial services company, provides diversified banking, investment, mortgage, and consumer and commercial finance products and services in the United States and internationally. The company operates through four segments: Consumer Banking and Lending; Commercial Banking; Corporate and Investment Banking; and Wealth and Investment Management. The Consumer Banking and Lending segment offers diversified financial products and services for consumers and small businesses. Its financial products and services include checking and savings accounts, and credit and debit cards, as well as home, auto, personal, and small business lending services. The Commercial Banking segment provides financial solutions to private, family owned, and certain public companies. Its products and services include banking and credit products across various industry sectors and municipalities, secured lending and lease products, and treasury management services. The Corporate and Investment Banking segment offers a suite of capital markets, banking, and financial products and services, such as corporate banking, investment banking, treasury management, commercial real estate lending and servicing, equity, and fixed income solutions, as well as sales, trading, and research capabilities services to corporate, commercial real estate, government, and institutional clients. The Wealth and Investment Management segment provides personalized wealth management, brokerage, financial planning, lending, private banking, and trust and fiduciary products and services to affluent, high-net worth, and ultra-high-net worth clients. It also operates through financial advisors in brokerage and wealth offices, consumer bank branches, independent offices, and digitally through WellsTrade and Intuitive Investor. The company was founded in 1852 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"17-01-2025 17:01:23"},{"Company Name":"Devon Energy Corporation","Symbol":"DVN","Current Price":"38.45","Latest MA":"40.46","Price Target":49.508,"Difference from MA":"-4.97%","Difference from Open":"0.68%","Change from Yesterday":"0.07%","Change from Last Report":"0.18","Latest Volume":"1,091,488","Market Cap":"25,257,803,776","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":8.257576,"PB Ratio":1.7720528,"ROE":0.26279,"DTE":64.021,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":2.071,"Trailing PEG":14.898,"Trailing PE":7.1203704,"Trailing PS":1.7384405,"Quick Ratio":0.834,"Day High":38.63,"Day Low":38.12,"VS Average Volume":0.1096784262,"Company Summary":"Devon Energy Corporation, an independent energy company, engages in the exploration, development, and production of oil, natural gas, and natural gas liquids in the United States. It operates in Delaware, Eagle Ford, Anadarko, Williston, and Powder River Basins. The company was founded in 1971 and is headquartered in Oklahoma City, Oklahoma.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"17-01-2025 17:01:23"},{"Company Name":"JP Morgan Chase & Co.","Symbol":"JPM","Current Price":"254.16","Latest MA":"219.91","Price Target":262.4343,"Difference from MA":"15.57%","Difference from Open":"0.01%","Change from Yesterday":"-0.04%","Change from Last Report":"0.10","Latest Volume":"2,996,049","Market Cap":"711,038,009,344","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.202685,"PB Ratio":2.207208,"ROE":0.16216,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.091,"Trailing PEG":4.9626,"Trailing PE":12.862349,"Trailing PS":4.385117,"Quick Ratio":"N\/A","Day High":255.33,"Day Low":252.65,"VS Average Volume":0.3311147022,"Company Summary":"JPMorgan Chase & Co. operates as a financial services company worldwide. It operates through three segments: Consumer & Community Banking, Commercial & Investment Bank, and Asset & Wealth Management. It offers deposit, investment and lending products, cash management, and payments and services; mortgage origination and servicing activities; residential mortgages and home equity loans; and credit cards, auto loans, leases, and travel services to consumers and small businesses through bank branches, ATMs, and digital and telephone banking. The company also provides investment banking products and services, including corporate strategy and structure advisory, and equity and debt market capital-raising services, as well as loan origination and syndication; payments; and cash and derivative instruments, risk management solutions, prime brokerage, and research, as well as offers securities services, including custody, fund accounting and administration, and securities lending products for asset managers, insurance companies, and public and private investment funds. In addition, it provides financial solutions, including lending, payments, investment banking, and asset management to small and midsized companies, local governments, nonprofit clients, and large corporations, as well as investors, developers, and owners of multifamily, office, retail, industrial, and affordable housing properties. Further, the company offers multi-asset investment management solutions in equities, fixed income, alternatives, and money market funds to institutional clients and retail investors; and retirement products and services, brokerage, custody, estate planning, lending, deposits, and investment management products to high net worth clients. JPMorgan Chase & Co. was founded in 1799 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"17-01-2025 17:01:23"},{"Company Name":"Walgreens Boots Alliance, Inc.","Symbol":"WBA","Current Price":"13.18","Latest MA":"9.96","Price Target":12.414,"Difference from MA":"32.35%","Difference from Open":"1.13%","Change from Yesterday":"1.91%","Change from Last Report":"0.52","Latest Volume":"3,435,064","Market Cap":"11,387,030,528","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.217557,"PB Ratio":1.0900074,"ROE":-0.75969005,"DTE":277.898,"Industry":"Pharmaceutical Retailers","Sector":"Healthcare","Beta":0.669,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.0771176,"Quick Ratio":0.332,"Day High":13.215,"Day Low":12.9,"VS Average Volume":0.1452398167,"Company Summary":"Walgreens Boots Alliance, Inc. operates as a healthcare, pharmacy, and retail company in the United States, Germany, the United Kingdom, and internationally. It operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The U.S. Retail Pharmacy segment engages in operation of the retail drugstores, health and wellness services, specialty, and home delivery pharmacy services, which offers health and wellness, beauty, personal care and consumables, and general merchandise. The International segment offers sale of prescription drugs and health and wellness, beauty, personal care, and other consumer products outside the United States; and operates pharmacy-led health and beauty retail businesses under the Boots brand stores in the United Kingdom, the Republic of Ireland, and Thailand, as well as the Benavides brand in Mexico and the Ahumada brand in Chile. The U.S. Healthcare segment provides VillageMD, a national provider of value-based care with primary, multi-specialty, and urgent care providers serving patients in traditional clinic settings, in patients' homes and online appointments; Shields, a specialty pharmacy integrator and accelerator for hospitals; and CareCentrix, a participant in the post-acute and home care management sectors. Walgreens Boots Alliance, Inc. was founded in 1909 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"17-01-2025 17:01:23"}]