[{"Company Name":"Verizon Communications Inc.","Symbol":"VZ","Current Price":"40.40","Latest MA":"40.55","Price Target":47.1625,"Difference from MA":"-0.36%","Difference from Open":"2.96%","Change from Yesterday":"3.11%","Change from Last Report":"-0.63","Latest Volume":"4,146,437","Market Cap":"170,069,049,344","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.241148,"PB Ratio":1.76558,"ROE":0.10431,"DTE":182.615,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.418,"Trailing PEG":1.0397,"Trailing PE":17.489178,"Trailing PS":1.2669312,"Quick Ratio":0.51,"Day High":40.68,"Day Low":40.05,"VS Average Volume":0.2165388703,"Company Summary":"Verizon Communications Inc., through its subsidiaries, engages in the provision of communications, technology, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide. It operates in two segments, Verizon Consumer Group (Consumer) and Verizon Business Group (Business). The Consumer segment provides wireless services across the wireless networks in the United States under the Verizon and TracFone brands and through wholesale and other arrangements; and fixed wireless access (FWA) broadband through its wireless networks, as well as related equipment and devices, such as smartphones, tablets, smart watches, and other wireless-enabled connected devices. The segment also offers wireline services in the Mid-Atlantic and Northeastern United States, as well as Washington D.C. through its fiber-optic network, Verizon Fios product portfolio, and a copper-based network. The Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and conferencing, corporate networking, security and managed network, local and long-distance voice, and network access services to deliver various IoT services and products to businesses, government customers, and wireless and wireline carriers in the United States and internationally. The company was formerly known as Bell Atlantic Corporation and changed its name to Verizon Communications Inc. in June 2000. Verizon Communications Inc. was incorporated in 1983 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"24-01-2025 16:34:33"},{"Company Name":"American Airlines Group, Inc.","Symbol":"AAL","Current Price":"16.74","Latest MA":"12.95","Price Target":20.24273,"Difference from MA":"29.29%","Difference from Open":"-0.62%","Change from Yesterday":"-1.70%","Change from Last Report":"0.42","Latest Volume":"2,513,013","Market Cap":"11,007,654,912","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":5.356097,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Airlines","Sector":"Industrials","Beta":1.399,"Trailing PEG":0.2073,"Trailing PE":13.5,"Trailing PS":0.2053169,"Quick Ratio":0.422,"Day High":16.845,"Day Low":16.63,"VS Average Volume":0.0922998013,"Company Summary":"American Airlines Group Inc., through its subsidiaries, operates as a network air carrier. The company provides scheduled air transportation services for passengers and cargo through its hubs in Charlotte, Chicago, Dallas\/Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix, and Washington, D.C., as well as through partner gateways in London, Doha, Madrid, Seattle\/Tacoma, Sydney, and Tokyo. It operates a mainline fleet of 965 aircraft. The company was formerly known as AMR Corporation and changed its name to American Airlines Group Inc. in December 2013. American Airlines Group Inc. was founded in 1926 and is headquartered in Fort Worth, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 16:34:33"},{"Company Name":"Freeport-McMoRan, Inc.","Symbol":"FCX","Current Price":"38.52","Latest MA":"44.28","Price Target":49.18381,"Difference from MA":"-13.01%","Difference from Open":"1.08%","Change from Yesterday":"0.05%","Change from Last Report":"0.05","Latest Volume":"1,056,571","Market Cap":"55,350,546,432","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.890884,"PB Ratio":3.1542745,"ROE":0.16870001,"DTE":33.531,"Industry":"Copper","Sector":"Basic Materials","Beta":1.91,"Trailing PEG":10.0701,"Trailing PE":29.63077,"Trailing PS":2.1587577,"Quick Ratio":1.048,"Day High":38.88,"Day Low":38.5,"VS Average Volume":0.0899207219,"Company Summary":"Freeport-McMoRan Inc. engages in the mining of mineral properties in North America, South America, and Indonesia. It primarily explores for copper, gold, molybdenum, silver, and other metals. The company's assets include the Grasberg minerals district in Indonesia; Morenci, Bagdad, Safford, Sierrita, and Miami in Arizona; Chino and Tyrone in New Mexico; and Henderson and Climax in Colorado, North America, as well as Cerro Verde in Peru and El Abra in Chile. The company was formerly known as Freeport-McMoRan Copper & Gold Inc. and changed its name to Freeport-McMoRan Inc. in July 2014. Freeport-McMoRan Inc. was incorporated in 1987 and is headquartered in Phoenix, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"24-01-2025 16:34:33"},{"Company Name":"CSX Corporation","Symbol":"CSX","Current Price":"32.38","Latest MA":"33.79","Price Target":37.35077,"Difference from MA":"-4.16%","Difference from Open":"0.92%","Change from Yesterday":"-3.83%","Change from Last Report":"-0.03","Latest Volume":"1,378,314","Market Cap":"62,442,242,048","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":14.929914,"PB Ratio":4.829232,"ROE":0.29458,"DTE":147.913,"Industry":"Railroads","Sector":"Industrials","Beta":1.191,"Trailing PEG":2.1553,"Trailing PE":18.089386,"Trailing PS":4.253269,"Quick Ratio":1.195,"Day High":32.55,"Day Low":32.0,"VS Average Volume":0.1122861266,"Company Summary":"CSX Corporation, together with its subsidiaries, provides rail-based freight transportation services. The company offers rail services; and transportation of intermodal containers and trailers, as well as other transportation services, such as rail-to-truck transfers and bulk commodity operations. It also transports chemicals, agricultural and food products, minerals, automotive, forest products, fertilizers, and metals and equipment; and coal, coke, and iron ore to electricity-generating power plants, steel manufacturers, and industrial plants, as well as exports coal to deep-water port facilities. In addition, the company provides intermodal services through a network of approximately 30 terminals transporting manufactured consumer goods in containers; and drayage services, including the pickup and delivery of intermodal shipments. It serves the automotive industry with distribution centers and storage locations, as well as connects non-rail served customers through transferring products, such as plastics and ethanol from rail to trucks. The company operates approximately 20,000 route mile rail network, which serves various population centers in 26 states east of the Mississippi River, the District of Columbia, and the Canadian provinces of Ontario and Quebec, as well as owns and leases approximately 3,500 locomotives. It serves production and distribution facilities through track connections. CSX Corporation was incorporated in 1978 and is headquartered in Jacksonville, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"24-01-2025 16:34:33"},{"Company Name":"Old National Bancorp","Symbol":"ONB","Current Price":"22.87","Latest MA":"19.71","Price Target":27.61111,"Difference from MA":"16.00%","Difference from Open":"-2.47%","Change from Yesterday":"-0.74%","Change from Last Report":"0.00","Latest Volume":"4,620,693","Market Cap":"7,295,072,768","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":8.659698,"PB Ratio":1.1886694,"ROE":0.08922,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.807,"Trailing PEG":null,"Trailing PE":13.613096,"Trailing PS":4.171316,"Quick Ratio":"N\/A","Day High":23.56,"Day Low":22.805,"VS Average Volume":1.5069052873,"Company Summary":"Old National Bancorp operates as the bank holding company for Old National Bank that provides various financial services to individual and commercial customers in the United States. It accepts deposit accounts, including noninterest-bearing demand, interest-bearing checking, negotiable order of withdrawal, savings and money market, and time deposits; and offers loans, such as home equity lines of credit, residential real estate loans, consumer loans, commercial loans, commercial real estate loans, agricultural loans, letters of credit, and lease financing. The company also provides debit and automated teller machine cards, telephone access, online banking, and other electronic and mobile banking services; cash management, private banking, brokerage, trust, investment advisory, and other traditional banking services; wealth management, investment, and foreign currency services; and treasury management, merchant, and capital markets services, as well as community development lending and equity investment solutions. The company was founded in 1834 and is headquartered in Evansville, Indiana.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 16:34:33"},{"Company Name":"Schlumberger N.V.","Symbol":"SLB","Current Price":"42.35","Latest MA":"42.82","Price Target":53.44613,"Difference from MA":"-1.09%","Difference from Open":"0.52%","Change from Yesterday":"0.76%","Change from Last Report":"0.21","Latest Volume":"1,234,778","Market Cap":"59,325,997,056","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":11.142157,"PB Ratio":2.7801483,"ROE":0.21722999,"DTE":57.141,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.532,"Trailing PEG":1.9574,"Trailing PE":13.617363,"Trailing PS":1.6481732,"Quick Ratio":1.003,"Day High":42.42,"Day Low":42.18,"VS Average Volume":0.0966871077,"Company Summary":"Schlumberger Limited engages in the provision of technology for the energy industry worldwide. The company operates through four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company provides field development and hydrocarbon production, carbon management, and integration of adjacent energy systems; reservoir interpretation and data processing services for exploration data; and well construction and production improvement services and products. It also offers subsurface geology and fluids evaluation information; open and cased hole services; exploration and production pressure, and flow-rate measurement services; and pressure pumping, well stimulation, and coiled tubing equipment solutions. In addition, the company offers mud logging, directional drilling, measurement-while-drilling, and logging-while-drilling services, as well as engineering support services; supplies drilling fluid systems; designs, manufactures, and markets roller cone and fixed cutter drill bits; bottom-hole-assembly and borehole enlargement technologies; well cementing products and services; well planning, well drilling, engineering, supervision, logistics, procurement, and contracting of third parties, as well as drilling rig management solutions; and drilling equipment and services, as well as land drilling rigs and related services. Further, it provides artificial lift production equipment and optimization services; supplies packers, safety valves, sand control technology, and various intelligent well completions technology and equipment; designs and manufactures valves, chokes, actuators, and surface trees; and OneSubsea, an integrated solutions, products, systems, and services, including wellheads, subsea trees, manifolds and flowline connectors, control systems, connectors, and services. The company was formerly known as Socie´te´ de Prospection E´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"24-01-2025 16:34:33"},{"Company Name":"Citigroup, Inc.","Symbol":"C","Current Price":"81.49","Latest MA":"65.15","Price Target":88.8355,"Difference from MA":"25.08%","Difference from Open":"-0.62%","Change from Yesterday":"-0.60%","Change from Last Report":"0.02","Latest Volume":"1,505,821","Market Cap":"152,964,874,240","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.811234,"PB Ratio":0.79965067,"ROE":0.03874,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.426,"Trailing PEG":0.8887,"Trailing PE":13.695799,"Trailing PS":2.2070305,"Quick Ratio":"N\/A","Day High":81.54,"Day Low":81.36,"VS Average Volume":0.1027089745,"Company Summary":"Citigroup Inc., a diversified financial service holding company, provides various financial product and services to consumers, corporations, governments, and institutions worldwide. It operates through five segments: Services, Markets, Banking, U.S. Personal Banking, and Wealth. The Services segment includes Treasury and Trade Solutions, which provides cash management, trade, and working capital solutions to multinational corporations, financial institutions, and public sector organizations; and Securities Services, such as cross-border support for clients, local market expertise, post-trade technologies, data solutions, and various securities services solutions. The Markets segment offers sales and trading services for equities, foreign exchange, rates, spread products, and commodities to corporate, institutional, and public sector clients; and market-making services, including asset classes, risk management solutions, financing, prime brokerage, research, securities clearing, and settlement. The banking segment includes investment banking; advisory services related to mergers and acquisitions, divestitures, restructurings, and corporate defense activities; and corporate lending, which includes corporate and commercial banking. The U.S. Personal Banking segment provides co-branded cards and retail banking services. The Wealth segment provides financial services to high-net-worth clients through banking, lending, mortgages, investment, custody, and trust product offerings; and to professional industries, including law firms, consulting groups, accounting, and asset management. The company was founded in 1812 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 16:34:33"},{"Company Name":"Tesla, Inc.","Symbol":"TSLA","Current Price":"416.87","Latest MA":"284.23","Price Target":317.4917,"Difference from MA":"46.67%","Difference from Open":"0.60%","Change from Yesterday":"1.09%","Change from Last Report":"0.13","Latest Volume":"3,056,109","Market Cap":"1,338,177,748,992","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":127.82561,"PB Ratio":19.117216,"ROE":0.20389,"DTE":18.078,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":2.295,"Trailing PEG":4.9332,"Trailing PE":113.588554,"Trailing PS":13.774346,"Quick Ratio":1.214,"Day High":417.8,"Day Low":413.8701,"VS Average Volume":0.0329618186,"Company Summary":"Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners; and provision of service and repairs to its energy product customers, including under warranty, as well as various financing options to its solar customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was incorporated in 2003 and is headquartered in Austin, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"24-01-2025 16:34:33"},{"Company Name":"Meta Platforms, Inc.","Symbol":"META","Current Price":"636.12","Latest MA":"554.61","Price Target":668.18353,"Difference from MA":"14.70%","Difference from Open":"-0.05%","Change from Yesterday":"-0.05%","Change from Last Report":"-0.32","Latest Volume":"1,748,796","Market Cap":"1,605,891,129,344","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":25.00278,"PB Ratio":9.758615,"ROE":0.36134,"DTE":29.811,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.215,"Trailing PEG":1.4153,"Trailing PE":30.020056,"Trailing PS":10.279217,"Quick Ratio":2.568,"Day High":639.61,"Day Low":634.28,"VS Average Volume":0.1363589155,"Company Summary":"Meta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and wearables worldwide. It operates in two segments, Family of Apps and Reality Labs. The Family of Apps segment offers Facebook, which enables people to share, discuss, discover, and connect with interests; Instagram, a community for sharing photos, videos, and private messages, as well as feed, stories, reels, video, live, and shops; Messenger, a messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls; and WhatsApp, a messaging application that is used by people and businesses to communicate and transact privately. The Reality Labs segment provides augmented and virtual reality related products comprising consumer hardware, software, and content that help people feel connected, anytime, and anywhere. The company was formerly known as Facebook, Inc. and changed its name to Meta Platforms, Inc. in October 2021. The company was incorporated in 2004 and is headquartered in Menlo Park, California","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 16:34:33"},{"Company Name":"SoFi Technologies, Inc.","Symbol":"SOFI","Current Price":"18.28","Latest MA":"10.52","Price Target":12.6,"Difference from MA":"73.74%","Difference from Open":"0.66%","Change from Yesterday":"1.39%","Change from Last Report":"0.22","Latest Volume":"3,560,507","Market Cap":"19,836,540,928","Earning Date":"2025-01-27","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":74.61224,"PB Ratio":3.2376907,"ROE":0.037249997,"DTE":54.394,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.613,"Trailing PEG":null,"Trailing PE":152.33334,"Trailing PS":7.8741083,"Quick Ratio":0.47,"Day High":18.33,"Day Low":18.01,"VS Average Volume":0.0695854111,"Company Summary":"SoFi Technologies, Inc. provides various financial services in the United States, Latin America, and Canada. It operates through three segments: Lending, Technology Platform, and Financial Services. The company offers lending and financial services and products that allows its members to borrow, save, spend, invest, and protect money. It offers personal loans, student loans, home loans, and related services. The company also operates Galileo, a technology platform that offers services to financial and non-financial institution; and Technisys, a cloud-native digital and core banking platform with financial services customers. In addition, it provides SoFi Money offers checking and savings accounts, debit cards, and cash management products; and SoFi Invest, a mobile-first investment platform that provides access to trading and advisory solutions, such as investing and robo-advisory. Further, the company offers SoFi Credit Card that provides cash backs on every purchase; Sofi Relay, a personal finance management product that allows to track all of their financial accounts comprising credit score and spending behaviors; SoFi Protect, which offers insurance product; SoFi Travel, an application that manages travel search and booking experience; SoFi At Work provides financial benefits to employees, including student loan payments made on their employees' behalf; Lantern Credit, a financial services marketplace platform for seeking alternative products and provide product comparisons; and other lending as a service that offers pre-qualified borrower referrals and sells loans to third-party partner. The company was founded in 2011 and is based in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"24-01-2025 16:34:33"}]