[{"Company Name":"FirstEnergy Corp.","Symbol":"FE","Current Price":"43.16","Latest MA":"40.59","Latest MA 5":42.6430006104,"Latest MA 9":41.6405558099,"Latest MA 20":40.5877522964,"Price Target":46.148,"Difference from MA":"6.35%","Difference from Open":"-0.24%","Change from Yesterday":"-0.72%","Change from Last Report":"0.00","Latest Volume":"2,485,038","Market Cap":"24,876,724,224","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":14.935986,"PB Ratio":2.0018086,"Previous Close":43.5,"ROE":0.083050005,"DTE":173.13,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.51,"Trailing PEG":1.3129,"Trailing PE":27.848389,"Trailing PS":1.8764973,"Quick Ratio":0.406,"Day High":43.58,"Day Low":43.08,"VS Average Volume":0.7403184363,"Company Summary":"FirstEnergy Corp., through its subsidiaries, generates, transmits, and distributes electricity in the United States. It operates through Regulated Distribution and Regulated Transmission segments. The company owns and operates coal-fired, nuclear, hydroelectric, wind, and solar power generating facilities. It operates 24,080 circuit miles of overhead and underground transmission lines; and electric distribution systems, including 274,518 miles of overhead pole line and underground conduit carrying primary, secondary, and street lighting circuits. The company serves approximately 6 million customers in Ohio, Pennsylvania, West Virginia, Maryland, New Jersey, and New York. FirstEnergy Corp. was incorporated in 1996 and is headquartered in Akron, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"NRG Energy, Inc.","Symbol":"NRG","Current Price":"113.91","Latest MA":"105.39","Latest MA 5":107.3614003052,"Latest MA 9":108.3307785916,"Latest MA 20":105.3852029053,"Price Target":107.643,"Difference from MA":"8.09%","Difference from Open":"7.95%","Change from Yesterday":"11.02%","Change from Last Report":"0.00","Latest Volume":"2,833,494","Market Cap":"23,073,685,504","Earning Date":"2025-02-26","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":16.50826,"PB Ratio":12.482959,"Previous Close":102.44,"ROE":0.31931,"DTE":433.016,"Industry":"Utilities - Independent Power Producers","Sector":"Utilities","Beta":1.138,"Trailing PEG":null,"Trailing PE":28.194801,"Trailing PS":0.82060194,"Quick Ratio":0.594,"Day High":115.35,"Day Low":105.31,"VS Average Volume":1.0277204,"Company Summary":"NRG Energy, Inc., together with its subsidiaries, operates as an energy and home services company in the United States and Canada. It operates through Texas; East; West\/Services\/Other; Vivint Smart Home; and Corporate Activities segments. The company produces and sells electricity generated using coal, oil, solar, and battery storage; natural gas; and a cloud-based home platform, including hardware, software, sales, installation, customer service, technical support, and professional monitoring solutions. It offers retail electricity and energy management, line and surge protection products, HVAC installation, repair and maintenance, home protection products, carbon offsets, back-up power stations, portable power, portable solar, and portable lighting; retail services comprising demand response, commodity sales, energy efficiency, and energy management solutions; and system power, distributed generation, renewable and low-carbon products, carbon management and specialty services, backup generation, storage and distributed solar, and energy advisory services. In addition, the company trades in power, natural gas, and related commodities; environmental products; weather products; and financial products, including forwards, futures, options, and swaps. It offers its products and services under the NRG, Reliant, Direct Energy, Green Mountain Energy, and Vivint. It serves residential, commercial, government, industrial, and wholesale customers. NRG Energy, Inc. was founded in 1989 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Paramount Global","Symbol":"PARA","Current Price":"11.22","Latest MA":"11.04","Latest MA 5":11.4710000229,"Latest MA 9":11.3572223028,"Latest MA 20":11.0442500401,"Price Target":12.892,"Difference from MA":"1.64%","Difference from Open":"-2.39%","Change from Yesterday":"-2.39%","Change from Last Report":"0.00","Latest Volume":"4,568,460","Market Cap":"7,933,369,856","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":6.886503,"PB Ratio":0.45026073,"Previous Close":11.5,"ROE":-0.30080998,"DTE":91.924,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.71,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.2748249,"Quick Ratio":0.938,"Day High":11.595,"Day Low":11.21,"VS Average Volume":0.5163921613,"Company Summary":"Paramount Global operates as a media, streaming, and entertainment company worldwide. It operates through TV Media, Direct-to-Consumer, and Filmed Entertainment segments. The TV Media segment operates CBS Television Network, a domestic broadcast television network; CBS Stations, a television station; and international free-to-air networks comprising Network 10, Channel 5, Telefe, and Chilevisión; domestic premium and basic cable networks, such as Paramount+ with Showtime, MTV, Comedy Central, Paramount Network, The Smithsonian Channel, Nickelodeon, BET Media Group, and CBS Sports Network; and international extensions of these brands. This segment also offers domestic and international television studio operations, including CBS Studios, Paramount Television Studios, and Showtime\/MTV Entertainment Studios; CBS Media Ventures, which produces and distributes first-run syndicated programming; and digital properties consisting of CBS News Streaming and CBS Sports HQ. The Direct-to-Consumer segment provides a portfolio of domestic and international pay and free streaming services, including Paramount+, Pluto TV, BET+, and Noggin. The Filmed Entertainment segment produces and acquires films, series, and short-form content for release and licensing around the world, including in theaters, on streaming services, on television, through digital home entertainment, and DVDs\/Blu-rays; and operates a portfolio consisting of Paramount Pictures, Paramount Players, Paramount Animation, Nickelodeon Studio, Awesomeness, and Miramax. It also offers production, distribution, and advertising solutions. The company was formerly known as ViacomCBS Inc. and changed its name to Paramount Global in February 2022. The company was founded in 1914 and is headquartered in New York, New York. Paramount Global is a subsidiary of National Amusements, Inc.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"NVIDIA Corporation","Symbol":"NVDA","Current Price":"131.13","Latest MA":"130.00","Latest MA 5":132.5168778638,"Latest MA 9":135.0393753703,"Latest MA 20":129.997219115,"Price Target":171.63556,"Difference from MA":"0.87%","Difference from Open":"0.88%","Change from Yesterday":"3.54%","Change from Last Report":"0.00","Latest Volume":"148,414,706","Market Cap":"3,211,741,102,080","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":31.831312,"PB Ratio":48.770924,"Previous Close":126.63,"ROE":1.27211,"DTE":15.516,"Industry":"Semiconductors","Sector":"Technology","Beta":1.619,"Trailing PEG":0.9076,"Trailing PE":51.83597,"Trailing PS":28.352697,"Quick Ratio":3.409,"Day High":133.73,"Day Low":129.05,"VS Average Volume":0.6252960266,"Company Summary":"NVIDIA Corporation provides graphics and compute and networking solutions in the United States, Taiwan, China, Hong Kong, and internationally. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro\/NVIDIA RTX GPUs for enterprise workstation graphics; virtual GPU or vGPU software for cloud-based visual and virtual computing; automotive platforms for infotainment systems; and Omniverse software for building and operating metaverse and 3D internet applications. The Compute & Networking segment comprises Data Center computing platforms and end-to-end networking platforms, including Quantum for InfiniBand and Spectrum for Ethernet; NVIDIA DRIVE automated-driving platform and automotive development agreements; Jetson robotics and other embedded platforms; NVIDIA AI Enterprise and other software; and DGX Cloud software and services. The company's products are used in gaming, professional visualization, data center, and automotive markets. It sells its products to original equipment manufacturers, original device manufacturers, system integrators and distributors, independent software vendors, cloud service providers, consumer internet companies, add-in board manufacturers, distributors, automotive manufacturers and tier-1 automotive suppliers, and other ecosystem participants. It has a strategic collaboration with IQVIA to help realize the potential of AI in healthcare and life sciences. NVIDIA Corporation was incorporated in 1993 and is headquartered in Santa Clara, California.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"UWM Holdings Corporation","Symbol":"UWMC","Current Price":"6.09","Latest MA":"6.28","Latest MA 5":6.4379999809,"Latest MA 9":6.4411111238,"Latest MA 20":6.280499999,"Price Target":6.825,"Difference from MA":"-3.03%","Difference from Open":"2.87%","Change from Yesterday":"-7.37%","Change from Last Report":"0.00","Latest Volume":"3,622,158","Market Cap":"9,733,342,208","Earning Date":"2025-02-26","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.239131,"PB Ratio":5.7725124,"Previous Close":6.58,"ROE":-0.06532,"DTE":559.527,"Industry":"Mortgage Finance","Sector":"Financial Services","Beta":1.707,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":3.5686378,"Quick Ratio":0.134,"Day High":6.17,"Day Low":5.81,"VS Average Volume":1.1648308464,"Company Summary":"UWM Holdings Corporation engages in the residential mortgage lending business in the United States. The company offers mortgage loans through wholesale channel. It originates primarily conforming and government loans. UWM Holdings Corporation was founded in 1986 and is headquartered in Pontiac, Michigan.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"AerCap Holdings N.V.","Symbol":"AER","Current Price":"103.72","Latest MA":"99.22","Latest MA 5":102.8489997559,"Latest MA 9":102.4983329603,"Latest MA 20":99.2167497559,"Price Target":112.77778,"Difference from MA":"4.53%","Difference from Open":"-1.22%","Change from Yesterday":"2.18%","Change from Last Report":"0.00","Latest Volume":"2,282,255","Market Cap":"19,677,949,952","Earning Date":"2025-02-26","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.473448,"PB Ratio":1.1440122,"Previous Close":101.5,"ROE":0.153,"DTE":289.501,"Industry":"Rental & Leasing Services","Sector":"Industrials","Beta":1.808,"Trailing PEG":null,"Trailing PE":8.364113,"Trailing PS":2.5172453,"Quick Ratio":1.534,"Day High":105.255,"Day Low":100.05,"VS Average Volume":2.1474206075,"Company Summary":"AerCap Holdings N.V. engages in the lease, financing, sale, and management of commercial flight equipment in China, Hong Kong, Macau, the United States, Ireland, and internationally. The company offers aircraft asset management services, such as remarketing aircraft and engines; collecting rental and maintenance rent payments, monitoring aircraft maintenance, monitoring and enforcing contract compliance, and accepting delivery and redelivery of aircraft and engines; and conducting ongoing lessee financial performance reviews. Its aircraft asset management services also include periodically inspecting the leased aircraft and engines; coordinating technical modifications to aircraft to meet new lessee requirements; conducting restructuring negotiations in connection with lease defaults; repossessing aircraft and engines; arranging and monitoring insurance coverage; registering and de-registering aircraft; arranging for aircraft and engine valuations; and providing market research services. In addition, the company provides cash management services, including treasury services, such as the financing, refinancing, hedging, and ongoing cash management of vehicles; and administrative services comprising accounting and corporate secretarial services consisting of the preparation of budgets and financial statements. Further, it offers airframe and engine parts and supply chain solutions to airlines; maintenance, repair, and overhaul service providers; and aircraft parts distributors. The company had a portfolio of owned, managed, or on order aircraft. AerCap Holdings N.V. was founded in 1995 and is headquartered in Dublin, Ireland.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"APA Corporation","Symbol":"APA","Current Price":"22.00","Latest MA":"22.63","Latest MA 5":22.731000351,"Latest MA 9":22.9383334181,"Latest MA 20":22.6287499962,"Price Target":30.53517,"Difference from MA":"-2.80%","Difference from Open":"-2.16%","Change from Yesterday":"-1.72%","Change from Last Report":"0.00","Latest Volume":"3,894,827","Market Cap":"8,136,984,576","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":7.9981823,"PB Ratio":1.5909585,"Previous Close":22.38,"ROE":0.6186,"DTE":105.032,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":3.158,"Trailing PEG":null,"Trailing PE":3.12429,"Trailing PS":0.90865266,"Quick Ratio":0.587,"Day High":22.5,"Day Low":21.95,"VS Average Volume":0.5993235575,"Company Summary":"APA Corporation, an independent energy company, explores for, develops, and produces natural gas, crude oil, and natural gas liquids. It has oil and gas operations in the United States, Egypt, and North Sea. The company also has exploration and appraisal activities in Suriname, as well as holds interests in projects located in Uruguay and internationally. APA Corporation was incorporated in 1954 and is headquartered in Houston, Texas.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"eBay Inc.","Symbol":"EBAY","Current Price":"70.46","Latest MA":"68.55","Latest MA 5":70.0459993286,"Latest MA 9":69.8333334351,"Latest MA 20":68.5505001526,"Price Target":63.76897,"Difference from MA":"2.79%","Difference from Open":"-0.76%","Change from Yesterday":"-0.73%","Change from Last Report":"0.00","Latest Volume":"2,783,654","Market Cap":"33,750,339,584","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":13.498085,"PB Ratio":6.265896,"Previous Close":70.93,"ROE":0.35851002,"DTE":145.0,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":1.347,"Trailing PEG":null,"Trailing PE":17.74811,"Trailing PS":3.287584,"Quick Ratio":1.088,"Day High":71.61,"Day Low":70.13,"VS Average Volume":0.645933132,"Company Summary":"eBay Inc., together with its subsidiaries, operates marketplace platforms that connect buyers and sellers in the United States, the United Kingdom, China, Germany, and internationally. The company's marketplace platform includes its online marketplace at ebay.com, off-platform businesses, and the eBay suite of mobile apps. Its platforms enable users to list, sell, and buy various products. The company was founded in 1995 and is headquartered in San Jose, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Salesforce, Inc.","Symbol":"CRM","Current Price":"307.55","Latest MA":"328.24","Latest MA 5":309.9959985352,"Latest MA 9":317.762221951,"Latest MA 20":328.24,"Price Target":394.8877,"Difference from MA":"-6.30%","Difference from Open":"-1.63%","Change from Yesterday":"0.55%","Change from Last Report":"0.00","Latest Volume":"5,259,465","Market Cap":"294,325,354,496","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":27.632523,"PB Ratio":5.023767,"Previous Close":305.88,"ROE":0.101789996,"DTE":20.808,"Industry":"Software - Application","Sector":"Technology","Beta":1.307,"Trailing PEG":1.3726,"Trailing PE":50.750824,"Trailing PS":7.914312,"Quick Ratio":0.903,"Day High":313.7,"Day Low":306.83,"VS Average Volume":0.7915358154,"Company Summary":"Salesforce, Inc. provides Customer Relationship Management (CRM) technology that brings companies and customers together worldwide. The company's service includes sales to store data, monitor leads and progress, forecast opportunities, gain insights through analytics and artificial intelligence, and deliver quotes, contracts, and invoices; and service that enables companies to deliver trusted and highly personalized customer support at scale. In addition, its platform offering comprise a flexible platform that enables companies of various sizes, locations, and industries to build business workflow and apps with customer; online learning platform that allows anyone to learn in-demand Salesforce skills; and Slack, an intelligent productivity platform. The company's marketing services enables companies to plan, personalize, automate, and optimize customer marketing journey, connecting interaction, and connected products; and commerce services, which empowers shopping experience across various customer touchpoint, such as mobile, web, social, and stores and provides click-to-code tools that offers customers to build and deploy solutions. Further, its analytics offering includes Tableau, an end-to-end analytics solution for range of enterprise use cases and intelligent analytics with AI models, spot trends, predict outcomes, creates summaries, timely recommendations, and take action from any device; and integration service including MuleSoft, which provides building blocks to deliver end-to-end and connected experiences. Additionally, the company provides data cloud, a hyperscale data engine native to Salesforce; vertical services to meet the needs of customers in industries, such as financial services, healthcare and life sciences, manufacturing and automotive and government; and offers salesforce starter for small and medium-sized businesses. Salesforce, Inc. was incorporated in 1999 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Snowflake Inc.","Symbol":"SNOW","Current Price":"167.26","Latest MA":"182.82","Latest MA 5":173.0460002441,"Latest MA 9":180.5366674805,"Latest MA 20":182.8194987183,"Price Target":196.45143,"Difference from MA":"-8.51%","Difference from Open":"0.76%","Change from Yesterday":"1.83%","Change from Last Report":"0.00","Latest Volume":"4,951,338","Market Cap":"55,207,673,856","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":179.84946,"PB Ratio":18.846197,"Previous Close":164.2,"ROE":-0.28784,"DTE":88.455,"Industry":"Software - Application","Sector":"Technology","Beta":1.073,"Trailing PEG":7.1534,"Trailing PE":"N\/A","Trailing PS":16.169426,"Quick Ratio":1.804,"Day High":170.005,"Day Low":164.8,"VS Average Volume":0.9224786993,"Company Summary":"Snowflake Inc. provides a cloud-based data platform for various organizations in the United States and internationally. Its platform offers Data Cloud, which enables customers to consolidate data into a single source of truth to drive meaningful business insights, build data-driven applications, and share data and data products, as well as applies artificial intelligence (AI) for solving business problems. The company was formerly known as Snowflake Computing, Inc. and changed its name to Snowflake Inc. in April 2019. Snowflake Inc. was incorporated in 2012 and is based in Bozeman, Montana.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"CRH PLC","Symbol":"CRH","Current Price":"102.75","Latest MA":"102.53","Latest MA 5":101.263999939,"Latest MA 9":104.1922225952,"Latest MA 20":102.5275001526,"Price Target":114.6087,"Difference from MA":"0.22%","Difference from Open":"1.10%","Change from Yesterday":"2.43%","Change from Last Report":"0.00","Latest Volume":"2,884,720","Market Cap":"69,478,318,080","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":16.927511,"PB Ratio":3.1933742,"Previous Close":100.29,"ROE":"N\/A","DTE":66.934,"Industry":"Building Materials","Sector":"Basic Materials","Beta":1.384,"Trailing PEG":1.6967,"Trailing PE":20.591183,"Trailing PS":1.9633855,"Quick Ratio":0.881,"Day High":103.6,"Day Low":101.5,"VS Average Volume":0.7530857977,"Company Summary":"CRH plc, together with its subsidiaries, provides building materials solutions in Ireland and internationally. It operates through four segments: Americas Materials Solutions, Americas Building Solutions, Europe Materials Solutions, and Europe Building Solutions. The company provides solutions for the construction and maintenance of public infrastructure and commercial and residential buildings; and produces and sells aggregates, cement, readymixed concrete, and asphalt, as well as provides paving and construction services. It also manufactures, supplies, and delivers solutions for the built environment in communities across North America; and offers building and infrastructure solutions serving complex critical utility infrastructure, such as water, energy, transportation, and telecommunications projects, and outdoor living solutions for enhancing private and public spaces. In addition, the company combines materials, products, and services to produce a wide range of architectural and infrastructural solutions for use in the building and renovation of critical utility infrastructure, commercial and residential buildings, and outdoor living spaces for the built environment. Further, it produces and supplies precast and pre-stressed concrete products comprising floor and wall elements, beams, vaults, pipes, and manholes; granite, limestone, and sandstone; concrete and polymer-based products, such as underground vaults, drainage systems, utility enclosures, and modular precast structures; engineered steel, polymer-based anchoring, fixing, and connecting solutions; concrete masonry, hardscape and related products, including pavers, blocks and curbs, retaining walls, and slabs; and fencing and railing systems, composite decking, lawn and garden products, and packaged concrete mixes. The company was founded in 1936 and is headquartered in Dublin, Ireland.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"TJX Companies, Inc. (The)","Symbol":"TJX","Current Price":"125.71","Latest MA":"124.11","Latest MA 5":122.7940004272,"Latest MA 9":123.4899996609,"Latest MA 20":124.1112797241,"Price Target":131.8241,"Difference from MA":"1.29%","Difference from Open":"-0.14%","Change from Yesterday":"2.49%","Change from Last Report":"0.00","Latest Volume":"3,907,123","Market Cap":"141,379,977,216","Earning Date":"2025-02-26","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":27.340218,"PB Ratio":17.301554,"Previous Close":122.7,"ROE":0.64893997,"DTE":155.561,"Industry":"Apparel Retail","Sector":"Consumer Cyclical","Beta":0.91,"Trailing PEG":2.4996,"Trailing PE":29.591764,"Trailing PS":2.5047085,"Quick Ratio":0.452,"Day High":127.58,"Day Low":123.0,"VS Average Volume":0.8361835873,"Company Summary":"The TJX Companies, Inc., together with its subsidiaries, operates as an off-price apparel and home fashions retailer in the United States, Canada, Europe, and Australia. It operates through four segments: Marmaxx, HomeGoods, TJX Canada, and TJX International. The company sells family apparel, including footwear and accessories; home fashions, such as home basics, furniture, rugs, lighting products, giftware, soft home products, decorative accessories, tabletop, and cookware, as well as expanded pet, and gourmet food departments; jewelry and accessories; and other merchandise. It offers its products through stores and e-commerce sites. The TJX Companies, Inc. was incorporated in 1962 and is headquartered in Framingham, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Workday, Inc.","Symbol":"WDAY","Current Price":"272.10","Latest MA":"263.79","Latest MA 5":261.4300036621,"Latest MA 9":261.3500020345,"Latest MA 20":263.79300354,"Price Target":311.55,"Difference from MA":"3.15%","Difference from Open":"-2.82%","Change from Yesterday":"6.59%","Change from Last Report":"0.00","Latest Volume":"4,206,907","Market Cap":"72,378,605,568","Earning Date":"2025-02-25","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":32.78313,"PB Ratio":8.006945,"Previous Close":255.22,"ROE":0.06146,"DTE":37.215,"Industry":"Software - Application","Sector":"Technology","Beta":"N\/A","Trailing PEG":2.1373,"Trailing PE":140.25774,"Trailing PS":8.5695715,"Quick Ratio":1.797,"Day High":281.0,"Day Low":269.11,"VS Average Volume":1.1710698977,"Company Summary":"Workday, Inc. provides enterprise cloud applications in the United States and internationally. Its applications help its customers to plan, execute, analyze, and extend to other applications and environments to manage their business and operations. The company offers a suite of financial management applications to maintain accounting information in the general ledger; manage financial processes, such as payables and receivables; identify real-time financial, operational, and management insights; enhance financial consolidation; reduce time-to-close; promote internal control and auditability; and achieve consistency across finance operations. It also provides spend management solutions that help organizations to streamline supplier selection and contracts, manage indirect spend, and build and execute sourcing events, such as requests for proposals; expense management solutions to submit and approve expenses; and a suite of human capital management applications that enables HR teams to hire, onboard, pay, develop, reskill, and provide employee experiences. In addition, the company offers planning applications; and applications for analytics and reporting comprising augmented analytics to surface insights to the line of business in simple-to-understand stories, machine learning to drive efficiency and automation, and benchmarks to compare performance against other companies. Further, it provides supply chain and inventory solutions to healthcare organizations; solutions to manage the end-to-end student and faculty lifecycle; and Workday Extend for customers and their developers to build custom applications. It serves professional and business services, financial services, healthcare, education, government, technology, media, retail, and hospitality industries. The company was formerly known as North Tahoe Power Tools, Inc. and changed its name to Workday, Inc. in July 2005. Workday, Inc. was incorporated in 2005 and is headquartered in Pleasanton, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Caesars Entertainment, Inc.","Symbol":"CZR","Current Price":"34.53","Latest MA":"36.41","Latest MA 5":35.5079996643,"Latest MA 9":37.0744439528,"Latest MA 20":36.414,"Price Target":50.11765,"Difference from MA":"-5.17%","Difference from Open":"-3.55%","Change from Yesterday":"-1.00%","Change from Last Report":"0.00","Latest Volume":"3,518,742","Market Cap":"7,336,933,888","Earning Date":"2025-02-25","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":25.768656,"PB Ratio":1.7553759,"Previous Close":34.87,"ROE":-0.04639,"DTE":572.235,"Industry":"Resorts & Casinos","Sector":"Consumer Cyclical","Beta":"N\/A","Trailing PEG":4.8183,"Trailing PE":"N\/A","Trailing PS":0.6524619,"Quick Ratio":0.588,"Day High":36.2599,"Day Low":34.36,"VS Average Volume":0.7928716089,"Company Summary":"Caesars Entertainment, Inc. operates as a gaming and hospitality company. The company owns, leases, or manages domestic properties in 18 states with slot machines, video lottery terminals and e-tables, and hotel rooms, as well as table games, including poker. It also operates and conducts retail and online sports wagering across 31 jurisdictions in North America and operates iGaming in five jurisdictions in North America; sports betting from our retail and online sportsbooks; and other games, such as keno. In addition, the company operates dining venues, bars, nightclubs, lounges, hotels, and entertainment venues; and provides staffing and management services. Caesars Entertainment, Inc. was founded in 1937 and is based in Reno, Nevada.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Elanco Animal Health Incorporat","Symbol":"ELAN","Current Price":"11.29","Latest MA":"11.53","Latest MA 5":11.0490000076,"Latest MA 9":11.1905554835,"Latest MA 20":11.5262499886,"Price Target":15.91667,"Difference from MA":"-2.09%","Difference from Open":"3.91%","Change from Yesterday":"5.42%","Change from Last Report":"0.00","Latest Volume":"2,547,589","Market Cap":"5,581,719,040","Earning Date":"2025-02-25","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":12.005319,"PB Ratio":0.85518336,"Previous Close":10.7,"ROE":0.053039998,"DTE":66.794,"Industry":"Drug Manufacturers - Specialty & Generic","Sector":"Healthcare","Beta":1.418,"Trailing PEG":null,"Trailing PE":16.595589,"Trailing PS":1.2574271,"Quick Ratio":"N\/A","Day High":11.465,"Day Low":10.76,"VS Average Volume":0.5306675554,"Company Summary":"Elanco Animal Health Incorporated, an animal health company, innovates, develops, manufactures, and markets products for pets and farm animals. It offers pet health disease prevention products, such as parasiticide and vaccine products that protect pets from worms, fleas, and ticks under the Seresto, Advantage, Advantix, and Advocate brands; pet health therapeutics for pain, osteoarthritis, ear infections, cardiovascular, and dermatology indications in canines and felines under the Galliprant and Claro brands; vaccines, antibiotics, parasiticides, and other products for use in poultry and aquaculture production, as well as nutritional health products, including enzymes, probiotics, and prebiotics; and a range of vaccines, antibiotics, implants, parasiticides, and other products used in ruminant and swine production under the Rumensin and Baytril brands. The company sells its products to third-party distributors; veterinarians; and farm animal producers, including beef and dairy farmers, as well as pork, poultry, and aquaculture operations. Elanco Animal Health Incorporated was founded in 1954 and is headquartered in Greenfield, Indiana.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Intuit Inc.","Symbol":"INTU","Current Price":"620.03","Latest MA":"585.95","Latest MA 5":577.489996582,"Latest MA 9":580.0955574544,"Latest MA 20":585.9504990234,"Price Target":713.0413,"Difference from MA":"5.82%","Difference from Open":"-2.43%","Change from Yesterday":"11.63%","Change from Last Report":"0.00","Latest Volume":"2,800,410","Market Cap":"173,556,940,800","Earning Date":"2025-02-25","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":27.89159,"PB Ratio":9.672253,"Previous Close":555.63,"ROE":0.17424999,"DTE":"N\/A","Industry":"Software - Application","Sector":"Technology","Beta":"N\/A","Trailing PEG":1.668,"Trailing PE":58.109657,"Trailing PS":10.109917,"Quick Ratio":0.497,"Day High":638.85,"Day Low":615.4361,"VS Average Volume":1.6591915232,"Company Summary":"Intuit Inc. provides financial management, compliance, and marketing products and services in the United States. The company operates in four segments: Small Business & Self-Employed, Consumer, Credit Karma, and ProTax. The Small Business & Self-Employed segment provides QuickBooks services, that includes financial and business management online services, desktop software, payroll solutions, time tracking, merchant payment processing and bill pay solutions, checking accounts, and financing services for small and mid-market businesses; and Mailchimp, a marketing automation and customer relationship management. This segment also offers QuickBooks online services and desktop software solutions comprising QuickBooks Online, QuickBooks Live, QuickBooks Online Advanced, QuickBooks Self-Employed, QuickBooks Solopreneur financial and business management offerings, QuickBooks Online Payroll QuickBooks Checking, QuickBooks Desktop software subscriptions, QuickBooks Basic Payroll, QuickBooks Assisted Payroll, and QuickBooks Enhanced Payroll. The Consumer segment provides do-it-yourself and assisted TurboTax income tax preparation products and services. The Credit Karma segment offers consumers with a personal finance platform that provides personalized recommendations of credit card, home, auto, and personal loan, and insurance product; online savings and checking accounts; and access to its credit scores and reports, credit and identity monitoring, credit report dispute, credit building tools, and tools. The ProTax segment provides Lacerte, ProSeries, and ProFile desktop tax-preparation software products; and ProConnect Tax Online bill pay tax products, electronic tax filing service, and bank products and related services. It sells products and services through direct sales channels, multi-channel shop-and-buy experiences, mobile application stores, and partner and other channels. The company was incorporated in 1984 and is headquartered in Mountain View, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Keurig Dr Pepper Inc.","Symbol":"KDP","Current Price":"33.87","Latest MA":"32.31","Latest MA 5":34.0209995728,"Latest MA 9":33.2061108738,"Latest MA 20":32.3087499733,"Price Target":37.405,"Difference from MA":"4.82%","Difference from Open":"-2.52%","Change from Yesterday":"-3.08%","Change from Last Report":"0.00","Latest Volume":"4,120,940","Market Cap":"45,946,339,328","Earning Date":"2025-02-25","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":16.519514,"PB Ratio":1.8950756,"Previous Close":34.94,"ROE":0.057729997,"DTE":75.515,"Industry":"Beverages - Non-Alcoholic","Sector":"Consumer Defensive","Beta":0.616,"Trailing PEG":2.48,"Trailing PE":32.252384,"Trailing PS":2.9930518,"Quick Ratio":0.249,"Day High":34.84,"Day Low":33.795,"VS Average Volume":0.4404933084,"Company Summary":"Keurig Dr Pepper Inc. owns, manufactures, and distributors beverages and single serve brewing systems in the United States and internationally. It operates through three segments: U.S. Refreshment Beverages, U.S. Coffee, and International. The U.S. Refreshment Beverages segment manufactures and distributes branded concentrates, syrup, and finished beverages. Its U.S. Coffee segment offers finished goods relating to K-Cup pods, single serve brewers, specialty coffee, and ready to drink coffee products through Keurig.com website. The International segment provides sales in Canada, Mexico, the Caribbean, and other international markets from the manufacture and distribution of branded concentrates, syrup, and finished beverages; and sales in Canada from the manufacture and distribution of finished goods relating to the Company's single serve brewers, KCup pods, and other coffee products. It serves retailers, third-party bottlers and distributors, retail partners, hotel chains, office coffee distributors, and end-use consumers. The company offers its products under the Dr Pepper, Canada Dry, Green Mountain Coffee Roasters, Snapple, Mott's, The Original Donut Shop, Clamato, and Core Hydration brand name. Keurig Dr Pepper Inc. was founded in 1981 and is headquartered in Burlington, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Coupang, Inc.","Symbol":"CPNG","Current Price":"25.62","Latest MA":"24.29","Latest MA 5":24.8749996185,"Latest MA 9":25.0827776591,"Latest MA 20":24.2942499161,"Price Target":29.07647,"Difference from MA":"5.48%","Difference from Open":"0.57%","Change from Yesterday":"6.02%","Change from Last Report":"0.00","Latest Volume":"9,766,327","Market Cap":"46,095,790,080","Earning Date":"2025-02-25","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":54.52128,"PB Ratio":11.273647,"Previous Close":24.17,"ROE":0.01594,"DTE":89.179,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":"N\/A","Trailing PEG":44.1542,"Trailing PE":44.956142,"Trailing PS":1.5229216,"Quick Ratio":0.815,"Day High":25.8,"Day Low":23.48,"VS Average Volume":1.2686329256,"Company Summary":"Coupang, Inc., together with its subsidiaries owns and operates retail business through its mobile applications and Internet websites primarily in South Korea. The company operates through Product Commerce and Developing Offerings segments. It sells various products and services in the categories of home goods and décor products, apparel, beauty products, fresh food and groceries, sporting goods, electronics, and everyday consumables, as well as travel, and restaurant order and delivery services. In addition, the company offers Rocket Fresh, which offers fresh groceries; Coupang Eats, a restaurant ordering and delivery services; and Coupang Play, an online content streaming services, as well as advertising products. It also performs operations and support services in the United States, South Korea, Taiwan, Singapore, China, Japan, and India. Coupang, Inc. was incorporated in 2010 and is headquartered in Seattle, Washington.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Amer Sports, Inc.","Symbol":"AS","Current Price":"30.20","Latest MA":"30.80","Latest MA 5":29.1150001678,"Latest MA 9":29.9172221375,"Latest MA 20":30.7967498817,"Price Target":32.75263,"Difference from MA":"-1.92%","Difference from Open":"2.39%","Change from Yesterday":"4.77%","Change from Last Report":"0.00","Latest Volume":"3,047,015","Market Cap":"16,502,803,456","Earning Date":"2025-02-25","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":43.15,"PB Ratio":3.0365942,"Previous Close":28.83,"ROE":0.03126,"DTE":28.669,"Industry":"Leisure","Sector":"Consumer Cyclical","Beta":"N\/A","Trailing PEG":null,"Trailing PE":215.75,"Trailing PS":3.183841,"Quick Ratio":0.626,"Day High":31.4395,"Day Low":29.19,"VS Average Volume":0.9696958028,"Company Summary":"Amer Sports, Inc. designs, manufactures, markets, distributes, and sells sports equipment, apparel, footwear, and accessories in Europe, the Middle East, Africa, the Americas, China, and the Asia Pacific. It operates through three segments: Technical Apparel, Outdoor Performance, and Ball & Racquet Sports. The Technical Apparel segment offers outdoor apparel, footwear, and accessories which includes climbing gear. The Outdoor Performance segment provides hiking and running footwear, functional apparel, skiing and snowboarding gear, and lifestyle footwear. The Ball & Racquet Sports segment offers sports equipment for tennis, baseball, american football, basketball, golf, and various other professional and recreational sports. This segment provides custom-fitting protective gear and apparel for baseball, softball, football, and lacrosse. It sells its products under the Arc'teryx, PeakPerformance, Salomon, Atomic, Armada, ENVE, Wilson, Louisville Slugger, DeMarini, EvoShield, and ATEC brands. The company distributes its products through retail stores, general sporting goods retailers, specialty stores, independently operated partner stores, and distributors, as well as its e-commerce websites, and retailer-owned and third-party e-commerce websites. The company was formerly known as Amer Sports Management Holding (Cayman) Limited and changed its name to Amer Sports, Inc. in August 2023. Amer Sports, Inc. was founded in 1950 and is based in Helsinki, Finland.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Maplebear Inc.","Symbol":"CART","Current Price":"42.88","Latest MA":"49.46","Latest MA 5":49.187000061,"Latest MA 9":50.0438892449,"Latest MA 20":49.4617501678,"Price Target":52.03704,"Difference from MA":"-13.31%","Difference from Open":"-0.99%","Change from Yesterday":"-12.01%","Change from Last Report":"0.00","Latest Volume":"7,471,711","Market Cap":"11,015,658,496","Earning Date":"2025-02-25","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":32.0,"PB Ratio":3.5626454,"Previous Close":48.78,"ROE":0.12684,"DTE":0.793,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":"N\/A","Trailing PEG":null,"Trailing PE":4.064455,"Trailing PS":3.2610002,"Quick Ratio":2.986,"Day High":44.77,"Day Low":42.51,"VS Average Volume":1.9072280921,"Company Summary":"Maplebear Inc., doing business as Instacart, engages in the provision of online grocery shopping services to households in North America. It sells and delivers grocery products, as well as pickup services through a mobile application and website. It also operates virtual convenience stores; and provides software-as-a-service solutions to retailers. The company was incorporated in 2012 and is based in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Permian Resources Corporation","Symbol":"PR","Current Price":"14.12","Latest MA":"14.47","Latest MA 5":14.1010000687,"Latest MA 9":14.2005556149,"Latest MA 20":14.4677500362,"Price Target":19.45,"Difference from MA":"-2.44%","Difference from Open":"-1.02%","Change from Yesterday":"3.18%","Change from Last Report":"0.00","Latest Volume":"5,081,828","Market Cap":"11,343,499,264","Earning Date":"2025-02-25","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":9.289474,"PB Ratio":1.0874085,"Previous Close":13.67,"ROE":0.12663999,"DTE":40.935,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":"N\/A","Trailing PEG":1.7987,"Trailing PE":8.022727,"Trailing PS":2.2675633,"Quick Ratio":0.761,"Day High":14.6599,"Day Low":13.9,"VS Average Volume":0.6971432757,"Company Summary":"Permian Resources Corporation, an independent oil and natural gas company, focuses on the development of crude oil and related liquids-rich natural gas reserves in the United States. The company's assets primarily focus on the Delaware Basin, a sub-basin of the Permian Basin. Its properties consist of acreage blocks in West Texas, Eddy County, Lea County, and New Mexico. The company was formerly known as Centennial Resource Development, Inc. and changed its name to Permian Resources Corporation in September 2022. Permian Resources Corporation was incorporated in 2015 and is headquartered in Midland, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"DBA Sempra","Symbol":"SRE","Current Price":"72.10","Latest MA":"82.41","Latest MA 5":80.606000061,"Latest MA 9":82.3277776082,"Latest MA 20":82.4050003815,"Price Target":87.63125,"Difference from MA":"-12.51%","Difference from Open":"2.96%","Change from Yesterday":"2.05%","Change from Last Report":"0.00","Latest Volume":"9,528,629","Market Cap":"45,668,065,280","Earning Date":"2025-02-25","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":14.027238,"PB Ratio":1.4667289,"Previous Close":70.64,"ROE":0.097950004,"DTE":95.798,"Industry":"Utilities - Diversified","Sector":"Utilities","Beta":0.79,"Trailing PEG":1.6846,"Trailing PE":16.312216,"Trailing PS":3.4636378,"Quick Ratio":0.418,"Day High":74.25,"Day Low":68.195,"VS Average Volume":2.2027335858,"Company Summary":"Sempra operates as an energy infrastructure company in the United States and internationally. It operates through three segments: Sempra California, Sempra Texas Utilities, and Sempra Infrastructure. The Sempra California segment provides electric services; and natural gas services to San Diego County. As of December 31, 2023, it offered electric services to approximately 3.6 million population and natural gas services to approximately 3.3 million population that covers 4,100 square miles. This segment owns and operates a natural gas distribution, transmission, and storage system that supplies natural gas. As of December 31, 2023, it serves a population of 21 million covering an area of 24,000 square miles. The Sempra Texas Utilities segment engages in the regulated electricity transmission and distribution. As of December 31, 2023, its transmission system included 18,298 circuit miles of transmission lines; 1,257 transmission and distribution substations; interconnection to 173 third-party generation facilities totaling 54,277 MW; and distribution system included approximately 4.0 million points of delivery and consisted of 125,116 miles of overhead and underground lines. The Sempra Infrastructure segment develops, builds, operates, and invests in energy infrastructure to help enable the energy transition in North American markets and worldwide. The company was formerly known as Sempra Energy and changed its name to Sempra in May 2023. Sempra was incorporated in 1996 and is based in San Diego, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"First Solar, Inc.","Symbol":"FSLR","Current Price":"160.04","Latest MA":"162.06","Latest MA 5":155.9890018311,"Latest MA 9":158.3794439019,"Latest MA 20":162.0617493591,"Price Target":260.96286,"Difference from MA":"-1.24%","Difference from Open":"3.49%","Change from Yesterday":"8.57%","Change from Last Report":"0.00","Latest Volume":"5,081,807","Market Cap":"17,134,097,408","Earning Date":"2025-02-25","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.672339,"PB Ratio":2.1478226,"Previous Close":147.46,"ROE":0.17621,"DTE":7.644,"Industry":"Solar","Sector":"Technology","Beta":"N\/A","Trailing PEG":0.2173,"Trailing PE":13.303823,"Trailing PS":4.0734477,"Quick Ratio":1.664,"Day High":167.96,"Day Low":154.655,"VS Average Volume":2.3217266956,"Company Summary":"First Solar, Inc., a solar technology company, provides photovoltaic (PV) solar energy solutions in the United States, France, Japan, Chile, and internationally. The company manufactures and sells PV solar modules with a thin film semiconductor technology that provides a lower-carbon alternative to conventional crystalline silicon PV solar modules. It designs, manufactures, and sells cadmium telluride solar modules that converts sunlight into electricity. The company's residual business operations include project development activities, operations and maintenance services, and the sale of PV solar power systems to third-party customers. It serves developers and operators of systems, utilities, independent power producers, commercial and industrial companies, and other system owners. The company was formerly known as First Solar Holdings, Inc. and changed its name to First Solar, Inc. in 2006. First Solar, Inc. was founded in 1999 and is headquartered in Tempe, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Range Resources Corporation","Symbol":"RRC","Current Price":"38.40","Latest MA":"38.36","Latest MA 5":38.4079998779,"Latest MA 9":38.7033329434,"Latest MA 20":38.3644997787,"Price Target":40.34808,"Difference from MA":"0.09%","Difference from Open":"0.42%","Change from Yesterday":"2.35%","Change from Last Report":"0.00","Latest Volume":"3,260,855","Market Cap":"9,266,304,000","Earning Date":"2025-02-25","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":12.929294,"PB Ratio":2.3476188,"Previous Close":37.5,"ROE":0.06916,"DTE":46.251,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":"N\/A","Trailing PEG":null,"Trailing PE":19.2,"Trailing PS":3.8336709,"Quick Ratio":0.476,"Day High":39.0,"Day Low":37.18,"VS Average Volume":1.3881537245,"Company Summary":"Range Resources Corporation operates as an independent natural gas, natural gas liquids (NGLs), crude oil, and condensate company in the United States. The company engages in the exploration, development, and acquisition of natural gas and crude oil properties located in the Appalachian region. It sells natural gas to utilities, marketing and midstream companies, and industrial users; NGLs to petrochemical end users, marketers\/traders, and natural gas processors; and oil and condensate to crude oil processors, transporters, and refining and marketing companies. The company was formerly known as Lomak Petroleum Inc. and changed its name to Range Resources Corporation in August 1998. Range Resources Corporation was founded in 1976 and is headquartered in Fort Worth, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Zoom Communications, Inc.","Symbol":"ZM","Current Price":"74.99","Latest MA":"84.17","Latest MA 5":79.2519993286,"Latest MA 9":81.8766659885,"Latest MA 20":84.1695000763,"Price Target":91.4869,"Difference from MA":"-10.91%","Difference from Open":"1.08%","Change from Yesterday":"1.04%","Change from Last Report":"0.00","Latest Volume":"2,199,653","Market Cap":"22,984,060,928","Earning Date":"2025-02-24","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":14.175803,"PB Ratio":2.5728204,"Previous Close":74.22,"ROE":0.119169995,"DTE":0.419,"Industry":"Software - Application","Sector":"Technology","Beta":-0.005,"Trailing PEG":2.9605,"Trailing PE":23.36137,"Trailing PS":4.9264584,"Quick Ratio":4.354,"Day High":75.415,"Day Low":73.5101,"VS Average Volume":0.8061822677,"Company Summary":"Zoom Communications Inc. provides unified communications platform in the Americas, the Asia Pacific, Europe, the Middle East, and Africa. The company offers Zoom Meetings that offers HD video, voice, chat, and content sharing through mobile devices, desktops, laptops, telephones, and conference room systems; Zoom Phone, an enterprise cloud phone system; and Zoom Chat enables users to share messages, images, audio files, and content in desktop, laptop, tablet, and mobile devices. It also provides Zoom Rooms, a software-based conference room system; Zoom Conference Room Connector, a gateway for SIP\/H.323 endpoints to join Zoom meetings; Zoom Events, which enables users to manage and host internal and external virtual events; OnZoom, a prosumer-focused virtual event platform and marketplace for Zoom users to create, host, and monetize online events; and Zoom Webinars to provide video presentations to large audiences from many devices. In addition, the company offers Zoom Developer Platform that enables developers, platform integrators, service providers, and customers to build apps and integrations using Zoom's video-based communications solutions, as well as integrate Zoom's technology into their products and services; Zoom App Marketplace, which helps developers to publish their apps, as well as third-party integrations of Zoom; and Zoom Contact Center, an omnichannel contact center solution. It serves individuals; and education, entertainment\/media, enterprise infrastructure, finance, government, healthcare, manufacturing, non-profit\/not for profit and social impact, retail\/consumer products, and software\/Internet industries. The company was formerly known as Zoom Video Communications, Inc. and changed its name to Zoom Communications, Inc. in November 2024. The company was incorporated in 2011 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Coterra Energy Inc.","Symbol":"CTRA","Current Price":"27.05","Latest MA":"27.95","Latest MA 5":27.8669997559,"Latest MA 9":27.8916665904,"Latest MA 20":27.9452499237,"Price Target":34.5063,"Difference from MA":"-3.19%","Difference from Open":"-2.43%","Change from Yesterday":"-1.19%","Change from Last Report":"0.00","Latest Volume":"3,533,465","Market Cap":"20,615,370,752","Earning Date":"2025-02-24","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":11.6115885,"PB Ratio":1.5174716,"Previous Close":27.38,"ROE":0.08565,"DTE":26.923,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":0.239,"Trailing PEG":null,"Trailing PE":17.91722,"Trailing PS":3.7750175,"Quick Ratio":1.794,"Day High":27.73,"Day Low":26.97,"VS Average Volume":0.5847341746,"Company Summary":"Coterra Energy Inc., an independent oil and gas company, engages in the development, exploration, and production of oil, natural gas, and natural gas liquids in the United States. The company's properties include the Marcellus Shale with approximately 186,000 net acres in the dry gas window of the play located in Susquehanna County, Pennsylvania; Permian Basin properties with approximately 296,000 net acres located in west Texas and southeast New Mexico; and Anadarko Basin properties with approximately 182,000 net acres located in Oklahoma. It also operates natural gas and saltwater gathering and disposal systems in Texas. The company sells its natural gas to industrial customers, local distribution companies, oil and gas marketers, major energy companies, pipeline companies, and power generation facilities. Coterra Energy Inc. was incorporated in 1989 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Civitas Resources, Inc.","Symbol":"CIVI","Current Price":"40.23","Latest MA":"49.08","Latest MA 5":45.9870001526,"Latest MA 9":47.9083331807,"Latest MA 20":49.083250206,"Price Target":68.4,"Difference from MA":"-18.03%","Difference from Open":"0.04%","Change from Yesterday":"-0.32%","Change from Last Report":"0.00","Latest Volume":"3,146,411","Market Cap":"3,742,551,040","Earning Date":"2025-02-24","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":4.445856,"PB Ratio":0.57015926,"Previous Close":40.35,"ROE":0.13095,"DTE":69.22,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":1.483,"Trailing PEG":0.2942,"Trailing PE":4.7559104,"Trailing PS":0.7187803,"Quick Ratio":0.384,"Day High":40.755,"Day Low":38.6,"VS Average Volume":2.2357768523,"Company Summary":"Civitas Resources, Inc., an exploration and production company, focuses on the acquisition, development, and production of oil and natural gas in the Rocky Mountain region, primarily in the Field of the Denver-Julesburg Basin of Colorado. It also holds interest in production wells. The company was formerly known as Bonanza Creek Energy, Inc. Civitas Resources, Inc. was founded in 1999 and is based in Denver, Colorado.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Realty Income Corporation","Symbol":"O","Current Price":"56.34","Latest MA":"54.99","Latest MA 5":56.6990007324,"Latest MA 9":55.978333469,"Latest MA 20":54.9903675537,"Price Target":61.65,"Difference from MA":"2.45%","Difference from Open":"0.32%","Change from Yesterday":"0.17%","Change from Last Report":"0.00","Latest Volume":"3,315,057","Market Cap":"50,223,271,936","Earning Date":"2025-02-24","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":35.430817,"PB Ratio":1.2930658,"Previous Close":56.24,"ROE":0.02404,"DTE":67.16,"Industry":"REIT - Retail","Sector":"Real Estate","Beta":1.01,"Trailing PEG":5.8746,"Trailing PE":57.48469,"Trailing PS":9.513903,"Quick Ratio":0.622,"Day High":56.91,"Day Low":55.91,"VS Average Volume":0.6554597175,"Company Summary":"Realty Income (NYSE: O), an S&P 500 company, is real estate partner to the world's leading companies. Founded in 1969, we invest in diversified commercial real estate and have a portfolio of 15,450 properties in all 50 U.S. states, the U.K., and six other countries in Europe. We are known as \"The Monthly Dividend Company\" and have a mission to deliver stockholders dependable monthly dividends that grow over time. Since our founding, we have declared 649 consecutive monthly dividends and are a member of the S&P 500 Dividend Aristocrats index for having increased our dividend for the last 29 consecutive years.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Hims & Hers Health, Inc.","Symbol":"HIMS","Current Price":"41.17","Latest MA":"46.94","Latest MA 5":49.607000885,"Latest MA 9":54.9916670905,"Latest MA 20":46.9357502365,"Price Target":42.45,"Difference from MA":"-12.27%","Difference from Open":"2.32%","Change from Yesterday":"3.24%","Change from Last Report":"0.00","Latest Volume":"34,027,650","Market Cap":"9,147,684,864","Earning Date":"2025-02-24","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":89.510864,"PB Ratio":19.07133,"Previous Close":39.86,"ROE":0.30712998,"DTE":2.38,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":1.35,"Trailing PEG":4.5239,"Trailing PE":77.68868,"Trailing PS":6.195461,"Quick Ratio":1.384,"Day High":44.58,"Day Low":40.195,"VS Average Volume":1.8981380841,"Company Summary":"Hims & Hers Health, Inc. operates a telehealth platform that connects consumers to licensed healthcare professionals in the United States, the United Kingdom, and internationally. The company offers a range of curated prescription and non-prescription health and wellness products and services available to purchase on its websites and mobile application directly by customers. It also provides prescription medication on a recurring basis and ongoing care from healthcare providers; and over-the-counter drug and device products, cosmetics, and supplement products primarily focusing on general wellness, sexual health and wellness, skincare, and hair care. In addition, the company's curated non-prescription products include melatonin and biotin in the wellness specialty category; moisturizers, creams, sunscreen, serum, face oil, and face wash in the skincare specialty; condoms, climax delay spray and wipes, vibrators, and lubricants in the sexual health and wellness specialty; and shampoos, conditioners, scalp scrubs, and topical treatments, such as minoxidil in the hair care specialty category. Further, it offers medical consultation and post-consultation support services, as well as health and wellness products through wholesale partners. Hims & Hers Health, Inc. is based in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Cleveland-Cliffs Inc.","Symbol":"CLF","Current Price":"10.63","Latest MA":"10.94","Latest MA 5":11.1799999008,"Latest MA 9":11.4044444699,"Latest MA 20":10.9370000305,"Price Target":12.38889,"Difference from MA":"-2.81%","Difference from Open":"-4.41%","Change from Yesterday":"-1.53%","Change from Last Report":"0.00","Latest Volume":"10,377,756","Market Cap":"5,250,625,024","Earning Date":"2025-02-24","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":27.25641,"PB Ratio":0.74885523,"Previous Close":10.79,"ROE":-0.094280005,"DTE":102.436,"Industry":"Steel","Sector":"Basic Materials","Beta":1.951,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.27368388,"Quick Ratio":0.491,"Day High":11.33,"Day Low":10.61,"VS Average Volume":0.6399038975,"Company Summary":"Cleveland-Cliffs Inc. operates as a flat-rolled steel producer in North America. The company offers hot-rolled, cold-rolled, electrogalvanized, hot-dip galvanized, hot-dip galvannealed, aluminized, galvalume, enameling, and advanced high-strength steel products; austenitic, martensitic, duplex, precipitation hardening, and ferritic stainless steel products; plates; and grain oriented and non-oriented electrical steel products, as well as slab, scrap, iron ore, coal, and coke. It also provides tubular components, including carbon steel, stainless steel, and electric resistance welded tubing. In addition, the company offers tinplate products, such as electrolytic tin coated and chrome coated sheet, and tin mill products; tooling and sampling; ingots, rolled blooms, and cast blooms; and hot-briquetted iron products. Further, it owns five iron ore mines in Minnesota and Michigan. The company serves automotive, infrastructure and manufacturing, distributors and converters, and steel producers. The company was formerly known as Cliffs Natural Resources Inc. and changed its name to Cleveland-Cliffs Inc. in August 2017. Cleveland-Cliffs Inc. was founded in 1847 and is headquartered in Cleveland, Ohio.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Constellation Energy Corporatio","Symbol":"CEG","Current Price":"271.07","Latest MA":"303.54","Latest MA 5":279.3920029297,"Latest MA 9":297.0016674805,"Latest MA 20":303.5352474365,"Price Target":315.16714,"Difference from MA":"-10.70%","Difference from Open":"-0.62%","Change from Yesterday":"2.58%","Change from Last Report":"0.00","Latest Volume":"2,069,605","Market Cap":"84,803,444,736","Earning Date":"2025-02-21","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":30.287153,"PB Ratio":6.444228,"Previous Close":264.31,"ROE":0.30115,"DTE":66.438,"Industry":"Utilities - Renewable","Sector":"Utilities","Beta":0.829,"Trailing PEG":null,"Trailing PE":22.79815,"Trailing PS":3.5982454,"Quick Ratio":1.114,"Day High":279.95,"Day Low":268.05,"VS Average Volume":0.5278167907,"Company Summary":"Constellation Energy Corporation produces and sells energy products and services in the United States. It operates through five segments: Mid-Atlantic, Midwest, New York, ERCOT, and Other Power Regions. The company offers electricity, natural gas, energy-related products, and sustainable solutions. It has approximately 31,676 megawatts of generating capacity consisting of nuclear, wind, solar, natural gas, and hydroelectric assets. The company serves distribution utilities, municipalities, cooperatives, and commercial, industrial, public sector, and residential customers. The company was incorporated in 2021 and is headquartered in Baltimore, Maryland.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Vipshop Holdings Limited","Symbol":"VIPS","Current Price":"15.81","Latest MA":"14.85","Latest MA 5":14.8879998322,"Latest MA 9":14.9555553394,"Latest MA 20":14.8454999714,"Price Target":16.536383,"Difference from MA":"6.50%","Difference from Open":"2.13%","Change from Yesterday":"4.43%","Change from Last Report":"0.00","Latest Volume":"4,538,354","Market Cap":"8,155,810,304","Earning Date":"2025-02-21","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":6.699153,"PB Ratio":0.20405531,"Previous Close":15.14,"ROE":0.19570999,"DTE":7.338,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":0.293,"Trailing PEG":null,"Trailing PE":7.9848485,"Trailing PS":0.07522365,"Quick Ratio":1.075,"Day High":15.995,"Day Low":15.14,"VS Average Volume":1.4027588117,"Company Summary":"Vipshop Holdings Limited operates online platforms in the People's Republic of China. It operates in Vip.com, Shan Shan Outlets, and Others segments. The company offers womenswear, menswear, sportswear and sporting goods, shoes and bags, accessories, baby and children products, skincare and cosmetics, home goods and other lifestyle products, and supermarket products. It also provides internet finance services, including consumer and supplier financing. In addition, the company engages in warehousing, retail business, product procurement, and software development and information technology support activities. The company provides branded products through its vip.com and vipshop.com online platforms, as well as through retail stores. Vipshop Holdings Limited was founded in 2008 and is headquartered in Guangzhou, the People's Republic of China.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Dropbox, Inc.","Symbol":"DBX","Current Price":"26.93","Latest MA":"31.15","Latest MA 5":27.6429998016,"Latest MA 9":29.9361108992,"Latest MA 20":31.1517503166,"Price Target":28.10222,"Difference from MA":"-13.57%","Difference from Open":"0.77%","Change from Yesterday":"1.91%","Change from Last Report":"0.00","Latest Volume":"2,295,274","Market Cap":"7,898,206,208","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":10.517578,"PB Ratio":-10.587888,"Previous Close":26.42,"ROE":"N\/A","DTE":"N\/A","Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.612,"Trailing PEG":0.8685,"Trailing PE":19.232143,"Trailing PS":3.0995238,"Quick Ratio":1.375,"Day High":27.26,"Day Low":26.515,"VS Average Volume":0.6822376626,"Company Summary":"Dropbox, Inc. provides a content collaboration platform worldwide. The company's platform allows individuals, families, teams, and organizations to collaborate and sign up for free through its website or app, as well as upgrade to a paid subscription plan for premium features. The company serves customers in professional services, technology, media, education, industrial, consumer and retail, and financial services industries. The company was formerly known as Evenflow, Inc. and changed its name to Dropbox, Inc. in October 2009. Dropbox, Inc. was incorporated in 2007 and is based in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Nebius Group N.V.","Symbol":"NBIS","Current Price":"36.63","Latest MA":"38.13","Latest MA 5":38.6283798779,"Latest MA 9":41.359100373,"Latest MA 20":38.1265951297,"Price Target":55.96883,"Difference from MA":"-3.93%","Difference from Open":"1.91%","Change from Yesterday":"7.01%","Change from Last Report":"0.00","Latest Volume":"8,132,411","Market Cap":"8,634,938,368","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":"N\/A","PB Ratio":2.6512415,"Previous Close":34.21,"ROE":-0.13294,"DTE":1.154,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":0.77,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":73.48884,"Quick Ratio":9.484,"Day High":37.92,"Day Low":35.7612,"VS Average Volume":0.6973542181,"Company Summary":"Nebius Group N.V., operates as a technology company that engages in building full-stack infrastructure to service the global AI industry. Its businesses include Nebius, an AI-centric cloud platform built for intensive AI workloads. Nebius builds full-stack infrastructure for AI, including large-scale GPU clusters, cloud platforms, and tools and services for developers. The company's businesses also comprise Toloka AI, a data partner for various stages of generative AI development; TripleTen, an edtech player re-skilling people for careers in tech; and Avride, which develops autonomous driving technology for self-driving cars and delivery robots. The company was formerly known as Yandex N.V. and changed its name to Nebius Group N.V. in August 2024. Nebius Group N.V. was founded in 1989 and is headquartered in Amsterdam, the Netherlands with R&D hubs across Europe, North America and Israel.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Grab Holdings Limited","Symbol":"GRAB","Current Price":"4.82","Latest MA":"4.83","Latest MA 5":4.7770000114,"Latest MA 9":4.931666726,"Latest MA 20":4.8307500515,"Price Target":5.74365,"Difference from MA":"-0.22%","Difference from Open":"2.55%","Change from Yesterday":"5.70%","Change from Last Report":"0.00","Latest Volume":"16,955,944","Market Cap":"19,613,624,320","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":160.83333,"PB Ratio":3.0654383,"Previous Close":4.56,"ROE":-0.02465,"DTE":5.731,"Industry":"Software - Application","Sector":"Technology","Beta":0.902,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":7.0051126,"Quick Ratio":2.344,"Day High":4.89,"Day Low":4.63,"VS Average Volume":0.5076516098,"Company Summary":"Grab Holdings Limited engages in the provision of superapps in Cambodia, Indonesia, Malaysia, Myanmar, the Philippines, Singapore, Thailand, and Vietnam. The company offers its Grab ecosystem, a single platform with superapps for driver- and merchant-partners and consumers, that allows access to mobility, delivery, digital financial services, and enterprise sector offerings. Grab Holdings Limited was founded in 2012 and is headquartered in Singapore.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Bilibili Inc.","Symbol":"BILI","Current Price":"21.36","Latest MA":"19.27","Latest MA 5":21.6250000458,"Latest MA 9":21.2305554538,"Latest MA 20":19.2652499313,"Price Target":25.445404,"Difference from MA":"10.90%","Difference from Open":"-3.54%","Change from Yesterday":"0.26%","Change from Last Report":"0.00","Latest Volume":"5,866,587","Market Cap":"8,824,706,048","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":35.02459,"PB Ratio":0.6327371,"Previous Close":21.3,"ROE":-0.09567001,"DTE":34.288,"Industry":"Electronic Gaming & Multimedia","Sector":"Communication Services","Beta":0.805,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.32889318,"Quick Ratio":1.204,"Day High":22.34,"Day Low":21.365,"VS Average Volume":0.8618020025,"Company Summary":"Bilibili Inc. provides online entertainment services for the young generations in the People's Republic of China. It offers a range of digital content, including professional user generated videos, mobile games, and value-added services, such as live broadcasting, occupationally generated videos, audio drama on Maoer, and comics on Bilibili Comic. The company also provides advertising services; and IP derivatives and other services. In addition, it engages in the business and technology development activities; e-commerce business; and video, comics, and game distribution activities. Bilibili Inc. was founded in 2009 and is headquartered in Shanghai, the People's Republic of China.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Americold Realty Trust, Inc.","Symbol":"COLD","Current Price":"22.34","Latest MA":"21.75","Latest MA 5":22.2510000153,"Latest MA 9":21.7894442834,"Latest MA 20":21.7467500191,"Price Target":27.66667,"Difference from MA":"2.71%","Difference from Open":"0.25%","Change from Yesterday":"0.74%","Change from Last Report":"0.00","Latest Volume":"2,012,683","Market Cap":"6,371,438,592","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":48.554344,"PB Ratio":1.9352741,"Previous Close":22.17,"ROE":-0.0273,"DTE":111.291,"Industry":"REIT - Industrial","Sector":"Real Estate","Beta":0.626,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":2.3927238,"Quick Ratio":0.72,"Day High":22.52,"Day Low":22.2,"VS Average Volume":1.0252277327,"Company Summary":"Americold is a global leader in temperature-controlled logistics real estate and value added services. Focused on the ownership, operation, acquisition and development of temperature-controlled warehouses, Americold owns and\/or operates 245 temperature-controlled warehouses, with approximately 1.5 billion refrigerated cubic feet of storage, in North America, Europe, Asia-Pacific, and South America. Americold's facilities are an integral component of the supply chain connecting food producers, processors, distributors and retailers to consumers.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"VICI Properties Inc.","Symbol":"VICI","Current Price":"32.45","Latest MA":"30.47","Latest MA 5":31.8130001221,"Latest MA 9":31.1894446564,"Latest MA 20":30.4722501793,"Price Target":35.56522,"Difference from MA":"6.51%","Difference from Open":"-0.51%","Change from Yesterday":"-0.51%","Change from Last Report":"0.00","Latest Volume":"2,180,828","Market Cap":"34,283,515,904","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":11.888279,"PB Ratio":1.2918956,"Previous Close":32.62,"ROE":0.10345,"DTE":65.488,"Industry":"REIT - Diversified","Sector":"Real Estate","Beta":0.972,"Trailing PEG":null,"Trailing PE":12.677735,"Trailing PS":8.906649,"Quick Ratio":21.183,"Day High":32.63,"Day Low":32.2344,"VS Average Volume":0.3597961357,"Company Summary":"VICI Properties Inc. is an S&P 500 experiential real estate investment trust that owns one of the largest portfolios of market-leading gaming, hospitality and entertainment destinations, including Caesars Palace Las Vegas, MGM Grand and the Venetian Resort Las Vegas, three of the most iconic entertainment facilities on the Las Vegas Strip. VICI Properties owns 93 experiential assets across a geographically diverse portfolio consisting of 54 gaming properties and 39 other experiential properties across the United States and Canada. The portfolio is comprised of approximately 127 million square feet and features approximately 60,300 hotel rooms and over 500 restaurants, bars, nightclubs and sportsbooks. Its properties are occupied by industry-leading gaming, leisure and hospitality operators under long-term, triple-net lease agreements. VICI Properties has a growing array of real estate and financing partnerships with leading operators in other experiential sectors, including Bowlero, Cabot, Canyon Ranch, Chelsea Piers, Great Wolf Resorts, Homefield and Kalahari Resorts. VICI Properties also owns four championship golf courses and 33 acres of undeveloped and underdeveloped land adjacent to the Las Vegas Strip. VICI Properties' goal is to own the highest quality and most productive experiential real estate portfolio through a strategy of partnering with the highest quality experiential place makers and operators.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Block, Inc.","Symbol":"XYZ","Current Price":"64.89","Latest MA":"81.97","Latest MA 5":69.0079995422,"Latest MA 9":75.7111109246,"Latest MA 20":81.9699991531,"Price Target":96.0422,"Difference from MA":"-20.84%","Difference from Open":"2.27%","Change from Yesterday":"3.26%","Change from Last Report":"0.00","Latest Volume":"11,894,001","Market Cap":"40,201,154,560","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":11.971728,"PB Ratio":1.8908248,"Previous Close":62.84,"ROE":0.14358,"DTE":37.29,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":2.524,"Trailing PEG":0.1082,"Trailing PE":14.2313595,"Trailing PS":1.6665134,"Quick Ratio":1.493,"Day High":65.34,"Day Low":63.25,"VS Average Volume":1.5995912933,"Company Summary":"Block, Inc., together with its subsidiaries, builds ecosystems focused on commerce and financial products and services in the United States and internationally. It operates through two segments, Square and Cash App. The Square segment offers commerce products for restaurants, appointments, retail, point of sale, online, online checkout, and invoices, as well as virtual terminals, risk and order managers, and payment and commerce application programming interfaces; managed payment services; software solutions; hardware products, such as registers, terminals, stands, and readers for contactless and chips; banking services consisting of lending, instant transfer, and checking and savings accounts; and full-service setup and support services. This segment also provides loyalty, marketing, team management, and payroll services; and gift cards. The Cash App segment offers financial tools within the mobile Cash App, including peer-to-peer payments, bitcoin, and stock investment brokerage; Cash App Card, a debit card; direct deposit, cash boost, and tax preparation services; and Afterpay, a buy now, pay later platform. This segment also provides Pay in 4, monthly payment solutions, advertising and affiliate, shop directory, and Cash App Pay services; and business accounts, and Afterpay and Afterpay Plus cards. In addition, the company operates TIDAL, a platform for musicians and fans; TBD, an open developer platform focused on making the decentralized financial world accessible; Bitkey, a self-custody bitcoin wallet; and Spiral, which focuses on bitcoin open source work. It serves businesses, sellers, and individuals through e-commerce and retail distribution channels. The company was formerly known as Square, Inc. and changed its name to Block, Inc. in December 2021. Block, Inc. was incorporated in 2009 and is based in Oakland, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Walmart Inc.","Symbol":"WMT","Current Price":"96.68","Latest MA":"100.35","Latest MA 5":96.0059996948,"Latest MA 9":99.6555556912,"Latest MA 20":100.3490001526,"Price Target":108.74553,"Difference from MA":"-3.66%","Difference from Open":"-1.04%","Change from Yesterday":"-1.04%","Change from Last Report":"0.00","Latest Volume":"10,654,705","Market Cap":"776,668,184,576","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":35.544117,"PB Ratio":8.528582,"Previous Close":97.69,"ROE":0.21414,"DTE":61.534,"Industry":"Discount Stores","Sector":"Consumer Defensive","Beta":0.552,"Trailing PEG":2.9805,"Trailing PE":40.11618,"Trailing PS":1.1405071,"Quick Ratio":0.197,"Day High":98.725,"Day Low":96.6,"VS Average Volume":0.6033337448,"Company Summary":"Walmart Inc. engages in the operation of retail, wholesale, other units, and eCommerce worldwide. The company operates through three segments: Walmart U.S., Walmart International, and Sam's Club. It operates supercenters, supermarkets, hypermarkets, warehouse clubs, cash and carry stores, and discount stores under Walmart and Walmart Neighborhood Market brands; membership-only warehouse clubs; ecommerce websites, such as walmart.com.mx, walmart.ca, flipkart.com, PhonePe and other sites; and mobile commerce applications. The company offers grocery and consumables, including dairy, meat, bakery, deli, produce, dry, chilled or frozen packaged foods, alcoholic and nonalcoholic beverages, floral, snack foods, candy, other grocery items, health and beauty aids, paper goods, laundry and home care, baby care, pet supplies, and other consumable items; fuel, tobacco and other categories. It is also involved in the provision of health and wellness products covering pharmacy, optical and hearing services, and over-the-counter drugs and other medical products; and home and apparel including home improvement, outdoor living, gardening, furniture, apparel, jewelry, tools and power equipment, housewares, toys, seasonal items, mattresses and tire and battery centers. In addition, the company offers consumer electronics and accessories, software, video games, office supplies, appliances, and third-party gift cards. Further, it operates digital payment platforms; and offers financial services and related products, including money transfers, bill payments, money orders, check cashing, prepaid access, co-branded credit cards, installment lending, and earned wage access. Additionally, the company markets lines of merchandise under private brands, including Allswell, Athletic Works, Equate, and Free Assembly. The company was formerly known as Wal-Mart Stores, Inc. and changed its name to Walmart Inc. in February 2018. Walmart Inc. was founded in 1945 and is based in Bentonville, Arkansas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Baxter International Inc.","Symbol":"BAX","Current Price":"35.51","Latest MA":"32.17","Latest MA 5":34.7579997559,"Latest MA 9":33.0277777523,"Latest MA 20":32.1674999123,"Price Target":39.9175,"Difference from MA":"10.39%","Difference from Open":"-1.20%","Change from Yesterday":"-1.07%","Change from Last Report":"0.00","Latest Volume":"2,268,113","Market Cap":"18,167,801,856","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":12.32986,"PB Ratio":2.6052823,"Previous Close":35.94,"ROE":-0.042090002,"DTE":191.472,"Industry":"Medical Instruments & Supplies","Sector":"Healthcare","Beta":0.614,"Trailing PEG":2.366,"Trailing PE":"N\/A","Trailing PS":1.7081423,"Quick Ratio":0.537,"Day High":36.26,"Day Low":35.5,"VS Average Volume":0.462924796,"Company Summary":"Baxter International Inc., through its subsidiaries, engages in the provision of a portfolio of healthcare products worldwide. The company operates through three segments: Medical Products and Therapies, Healthcare Systems and Technologies, and Pharmaceuticals. It offers sterile intravenous (IV) solutions; infusion systems and devices; parenteral nutrition therapies; administrative sets; generic injectable pharmaceuticals; surgical hemostat and sealant products; advanced surgical equipment; smart bed systems; patient monitoring and diagnostic technologies; and respiratory health devices, as well as advanced equipment for the surgical space, operating room integration technologies, precision positioning devices, and other accessories. The company also provides respiratory health devices, specialty injectable pharmaceuticals, inhaled anesthetics, and drug compounding services. Its products are used in hospitals, nursing homes, rehabilitation centers, ambulatory surgery centers, doctors' offices, kidney dialysis centers and patients at home under physician supervision. The company sells its products through independent distributors, drug wholesalers, and specialty pharmacy or other alternate site providers. It has an agreement with Celerity Pharmaceuticals, LLC to develop acute care generic injectable premix and oncolytic products. Baxter International Inc. was incorporated in 1931 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Cameco Corporation","Symbol":"CCJ","Current Price":"45.17","Latest MA":"47.96","Latest MA 5":44.4129998779,"Latest MA 9":45.867221917,"Latest MA 20":47.9602497482,"Price Target":59.135155,"Difference from MA":"-5.81%","Difference from Open":"1.13%","Change from Yesterday":"3.69%","Change from Last Report":"0.00","Latest Volume":"3,012,500","Market Cap":"19,702,984,704","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":38.2839,"PB Ratio":3.0899453,"Previous Close":43.59,"ROE":0.027590001,"DTE":20.364,"Industry":"Uranium","Sector":"Energy","Beta":0.948,"Trailing PEG":null,"Trailing PE":167.3148,"Trailing PS":6.2832966,"Quick Ratio":0.802,"Day High":45.505,"Day Low":44.08,"VS Average Volume":0.7332245524,"Company Summary":"Cameco Corporation provides uranium for the generation of electricity. It operates through Uranium, Fuel Services, Westinghouse segments. The Uranium segment is involved in the exploration for, mining, and milling, purchase, and sale of uranium concentrate. The Fuel Services segment engages in the refining, conversion, and fabrication of uranium concentrate, as well as the purchase and sale of conversion services. This segment also produces CANDU reactor fuel bundles and other reactor components. The company offers nuclear fuel processing services. The Westinghouse segment engages in the manufacture of nuclear reactor technology original equipment. This segment provides products and services to commercial utilities and government agencies; and outage and maintenance services, engineering support, instrumentation and controls equipment, plant modification, and components and parts to nuclear reactors. It sells its uranium and fuel services to nuclear utilities in the Americas, Europe, and Asia. Cameco Corporation was incorporated in 1987 and is headquartered in Saskatoon, Canada.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Rivian Automotive, Inc.","Symbol":"RIVN","Current Price":"11.62","Latest MA":"12.80","Latest MA 5":12.3211199542,"Latest MA 9":13.0339555089,"Latest MA 20":12.8007799809,"Price Target":15.03536,"Difference from MA":"-9.26%","Difference from Open":"1.01%","Change from Yesterday":"1.44%","Change from Last Report":"0.00","Latest Volume":"18,008,778","Market Cap":"13,133,875,200","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":-4.2392697,"PB Ratio":2.0033805,"Previous Close":11.45,"ROE":-0.60447,"DTE":76.272,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":2.042,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":2.6426308,"Quick Ratio":3.618,"Day High":12.02,"Day Low":11.5,"VS Average Volume":0.50455318,"Company Summary":"Rivian Automotive, Inc., together with its subsidiaries, designs, develops, manufactures, and sells electric vehicles and accessories. The company offers consumer vehicles, including a two-row, five-passenger pickup truck under the R1T brand, a three-row, seven-passenger sport utility vehicle under the R1S name. It provides consumer services, such as digital financing and leasing, telematics-based insurance, vehicle maintenance and repair services, software services, and charging solutions. In addition, the company designs, develops, manufactures, and operates the Rivian Adventure Network Direct Current fast chargers, and offers access to Combined Charging Standard, as well as FleetOS, a proprietary, end-to-end centralized fleet management subscription platform. Further, it offers Rivian Commercial Van platform for Electric Delivery Van with collaboration with Amazon.com, Inc. The company sells its products directly to customers in the consumer and commercial markets. Rivian Automotive, Inc. was founded in 2009 and is based in Irvine, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Newmont Corporation","Symbol":"NEM","Current Price":"43.61","Latest MA":"45.03","Latest MA 5":44.8000006409,"Latest MA 9":45.9122224765,"Latest MA 20":45.0260001831,"Price Target":52.53833,"Difference from MA":"-3.14%","Difference from Open":"1.18%","Change from Yesterday":"1.56%","Change from Last Report":"0.00","Latest Volume":"4,173,698","Market Cap":"49,142,366,208","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":11.386423,"PB Ratio":1.6509559,"Previous Close":42.93,"ROE":0.11171,"DTE":29.798,"Industry":"Gold","Sector":"Basic Materials","Beta":0.534,"Trailing PEG":null,"Trailing PE":15.248253,"Trailing PS":2.6304662,"Quick Ratio":0.623,"Day High":43.939,"Day Low":42.6,"VS Average Volume":0.4230289544,"Company Summary":"Newmont Corporation engages in the production and exploration of gold. It also explores for copper, silver, zinc, and lead. The company has operations and\/or assets in the United States, Canada, Mexico, Dominican Republic, Peru, Suriname, Argentina, Chile, Australia, Papua New Guinea, Ecuador, Fiji, and Ghana. The company was founded in 1916 and is headquartered in Denver, Colorado.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Unity Software Inc.","Symbol":"U","Current Price":"27.24","Latest MA":"22.79","Latest MA 5":27.3020000916,"Latest MA 9":24.6722221629,"Latest MA 20":22.7870000954,"Price Target":27.77045,"Difference from MA":"19.54%","Difference from Open":"4.81%","Change from Yesterday":"6.29%","Change from Last Report":"0.00","Latest Volume":"9,489,956","Market Cap":"11,159,274,496","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":-26.192308,"PB Ratio":3.494996,"Previous Close":25.65,"ROE":-0.19419001,"DTE":68.679,"Industry":"Software - Application","Sector":"Technology","Beta":2.32,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":6.1542773,"Quick Ratio":2.351,"Day High":27.63,"Day Low":25.95,"VS Average Volume":0.8126704561,"Company Summary":"Unity Software Inc. operates a platform to create and grow games and interactive experiences for mobile phones, PCs, consoles, and extended reality devices in the United States, China, Hong Kong, Taiwan, Europe, the Middle East, Africa, the Asia Pacific, Canada, and Latin America. The company's platform offers artificial intelligence solutions that support developers through the entire development lifecycle, which includes prototyping, live service operation, user acquisition, and monetization. It also provides Create Solutions, a set of tools and services used to build, ship, and run real-time 2D and 3D content; and Grow Solutions, which allows customers to grow and engage their user base and monetize their content. In addition, the company offers enterprise support and consumption services; professional services, including consulting, platform integration, training, and custom application and workflow development services; and advertising and game publishing services. It provides its solutions directly through its online store, field sales operations, independent distributors, and resellers. The company serves enterprises, mid-market companies, and government and non-profit institutions; mid-sized, small, and independent businesses; and individuals across various industries. Unity Software Inc. was founded in 2004 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Alibaba Group Holding Limited","Symbol":"BABA","Current Price":"139.75","Latest MA":"116.22","Latest MA 5":136.5049978027,"Latest MA 9":131.0538884142,"Latest MA 20":116.2172494354,"Price Target":156.7365,"Difference from MA":"20.25%","Difference from Open":"-0.18%","Change from Yesterday":"4.31%","Change from Last Report":"0.00","Latest Volume":"27,113,732","Market Cap":"332,991,463,424","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":14.159575,"PB Ratio":0.32311577,"Previous Close":134.01,"ROE":0.102740005,"DTE":24.142,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":0.308,"Trailing PEG":0.7927,"Trailing PE":20.342796,"Trailing PS":0.33917564,"Quick Ratio":0.991,"Day High":141.95,"Day Low":138.76,"VS Average Volume":1.105257157,"Company Summary":"Alibaba Group Holding Limited, through its subsidiaries, provides technology infrastructure and marketing reach to help merchants, brands, retailers, and other businesses to engage with their users and customers in the People's Republic of China and internationally. The company operates through seven segments: China Commerce, International Commerce, Local Consumer Services, Cainiao, Cloud, Digital Media and Entertainment, and Innovation Initiatives and Others. It operates Taobao and Tmall, which are digital retail platforms; Alimama, a proprietary monetization platform; 1688.com and Alibaba.com, which are online wholesale marketplaces; AliExpress, a retail marketplace; Lazada, Trendyol, and Daraz that are e-commerce platforms; Freshippo, a retail platform for groceries and fresh goods; and Tmall Global, an import e-commerce platform. The company also operates Cainiao Network logistic services platform; Ele.me, an on-demand delivery and local services platform; Koubei, a restaurant and local services guide platform; and Fliggy, an online travel platform. In addition, it offers pay-for-performance, in-feed, and display marketing services; and Taobao Ad Network and Exchange, a real-time online bidding marketing exchange. Further, the company provides elastic computing, storage, network, security, database, big data, and IoT services; and hardware, software license, software installation, and application development and maintenance services. Additionally, it operates Youku, an online video platform; Quark, a platform for information search, storage, and consumption; Alibaba Pictures and other content platforms that provide online videos, films, live events, news feeds, literature, music, and others; Amap, a mobile digital map, navigation, and real-time traffic information app; DingTalk, a business efficiency mobile app; Tmall Genie smart speaker; and Qwen, an artificial intelligence chatbot. The company was incorporated in 1999 and is based in Hangzhou, the People's Republic of China.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Alight, Inc.","Symbol":"ALIT","Current Price":"6.97","Latest MA":"6.77","Latest MA 5":6.9252199695,"Latest MA 9":6.8295666667,"Latest MA 20":6.7653049599,"Price Target":10.4375,"Difference from MA":"2.97%","Difference from Open":"0.23%","Change from Yesterday":"0.00%","Change from Last Report":"0.00","Latest Volume":"5,001,436","Market Cap":"3,851,138,816","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":12.221229,"PB Ratio":0.85958785,"Previous Close":6.97,"ROE":-0.03092,"DTE":46.951,"Industry":"Software - Application","Sector":"Technology","Beta":1.157,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":1.6514317,"Quick Ratio":0.913,"Day High":7.08,"Day Low":6.9,"VS Average Volume":0.8467348781,"Company Summary":"Alight, Inc. provides cloud-based integrated digital human capital and business solutions worldwide. The company operates through two segments, Employer Solutions and Professional Services. The Employer Solutions segment offers employee wellbeing, integrated benefits administration, healthcare navigation, financial wellbeing, leave of absence management, retiree healthcare and payroll; and operates AI-led capabilities software. The Professional Services segment offers consulting offerings, such as cloud advisory, deployment, and optimization services for cloud platforms. The company provides Alight Worklife, an intuitive, cloud-based employee engagement platform. Its solutions enable employees to enrich their health, wealth, and wellbeing that helps organizations achieve a high-performance culture. Alight, Inc. was founded in 2020 and is based in Lincolnshire, Illinois.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Nu Holdings Ltd.","Symbol":"NU","Current Price":"11.55","Latest MA":"13.04","Latest MA 5":11.5890000687,"Latest MA 9":12.4949999576,"Latest MA 20":13.0362499561,"Price Target":14.585,"Difference from MA":"-11.36%","Difference from Open":"1.81%","Change from Yesterday":"3.08%","Change from Last Report":"0.00","Latest Volume":"53,860,473","Market Cap":"55,540,150,272","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":18.637096,"PB Ratio":7.262728,"Previous Close":11.21,"ROE":0.21545,"DTE":27.428,"Industry":"Banks - Regional","Sector":"Financial Services","Beta":"N\/A","Trailing PEG":null,"Trailing PE":28.8875,"Trailing PS":11.583676,"Quick Ratio":0.576,"Day High":11.71,"Day Low":11.31,"VS Average Volume":1.2583926882,"Company Summary":"Nu Holdings Ltd. provides digital banking platform in Brazil, Mexico, Colombia, Cayman Islands, Germany, Argentina, the United States, and Uruguay. It offers spending solutions comprising Nu credit and prepaid card, a digitally enabled card that acts as a credit and a prepaid card; Ultraviolet credit and prepaid card, a premium metal credit card for affluent customers; mobile payment solutions for NuAccount customers to make and receive transfers, pay bills, and make everyday purchases through their mobile phones; and Nu Shopping, an integrated mall that enables customers to purchase goods and services from various ecommerce retailers. The company also provides savings solutions, such as Nu Personal Accounts, a digital account solution for personal financial activities; Nu business prepaid and credit card; and Nu business accounts for entrepreneur customers and their businesses. In addition, it offers investing solutions, including Money Boxes for goal-based investing; Nucoin, a proprietary utility token for its loyalty program; NuInvest, which provides equity, fixed-income, stock options, ETF products, and multimarket funds; and NuCrypto, a solution for buying and selling cryptocurrencies through the Nu app. Further, the company provides borrowing solutions comprising Personal unsecured and secured loans; Pix financing that enables credit card and digital account customers to make free and instant peer-to-peer transfers; Boleto financing, which enables credit card and digital account customers to make payments using their credit line; purchase financing; and NuPay to make online purchases and pay for services through Nubank app. Additionally, it offers protection solutions, such as NuInsurance protection solutions, including life, mobile, auto, home, and financial protection insurance policies. The company was founded in 2013 and is headquartered in São Paulo, Brazil.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Teck Resources Ltd","Symbol":"TECK","Current Price":"41.63","Latest MA":"42.13","Latest MA 5":41.5160001526,"Latest MA 9":42.2588893975,"Latest MA 20":42.1325002136,"Price Target":44.839867,"Difference from MA":"-1.19%","Difference from Open":"1.46%","Change from Yesterday":"2.54%","Change from Last Report":"0.00","Latest Volume":"2,241,945","Market Cap":"21,007,706,112","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":22.873627,"PB Ratio":0.8083339,"Previous Close":40.6,"ROE":-0.03333,"DTE":36.777,"Industry":"Other Industrial Metals & Mining","Sector":"Basic Materials","Beta":1.373,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":2.3174524,"Quick Ratio":2.177,"Day High":41.92,"Day Low":40.9,"VS Average Volume":0.839409718,"Company Summary":"Teck Resources Limited engages in exploring for, acquiring, developing, and producing natural resources in Asia, Europe, and North America. The company operates through Steelmaking Coal, Copper, Zinc, and Energy segments. Its principal products include copper, zinc, steelmaking coal, and blended bitumen. The company also produces lead, silver, and molybdenum; and various specialty and other metals, chemicals, and fertilizers. In addition, it explores for gold. The company was formerly known as Teck Cominco Limited and changed its name to Teck Resources Limited in April 2009. The company was founded in 1913 and is headquartered in Vancouver, Canada.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Cinemark Holdings Inc Cinemark ","Symbol":"CNK","Current Price":"26.02","Latest MA":"29.68","Latest MA 5":26.9890003967,"Latest MA 9":29.0727783203,"Latest MA 20":29.679250164,"Price Target":33.11111,"Difference from MA":"-12.31%","Difference from Open":"-0.86%","Change from Yesterday":"-2.47%","Change from Last Report":"0.00","Latest Volume":"3,532,353","Market Cap":"3,182,961,664","Earning Date":"2025-02-19","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.484456,"PB Ratio":5.255452,"Previous Close":26.67,"ROE":0.67859,"DTE":572.771,"Industry":"Entertainment","Sector":"Communication Services","Beta":2.395,"Trailing PEG":1.5068,"Trailing PE":12.633495,"Trailing PS":1.0437652,"Quick Ratio":0.954,"Day High":26.85,"Day Low":25.88,"VS Average Volume":1.3384363382,"Company Summary":"Cinemark Holdings, Inc., together with its subsidiaries, engages in the motion picture exhibition business. It operates theatres in the United States and Latin America. The company was founded in 1984 and is headquartered in Plano, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Dun & Bradstreet Holdings, Inc.","Symbol":"DNB","Current Price":"9.06","Latest MA":"10.89","Latest MA 5":9.2540198169,"Latest MA 9":9.8622332062,"Latest MA 20":10.889004918,"Price Target":12.125,"Difference from MA":"-16.80%","Difference from Open":"0.33%","Change from Yesterday":"-0.49%","Change from Last Report":"0.00","Latest Volume":"2,807,150","Market Cap":"4,000,178,944","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":8.162251,"PB Ratio":1.2128648,"Previous Close":9.11,"ROE":-0.0072600003,"DTE":108.053,"Industry":"Financial Data & Stock Exchanges","Sector":"Financial Services","Beta":1.148,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":1.6795477,"Quick Ratio":0.49,"Day High":9.13,"Day Low":8.955,"VS Average Volume":0.861406039,"Company Summary":"Dun & Bradstreet Holdings, Inc. provides business to business data and analytics in North America and internationally. It offers finance and risk solutions, including D&B Finance Analytics, an online application that offers clients real time access to its information, monitoring, and portfolio analysis; D&B Direct, an application programming interface (API) that delivers risk and financial data directly into enterprise applications for real-time credit decision making; D&B Small Business, a suite of tools that allows SMBs to monitor and build their business credit file; D&B Enterprise Risk Assessment Manager, a solution for managing and automating credit decisioning and reporting; and D&B Risk Analytics, an online application that offers clients access to complete and up-to-date global information, monitoring, and portfolio analysis tool to mitigate supply chain, regulatory, and ESG assessment and related risk; Risk Guardian, a subscription-based online and API application that offers clients access to Northern Europe information, monitoring, and portfolio analysis; and D&B Beneficial Ownership that offers risk intelligence on ultimate beneficial ownership. The company also provides sales and marketing solutions, such as D&B Connect, an approach to master data management that allows customers to identify opportunities and potential risks within a business; D&B Optimizer, an integrated data management solution; D&B Direct, an API-enabled data management solution; D&B Rev.Up ABX, an open and agnostic platform that aligns marketing and sales teams to deliver an optimized and coordinated buying; D&B Audience Targeting, which helps clients to reach the right audiences with the right messages; D&B Visitor Intelligence that turns web visitors into leads; D&B Hoovers, a sales intelligence solution; and InfoTorg, an online SaaS application that provides information services. Dun & Bradstreet Holdings, Inc. was founded in 1841 and is headquartered in Jacksonville, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Carvana Co.","Symbol":"CVNA","Current Price":"234.05","Latest MA":"255.14","Latest MA 5":228.4799981689,"Latest MA 9":251.8311086019,"Latest MA 20":255.1374990845,"Price Target":274.656,"Difference from MA":"-8.27%","Difference from Open":"3.39%","Change from Yesterday":"5.58%","Change from Last Report":"0.00","Latest Volume":"2,299,866","Market Cap":"27,371,446,272","Earning Date":"2025-02-19","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":99.59575,"PB Ratio":24.756716,"Previous Close":221.68,"ROE":0.81534,"DTE":444.582,"Industry":"Auto & Truck Dealerships","Sector":"Consumer Cyclical","Beta":3.376,"Trailing PEG":null,"Trailing PE":146.28125,"Trailing PS":2.001861,"Quick Ratio":1.859,"Day High":236.19,"Day Low":227.375,"VS Average Volume":0.6629321236,"Company Summary":"Carvana Co., together with its subsidiaries, operates an e-commerce platform for buying and selling used cars in the United States. The company offers vehicle acquisition, inspection and reconditioning, online search and shopping experience, financing, complementary products, logistics network and distinctive fulfillment experience, and post-sale customer support services. It also operates auction sites. Carvana Co. was founded in 2012 and is based in Tempe, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Clarivate Plc","Symbol":"CLVT","Current Price":"4.57","Latest MA":"4.97","Latest MA 5":4.6570000534,"Latest MA 9":4.7461111747,"Latest MA 20":4.96575,"Price Target":5.88889,"Difference from MA":"-8.07%","Difference from Open":"3.75%","Change from Yesterday":"2.13%","Change from Last Report":"0.00","Latest Volume":"3,250,502","Market Cap":"3,157,327,616","Earning Date":"2025-02-19","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":6.168919,"PB Ratio":0.6141531,"Previous Close":4.47,"ROE":-0.1144,"DTE":89.391,"Industry":"Information Technology Services","Sector":"Technology","Beta":1.17,"Trailing PEG":0.2085,"Trailing PE":"N\/A","Trailing PS":1.234923,"Quick Ratio":0.755,"Day High":4.61,"Day Low":4.4,"VS Average Volume":0.6223917675,"Company Summary":"Clarivate Plc operates as an information services provider in the Americas, the Middle East, Africa, Europe, and the Asia Pacific. It operates through three segments: Academia & Government, Life Sciences & Healthcare, and Intellectual Property. The company provides scientific and academic research, a connect data, solutions, and expertise so that research institutions can thrive; ProQuest One solutions provide access to multidisciplinary curated content across a variety of formats including data bases, dissertations, news, primary sources, books, and video; Alma, Polari, and Vega, a solution provides a proven, flexible, and unified library services platform for libraries to effectively manage their resources and unique materials. It offers IPFolio and FoundationIP, manages platform that allows companies to secure, manage, and protect their IP assets through advanced workflow automation technology, superior data and analytics, and unparalleled industry expertise and support; patent services; Derwent Innovation patent search software helps patent professionals make faster, more patentability, freedom-to-operate, and validity decisions; and CompuMark trademark search solutions as well as trademark watch and other managed services. In addition, the company provides Cortellis, a suite of products equip customers with the intelligence needed to make decisions spanning the entire drug development lifecycle. It serves corporations, universities, law firms, government agencies, public libraries, and other professional services organizations. The company was formerly known as Clarivate Analytics Plc and changed its name to Clarivate Plc in May 2020. Clarivate Plc was founded in 1864 and is headquartered in London, the United Kingdom.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Host Hotels & Resorts, Inc.","Symbol":"HST","Current Price":"15.91","Latest MA":"16.51","Latest MA 5":16.2570001678,"Latest MA 9":16.4694443851,"Latest MA 20":16.5107498665,"Price Target":20.02778,"Difference from MA":"-3.61%","Difference from Open":"-0.84%","Change from Yesterday":"-0.68%","Change from Last Report":"0.00","Latest Volume":"2,925,866","Market Cap":"11,275,745,280","Earning Date":"2025-02-19","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":16.407215,"PB Ratio":1.6834143,"Previous Close":16.02,"ROE":0.10395,"DTE":83.267,"Industry":"REIT - Hotel & Motel","Sector":"Real Estate","Beta":1.321,"Trailing PEG":1.8883,"Trailing PE":16.075758,"Trailing PS":1.9813294,"Quick Ratio":1.681,"Day High":16.21,"Day Low":15.9,"VS Average Volume":0.3839106515,"Company Summary":"Host Hotels & Resorts, Inc. is an S&P 500 company and is the largest lodging real estate investment trust and one of the largest owners of luxury and upper-upscale hotels. The Company currently owns 76 properties in the United States and five properties internationally totaling approximately 43,400 rooms. The Company also holds non-controlling interests in seven domestic and one international joint ventures. Guided by a disciplined approach to capital allocation and aggressive asset management, the Company partners with premium brands such as Marriott, Ritz-Carlton, Westin, Sheraton, W, St. Regis, The Luxury Collection, Hyatt, Fairmont, 1 Hotels, Hilton, Four Seasons, Swissôtel, ibis and Novotel, as well as independent brands.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Toast, Inc.","Symbol":"TOST","Current Price":"37.62","Latest MA":"39.89","Latest MA 5":37.7930000305,"Latest MA 9":39.060555776,"Latest MA 20":39.8867500305,"Price Target":42.35385,"Difference from MA":"-5.67%","Difference from Open":"1.39%","Change from Yesterday":"3.95%","Change from Last Report":"0.00","Latest Volume":"3,640,612","Market Cap":"21,521,500,160","Earning Date":"2025-02-19","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":107.5,"PB Ratio":13.930026,"Previous Close":36.2,"ROE":0.01387,"DTE":1.553,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.988,"Trailing PEG":null,"Trailing PE":1254.1667,"Trailing PS":4.339012,"Quick Ratio":1.889,"Day High":37.94,"Day Low":36.58,"VS Average Volume":0.5903199905,"Company Summary":"Toast, Inc. operates a cloud-based digital technology platform for the restaurant industry in the United States, Ireland, and India. The company offers software products for restaurant operations and point of sale, such as Toast POS, Toast now, multi-location management, kitchen display system, Toast mobile order and pay, Toast catering and events, Toast invoicing, Toast tables, and restaurant retail; and hardware products, including Toast flex, Toast flex for guest, Toast go 2, Toast tap, kiosks, and Delphi by Toast. It provides toast online ordering and toast takeout, first-party delivery toast delivery services, and third-party delivery integrations and orders hub; and loyalty, email marketing, and toast gift cards. In addition, the company offers payroll and team management, Sling by Toast, Toast pay card and payout, and tips manager, as well as partner-enabled products comprising insurance and benefits; supply chain and accounting products, such as xtraCHEF by toast; and financial technology solutions consisting of payment processing, toast capital, and purchase plans. Further, it offers reporting and analytics, Toast shop, and Toast partner connect and application programming interfaces. The company was formerly known as Opti Systems, Inc. and changed its name to Toast, Inc. in May 2012. Toast, Inc. was incorporated in 2011 and is headquartered in Boston, Massachusetts.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"},{"Company Name":"Blue Owl Capital Corporation","Symbol":"OBDC","Current Price":"15.12","Latest MA":"15.23","Latest MA 5":15.3650001526,"Latest MA 9":15.4138890372,"Latest MA 20":15.2282500744,"Price Target":16.0,"Difference from MA":"-0.68%","Difference from Open":"-1.47%","Change from Yesterday":"-1.46%","Change from Last Report":"0.00","Latest Volume":"2,393,664","Market Cap":"7,726,576,128","Earning Date":"2025-02-19","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":8.8970585,"PB Ratio":0.9914782,"Previous Close":15.35,"ROE":0.099379994,"DTE":125.28,"Industry":"Asset Management","Sector":"Financial Services","Beta":0.878,"Trailing PEG":null,"Trailing PE":9.885621,"Trailing PS":4.838915,"Quick Ratio":1.235,"Day High":15.355,"Day Low":15.105,"VS Average Volume":0.8864749158,"Company Summary":"Blue Owl Capital Corporation is a business development company. It specializes in direct and fund of fund investments. The fund makes investments in senior secured, direct lending or unsecured loans, subordinated loans or mezzanine loans and also considers equity-related securities including warrants and preferred stocks also pursues preferred equity investments, first lien, unitranche, and second lien term loans and common equity investments. Within private equity, it seeks to invest in growth, acquisitions, market or product expansion, refinancings and recapitalizations. It seeks to invest in middle market and upper middle market companies based in the United States, with EBITDA between $10 million and $250 million annually and\/or annual revenue of $50 million and $2.5 billion at the time of investment. It seeks to invest in investments with maturities typically between three and ten years. It seeks to make investments generally ranging in size between $20 million and $250 million.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 20:27:32"}]