[{"Company Name":"SLM Corporation","Symbol":"SLM","Current Price":"29.08","Latest MA":"23.28","Price Target":31.66667,"Difference from MA":"24.92%","Difference from Open":"1.15%","Change from Yesterday":"1.79%","Change from Last Report":"0.00","Latest Volume":"3,034,222","Market Cap":"6,174,556,160","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":9.514181,"PB Ratio":3.279576,"ROE":0.33828,"DTE":282.907,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.171,"Trailing PEG":null,"Trailing PE":10.027586,"Trailing PS":3.8928165,"Quick Ratio":1.258,"Day High":29.2,"Day Low":28.74,"VS Average Volume":1.1735373917,"Company Summary":"SLM Corporation, through its subsidiaries, originates and services private education loans to students and their families to finance the cost of their education in the United States. It is also involved in the provision of retail deposit accounts, including certificates of deposit, money market accounts, and high-yield savings accounts; and interest-bearing omnibus accounts. The company was formerly known as New BLC Corporation and changed its name to SLM Corporation in December 2013. SLM Corporation was founded in 1972 and is headquartered in Newark, Delaware.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Columbia Banking System, Inc.","Symbol":"COLB","Current Price":"28.77","Latest MA":"25.60","Price Target":33.36364,"Difference from MA":"12.38%","Difference from Open":"-0.03%","Change from Yesterday":"-0.24%","Change from Last Report":"0.00","Latest Volume":"1,299,864","Market Cap":"6,028,207,104","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":10.530593,"PB Ratio":1.1430274,"ROE":0.09771,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.849,"Trailing PEG":null,"Trailing PE":12.400863,"Trailing PS":3.2963178,"Quick Ratio":"N\/A","Day High":28.915,"Day Low":28.47,"VS Average Volume":0.8476253573,"Company Summary":"Columbia Banking System, Inc. operates as the holding company of Umpqua Bank that provides banking, private banking, mortgage, and other financial services in the United States. The company offers deposit products, including business, non-interest bearing checking, interest-bearing checking and savings, money market, and certificate of deposit accounts; and insured cash sweep and other investment sweep solutions. It also provides commercial lending products, such as commercial lines of credit and term loans, accounts receivable and inventory financing, international trade finance, commercial property loans, multifamily loans, equipment loans, commercial equipment leases, real estate construction loans and permanent financing, and small business administration program financing, as well as capital markets. In addition, the company offers wealth management comprising financial planning, investment, trust, and insurance; treasury management, which includes digital and mobile banking solutions, ACH, wires, positive pay, remote deposit capture, integrated payments, integrated receivables, lockbox, cash vault, real-time payments, commercial card, and foreign exchange and international banking related products, as well as merchant services; and brokerage services, residential real estate loans and consumer loans. It serves its products to corporate, institutional, small business, and individual customers. The company was founded in 1953 and is headquartered in Tacoma, Washington.","Stock Sentiment":"N\/A","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Texas Instruments Incorporated","Symbol":"TXN","Current Price":"197.05","Latest MA":"198.25","Price Target":208.31448,"Difference from MA":"-0.60%","Difference from Open":"0.64%","Change from Yesterday":"0.93%","Change from Last Report":"0.00","Latest Volume":"6,995,216","Market Cap":"179,752,370,176","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":32.5002,"PB Ratio":10.407204,"ROE":0.29293,"DTE":84.399,"Industry":"Semiconductors","Sector":"Technology","Beta":0.98,"Trailing PEG":3.1605,"Trailing PE":36.626392,"Trailing PS":11.44118,"Quick Ratio":3.048,"Day High":198.68,"Day Low":195.3,"VS Average Volume":1.2171877966,"Company Summary":"Texas Instruments Incorporated designs, manufactures, and sells semiconductors to electronics designers and manufacturers in the United States and internationally. The company operates through Analog and Embedded Processing segments. The Analog segment offers power products to manage power requirements across various voltage levels, including battery-management solutions, DC\/DC switching regulators, AC\/DC and isolated controllers and converters, power switches, linear regulators, voltage references, and lighting products. This segment provides signal chain products that sense, condition, and measure signals to allow information to be transferred or converted for further processing and control, including amplifiers, data converters, interface products, motor drives, clocks, and logic and sensing products. The Embedded Processing segment offers microcontrollers that are used in electronic equipment; digital signal processors for mathematical computations; and applications processors for specific computing activity. This segment offers products for use in various markets, such as industrial, automotive, personal electronics, communications equipment, enterprise systems, and calculators and other. It provides DLP products primarily for use in project high-definition images; calculators; and application-specific integrated circuits. The company markets and sells its semiconductor products through direct sales and distributors, as well as through its website. Texas Instruments Incorporated was founded in 1930 and is headquartered in Dallas, Texas.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"American Airlines Group, Inc.","Symbol":"AAL","Current Price":"18.66","Latest MA":"12.87","Price Target":20.24273,"Difference from MA":"44.94%","Difference from Open":"-2.05%","Change from Yesterday":"0.11%","Change from Last Report":"0.00","Latest Volume":"57,969,559","Market Cap":"12,262,064,128","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":7.6209927,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Airlines","Sector":"Industrials","Beta":1.399,"Trailing PEG":0.2271,"Trailing PE":44.428574,"Trailing PS":0.22871439,"Quick Ratio":0.422,"Day High":19.1,"Day Low":18.37,"VS Average Volume":2.1682076256,"Company Summary":"American Airlines Group Inc., through its subsidiaries, operates as a network air carrier. The company provides scheduled air transportation services for passengers and cargo through its hubs in Charlotte, Chicago, Dallas\/Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix, and Washington, D.C., as well as through partner gateways in London, Doha, Madrid, Seattle\/Tacoma, Sydney, and Tokyo. It operates a mainline fleet of 965 aircraft. The company was formerly known as AMR Corporation and changed its name to American Airlines Group Inc. in December 2013. American Airlines Group Inc. was founded in 1926 and is headquartered in Fort Worth, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Elevance Health, Inc.","Symbol":"ELV","Current Price":"390.73","Latest MA":"469.67","Price Target":496.65475,"Difference from MA":"-16.81%","Difference from Open":"2.16%","Change from Yesterday":"0.39%","Change from Last Report":"0.00","Latest Volume":"2,092,355","Market Cap":"90,619,281,408","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":11.209754,"PB Ratio":2.0701697,"ROE":0.15504,"DTE":61.87,"Industry":"Healthcare Plans","Sector":"Healthcare","Beta":0.853,"Trailing PEG":0.7269,"Trailing PE":14.223882,"Trailing PS":0.5207556,"Quick Ratio":1.34,"Day High":392.55,"Day Low":379.79,"VS Average Volume":1.1013345362,"Company Summary":"Elevance Health, Inc., together with its subsidiaries, operates as a health benefits company in the United States. The company operates through four segments: Health Benefits, CarelonRx, Carelon Services, and Corporate & Other. It offers a variety of health plans and services to program members; health products; an array of fee-based administrative managed care services; and specialty and other insurance products and services, such as stop loss, dental, vision, life, disability, and supplemental health insurance benefits. The company operates in the pharmacy services business; and markets and offers pharmacy services, including pharmacy benefit management, as well as home delivery and specialty pharmacies, claims adjudication, formulary management, pharmacy networks, rebate administration, a prescription drug database, and member services. In addition, it provides healthcare-related services and capabilities, including utilization management, behavioral health, integrated care delivery, palliative care, payment integrity services, subrogation services, and health and wellness programs, as well as services related to data management, information technology, and business operations. Further, the company is involved in the National Government Services business. The company provides its services under the Anthem Blue Cross and Blue Shield, Wellpoint, and Carelon brand names. The company was formerly known as Anthem, Inc. and changed its name to Elevance Health, Inc. in June 2022. Elevance Health, Inc. was incorporated in 2001 and is headquartered in Indianapolis, Indiana.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"McCormick & Company, Incorporat","Symbol":"MKC","Current Price":"73.24","Latest MA":"76.64","Price Target":84.34438,"Difference from MA":"-4.44%","Difference from Open":"-1.59%","Change from Yesterday":"-1.36%","Change from Last Report":"0.00","Latest Volume":"1,596,795","Market Cap":"19,657,689,088","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":23.490847,"PB Ratio":3.6252043,"ROE":0.15067,"DTE":84.828,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.764,"Trailing PEG":2.4197,"Trailing PE":24.911564,"Trailing PS":2.9434288,"Quick Ratio":0.274,"Day High":74.515,"Day Low":73.15,"VS Average Volume":0.9095214688,"Company Summary":"McCormick & Company, Incorporated manufactures, markets, and distributes spices, seasoning mixes, condiments, and other flavorful products to the food industry. It operates in two segments, Consumer and Flavor Solutions. The Consumer segment offers spices, herbs, and seasonings, as well as condiments and sauces, and desserts. This segment markets its products under the McCormick, French's, Frank's RedHot, Lawry's, Cholula Hot Sauce, Gourmet Garden, Club House, and OLD BAY brands in the Americas; Ducros, Schwartz, Kamis, LA Drogheria, and Vahiné brands in Europe, the Middle East, and Africa; McCormick and DaQiao brands in the Asia\/Pacific; McCormick, Aeroplane, and Gourmet Garden brands in China; and the McCormick brand and other brands in Australia, as well as markets regional and ethnic brands, such as Zatarain's, Stubb's, Thai Kitchen, and Simply Asia. It also supplies its products under the private labels. This segment serves retailers comprising grocery, mass merchandise, warehouse clubs, discount and drug stores, and e-commerce retailers directly and indirectly through distributors and wholesale foodservice suppliers. The Flavor Solutions segment offers seasoning blends, spices and herbs, condiments, coating systems, and compound flavors to multinational food manufacturers and foodservice customers. It serves foodservice customers directly and indirectly through distributors. The company was founded in 1889 and is headquartered in Hunt Valley, Maryland.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Alaska Air Group, Inc.","Symbol":"ALK","Current Price":"67.40","Latest MA":"46.84","Price Target":82.42733,"Difference from MA":"43.90%","Difference from Open":"-3.58%","Change from Yesterday":"-2.15%","Change from Last Report":"0.00","Latest Volume":"4,321,574","Market Cap":"8,556,093,440","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":8.64127,"PB Ratio":1.8979499,"ROE":0.07513,"DTE":137.129,"Industry":"Airlines","Sector":"Industrials","Beta":1.593,"Trailing PEG":null,"Trailing PE":26.85259,"Trailing PS":0.7956196,"Quick Ratio":0.483,"Day High":70.21,"Day Low":67.06,"VS Average Volume":1.6571704228,"Company Summary":"Alaska Air Group, Inc., through its subsidiaries, operates airlines. It operates through three segments: Mainline, Regional, and Horizon. The company offers scheduled air transportation services on Boeing jet aircraft for passengers and cargo in the United States, and in parts of Canada, Mexico, Costa Rica, Belize, Guatemala, and the Bahamas; and for passengers across a shorter distance network within the United States, Canada, and Mexico. Alaska Air Group, Inc. was founded in 1932 and is based in Seattle, Washington.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Union Pacific Corporation","Symbol":"UNP","Current Price":"235.80","Latest MA":"236.43","Price Target":256.7932,"Difference from MA":"-0.27%","Difference from Open":"-0.39%","Change from Yesterday":"-0.39%","Change from Last Report":"0.00","Latest Volume":"2,243,025","Market Cap":"142,955,413,504","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":19.480375,"PB Ratio":8.62946,"ROE":0.43396,"DTE":197.154,"Industry":"Railroads","Sector":"Industrials","Beta":1.056,"Trailing PEG":2.4665,"Trailing PE":21.692732,"Trailing PS":5.885845,"Quick Ratio":0.56,"Day High":237.0,"Day Low":234.25,"VS Average Volume":0.8375581066,"Company Summary":"Union Pacific Corporation, through its subsidiary, Union Pacific Railroad Company, operates in the railroad business in the United States. The company offers transportation services for grain and grain products, fertilizers, food and refrigerated products, and coal and renewables to grain processors, animal feeders, ethanol producers, renewable biofuel producers, and other agricultural users; and construction products, industrial chemicals, plastics, forest products, specialized products, metals and ores, petroleum, liquid petroleum gases, soda ash, and sand, as well as finished automobiles, automotive parts, and merchandise in intermodal containers. Union Pacific Corporation was founded in 1862 and is headquartered in Omaha, Nebraska.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Intuitive Surgical, Inc.","Symbol":"ISRG","Current Price":"610.45","Latest MA":"495.59","Price Target":583.1875,"Difference from MA":"23.18%","Difference from Open":"0.40%","Change from Yesterday":"1.05%","Change from Last Report":"0.00","Latest Volume":"2,022,149","Market Cap":"217,429,475,328","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":77.00333,"PB Ratio":13.953462,"ROE":0.15973,"DTE":"N\/A","Industry":"Medical Instruments & Supplies","Sector":"Healthcare","Beta":1.389,"Trailing PEG":4.5117,"Trailing PE":97.98556,"Trailing PS":27.638521,"Quick Ratio":3.293,"Day High":614.72,"Day Low":602.45,"VS Average Volume":1.4526275032,"Company Summary":"Intuitive Surgical, Inc. develops, manufactures, and markets products that enable physicians and healthcare providers to enhance the quality of and access to minimally invasive care in the United States and internationally. The company offers the da Vinci Surgical System that enables complex surgery using a minimally invasive approach; and Ion endoluminal system, which extends its commercial offerings beyond surgery into diagnostic procedures enabling minimally invasive biopsies in the lung. It also provides a suite of stapling, energy, and core instrumentation for its multi-port da Vinci surgical systems; progressive learning pathways to support the use of its technology; infrastructure of service and support specialists, a complement of services to its customers, including installation, repair, maintenance, 24\/7 technical support, and proactive system health monitoring; and integrated digital capabilities providing connected offerings, streamlining performance for hospitals with program-enhancing insights. The company sells its products through direct sales organizations, such as capital and clinical sales teams. It has a collaboration agreement with FluoGuide A\/S for head & neck cancer. The company was incorporated in 1995 and is headquartered in Sunnyvale, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"TAL Education Group","Symbol":"TAL","Current Price":"9.13","Latest MA":"9.88","Price Target":13.85947,"Difference from MA":"-7.57%","Difference from Open":"-0.76%","Change from Yesterday":"-1.40%","Change from Last Report":"0.00","Latest Volume":"10,565,067","Market Cap":"5,517,104,128","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":20.032034,"PB Ratio":1.470683,"ROE":0.019609999,"DTE":9.291,"Industry":"Education & Training Services","Sector":"Consumer Defensive","Beta":0.033,"Trailing PEG":0.739,"Trailing PE":76.083336,"Trailing PS":3.0039492,"Quick Ratio":2.67,"Day High":9.18,"Day Low":8.62,"VS Average Volume":1.6832508442,"Company Summary":"TAL Education Group provides K-12 after-school tutoring services in the People's Republic of China. It provides learning services primarily through small-classes services; personalized premium services; and learning content solutions, such as print books, smart books, mobile apps, and AI-driven learning devices. The company also operates www.xueersi.com, an online education platform; provides investment management and consulting services; develops and sells software and networks, as well as related consulting services; and sells educational materials and products. It offers its services under the Haoweilai and Think Academy brands. TAL Education Group was founded in 2003 and is headquartered in Beijing, the People's Republic of China.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Northern Trust Corporation","Symbol":"NTRS","Current Price":"107.39","Latest MA":"94.12","Price Target":109.5,"Difference from MA":"14.10%","Difference from Open":"0.09%","Change from Yesterday":"-0.33%","Change from Last Report":"0.00","Latest Volume":"1,719,651","Market Cap":"21,286,631,424","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":13.660191,"PB Ratio":1.7941992,"ROE":0.13732,"DTE":"N\/A","Industry":"Asset Management","Sector":"Financial Services","Beta":1.073,"Trailing PEG":0.8896,"Trailing PE":13.373599,"Trailing PS":2.70905,"Quick Ratio":"N\/A","Day High":107.75,"Day Low":106.48,"VS Average Volume":1.4018958783,"Company Summary":"Northern Trust Corporation, a financial holding company, provides wealth management, asset servicing, asset management, and banking solutions for corporations, institutions, families, and individuals worldwide. It operates in two segments, Asset Servicing and Wealth Management. The Asset Servicing segment offers asset servicing and related services, including custody, fund administration, investment operations outsourcing, investment management, investment risk and analytical services, employee benefit services, securities lending, foreign exchange, treasury management, brokerage services, transition management services, banking, and cash management services. This segment serves corporate and public retirement funds, foundations, endowments, fund managers, insurance companies, sovereign wealth funds, and other institutional investors. The Wealth Management segment offers trust, investment management, custody, and philanthropic; financial consulting; guardianship and estate administration; family business consulting; family financial education; brokerage services; and private and business banking services. This segment serves high-net-worth individuals and families, business owners, executives, professionals, retirees, and established privately held businesses. The company also provides asset management services, such as active and passive equity; active and passive fixed income; cash management; muti-asset and alternative asset classes comprising private equity and hedge funds of funds; and multi-manager advisory services and products through separately managed accounts, bank common and collective funds, registered investment companies, exchange traded funds, non-U.S. collective investment funds, and unregistered private investment funds. In addition, it offers overlay and other risk management services. Northern Trust Corporation was founded in 1889 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Freeport-McMoRan, Inc.","Symbol":"FCX","Current Price":"39.09","Latest MA":"44.39","Price Target":50.18381,"Difference from MA":"-11.95%","Difference from Open":"-3.34%","Change from Yesterday":"-3.00%","Change from Last Report":"0.00","Latest Volume":"12,434,228","Market Cap":"56,169,594,880","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":20.859236,"PB Ratio":3.20095,"ROE":0.16870001,"DTE":33.531,"Industry":"Copper","Sector":"Basic Materials","Beta":1.91,"Trailing PEG":10.2244,"Trailing PE":28.326088,"Trailing PS":2.190702,"Quick Ratio":1.048,"Day High":40.5,"Day Low":39.02,"VS Average Volume":1.0896101609,"Company Summary":"Freeport-McMoRan Inc. engages in the mining of mineral properties in North America, South America, and Indonesia. It primarily explores for copper, gold, molybdenum, silver, and other metals. The company's assets include the Grasberg minerals district in Indonesia; Morenci, Bagdad, Safford, Sierrita, and Miami in Arizona; Chino and Tyrone in New Mexico; and Henderson and Climax in Colorado, North America, as well as Cerro Verde in Peru and El Abra in Chile. The company was formerly known as Freeport-McMoRan Copper & Gold Inc. and changed its name to Freeport-McMoRan Inc. in July 2014. Freeport-McMoRan Inc. was incorporated in 1987 and is headquartered in Phoenix, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"F.N.B. Corporation","Symbol":"FNB","Current Price":"15.55","Latest MA":"14.60","Price Target":18.57143,"Difference from MA":"6.48%","Difference from Open":"-3.24%","Change from Yesterday":"-2.32%","Change from Last Report":"0.00","Latest Volume":"3,434,186","Market Cap":"5,592,028,672","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":9.37877,"PB Ratio":0.89480954,"ROE":0.06687,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.976,"Trailing PEG":null,"Trailing PE":12.244095,"Trailing PS":3.7459998,"Quick Ratio":"N\/A","Day High":16.07,"Day Low":15.36,"VS Average Volume":1.3940605844,"Company Summary":"F.N.B. Corporation, a bank and financial holding company, provides a range of financial products and services primarily to consumers, corporations, governments, and small- to medium-sized businesses in the United States. The company operates through three segments: Community Banking, Wealth Management, and Insurance. The Community Banking segment offers commercial and consumer banking services, including corporate and small business banking, investment real estate financing, business credit, capital market, and lease financing services. It also provides consumer banking products and services, such as deposit products, mortgage and consumer lending services, and mobile and online banking services. The Wealth Management segment provides personal and corporate fiduciary services comprising administration of decedent and trust estates; and securities brokerage and investment advisory services, mutual funds, and annuities. The Insurance segment comprises commercial and personal insurance, and reinsurance products, as well as mezzanine financing options for small- to medium-sized businesses. The company operates community banking branches in Pennsylvania, Ohio, Maryland, West Virginia, North Carolina, South Carolina, Washington, D.C., and Virginia. F.N.B. Corporation was founded in 1864 and is headquartered in Pittsburgh, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"CSX Corporation","Symbol":"CSX","Current Price":"33.24","Latest MA":"33.78","Price Target":37.96615,"Difference from MA":"-1.60%","Difference from Open":"0.06%","Change from Yesterday":"-0.09%","Change from Last Report":"0.00","Latest Volume":"13,457,729","Market Cap":"64,100,683,776","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":16.97729,"PB Ratio":4.9574947,"ROE":0.29458,"DTE":147.913,"Industry":"Railroads","Sector":"Industrials","Beta":1.191,"Trailing PEG":2.1277,"Trailing PE":17.680853,"Trailing PS":4.3662343,"Quick Ratio":1.195,"Day High":33.5,"Day Low":33.05,"VS Average Volume":1.0997962173,"Company Summary":"CSX Corporation, together with its subsidiaries, provides rail-based freight transportation services. The company offers rail services; and transportation of intermodal containers and trailers, as well as other transportation services, such as rail-to-truck transfers and bulk commodity operations. It also transports chemicals, agricultural and food products, minerals, automotive, forest products, fertilizers, and metals and equipment; and coal, coke, and iron ore to electricity-generating power plants, steel manufacturers, and industrial plants, as well as exports coal to deep-water port facilities. In addition, the company provides intermodal services through a network of approximately 30 terminals transporting manufactured consumer goods in containers; and drayage services, including the pickup and delivery of intermodal shipments. It serves the automotive industry with distribution centers and storage locations, as well as connects non-rail served customers through transferring products, such as plastics and ethanol from rail to trucks. The company operates approximately 20,000 route mile rail network, which serves various population centers in 26 states east of the Mississippi River, the District of Columbia, and the Canadian provinces of Ontario and Quebec, as well as owns and leases approximately 3,500 locomotives. It serves production and distribution facilities through track connections. CSX Corporation was incorporated in 1978 and is headquartered in Jacksonville, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Valley National Bancorp","Symbol":"VLY","Current Price":"9.80","Latest MA":"8.68","Price Target":11.05,"Difference from MA":"12.86%","Difference from Open":"0.51%","Change from Yesterday":"-0.41%","Change from Last Report":"0.00","Latest Volume":"8,565,525","Market Cap":"5,473,947,136","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.876442,"PB Ratio":0.75407815,"ROE":0.049429998,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.086,"Trailing PEG":null,"Trailing PE":15.806452,"Trailing PS":3.4710371,"Quick Ratio":"N\/A","Day High":9.825,"Day Low":9.665,"VS Average Volume":1.1105496398,"Company Summary":"Valley National Bancorp operates as the holding company for Valley National Bank that provides various commercial, private banking, retail, insurance, and wealth management financial services products. It operates through Consumer Banking, Commercial Banking, and Treasury and Corporate other segments. The company offers non-interest bearing, savings, NOW, money market, and time deposit accounts; commercial and industrial, commercial real estate, residential mortgage, and automobile loans; loans secured by the cash surrender value of life insurance; home equity loans and lines of credit; automobile financing; and secured and unsecured other consumer loans. It also invests in various securities and interest-bearing deposits with other banks; and provides international banking services, such as standby and documentary letters of credit, and related products, as well as foreign exchange transactions, documentary collections, and foreign wire transfers services. In addition, the company offers investment services for individuals and small to medium sized businesses; and trusts investment strategies designed for various investment profiles and objectives. Further, it provides trust services, such as living and testamentary trusts, investment management, custodial and escrow services, and estate administration to individuals; tax credit advisory services; brokerage services; property and casualty, life, health, and title insurance agency services; and health care equipment lending and other commercial equipment leasing services, as well as owns real estate related investments. Additionally, the company offers online, mobile, and telephone banking services; receivable, payment, and security solution, merchant, payroll processing, and liquidity services; credit cards; and drive-in and night deposit, automated teller machine, remote deposit capture, and safe deposit facility services. Valley National Bancorp was founded in 1927 and is headquartered in Morristown, New Jersey.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Steel Dynamics, Inc.","Symbol":"STLD","Current Price":"122.89","Latest MA":"125.85","Price Target":137.40385,"Difference from MA":"-2.36%","Difference from Open":"-1.68%","Change from Yesterday":"-1.44%","Change from Last Report":"0.00","Latest Volume":"1,852,516","Market Cap":"18,708,625,408","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":10.381923,"PB Ratio":2.0708628,"ROE":0.19703,"DTE":40.575,"Industry":"Steel","Sector":"Basic Materials","Beta":1.325,"Trailing PEG":null,"Trailing PE":11.05081,"Trailing PS":1.0450768,"Quick Ratio":1.198,"Day High":125.9,"Day Low":122.59,"VS Average Volume":1.2536906575,"Company Summary":"Steel Dynamics, Inc., together with its subsidiaries, operates as a steel producer and metal recycler in the United States. The Steel Operations segment offers hot rolled, cold rolled, and coated steel products; parallel flange beams and channel sections, flat bars, large unequal leg angles, and reinforcing steel bars, as well as standard strength carbon, intermediate alloy hardness, and premium grade rail products; engineered special-bar-quality products, merchant-bar-quality products, and other engineered round steel bars; channels, angles, flats, merchant rounds, and reinforcing steel bars; and specialty shapes and light structural steel products. This segment also engages in turning, polishing, straightening, chamfering, precision saw-cutting, and heat treating of bar products. Its products are used in construction, automotive, manufacturing, transportation, heavy and agriculture equipment, and pipe and tube markets. The Metals Recycling Operations segment is involved in the ferrous and nonferrous scrap metal processing, transportation, marketing, brokerage, and scrap management services. Its ferrous products include heavy melting steel, busheling, bundled scrap, shredded scrap, steel turnings, and cast-iron products; and nonferrous products comprise aluminum, brass, copper, stainless steel, and other nonferrous metals. The Steel Fabrication Operations segment produces steel non-residential building components, such as steel joists, girders, trusses, and steel deck products for non-residential steel fabricators, metal building companies, general construction contractors, developers, owners, brokers, and governmental entities, as well as e-commerce warehouses, data centers, metal buildings, and education and commercial building projects. The Aluminum Operations segment offers recycled aluminum flat rolled products. The company also exports its products. Steel Dynamics, Inc. was founded in 1993 and is headquartered in Fort Wayne, Indiana.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Associated Banc-Corp","Symbol":"ASB","Current Price":"25.52","Latest MA":"22.84","Price Target":27.77778,"Difference from MA":"11.75%","Difference from Open":"0.24%","Change from Yesterday":"-0.43%","Change from Last Report":"0.00","Latest Volume":"2,633,279","Market Cap":"4,212,203,776","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":10.630012,"PB Ratio":0.90049404,"ROE":0.04542,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.904,"Trailing PEG":null,"Trailing PE":21.266666,"Trailing PS":4.179976,"Quick Ratio":"N\/A","Day High":25.5775,"Day Low":25.22,"VS Average Volume":1.3984071637,"Company Summary":"Associated Banc-Corp, a bank holding company, provides various banking and nonbanking products to individuals and businesses in Wisconsin, Illinois, and Minnesota. The company offers lending solutions, including commercial loans and lines of credit, commercial real estate financing, construction loans, letters of credit, leasing, asset based lending and equipment finance, loan syndications products, residential mortgages, home equity loans and lines of credit, personal and installment loans, auto finance and business loans, and business lines of credit. It also provides deposit and cash management solutions, such as commercial checking and interest-bearing deposit products, cash vault and night depository services, liquidity solutions, payables and receivables solutions, and information services; specialized financial services, such as interest rate risk management and foreign exchange solutions; fiduciary services, such as administration of pension, profit-sharing and other employee benefit plans, fiduciary and corporate agency services, and institutional asset management services; and investable funds solutions, including savings, money market deposit accounts, IRA accounts, CDs, fixed and variable annuities, full-service, discount, and online investment brokerage; investment advisory services; and trust and investment management accounts. In addition, the company offers deposit and transactional solutions, including checking, credit, debit and pre-paid cards, online banking and bill pay; and money transfer services. Associated Banc-Corp was founded in 1861 and is headquartered in Green Bay, Wisconsin.","Stock Sentiment":"N\/A","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Abbott Laboratories","Symbol":"ABT","Current Price":"117.78","Latest MA":"111.35","Price Target":131.62125,"Difference from MA":"5.78%","Difference from Open":"3.20%","Change from Yesterday":"0.85%","Change from Last Report":"0.00","Latest Volume":"11,700,953","Market Cap":"204,284,706,816","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":20.786089,"PB Ratio":5.133368,"ROE":0.14840001,"DTE":37.589,"Industry":"Medical Devices","Sector":"Healthcare","Beta":0.722,"Trailing PEG":2.2826,"Trailing PE":15.41623,"Trailing PS":4.9563217,"Quick Ratio":0.996,"Day High":119.94,"Day Low":113.5,"VS Average Volume":2.24894851,"Company Summary":"Abbott Laboratories, together with its subsidiaries, discovers, develops, manufactures, and sells health care products worldwide. It operates in four segments: Established Pharmaceutical Products, Diagnostic Products, Nutritional Products, and Medical Devices. The company provides generic pharmaceuticals for the treatment of pancreatic exocrine insufficiency, irritable bowel syndrome or biliary spasm, intrahepatic cholestasis or depressive symptoms, gynecological disorder, hormone replacement therapy, dyslipidemia, hypertension, hypothyroidism, Ménière's disease and vestibular vertigo, pain, fever, inflammation, and migraine, as well as provides anti-infective clarithromycin, influenza vaccine, and products to regulate physiological rhythm of the colon. It also offers laboratory and transfusion medicine systems in the areas of immunoassay, clinical chemistry, hematology, and transfusion; molecular diagnostics polymerase chain reaction instrument systems that automate the extraction, purification, and preparation of DNA and RNA from patient samples, and detect and measure infectious agents; point of care systems; cartridges for testing blood gas, chemistry, electrolytes, coagulation, and immunoassay; rapid diagnostics lateral flow testing products; molecular point-of-care testing for HIV, SARS-CoV-2, influenza A and B, RSV, and strep A; cardiometabolic test systems; drug and alcohol test, and remote patient monitoring and consumer self-test systems; and informatics and automation solutions for laboratories. In addition, the company provides pediatric and adult nutritional products; rhythm management, electrophysiology, heart failure, vascular, and structural heart devices for the treatment of cardiovascular diseases; diabetes care products, such as glucose and blood glucose monitoring systems; and neuromodulation devices for the management of chronic pain and movement disorders. Abbott Laboratories was founded in 1888 and is based in North Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Knight-Swift Transportation Hol","Symbol":"KNX","Current Price":"55.00","Latest MA":"52.73","Price Target":60.00632,"Difference from MA":"4.30%","Difference from Open":"-0.20%","Change from Yesterday":"-0.52%","Change from Last Report":"0.00","Latest Volume":"3,325,052","Market Cap":"8,904,114,176","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":15.786725,"PB Ratio":1.2612654,"ROE":0.0050700004,"DTE":47.652,"Industry":"Trucking","Sector":"Industrials","Beta":0.934,"Trailing PEG":1.0476,"Trailing PE":239.13043,"Trailing PS":1.1907532,"Quick Ratio":0.741,"Day High":55.45,"Day Low":54.715,"VS Average Volume":1.7606999904,"Company Summary":"Knight-Swift Transportation Holdings Inc., together with its subsidiaries, provides freight transportation services in the United States and Mexico. The company operates through four segments: Truckload, Less-than-truckload (LTL), Logistics, and Intermodal. The Truckload segment provides transportation services, which include irregular route and dedicated, refrigerated, expedited, flatbed, and cross-border operations. This segment operated an average of 20,948 tractors, which comprised 18,821 company tractors and 2,127 independent contractor tractors, as well as 87,865 trailers. The LTL segment provides regional LTL transportation services through a network of approximately 120 service centers; and offers national coverage through partner carrier outside the network. This segment operated an average of 3,201 tractors and 8,482 trailers. The Logistic segment offers brokerage and other freight management services through third-party transportation providers and equipment. The Intermodal segment offers transportation services, including freight through third-party intermodal rail services on trailing equipment, such as containers and trailers on flat cars; and drayage services. This segment operated an average of 639 tractors and 12,730 intermodal containers. The company also provides repair and maintenance shop, equipment leasing, warranty, and insurance services; and warehousing and driving academy services, as well as manufactures trailer parts. It serves retail, food and beverage, consumer and paper products, transportation and logistics, housing, and building, automotive, and manufacturing industries. Knight-Swift Transportation Holdings Inc. was incorporated in 1989 and is headquartered in Phoenix, Arizona.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Alcoa Corporation","Symbol":"AA","Current Price":"38.78","Latest MA":"37.77","Price Target":48.27692,"Difference from MA":"2.66%","Difference from Open":"-2.10%","Change from Yesterday":"0.44%","Change from Last Report":"0.00","Latest Volume":"7,615,374","Market Cap":"10,019,006,464","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":11.592694,"PB Ratio":1.9083706,"ROE":-0.07142,"DTE":56.095,"Industry":"Aluminum","Sector":"Basic Materials","Beta":2.419,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.91048765,"Quick Ratio":0.671,"Day High":39.84,"Day Low":38.68,"VS Average Volume":1.7579227291,"Company Summary":"Alcoa Corporation, together with its subsidiaries, produces and sells bauxite, alumina, and aluminum products in the United States, Spain, Australia, Iceland, Norway, Brazil, Canada, and internationally. The company operates through two segments, Alumina and Aluminum. It engages in bauxite mining operations; and processes bauxite into alumina and sells it to customers who process it into industrial chemical products, as well as aluminum smelting and casting businesses. The company offers primary aluminum in the form of alloy ingot or value-add ingot to customers that produce products for the transportation, building and construction, packaging, wire, and other industrial markets; and flat-rolled aluminum in the form of sheet, which is sold primarily to customers that produce beverage and food cans. In addition, it owns hydro power plants that generates and sells electricity in the wholesale market to traders, large industrial consumers, distribution companies, and other generation companies. The company was formerly known as Alcoa Upstream Corporation and changed its name to Alcoa Corporation in October 2016. The company was founded in 1886 and is headquartered in Pittsburgh, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Procter & Gamble Company (The)","Symbol":"PG","Current Price":"164.74","Latest MA":"168.43","Price Target":179.76614,"Difference from MA":"-2.19%","Difference from Open":"-1.41%","Change from Yesterday":"1.87%","Change from Last Report":"0.00","Latest Volume":"11,914,299","Market Cap":"386,298,839,040","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":22.359306,"PB Ratio":7.8462567,"ROE":0.28766,"DTE":69.338,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":0.414,"Trailing PEG":3.4858,"Trailing PE":26.232485,"Trailing PS":4.6040025,"Quick Ratio":0.507,"Day High":168.14,"Day Low":164.44,"VS Average Volume":1.6978647542,"Company Summary":"The Procter & Gamble Company engages in the provision of branded consumer packaged goods worldwide. The company operates through five segments: Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care. The Beauty segment offers conditioners, shampoos, styling aids, and treatments under the Head & Shoulders, Herbal Essences, Pantene, and Rejoice brands; and antiperspirants and deodorants, personal cleansing, and skin care products under the Olay, Old Spice, Safeguard, Secret, SK-II, and Native brands. The Grooming segment provides blades and razors, shave products, appliances, and other grooming products under the Braun, Gillette, and Venus brand names. The Health Care segment offers toothbrushes, toothpastes, and other oral care products under the Crest and Oral-B brand names; and gastrointestinal, pain relief, rapid diagnostics, respiratory, vitamins\/minerals\/supplements, and other personal health care products under Metamucil, Neurobion, Pepto-Bismol, and Vicks brands. The Fabric & Home Care segment provides fabric enhancers, laundry additives, and laundry detergents under the Ariel, Downy, Gain, and Tide brands; and air care, dish care, P&G professional, and surface care products under the Cascade, Dawn, Fairy, Febreze, Mr. Clean, and Swiffer brands. The Baby, Feminine & Family Care segment offers baby wipes, and taped diapers and pants under the Luvs and Pampers brands; adult incontinence and feminine care products under the Always, Always Discreet, and Tampax brands; and paper towels, tissues, and toilet papers under the Bounty, Charmin, and Puffs brands. It sells its products primarily through mass merchandisers, e-commerce, grocery stores, membership club stores, drug stores, department stores, distributors, wholesalers, specialty beauty stores, high-frequency stores, pharmacies, electronics stores, and professional channels, as well as directly to consumers. The company was founded in 1837 and is headquartered in Cincinnati, Ohio.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Lam Research Corporation","Symbol":"LRCX","Current Price":"83.25","Latest MA":"82.18","Price Target":90.85239,"Difference from MA":"1.30%","Difference from Open":"1.01%","Change from Yesterday":"2.15%","Change from Last Report":"0.00","Latest Volume":"14,455,163","Market Cap":"107,116,945,408","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.46249,"PB Ratio":12.696355,"ROE":0.49116,"DTE":58.827,"Industry":"Semiconductor Equipment & Materials","Sector":"Technology","Beta":1.486,"Trailing PEG":1.6003,"Trailing PE":26.941748,"Trailing PS":6.870302,"Quick Ratio":1.685,"Day High":85.19,"Day Low":82.42,"VS Average Volume":1.2526058544,"Company Summary":"Lam Research Corporation designs, manufactures, markets, refurbishes, and services semiconductor processing equipment used in the fabrication of integrated circuits. The company offers ALTUS systems to deposit conformal films for tungsten metallization applications; SABRE electrochemical deposition products for copper interconnect transition that offers copper damascene manufacturing; and VECTOR plasma-enhanced CVD products. It also provides SPEED gapfill high-density plasma chemical vapor deposition products; and Striker single-wafer atomic layer deposition products for dielectric film solutions. In addition, the company offers Flex for dielectric etch applications; Vantex, a dielectric etch system that provides RF technology and repeatable wafer-to-wafer performance enabled by Equipment Intelligence solutions; Kiyo for conductor etch applications; Syndion for through-silicon via etch applications; and Versys metal products for metal etch processes. Further, it provides Coronus bevel clean products to enhance die yield; and Da Vinci, DV-Prime, EOS, and SP series products to address various wafer cleaning applications. The company sells its products in the United States, China, Europe, Japan, Korea, Southeast Asia, and Taiwan. Lam Research Corporation was incorporated in 1980 and is headquartered in Fremont, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Crown Castle Inc.","Symbol":"CCI","Current Price":"88.43","Latest MA":"103.05","Price Target":113.0,"Difference from MA":"-14.19%","Difference from Open":"-1.60%","Change from Yesterday":"-2.50%","Change from Last Report":"0.00","Latest Volume":"1,790,064","Market Cap":"38,431,502,336","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":32.75343,"PB Ratio":7.263244,"ROE":0.20527,"DTE":559.592,"Industry":"REIT - Specialty","Sector":"Real Estate","Beta":0.875,"Trailing PEG":4.0699,"Trailing PE":31.358156,"Trailing PS":5.8291373,"Quick Ratio":0.365,"Day High":90.225,"Day Low":88.205,"VS Average Volume":0.5734662489,"Company Summary":"Crown Castle owns, operates and leases more than 40,000 cell towers and approximately 90,000 route miles of fiber supporting small cells and fiber solutions across every major U.S. market. This nationwide portfolio of communications infrastructure connects cities and communities to essential data, technology and wireless service - bringing information, ideas and innovations to the people and businesses that need them.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Ally Financial Inc.","Symbol":"ALLY","Current Price":"39.65","Latest MA":"37.84","Price Target":43.0,"Difference from MA":"4.79%","Difference from Open":"-4.18%","Change from Yesterday":"3.85%","Change from Last Report":"0.00","Latest Volume":"6,807,121","Market Cap":"12,108,635,136","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":7.0183578,"PB Ratio":0.9742734,"ROE":0.06425,"DTE":"N\/A","Industry":"Credit Services","Sector":"Financial Services","Beta":1.389,"Trailing PEG":0.6076,"Trailing PE":22.027779,"Trailing PS":1.7901589,"Quick Ratio":"N\/A","Day High":41.49,"Day Low":39.13,"VS Average Volume":2.2563132225,"Company Summary":"Ally Financial Inc., a digital financial-services company, provides various digital financial products and services in the United States, Canada, and Bermuda. The company operates through Automotive Finance Operations, Insurance Operations, Mortgage Finance Operations, and Corporate Finance Operations segments. The Automotive Finance Operations segment offers automotive financing services, including providing retail installment sales contracts, loans and operating leases, term loans to dealers, financing dealer floorplans and other lines of credit to dealers, warehouse lines to automotive retailers, and fleet financing. It also provides financing services to companies and municipalities for the purchase or lease of vehicles, and vehicle-remarketing services. The Insurance Operations segment offers consumer finance protection and insurance products through the automotive dealer channel, and commercial insurance products directly to dealers. This segment provides vehicle service and maintenance contract, and guaranteed asset protection products; and underwrites commercial insurance coverages, which primarily insure dealers' vehicle inventory. The Mortgage Finance Operations segment manages consumer mortgage loan portfolio that includes bulk purchases of jumbo and low-to-moderate income mortgage loans originated by third parties, as well as direct-to-consumer mortgage offerings. The Corporate Finance Operations segment provides senior secured leveraged cash flow and asset-based loans to middle market companies; leveraged loans; and commercial real estate product to serve companies in the nursing facilities, senior housing, and medical office buildings. It also offers commercial banking products and services. In addition, it provides securities brokerage and investment advisory services. The company was formerly known as GMAC Inc. and changed its name to Ally Financial Inc. in May 2010. Ally Financial Inc. was founded in 1919 and is based in Detroit, Michigan.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Kinder Morgan, Inc.","Symbol":"KMI","Current Price":"30.78","Latest MA":"23.61","Price Target":28.585,"Difference from MA":"30.38%","Difference from Open":"-2.13%","Change from Yesterday":"-1.41%","Change from Last Report":"0.00","Latest Volume":"15,219,231","Market Cap":"68,382,076,928","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":22.898378,"PB Ratio":2.2490137,"ROE":0.083500005,"DTE":101.433,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.907,"Trailing PEG":2.2538,"Trailing PE":26.307693,"Trailing PS":4.5133705,"Quick Ratio":0.291,"Day High":31.46,"Day Low":30.6634,"VS Average Volume":1.1228217301,"Company Summary":"Kinder Morgan, Inc. operates as an energy infrastructure company primarily in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas gasification, liquefaction, and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and\/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, renewable fuel and feedstocks, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; owns interests in\/or operates oil fields and gasoline processing plants; and operates a crude oil pipeline system in West Texas, as well as owns and operates RNG and LNG facilities. It owns and operates approximately 82,000 miles of pipelines and 139 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1997 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Halliburton Company","Symbol":"HAL","Current Price":"28.48","Latest MA":"30.20","Price Target":34.98889,"Difference from MA":"-5.69%","Difference from Open":"-1.79%","Change from Yesterday":"-3.56%","Change from Last Report":"0.00","Latest Volume":"16,085,180","Market Cap":"25,019,736,064","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.905872,"PB Ratio":2.4285836,"ROE":0.26293,"DTE":83.993,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.905,"Trailing PEG":2.2574,"Trailing PE":10.063604,"Trailing PS":1.0843729,"Quick Ratio":1.377,"Day High":29.33,"Day Low":28.17,"VS Average Volume":1.6590405974,"Company Summary":"Halliburton Company provides products and services to the energy industry worldwide. It operates through two segments, Completion and Production, and Drilling and Evaluation. The Completion and Production segment offers production enhancement services that include stimulation and sand control services; cementing services, such as well bonding and casing, and casing equipment; and completion tools that offer downhole solutions and services, including well completion products and services, intelligent well completions, and service tools, as well as liner hanger, sand control, and multilateral systems. This segment also provides electrical submersible pumps, as well as artificial lift services; production solutions comprising coiled tubing, hydraulic workover units, downhole tools, and pumping and nitrogen services; pipeline and process services, such as pre-commissioning, commissioning, maintenance, and decommissioning; and specialty chemicals and services. The Drilling and Evaluation segment offers drilling fluid systems, performance additives, completion fluids, solids control, specialized testing equipment, and waste management services; drilling systems and services; wireline and perforating services consists of open-hole logging, and cased-hole and slickline; and drill bits and services comprising roller cone rock bits, fixed cutter bits, hole enlargement, and related downhole tools and services, as well as coring equipment and services. This segment also provides cloud based digital services and artificial intelligence solutions on an open architecture for subsurface insights, integrated well construction, and reservoir and production management; testing and subsea services, such as acquisition and analysis of reservoir information and optimization solutions; and project management and integrated asset management services. Halliburton Company was founded in 1919 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Comerica Incorporated","Symbol":"CMA","Current Price":"62.69","Latest MA":"58.83","Price Target":69.47368,"Difference from MA":"6.56%","Difference from Open":"-1.21%","Change from Yesterday":"-5.56%","Change from Last Report":"0.00","Latest Volume":"3,792,747","Market Cap":"8,238,029,824","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":10.539429,"PB Ratio":1.1934133,"ROE":0.09094,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.24,"Trailing PEG":null,"Trailing PE":12.488048,"Trailing PS":2.6061468,"Quick Ratio":"N\/A","Day High":65.51,"Day Low":62.115,"VS Average Volume":1.7143227137,"Company Summary":"Comerica Incorporated, through its subsidiaries, provides various financial products and services. The company operates through Commercial Bank, Retail Bank, Wealth Management, and Finance segments. The Commercial Bank segment offers various products and services, including commercial loans and lines of credit, deposits, cash management, payment solutions, card services, capital market products, international trade finance, letters of credit, foreign exchange management services, and loan syndication services for small and middle market businesses, multinational corporations, and governmental entities. The Retail Bank segment provides personal financial services, such as consumer lending, consumer deposit gathering, and mortgage loan origination; and various consumer products that include deposit accounts, installment loans, credit cards, student loans, home equity lines of credit, and residential mortgage loans. The Wealth Management segment offers products and services comprising financial planning, trust and fiduciary services, investment management and advisory, brokerage, private banking, and business transition planning services for affluents, high-net worth and ultra-high-net-worth individuals and families, business owners, and executives, and institutional clients. The Finance segment comprises securities portfolio, and asset and liability management activities. It operates in Texas, California, Michigan, Arizona, and Florida, the United States; and Canada and Mexico. The company was formerly known as DETROITBANK Corporation and changed its name to Comerica Incorporated in July 1982. Comerica Incorporated was founded in 1849 and is headquartered in Dallas, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"New Oriental Education & Techno","Symbol":"EDU","Current Price":"46.13","Latest MA":"65.91","Price Target":70.53396,"Difference from MA":"-30.01%","Difference from Open":"0.52%","Change from Yesterday":"-1.24%","Change from Last Report":"0.00","Latest Volume":"5,537,546","Market Cap":"7,543,592,448","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":11.82581,"PB Ratio":2.0127406,"ROE":0.09543,"DTE":16.761,"Industry":"Education & Training Services","Sector":"Consumer Defensive","Beta":0.487,"Trailing PEG":0.7631,"Trailing PE":20.056522,"Trailing PS":1.6226336,"Quick Ratio":1.634,"Day High":47.03,"Day Low":44.535,"VS Average Volume":3.2483610212,"Company Summary":"New Oriental Education & Technology Group Inc. provides private educational services under the New Oriental brand in the People's Republic of China. The company operates through four segments: Educational Services and Test Preparation Courses; Online Education and Other Services; Overseas Study Consulting Services; and Educational Materials and Distribution. It offers test preparation courses to students taking language and entrance exams used by educational institutions in the United States, the Commonwealth countries, and the People's Republic of China. The company also provides non-academic tutoring courses; intelligent learning systems and devices to offer a digital learning experience for students; and overseas studies consulting services. In addition, it offers online education services through the Koolearn.com platform. Further, the company develops and edits educational materials for language training and test preparation. In addition, it offers educational programs, services, and products to students through schools; learning centers; and bookstores, as well as through its online learning platforms. The company was founded in 1993 and is headquartered in Beijing, the People's Republic of China.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"GE Vernova Inc.","Symbol":"GEV","Current Price":"427.10","Latest MA":"258.65","Price Target":386.29376,"Difference from MA":"65.12%","Difference from Open":"-0.67%","Change from Yesterday":"2.67%","Change from Last Report":"0.00","Latest Volume":"4,626,999","Market Cap":"117,731,835,904","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":40.39806,"PB Ratio":12.376482,"ROE":"N\/A","DTE":9.346,"Industry":"Utilities - Renewable","Sector":"Utilities","Beta":"N\/A","Trailing PEG":3.7017,"Trailing PE":100.96927,"Trailing PS":3.4202495,"Quick Ratio":0.717,"Day High":434.1,"Day Low":418.1,"VS Average Volume":1.6296083022,"Company Summary":"GE Vernova Inc., an energy company, engages in the provision of various products and services that generate, transfer, orchestrate, convert, and store electricity in the United States, Europe, Asia, the Americas, the Middle East, and Africa. The company operates through three segments: Power, Wind, and Electrification. The Power segment designs, manufactures, and services gas, nuclear, hydro, and steam technologies. The Wind segment offers wind generation technologies, including onshore and offshore wind turbines and blades. The Electrification segment provides grid solutions, power conversion, solar, and storage solutions; and electrification software for the transmission, distribution, conversion, storage, and orchestration of electricity from point of generation to point of consumption. The company was incorporated in 2023 and is headquartered in Cambridge, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Discover Financial Services","Symbol":"DFS","Current Price":"197.50","Latest MA":"150.10","Price Target":195.38461,"Difference from MA":"31.58%","Difference from Open":"3.75%","Change from Yesterday":"4.35%","Change from Last Report":"0.00","Latest Volume":"2,584,549","Market Cap":"49,633,923,072","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":13.23889,"PB Ratio":2.8721006,"ROE":0.20263,"DTE":105.313,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.402,"Trailing PEG":4.7476,"Trailing PE":13.481229,"Trailing PS":4.2472982,"Quick Ratio":1.174,"Day High":198.9675,"Day Low":190.15,"VS Average Volume":1.56414665,"Company Summary":"Discover Financial Services, through its subsidiaries, provides digital banking products and services, and payment services in the United States. It operates in two segments, Digital Banking and Payment Services. The Digital Banking segment offers Discover-branded credit cards to individuals; personal loans, home loans, and other consumer lending; and direct-to-consumer deposit products comprising savings accounts, certificates of deposit, money market accounts, IRA certificates of deposit, IRA savings accounts and checking accounts, and sweep accounts. The Payment Services segment operates the PULSE to access automated teller machines, debit, and electronic funds transfer network; and Diners Club International, a payments network that issues Diners Club branded charge cards and\/or provides card acceptance services, as well as offers payment transaction processing and settlement services. The company was incorporated in 1960 and is based in Riverwoods, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Hexcel Corporation","Symbol":"HXL","Current Price":"68.47","Latest MA":"62.54","Price Target":68.56375,"Difference from MA":"9.48%","Difference from Open":"0.32%","Change from Yesterday":"0.01%","Change from Last Report":"0.00","Latest Volume":"1,877,456","Market Cap":"5,546,213,376","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":22.75658,"PB Ratio":3.489273,"ROE":0.06682,"DTE":50.657,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.298,"Trailing PEG":1.0891,"Trailing PE":52.267178,"Trailing PS":2.9396372,"Quick Ratio":1.322,"Day High":68.6,"Day Low":67.24,"VS Average Volume":2.0370198379,"Company Summary":"Hexcel Corporation develops, manufactures, and markets carbon fibers, structural reinforcements, honeycomb structures, resins, and composite materials and parts for use in commercial aerospace, space and defense, and industrial applications. It operates through two segments, Composite Materials and Engineered Products. The Composite Materials segment manufactures and markets fabrics, multi-axials, specialty reinforcements, prepregs and other fiber-reinforced matrix materials, structural adhesives, molding compounds, tooling materials, polyurethane systems, and laminates that are used in military and commercial aircraft, wind turbine blades, recreational products, and other industrial applications, as well as in automotive, marine, and rail transportation. The Engineered Products segment manufactures and markets aircraft structures and finished aircraft components, including wing to body fairings, wing panels, flight deck panels, door liners, rotorcraft blades, spars, and tip caps; and aircraft structural sub-components and semi-finished components used in rotorcraft blades, engine nacelles, and aircraft surfaces, such as flaps, wings, elevators, and fairings; and RF interference control products for military and aerospace applications. This segment also provides interference control materials, structural composites, and services; dielectric absorber foams; magnetic absorbers; and thermoplastics for commercial and defense applications. The company sells its products directly through its managers, product managers, and sales personnel, as well as through independent distributors in the Americas, Europe, the Asia Pacific, India, and Africa. Hexcel Corporation was founded in 1946 and is headquartered in Stamford, Connecticut.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Las Vegas Sands Corp.","Symbol":"LVS","Current Price":"44.00","Latest MA":"46.19","Price Target":59.59579,"Difference from MA":"-4.75%","Difference from Open":"-2.22%","Change from Yesterday":"-3.00%","Change from Last Report":"0.00","Latest Volume":"4,272,325","Market Cap":"31,901,143,040","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":16.035452,"PB Ratio":9.310199,"ROE":0.45166,"DTE":384.206,"Industry":"Resorts & Casinos","Sector":"Consumer Cyclical","Beta":1.117,"Trailing PEG":0.6578,"Trailing PE":21.782179,"Trailing PS":2.818869,"Quick Ratio":0.864,"Day High":45.18,"Day Low":43.87,"VS Average Volume":0.8786740517,"Company Summary":"Las Vegas Sands Corp., together with its subsidiaries, develops, owns, and operates integrated resorts in Macao and Singapore. It owns and operates The Venetian Macao Resort Hotel, the Londoner Macao, The Parisian Macao, The Plaza Macao and Four Seasons Hotel Macao, Cotai Strip, and the Sands Macao in Macao, the People's Republic of China; and Marina Bay Sands in Singapore. The company's integrated resorts feature accommodations, gaming, entertainment and retail malls, convention and exhibition facilities, celebrity chef restaurants, and other amenities. Las Vegas Sands Corp. was founded in 1988 and is based in Las Vegas, Nevada.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"The Travelers Companies, Inc.","Symbol":"TRV","Current Price":"246.72","Latest MA":"232.74","Price Target":263.05286,"Difference from MA":"6.01%","Difference from Open":"-1.51%","Change from Yesterday":"3.16%","Change from Last Report":"0.00","Latest Volume":"2,172,947","Market Cap":"55,906,750,464","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":10.5170765,"PB Ratio":2.022146,"ROE":0.19059,"DTE":29.004,"Industry":"Insurance - Property & Casualty","Sector":"Financial Services","Beta":0.63,"Trailing PEG":0.8485,"Trailing PE":11.496738,"Trailing PS":1.2330015,"Quick Ratio":0.198,"Day High":254.42,"Day Low":246.0,"VS Average Volume":1.6516336218,"Company Summary":"The Travelers Companies, Inc., through its subsidiaries, provides a range of commercial and personal property, and casualty insurance products and services to businesses, government units, associations, and individuals in the United States and internationally. The company operates through three segments: Business Insurance, Bond & Specialty Insurance, and Personal Insurance. The Business Insurance segment offers workers' compensation, commercial automobile and property, general liability, commercial multi-peril, employers' liability, public and product liability, professional indemnity, marine, aviation, onshore and offshore energy, construction, terrorism, personal accident, and kidnap and ransom insurance products. This segment operates through select accounts, which serve small businesses; commercial accounts that serve mid-sized businesses; national accounts, which serve large companies; and national property and other that serve large and mid-sized customers, commercial trucking industry, and agricultural businesses, as well as markets and distributes its products through brokers, wholesale agents, and program managers. The Bond & Specialty Insurance segment provides surety, fidelity, management and professional liability, and other property and casualty coverages and related risk management services through independent agencies and brokers. The Personal Insurance segment offers property and casualty insurance covering personal risks, primarily automobile and homeowners' insurance to individuals through independent agencies and brokers. The Travelers Companies, Inc. was founded in 1853 and is based in New York, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Johnson & Johnson","Symbol":"JNJ","Current Price":"145.27","Latest MA":"154.16","Price Target":169.38364,"Difference from MA":"-5.77%","Difference from Open":"0.88%","Change from Yesterday":"-1.94%","Change from Last Report":"0.00","Latest Volume":"16,725,060","Market Cap":"349,754,982,400","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":12.996762,"PB Ratio":4.9845595,"ROE":0.20889,"DTE":50.958,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.518,"Trailing PEG":0.8479,"Trailing PE":25.04655,"Trailing PS":3.9882662,"Quick Ratio":0.705,"Day High":145.47,"Day Low":142.11,"VS Average Volume":2.0484144227,"Company Summary":"Johnson & Johnson, together with its subsidiaries, researches, develops, manufactures, and sells various products in the healthcare field worldwide. The company's Innovative Medicine segment offers products for various therapeutic areas, such as immunology, including rheumatoid arthritis, psoriatic arthritis, inflammatory bowel disease, and psoriasis; infectious diseases comprising HIV\/AIDS; neuroscience, consisting of mood disorders, neurodegenerative disorders, and schizophrenia; oncology, such as prostate cancer, hematologic malignancies, lung cancer, and bladder cancer; cardiovascular and metabolism, including thrombosis, diabetes, and macular degeneration; and pulmonary hypertension comprising pulmonary arterial hypertension through retailers, wholesalers, distributors, hospitals, and healthcare professionals for prescription use. Its MedTech segment provides Interventional Solutions, including electrophysiology products to treat heart rhythm disorders; the heart recovery portfolio, which includes technologies to treat severe coronary artery disease requiring high-risk PCI or AMI cardiogenic shock; and neurovascular care that treats hemorrhagic and ischemic stroke. this segment also offers an orthopaedics portfolio that includes products and enabling technologies that support hips, knees, trauma, spine, sports, and other; surgery portfolios comprising advanced and general surgery technologies, as well as solutions for breast aesthetics, ear, nose, and throat procedures; contact lenses under the ACUVUE Brand; and TECNIS intraocular lenses for cataract surgery. It distributes its products to wholesalers, hospitals, and retailers, as well as physicians, nurses, hospitals, eye care professionals, and clinics. The company has a collaboration agreement with Stand Up To Cancer for research testing a combination of teclistamab and daratumumab to treat a rare disease AL amyloidosis. Johnson & Johnson was founded in 1886 and is based in New Brunswick, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Cadence Bank","Symbol":"CADE","Current Price":"35.91","Latest MA":"32.63","Price Target":40.95,"Difference from MA":"10.06%","Difference from Open":"0.53%","Change from Yesterday":"-0.06%","Change from Last Report":"0.00","Latest Volume":"1,058,672","Market Cap":"6,570,380,800","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":11.460138,"PB Ratio":1.211089,"ROE":0.025510002,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.969,"Trailing PEG":null,"Trailing PE":57.0,"Trailing PS":5.168746,"Quick Ratio":"N\/A","Day High":36.225,"Day Low":35.61,"VS Average Volume":0.8984008771,"Company Summary":"Cadence Bank provides commercial banking and financial services. Its products and services include consumer banking, consumer loans, mortgages, home equity lines and loans, credit cards, commercial and business banking, treasury management, specialized and asset-based lending, commercial real estate, equipment financing, and correspondent banking services. The company's products and services also comprise small business administration lending, foreign exchange, wealth management, investment and trust, financial planning, retirement plan management, and personal and business insurance services.  Cadence Bank was founded in 1876 and is headquartered in Tupelo, Mississippi.","Stock Sentiment":"N\/A","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Textron Inc.","Symbol":"TXT","Current Price":"78.41","Latest MA":"85.25","Price Target":93.17625,"Difference from MA":"-8.02%","Difference from Open":"0.80%","Change from Yesterday":"-3.44%","Change from Last Report":"0.00","Latest Volume":"2,154,163","Market Cap":"14,545,996,800","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":11.020814,"PB Ratio":2.0925517,"ROE":0.12597999,"DTE":56.941,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.244,"Trailing PEG":0.7692,"Trailing PE":18.06682,"Trailing PS":1.0404118,"Quick Ratio":0.649,"Day High":79.4866,"Day Low":76.02,"VS Average Volume":1.7393350655,"Company Summary":"Textron Inc. operates in the aircraft, defense, industrial, and finance businesses worldwide. It operates through six segments: Textron Aviation, Bell, Textron Systems, Industrial, Textron eAviation, and Finance. The Textron Aviation segment manufactures, sells, and services business jets, turboprop and piston engine aircraft, and military trainer and defense aircraft; and offers maintenance, inspection, and repair services, as well as sells commercial parts. The Bell segment supplies military and commercial helicopters, tiltrotor aircrafts, and related spare parts and services. The Textron Systems segment offers unmanned aircraft systems, electronic systems and solutions, advanced marine crafts, piston aircraft engines, live military air-to-air and air-to-ship training, weapons and related components, and armored and specialty vehicles. The Industrial segment offers blow-molded solutions, including conventional plastic fuel tanks and pressurized fuel tanks for hybrid vehicle applications, clear-vision systems, plastic tanks for catalytic reduction systems, and battery housing systems for use in electric vehicles primarily to automobile original equipment manufacturers (OEMs); and golf cars, off-road utility vehicles, powersports products, light transportation vehicles, aviation ground support equipment, professional turf-maintenance equipment, and turf-care vehicles to golf courses and resorts, government agencies and municipalities, consumers, outdoor enthusiasts, and commercial and industrial users. The Textron eAviation segment manufactures and sells light aircraft and gliders with electric and combustion engines; and provides other research and development initiatives related to sustainable aviation solutions. The Finance segment offers financing services to purchase new and pre-owned aviation aircraft and Bell helicopters. Textron Inc. was founded in 1923 and is headquartered in Providence, Rhode Island.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Amphenol Corporation","Symbol":"APH","Current Price":"77.84","Latest MA":"67.57","Price Target":82.0975,"Difference from MA":"15.19%","Difference from Open":"2.89%","Change from Yesterday":"7.04%","Change from Last Report":"0.00","Latest Volume":"14,379,282","Market Cap":"93,844,676,608","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":31.292461,"PB Ratio":9.926039,"ROE":0.25293,"DTE":57.565,"Industry":"Electronic Components","Sector":"Technology","Beta":1.238,"Trailing PEG":2.4144,"Trailing PE":40.541664,"Trailing PS":6.593735,"Quick Ratio":1.208,"Day High":78.249,"Day Low":73.2204,"VS Average Volume":2.2209409043,"Company Summary":"Amphenol Corporation, together with its subsidiaries, primarily designs, manufactures, and markets electrical, electronic, and fiber optic connectors in the United States, China, and internationally. It operates through three segments: Harsh Environment Solutions, Communications Solutions, and Interconnect and Sensor Systems. The company offers connectors and connector systems, including harsh environment data, power, high-speed, fiber optic, and radio frequency interconnect products; busbars and power distribution systems; and other connectors. It also provides value-add products, such as backplane interconnect systems, cable assemblies and harnesses, and cable management products; other products comprising flexible and rigid printed circuit boards, hinges, other mechanical, and production related products. In addition, the company offers consumer device, network infrastructure, and other antennas; coaxial, power, and specialty cables; and sensors and sensor-based products. It sells its products through its sales force, independent representatives, and a network of electronics distributors to original equipment manufacturers, electronic manufacturing services companies, original design manufacturers, and service providers in the automotive, broadband communication, commercial aerospace, industrial, information technology and data communication, military, mobile device, and mobile network markets. Amphenol Corporation was founded in 1932 and is headquartered in Wallingford, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Hancock Whitney Corporation","Symbol":"HWC","Current Price":"59.72","Latest MA":"52.57","Price Target":69.34375,"Difference from MA":"13.59%","Difference from Open":"-1.42%","Change from Yesterday":"-1.68%","Change from Last Report":"0.00","Latest Volume":"1,496,321","Market Cap":"5,143,325,184","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":10.48501,"PB Ratio":1.2322041,"ROE":0.10145,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.268,"Trailing PEG":null,"Trailing PE":11.310606,"Trailing PS":3.877947,"Quick Ratio":"N\/A","Day High":61.57,"Day Low":58.715,"VS Average Volume":2.6270372289,"Company Summary":"Hancock Whitney Corporation operates as the financial holding company for Hancock Whitney Bank that provides traditional and online banking services to commercial, small business, and retail customers. It offers various transaction and savings deposit products consisting of brokered deposits, time deposits, and money market accounts; treasury management services, secured and unsecured loan products including revolving credit facilities, and letters of credit and similar financial guarantees; and trust and investment management services to retirement plans, corporations, and individuals, and investment advisory and brokerage products. The company also provides commercial and industrial loans including real and non-real estate loans; construction and land development loans; and residential mortgages, as well as consumer loans. In addition, it offers commercial finance products to middle market and corporate clients, including leases and related structures; facilitates investments in new market tax credit activities and holding certain foreclosed assets; provides customers access to fixed annuity and life insurance products; and underwriting transactions products, as well as debt and mortgage-related securities. The company was founded in 1899 and is headquartered in Gulfport, Mississippi.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Interactive Brokers Group, Inc.","Symbol":"IBKR","Current Price":"209.78","Latest MA":"148.14","Price Target":215.9,"Difference from MA":"41.61%","Difference from Open":"1.34%","Change from Yesterday":"8.79%","Change from Last Report":"0.00","Latest Volume":"2,912,006","Market Cap":"88,636,661,760","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":26.849468,"PB Ratio":5.5097966,"ROE":0.21709,"DTE":107.179,"Industry":"Capital Markets","Sector":"Financial Services","Beta":0.792,"Trailing PEG":14.8327,"Trailing PE":30.31503,"Trailing PS":17.931755,"Quick Ratio":1.113,"Day High":211.1372,"Day Low":202.43,"VS Average Volume":2.5962153463,"Company Summary":"Interactive Brokers Group, Inc. operates as an automated electronic broker worldwide. The company engages in the execution, clearance, and settlement of trades in stocks, options, futures, foreign exchange instruments, bonds, mutual funds, exchange traded funds (ETFs), precious metals, and cryptocurrencies. It also custodies and services accounts for hedge and mutual funds, ETFs, registered investment advisors, proprietary trading groups, introducing brokers, and individual investors. In addition, the company offers custody, prime brokerage, securities, and margin lending services. It serves institutional and individual customers through electronic exchanges and market centers. The company was founded in 1977 and is headquartered in Greenwich, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Zions Bancorporation N.A.","Symbol":"ZION","Current Price":"58.09","Latest MA":"50.59","Price Target":62.66667,"Difference from MA":"14.82%","Difference from Open":"-1.78%","Change from Yesterday":"-1.59%","Change from Last Report":"0.00","Latest Volume":"2,020,424","Market Cap":"8,589,827,072","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":10.461445,"PB Ratio":1.443194,"ROE":0.11863,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.06,"Trailing PEG":1.6266,"Trailing PE":13.446759,"Trailing PS":2.8537633,"Quick Ratio":"N\/A","Day High":59.45,"Day Low":57.91,"VS Average Volume":1.5724171852,"Company Summary":"Zions Bancorporation, National Association provides various banking products and related services primarily in the states of Arizona, California, Colorado, Idaho, Nevada, New Mexico, Oregon, Texas, Utah, Washington, and Wyoming. It operates through Zions Bank, California Bank & Trust, Amegy Bank, National Bank of Arizona, Nevada State Bank, Vectra Bank Colorado, and The Commerce Bank of Washington segments. The company offers commercial and small business banking services to small- and medium-sized businesses, such as commercial, industrial, and owner-occupied lending and leasing; municipal and public finance services; depository account and cash management services; commercial and small business cards; merchant processing services; corporate trust services; and correspondent banking and international lending services. It also provides capital markets and investment banking services, including loan syndications, foreign exchange services, interest rate derivatives, fixed income securities underwriting, advisory and capital raising, commercial mortgage-backed security conduit lending, and power and project financing; and commercial real estate lending services consisting of term and construction\/land development financing for commercial and residential purposes. In addition, the company offers retail banking services comprising residential mortgages, home equity lines of credit, personal lines of credit, installment consumer loans, depository account services, consumer cards, and personal trust services; and wealth management services consisting of investment management, fiduciary and estate, and advanced business succession and estate planning services. The company was formerly known as ZB, National Association and changed its name to Zions Bancorporation, National Association in September 2018. Zions Bancorporation, National Association was founded in 1873 and is headquartered in Salt Lake City, Utah.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Netflix, Inc.","Symbol":"NFLX","Current Price":"953.99","Latest MA":"752.44","Price Target":1037.2654,"Difference from MA":"26.79%","Difference from Open":"-4.38%","Change from Yesterday":"9.69%","Change from Last Report":"0.00","Latest Volume":"14,001,000","Market Cap":"407,790,649,344","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":31.917881,"PB Ratio":17.948,"ROE":0.34714,"DTE":81.461,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.25,"Trailing PEG":1.9552,"Trailing PE":48.08417,"Trailing PS":10.849166,"Quick Ratio":0.975,"Day High":999.0,"Day Low":950.79,"VS Average Volume":4.2498812395,"Company Summary":"Netflix, Inc. provides entertainment services. It offers TV series, documentaries, feature films, and games across various genres and languages. The company also provides members the ability to receive streaming content through a host of internet-connected devices, including TVs, digital video players, TV set-top boxes, and mobile devices. It has operations in approximately 190 countries. The company was incorporated in 1997 and is headquartered in Los Gatos, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"United Airlines Holdings, Inc.","Symbol":"UAL","Current Price":"107.97","Latest MA":"67.76","Price Target":125.39565,"Difference from MA":"59.34%","Difference from Open":"-6.36%","Change from Yesterday":"-2.31%","Change from Last Report":"0.00","Latest Volume":"15,900,391","Market Cap":"35,508,740,096","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.3403687,"PB Ratio":3.1044598,"ROE":0.27245,"DTE":291.676,"Industry":"Airlines","Sector":"Industrials","Beta":1.393,"Trailing PEG":0.8576,"Trailing PE":11.425397,"Trailing PS":0.6341526,"Quick Ratio":0.694,"Day High":115.8,"Day Low":107.0,"VS Average Volume":2.7253997583,"Company Summary":"United Airlines Holdings, Inc., through its subsidiaries, provides air transportation services in North America, Asia, Europe, Africa, the Pacific, the Middle East, and Latin America. The company transports people and cargo through its mainline and regional fleets. It also offers catering, ground handling, flight academy, and maintenance services for third parties. The company was formerly known as United Continental Holdings, Inc. and changed its name to United Airlines Holdings, Inc. in June 2019. United Airlines Holdings, Inc. was incorporated in 1968 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Fifth Third Bancorp","Symbol":"FITB","Current Price":"43.93","Latest MA":"41.88","Price Target":50.64286,"Difference from MA":"4.89%","Difference from Open":"-1.00%","Change from Yesterday":"-2.07%","Change from Last Report":"0.00","Latest Volume":"5,955,814","Market Cap":"29,426,688,000","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":10.755401,"PB Ratio":1.591436,"ROE":0.119160004,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.231,"Trailing PEG":3.5399,"Trailing PE":13.990445,"Trailing PS":3.6495955,"Quick Ratio":"N\/A","Day High":44.375,"Day Low":43.07,"VS Average Volume":1.3099919036,"Company Summary":"Fifth Third Bancorp operates as the bank holding company for Fifth Third Bank, National Association that engages in the provision of a range of financial products and services in the United States. It operates through three segments: Commercial Banking, Consumer and Small Business Banking, and Wealth and Asset Management. The Commercial Banking segment offers credit intermediation, cash management, and financial services; lending and depository products; and cash management, foreign exchange and international trade finance, derivatives and capital markets services, asset-based lending, real estate finance, public finance, commercial leasing, and syndicated finance for business, government, and professional customers. The Consumer and Small Banking segment provides a range of deposit and loan products to individuals and small businesses; home equity loans and lines of credit; credit cards; and cash management services. This segment also engages in the residential mortgage that include origination, retention and servicing of residential mortgage loans, sales and securitizations of loans, and hedging activities; indirect lending, including extending loans to consumers through automobile dealers, motorcycle dealers, powersport dealers, recreational vehicle dealers, and marine dealers; and home improvement and solar energy installation loans through contractors and installers. The Wealth & Asset Management segment provides various wealth management services for individuals, companies, and not-for-profit organizations. It offers retail brokerage services to individual clients; and broker dealer services to the institutional marketplace. This segment also provides wealth planning, investment management, banking, insurance, and trust and estate services; and advisory services for institutional clients comprising middle market businesses, non-profits, states, and municipalities. The company was founded in 1858 and is headquartered in Cincinnati, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Capital One Financial Corporati","Symbol":"COF","Current Price":"200.93","Latest MA":"158.39","Price Target":209.84,"Difference from MA":"26.85%","Difference from Open":"2.13%","Change from Yesterday":"4.00%","Change from Last Report":"0.00","Latest Volume":"6,526,466","Market Cap":"76,600,541,184","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":10.974731,"PB Ratio":1.31985,"ROE":0.07479,"DTE":"N\/A","Industry":"Credit Services","Sector":"Financial Services","Beta":1.432,"Trailing PEG":2.1074,"Trailing PE":17.366465,"Trailing PS":2.8909137,"Quick Ratio":"N\/A","Day High":202.135,"Day Low":195.343,"VS Average Volume":2.0706890245,"Company Summary":"Capital One Financial Corporation operates as the financial services holding company for the Capital One, National Association, which engages in the provision of various financial products and services in the United States, Canada, and the United Kingdom. It operates through three segments: Credit Card, Consumer Banking, and Commercial Banking. The company accepts checking accounts, money market deposits, negotiable order of withdrawals, savings deposits, and time deposits. Its loan products include credit card loans; auto and retail banking loans; and commercial and multifamily real estate, and commercial and industrial loans. The company also offers credit and debit card products; online direct banking services; and provides advisory, capital markets, treasury management, and depository services. It serves consumers, small businesses, and commercial clients through digital channels, branches, cafés, and other distribution channels located in New York, Louisiana, Texas, Maryland, Virginia, New Jersey, and California. The company was founded in 1988 and is headquartered in McLean, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Prologis, Inc.","Symbol":"PLD","Current Price":"115.13","Latest MA":"116.75","Price Target":127.04762,"Difference from MA":"-1.39%","Difference from Open":"-0.97%","Change from Yesterday":"-1.82%","Change from Last Report":"0.00","Latest Volume":"3,908,738","Market Cap":"106,630,520,832","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":36.631073,"PB Ratio":2.0115314,"ROE":0.05662,"DTE":57.079,"Industry":"REIT - Industrial","Sector":"Real Estate","Beta":1.094,"Trailing PEG":0.5636,"Trailing PE":34.67771,"Trailing PS":12.941838,"Quick Ratio":0.417,"Day High":117.475,"Day Low":114.52,"VS Average Volume":0.9216172035,"Company Summary":"Prologis, Inc. is the global leader in logistics real estate with a focus on high-barrier, high-growth markets. At September 30, 2024, the company owned or had investments in, on a wholly owned basis or through co-investment ventures, properties and development projects expected to total approximately 1.2 billion square feet (116 million square meters) in 20 countries. Prologis leases modern logistics facilities to a diverse base of approximately 6,700 customers principally across two major categories: business-to-business and retail\/online fulfilment.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Seagate Technology Holdings PLC","Symbol":"STX","Current Price":"108.18","Latest MA":"99.93","Price Target":117.99095,"Difference from MA":"8.26%","Difference from Open":"-0.23%","Change from Yesterday":"6.84%","Change from Last Report":"0.00","Latest Volume":"9,808,171","Market Cap":"22,883,315,712","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":10.982362,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Computer Hardware","Sector":"Technology","Beta":1.07,"Trailing PEG":0.3432,"Trailing PE":19.66909,"Trailing PS":3.1498027,"Quick Ratio":0.63,"Day High":111.905,"Day Low":105.86,"VS Average Volume":3.5595261209,"Company Summary":"Seagate Technology Holdings plc engages in the provision of data storage technology and infrastructure solutions in Singapore, the United States, the Netherlands, and internationally. The company offers mass capacity storage products, including enterprise nearline hard disk drives (HDDs), enterprise nearline solid state drives (SSDs), enterprise nearline systems, video and image HDDs, and network-attached storage drives. It also offers legacy applications comprising Mission Critical HDDs and SSDs; external storage solutions under the Seagate Ultra Touch, One Touch, Expansion, and Basics product lines, as well as under the LaCie brand name; desktop drives for personal computers and workstation applications; notebook drives traditional notebooks, convertible systems, and external storage applications, DVR HDDs for video streaming applications, and gaming SSDs for gaming rigs. In addition, the company provides Lyve edge-to-cloud mass capacity platform, that includes modular hardware and software to support enterprises' on-premise and cloud storage infrastructure needs. It sells its products primarily to original equipment manufacturers, distributors, and retailers. The company was founded in 1978 and is based in Singapore.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"GE Aerospace","Symbol":"GE","Current Price":"188.36","Latest MA":"173.06","Price Target":208.59529,"Difference from MA":"8.84%","Difference from Open":"0.15%","Change from Yesterday":"0.46%","Change from Last Report":"0.00","Latest Volume":"6,477,790","Market Cap":"203,860,148,224","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":35.801445,"PB Ratio":10.801079,"ROE":0.22552,"DTE":110.224,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.188,"Trailing PEG":null,"Trailing PE":37.15187,"Trailing PS":2.9142444,"Quick Ratio":0.804,"Day High":189.24,"Day Low":186.61,"VS Average Volume":1.2985027445,"Company Summary":"General Electric Company, doing business as GE Aerospace, designs and produces commercial and defense aircraft engines, integrated engine components, electric power, and mechanical aircraft systems. It also offers aftermarket services to support its products. The company operates in the United States, Europe, China, Asia, the Americas, the Middle East, and Africa. General Electric Company was incorporated in 1892 and is based in Evendale, Ohio.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Charles Schwab Corporation (The","Symbol":"SCHW","Current Price":"80.60","Latest MA":"70.62","Price Target":89.05,"Difference from MA":"14.13%","Difference from Open":"-0.59%","Change from Yesterday":"-0.41%","Change from Last Report":"0.00","Latest Volume":"7,645,260","Market Cap":"147,543,130,112","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":15.577648,"PB Ratio":3.8781693,"ROE":0.12111,"DTE":144.242,"Industry":"Capital Markets","Sector":"Financial Services","Beta":0.952,"Trailing PEG":0.9852,"Trailing PE":26.956522,"Trailing PS":7.8748465,"Quick Ratio":0.481,"Day High":81.73,"Day Low":79.985,"VS Average Volume":0.950517458,"Company Summary":"The Charles Schwab Corporation, together with its subsidiaries, operates as a savings and loan holding company that provides wealth management, securities brokerage, banking, asset management, custody, and financial advisory services in the United States and internationally. The company operates in two segments, Investor Services and Advisor Services. It offers brokerage accounts with equity and fixed income trading, margin lending, options trading, futures and forex trading, and cash management capabilities, including certificates of deposit; third-party mutual funds through the Mutual Fund Marketplace and Mutual Fund OneSource service, as well as mutual fund trading and clearing services to broker-dealers; exchange-traded funds; advisory solutions for managed portfolios, separately managed accounts, customized personal advice for tailored portfolios, specialized planning, and full-time portfolio management; banking products comprising checking and savings accounts, first lien residential real estate mortgage loans, home equity lines of credit, and pledged asset lines; and trust custody services, personal trust reporting services, and administrative trustee services. It also provides digital retirement calculators; integrated web-, mobile-, and software-based trading platforms, real-time market data, options trading, premium research, and multi-channel access; self-service education and support tools; online research and analysis tools; equity compensation plan sponsors full-service recordkeeping for stock plans, stock options, restricted stock, performance shares, and stock appreciation rights; retirement plan services; mutual fund clearing services; and advisor services, including interactive tools and educational content. The Company operates through branch offices. The Charles Schwab Corporation was founded in 1971 and is headquartered in Westlake, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"D.R. Horton, Inc.","Symbol":"DHI","Current Price":"146.93","Latest MA":"166.72","Price Target":170.60126,"Difference from MA":"-11.87%","Difference from Open":"2.35%","Change from Yesterday":"2.25%","Change from Last Report":"0.00","Latest Volume":"3,819,274","Market Cap":"47,139,401,728","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":9.807625,"PB Ratio":1.8808483,"ROE":0.19631,"DTE":22.915,"Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":1.744,"Trailing PEG":0.5413,"Trailing PE":10.398442,"Trailing PS":1.2809132,"Quick Ratio":0.766,"Day High":147.19,"Day Low":143.525,"VS Average Volume":1.2173271975,"Company Summary":"D.R. Horton, Inc. operates as a homebuilding company in East, North, Southeast, South Central, Southwest, and Northwest regions in the United States. It engages in the acquisition and development of land; and construction and sale of residential homes in 125 markets across 36 states under the names of D.R. Horton. The company constructs and sells single-family detached homes; and attached homes, such as townhomes, duplexes, and triplexes. It provides mortgage financing services; and title insurance policies, and examination and closing services, as well as engages in the residential lot development business. In addition, the company develops, constructs, owns, leases, and sells multi-family and single-family rental properties; and owns non-residential real estate, including ranch land and improvements. It primarily serves homebuyers. D.R. Horton, Inc. was founded in 1978 and is headquartered in Arlington, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"KeyCorp","Symbol":"KEY","Current Price":"17.30","Latest MA":"16.56","Price Target":21.015,"Difference from MA":"4.47%","Difference from Open":"-1.14%","Change from Yesterday":"-1.93%","Change from Last Report":"0.00","Latest Volume":"11,989,661","Market Cap":"19,147,466,752","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":9.939329,"PB Ratio":1.1948339,"ROE":0.0096700005,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.231,"Trailing PEG":0.7171,"Trailing PE":"N\/A","Trailing PS":3.946304,"Quick Ratio":"N\/A","Day High":17.57,"Day Low":17.225,"VS Average Volume":1.1523669171,"Company Summary":"KeyCorp operates as the holding company for KeyBank National Association that provides various retail and commercial banking products and services in the United States. It operates in two segments, Consumer Bank and Commercial Bank. The company offers various deposits, investment products and services; commercial leasing, investment management, consumer finance; and personal finance and financial wellness, student loan refinancing, mortgage and home equity, lending, credit card, treasury, business advisory, wealth management, asset management, cash management, portfolio management, and trust and related services to individuals and small and medium-sized businesses. It also provides a suite of banking and capital market products, such as syndicated finance, debt and equity capital market products, commercial payments, equipment finance, commercial mortgage banking, derivatives, foreign exchange, financial advisory, and public finance, as well as commercial mortgage loans to consumer, energy, healthcare, industrial, public sector, real estate, and technology sectors for middle market clients. In addition, the company offers community development financing, securities underwriting, brokerage, and investment banking services. The company was founded in 1849 and is headquartered in Cleveland, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Old National Bancorp","Symbol":"ONB","Current Price":"23.44","Latest MA":"19.62","Price Target":27.61111,"Difference from MA":"19.46%","Difference from Open":"-0.64%","Change from Yesterday":"-0.93%","Change from Last Report":"0.00","Latest Volume":"3,537,476","Market Cap":"7,476,891,136","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":8.875527,"PB Ratio":1.2182952,"ROE":0.08922,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.807,"Trailing PEG":null,"Trailing PE":13.952382,"Trailing PS":4.2752795,"Quick Ratio":"N\/A","Day High":23.61,"Day Low":23.07,"VS Average Volume":1.1730918268,"Company Summary":"Old National Bancorp operates as the bank holding company for Old National Bank that provides various financial services to individual and commercial customers in the United States. It accepts deposit accounts, including noninterest-bearing demand, interest-bearing checking, negotiable order of withdrawal, savings and money market, and time deposits; and offers loans, such as home equity lines of credit, residential real estate loans, consumer loans, commercial loans, commercial real estate loans, agricultural loans, letters of credit, and lease financing. The company also provides debit and automated teller machine cards, telephone access, online banking, and other electronic and mobile banking services; cash management, private banking, brokerage, trust, investment advisory, and other traditional banking services; wealth management, investment, and foreign currency services; and treasury management, merchant, and capital markets services, as well as community development lending and equity investment solutions. The company was founded in 1834 and is headquartered in Evansville, Indiana.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Citizens Financial Group, Inc.","Symbol":"CFG","Current Price":"47.03","Latest MA":"41.83","Price Target":52.32105,"Difference from MA":"12.43%","Difference from Open":"-2.04%","Change from Yesterday":"-2.65%","Change from Last Report":"0.00","Latest Volume":"4,341,534","Market Cap":"20,718,737,408","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":9.484188,"PB Ratio":0.9175511,"ROE":0.05426,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.32,"Trailing PEG":null,"Trailing PE":15.521452,"Trailing PS":2.9119802,"Quick Ratio":"N\/A","Day High":48.15,"Day Low":46.97,"VS Average Volume":1.083384385,"Company Summary":"Citizens Financial Group, Inc. operates as the bank holding company that provides retail and commercial banking products and services to individuals, small businesses, middle-market companies, corporations, and institutions in the United States. The company operates in two segments, Consumer Banking and Commercial Banking. The Consumer Banking segment offers deposit products, mortgage and home equity lending products, credit cards, business loans, wealth management, and investment services; and auto, education, and point-of-sale finance loans, as well as digital deposit products. This segment serves its customers through telephone service centers, as well as through its online and mobile platforms. The Commercial Banking segment provides various financial products and solutions, including lending and leasing, deposit and treasury management services, foreign exchange, and interest rate and commodity risk management solutions, as well as syndicated loans, corporate finance, mergers and acquisitions, and debt and equity capital markets services. This segment serves corporate banking, healthcare, technology, asset finance, franchise finance, leasing, asset-based lending, commercial real estate, mid-corporate, and private equity sponsor industries. The company was formerly known as RBS Citizens Financial Group, Inc. and changed its name to Citizens Financial Group, Inc. in April 2014. Citizens Financial Group, Inc. was founded in 1828 and is headquartered in Providence, Rhode Island.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"3M Company","Symbol":"MMM","Current Price":"149.12","Latest MA":"125.48","Price Target":152.0711,"Difference from MA":"18.84%","Difference from Open":"0.84%","Change from Yesterday":"1.52%","Change from Last Report":"0.00","Latest Volume":"6,404,810","Market Cap":"80,445,767,680","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":17.493149,"PB Ratio":17.494133,"ROE":1.1329399,"DTE":295.441,"Industry":"Conglomerates","Sector":"Industrials","Beta":1.001,"Trailing PEG":null,"Trailing PE":20.539944,"Trailing PS":2.4647887,"Quick Ratio":0.95,"Day High":152.08,"Day Low":147.44,"VS Average Volume":1.8429856275,"Company Summary":"3M Company provides diversified technology services in the United States and internationally. The company's Safety and Industrial segment offers industrial abrasives and finishing for metalworking applications; autobody repair solutions; closure systems for personal hygiene products, masking, and packaging materials; electrical products and materials for construction and maintenance, power distribution, and electrical original equipment manufacturers; structural adhesives and tapes; respiratory, hearing, eye, and fall protection solutions; and natural and color-coated mineral granules for shingles. Its Transportation and Electronics segment provides ceramic solutions; attachment\/bonding products, films, sound, and temperature management for transportation vehicles; premium large format graphic films for advertising and fleet signage; light management films and electronics assembly solutions; packaging and interconnection solutions; semiconductor production materials; data centers solutions; and reflective signage for highway, and vehicle safety. The company's Consumer segment provides consumer bandages, braces, supports, and consumer respirators; home cleaning products; retail abrasives, paint accessories, car care DIY products, picture hanging, and consumer air quality solutions; and stationery products. It offers its products through e-commerce and traditional wholesalers, retailers, jobbers, distributors, and dealers. 3M Company was founded in 1902 and is headquartered in Saint Paul, Minnesota.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Regions Financial Corporation","Symbol":"RF","Current Price":"24.32","Latest MA":"22.85","Price Target":27.3681,"Difference from MA":"6.42%","Difference from Open":"-0.94%","Change from Yesterday":"-1.34%","Change from Last Report":"0.00","Latest Volume":"7,609,500","Market Cap":"22,103,572,480","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":9.8240795,"PB Ratio":1.3056315,"ROE":0.10042,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.182,"Trailing PEG":4.6787,"Trailing PE":12.601036,"Trailing PS":3.3715026,"Quick Ratio":"N\/A","Day High":24.55,"Day Low":24.1195,"VS Average Volume":0.9328542324,"Company Summary":"Regions Financial Corporation, a financial holding company, provides banking and bank-related services to individual and corporate customers. It operates through three segments: Corporate Bank, Consumer Bank, and Wealth Management. The Corporate Bank segment offers commercial banking services, such as commercial and industrial, commercial real estate, and investor real estate lending; equipment lease financing; deposit products; and securities underwriting and placement, loan syndication and placement, foreign exchange, derivatives, merger and acquisition, and other advisory services. It serves corporate, middle market, and commercial real estate developers and investors. The Consumer Bank segment provides consumer banking products and services related to residential first mortgages, home equity lines and loans, consumer credit cards, and other consumer loans, as well as deposits. The Wealth Management segment offers credit related products, and retirement and savings solutions; and trust and investment management, asset management, and estate planning services to individuals, businesses, governmental institutions, and non-profit entities. It also provides investment and insurance products; low-income housing tax credit corporate fund syndication services; and other specialty financing services. The company was founded in 1971 and is headquartered in Birmingham, Alabama.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Schlumberger N.V.","Symbol":"SLB","Current Price":"41.63","Latest MA":"42.83","Price Target":53.44613,"Difference from MA":"-2.81%","Difference from Open":"-4.03%","Change from Yesterday":"-4.82%","Change from Last Report":"0.00","Latest Volume":"19,615,483","Market Cap":"58,323,628,032","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":10.955725,"PB Ratio":2.7328827,"ROE":0.21722999,"DTE":57.141,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.532,"Trailing PEG":1.8559,"Trailing PE":13.385853,"Trailing PS":1.6203258,"Quick Ratio":1.003,"Day High":43.45,"Day Low":41.455,"VS Average Volume":1.5463951669,"Company Summary":"Schlumberger Limited engages in the provision of technology for the energy industry worldwide. The company operates through four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company provides field development and hydrocarbon production, carbon management, and integration of adjacent energy systems; reservoir interpretation and data processing services for exploration data; and well construction and production improvement services and products. It also offers subsurface geology and fluids evaluation information; open and cased hole services; exploration and production pressure, and flow-rate measurement services; and pressure pumping, well stimulation, and coiled tubing equipment solutions. In addition, the company offers mud logging, directional drilling, measurement-while-drilling, and logging-while-drilling services, as well as engineering support services; supplies drilling fluid systems; designs, manufactures, and markets roller cone and fixed cutter drill bits; bottom-hole-assembly and borehole enlargement technologies; well cementing products and services; well planning, well drilling, engineering, supervision, logistics, procurement, and contracting of third parties, as well as drilling rig management solutions; and drilling equipment and services, as well as land drilling rigs and related services. Further, it provides artificial lift production equipment and optimization services; supplies packers, safety valves, sand control technology, and various intelligent well completions technology and equipment; designs and manufactures valves, chokes, actuators, and surface trees; and OneSubsea, an integrated solutions, products, systems, and services, including wellheads, subsea trees, manifolds and flowline connectors, control systems, connectors, and services. The company was formerly known as Socie´te´ de Prospection E´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Truist Financial Corporation","Symbol":"TFC","Current Price":"47.01","Latest MA":"42.73","Price Target":51.058,"Difference from MA":"10.03%","Difference from Open":"-1.51%","Change from Yesterday":"-1.84%","Change from Last Report":"0.00","Latest Volume":"7,168,892","Market Cap":"61,862,334,464","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":10.186305,"PB Ratio":1.0573311,"ROE":-0.09505,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.035,"Trailing PEG":1.9441,"Trailing PE":"N\/A","Trailing PS":4.2672505,"Quick Ratio":"N\/A","Day High":47.735,"Day Low":46.41,"VS Average Volume":0.9119190467,"Company Summary":"Truist Financial Corporation, a financial services company, provides banking and trust services in the Southeastern and Mid-Atlantic United States. The company operates through three segments: Consumer Banking and Wealth, Corporate and Commercial Banking, and Insurance Holdings.Its deposit products include noninterest-bearing checking, interest-bearing checking, savings, and money market deposit accounts, as well as certificates of deposit and individual retirement accounts. The company also provides funding; asset management; automobile lending; credit card lending; consumer finance; home equity and mortgage lending; other direct retail lending; insurance; investment brokerage; mobile\/online banking; payment solutions; point-of-sale lending; retail and small business deposit products; small business lending; and wealth management\/private banking services. In addition, it offers asset based lending, investment banking and capital market, institutional trust, insurance premium finance, derivatives, commercial lending, international banking, leasing, merchant, commercial deposit and treasury, floor plan, mortgage warehouse lending, real estate lending, and supply chain financing services. Further, the company provides insurance brokerage, retail and wholesale brokerage, securities underwriting and market making, loan syndication, and investment management and advisory services. The company was formerly known as BB&T Corporation and changed its name to Truist Financial Corporation in December 2019. Truist Financial Corporation was founded in 1872 and is headquartered in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Fastenal Company","Symbol":"FAST","Current Price":"75.60","Latest MA":"72.12","Price Target":75.71,"Difference from MA":"4.83%","Difference from Open":"-0.84%","Change from Yesterday":"-0.64%","Change from Last Report":"0.00","Latest Volume":"4,442,526","Market Cap":"43,342,991,360","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":32.12742,"PB Ratio":12.040133,"ROE":0.32698002,"DTE":14.644,"Industry":"Industrial Distribution","Sector":"Industrials","Beta":0.979,"Trailing PEG":3.3266,"Trailing PE":37.8,"Trailing PS":5.7944403,"Quick Ratio":2.013,"Day High":76.625,"Day Low":75.58,"VS Average Volume":1.5671219907,"Company Summary":"Fastenal Company, together with its subsidiaries, engages in the wholesale distribution of industrial and construction supplies in the United States, Canada, Mexico, North America, and internationally. It offers fasteners, and related industrial and construction supplies under the Fastenal name. The company's fastener products include threaded fasteners, bolts, nuts, screws, studs, and related washers that are used in manufactured products and construction projects, as well as in the maintenance and repair of machines. It also offers miscellaneous supplies and hardware, including pins, machinery keys, concrete anchors, metal framing systems, wire ropes, strut products, rivets, and related accessories. The company serves the manufacturing market comprising original equipment manufacturers; maintenance, repair, and operations customers; non-residential construction market; farmers, truckers, railroads, mining companies, schools, and retail trades; and oil exploration, production, and refinement companies, as well as federal, state, and local governmental entities. Fastenal Company was founded in 1967 and is headquartered in Winona, Minnesota.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"Huntington Bancshares Incorpora","Symbol":"HBAN","Current Price":"16.86","Latest MA":"15.10","Price Target":18.69526,"Difference from MA":"11.67%","Difference from Open":"-0.82%","Change from Yesterday":"-1.40%","Change from Last Report":"0.00","Latest Volume":"16,763,785","Market Cap":"24,508,370,944","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":10.84649,"PB Ratio":1.3449266,"ROE":0.08545,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.057,"Trailing PEG":2.8505,"Trailing PE":13.819673,"Trailing PS":3.6634338,"Quick Ratio":"N\/A","Day High":17.1,"Day Low":16.73,"VS Average Volume":1.1130839101,"Company Summary":"Huntington Bancshares Incorporated operates as the bank holding company for The Huntington National Bank that provides commercial, consumer, and mortgage banking services in the United States. The company offers financial products and services to consumer and business customers, including deposits, lending, payments, mortgage banking, dealer financing, investment management, trust, brokerage, insurance, and other financial products and services. It also provides 24-hour grace, asterisk-free checking, money scout, $50 safety zone, standby cash, early pay, instant access, savings goal getter, and Huntington heads up; digitally powered consumer and business financial solutions to consumer lending, regional banking, branch banking, and wealth management customers; direct and indirect consumer loans, as well as dealer finance loans and deposits; and private banking, wealth management and legacy planning through investment and portfolio management, fiduciary administration and trust, institutional custody, and full-service retail brokerage investment services. The company offers equipment financing, asset-based lending, distribution finance, structured lending, and municipal financing solutions, as well as Huntington ChoicePay. In addition, it offers lending, liquidity, treasury management and other payment services, and capital markets; government and non-profits, healthcare, technology and telecommunications, franchises, financial sponsors, and global services; and corporate risk management, institutional sales and trading, debt and equity issuance, and additional advisory services. The company offers its products through a network of channels, including branches and ATMs, online and mobile banking, and through customer call centers to customers in middle market banking, corporate, specialty, and government banking, asset finance, commercial real estate banking, and capital markets. The company was founded in 1866 and is headquartered in Columbus, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"State Street Corporation","Symbol":"STT","Current Price":"97.17","Latest MA":"87.40","Price Target":109.75,"Difference from MA":"11.18%","Difference from Open":"-1.46%","Change from Yesterday":"-1.85%","Change from Last Report":"0.00","Latest Volume":"2,027,455","Market Cap":"28,059,394,048","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":9.059414,"PB Ratio":1.2422495,"ROE":0.0855,"DTE":"N\/A","Industry":"Asset Management","Sector":"Financial Services","Beta":1.48,"Trailing PEG":0.6216,"Trailing PE":11.8355665,"Trailing PS":2.2361648,"Quick Ratio":"N\/A","Day High":99.04,"Day Low":96.95,"VS Average Volume":0.9527993184,"Company Summary":"State Street Corporation, through its subsidiaries, provides a range of financial products and services to institutional investors worldwide. The company offers investment servicing products and services, including custody, accounting, regulatory reporting, investor, and performance and analytics; middle office products, such as IBOR, transaction management, loans, cash, derivatives and collateral, record keeping, and client reporting and investment analytics; finance leasing; foreign exchange, and brokerage and other trading services; securities finance and enhanced custody products; deposit and short-term investment facilities; investment manager and alternative investment manager operations outsourcing; performance, risk, and compliance analytics; and financial data management to support institutional investors. It also engages in the provision of portfolio management and risk analytics, as well as trading and post-trade settlement services with integrated compliance and managed data. In addition, the company offers investment management strategies and products, such as core and enhanced indexing, multi-asset strategies, active quantitative and fundamental active capabilities, and alternative investment strategies. Further, it provides services and solutions, including environmental, social, and governance investing; defined benefit and defined contribution; and global fiduciary solutions, as well as exchange-traded funds under the SPDR ETF brand. The company provides its products and services to mutual funds, collective investment funds, UCITS, hedge funds and other investment pools, corporate and public retirement plans, insurance companies, foundations, endowments, and investment managers. State Street Corporation was founded in 1792 and is headquartered in Boston, Massachusetts.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"M&T Bank Corporation","Symbol":"MTB","Current Price":"195.60","Latest MA":"179.94","Price Target":221.8158,"Difference from MA":"8.70%","Difference from Open":"-1.11%","Change from Yesterday":"-1.34%","Change from Last Report":"0.00","Latest Volume":"1,286,407","Market Cap":"32,454,146,048","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.599771,"PB Ratio":1.2271787,"ROE":0.08676,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.732,"Trailing PEG":null,"Trailing PE":13.369788,"Trailing PS":3.8185842,"Quick Ratio":"N\/A","Day High":197.575,"Day Low":194.43,"VS Average Volume":1.0994057737,"Company Summary":"M&T Bank Corporation operates as a bank holding company for Manufacturers and Traders Trust Company and Wilmington Trust, National Association that engages in the provision of retail and commercial banking products and services in the United States. The company operates through three segments: Commercial Bank, Retail Bank, and Institutional Services and Wealth Management. It offers a range of credit products and banking services, such as commercial lending and leasing, letters of credits, commercial real estate loans, and credit facilities secured by various commercial real estate to middle-market and large commercial customers. The company also provides customers deposit products, including demand, savings and time accounts, and other services; automobile and recreational finance loans, home equity loans and lines of credit, credit cards, and other loan products, as well as residential mortgage and real estate loans; business loans, cash management, payroll, and direct deposit services to consumers and small businesses through branch network, telephone banking, internet banking, and automated teller machines. In addition, it offers trustee, agency, investment management, security brokerage, and administrative services; personal trust, planning, fiduciary, asset management, family office, and other services; and investment products, including mutual funds and annuities, and other services for corporations and institutions, investment bankers, corporate tax, finance and legal executives, and other institutional clients. The company was founded in 1856 and is headquartered in Buffalo, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:07:17"},{"Company Name":"PNC Financial Services Group, I","Symbol":"PNC","Current Price":"196.30","Latest MA":"182.39","Price Target":217.956,"Difference from MA":"7.63%","Difference from Open":"-0.59%","Change from Yesterday":"-1.14%","Change from Last Report":"0.00","Latest Volume":"2,158,761","Market Cap":"77,722,435,584","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":11.367294,"PB Ratio":1.5758967,"ROE":0.099020004,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.121,"Trailing PEG":1.8886,"Trailing PE":14.286755,"Trailing PS":3.7942998,"Quick Ratio":"N\/A","Day High":197.785,"Day Low":195.37,"VS Average Volume":1.0662938753,"Company Summary":"The PNC Financial Services Group, Inc. operates as a diversified financial services company in the United States. It operates through three segments: Retail Banking, Corporate & Institutional Banking, and Asset Management Group segments. The company's Retail Banking segment offers checking, savings, and money market accounts, as well as time deposit; residential mortgages, home equity loans and lines of credit, auto loans, credit cards, education loans, and personal and small business loans and lines of credit; and brokerage, insurance, and investment and cash management services. This segment serves consumer and small business customers through a network of branches, digital channels, ATMs, and through phone-based customer contact centers. Its Corporate & Institutional Banking segment provides secured and unsecured loans, letters of credit, and equipment leases; cash and investment management services, receivables and disbursement management services, funds transfer services, international payment services, and access to online\/mobile information management and reporting; securities underwriting, loan syndications, customer-related trading, and mergers and acquisitions and equity capital markets advisory related services; and commercial loan servicing and technology solutions. It serves mid-sized and large corporations, and government and not-for-profit entities. The company's Asset Management Group segment offers investment and retirement planning, customized investment management, credit and cash management solutions, and trust management and administration services for high net worth and ultra high net worth individuals, and their families; and multi-generational family planning services for ultra high net worth individuals and their families. It also provides outsourced chief investment officer, custody, private real estate, cash and fixed income client solutions, and retirement plan fiduciary investment services for institutional clients. The company was founded in 1852 and is headquartered in Pittsburgh, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"Bank OZK","Symbol":"OZK","Current Price":"50.97","Latest MA":"43.28","Price Target":54.375,"Difference from MA":"17.76%","Difference from Open":"1.51%","Change from Yesterday":"0.85%","Change from Last Report":"0.00","Latest Volume":"1,517,547","Market Cap":"5,782,393,856","Earning Date":"2025-01-16","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":7.672138,"PB Ratio":1.1006262,"ROE":0.13515,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.152,"Trailing PEG":null,"Trailing PE":8.383224,"Trailing PS":3.9626203,"Quick Ratio":"N\/A","Day High":50.97,"Day Low":50.11,"VS Average Volume":1.195563749,"Company Summary":"Bank OZK provides various retail and commercial banking services for individuals and businesses in the United States. The company offers deposit services, including non-interest bearing checking, interest bearing transaction, business sweep, savings, money market, individual retirement, and other accounts, as well as time and reciprocal deposits. It also provides trust and wealth services, such as personal trusts, custodial accounts, investment management accounts, and retirement accounts, as well as corporate trust services, including trustee, paying agent and registered transfer agent services, and other related services. In addition, the company offers treasury management services comprising automated clearing house, wire transfer, transaction reporting, wholesale lockbox, remote deposit capture, automated credit line transfer, reconciliation, positive pay, commercial card, and other services, as well as zero balance and investment sweep accounts. Further, it provides real estate, consumer, small business, indirect recreational vehicle and marine, equipment, agricultural, commercial and industrial, government guaranteed, lines of credit, homebuilder, and affordable housing loans; lender and structured, business aviation, and subscription financing services; and mortgage and other lending products. Additionally, the company offers ATMs; telephone, online, and mobile banking services; credit and debit cards; safe deposit boxes; and other products and services. The company was formerly known as Bank of the Ozarks and changed its name to Bank OZK in July 2018. Bank OZK was founded in 1903 and is headquartered in Little Rock, Arkansas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"UnitedHealth Group Incorporated","Symbol":"UNH","Current Price":"519.72","Latest MA":"555.70","Price Target":634.89703,"Difference from MA":"-6.47%","Difference from Open":"-0.37%","Change from Yesterday":"-1.00%","Change from Last Report":"0.00","Latest Volume":"3,754,111","Market Cap":"478,289,985,536","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":15.505351,"PB Ratio":5.07435,"ROE":0.15252,"DTE":74.683,"Industry":"Healthcare Plans","Sector":"Healthcare","Beta":0.591,"Trailing PEG":1.4386,"Trailing PE":33.551968,"Trailing PS":1.2142483,"Quick Ratio":0.833,"Day High":524.44,"Day Low":516.02,"VS Average Volume":0.7739086695,"Company Summary":"UnitedHealth Group Incorporated operates as a diversified health care company in the United States. The company operates through four segments: UnitedHealthcare, Optum Health, Optum Insight, and Optum Rx. The UnitedHealthcare segment offers consumer-oriented health benefit plans and services for national employers, public sector employers, mid-sized employers, small businesses, and individuals; health care coverage, and health and well-being services to individuals age 50 and older addressing their needs; Medicaid plans, children's health insurance and health care programs; and health and dental benefits, and hospital and clinical services, as well as health care benefits products and services to state programs caring for the economically disadvantaged, medically underserved, and those without the benefit of employer-funded health care coverage. The Optum Health segment provides care delivery, care management, wellness and consumer engagement, and health financial services patients, consumers, care delivery systems, providers, employers, payers, and public-sector entities. The Optum Insight segment offers software and information products, advisory consulting arrangements, and managed services outsourcing contracts to hospital systems, physicians, health plans, governments, life sciences companies, and other organizations. The Optum Rx segment provides pharmacy care services and programs, including retail network contracting, home delivery, specialty and community health pharmacy services, infusion, and purchasing and clinical capabilities, as well as develops programs in the areas of step therapy, formulary management, drug adherence, and disease\/drug therapy management. UnitedHealth Group Incorporated was founded in 1974 and is based in Minnetonka, Minnesota.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"U.S. Bancorp","Symbol":"USB","Current Price":"48.63","Latest MA":"45.62","Price Target":57.04762,"Difference from MA":"6.61%","Difference from Open":"-0.73%","Change from Yesterday":"-1.40%","Change from Last Report":"0.00","Latest Volume":"7,888,224","Market Cap":"75,862,802,432","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.05367,"PB Ratio":1.4581271,"ROE":0.09779,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.04,"Trailing PEG":1.1822,"Trailing PE":12.831135,"Trailing PS":3.047066,"Quick Ratio":"N\/A","Day High":49.09,"Day Low":47.94,"VS Average Volume":1.0026066015,"Company Summary":"U.S. Bancorp, a financial services holding company, provides various financial services to individuals, businesses, institutional organizations, governmental entities, and other financial institutions in the United States. It operates through Wealth, Corporate, Commercial and Institutional Banking; Consumer and Business Banking; Payment Services; and Treasury and Corporate Support segments. The company offers depository services, including checking accounts, savings accounts, and time certificate contracts; and lending services, such as traditional credit products and credit card services, lease financing and import\/export trade, asset-backed lending, agricultural finance, and other products. It also provides ancillary services comprising capital markets, treasury management, and receivable lock-box collection services to corporate and governmental entity customers. In addition, the company offers asset management and fiduciary services for individuals, estates, foundations, business corporations, and charitable organizations. Further, it provides investment and insurance products to its customers principally within its domestic markets, as well as fund administration services to mutual and other funds. Additionally, the company provides corporate and purchasing card, and corporate trust services. Furthermore, it offers trust and investment management, merchant and ATM processing, mortgage banking, insurance, and brokerage and leasing services. U.S. Bancorp was founded in 1863 and is headquartered in Minneapolis, Minnesota.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"Bank of America Corporation","Symbol":"BAC","Current Price":"45.79","Latest MA":"41.94","Price Target":51.92857,"Difference from MA":"9.19%","Difference from Open":"-1.74%","Change from Yesterday":"-1.86%","Change from Last Report":"0.00","Latest Volume":"28,423,823","Market Cap":"348,501,278,720","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.571811,"PB Ratio":1.2945634,"ROE":0.08092,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.325,"Trailing PEG":2.0288,"Trailing PE":14.264797,"Trailing PS":3.6829338,"Quick Ratio":"N\/A","Day High":46.73,"Day Low":45.76,"VS Average Volume":0.8043748199,"Company Summary":"Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. It operates in four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, non-interest and interest-bearing checking accounts, and investment accounts and products; credit and debit cards; residential mortgages, and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research, and certain market-based services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"First Horizon Corporation","Symbol":"FHN","Current Price":"20.99","Latest MA":"17.32","Price Target":23.2,"Difference from MA":"21.17%","Difference from Open":"-1.59%","Change from Yesterday":"-1.96%","Change from Last Report":"0.00","Latest Volume":"6,948,086","Market Cap":"10,998,759,424","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":11.144028,"PB Ratio":1.29961,"ROE":0.08979,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.882,"Trailing PEG":null,"Trailing PE":15.433824,"Trailing PS":3.581491,"Quick Ratio":"N\/A","Day High":21.455,"Day Low":20.99,"VS Average Volume":1.1244016576,"Company Summary":"First Horizon Corporation operates as the bank holding company for First Horizon Bank that provides various financial services. The company operates through Regional Banking and Specialty Banking segments. It offers general banking services for consumers, businesses, financial institutions, and governments. The company also accepts deposits; provides underwriting services for bank-eligible securities and other fixed-income securities by financial subsidiaries; sells loans and derivatives; financial planning; and offers investment and financial advisory services. In addition, it offers mortgage banking; loan syndications; brokerage services; commercial and business banking for business enterprises, consumer banking, and private client and wealth management services; capital markets, professional commercial real estate, mortgage warehouse and asset-based lending, franchise and equipment finance, tax credit finance, energy and healthcare finance, asset management, and corporate and correspondent banking services. Further, the company provides transaction processing services including check clearing services and remittance processing, credit cards, investment, and sale of mutual fund and retail insurances, as well as trust, fiduciary, and agency services. First Horizon Corporation was founded in 1864 and is headquartered in Memphis, Tennessee.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"Morgan Stanley","Symbol":"MS","Current Price":"136.00","Latest MA":"111.87","Price Target":135.16667,"Difference from MA":"21.57%","Difference from Open":"-0.92%","Change from Yesterday":"-0.95%","Change from Last Report":"0.00","Latest Volume":"5,612,620","Market Cap":"218,552,008,704","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":14.4659,"PB Ratio":2.3349245,"ROE":0.11079001,"DTE":405.772,"Industry":"Capital Markets","Sector":"Financial Services","Beta":1.336,"Trailing PEG":3.6364,"Trailing PE":17.085426,"Trailing PS":3.7499058,"Quick Ratio":1.83,"Day High":138.38,"Day Low":135.815,"VS Average Volume":0.8259894811,"Company Summary":"Morgan Stanley, a financial holding company, provides various financial products and services to corporations, governments, financial institutions, and individuals in the Americas, Europe, the Middle East, Africa, and Asia. It operates through Institutional Securities, Wealth Management, and Investment Management segments. The Institutional Securities segment offers capital raising and financial advisory services, including services related to the underwriting of debt, equity, and other securities, as well as advice on mergers and acquisitions, restructurings, real estate, and project finance. This segment also provides equity and fixed income products comprising sales, financing, prime brokerage, and market-making services; foreign exchange and commodities; corporate and commercial real estate loans, commercial mortgage and secured lending facilities, and financing for sales and trading customers, and asset-backed and mortgage lending; and wealth management services, investment, and research services. The Wealth Management segment offers financial advisor-led brokerage, custody, administrative, and investment advisory services; self-directed brokerage services; financial and wealth planning services; workplace services, including stock plan administration; annuity and insurance products; securities-based lending, residential real estate loans, and other lending products; banking; and retirement plan services to individual investors and small to medium-sized businesses and institutions. The Investment Management segment provides equity, fixed income, alternatives and solutions, and liquidity and overlay services to benefit\/defined contribution plans, foundations, endowments, government entities, sovereign wealth funds, insurance companies, third-party fund sponsors, corporations, and individuals through institutional and intermediary channels. The company was founded in 1924 and is headquartered in New York, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"Synovus Financial Corp.","Symbol":"SNV","Current Price":"55.13","Latest MA":"47.19","Price Target":63.11765,"Difference from MA":"16.83%","Difference from Open":"0.05%","Change from Yesterday":"-0.40%","Change from Last Report":"0.00","Latest Volume":"1,203,471","Market Cap":"7,782,481,920","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":10.221241,"PB Ratio":1.6245285,"ROE":0.07237,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.392,"Trailing PEG":null,"Trailing PE":18.19472,"Trailing PS":4.445375,"Quick Ratio":"N\/A","Day High":55.41,"Day Low":54.56,"VS Average Volume":0.9144131241,"Company Summary":"Synovus Financial Corp. operates as the bank holding company for Synovus Bank that provides commercial and consumer banking products and services. It operates through four segments: Community Banking, Wholesale Banking, Consumer Banking, and Financial Management Services. The company's commercial banking services include treasury and asset management, capital market, and institutional trust services, as well as commercial, financial, and real estate lending services. Its consumer banking services comprise accepting customary types of demand and savings deposits accounts; mortgage, installment, and other consumer loans; investment and brokerage services; safe deposit services; automated banking services; automated fund transfers; internet-based banking services; and bank credit and debit card services, including Visa and MasterCard services. The company also offers various other financial services, including portfolio management for fixed-income securities, investment banking, execution of securities transactions as a broker\/dealer, trust management, and financial planning services, as well as provides individual investment advice on equity and other securities. The company was founded in 1888 and is headquartered in Columbus, Georgia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"Citigroup, Inc.","Symbol":"C","Current Price":"81.69","Latest MA":"64.85","Price Target":88.8355,"Difference from MA":"25.97%","Difference from Open":"0.27%","Change from Yesterday":"0.02%","Change from Last Report":"0.00","Latest Volume":"12,293,217","Market Cap":"153,340,313,600","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.832861,"PB Ratio":0.8016133,"ROE":0.03874,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.426,"Trailing PEG":0.8855,"Trailing PE":13.729413,"Trailing PS":2.2124476,"Quick Ratio":"N\/A","Day High":82.275,"Day Low":81.23,"VS Average Volume":0.8413838998,"Company Summary":"Citigroup Inc., a diversified financial service holding company, provides various financial product and services to consumers, corporations, governments, and institutions worldwide. It operates through five segments: Services, Markets, Banking, U.S. Personal Banking, and Wealth. The Services segment includes Treasury and Trade Solutions, which provides cash management, trade, and working capital solutions to multinational corporations, financial institutions, and public sector organizations; and Securities Services, such as cross-border support for clients, local market expertise, post-trade technologies, data solutions, and various securities services solutions. The Markets segment offers sales and trading services for equities, foreign exchange, rates, spread products, and commodities to corporate, institutional, and public sector clients; and market-making services, including asset classes, risk management solutions, financing, prime brokerage, research, securities clearing, and settlement. The banking segment includes investment banking; advisory services related to mergers and acquisitions, divestitures, restructurings, and corporate defense activities; and corporate lending, which includes corporate and commercial banking. The U.S. Personal Banking segment provides co-branded cards and retail banking services. The Wealth segment provides financial services to high-net-worth clients through banking, lending, mortgages, investment, custody, and trust product offerings; and to professional industries, including law firms, consulting groups, accounting, and asset management. The company was founded in 1812 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"The Bank of New York Mellon Cor","Symbol":"BK","Current Price":"84.33","Latest MA":"71.16","Price Target":91.03125,"Difference from MA":"18.51%","Difference from Open":"-0.54%","Change from Yesterday":"-0.71%","Change from Last Report":"0.00","Latest Volume":"3,514,373","Market Cap":"60,521,955,328","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":10.891831,"PB Ratio":1.6285897,"ROE":0.08563,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.06,"Trailing PEG":0.7252,"Trailing PE":14.539655,"Trailing PS":3.3999186,"Quick Ratio":"N\/A","Day High":85.81,"Day Low":83.87,"VS Average Volume":0.9238306988,"Company Summary":"The Bank of New York Mellon Corporation provides a range of financial products and services in the United States and internationally. The company operates through Securities Services, Market and Wealth Services, Investment and Wealth Management, and other segments. The Securities Services segment offers custody, trust and depositary, accounting, exchange-traded funds, middle-office solutions, transfer agency, services for private equity and real estate funds, foreign exchange, securities lending, liquidity\/lending services, and data analytics. This segment also provides trustee, paying agency, fiduciary, escrow and other financial, issuer, and support services for brokers and investors. The Market and Wealth Services segment offers clearing and custody, investment, wealth and retirement solutions, technology and enterprise data management, trading, and prime brokerage services. This segment also provides integrated cash management solutions, including payments, foreign exchange, liquidity management, receivables processing and payables management, and trade finance and processing services. The Investment and Wealth Management segment offers investment management strategies and distribution of investment products, investment management, custody, wealth and estate planning, private banking, investment, and information management services. The Other segment engages in the provision of leasing, corporate treasury, derivative and other trading, corporate and bank-owned life insurance, renewable energy investment, and business exit services. It serves central banks and sovereigns, financial institutions, asset managers, insurance companies, corporations, local authorities and high net-worth individuals, and family offices. The Bank of New York Mellon Corporation was founded in 1784 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"Wells Fargo & Company","Symbol":"WFC","Current Price":"77.54","Latest MA":"62.77","Price Target":82.52381,"Difference from MA":"23.52%","Difference from Open":"-0.04%","Change from Yesterday":"-0.40%","Change from Last Report":"0.00","Latest Volume":"7,940,706","Market Cap":"255,024,414,720","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":11.336174,"PB Ratio":1.5754399,"ROE":0.099139996,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.136,"Trailing PEG":3.5004,"Trailing PE":14.439479,"Trailing PS":3.2747917,"Quick Ratio":"N\/A","Day High":77.81,"Day Low":76.865,"VS Average Volume":0.468372121,"Company Summary":"Wells Fargo & Company, a financial services company, provides diversified banking, investment, mortgage, and consumer and commercial finance products and services in the United States and internationally. The company operates through four segments: Consumer Banking and Lending; Commercial Banking; Corporate and Investment Banking; and Wealth and Investment Management. The Consumer Banking and Lending segment offers diversified financial products and services for consumers and small businesses. Its financial products and services include checking and savings accounts, and credit and debit cards, as well as home, auto, personal, and small business lending services. The Commercial Banking segment provides financial solutions to private, family owned, and certain public companies. Its products and services include banking and credit products across various industry sectors and municipalities, secured lending and lease products, and treasury management services. The Corporate and Investment Banking segment offers a suite of capital markets, banking, and financial products and services, such as corporate banking, investment banking, treasury management, commercial real estate lending and servicing, equity, and fixed income solutions, as well as sales, trading, and research capabilities services to corporate, commercial real estate, government, and institutional clients. The Wealth and Investment Management segment provides personalized wealth management, brokerage, financial planning, lending, private banking, and trust and fiduciary products and services to affluent, high-net worth, and ultra-high-net worth clients. It also operates through financial advisors in brokerage and wealth offices, consumer bank branches, independent offices, and digitally through WellsTrade and Intuitive Investor. The company was founded in 1852 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"Goldman Sachs Group, Inc. (The)","Symbol":"GS","Current Price":"632.73","Latest MA":"522.39","Price Target":635.5238,"Difference from MA":"21.12%","Difference from Open":"-0.11%","Change from Yesterday":"-0.32%","Change from Last Report":"0.00","Latest Volume":"2,318,663","Market Cap":"198,620,282,880","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":12.388737,"PB Ratio":1.9313453,"ROE":0.1017,"DTE":609.793,"Industry":"Capital Markets","Sector":"Financial Services","Beta":1.342,"Trailing PEG":3.8615,"Trailing PE":15.599851,"Trailing PS":4.021712,"Quick Ratio":1.458,"Day High":635.6,"Day Low":629.7073,"VS Average Volume":1.0355667727,"Company Summary":"The Goldman Sachs Group, Inc., a financial institution, provides a range of financial services for corporations, financial institutions, governments, and individuals worldwide. It operates through Global Banking & Markets, Asset & Wealth Management, and Platform Solutions segments. The Global Banking & Markets segment provides financial advisory services, including strategic advisory assignments related to mergers and acquisitions, divestitures, corporate defense activities, restructurings, and spin-offs; and relationship lending, and acquisition financing, as well as secured lending, through structured credit and asset-backed lending and involved in financing under securities to resale agreements. This segment also offers client execution activities for cash and derivative instruments; credit and interest rate products; and provision of mortgages, currencies, commodities, and equities related products, as well as underwriting services. The Asset & Wealth Management segment manages assets across various classes, including equity, fixed income, hedge funds, credit funds, private equity, real estate, currencies, and commodities; and provides customized investment advisory solutions, wealth advisory services, personalized financial planning, and private banking services, as well as invests in corporate equity, credit, real estate, and infrastructure assets. The Platform Solutions segment offers credit cards and point-of-sale financing for purchase of goods or services. This segment also provides cash management services, such as deposit-taking and payment solutions for corporate and institutional clients. The Goldman Sachs Group, Inc. was founded in 1869 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"KB Home","Symbol":"KBH","Current Price":"67.85","Latest MA":"77.17","Price Target":76.625,"Difference from MA":"-12.08%","Difference from Open":"2.23%","Change from Yesterday":"1.22%","Change from Last Report":"0.00","Latest Volume":"1,011,526","Market Cap":"4,898,769,920","Earning Date":"2025-01-13","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":7.554703,"PB Ratio":1.2479538,"ROE":0.15727,"DTE":42.959,"Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":1.815,"Trailing PEG":null,"Trailing PE":8.029586,"Trailing PS":0.74176866,"Quick Ratio":0.788,"Day High":67.92,"Day Low":66.37,"VS Average Volume":0.8537467674,"Company Summary":"KB Home operates as a homebuilding company in the United States. It operates through four segments: West Coast, Southwest, Central, and Southeast. It builds and sells various homes, including attached and detached single-family residential homes, townhomes, and condominiums primarily for first-time, first move-up, second move-up, and active adult homebuyers. The company also provides financial services, such as insurance products and title services, as well as mortgage banking services, including residential consumer mortgage loans to homebuyers. It has operations in Arizona, California, Colorado, Florida, Idaho, Nevada, North Carolina, Texas, and Washington. The company was formerly known as Kaufman and Broad Home Corporation and changed its name to KB Home in January 2001. KB Home was founded in 1957 and is based in Los Angeles, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"Constellation Brands, Inc.","Symbol":"STZ","Current Price":"178.96","Latest MA":"238.97","Price Target":246.37917,"Difference from MA":"-25.11%","Difference from Open":"-2.45%","Change from Yesterday":"-2.25%","Change from Last Report":"0.00","Latest Volume":"1,843,390","Market Cap":"32,348,094,464","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":12.258408,"PB Ratio":3.3593004,"ROE":0.07111,"DTE":149.155,"Industry":"Beverages - Brewers","Sector":"Consumer Defensive","Beta":0.893,"Trailing PEG":0.9638,"Trailing PE":47.595745,"Trailing PS":3.1742449,"Quick Ratio":0.321,"Day High":183.45,"Day Low":178.37,"VS Average Volume":1.0162796377,"Company Summary":"Constellation Brands, Inc., together with its subsidiaries, produces, imports, markets, and sells beer, wine, and spirits in the United States, Canada, Mexico, New Zealand, and Italy. The company provides beer primarily under the Corona Extra, Corona Familiar, Corona Hard Seltzer, Corona Light, Corona Non-Alcoholic, Corona Premier, Corona Refresca, Modelo Especial, Modelo Chelada, Modelo Negra, Modelo Oro, Victoria, Vicky Chamoy, and Pacifico brands. It also offers wine under the Cook's California Champagne, Kim Crawford, Meiomi, Mount Veeder, Ruffino, SIMI, My Favorite Neighbor, Robert Mondavi Winery, Schrader, and The Prisoner Wine Company brands; and spirits under the Casa Noble, Copper & Kings, High West, Mi CAMPO, Nelson's Green Brier, and SVEDKA brands. The company provides its products to wholesale distributors, retailers, on-premise locations, and state alcohol beverage control agencies. Constellation Brands, Inc. was founded in 1945 and is headquartered in Victor, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"JP Morgan Chase & Co.","Symbol":"JPM","Current Price":"262.84","Latest MA":"220.91","Price Target":266.29144,"Difference from MA":"18.98%","Difference from Open":"-0.02%","Change from Yesterday":"-0.07%","Change from Last Report":"0.00","Latest Volume":"9,016,905","Market Cap":"735,321,194,496","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.537191,"PB Ratio":2.2825878,"ROE":0.16216,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.091,"Trailing PEG":4.7616,"Trailing PE":13.315096,"Trailing PS":4.5348763,"Quick Ratio":"N\/A","Day High":263.38,"Day Low":260.38,"VS Average Volume":0.9597026029,"Company Summary":"JPMorgan Chase & Co. operates as a financial services company worldwide. It operates through three segments: Consumer & Community Banking, Commercial & Investment Bank, and Asset & Wealth Management. It offers deposit, investment and lending products, cash management, and payments and services; mortgage origination and servicing activities; residential mortgages and home equity loans; and credit cards, auto loans, leases, and travel services to consumers and small businesses through bank branches, ATMs, and digital and telephone banking. The company also provides investment banking products and services, including corporate strategy and structure advisory, and equity and debt market capital-raising services, as well as loan origination and syndication; payments; and cash and derivative instruments, risk management solutions, prime brokerage, and research, as well as offers securities services, including custody, fund accounting and administration, and securities lending products for asset managers, insurance companies, and public and private investment funds. In addition, it provides financial solutions, including lending, payments, investment banking, and asset management to small and midsized companies, local governments, nonprofit clients, and large corporations, as well as investors, developers, and owners of multifamily, office, retail, industrial, and affordable housing properties. Further, the company offers multi-asset investment management solutions in equities, fixed income, alternatives, and money market funds to institutional clients and retail investors; and retirement products and services, brokerage, custody, estate planning, lending, deposits, and investment management products to high net worth clients. JPMorgan Chase & Co. was founded in 1799 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"Walgreens Boots Alliance, Inc.","Symbol":"WBA","Current Price":"11.62","Latest MA":"9.91","Price Target":12.414,"Difference from MA":"17.27%","Difference from Open":"3.33%","Change from Yesterday":"2.20%","Change from Last Report":"0.00","Latest Volume":"19,947,146","Market Cap":"10,041,457,664","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":7.246512,"PB Ratio":0.9612044,"ROE":-0.75969005,"DTE":277.898,"Industry":"Pharmaceutical Retailers","Sector":"Healthcare","Beta":0.669,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.06800483,"Quick Ratio":0.332,"Day High":11.64,"Day Low":11.13,"VS Average Volume":0.8291974984,"Company Summary":"Walgreens Boots Alliance, Inc. operates as a healthcare, pharmacy, and retail company in the United States, Germany, the United Kingdom, and internationally. It operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The U.S. Retail Pharmacy segment engages in operation of the retail drugstores, health and wellness services, specialty, and home delivery pharmacy services, which offers health and wellness, beauty, personal care and consumables, and general merchandise. The International segment offers sale of prescription drugs and health and wellness, beauty, personal care, and other consumer products outside the United States; and operates pharmacy-led health and beauty retail businesses under the Boots brand stores in the United Kingdom, the Republic of Ireland, and Thailand, as well as the Benavides brand in Mexico and the Ahumada brand in Chile. The U.S. Healthcare segment provides VillageMD, a national provider of value-based care with primary, multi-specialty, and urgent care providers serving patients in traditional clinic settings, in patients' homes and online appointments; Shields, a specialty pharmacy integrator and accelerator for hospitals; and CareCentrix, a participant in the post-acute and home care management sectors. Walgreens Boots Alliance, Inc. was founded in 1909 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"Delta Air Lines, Inc.","Symbol":"DAL","Current Price":"67.78","Latest MA":"52.17","Price Target":79.92864,"Difference from MA":"29.92%","Difference from Open":"-2.85%","Change from Yesterday":"-0.82%","Change from Last Report":"0.00","Latest Volume":"9,454,045","Market Cap":"43,737,145,344","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.029284,"PB Ratio":3.1844022,"ROE":0.4067,"DTE":186.78,"Industry":"Airlines","Sector":"Industrials","Beta":1.341,"Trailing PEG":null,"Trailing PE":12.716698,"Trailing PS":0.7252416,"Quick Ratio":0.268,"Day High":69.98,"Day Low":67.2,"VS Average Volume":1.1586945616,"Company Summary":"Delta Air Lines, Inc. provides scheduled air transportation for passengers and cargo in the United States and internationally. The company operates through two segments, Airline and Refinery. Its domestic network centered on core hubs in Atlanta, Minneapolis-St. Paul, Detroit, and Salt Lake City, as well as coastal hub positions in Boston, Los Angeles, New York-LaGuardia, New York-JFK, and Seattle; and international network centered on hubs and market presence in Amsterdam, Bogota, Lima, Mexico City, London-Heathrow, Paris-Charles de Gaulle, Sao Paulo, Seoul-Incheon, and Tokyo. The company sells its tickets through various distribution channels, including delta.com and the Fly Delta app; acts as a reservations specialists; and operates online travel and traditional brick and mortar agencies. It also provides aircraft maintenance and engineering support, repair, and overhaul services; and vacation packages to third-party consumers. The company operates through a fleet of approximately 1,273 aircrafts. Delta Air Lines, Inc. was founded in 1924 and is based in Atlanta, Georgia.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"Jefferies Financial Group Inc.","Symbol":"JEF","Current Price":"76.87","Latest MA":"64.04","Price Target":87.5,"Difference from MA":"20.04%","Difference from Open":"-1.39%","Change from Yesterday":"-1.28%","Change from Last Report":"0.00","Latest Volume":"1,112,192","Market Cap":"15,797,093,376","Earning Date":"2025-01-08","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":13.540746,"PB Ratio":1.5724338,"ROE":0.056739997,"DTE":295.803,"Industry":"Capital Markets","Sector":"Financial Services","Beta":1.292,"Trailing PEG":null,"Trailing PE":25.969595,"Trailing PS":2.5272899,"Quick Ratio":1.511,"Day High":78.02,"Day Low":76.45,"VS Average Volume":0.6954890439,"Company Summary":"Jefferies Financial Group Inc. operates as an investment banking and capital markets firm in the Americas, Europe, the Middle East, and the Asia-Pacific. The company operates in two segments, Investment Banking and Capital Markets, and Asset Management. It provides investment banking, advisory services with respect to mergers or acquisitions, debt financing, restructurings or recapitalizations, and private capital advisory transactions; underwriting and placement services related to corporate debt, municipal bonds, mortgage-backed and asset-backed securities, equity and equity-linked securities, and loan syndication services; and corporate lending services. The company also offers financing, securities lending, and other prime brokerage services; equities research, sales, and trading services; wealth management services; and online foreign exchange trading services. In addition, it provides investment grade distressed debt securities, U.S. and European government and agency securities, municipal bonds, leveraged loans, emerging markets debt, and interest rate and credit index derivative products; and manages and offers services to a diverse group of alternative asset management platforms across a spectrum of investment strategies and asset classes. The company was formerly known as Leucadia National Corporation and changed its name to Jefferies Financial Group Inc. in May 2018. Jefferies Financial Group Inc. was founded in 1962 and is headquartered in New York, New York.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"The Simply Good Foods Company","Symbol":"SMPL","Current Price":"37.16","Latest MA":"35.37","Price Target":40.9,"Difference from MA":"5.07%","Difference from Open":"3.02%","Change from Yesterday":"3.11%","Change from Last Report":"0.00","Latest Volume":"1,116,966","Market Cap":"3,754,349,056","Earning Date":"2025-01-08","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":17.234661,"PB Ratio":2.1543276,"ROE":0.08447,"DTE":25.315,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.644,"Trailing PEG":null,"Trailing PE":26.35461,"Trailing PS":2.820018,"Quick Ratio":2.608,"Day High":37.21,"Day Low":36.04,"VS Average Volume":1.120781139,"Company Summary":"The Simply Good Foods Company, a consumer-packaged food and beverage company, engages in the development, marketing, and sale of snacks and meal replacements, and other products in North America and internationally. The company offers protein bars, ready-to-drink shakes, sweet and salty snacks, cookies, muffins, protein chips and crackers, protein powders, and recipes under the Quest, Atkins, and OWYN brand names. It also provides confectionery products, such as full-size and mini peanut butter cups, brownies, caramel candy bites, chocolatey coated peanut candies, and caramel candy bars. In addition, the company licenses certain products that contain its brands and logos; and distributes its products to various retail channels, such as mass merchandise, grocery and drug stores, club and convenience stores, gas stations, and other channels. It also sells its products through e-commerce channels, including questnutrition.com, atkins.com, liveowyn.com, amazon.com and others. The company was incorporated in 2017 and is headquartered in Denver, Colorado.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"Commercial Metals Company","Symbol":"CMC","Current Price":"50.27","Latest MA":"54.31","Price Target":59.76333,"Difference from MA":"-7.45%","Difference from Open":"-2.73%","Change from Yesterday":"-2.73%","Change from Last Report":"0.00","Latest Volume":"1,182,128","Market Cap":"5,712,783,360","Earning Date":"2025-01-06","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":11.560149,"PB Ratio":1.3340234,"ROE":0.1153,"DTE":31.777,"Industry":"Steel","Sector":"Basic Materials","Beta":1.135,"Trailing PEG":null,"Trailing PE":45.28829,"Trailing PS":0.72076756,"Quick Ratio":2.416,"Day High":51.665,"Day Low":50.12,"VS Average Volume":1.186351411,"Company Summary":"Commercial Metals Company manufactures, recycles, and fabricates steel and metal products, and related materials and services in the United States, Poland, China, and internationally. It operates through three segments: North America Steel Group; Europe Steel Group; and Emerging Businesses Group. The company processes and sells ferrous and nonferrous scrap metals to steel mills and foundries, aluminum sheet and ingot manufacturers, brass and bronze ingot makers, copper refineries and mills, secondary lead smelters, specialty steel mills, high temperature alloy manufacturers, and other consumers. It also manufactures and sells finished long steel products, including reinforcing bar, merchant bar, light structural, and other special sections, as well as semi-finished billets for rerolling and forging applications. In addition, the company provides fabricated rebar used to reinforce concrete primarily in the construction of commercial and non-commercial buildings, hospitals, convention centers, industrial plants, power plants, highways, bridges, arenas, stadiums, and dams; sells and rents construction-related products and equipment to concrete installers and other businesses; and manufactures and sells strength bars for the truck trailer industry, special bar steels for the energy market, and armor plates for military vehicles. Further, it manufactures rebars, merchant bars, and wire rods; and sells fabricated rebars, wire meshes, welded steel mesh, wire rod, cold rolled rebar, cold rolled wire rod, assembled rebar cages and other fabricated rebar by-products to fabricators, manufacturers, distributors, and construction companies. The company was founded in 1915 and is headquartered in Irving, Texas.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"ConAgra Brands, Inc.","Symbol":"CAG","Current Price":"25.31","Latest MA":"28.90","Price Target":29.47944,"Difference from MA":"-12.42%","Difference from Open":"-1.48%","Change from Yesterday":"-1.52%","Change from Last Report":"0.00","Latest Volume":"3,847,864","Market Cap":"12,080,968,704","Earning Date":"2025-01-02","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":9.821422,"PB Ratio":1.4339131,"ROE":0.05605,"DTE":100.881,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.332,"Trailing PEG":5.228,"Trailing PE":24.572815,"Trailing PS":1.0116539,"Quick Ratio":0.291,"Day High":25.635,"Day Low":25.135,"VS Average Volume":0.7534230267,"Company Summary":"Conagra Brands, Inc., together with its subsidiaries, operates as a consumer packaged goods food company primarily in the United States. The company operates through four segments: Grocery & Snacks, Refrigerated & Frozen, International, and Foodservice. The Grocery & Snacks segment primarily offers shelf stable food products through various retail channels. The Refrigerated & Frozen segment provides temperature-controlled food products through various retail channels. The International segment offers food products in various temperature states through retail and foodservice channels outside of the United States. The Foodservice segment offers branded and customized food products, including meals, entrees, sauces, and various custom-manufactured culinary products packaged for restaurants and other foodservice establishments. The company sells its products under the Birds Eye, Marie Callender's, Duncan Hines, Healthy Choice, Slim Jim, Reddi-wip, Angie's, BOOMCHICKAPOP brands. The company was incorporated in 1919 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"Lamb Weston Holdings, Inc.","Symbol":"LW","Current Price":"60.87","Latest MA":"70.11","Price Target":68.86143,"Difference from MA":"-13.18%","Difference from Open":"-2.92%","Change from Yesterday":"-2.92%","Change from Last Report":"0.00","Latest Volume":"1,936,966","Market Cap":"8,682,557,440","Earning Date":"2025-01-02","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.08611,"PB Ratio":4.891514,"ROE":0.37015,"DTE":221.158,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.715,"Trailing PEG":3.7529,"Trailing PE":23.964567,"Trailing PS":1.3447986,"Quick Ratio":0.486,"Day High":62.68,"Day Low":60.78,"VS Average Volume":0.7839780725,"Company Summary":"Lamb Weston Holdings, Inc. engages in the production, distribution, and marketing of frozen potato products in the United States, Canada, Mexico, and internationally. It offers frozen potatoes, commercial ingredients, and appetizers under the Lamb Weston brand, as well as under various customer labels. The company also provides its products under its owned or licensed brands, such as Grown in Idaho and Alexia, and other licensed brands, as well as under retailers' own brands. It sells its products through a network of internal sales personnel and independent brokers, agents, and distributors to quick service and full-service restaurants and chains, wholesale, grocery, mass merchants, club retailers, and specialty retailers, as well as foodservice distributors and institutions, including businesses, educational institutions, independent restaurants, regional chain restaurants, and convenience stores. The company was incorporated in 1950 and is headquartered in Eagle, Idaho.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"SiriusXM Holdings Inc.","Symbol":"SIRI","Current Price":"22.10","Latest MA":"27.48","Price Target":25.53846,"Difference from MA":"-19.59%","Difference from Open":"-0.50%","Change from Yesterday":"-0.41%","Change from Last Report":"0.00","Latest Volume":"4,197,426","Market Cap":"7,496,364,032","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":6.8277526,"PB Ratio":0.689935,"ROE":-0.46799,"DTE":98.775,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.05,"Trailing PEG":0.1874,"Trailing PE":"N\/A","Trailing PS":0.8519564,"Quick Ratio":0.26,"Day High":22.39,"Day Low":21.82,"VS Average Volume":0.7434861231,"Company Summary":"Sirius XM Holdings Inc. operates as an audio entertainment company in North America. It operates in two segments, Sirius XM, and Pandora and Off-platform. The company's Sirius XM segment provides music, sports, entertainment, comedy, talk, news, traffic and weather channels, and other content, as well as podcast and infotainment services on subscription fee basis; and live, curated, and exclusive and on demand programming services through satellite radio systems and streamed through applications for mobile and home devices, and other consumer electronic equipment. This segment also distributes satellite radios through automakers and retailers, as well as its website; podcasts, including true crime, news, politics, music, comedy, sports, and entertainment; and offers location-based services through two-way wireless connectivity, including safety, security, convenience, maintenance and data, remote vehicles diagnostic, and stolen or parked vehicle locator services. In addition, this segment provides music channels on the DISH Network satellite television service as a programming package; Travel Link, a suite of data services that include graphical weather, fuel prices, sports schedule and scores, and movie listings; graphic information related to road closings, traffic flow, and incident data for consumers with in-vehicle navigation systems; real-time weather services in vehicles, boats, and planes; and music programming and commercial-free music services for office, restaurants, and other business. Its Pandora and Off-platform segment operates music, comedy, and podcast streaming platform, which offers personalized experience for listener through computers, tablets, mobile devices, vehicle speakers, and connected devices; and provides advertising services. The company was incorporated in 2013 and is headquartered in New York.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"Qorvo, Inc.","Symbol":"QRVO","Current Price":"87.09","Latest MA":"95.47","Price Target":92.86955,"Difference from MA":"-8.78%","Difference from Open":"-0.67%","Change from Yesterday":"-0.56%","Change from Last Report":"0.00","Latest Volume":"2,183,725","Market Cap":"8,232,330,240","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":14.292912,"PB Ratio":2.417555,"ROE":-0.03908,"DTE":57.517,"Industry":"Semiconductors","Sector":"Technology","Beta":1.487,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":2.0851748,"Quick Ratio":1.267,"Day High":89.0699,"Day Low":86.72,"VS Average Volume":0.7042038914,"Company Summary":"Qorvo, Inc. engages in development and commercialization of technologies and products for wireless, wired, and power markets worldwide. It operates through three segments: High Performance Analog (HPA), Connectivity and Sensors Group (CSG), and Advanced Cellular Group (ACG). The HPA segment supplies radio frequency and power management solutions for defense and aerospace, and 5G and 6G infrastructure markets. The CSG segment supplies connectivity and sensor solutions featuring various technologies, such as UWB, Matter, Bluetooth Low Energy, Zigbee, Thread, Wi-Fi, cellular IoT, and MEMS-based sensors. It serves smart home, industrial automation, automotive, smartphones, wearables, gaming, and industrial and enterprise access points markets. The ACG segment supplies cellular RF solutions for smartphones, wearables, laptops, tablets, and various other devices. It also offers foundry services for defense primes and other defense and aerospace customers. The company sells its products directly to original equipment manufacturers and original design manufacturers, as well as through a network of sales representative firms and distributors. Qorvo, Inc. was founded in 1957 and is headquartered in Greensboro, North Carolina.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"Nextracker Inc.","Symbol":"NXT","Current Price":"41.20","Latest MA":"40.20","Price Target":51.90379,"Difference from MA":"2.50%","Difference from Open":"-2.94%","Change from Yesterday":"-3.01%","Change from Last Report":"0.00","Latest Volume":"3,044,893","Market Cap":"6,075,228,160","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":12.173826,"PB Ratio":4.6738515,"ROE":0.60612,"DTE":11.396,"Industry":"Solar","Sector":"Technology","Beta":"N\/A","Trailing PEG":2.5078,"Trailing PE":10.3,"Trailing PS":2.1678407,"Quick Ratio":1.794,"Day High":42.84,"Day Low":40.89,"VS Average Volume":1.1479891011,"Company Summary":"Nextracker Inc., an energy solutions company, provides solar tracker and software solutions for utility-scale and distributed generation solar projects in the United States and internationally. The company offers tracking solutions, which includes NX Horizon, a solar tracking solution; and NX Horizon-XTR, a terrain-following tracker designed to expand the addressable market for trackers on sites with sloped, uneven, and challenging terrain. It also provides TrueCapture, a self-adjusting tracker control system, which boosts solar power plant production by optimizing the position of individual tracker row in response to site features, such as varying topography and changing weather conditions; and NX Navigator, that assists solar power plant owners and operators in monitoring, controlling, and protecting their solar projects. The company was founded in 2013 and is headquartered in Fremont, California. As of March 31, 2024 Nextracker Inc. was formerly a subsidiary of Flex Ltd.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"Lockheed Martin Corporation","Symbol":"LMT","Current Price":"499.34","Latest MA":"527.77","Price Target":559.61365,"Difference from MA":"-5.39%","Difference from Open":"-0.77%","Change from Yesterday":"-1.37%","Change from Last Report":"0.00","Latest Volume":"1,037,053","Market Cap":"118,361,063,424","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":17.878363,"PB Ratio":16.36751,"ROE":0.81037,"DTE":268.347,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":0.481,"Trailing PEG":4.115,"Trailing PE":18.085476,"Trailing PS":1.6601593,"Quick Ratio":1.096,"Day High":505.125,"Day Low":495.18,"VS Average Volume":0.8341045256,"Company Summary":"Lockheed Martin Corporation, a security and aerospace company, engages in the research, design, development, manufacture, integration, and sustainment of technology systems, products, and services worldwide. The company operates through Aeronautics, Missiles and Fire Control, Rotary and Mission Systems, and Space segments. The Aeronautics segment offers combat and air mobility aircraft, unmanned air vehicles, and related technologies. The Missiles and Fire Control segment provides air and missile defense systems; tactical missiles and air-to-ground precision strike weapon systems; logistics; fire control systems; mission operations support, readiness, engineering support, and integration services; manned and unmanned ground vehicles; and energy management solutions. The Rotary and Mission Systems segment offers military and commercial helicopters, surface ships, sea and land-based missile defense systems, radar systems, sea and air-based mission and combat systems, command and control mission solutions, cyber solutions, and simulation and training solutions. The Space segment offers satellites; space transportation systems; strategic, advanced strike, and defensive systems; and classified systems and services in support of national security systems. This segment also provides network-enabled situational awareness and integrates space and ground global systems to help its customers gather, analyze, and securely distribute critical intelligence data. It serves primarily serves the U.S. government, as well as foreign military sales contracted through the U.S. government. The company was formerly known as The Lockheed Corporation and changed its name to Lockheed Martin Corporation in March 1995. Lockheed Martin Corporation was founded in 1912 and is based in Bethesda, Maryland.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"General Motors Company","Symbol":"GM","Current Price":"52.76","Latest MA":"49.28","Price Target":59.93769,"Difference from MA":"7.05%","Difference from Open":"-1.07%","Change from Yesterday":"-2.10%","Change from Last Report":"0.00","Latest Volume":"6,301,146","Market Cap":"58,014,896,128","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":4.9008813,"PB Ratio":0.8181621,"ROE":0.14167,"DTE":174.581,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":1.414,"Trailing PEG":8.0784,"Trailing PE":5.6307364,"Trailing PS":0.31750882,"Quick Ratio":0.948,"Day High":53.3999,"Day Low":52.43,"VS Average Volume":0.576433588,"Company Summary":"General Motors Company designs, builds, and sells trucks, crossovers, cars, and automobile parts; and provide software-enabled services and subscriptions worldwide. The company operates through GM North America, GM International, Cruise, and GM Financial segments. It markets its vehicles primarily under the Buick, Cadillac, Chevrolet, GMC, Baojun, and Wuling brand names. In addition, the company sells trucks, crossovers, cars, and automobile parts through retail dealers, and distributors and dealers, as well as to fleet customers, including daily rental car companies, commercial fleet customers, leasing companies, and governments. Further, it offers range of after-sale services through dealer network, such as maintenance, light repairs, collision repairs, vehicle accessories, and extended service warranties. Additionally, the company provides automotive financing; and software-enabled services and subscriptions. General Motors Company was founded in 1908 and is headquartered in Detroit, Michigan.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"Chubb Limited","Symbol":"CB","Current Price":"268.32","Latest MA":"275.97","Price Target":297.77237,"Difference from MA":"-2.77%","Difference from Open":"-0.80%","Change from Yesterday":"-0.20%","Change from Last Report":"0.00","Latest Volume":"1,495,108","Market Cap":"108,159,254,528","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":11.358798,"PB Ratio":1.6445712,"ROE":0.16125,"DTE":31.706,"Industry":"Insurance - Property & Casualty","Sector":"Financial Services","Beta":0.681,"Trailing PEG":3.3461,"Trailing PE":11.00123,"Trailing PS":1.9774257,"Quick Ratio":0.183,"Day High":271.97,"Day Low":267.875,"VS Average Volume":0.905911936,"Company Summary":"Chubb Limited provides insurance and reinsurance products worldwide. The company's North America Commercial P&C Insurance segment offers commercial property, casualty, workers' compensation, package policies, risk management, financial lines, marine, construction, environmental, medical risk, cyber risk, surety, and casualty; and group accident and health insurance to large, middle market, and small commercial businesses. Its North America Personal P&C Insurance segment provides affluent and high net worth individuals and families with homeowners, automobile and collector cars, valuable articles, personal and excess liability, travel insurance, and recreational marine insurance and services. The company's North America Agricultural Insurance segment offers multiple peril crop and crop-hail insurance; and coverage for farm, ranch, and specialty property and casualty, and commercial agriculture products. Its Overseas General Insurance segment provides coverage for traditional commercial property and casualty; specialty categories, such as financial lines, marine, energy, aviation, political risk, and construction; and group accident and health, and traditional and specialty personal lines for corporations, middle markets, and small customers through retail brokers, agents, and other channels. The company's Global Reinsurance segment offers traditional and specialty reinsurance under the Chubb Tempest Re brand to property and casualty companies. Its Life Insurance segment provides protection and savings products comprising whole life, endowment plans, individual and life, group term life, health protection, personal accident, credit life, universal life, group employee benefits, and unit linked contracts. It markets its products primarily through insurance and reinsurance brokers. The company was formerly known as ACE Limited and changed its name to Chubb Limited in January 2016. Chubb Limited was incorporated in 1985 and is headquartered in Zurich, Switzerland.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"Royal Caribbean Cruises Ltd.","Symbol":"RCL","Current Price":"236.16","Latest MA":"192.46","Price Target":253.84091,"Difference from MA":"22.71%","Difference from Open":"-2.67%","Change from Yesterday":"-2.93%","Change from Last Report":"0.00","Latest Volume":"1,778,166","Market Cap":"63,497,523,200","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":16.324669,"PB Ratio":9.013053,"ROE":0.44263,"DTE":298.394,"Industry":"Travel Services","Sector":"Consumer Cyclical","Beta":2.6,"Trailing PEG":0.6221,"Trailing PE":23.63964,"Trailing PS":3.955,"Quick Ratio":0.087,"Day High":242.9,"Day Low":235.74,"VS Average Volume":0.9092766709,"Company Summary":"Royal Caribbean Cruises Ltd. operates as a cruise company worldwide. The company operates cruises under the Royal Caribbean International, Celebrity Cruises, and Silversea Cruises brands, which comprise a range of itineraries. As of February 21, 2024, it operated 65 ships. Royal Caribbean Cruises Ltd. was founded in 1968 and is headquartered in Miami, Florida.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"Invesco Ltd","Symbol":"IVZ","Current Price":"17.42","Latest MA":"16.80","Price Target":18.5,"Difference from MA":"3.71%","Difference from Open":"0.29%","Change from Yesterday":"-0.46%","Change from Last Report":"0.00","Latest Volume":"2,553,427","Market Cap":"7,829,244,928","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":9.381783,"PB Ratio":0.7287178,"ROE":-0.00944,"DTE":5.597,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.424,"Trailing PEG":1.4477,"Trailing PE":"N\/A","Trailing PS":1.3298306,"Quick Ratio":0.75,"Day High":17.515,"Day Low":17.17,"VS Average Volume":0.7867948417,"Company Summary":"Invesco Ltd. is a publicly owned investment manager. The firm provides its services to retail clients, institutional clients, high-net worth clients, public entities, corporations, unions, non-profit organizations, endowments, foundations, pension funds, financial institutions, and sovereign wealth funds. It manages separate client-focused equity and fixed income portfolios. The firm also launches equity, fixed income, commodity, multi-asset, and balanced mutual funds for its clients. It launches equity, fixed income, multi-asset, and balanced exchange-traded funds. The firm also launches and manages private funds. It invests in the public equity and fixed income markets across the globe. The firm also invests in alternative markets, such as commodities and currencies. For the equity portion of its portfolio, it invests in growth and value stocks of large-cap, mid-cap, and small-cap companies. For the fixed income portion of its portfolio, the firm invests in convertibles, government bonds, municipal bonds, treasury securities, and cash. It also invests in short term and intermediate term bonds, investment grade and high yield bonds, taxable and tax-free bonds, senior secured loans, and structured securities such as asset-backed securities, mortgage-backed securities, and commercial mortgage-backed securities. The firm employs absolute return, global macro, and long\/short strategies. It employs quantitative analysis to make its investments. The firm was formerly known as Invesco Plc, AMVESCAP plc, Amvesco plc, Invesco PLC, Invesco MIM, and H. Lotery & Co. Ltd. Invesco Ltd. was founded in 1935 and is based in Atlanta, Georgia with an additional office in Hamilton, Bermuda.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"PACCAR Inc.","Symbol":"PCAR","Current Price":"109.84","Latest MA":"101.38","Price Target":115.54111,"Difference from MA":"8.34%","Difference from Open":"-0.34%","Change from Yesterday":"-0.25%","Change from Last Report":"0.00","Latest Volume":"1,815,289","Market Cap":"57,589,219,328","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":13.832273,"PB Ratio":3.0853932,"ROE":0.27142,"DTE":83.654,"Industry":"Farm & Heavy Construction Machinery","Sector":"Industrials","Beta":0.89,"Trailing PEG":null,"Trailing PE":12.286354,"Trailing PS":1.6532996,"Quick Ratio":4.733,"Day High":110.62,"Day Low":109.5,"VS Average Volume":0.8203757943,"Company Summary":"PACCAR Inc designs, manufactures, and distributes light, medium, and heavy-duty commercial trucks in the United States, Canada, Europe, Mexico, South America, Australia, and internationally. It operates through three segments: Truck, Parts, and Financial Services. The Truck segment designs, manufactures, and distributes trucks for the over-the-road and off-highway hauling of commercial and consumer goods. It sells its trucks through a network of independent dealers under the Kenworth, Peterbilt, and DAF nameplates. The Parts segment distributes aftermarket parts for trucks and related commercial vehicles. The Financial Services segment conducts full-service leasing operations under the PacLease trade name, as well as provides finance and leasing products and services to customers and dealers. This segment also offers equipment financing and administrative support services for its franchisees; retail loan and leasing services for small, medium, and large commercial trucking companies, as well as independent owners\/operators and other businesses; and truck inventory financing services to independent dealers. In addition, this segment offers loans and leases directly to customers for the acquisition of trucks and related equipment. The company also manufactures and markets industrial winches under the Braden, Carco, and Gearmatic nameplates. PACCAR Inc was founded in 1905 and is headquartered in Bellevue, Washington.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"Archer-Daniels-Midland Company","Symbol":"ADM","Current Price":"50.52","Latest MA":"56.57","Price Target":54.81818,"Difference from MA":"-10.69%","Difference from Open":"-0.67%","Change from Yesterday":"-1.37%","Change from Last Report":"0.00","Latest Volume":"2,087,920","Market Cap":"24,175,538,176","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":9.916733,"PB Ratio":1.0739567,"ROE":0.1075,"DTE":52.874,"Industry":"Farm Products","Sector":"Consumer Defensive","Beta":0.722,"Trailing PEG":null,"Trailing PE":14.191011,"Trailing PS":0.2723452,"Quick Ratio":0.375,"Day High":50.915,"Day Low":50.31,"VS Average Volume":0.667457758,"Company Summary":"Archer-Daniels-Midland Company engages in the procurement, transportation, storage, processing, and merchandising of agricultural commodities, ingredients, flavors, and solutions in the United States, Switzerland, the Cayman Islands, Brazil, Mexico, Canada, the United Kingdom, and internationally. It operates in three segments: Ag Services and Oilseeds, Carbohydrate Solutions, and Nutrition. The company originates, merchandises, stores, and transports agricultural raw materials, such as oilseeds and soft seeds. It also engages in the agricultural commodity and feed product import, export, and distribution; and various structured trade finance activities. In addition, the company offers soybean meal and oil; vegetable and salad oils and protein meals; ingredients for the food, feed, energy, and industrial customers; margarine, shortening, and other food products; and partially refined oils to produce biodiesel and glycols for use in chemicals, paints, and other industrial products. Further, it provides peanuts, peanut-derived ingredients, and cotton cellulose pulp; sweeteners, corn and wheat starches, syrup, glucose, wheat flour, and dextrose; alcohol, and other food and animal feed ingredients; ethyl alcohol and ethanol; corn gluten feed and meal; distillers' grains; corn germ; and citric acids. Additionally, the company provides proteins, natural flavors, flavor systems, natural colors, emulsifiers, soluble fiber, polyols, hydrocolloids, probiotics, prebiotics, postbiotics, enzymes, and botanical extracts; and other specialty food and feed ingredients; edible beans; formula feeds, and animal health and nutrition products; and contract and private label pet treats and food products. It also offers futures commission merchant; commodity brokerage services; cash margins and securities pledged to commodity exchange clearinghouse; and cash pledged as security under certain insurance arrangements. The company was founded in 1902 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"Synchrony Financial","Symbol":"SYF","Current Price":"70.49","Latest MA":"55.05","Price Target":75.80952,"Difference from MA":"28.04%","Difference from Open":"0.90%","Change from Yesterday":"1.47%","Change from Last Report":"0.00","Latest Volume":"2,341,742","Market Cap":"27,444,856,832","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":10.306701,"PB Ratio":1.8591095,"ROE":0.21279,"DTE":"N\/A","Industry":"Credit Services","Sector":"Financial Services","Beta":1.593,"Trailing PEG":1.8243,"Trailing PE":9.154546,"Trailing PS":3.0470588,"Quick Ratio":"N\/A","Day High":70.75,"Day Low":69.4,"VS Average Volume":0.6717180149,"Company Summary":"Synchrony Financial, together with its subsidiaries, operates as a consumer financial services company in the United States. It provides credit products, such as credit cards, commercial credit products, and consumer installment loans. The company also offers private label credit cards, dual co-brand and general purpose credit cards, short- and long-term installment loans, and consumer banking products; and deposit products, including certificates of deposit, individual retirement accounts, money market accounts, and savings accounts, and sweep and affinity deposits, as well as accepts deposits through third-party securities brokerage firms. In addition, it provides debt cancellation products to its credit card customers through online, mobile, and direct mail; and healthcare payments and financing solutions under the CareCredit and Walgreens brands; payments and financing solutions in the apparel, specialty retail, outdoor, music, and luxury industries, such as American Eagle, Dick's Sporting Goods, Guitar Center, Kawasaki, Pandora, Polaris, Suzuki, and Sweetwater. The company offers its credit products through programs established with a group of national and regional retailers, local merchants, manufacturers, buying groups, industry associations, and healthcare service providers; and deposit products through various channels, such as digital and print. It serves digital, health and wellness, retail, home, auto, telecommunications, jewelry, pets, and other industries. The company was founded in 1932 and is headquartered in Stamford, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"Starbucks Corporation","Symbol":"SBUX","Current Price":"97.73","Latest MA":"90.28","Price Target":103.86621,"Difference from MA":"8.25%","Difference from Open":"-0.28%","Change from Yesterday":"-0.26%","Change from Last Report":"0.00","Latest Volume":"7,537,647","Market Cap":"110,806,269,952","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":26.29653,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":0.962,"Trailing PEG":2.0445,"Trailing PE":29.52568,"Trailing PS":3.0629604,"Quick Ratio":0.524,"Day High":98.535,"Day Low":97.46,"VS Average Volume":0.9424119098,"Company Summary":"Starbucks Corporation, together with its subsidiaries, operates as a roaster, marketer, and retailer of coffee worldwide. The company operates through three segments: North America, International, and Channel Development. Its stores offer coffee, tea, and other beverages, roasted whole beans and ground coffees, single serve products, and ready-to-drink beverages; and various food products, such as pastries, breakfast sandwiches, and lunch items. The company also licenses its trademarks through licensed stores, and grocery and foodservice accounts. The company offers its products under the Starbucks Coffee, Teavana, Seattle's Best Coffee, Ethos, and Starbucks Reserve brands. Starbucks Corporation was founded in 1971 and is based in Seattle, Washington.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"Boeing Company (The)","Symbol":"BA","Current Price":"174.80","Latest MA":"165.63","Price Target":185.71333,"Difference from MA":"5.54%","Difference from Open":"-0.28%","Change from Yesterday":"-0.43%","Change from Last Report":"0.00","Latest Volume":"4,256,577","Market Cap":"130,781,167,616","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":250.18608,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.572,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":1.784361,"Quick Ratio":0.238,"Day High":176.2299,"Day Low":173.88,"VS Average Volume":0.3204622011,"Company Summary":"The Boeing Company, together with its subsidiaries, designs, develops, manufactures, sells, services, and supports commercial jetliners, military aircraft, satellites, missile defense, human space flight and launch systems, and services worldwide. The company operates through Commercial Airplanes; Defense, Space & Security; and Global Services segments. The Commercial Airplanes segment develops, produces, and markets commercial jet aircraft for passenger and cargo requirements, as well as provides fleet support services. The Defense, Space & Security segment engages in the research, development, production, and modification of manned and unmanned military aircraft and weapons systems; strategic defense and intelligence systems, which include strategic missile and defense systems, command, control, communications, computers, intelligence, surveillance and reconnaissance, cyber and information solutions, and intelligence systems; and satellite systems, such as government and commercial satellites, and space exploration. The Global Services segment offers products and services, including supply chain and logistics management, engineering, maintenance and modifications, upgrades and conversions, spare parts, pilot and maintenance training systems and services, technical and maintenance documents, and data analytics and digital services to commercial and defense customers. The Boeing Company was incorporated in 1916 and is based in Arlington, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"Stryker Corporation","Symbol":"SYK","Current Price":"390.49","Latest MA":"356.80","Price Target":408.49,"Difference from MA":"9.44%","Difference from Open":"-0.93%","Change from Yesterday":"-1.35%","Change from Last Report":"0.00","Latest Volume":"1,600,101","Market Cap":"148,861,026,304","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":28.999165,"PB Ratio":7.387948,"ROE":0.18868,"DTE":79.443,"Industry":"Medical Devices","Sector":"Healthcare","Beta":0.92,"Trailing PEG":2.7268,"Trailing PE":41.85316,"Trailing PS":6.7744164,"Quick Ratio":1.098,"Day High":395.0,"Day Low":388.9,"VS Average Volume":1.1963702921,"Company Summary":"Stryker Corporation operates as a medical technology company. The company operates through two segments, MedSurg and Neurotechnology, and Orthopaedics and Spine. The Orthopaedics and Spine segment provides implants for use in total joint replacements, such as hip, knee and shoulder, and trauma and extremities surgeries. This segment also offers spinal implant products comprising cervical and thoracolumbar systems that include fixation, minimally invasive and interbody systems used in spinal injury, complex spine and degenerative therapies. The MedSurg and Neurotechnology segment offers surgical equipment, and surgical navigation systems, endoscopic and communications systems, patient handling, emergency medical equipment and intensive care disposable products, reprocessed and remanufactured medical devices, clinical communication and workflow solutions, and other medical device products that are used in various medical specialties, as well as patient and caregiver safety technologies. This segment also provides neurosurgical, neurovascular and craniomaxillofacial implant products, which include products used for minimally invasive endovascular procedures; products for brain and open skull based surgical procedures; orthobiologic and biosurgery products, such as synthetic bone grafts and vertebral augmentation products; minimally invasive products for the treatment of acute ischemic and hemorrhagic stroke; and craniomaxillofacial implant products, including cranial, maxillofacial, and chest wall devices, as well as dural substitutes and sealants. The company sells its products to doctors, hospitals, and other healthcare facilities through company-owned subsidiaries and branches, as well as third-party dealers and distributors in approximately 75 countries. Stryker Corporation was founded in 1941 and is headquartered in Portage, Michigan.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"Sysco Corporation","Symbol":"SYY","Current Price":"73.42","Latest MA":"74.78","Price Target":84.82625,"Difference from MA":"-1.82%","Difference from Open":"0.27%","Change from Yesterday":"-0.10%","Change from Last Report":"0.00","Latest Volume":"3,035,903","Market Cap":"36,065,812,480","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":14.864213,"PB Ratio":16.337337,"ROE":0.88346,"DTE":599.732,"Industry":"Food Distribution","Sector":"Consumer Defensive","Beta":1.2,"Trailing PEG":1.3819,"Trailing PE":18.874035,"Trailing PS":0.4524742,"Quick Ratio":0.695,"Day High":73.91,"Day Low":73.05,"VS Average Volume":1.0476640245,"Company Summary":"Sysco Corporation, through its subsidiaries, engages in the marketing and distribution of various food and related products to the foodservice or food-away-from-home industry in the United States, Canada, the United Kingdom, France, and internationally. The company operates through U.S. Foodservice Operations, International Foodservice Operations, SYGMA, and Other segments. It distributes frozen food, such as meat, seafood, fully prepared entrées, fruits, vegetables, and desserts; canned and dry food products; fresh meat and seafood products; dairy products; beverages; imported specialties; and fresh produce products. The company also supplies various non-food items, including paper products comprising disposable napkins, plates, and cups; tableware consisting of glassware and silverware; cookware, such as pots, pans, and utensils; restaurant and kitchen equipment and supplies; and cleaning supplies. It serves restaurants, hospitals and nursing facilities, schools and colleges, hotels and motels, industrial caterers, and other foodservice venues. The company was incorporated in 1969 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"SoFi Technologies, Inc.","Symbol":"SOFI","Current Price":"17.59","Latest MA":"10.37","Price Target":12.6,"Difference from MA":"69.70%","Difference from Open":"-2.55%","Change from Yesterday":"-1.73%","Change from Last Report":"0.00","Latest Volume":"50,890,371","Market Cap":"19,087,788,032","Earning Date":"2025-01-27","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":71.79592,"PB Ratio":3.11548,"ROE":0.037249997,"DTE":54.394,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.613,"Trailing PEG":null,"Trailing PE":146.58334,"Trailing PS":7.5768914,"Quick Ratio":0.47,"Day High":18.05,"Day Low":17.27,"VS Average Volume":0.9853117784,"Company Summary":"SoFi Technologies, Inc. provides various financial services in the United States, Latin America, and Canada. It operates through three segments: Lending, Technology Platform, and Financial Services. The company offers lending and financial services and products that allows its members to borrow, save, spend, invest, and protect money. It offers personal loans, student loans, home loans, and related services. The company also operates Galileo, a technology platform that offers services to financial and non-financial institution; and Technisys, a cloud-native digital and core banking platform with financial services customers. In addition, it provides SoFi Money offers checking and savings accounts, debit cards, and cash management products; and SoFi Invest, a mobile-first investment platform that provides access to trading and advisory solutions, such as investing and robo-advisory. Further, the company offers SoFi Credit Card that provides cash backs on every purchase; Sofi Relay, a personal finance management product that allows to track all of their financial accounts comprising credit score and spending behaviors; SoFi Protect, which offers insurance product; SoFi Travel, an application that manages travel search and booking experience; SoFi At Work provides financial benefits to employees, including student loan payments made on their employees' behalf; Lantern Credit, a financial services marketplace platform for seeking alternative products and provide product comparisons; and other lending as a service that offers pre-qualified borrower referrals and sells loans to third-party partner. The company was founded in 2011 and is based in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"Kimberly-Clark Corporation","Symbol":"KMB","Current Price":"126.12","Latest MA":"136.61","Price Target":144.99052,"Difference from MA":"-7.68%","Difference from Open":"-1.99%","Change from Yesterday":"-0.32%","Change from Last Report":"0.00","Latest Volume":"1,535,739","Market Cap":"42,059,128,832","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":16.560179,"PB Ratio":32.732937,"ROE":2.30998,"DTE":517.798,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":0.412,"Trailing PEG":2.6452,"Trailing PE":16.336788,"Trailing PS":2.092494,"Quick Ratio":0.473,"Day High":128.18,"Day Low":125.98,"VS Average Volume":0.7373937536,"Company Summary":"Kimberly-Clark Corporation, together with its subsidiaries, manufactures and markets personal care and consumer tissue products in the United States. It operates through three segments: Personal Care, Consumer Tissue, and K-C Professional. The company's Personal Care segment offers disposable diapers, training and youth pants, swimpants, baby wipes, feminine and incontinence care products, reusable underwear, and other related products under the Huggies, Pull-Ups, Little Swimmers, GoodNites, DryNites, Sweety, Kotex, U by Kotex, Intimus, Thinx, Poise, Depend, Plenitud, Softex, and other brand names. Its Consumer Tissue segment provides facial and bathroom tissues, paper towels, napkins, and related products under the Kleenex, Scott, Cottonelle, Viva, Andrex, Scottex, Neve, and other brand names. The company's K-C Professional segment offers wipers, tissues, towels, apparel, personal protective equipment, soaps, and sanitizers under the Kleenex, Scott, WypAll, Kimtech, and KleenGuard brands. It also sells household use products directly to supermarkets, mass merchandisers, drugstores, warehouse clubs, variety and department stores, and other retail outlets, as well as through other distributors and e-commerce; and away-from-home use products directly to distributors, manufacturing, lodging, office building, food service, and public facilities, as well as through e-commerce. Kimberly-Clark Corporation was founded in 1872 and is headquartered in Dallas, Texas.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"RTX Corporation","Symbol":"RTX","Current Price":"124.38","Latest MA":"116.05","Price Target":136.59592,"Difference from MA":"7.18%","Difference from Open":"-1.03%","Change from Yesterday":"-1.09%","Change from Last Report":"0.00","Latest Volume":"3,490,137","Market Cap":"165,552,275,456","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":20.468513,"PB Ratio":2.7089186,"ROE":0.073460005,"DTE":69.597,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":0.54,"Trailing PEG":0.9296,"Trailing PE":35.84438,"Trailing PS":2.0944848,"Quick Ratio":0.602,"Day High":125.88,"Day Low":123.645,"VS Average Volume":0.7563298422,"Company Summary":"RTX Corporation, an aerospace and defense company, provides systems and services for the commercial, military, and government customers in the United States and internationally. It operates through three segments: Collins Aerospace, Pratt & Whitney, and Raytheon. The Collins Aerospace Systems segment offers aerospace and defense products, and aftermarket service solutions for civil and military aircraft manufacturers and commercial airlines, as well as regional, business, and general aviation, defense, and commercial space operations. This segment also designs, produces, and supports cabin interior, including oxygen systems, food and beverage preparation, storage and galley systems, and lavatory and wastewater management systems; battlespace, test and training range systems, crew escape systems, and simulation and training solutions; information management services; and aftermarket services that include spare parts, overhaul and repair, engineering and technical support, training and fleet management solutions, and asset and information management services. Its Pratt & Whitney segment supplies aircraft engines for commercial, military, business jet, and general aviation customers; and produces, sells, and services military and commercial auxiliary power units. The Raytheon segment provides defensive and offensive threat detection, tracking, and mitigation capabilities for U.S., foreign government, and commercial customers. The company was formerly known as Raytheon Technologies Corporation and changed its name to RTX Corporation in July 2023. RTX Corporation was incorporated in 1934 and is headquartered in Arlington, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"W.R. Berkley Corporation","Symbol":"WRB","Current Price":"59.05","Latest MA":"57.16","Price Target":62.945,"Difference from MA":"3.30%","Difference from Open":"-0.82%","Change from Yesterday":"-0.24%","Change from Last Report":"0.00","Latest Volume":"1,556,005","Market Cap":"22,502,123,520","Earning Date":"2025-01-27","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":13.6304245,"PB Ratio":2.6713414,"ROE":0.20537001,"DTE":36.284,"Industry":"Insurance - Property & Casualty","Sector":"Financial Services","Beta":0.621,"Trailing PEG":2.4625,"Trailing PE":15.141026,"Trailing PS":1.7056669,"Quick Ratio":0.232,"Day High":59.71,"Day Low":58.94,"VS Average Volume":1.0002635647,"Company Summary":"W. R. Berkley Corporation, an insurance holding company, operates as a commercial lines writers worldwide. It operates in two segments, Insurance and Reinsurance & Monoline Excess. The Insurance segment underwrites commercial insurance business, including excess and surplus lines, admitted lines, and specialty personal lines. This segment also provides accident and health insurance and reinsurance products; insurance for commercial risks; casualty and specialty environmental products; specialized insurance coverages for fine arts and jewelry exposures; excess liability and inland marine coverage for small to medium-sized insureds; and commercial general liability, umbrella, professional liability, directors and officers, commercial property, and surety products, as well as products for technology, and life sciences and travel industries. In addition, this segment offers cyber risk solutions; crime and fidelity insurance products; medical professional coverages; workers' compensation insurance products; general insurance; personal lines insurance solutions, including home, condo\/co-op, auto, and collectibles; automobile, law enforcement, public officials and educator's legal, and employment practices liability, as well as incidental medical and property and crime insurance products; at-risk and alternative risk insurance program management services; professional liability; energy and marine risks; and provides insurance products to the Lloyd's marketplace. The Reinsurance & Monoline Excess segment provides treaty and facultative reinsurance solutions; property and casualty reinsurance; facultative reinsurance products include automatic, semi-automatic and individual risk assumed reinsurance; and turnkey products such as cyber, employment practices liability insurance, liquor liability insurance and violent events. The company was founded in 1967 and is headquartered in Greenwich, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"Nucor Corporation","Symbol":"NUE","Current Price":"122.09","Latest MA":"144.46","Price Target":155.71417,"Difference from MA":"-15.49%","Difference from Open":"-2.12%","Change from Yesterday":"-2.38%","Change from Last Report":"0.00","Latest Volume":"1,981,843","Market Cap":"28,668,317,696","Earning Date":"2025-01-27","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":15.620361,"PB Ratio":1.4003073,"ROE":0.13221,"DTE":32.901,"Industry":"Steel","Sector":"Basic Materials","Beta":1.567,"Trailing PEG":null,"Trailing PE":11.750721,"Trailing PS":0.91408247,"Quick Ratio":1.497,"Day High":125.8299,"Day Low":121.66,"VS Average Volume":0.8913537237,"Company Summary":"Nucor Corporation engages in manufacture and sale of steel and steel products. It operates in three segments: steel mills, steel products, and raw materials. The Steel Mills segment produces hot-rolled, cold-rolled, and galvanized sheet steel products; plate steel products; wide-flange beams, beam blanks, and H-piling and sheet piling structural steel products; bar steel products, such as blooms, billets, concrete reinforcing and merchant bars, and engineered special bar quality products; and engages in the steel trading and rebar distribution businesses. This segment sells its products to steel service centers, fabricators, and manufacturers in the United States, Canada, and Mexico. The Steel Products segment offers steel joists and joist girders, steel decks, and galvanized torque tubes for used in solar arrays, hollow structural section steel tubing, electrical conduit, fabricated concrete reinforcing steel, cold finished steel, steel fasteners, steel grating and expanded metal, wire and wire mesh, metal building systems, insulated metal panels, steel racking, overhead doors, and utility towers and structures for communications and energy transmission. This segment is also involved in the piling distribution business. The Raw Materials segment produces direct reduced iron (DRI); brokers ferrous and nonferrous metals, pig iron, hot briquetted iron, and DRI; supplies ferro-alloys; processes ferrous and nonferrous scrap metal; and engages in the natural gas production and industrial gas business. This segment sells its ferrous scrap to electric arc furnace steel mills and foundries for manufacturing process; and nonferrous scrap metal to aluminum can producers, secondary aluminum smelters, steel mills and other processors, and consumers of various nonferrous metals. It markets its products through in-house sales force; and internal distribution and trading companies. Nucor Corporation was founded in 1905 and is headquartered in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"Brown & Brown, Inc.","Symbol":"BRO","Current Price":"105.19","Latest MA":"102.31","Price Target":114.195,"Difference from MA":"2.81%","Difference from Open":"-0.81%","Change from Yesterday":"-0.47%","Change from Last Report":"0.00","Latest Volume":"1,223,180","Market Cap":"30,079,924,224","Earning Date":"2025-01-27","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":25.693323,"PB Ratio":4.654219,"ROE":0.18144,"DTE":58.92,"Industry":"Insurance Brokers","Sector":"Financial Services","Beta":0.825,"Trailing PEG":null,"Trailing PE":28.662125,"Trailing PS":6.598356,"Quick Ratio":0.601,"Day High":106.02,"Day Low":105.03,"VS Average Volume":0.9316698276,"Company Summary":"Brown & Brown, Inc. markets and sells insurance products and services in the United States, Canada, Ireland, the United Kingdom, and internationally. It operates through four segments: Retail, National Programs, Wholesale Brokerage, and Services. The Retail segment provides property and casualty, employee benefits insurance products, personal insurance products, specialties insurance products, risk management strategies, loss control survey and analysis, consultancy, and claims processing services. It serves commercial, public and quasi-public entities, professional, and individual customers. The National Programs segment offers professional liability and related package insurance products for dentistry, legal, eyecare, insurance, financial, physicians, real estate title professionals, as well as supplementary insurance products related to weddings, events, medical facilities, and cyber liabilities. This segment also provides public entity-related and specialty programs through a network of independent agents; and program management services for insurance carrier partners. The Wholesale Brokerage segment markets and sells excess and surplus commercial and personal lines insurance through independent agents and brokers. The Services segment offers third-party claims administration and medical utilization management services in the workers' compensation and all-lines liability arenas, Medicare Set-aside, Social Security disability, Medicare benefits advocacy, and claims adjusting services. Brown & Brown, Inc. was founded in 1939 and is headquartered in Daytona Beach, Florida.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"Western Alliance Bancorporation","Symbol":"WAL","Current Price":"92.39","Latest MA":"81.03","Price Target":106.0,"Difference from MA":"14.01%","Difference from Open":"0.63%","Change from Yesterday":"0.08%","Change from Last Report":"0.00","Latest Volume":"1,060,002","Market Cap":"10,169,274,368","Earning Date":"2025-01-27","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":10.395756,"PB Ratio":1.5789922,"ROE":0.1157,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.435,"Trailing PEG":null,"Trailing PE":14.279753,"Trailing PS":3.4937556,"Quick Ratio":"N\/A","Day High":92.55,"Day Low":90.795,"VS Average Volume":1.0289573284,"Company Summary":"Western Alliance Bancorporation operates as the bank holding company for Western Alliance Bank that provides various banking products and related services primarily in Arizona, California, and Nevada. It operates through Commercial and Consumer Related segments. The company offers deposit products, including checking, savings, and money market accounts, as well as fixed-rate and fixed maturity certificates of deposit accounts; demand deposits; and treasury management and residential mortgage products and services. It also provides commercial and industrial loan products, such as working capital lines of credit, loans to technology companies, inventory and accounts receivable lines, mortgage warehouse lines, equipment loans and leases, and other commercial loans; commercial real estate loans, which are secured by multi-family residential properties, professional offices, industrial facilities, retail centers, hotels, and other commercial properties; construction and land development loans for single family and multi-family residential projects, industrial\/warehouse properties, office buildings, retail centers, medical office facilities, and residential lot developments; and consumer loans. In addition, the company provides other financial services, such as internet banking, wire transfers, electronic bill payment and presentment, funds transfer and other digital payment offerings, lock box services, courier, and cash management services. Further, the company holds certain investment securities, municipal and non-profit loans, and leases; invests primarily in low-income housing tax credits and small business investment corporations; and holds certain real estate loans and related securities. Western Alliance Bancorporation was founded in 1994 and is headquartered in Phoenix, Arizona.","Stock Sentiment":"N\/A","Row Color":"positive-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"Verizon Communications Inc.","Symbol":"VZ","Current Price":"38.95","Latest MA":"40.52","Price Target":47.1625,"Difference from MA":"-3.88%","Difference from Open":"0.17%","Change from Yesterday":"-0.18%","Change from Last Report":"0.00","Latest Volume":"19,327,241","Market Cap":"163,965,091,840","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.251402,"PB Ratio":1.7022114,"ROE":0.10431,"DTE":182.615,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.418,"Trailing PEG":1.0336,"Trailing PE":16.861473,"Trailing PS":1.2214597,"Quick Ratio":0.51,"Day High":39.34,"Day Low":38.59,"VS Average Volume":1.0107157438,"Company Summary":"Verizon Communications Inc., through its subsidiaries, engages in the provision of communications, technology, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide. It operates in two segments, Verizon Consumer Group (Consumer) and Verizon Business Group (Business). The Consumer segment provides wireless services across the wireless networks in the United States under the Verizon and TracFone brands and through wholesale and other arrangements; and fixed wireless access (FWA) broadband through its wireless networks, as well as related equipment and devices, such as smartphones, tablets, smart watches, and other wireless-enabled connected devices. The segment also offers wireline services in the Mid-Atlantic and Northeastern United States, as well as Washington D.C. through its fiber-optic network, Verizon Fios product portfolio, and a copper-based network. The Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and conferencing, corporate networking, security and managed network, local and long-distance voice, and network access services to deliver various IoT services and products to businesses, government customers, and wireless and wireline carriers in the United States and internationally. The company was formerly known as Bell Atlantic Corporation and changed its name to Verizon Communications Inc. in June 2000. Verizon Communications Inc. was incorporated in 1983 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"AT&T Inc.","Symbol":"T","Current Price":"22.32","Latest MA":"20.71","Price Target":26.14962,"Difference from MA":"7.75%","Difference from Open":"-0.27%","Change from Yesterday":"-0.76%","Change from Last Report":"0.00","Latest Volume":"26,764,734","Market Cap":"160,152,469,504","Earning Date":"2025-01-27","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":10.320385,"PB Ratio":1.5645591,"ROE":0.08759,"DTE":125.151,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.73,"Trailing PEG":1.8466,"Trailing PE":18.146341,"Trailing PS":1.3120799,"Quick Ratio":0.42,"Day High":22.47,"Day Low":22.02,"VS Average Volume":0.7804545186,"Company Summary":"AT&T Inc. provides telecommunications and technology services worldwide. The company operates through two segments, Communications and Latin America. The Communications segment offers wireless voice and data communications services; and sells handsets, wireless data cards, wireless computing devices, carrying cases\/protective covers, and wireless chargers through its own company-owned stores, agents, and third-party retail stores. It also provides Virtual Private Networks, AT&T Dedicated Internet, Ethernet, data services, cloud solutions, outsourcing, and managed professional services, as well as customer premises equipment for multinational corporations, small and mid-sized businesses, governmental, and wholesale customers. In addition, this segment offers broadband services, including fiber connections, legacy telephony voice communication services, and other VoIP services and equipment to residential customers. This segment markets its communications services and products under the AT&T, AT&T Business, Cricket, AT&T PREPAID, and AT&T Fiber brand names. The Latin America segment provides postpaid and prepaid wireless services in Mexico under the AT&T and Unefon brand names, as well as sells smartphones through its owned stores, agents and third-party retail stores. The company was formerly known as SBC Communications Inc. and changed its name to AT&T Inc. in 2005. AT&T Inc. was incorporated in 1983 and is based in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"NextEra Energy, Inc.","Symbol":"NEE","Current Price":"68.49","Latest MA":"76.30","Price Target":85.55455,"Difference from MA":"-10.24%","Difference from Open":"-2.93%","Change from Yesterday":"-3.33%","Change from Last Report":"0.00","Latest Volume":"14,412,287","Market Cap":"140,842,827,776","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":18.60848,"PB Ratio":2.814002,"ROE":0.09887999,"DTE":139.015,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.561,"Trailing PEG":2.7892,"Trailing PE":20.323442,"Trailing PS":5.3662586,"Quick Ratio":0.258,"Day High":70.56,"Day Low":68.34,"VS Average Volume":1.3423559928,"Company Summary":"NextEra Energy, Inc., through its subsidiaries, generates, transmits, distributes, and sells electric power to retail and wholesale customers in North America. The company generates electricity through wind, solar, nuclear,natural gas, and other clean energy. It also develops, constructs, and operates long-term contracted assets that consists of clean energy solutions, such as renewable generation facilities, battery storage projects, and electric transmission facilities; sells energy commodities; and owns, develops, constructs, manages and operates electric generation facilities in wholesale energy markets. The company had approximately 33,276 megawatts of net generating capacity; approximately 90,000 circuit miles of transmission and distribution lines; and 883 substations. It serves approximately 12 million people through approximately 5.9 million customer accounts in the east and lower west coasts of Florida. The company was formerly known as FPL Group, Inc. and changed its name to NextEra Energy, Inc. in 2010. NextEra Energy, Inc. was founded in 1925 and is headquartered in Juno Beach, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"American Express Company","Symbol":"AXP","Current Price":"322.25","Latest MA":"268.18","Price Target":304.3844,"Difference from MA":"20.16%","Difference from Open":"1.24%","Change from Yesterday":"1.35%","Change from Last Report":"0.00","Latest Volume":"2,924,210","Market Cap":"227,007,397,888","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":21.167416,"PB Ratio":7.636799,"ROE":0.3469,"DTE":186.815,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.214,"Trailing PEG":2.0399,"Trailing PE":23.694853,"Trailing PS":3.83206,"Quick Ratio":1.619,"Day High":322.82,"Day Low":317.677,"VS Average Volume":1.1929766301,"Company Summary":"American Express Company, together with its subsidiaries, operates as integrated payments company in the United States, Europe, the Middle East and Africa, the Asia Pacific, Australia, New Zealand, Latin America, Canada, the Caribbean, and Internationally. It operates through four segments: U.S. Consumer Services, Commercial Services, International Card Services, and Global Merchant and Network Services. The company's products and services include credit card, charge card, banking, and other payment and financing products; network services; expense management products and services; and travel and lifestyle services. It also provides merchant acquisition and processing, servicing and settlement, point-of-sale marketing, and information products and services for merchants; and fraud prevention services, as well as the design and operation of customer loyalty programs. In addition, the company operates lounges at airports under Centurion Lounge brand name. It sells its products and services to consumers, small businesses, mid-sized companies, and large corporations through mobile and online applications, affiliate marketing, customer referral programs, third-party service providers and business partners, direct mail, telephone, in-house sales teams, and direct response advertising. American Express Company was founded in 1850 and is headquartered in New York, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"23-01-2025 09:08:25"},{"Company Name":"HCA Healthcare, Inc.","Symbol":"HCA","Current Price":"319.51","Latest MA":"351.32","Price Target":388.52695,"Difference from MA":"-9.05%","Difference from Open":"0.40%","Change from Yesterday":"0.33%","Change from Last Report":"0.00","Latest Volume":"2,047,609","Market Cap":"80,930,922,496","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":12.98219,"PB Ratio":"N\/A","ROE":11.954511,"DTE":5711.069,"Industry":"Medical Care Facilities","Sector":"Healthcare","Beta":1.689,"Trailing PEG":1.0306,"Trailing PE":14.347104,"Trailing PS":1.16245,"Quick Ratio":0.866,"Day High":321.18,"Day Low":311.7,"VS Average Volume":1.3469516768,"Company Summary":"HCA Healthcare, Inc., through its subsidiaries, owns and operates hospitals and related healthcare entities in the United States. It operates general and acute care hospitals that offers medical and surgical services, including inpatient care, intensive care, cardiac care, diagnostic, and emergency services; and outpatient services, such as outpatient surgery, laboratory, radiology, respiratory therapy, cardiology, and physical therapy. The company also operates outpatient health care facilities consisting of freestanding ambulatory surgery centers, freestanding emergency care facilities, urgent care facilities, walk-in clinics, diagnostic and imaging centers, rehabilitation and physical therapy centers, radiation and oncology therapy centers, physician practices, and various other facilities. In addition, it operates behavioral hospitals, which provide therapeutic programs comprising child, adolescent and adult psychiatric care, adolescent and adult alcohol, drug abuse treatment, and counseling services. The company was formerly known as HCA Holdings, Inc. HCA Healthcare, Inc. was founded in 1968 and is headquartered in Nashville, Tennessee.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-01-2025 09:08:25"}]