[{"Company Name":"Grab Holdings Limited","Symbol":"GRAB","Current Price":"4.56","Latest MA":"4.20","Price Target":5.74365,"Difference from MA":"8.60%","Difference from Open":"-4.20%","Change from Yesterday":"-5.39%","Change from Last Report":"0.00","Latest Volume":"37,481,420","Market Cap":"18,536,398,848","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":152.0,"PB Ratio":2.8970776,"Previous Close":4.82,"ROE":-0.02465,"DTE":5.731,"Industry":"Software - Application","Sector":"Technology","Beta":0.902,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":6.627243,"Quick Ratio":2.344,"Day High":4.77,"Day Low":4.55,"VS Average Volume":1.1251897935,"Company Summary":"Grab Holdings Limited engages in the provision of superapps in Cambodia, Indonesia, Malaysia, Myanmar, the Philippines, Singapore, Thailand, and Vietnam. The company offers its Grab ecosystem, a single platform with superapps for driver- and merchant-partners and consumers, that allows access to mobility, delivery, digital financial services, and enterprise sector offerings. Grab Holdings Limited was founded in 2012 and is headquartered in Singapore.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 12:52:41"},{"Company Name":"Bilibili Inc.","Symbol":"BILI","Current Price":"21.30","Latest MA":"18.38","Price Target":25.45557,"Difference from MA":"15.90%","Difference from Open":"0.80%","Change from Yesterday":"3.75%","Change from Last Report":"0.00","Latest Volume":"8,531,427","Market Cap":"8,797,857,792","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":34.91803,"PB Ratio":0.63081205,"Previous Close":20.53,"ROE":-0.09567001,"DTE":34.288,"Industry":"Electronic Gaming & Multimedia","Sector":"Communication Services","Beta":0.805,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.32789257,"Quick Ratio":1.204,"Day High":21.6899,"Day Low":20.83,"VS Average Volume":1.2588444855,"Company Summary":"Bilibili Inc. provides online entertainment services for the young generations in the People's Republic of China. It offers a range of digital content, including professional user generated videos, mobile games, and value-added services, such as live broadcasting, occupationally generated videos, audio drama on Maoer, and comics on Bilibili Comic. The company also provides advertising services; and IP derivatives and other services. In addition, it engages in the business and technology development activities; e-commerce business; and video, comics, and game distribution activities. Bilibili Inc. was founded in 2009 and is headquartered in Shanghai, the People's Republic of China.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 12:52:41"},{"Company Name":"CenterPoint Energy, Inc (Holdin","Symbol":"CNP","Current Price":"34.22","Latest MA":"29.80","Price Target":33.685,"Difference from MA":"14.82%","Difference from Open":"0.15%","Change from Yesterday":"0.06%","Change from Last Report":"0.00","Latest Volume":"7,436,584","Market Cap":"22,302,167,040","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":19.666668,"PB Ratio":2.0909204,"Previous Close":34.2,"ROE":0.10023,"DTE":196.803,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.947,"Trailing PEG":1.9588,"Trailing PE":21.658228,"Trailing PS":2.5803733,"Quick Ratio":0.486,"Day High":34.38,"Day Low":33.705,"VS Average Volume":1.7387469052,"Company Summary":"CenterPoint Energy, Inc. operates as a public utility holding company in the United States. The company operates through two segments, Electric and Natural Gas. The Electric segment includes electric transmission and distribution services to electric customers and electric generation assets, as well as optimizes assets in the wholesale power market. The Natural Gas segment engages in the intrastate natural gas sales, and natural gas transportation and distribution for residential, commercial, industrial and institutional customers in Indiana, Louisiana, Minnesota, Mississippi, Ohio, and Texas; permanent pipeline connections through interconnects with various interstate and intrastate pipeline companies; and provides maintenance and repair services of home appliances to customers in Minnesota and home repair protection plans to natural gas customers in Indiana, Mississippi, Ohio, and Texas through a third party. It serves approximately 2,534,730 metered customers; owned 348 substations with transformer capacity of 79,719 megavolt amperes; and owned and operated 217 miles of intrastate pipeline in Louisiana and Texas. The company was founded in 1866 and is headquartered in Houston, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"26-02-2025 12:52:41"},{"Company Name":"Targa Resources, Inc.","Symbol":"TRGP","Current Price":"194.92","Latest MA":"171.58","Price Target":212.47545,"Difference from MA":"13.61%","Difference from Open":"-1.73%","Change from Yesterday":"-1.79%","Change from Last Report":"0.00","Latest Volume":"2,206,297","Market Cap":"42,513,416,192","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":23.598063,"PB Ratio":16.372953,"Previous Close":198.47,"ROE":0.34414002,"DTE":323.439,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":2.287,"Trailing PEG":1.1568,"Trailing PE":34.017452,"Trailing PS":2.595209,"Quick Ratio":0.56,"Day High":198.015,"Day Low":188.65,"VS Average Volume":1.3608633596,"Company Summary":"Targa Resources Corp., together with its subsidiary, Targa Resources Partners LP, owns, operates, acquires, and develops a portfolio of complementary domestic midstream infrastructure assets in North America. It operates in two segments, Gathering and Processing, and Logistics and Transportation. The company is involved in gathering, compressing, treating, processing, transporting, and selling natural gas; storing, fractionating, treating, transporting, and selling natural gas liquids (NGL) and NGL products, including services to liquefied petroleum gas exporters; and gathering, storing, terminaling, purchasing, and selling crude oil. It is also involved in the purchase and resale of NGL products; and sale of propane, as well as provision of related logistics services to multi-state retailers, independent retailers, and other end-users. In addition, the company offers NGL balancing services; and transportation services to refineries and petrochemical companies in the Gulf Coast area, as well as purchases, markets, and resells natural gas. As of December 31, 2023, it leased and managed approximately 605 railcars; 137 tractors; and 6 vacuum trucks and 2 pressurized NGL barges. Targa Resources Corp. was incorporated in 2005 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 12:52:41"},{"Company Name":"WillScot Holdings Corporation","Symbol":"WSC","Current Price":"33.85","Latest MA":"37.17","Price Target":43.054,"Difference from MA":"-8.93%","Difference from Open":"-0.97%","Change from Yesterday":"-1.23%","Change from Last Report":"0.00","Latest Volume":"2,455,534","Market Cap":"6,214,013,952","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":18.297297,"PB Ratio":6.1001983,"Previous Close":34.27,"ROE":0.02468,"DTE":390.279,"Industry":"Rental & Leasing Services","Sector":"Industrials","Beta":1.409,"Trailing PEG":1.3806,"Trailing PE":225.66664,"Trailing PS":2.5938003,"Quick Ratio":0.751,"Day High":35.005,"Day Low":33.8,"VS Average Volume":1.1112592468,"Company Summary":"WillScot Holdings Corporation designs, delivers, and services onsite and on-demand space solutions in North America. It provides mobile offices, ground level spaces, blast-resistant modules, clearspan structures and complexes, restrooms, containers, climate-controlled storage containers, and portable classrooms. The company also offers space solutions for workspace, collaboration and break, power and connectivity, security and protection, health and safety, and classroom furnishing facilities. It serves customers in energy and industrial, education and government, manufacturing, retail and distribution, healthcare and entertainment, and construction and builder industries. The company was formerly known as WillScot Mobile Mini Holdings Corp. and changed its name to WillScot Holdings Corporation in July 2024. WillScot Holdings Corporation is headquartered in Phoenix, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:52:41"},{"Company Name":"FNF Group of Fidelity National ","Symbol":"FNF","Current Price":"60.93","Latest MA":"58.27","Price Target":70.8,"Difference from MA":"4.57%","Difference from Open":"0.69%","Change from Yesterday":"1.72%","Change from Last Report":"0.00","Latest Volume":"2,205,319","Market Cap":"16,755,749,888","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":9.843296,"PB Ratio":2.160945,"Previous Close":59.9,"ROE":0.17396,"DTE":50.645,"Industry":"Insurance - Specialty","Sector":"Financial Services","Beta":1.43,"Trailing PEG":null,"Trailing PE":13.103226,"Trailing PS":1.224746,"Quick Ratio":39.168,"Day High":61.36,"Day Low":60.29,"VS Average Volume":2.2731825931,"Company Summary":"Fidelity National Financial, Inc., together with its subsidiaries, provides various insurance products in the United States. The company operates through Title, F&G, and Corporate and Other segments. It offers title insurance, escrow, and other title related services, including trust activities, trustee sales guarantees, recordings and reconveyances, and home warranty products. The company also provides technology and transaction services to the real estate and mortgage industries; and mortgage transaction services, including title-related services and facilitation of production and management of mortgage loans. In addition, it offers annuity and life insurance products, such as deferred and immediate annuities, as well as indexed universal life insurance products; and funding agreements and pension risk transfer (PRT) solutions. Further, the company engages in the real estate brokerage business. Fidelity National Financial, Inc. was incorporated in 2005 and is headquartered in Jacksonville, Florida.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 12:52:41"},{"Company Name":"HF Sinclair Corporation","Symbol":"DINO","Current Price":"36.49","Latest MA":"41.54","Price Target":46.08929,"Difference from MA":"-12.16%","Difference from Open":"-0.55%","Change from Yesterday":"-1.16%","Change from Last Report":"0.00","Latest Volume":"2,941,477","Market Cap":"6,874,972,160","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":11.658147,"PB Ratio":0.74098897,"Previous Close":36.92,"ROE":0.01879,"DTE":33.49,"Industry":"Oil & Gas Refining & Marketing","Sector":"Energy","Beta":1.195,"Trailing PEG":null,"Trailing PE":40.098904,"Trailing PS":0.24055186,"Quick Ratio":0.697,"Day High":37.66,"Day Low":36.11,"VS Average Volume":1.1609312308,"Company Summary":"HF Sinclair Corporation operates as an independent energy company. The company produces and markets gasoline, diesel fuel, jet fuel, renewable diesel, specialty lubricant products, specialty chemicals, specialty and modified asphalt, and others. It owns and operates refineries located in Kansas, Oklahoma, New Mexico, Utah, Washington, and Wyoming; and markets its refined products principally in the Southwest United States and Rocky Mountains, Pacific Northwest, and in other neighboring Plains states. In addition, the company supplies fuels to approximately 1,500 independent Sinclair branded stations and licenses the use of the Sinclair brand at approximately 300 additional locations. Further, it produces base oils and other specialized lubricants; and provides petroleum product and crude oil transportation, terminalling, storage, and throughput services to the petroleum sector. HF Sinclair Corporation is headquartered in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:52:41"},{"Company Name":"Americold Realty Trust, Inc.","Symbol":"COLD","Current Price":"22.17","Latest MA":"24.90","Price Target":27.66667,"Difference from MA":"-10.96%","Difference from Open":"-0.89%","Change from Yesterday":"-0.76%","Change from Last Report":"0.00","Latest Volume":"4,728,335","Market Cap":"6,324,369,408","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":48.195652,"PB Ratio":1.9209774,"Previous Close":22.34,"ROE":-0.0273,"DTE":111.291,"Industry":"REIT - Industrial","Sector":"Real Estate","Beta":0.626,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":2.3750477,"Quick Ratio":0.72,"Day High":22.662,"Day Low":22.01,"VS Average Volume":2.4684831285,"Company Summary":"Americold is a global leader in temperature-controlled logistics real estate and value added services. Focused on the ownership, operation, acquisition and development of temperature-controlled warehouses, Americold owns and\/or operates 245 temperature-controlled warehouses, with approximately 1.5 billion refrigerated cubic feet of storage, in North America, Europe, Asia-Pacific, and South America. Americold's facilities are an integral component of the supply chain connecting food producers, processors, distributors and retailers to consumers.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:52:41"},{"Company Name":"LKQ Corporation","Symbol":"LKQ","Current Price":"41.54","Latest MA":"38.81","Price Target":51.14444,"Difference from MA":"7.03%","Difference from Open":"0.70%","Change from Yesterday":"0.70%","Change from Last Report":"0.00","Latest Volume":"2,421,738","Market Cap":"10,765,299,712","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":11.475139,"PB Ratio":1.788744,"Previous Close":41.25,"ROE":0.11349,"DTE":92.987,"Industry":"Auto Parts","Sector":"Consumer Cyclical","Beta":1.286,"Trailing PEG":2.4906,"Trailing PE":15.794677,"Trailing PS":0.7499338,"Quick Ratio":0.474,"Day High":42.01,"Day Low":41.25,"VS Average Volume":1.0997886924,"Company Summary":"LKQ Corporation engages in the distribution of replacement parts, components, and systems used in the repair and maintenance of vehicles and specialty vehicle aftermarket products and accessories. It operates through four segments: Wholesale-North America, Europe, Specialty, and Self Service. The company distributes bumper covers, automotive body panels, and lights, as well as mechanical automotive parts and accessories; salvage products, including mechanical and collision parts comprising engines; transmissions; door assemblies; sheet metal products, such as trunk lids, fenders, and hoods; lights and bumper assemblies; scrap metal and other materials to metals recyclers; and brake pads, discs and sensors, clutches, steering and suspension products, filters, and oil and automotive fluids, as well as electrical products, including spark plugs and batteries. In addition, the company distributes recreational vehicle appliances and air conditioners, towing hitches, truck bed covers, vehicle protection products, marine electronics, cargo management products, wheels, tires, and suspension products. It serves collision and mechanical repair shops, and new and used car dealerships, as well as retail customers. The company operates in the United States, Canada, the United Kingdom, Germany, Belgium, the Netherlands, Luxembourg, Italy, the Czech Republic, Austria, Poland, Slovakia, Taiwan, and other European countries. LKQ Corporation was incorporated in 1998 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 12:52:41"},{"Company Name":"Akamai Technologies, Inc.","Symbol":"AKAM","Current Price":"78.05","Latest MA":"97.54","Price Target":107.09217,"Difference from MA":"-19.98%","Difference from Open":"0.71%","Change from Yesterday":"0.52%","Change from Last Report":"0.00","Latest Volume":"4,078,653","Market Cap":"11,732,320,256","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":11.684133,"PB Ratio":2.400283,"Previous Close":77.65,"ROE":0.10657,"DTE":95.003,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.654,"Trailing PEG":1.0585,"Trailing PE":23.868502,"Trailing PS":2.9395707,"Quick Ratio":1.111,"Day High":78.79,"Day Low":76.595,"VS Average Volume":1.9728799048,"Company Summary":"Akamai Technologies, Inc. provides cloud computing, security, and content delivery services in the United States and internationally. The company offers cloud solutions to keep infrastructure, websites, applications, application programming interfaces, and users safe from various cyberattacks and online threats while enhancing performance. It also provides web and mobile performance solutions to enable dynamic websites and applications; media delivery solutions, including video streaming and video player services, game and software delivery, broadcast operations, authoritative domain name system, resolution, and data and analytics; and cloud computing services, such as compute, storage, networking, database, and container management services to build, deploy, and secure applications and workloads. In addition, the company offers content delivery solutions; and an array of service and support to assist customers with integrating, configuring, optimizing, and managing its offerings. It sells its solutions through various channel partners. Akamai Technologies, Inc. was incorporated in 1998 and is headquartered in Cambridge, Massachusetts.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:52:41"},{"Company Name":"Alliant Energy Corporation","Symbol":"LNT","Current Price":"63.75","Latest MA":"58.71","Price Target":63.4025,"Difference from MA":"8.58%","Difference from Open":"-0.39%","Change from Yesterday":"-0.16%","Change from Last Report":"0.00","Latest Volume":"2,783,837","Market Cap":"16,364,114,944","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":19.736841,"PB Ratio":2.336363,"Previous Close":63.85,"ROE":0.10014,"DTE":151.585,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.598,"Trailing PEG":2.5525,"Trailing PE":23.698885,"Trailing PS":4.1105537,"Quick Ratio":0.187,"Day High":64.1492,"Day Low":63.395,"VS Average Volume":1.8223133869,"Company Summary":"Alliant Energy Corporation operates as a utility holding company that provides regulated electricity and natural gas services in the United States. It operates in three segments: Utility Electric Operations, Utility Gas Operations, and Utility Other. The company, through its subsidiary, Interstate Power and Light Company (IPL), primarily generates and distributes electricity, and distributes and transports natural gas to retail customers in Iowa; sells electricity to wholesale customers in Minnesota, Illinois, and Iowa; and generates and distributes steam in Cedar Rapids, Iowa. Alliant Energy Corporation, through its other subsidiary, Wisconsin Power and Light Company (WPL), generates and distributes electricity, and distributes and transports natural gas to retail customers in Wisconsin; and sells electricity to wholesale customers in Wisconsin. It serves retail customers in the farming, agriculture, industrial manufacturing, chemical, packaging, and food industries, as well as wholesale customers comprising municipalities and rural electric cooperatives. In addition, the company owns and operates a short-line rail freight service in Iowa; a Mississippi River barge, rail, and truck freight terminal in Illinois; freight brokerage services; wind turbine blade recycling services; and a rail-served warehouse in Iowa. Further, it holds interests in a natural gas-fired electric generating unit near Sheboygan Falls, Wisconsin; and a wind farm located in Oklahoma. The company was formerly known as Interstate Energy Corp. and changed its name to Alliant Energy Corporation in May 1999. Alliant Energy Corporation was incorporated in 1981 and is headquartered in Madison, Wisconsin.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 12:52:41"},{"Company Name":"Builders FirstSource, Inc.","Symbol":"BLDR","Current Price":"140.78","Latest MA":"169.94","Price Target":179.38889,"Difference from MA":"-17.16%","Difference from Open":"0.98%","Change from Yesterday":"1.59%","Change from Last Report":"0.00","Latest Volume":"2,918,544","Market Cap":"15,995,564,032","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":12.084121,"PB Ratio":3.721582,"Previous Close":138.58,"ROE":0.23877001,"DTE":100.846,"Industry":"Building Products & Equipment","Sector":"Industrials","Beta":2.121,"Trailing PEG":null,"Trailing PE":15.5215,"Trailing PS":0.97531,"Quick Ratio":1.02,"Day High":143.32,"Day Low":138.1275,"VS Average Volume":1.8871808136,"Company Summary":"Builders FirstSource, Inc., together with its subsidiaries, manufactures and supplies building materials, manufactured components, and construction services to professional homebuilders, sub-contractors, remodelers, and consumers in the United States. It offers lumber and lumber sheet goods comprising dimensional lumber, plywood, and oriented strand board products that are used in on-site house framing; manufactured products, such as wood floor and roof trusses, floor trusses, wall panels, stairs, and engineered wood products; and windows, and interior and exterior door units, as well as interior trims and custom products comprising intricate mouldings, stair parts, and columns under the Synboard brand name. The company also provides specialty building products and services, including vinyl, composite and wood siding, exterior trims, metal studs, cement, roofing, insulation, wallboards, ceilings, cabinets, and hardware products; turn-key framing, shell construction, design assistance, and professional installation services. In addition, it offers software products, such as drafting, estimating, quoting, and virtual home design services, which provide software solutions to retailers, distributors, manufacturers, and homebuilders. The company was formerly known as BSL Holdings, Inc. and changed its name to Builders FirstSource, Inc. in October 1999. Builders FirstSource, Inc. was incorporated in 1998 and is based in Irving, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:52:41"},{"Company Name":"Block, Inc.","Symbol":"XYZ","Current Price":"62.84","Latest MA":"76.65","Price Target":96.0422,"Difference from MA":"-18.02%","Difference from Open":"-5.10%","Change from Yesterday":"-4.67%","Change from Last Report":"0.00","Latest Volume":"16,911,257","Market Cap":"38,928,121,856","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":11.593518,"PB Ratio":1.8309491,"Previous Close":65.92,"ROE":0.14358,"DTE":37.29,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":2.524,"Trailing PEG":0.1082,"Trailing PE":13.780702,"Trailing PS":1.6138649,"Quick Ratio":1.493,"Day High":66.39,"Day Low":62.64,"VS Average Volume":2.3359154492,"Company Summary":"Block, Inc., together with its subsidiaries, builds ecosystems focused on commerce and financial products and services in the United States and internationally. It operates through two segments, Square and Cash App. The Square segment offers commerce products for restaurants, appointments, retail, point of sale, online, online checkout, and invoices, as well as virtual terminals, risk and order managers, and payment and commerce application programming interfaces; managed payment services; software solutions; hardware products, such as registers, terminals, stands, and readers for contactless and chips; banking services consisting of lending, instant transfer, and checking and savings accounts; and full-service setup and support services. This segment also provides loyalty, marketing, team management, and payroll services; and gift cards. The Cash App segment offers financial tools within the mobile Cash App, including peer-to-peer payments, bitcoin, and stock investment brokerage; Cash App Card, a debit card; direct deposit, cash boost, and tax preparation services; and Afterpay, a buy now, pay later platform. This segment also provides Pay in 4, monthly payment solutions, advertising and affiliate, shop directory, and Cash App Pay services; and business accounts, and Afterpay and Afterpay Plus cards. In addition, the company operates TIDAL, a platform for musicians and fans; TBD, an open developer platform focused on making the decentralized financial world accessible; Bitkey, a self-custody bitcoin wallet; and Spiral, which focuses on bitcoin open source work. It serves businesses, sellers, and individuals through e-commerce and retail distribution channels. The company was formerly known as Square, Inc. and changed its name to Block, Inc. in December 2021. Block, Inc. was incorporated in 2009 and is based in Oakland, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:52:41"},{"Company Name":"Walmart Inc.","Symbol":"WMT","Current Price":"97.69","Latest MA":"84.94","Price Target":108.74553,"Difference from MA":"15.00%","Difference from Open":"3.54%","Change from Yesterday":"4.29%","Change from Last Report":"0.00","Latest Volume":"25,797,900","Market Cap":"784,781,869,056","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":35.915443,"PB Ratio":8.617678,"Previous Close":93.67,"ROE":0.21414,"DTE":61.534,"Industry":"Discount Stores","Sector":"Consumer Defensive","Beta":0.552,"Trailing PEG":2.9805,"Trailing PE":40.53527,"Trailing PS":1.1524217,"Quick Ratio":0.197,"Day High":97.91,"Day Low":94.24,"VS Average Volume":1.4776369791,"Company Summary":"Walmart Inc. engages in the operation of retail, wholesale, other units, and eCommerce worldwide. The company operates through three segments: Walmart U.S., Walmart International, and Sam's Club. It operates supercenters, supermarkets, hypermarkets, warehouse clubs, cash and carry stores, and discount stores under Walmart and Walmart Neighborhood Market brands; membership-only warehouse clubs; ecommerce websites, such as walmart.com.mx, walmart.ca, flipkart.com, PhonePe and other sites; and mobile commerce applications. The company offers grocery and consumables, including dairy, meat, bakery, deli, produce, dry, chilled or frozen packaged foods, alcoholic and nonalcoholic beverages, floral, snack foods, candy, other grocery items, health and beauty aids, paper goods, laundry and home care, baby care, pet supplies, and other consumable items; fuel, tobacco and other categories. It is also involved in the provision of health and wellness products covering pharmacy, optical and hearing services, and over-the-counter drugs and other medical products; and home and apparel including home improvement, outdoor living, gardening, furniture, apparel, jewelry, tools and power equipment, housewares, toys, seasonal items, mattresses and tire and battery centers. In addition, the company offers consumer electronics and accessories, software, video games, office supplies, appliances, and third-party gift cards. Further, it operates digital payment platforms; and offers financial services and related products, including money transfers, bill payments, money orders, check cashing, prepaid access, co-branded credit cards, installment lending, and earned wage access. Additionally, the company markets lines of merchandise under private brands, including Allswell, Athletic Works, Equate, and Free Assembly. The company was formerly known as Wal-Mart Stores, Inc. and changed its name to Walmart Inc. in February 2018. Walmart Inc. was founded in 1945 and is based in Bentonville, Arkansas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 12:52:41"},{"Company Name":"VICI Properties Inc.","Symbol":"VICI","Current Price":"32.62","Latest MA":"31.03","Price Target":35.56522,"Difference from MA":"5.14%","Difference from Open":"1.43%","Change from Yesterday":"2.10%","Change from Last Report":"0.00","Latest Volume":"6,387,051","Market Cap":"34,457,808,896","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":11.948717,"PB Ratio":1.2984635,"Previous Close":31.95,"ROE":0.10345,"DTE":65.488,"Industry":"REIT - Diversified","Sector":"Real Estate","Beta":0.972,"Trailing PEG":null,"Trailing PE":12.7421875,"Trailing PS":8.951929,"Quick Ratio":21.183,"Day High":32.735,"Day Low":32.16,"VS Average Volume":1.059214897,"Company Summary":"VICI Properties Inc. is an S&P 500 experiential real estate investment trust that owns one of the largest portfolios of market-leading gaming, hospitality and entertainment destinations, including Caesars Palace Las Vegas, MGM Grand and the Venetian Resort Las Vegas, three of the most iconic entertainment facilities on the Las Vegas Strip. VICI Properties owns 93 experiential assets across a geographically diverse portfolio consisting of 54 gaming properties and 39 other experiential properties across the United States and Canada. The portfolio is comprised of approximately 127 million square feet and features approximately 60,300 hotel rooms and over 500 restaurants, bars, nightclubs and sportsbooks. Its properties are occupied by industry-leading gaming, leisure and hospitality operators under long-term, triple-net lease agreements. VICI Properties has a growing array of real estate and financing partnerships with leading operators in other experiential sectors, including Bowlero, Cabot, Canyon Ranch, Chelsea Piers, Great Wolf Resorts, Homefield and Kalahari Resorts. VICI Properties also owns four championship golf courses and 33 acres of undeveloped and underdeveloped land adjacent to the Las Vegas Strip. VICI Properties' goal is to own the highest quality and most productive experiential real estate portfolio through a strategy of partnering with the highest quality experiential place makers and operators.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 12:52:41"},{"Company Name":"Baxter International Inc.","Symbol":"BAX","Current Price":"35.94","Latest MA":"34.20","Price Target":39.9175,"Difference from MA":"5.08%","Difference from Open":"2.72%","Change from Yesterday":"2.45%","Change from Last Report":"0.00","Latest Volume":"8,921,816","Market Cap":"18,387,802,112","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":12.479166,"PB Ratio":2.6368303,"Previous Close":35.08,"ROE":-0.042090002,"DTE":191.472,"Industry":"Medical Instruments & Supplies","Sector":"Healthcare","Beta":0.614,"Trailing PEG":2.366,"Trailing PE":"N\/A","Trailing PS":1.7288268,"Quick Ratio":0.537,"Day High":36.05,"Day Low":34.955,"VS Average Volume":1.8471313078,"Company Summary":"Baxter International Inc., through its subsidiaries, develops and provides a portfolio of healthcare products worldwide. The company operates through four segments: Medical Products and Therapies, Healthcare Systems and Technologies, Pharmaceuticals, and Kidney Care. The company offers sterile intravenous (IV) solutions; infusion systems and devices; parenteral nutrition therapies; generic injectable pharmaceuticals; surgical hemostat and sealant products, advanced surgical equipment; smart bed systems; patient monitoring and diagnostic technologies; and respiratory health devices, as well as advanced equipment for the surgical space, including surgical video technologies, precision positioning devices, and other accessories. It also provides administrative sets; adhesion prevention products; inhaled anesthesia; drug compounding; chronic and acute dialysis therapies and services, including peritoneal dialysis (PD), hemodialysis (HD), continuous renal replacement therapies (CRRT), and other organ support therapies. The company's products are used in hospitals, kidney dialysis centers, nursing homes, rehabilitation centers, ambulatory surgery centers, doctors' offices, and patients at home under physician supervision. The company sells its products through direct sales force, as well as through independent distributors, drug wholesalers, and specialty pharmacy or other alternate site providers in approximately 100 countries. It has an agreement with Celerity Pharmaceutical, LLC to develop acute care generic injectable premix and oncolytic products; and a collaborative research agreement with Miromatrix Medical Inc. aiming to advance care for patients with acute liver failure. Baxter International Inc. was incorporated in 1931 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"26-02-2025 12:52:41"},{"Company Name":"Floor & Decor Holdings, Inc.","Symbol":"FND","Current Price":"100.29","Latest MA":"105.20","Price Target":105.2048,"Difference from MA":"-4.67%","Difference from Open":"1.82%","Change from Yesterday":"2.83%","Change from Last Report":"0.00","Latest Volume":"2,648,320","Market Cap":"10,770,745,344","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":50.145,"PB Ratio":4.961413,"Previous Close":97.53,"ROE":0.1004,"DTE":77.716,"Industry":"Home Improvement Retail","Sector":"Consumer Cyclical","Beta":1.835,"Trailing PEG":null,"Trailing PE":52.78421,"Trailing PS":2.4172578,"Quick Ratio":0.244,"Day High":101.73,"Day Low":98.45,"VS Average Volume":1.7531147456,"Company Summary":"Floor & Decor Holdings, Inc. together with its subsidiaries, operates as a multi-channel specialty retailer of hard surface flooring and related accessories, and commercial surfaces seller in Georgia and Florida. The company offers tile, wood, laminate, vinyl, and natural stone flooring products, as well as decorative accessories, wall tiles, and installation materials and tools; and vanities, shower doors, bath accessories, faucets, sinks, custom countertops, bathroom mirrors, and bathroom lighting. It also sells products through its Website, FloorandDecor.com. The company serves professional installers, commercial businesses, and homeowners. It operates warehouse stores and design centers. The company was formerly known as FDO Holdings, Inc. and changed its name to Floor & Decor Holdings, Inc. in April 2017. Floor & Decor Holdings, Inc. was founded in 2000 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:52:41"},{"Company Name":"Cameco Corporation","Symbol":"CCJ","Current Price":"43.59","Latest MA":"49.06","Price Target":58.762623,"Difference from MA":"-11.16%","Difference from Open":"0.55%","Change from Yesterday":"0.72%","Change from Last Report":"0.00","Latest Volume":"4,472,416","Market Cap":"19,011,690,496","Earning Date":"2025-02-20","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":36.94068,"PB Ratio":2.981532,"Previous Close":43.28,"ROE":0.027590001,"DTE":20.364,"Industry":"Uranium","Sector":"Energy","Beta":0.948,"Trailing PEG":null,"Trailing PE":161.44444,"Trailing PS":6.0628424,"Quick Ratio":0.802,"Day High":43.91,"Day Low":42.86,"VS Average Volume":1.0921434765,"Company Summary":"Cameco Corporation provides uranium for the generation of electricity. It operates through Uranium, Fuel Services, Westinghouse segments. The Uranium segment is involved in the exploration for, mining, and milling, purchase, and sale of uranium concentrate. The Fuel Services segment engages in the refining, conversion, and fabrication of uranium concentrate, as well as the purchase and sale of conversion services. This segment also produces CANDU reactor fuel bundles and other reactor components. The company offers nuclear fuel processing services. The Westinghouse segment engages in the manufacture of nuclear reactor technology original equipment. This segment provides products and services to commercial utilities and government agencies; and outage and maintenance services, engineering support, instrumentation and controls equipment, plant modification, and components and parts to nuclear reactors. It sells its uranium and fuel services to nuclear utilities in the Americas, Europe, and Asia. Cameco Corporation was incorporated in 1987 and is headquartered in Saskatoon, Canada.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:52:41"},{"Company Name":"Rivian Automotive, Inc.","Symbol":"RIVN","Current Price":"11.45","Latest MA":"12.72","Price Target":15.03536,"Difference from MA":"-9.99%","Difference from Open":"-4.02%","Change from Yesterday":"-4.26%","Change from Last Report":"0.00","Latest Volume":"35,827,052","Market Cap":"12,946,629,632","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":-4.178832,"PB Ratio":1.974819,"Previous Close":11.96,"ROE":-0.60447,"DTE":76.272,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":2.042,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":2.6049557,"Quick Ratio":3.618,"Day High":12.185,"Day Low":11.38,"VS Average Volume":1.004061107,"Company Summary":"Rivian Automotive, Inc., together with its subsidiaries, designs, develops, manufactures, and sells electric vehicles and accessories. The company offers consumer vehicles, including a two-row, five-passenger pickup truck under the R1T brand, a three-row, seven-passenger sport utility vehicle under the R1S name. It provides consumer services, such as digital financing and leasing, telematics-based insurance, vehicle maintenance and repair services, software services, and charging solutions. In addition, the company designs, develops, manufactures, and operates the Rivian Adventure Network Direct Current fast chargers, and offers access to Combined Charging Standard, as well as FleetOS, a proprietary, end-to-end centralized fleet management subscription platform. Further, it offers Rivian Commercial Van platform for Electric Delivery Van with collaboration with Amazon.com, Inc. The company sells its products directly to customers in the consumer and commercial markets. Rivian Automotive, Inc. was founded in 2009 and is based in Irvine, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:52:41"},{"Company Name":"Consolidated Edison, Inc.","Symbol":"ED","Current Price":"100.97","Latest MA":"96.76","Price Target":99.4,"Difference from MA":"4.35%","Difference from Open":"0.73%","Change from Yesterday":"1.29%","Change from Last Report":"0.00","Latest Volume":"3,481,344","Market Cap":"35,007,512,576","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":17.966192,"PB Ratio":1.5934664,"Previous Close":99.68,"ROE":0.08442,"DTE":126.714,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.381,"Trailing PEG":8.6674,"Trailing PE":19.269085,"Trailing PS":2.2946718,"Quick Ratio":0.816,"Day High":101.95,"Day Low":99.72,"VS Average Volume":1.4661432703,"Company Summary":"Consolidated Edison, Inc., through its subsidiaries, engages in the regulated electric, gas, and steam delivery businesses in the United States. It offers electric services to approximately 3.7 million customers in New York City and Westchester County; gas to approximately 1.1 million customers in Manhattan, the Bronx, parts of Queens, and Westchester County; and steam to approximately 1,530 customers in parts of Manhattan. The company also supplies electricity to approximately 0.3 million customers in southeastern New York and northern New Jersey; and gas to approximately 0.2 million customers in southeastern New York. In addition, it operates 545 circuit miles of transmission lines; 15 transmission substations; 63 distribution substations; 90,051 in-service line transformers; 3,788 pole miles of overhead distribution lines; and 2,314 miles of underground distribution lines, as well as 4,363 miles of mains and 380,870 service lines for natural gas distribution. Further, the company invests in electric and gas transmission projects. It primarily sells electricity to industrial, commercial, residential, and government customers. Consolidated Edison, Inc. was founded in 1823 and is based in New York, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"26-02-2025 12:52:41"},{"Company Name":"American Homes 4 Rent","Symbol":"AMH","Current Price":"35.34","Latest MA":"37.04","Price Target":40.15,"Difference from MA":"-4.58%","Difference from Open":"0.71%","Change from Yesterday":"1.61%","Change from Last Report":"0.00","Latest Volume":"3,275,859","Market Cap":"14,896,234,496","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":56.095238,"PB Ratio":1.8243766,"Previous Close":34.78,"ROE":0.060399998,"DTE":64.05,"Industry":"REIT - Residential","Sector":"Real Estate","Beta":0.786,"Trailing PEG":null,"Trailing PE":32.72222,"Trailing PS":8.61703,"Quick Ratio":0.477,"Day High":35.48,"Day Low":34.81,"VS Average Volume":1.4419821505,"Company Summary":"AMH (NYSE: AMH) is a leading large-scale integrated owner, operator and developer of single-family rental homes. We're an internally managed Maryland real estate investment trust (REIT) focused on acquiring, developing, renovating, leasing and managing homes as rental properties. Our goal is to simplify the experience of leasing a home and deliver peace of mind to households across the country. In recent years, we've been named one of Fortune's 2023 Best Workplaces in Real Estate, a 2024 Great Place to Work, a 2023 Most Loved Workplace, a 2023 Top U.S. Homebuilder by Builder100, and one of America's Most Responsible Companies 2024 and Most Trustworthy Companies in America 2024 by Newsweek and Statista Inc. As of March 31, 2024, we owned nearly 60,000 single-family properties in the Southeast, Midwest, Southwest and Mountain West regions of the United States.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"26-02-2025 12:52:41"},{"Company Name":"Live Nation Entertainment, Inc.","Symbol":"LYV","Current Price":"144.46","Latest MA":"120.12","Price Target":161.34332,"Difference from MA":"20.26%","Difference from Open":"-6.52%","Change from Yesterday":"-6.57%","Change from Last Report":"0.00","Latest Volume":"3,966,765","Market Cap":"33,386,584,064","Earning Date":"2025-02-20","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":59.694214,"PB Ratio":193.3869,"Previous Close":154.62,"ROE":0.67384005,"DTE":425.218,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.382,"Trailing PEG":4.648,"Trailing PE":52.72263,"Trailing PS":1.4418347,"Quick Ratio":0.838,"Day High":154.58,"Day Low":143.81,"VS Average Volume":1.9205284066,"Company Summary":"Live Nation Entertainment, Inc. operates as a live entertainment company worldwide. It operates through Concerts, Ticketing, and Sponsorship & Advertising segments. The Concerts segment promotes live music events in its owned or operated venues, and in rented third-party venues. This segment operates and manages music venues; produces music festivals; creates and streams associated content; and offers management and other services to artists. The Ticketing segment manages the ticketing operations, including the provision of ticketing software and services to clients and consumers with marketplace for tickets and event information through mobile apps, other websites, retail outlets, and its primary websites, such as livenation.com and ticketmaster.com; and provides ticket resale services. This segment sells tickets for its events and third-party clients in various live event categories. This segment offers ticketing services for arenas, stadiums, amphitheaters, music clubs, concert promoters, professional sports franchises and leagues, college sports teams, performing arts venues, museums, and theaters. The Sponsorship & Advertising segment sells international, national, and local sponsorships and placement of advertising, including signage, online, and promotional programs; rich media offering that comprises advertising related with live streaming and music-related content; and ads across its distribution network of venues, events, and websites. This segment also manages the development of strategic sponsorship programs, as well as develops, books, and produces custom events or programs for specific brands. It owns, operates, or leases entertainment venues. The company was formerly known as Live Nation, Inc. and changed its name to Live Nation Entertainment, Inc. in January 2010. Live Nation Entertainment, Inc. was incorporated in 2005 and is based in Beverly Hills, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"26-02-2025 12:52:41"}]