[{"Company Name":"NVIDIA Corporation","Symbol":"NVDA","Current Price":"144.41","Latest MA":"128.19","Latest MA 5":143.1090029297,"Latest MA 9":141.7838916016,"Latest MA 20":137.83925177,"RSI":70.847210998,"Price Target":172.11107,"Difference from MA":"12.65%","Difference from Open":"1.71%","Change from Yesterday":"1.11%","Change from Last Report":"0.08","Latest Volume":"102,375,991","Market Cap":"3,521,691,516,928","Earning Date":"27-08-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":35.04976,"PB Ratio":42.002617,"Previous Close":142.83,"ROE":1.15463,"DTE":12.267,"Industry":"Semiconductors","Sector":"Technology","Beta":2.122,"Trailing PEG":1.7709,"Trailing PE":46.58226,"Trailing PS":46.58226,"Quick Ratio":2.857,"Day High":145.0,"Day Low":141.87,"VS Average Volume":0.3926559485,"Company Summary":"NVIDIA Corporation, a computing infrastructure company, provides graphics and compute and networking solutions in the United States, Singapore, Taiwan, China, Hong Kong, and internationally. The Compute & Networking segment comprises Data Center computing platforms and end-to-end networking platforms, including Quantum for InfiniBand and Spectrum for Ethernet; NVIDIA DRIVE automated-driving platform and automotive development agreements; Jetson robotics and other embedded platforms; NVIDIA AI Enterprise and other software; and DGX Cloud software and services. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro\/NVIDIA RTX GPUs for enterprise workstation graphics; virtual GPU or vGPU software for cloud-based visual and virtual computing; automotive platforms for infotainment systems; and Omniverse software for building and operating industrial AI and digital twin applications. It also customized agentic solutions designed in collaboration with NVIDIA to accelerate enterprise AI adoption. The company's products are used in gaming, professional visualization, data center, and automotive markets. It sells its products to original equipment manufacturers, original device manufacturers, system integrators and distributors, independent software vendors, cloud service providers, consumer internet companies, add-in board manufacturers, distributors, automotive manufacturers and tier-1 automotive suppliers, and other ecosystem participants. NVIDIA Corporation was incorporated in 1993 and is headquartered in Santa Clara, California.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:24:15"},{"Company Name":"Broadcom Inc.","Symbol":"AVGO","Current Price":"254.88","Latest MA":"204.48","Latest MA 5":248.72616,"Latest MA 9":252.2445324517,"Latest MA 20":242.0930390234,"RSI":66.5425727234,"Price Target":279.93256,"Difference from MA":"24.65%","Difference from Open":"1.89%","Change from Yesterday":"0.78%","Change from Last Report":"-0.14","Latest Volume":"11,234,061","Market Cap":"1,198,436,777,984","Earning Date":"05-06-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":41.309692,"PB Ratio":4.303892,"Previous Close":252.91,"ROE":0.18977,"DTE":166.032,"Industry":"Semiconductors","Sector":"Technology","Beta":1.122,"Trailing PEG":1.4936,"Trailing PE":93.36293,"Trailing PS":93.36293,"Quick Ratio":0.73,"Day High":257.89,"Day Low":249.5,"VS Average Volume":0.4032446987,"Company Summary":"Broadcom Inc. designs, develops, and supplies various semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products worldwide. The company operates in two segments, Semiconductor Solutions and Infrastructure Software. It provides Ethernet switching and routing custom silicon solutions, optical and copper physical layer devices, and fiber optic transmitter and receiver components; set-top box system-on-chips (SoCs), data over cable service interface specifications cable modem and networking infrastructure, DSL access multiplexer\/PON optical line termination products, and Wi-Fi access point SoCs, as well as digital subscriber line (DSL)\/cable, passive optical networking (PON) gateways; and fiber optic components and mobile device connectivity solutions. The company also offers RF front end modules and filters; Wi-Fi, Bluetooth, and global positioning system\/global navigation satellite system SoCs; custom touch controllers; inductive charging application specific integrated circuits; serial attached small computer system interface and redundant array of independent disks controllers and adapters, peripheral component interconnect express switches, fiber channel host bus adapters, read channel based SoCs, custom flash controllers, and preamplifiers; and optocouplers, industrial fiber optics, industrial and medical sensors, motion control encoders and subsystems, light emitting diodes, ethernet PHYs, switch ICs, and camera microcontrollers. Its products are used in various applications in enterprise and data center networking, including artificial intelligence networking and connectivity, home connectivity, set-top boxes, broadband access, telecommunication equipment, smartphones and base stations, data center servers and storage systems, factory automation, power generation and alternative energy systems, and electronic displays. Broadcom Inc. was founded in 1961 and is headquartered in Palo Alto, California.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:24:15"},{"Company Name":"Exxon Mobil Corporation","Symbol":"XOM","Current Price":"109.64","Latest MA":"108.73","Latest MA 5":107.0809993286,"Latest MA 9":105.1538897366,"Latest MA 20":104.742750824,"RSI":76.7387738011,"Price Target":123.64538,"Difference from MA":"0.83%","Difference from Open":"0.66%","Change from Yesterday":"0.30%","Change from Last Report":"-0.08","Latest Volume":"7,792,808","Market Cap":"472,487,395,328","Earning Date":"02-05-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.93075,"PB Ratio":1.798445,"Previous Close":109.31,"ROE":0.14302,"DTE":13.918,"Industry":"Oil & Gas Integrated","Sector":"Energy","Beta":0.463,"Trailing PEG":5.6843,"Trailing PE":14.540451,"Trailing PS":14.540451,"Quick Ratio":0.858,"Day High":110.19,"Day Low":108.22,"VS Average Volume":0.4490998763,"Company Summary":"Exxon Mobil Corporation engages in the exploration and production of crude oil and natural gas in the United States, Canada, the United Kingdom, Singapore, France, and internationally. It operates through Upstream, Energy Products, Chemical Products, and Specialty Products segments. The Upstream segment explores for and produces crude oil and natural gas. The Energy Products segment offers fuels, aromatics, and catalysts, as well as licensing services. The Chemical Products segment manufactures and sells petrochemicals, including olefins, polyolefins, and intermediates. The Specialty Products segment offers performance products, including finished lubricants, basestocks, waxes, synthetics, elastomers, and resins. The company is involved in the manufacture, trading, transportation, and sale of crude oil, natural gas, petroleum products, petrochemicals, and other specialty products; and pursuit of lower-emission and business opportunities, including carbon capture and storage, hydrogen, lower-emission fuels, Proxxima systems, carbon materials, and lithium. It sells its products under the Exxon, Esso, and Mobil brands. Exxon Mobil Corporation was founded in 1870 and is headquartered in Spring, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:24:15"},{"Company Name":"International Business Machines","Symbol":"IBM","Current Price":"281.09","Latest MA":"239.04","Latest MA 5":275.9599921875,"Latest MA 9":271.2533268229,"Latest MA 20":266.4584978027,"RSI":84.5037825199,"Price Target":253.272,"Difference from MA":"17.59%","Difference from Open":"-0.16%","Change from Yesterday":"-0.15%","Change from Last Report":"0.12","Latest Volume":"1,487,764","Market Cap":"261,244,190,720","Earning Date":"23-07-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":26.492931,"PB Ratio":9.718899,"Previous Close":281.52,"ROE":0.21851,"DTE":247.978,"Industry":"Information Technology Services","Sector":"Technology","Beta":0.652,"Trailing PEG":2.1307,"Trailing PE":47.967575,"Trailing PS":47.967575,"Quick Ratio":0.849,"Day High":283.0478,"Day Low":279.83,"VS Average Volume":0.3265135745,"Company Summary":"International Business Machines Corporation, together with its subsidiaries, provides integrated solutions and services in the United States, Europe, the Middle East, Africa, Asia Pacific, and internationally. It operates through Software, Consulting, Infrastructure, and Financing segments. The Software segment offers hybrid cloud and AI platforms that allows clients to realize their digital and AI transformations across the applications, data, and environments in which they operate. Its Consulting segment focuses on skills integration for strategy, experience, technology, and operations by domain and industry. The Infrastructure segment provides on-premises and cloud based server, and storage solutions, as well as life-cycle services for hybrid cloud infrastructure deployment. Its Financing segment offers client and commercial financing, facilitates IBM clients' acquisition of hardware, software, and services. It has a strategic partnership to various companies including hyperscalers, service providers, global system integrators, and software and hardware vendors that includes Adobe, Amazon Web services, Microsoft, Oracle, Salesforce, Samsung Electronics and SAP, and others. The company was formerly known as Computing-Tabulating-Recording Co. International Business Machines Corporation was incorporated in 1911 and is headquartered in Armonk, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:24:15"},{"Company Name":"Linde plc","Symbol":"LIN","Current Price":"470.53","Latest MA":"447.97","Latest MA 5":471.9020021973,"Latest MA 9":470.7725627984,"Latest MA 20":464.4265930786,"RSI":56.3295487638,"Price Target":491.68582,"Difference from MA":"5.04%","Difference from Open":"0.52%","Change from Yesterday":"0.42%","Change from Last Report":"-0.02","Latest Volume":"679,094","Market Cap":"221,489,758,208","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":27.75988,"PB Ratio":5.830824,"Previous Close":468.54,"ROE":0.17013,"DTE":60.555,"Industry":"Specialty Chemicals","Sector":"Basic Materials","Beta":0.979,"Trailing PEG":2.5941,"Trailing PE":34.145863,"Trailing PS":34.145863,"Quick Ratio":0.727,"Day High":472.06,"Day Low":466.77,"VS Average Volume":0.3092697962,"Company Summary":"Linde plc operates as an industrial gas company in the United States, China, Germany, the United Kingdom, Australia, Mexico, Brazil, and internationally. It offers atmospheric gases, including oxygen, nitrogen, argon, and rare gases; and process gases, such as hydrogen, helium, carbon dioxide, carbon monoxide, electronic gases, specialty gases, acetylene, etc. The company also designs and constructs turnkey process plants for third-party customers, as well as for the gas businesses in various locations consist of air separation, hydrogen, synthesis, olefin, and natural gas plants. It serves a range of industries comprising healthcare, chemicals and energy, manufacturing, metals and mining, food and beverage, and electronics. Linde plc was founded in 1879 and is based in Woking, the United Kingdom.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:24:15"},{"Company Name":"McDonald's Corporation","Symbol":"MCD","Current Price":"301.16","Latest MA":"299.69","Latest MA 5":303.0899956055,"Latest MA 9":306.7855559625,"Latest MA 20":310.7211988525,"RSI":24.2914202979,"Price Target":328.75394,"Difference from MA":"0.49%","Difference from Open":"-0.17%","Change from Yesterday":"-0.19%","Change from Last Report":"0.17","Latest Volume":"1,174,590","Market Cap":"215,339,352,064","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":23.882633,"PB Ratio":-62.33906,"Previous Close":301.72,"ROE":null,"DTE":null,"Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":0.556,"Trailing PEG":2.6852,"Trailing PE":26.55732,"Trailing PS":26.55732,"Quick Ratio":0.904,"Day High":302.39,"Day Low":300.07,"VS Average Volume":0.3330920055,"Company Summary":"McDonald's Corporation owns, operates, and franchises restaurants under the McDonald's brand in the United States and internationally. It offers food and beverages, including hamburgers and cheeseburgers, various chicken sandwiches, fries, shakes, desserts, sundaes, soft serve cones, cookies, pies, soft drinks, coffee, and other beverages; and full or limited breakfast, as well as sells various other products during limited-time promotions. The company owns and operates franchised restaurants under various structures, including conventional franchise, developmental license, or affiliate. McDonald's Corporation was founded in 1940 and is based in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:24:15"},{"Company Name":"Caterpillar, Inc.","Symbol":"CAT","Current Price":"361.63","Latest MA":"351.90","Latest MA 5":358.9520070801,"Latest MA 9":354.1244467502,"Latest MA 20":351.2240018311,"RSI":72.4551164588,"Price Target":370.604,"Difference from MA":"2.76%","Difference from Open":"0.49%","Change from Yesterday":"-0.42%","Change from Last Report":"0.09","Latest Volume":"785,731","Market Cap":"170,080,026,624","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":16.326412,"PB Ratio":9.428497,"Previous Close":363.14,"ROE":0.55646,"DTE":213.547,"Industry":"Farm & Heavy Construction Machinery","Sector":"Industrials","Beta":1.368,"Trailing PEG":1.8763,"Trailing PE":17.623295,"Trailing PS":17.623295,"Quick Ratio":0.693,"Day High":361.72,"Day Low":357.87,"VS Average Volume":0.2750107452,"Company Summary":"Caterpillar Inc. manufactures and sells construction and mining equipment, off-highway diesel and natural gas engines, industrial gas turbines, and diesel-electric locomotives in the United States and internationally. Its Construction Industries segment offers asphalt pavers, cold planers, compactors, forestry machines, material handlers, motor graders, pipelayers, road reclaimers, telehandlers, track-type tractors, and track and wheel excavators; compact track, wheel, track-type, backhoe, and skid steer loaders; and related parts and tools. The company's Resource Industries segment provides electric rope and hydraulic shovels, draglines, rotary drills, hard rock vehicles, tractors, mining trucks, wheel loaders, off-highway and articulated trucks, wide-body trucks, wheel tractor scrapers and dozers, fleet management products, landfill and soil compactors, machinery components, autonomous ready vehicles and solutions, work tools, and safety services and mining performance solutions, as well as related parts and services. Its Energy & Transportation segment offers reciprocating engine powered generator sets; reciprocating engines, drivetrain, and integrated systems and solutions; turbines, centrifugal gas compressors, and related services; and diesel-electric locomotives and components, and other rail-related products. The company's Financial Products segment provides operating and finance leases, installment sale contracts, revolving charge accounts, repair\/rebuild financing services, working capital loans, and wholesale financing; and insurance and risk management products and services. Its All Other segment offers wear and maintenance components; parts distribution; logistics solutions and distribution services; dealer portfolio management, and brand management and marketing strategy services; and digital investment services. Caterpillar Inc. was founded in 1925 and is headquartered in Irving, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:24:15"},{"Company Name":"TJX Companies, Inc. (The)","Symbol":"TJX","Current Price":"124.61","Latest MA":"123.23","Latest MA 5":125.9959990234,"Latest MA 9":126.8855547757,"Latest MA 20":128.6384986572,"RSI":31.5175524405,"Price Target":139.16422,"Difference from MA":"1.12%","Difference from Open":"0.11%","Change from Yesterday":"0.06%","Change from Last Report":"0.05","Latest Volume":"1,585,500","Market Cap":"139,017,404,416","Earning Date":"20-08-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":27.08913,"PB Ratio":16.353018,"Previous Close":124.53,"ROE":0.60356,"DTE":153.616,"Industry":"Apparel Retail","Sector":"Consumer Cyclical","Beta":0.903,"Trailing PEG":2.8222,"Trailing PE":29.32,"Trailing PS":29.32,"Quick Ratio":0.452,"Day High":124.94,"Day Low":123.565,"VS Average Volume":0.2647810626,"Company Summary":"The TJX Companies, Inc., together with its subsidiaries, operates as an off-price apparel and home fashions retailer worldwide. The company operates through four segments: Marmaxx, HomeGoods, TJX Canada, and TJX International. It offers family apparel comprising footwear; accessories, such as beauty and jewelry; home fashion products, including home basics, decorative accessories and giftware, as well as furniture, rugs, lighting, soft home, decorative accessories, tabletop, and cookware; pet and gourmet food; and other merchandise. The company also provides home decor, furniture, and seasonal home merchandise. It sells its products through stores and e-commerce sites. The TJX Companies, Inc. was incorporated in 1962 and is headquartered in Framingham, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:24:15"},{"Company Name":"CrowdStrike Holdings, Inc.","Symbol":"CRWD","Current Price":"486.22","Latest MA":"387.38","Latest MA 5":472.7300046387,"Latest MA 9":472.7866718207,"Latest MA 20":460.9205016479,"RSI":67.4460288122,"Price Target":472.82553,"Difference from MA":"25.52%","Difference from Open":"2.57%","Change from Yesterday":"1.94%","Change from Last Report":"-0.09","Latest Volume":"2,281,753","Market Cap":"121,189,359,616","Earning Date":"03-06-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":113.86885,"PB Ratio":35.093468,"Previous Close":476.98,"ROE":-0.05738,"DTE":22.498,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.158,"Trailing PEG":5.4512,"Trailing PE":null,"Trailing PS":null,"Quick Ratio":1.652,"Day High":488.736,"Day Low":473.0,"VS Average Volume":0.5675933303,"Company Summary":"CrowdStrike Holdings, Inc. provides cybersecurity solutions in the United States and internationally. Its unified platform provides cloud-delivered protection of endpoints, cloud workloads, identity, and data through a software as a service (SaaS) subscription-based model. The company offers corporate endpoint and cloud workload security, managed security, security and vulnerability management, IT operations management, identity protection, threat intelligence, data protection, SaaS security posture management, and AI powered workflow automation, and securing generative AI workload services, as well as security orchestration, automation, and response; and security information and event management, and log management services. It primarily sells subscriptions to its Falcon platform and cloud modules. CrowdStrike Holdings, Inc. was incorporated in 2011 and is headquartered in Austin, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:24:15"},{"Company Name":"Lockheed Martin Corporation","Symbol":"LMT","Current Price":"466.48","Latest MA":"472.81","Latest MA 5":472.4999978027,"Latest MA 9":475.7477777778,"Latest MA 20":472.0520899048,"RSI":42.9568534247,"Price Target":525.45685,"Difference from MA":"-1.34%","Difference from Open":"2.01%","Change from Yesterday":"2.16%","Change from Last Report":"0.10","Latest Volume":"1,026,667","Market Cap":"109,294,403,584","Earning Date":"22-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":16.594807,"PB Ratio":16.263859,"Previous Close":456.6,"ROE":0.82547,"DTE":303.816,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":0.293,"Trailing PEG":1.6572,"Trailing PE":20.106895,"Trailing PS":20.106895,"Quick Ratio":0.873,"Day High":467.28,"Day Low":456.604,"VS Average Volume":0.6610918185,"Company Summary":"Lockheed Martin Corporation, an aerospace and defense company, engages in the research, design, development, manufacture, integration, and sustainment of technology systems, products, and services worldwide. The company operates through four segments: Aeronautics; Missiles and Fire Control (MFC); Rotary and Mission Systems (RMS); and Space. The Aeronautics segment offers combat and air mobility aircraft, unmanned air vehicles, and related technologies. The MFC segment provides air and missile defense systems; tactical missiles and precision strike weapon systems; logistics; fire control systems; mission operations support, readiness, engineering support, and integration services; ground vehicles; and energy management solutions. The RMS segment offers military and commercial helicopters, surface ships, sea and land-based missile defense systems, radar and laser systems, sea and air-based mission and combat systems, command and control mission solutions, cyber solutions, simulation and training solutions, and services and supports surface ships. The Space segment provides satellites; space transportation systems; strategic, advanced strike, and defensive systems; and classified systems and services in support of national security systems. This segment also provides network-enabled situational awareness and integrates space and ground global systems to help its customers gather, analyze, and securely distribute critical intelligence data. It serves primarily serves the U.S. government and international customers, as well as foreign military sales contracted through the U.S. government. The company was formerly known as The Lockheed Corporation and changed its name to Lockheed Martin Corporation in March 1995. Lockheed Martin Corporation was founded in 1912 and is based in Bethesda, Maryland.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:24:15"},{"Company Name":"Intercontinental Exchange Inc.","Symbol":"ICE","Current Price":"178.83","Latest MA":"163.39","Latest MA 5":177.3019985352,"Latest MA 9":178.206666531,"Latest MA 20":177.3754996338,"RSI":59.1119455392,"Price Target":192.6875,"Difference from MA":"9.45%","Difference from Open":"1.03%","Change from Yesterday":"0.75%","Change from Last Report":"0.05","Latest Volume":"689,137","Market Cap":"102,581,534,720","Earning Date":"31-07-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":26.532642,"PB Ratio":3.6694367,"Previous Close":177.5,"ROE":0.10421,"DTE":73.534,"Industry":"Financial Data & Stock Exchanges","Sector":"Financial Services","Beta":1.129,"Trailing PEG":2.9217,"Trailing PE":37.024845,"Trailing PS":37.024845,"Quick Ratio":0.029,"Day High":178.97,"Day Low":176.99,"VS Average Volume":0.2100393479,"Company Summary":"Intercontinental Exchange, Inc., together with its subsidiaries, provides technology and data to financial institutions, corporations, and government entities in the United States, the United Kingdom, the European Union, India, Israel, Canada, and Singapore. It operates through three segments: Exchanges, Fixed Income and Data Services, and Mortgage Technology. The Exchanges segment operates regulated marketplace technology for the listing, trading, and clearing of an array of derivatives contracts and financial securities, as well as data and connectivity services related to its exchanges and clearing houses. The Fixed Income and Data Services segment provides fixed income pricing, reference data, indices, analytics, and execution services, as well as global CDS clearing and multi-asset class data delivery technology. The Mortgage Technology segment offers a technology platform that provides customers comprehensive and digital workflow tools to address inefficiencies and mitigate risks that exist in the U.S. residential mortgage market life cycle from application through closing, servicing, and the secondary market. The company was founded in 2000 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:24:15"},{"Company Name":"Waste Management, Inc.","Symbol":"WM","Current Price":"235.98","Latest MA":"222.54","Latest MA 5":234.9160012207,"Latest MA 9":236.7868707954,"Latest MA 20":235.2018038025,"RSI":52.7861489821,"Price Target":248.18681,"Difference from MA":"6.04%","Difference from Open":"0.49%","Change from Yesterday":"0.72%","Change from Last Report":"0.04","Latest Volume":"460,175","Market Cap":"94,960,238,592","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":29.241636,"PB Ratio":10.976835,"Previous Close":234.29,"ROE":0.34013999,"DTE":275.54,"Industry":"Waste Management","Sector":"Industrials","Beta":0.668,"Trailing PEG":3.0546,"Trailing PE":35.59276,"Trailing PS":35.59276,"Quick Ratio":0.711,"Day High":236.3862,"Day Low":234.3625,"VS Average Volume":0.2600064412,"Company Summary":"Waste Management, Inc., through its subsidiaries, provides environmental solutions to residential, commercial, industrial, and municipal customers in the United States, Canada, Western Europe, and internationally. It offers collection services, including picking up and transporting waste and recyclable materials from where it was generated to a transfer station, recovery facility, or disposal site; owns and operates transfer stations; and owns, develops, and operates landfill gas-to-energy facilities that produce renewable electricity and renewable natural gas. It also operates materials processing and commodities recycling services, including cardboard, paper, glass, metals, plastics, construction and demolition materials, and other recycling commodities are recovered for resale or redirected for other purposes; recycling brokerage services, such as managing the marketing of recyclable materials for third parties; and other strategic business solutions. In addition, the company collects recyclable food and yard waste, as well as markets and sells mulch, compost, soil amendments, and renewable energy; offers remediation and construction, and industrial waste services; and manages and markets fly ash. Further, it provides Regulated Waste and Compliance Services (RWCS), which offers compliance programs, as well as collection, processing, and disposal of regulated and specialized waste, including medical, pharmaceutical, and hazardous waste; and Secure Information Destruction (SID) services that includes the collection of personal and confidential information for secure destruction and recycling of sorted office paper. The company was formerly known as USA Waste Services, Inc. and changed its name to Waste Management, Inc. in 1998. Waste Management, Inc. was founded in 1968 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:24:15"},{"Company Name":"Intel Corporation","Symbol":"INTC","Current Price":"20.94","Latest MA":"21.57","Latest MA 5":20.8486198474,"Latest MA 9":20.5014555216,"Latest MA 20":20.619154836,"RSI":54.2336955614,"Price Target":21.29,"Difference from MA":"-2.91%","Difference from Open":"2.16%","Change from Yesterday":"1.28%","Change from Last Report":"-0.06","Latest Volume":"44,825,958","Market Cap":"91,353,800,704","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":21.590824,"PB Ratio":0.9157856,"Previous Close":20.68,"ROE":-0.18127,"DTE":47.129,"Industry":"Semiconductors","Sector":"Technology","Beta":1.113,"Trailing PEG":null,"Trailing PE":null,"Trailing PS":null,"Quick Ratio":0.749,"Day High":20.98,"Day Low":20.41,"VS Average Volume":0.478054667,"Company Summary":"Intel Corporation designs, develops, manufactures, markets, and sells computing and related products and services worldwide. The company offers microprocessor and chipset, stand-alone SoC, and multichip package; Computer Systems and Devices; hardware products comprising CPUs, graphics processing units (GPUs), accelerators, and field programmable gate arrays (FPGAs); and memory and storage, connectivity and networking, and other semiconductor products. It also offers silicon and software products; and optimization solutions for workloads, such as AI, cryptography, security, storage, networking, and leverages various features supporting diverse compute environments. In addition, the company provides driving assistance and self-driving solutions; advanced process technologies enabled by an ecosystem of electronic design automation tools, intellectual property, and design services, as well as systems of chips, including advanced packaging technologies, software, and system. Further, it delivers and deploys intelligent edge platforms that allow developers to achieve agility and drive automation using AI for efficient operations with data integrity, as well as provides hardware and software platforms, tools, and ecosystem partnerships for digital transformation from the cloud to edge. The company serves original equipment manufacturers, original design manufacturers, cloud service providers, and other manufacturers and service providers. Intel Corporation was incorporated in 1968 and is headquartered in Santa Clara, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:24:15"},{"Company Name":"Duke Energy Corporation (Holdin","Symbol":"DUK","Current Price":"116.78","Latest MA":"113.44","Latest MA 5":116.0310009766,"Latest MA 9":116.203890313,"Latest MA 20":116.189500351,"RSI":55.8334535554,"Price Target":127.07667,"Difference from MA":"2.94%","Difference from Open":"-0.00%","Change from Yesterday":"0.37%","Change from Last Report":"0.12","Latest Volume":"751,949","Market Cap":"90,764,189,696","Earning Date":"06-05-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":18.41877,"PB Ratio":1.8257505,"Previous Close":116.35,"ROE":0.09478,"DTE":168.902,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.358,"Trailing PEG":2.9291,"Trailing PE":19.365671,"Trailing PS":19.365671,"Quick Ratio":0.303,"Day High":117.585,"Day Low":116.44,"VS Average Volume":0.1871496151,"Company Summary":"Duke Energy Corporation, through its subsidiaries, operates as an energy company in the United States. It operates through two segments: Electric Utilities and Infrastructure (EU&I); and Gas Utilities and Infrastructure (GU&I). The EU&I segment generates, transmits, distributes, and sells electricity to approximately 8.6 million customers in the Southeast and Midwest regions. It generates electricity through coal, hydroelectric, natural gas, oil, renewables, and nuclear fuel. This segment also engages in the wholesale of electricity to municipalities, electric cooperative utilities, and other load-serving entities. The GU&I segment distributes natural gas to approximately 1.7 million customers in the residential, commercial, industrial, and power generation natural gas sectors; and invests in pipeline transmission projects, renewable natural gas projects, and natural gas storage facilities. The company was formerly known as Duke Energy Holding Corp. and changed its name to Duke Energy Corporation in April 2006. Duke Energy Corporation was founded in 1904 and is headquartered in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:24:15"},{"Company Name":"General Dynamics Corporation","Symbol":"GD","Current Price":"278.40","Latest MA":"268.02","Latest MA 5":277.0780180469,"Latest MA 9":276.2877891602,"Latest MA 20":277.2395072583,"RSI":58.3001350461,"Price Target":293.484,"Difference from MA":"3.87%","Difference from Open":"1.16%","Change from Yesterday":"0.93%","Change from Last Report":"-0.01","Latest Volume":"292,870","Market Cap":"74,721,468,416","Earning Date":"23-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":17.313438,"PB Ratio":3.3569682,"Previous Close":275.83,"ROE":0.18228,"DTE":51.775,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":0.467,"Trailing PEG":2.0723,"Trailing PE":19.33334,"Trailing PS":19.33334,"Quick Ratio":0.729,"Day High":278.543,"Day Low":274.9151,"VS Average Volume":0.2150860616,"Company Summary":"General Dynamics Corporation operates as an aerospace and defense company worldwide. It operates through four segments: Aerospace, Marine Systems, Combat Systems, and Technologies. The Aerospace segment produces and sells business jets; and offers aircraft maintenance and repair, management, aircraft-on-ground support and completion, charter, staffing, and fixed-base operator services. The Marine Systems segment designs and builds nuclear-powered submarines, surface combatants, and auxiliary ships for the United States Navy and Jones Act ships for commercial customers, as well as builds crude oil and product tankers, and container and cargo ships; provides maintenance, modernization, and lifecycle support services for navy ships; offers and program management, planning, engineering, and design support services for submarine construction programs. The Combat Systems segment manufactures land combat solutions, such as wheeled and tracked combat vehicles, Stryker wheeled combat vehicles, piranha vehicles, weapons systems, munitions, mobile bridge systems with payloads, tactical vehicles, main battle tanks, and armored vehicles; and offers modernization programs, engineering, support, and sustainment services. The Technologies segment provides information technology solutions and mission support services; mobile communication, computers, and command-and-control mission systems; intelligence, surveillance, and reconnaissance solutions to military, intelligence, and federal civilian customers; cloud services, cybersecurity, network modernization, artificial intelligence; machine learning; application development, high-performance computing, and 5G and next-generation wireless communications services; and unmanned undersea vehicle manufacturing and assembly services. The company was founded in 1899 and is headquartered in Reston, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:24:15"},{"Company Name":"Paychex, Inc.","Symbol":"PAYX","Current Price":"153.12","Latest MA":"146.08","Latest MA 5":155.8439981689,"Latest MA 9":157.0677766927,"Latest MA 20":156.9829989014,"RSI":29.8694946868,"Price Target":147.95866,"Difference from MA":"4.82%","Difference from Open":"-0.73%","Change from Yesterday":"-0.60%","Change from Last Report":"-0.10","Latest Volume":"546,739","Market Cap":"55,152,443,392","Earning Date":"26-03-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":28.945179,"PB Ratio":13.397497,"Previous Close":154.045,"ROE":0.44254002,"DTE":20.981,"Industry":"Software - Application","Sector":"Technology","Beta":0.911,"Trailing PEG":6.9464,"Trailing PE":31.83368,"Trailing PS":31.83368,"Quick Ratio":0.598,"Day High":154.26,"Day Low":151.39,"VS Average Volume":0.2703581161,"Company Summary":"Paychex, Inc., together with its subsidiaries, provides integrated human capital management solutions (HCM) for payroll, benefits, human resources (HR), and insurance services for small to medium-sized businesses in the United States, Europe, and India. It offers payroll processing services; payroll tax administration services; employee payment services; and regulatory compliance services, such as new-hire reporting and garnishment processing. The company also provides HR solutions, including integrated HCM technology solutions and HR advisory services through both virtual and on-site availability of a professionally trained HR representative, as well as HR support to non-payroll clients through its HR Partner Plus solution; and retirement services administration, such as plan implementation, ongoing compliance with government regulations, employee and employer reporting, participant and employer online access, electronic funds transfer, and other administrative services. In addition, it offers cloud-based HR administration software products for employee benefits management and administration, time and attendance, digital communication solutions, recruiting, and onboarding solutions; plan administration outsourcing and state unemployment insurance services; various business services to small to medium-sized businesses comprising payroll funding and outsourcing services, which include payroll processing, invoicing, and tax preparation; and payment processing services, financial fitness programs, and a small-business loan resource center. Further, the company provides insurance services for property and casualty coverage, such as workers' compensation, business-owner policies, cyber security protection, and commercial auto, as well as health and benefits coverage, including health, dental, vision, and life. It markets and sells its services primarily through its direct sales force. The company was founded in 1971 and is headquartered in Rochester, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"12-06-2025 20:24:15"},{"Company Name":"MetLife, Inc.","Symbol":"MET","Current Price":"78.75","Latest MA":"80.28","Latest MA 5":79.3281014038,"Latest MA 9":79.1122780151,"Latest MA 20":79.0865255493,"RSI":47.2188819476,"Price Target":92.71429,"Difference from MA":"-1.90%","Difference from Open":"0.86%","Change from Yesterday":"-0.20%","Change from Last Report":"-0.01","Latest Volume":"800,370","Market Cap":"52,865,052,672","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.126987,"PB Ratio":1.9285523,"Previous Close":78.91,"ROE":0.15982,"DTE":172.754,"Industry":"Insurance - Life","Sector":"Financial Services","Beta":0.839,"Trailing PEG":1.0914,"Trailing PE":12.867729,"Trailing PS":12.867729,"Quick Ratio":1.338,"Day High":78.79,"Day Low":77.73,"VS Average Volume":0.2297135447,"Company Summary":"MetLife, Inc., a financial services company, provides insurance, annuities, employee benefits, and asset management services worldwide. It operates in six segments: Group Benefits; Retirement and Income Solutions; Asia; Latin America; Europe, the Middle East and Africa; and MetLife Holdings. The company offers life, dental, group short-and long-term disability, paid family and medical leave, individual disability, accidental death and dismemberment, accident and health, vision, and pet insurance, as well as prepaid legal plans; administrative services-only arrangements to employers; and general and separate account, and synthetic guaranteed interest contracts, as well as private floating rate funding agreements. It also provides pension risk transfers, institutional income annuities, structured settlements, and capital markets investment products; and other products and services, such as life insurance products and funding agreements for funding postretirement benefits, as well as company, bank, or trust-owned life insurance used to finance nonqualified benefit programs for executives. In addition, it offers fixed, indexed-linked, and variable annuities; pension products; regular savings products; whole and term life, endowments, universal and variable life, and group life products; longevity and funded reinsurance solutions; credit insurance products; accident & health products covering hospitalization, cancer, critical illness, income protection, and scheduled medical reimbursement plans; and protection against long-term health care services. MetLife, Inc. was incorporated in 1999 and is based in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:24:15"},{"Company Name":"Marathon Petroleum Corporation","Symbol":"MPC","Current Price":"164.78","Latest MA":"146.52","Latest MA 5":162.4948004883,"Latest MA 9":160.928223036,"Latest MA 20":160.7092027466,"RSI":67.79113958,"Price Target":166.303,"Difference from MA":"12.47%","Difference from Open":"1.28%","Change from Yesterday":"0.08%","Change from Last Report":"-0.07","Latest Volume":"564,447","Market Cap":"50,623,954,944","Earning Date":"05-08-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.155294,"PB Ratio":3.1055577,"Previous Close":164.66,"ROE":0.15524,"DTE":139.332,"Industry":"Oil & Gas Refining & Marketing","Sector":"Energy","Beta":0.868,"Trailing PEG":2.8,"Trailing PE":22.69752,"Trailing PS":22.69752,"Quick Ratio":0.701,"Day High":165.16,"Day Low":161.909,"VS Average Volume":0.2069603886,"Company Summary":"Marathon Petroleum Corporation, together with its subsidiaries, operates as an integrated downstream energy company in the United States. The company operates through three segments: Refining & Marketing; Midstream; and Renewable Diesel. The Refining & Marketing segment refines crude oil and other feedstocks at its refineries in the Gulf Coast, Mid-Continent, and West Coast regions of the United States; and purchases refined products and ethanol for resale and distributes refined products through transportation, storage, distribution, and marketing services. Its refined products include transportation fuels, such as reformulated gasolines and blend-grade gasolines; heavy fuel oil; and asphalt. This segment also manufactures propane and petrochemicals. It sells refined products to wholesale marketing customers in the United States and internationally, buyers on the spot market, and independent entrepreneurs who operate primarily Marathon branded outlets, as well as through long-term fuel supply contracts to direct dealer locations primarily under the ARCO brand. The Midstream segment gathers, transports, stores, distributes, and markets crude oil and refined products, including renewable diesel and other hydrocarbon-based products through refining logistics assets, pipelines, terminals, towboats, and barges; gathers, processes, and transports natural gas; and transports, fractionates, stores, and markets natural gas liquids. The Renewable Diesel segment processes renewable feedstocks into renewable diesel, markets, and distributes renewable diesel through its Midstream segment and third parties. It sells renewable diesel to wholesale marketing customers, buyers on the spot market, and through long-term supply contracts to direct dealers under the ARCO brand. Marathon Petroleum Corporation was founded in 1887 and is headquartered in Findlay, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:24:15"},{"Company Name":"Nasdaq, Inc.","Symbol":"NDAQ","Current Price":"86.87","Latest MA":"78.60","Latest MA 5":86.1980005493,"Latest MA 9":85.1855558946,"Latest MA 20":83.4900000153,"RSI":88.7899459014,"Price Target":84.22222,"Difference from MA":"10.52%","Difference from Open":"0.31%","Change from Yesterday":"0.09%","Change from Last Report":"-0.05","Latest Volume":"1,017,412","Market Cap":"49,873,977,344","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":27.665606,"PB Ratio":4.3182383,"Previous Close":86.79,"ROE":0.11415,"DTE":84.587,"Industry":"Financial Data & Stock Exchanges","Sector":"Financial Services","Beta":1.013,"Trailing PEG":1.7527,"Trailing PE":39.307693,"Trailing PS":39.307693,"Quick Ratio":0.212,"Day High":87.07,"Day Low":85.935,"VS Average Volume":0.2842911304,"Company Summary":"Nasdaq, Inc. operates as a technology company that serves capital markets and other industries worldwide. It operates in three segments: Capital Access Platforms, Financial Technology, and Market Services. The company distributes historical and real-time market data; develops and licenses Nasdaq-branded indices and financial products; investor relations intelligence, governance solutions, and sustainability solution products for public and private companies and organizations; and insights and workflow solutions, as well as operates listing platforms. It also offers Verafin, a cloud-based platform to detect, investigate, and report money laundering and financial frauds; AxiomSL, a risk data management and regulatory reporting solution; surveillance solutions, including a SaaS platform to assist in complying with market rules, regulations, and internal market surveillance policies; Calypso, a platform providing cross-asset, front-to-back trading, treasury, risk, and collateral management solutions; and handles assets comprising cash equities, equity derivatives, currencies, various interest-bearing securities, commodities, energy products, and digital currencies; and trade management and colocation services. In addition, the company provides equity derivative trading and clearing, cash equity trading, fixed income and commodities trading and clearing, and currency trading services; and operates various exchanges, including derivatives, commodities, cash equity, debt, structured products, and exchange traded products; and clearing, settlement, and central depository services. The company was formerly known as The NASDAQ OMX Group, Inc. and changed its name to Nasdaq, Inc. in September 2015. Nasdaq, Inc. was founded in 1971 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:24:15"},{"Company Name":"L3Harris Technologies, Inc.","Symbol":"LHX","Current Price":"248.07","Latest MA":"220.02","Latest MA 5":245.8420198779,"Latest MA 9":244.3033448513,"Latest MA 20":239.7004410352,"RSI":77.8562509163,"Price Target":261.1159,"Difference from MA":"12.75%","Difference from Open":"0.74%","Change from Yesterday":"0.57%","Change from Last Report":"0.00","Latest Volume":"534,253","Market Cap":"46,375,710,720","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":17.239061,"PB Ratio":2.4325128,"Previous Close":246.67,"ROE":0.085209996,"DTE":64.046,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":0.752,"Trailing PEG":0.3653,"Trailing PE":29.392193,"Trailing PS":29.392193,"Quick Ratio":0.787,"Day High":248.295,"Day Low":245.38,"VS Average Volume":0.3465783808,"Company Summary":"L3Harris Technologies, Inc. provides mission-critical solutions for government and commercial customers worldwide. It operates through Space & Airborne Systems (SAS), Integrated Mission Systems (IMS), Communication Systems (CS), and Aerojet Rocketdyne (AR) segments. The SAS segment provides satellite space payloads, sensors, and full-mission solutions; classified intelligence and cyber; airborne combat systems; and mission networks for air traffic management operations. The IMS segment offers intelligence, surveillance, and reconnaissance (ISR) systems; passive sensing and targeting; electronic attack platforms; autonomy; power and communications; networks; and sensors. The CS segment provides tactical radios, software, waveforms, satellite terminals, and end-to-end battlefield systems for the U.S. Department of Defense, international, federal, and state agency customers; broadband communications; integrated vision solutions, including helmet-mounted integrated night vision goggles with image intensifier tubes and weapon-mounted sights, aiming lasers, and range finders; and public safety radios, and system applications and equipment. The AR segment offers propulsion technologies and armament systems for strategic defense, missile defense, hypersonic, and tactical systems; and space propulsion and power systems for national security space and exploration missions. The company was formerly known as Harris Corporation and changed its name to L3Harris Technologies, Inc. in June 2019. L3Harris Technologies, Inc. was founded in 1895 and is based in Melbourne, Florida.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:24:15"},{"Company Name":"Keurig Dr Pepper Inc.","Symbol":"KDP","Current Price":"32.84","Latest MA":"32.83","Latest MA 5":32.8770006104,"Latest MA 9":32.8683337063,"Latest MA 20":33.155749939,"RSI":42.4001357832,"Price Target":38.616,"Difference from MA":"0.00%","Difference from Open":"-0.08%","Change from Yesterday":"-0.08%","Change from Last Report":"0.21","Latest Volume":"2,672,221","Market Cap":"44,596,166,656","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.017073,"PB Ratio":1.8241667,"Previous Close":32.86,"ROE":0.06126,"DTE":76.418,"Industry":"Beverages - Non-Alcoholic","Sector":"Consumer Defensive","Beta":0.496,"Trailing PEG":1.0092,"Trailing PE":29.849998,"Trailing PS":29.849998,"Quick Ratio":0.241,"Day High":32.99,"Day Low":32.675,"VS Average Volume":0.1991441237,"Company Summary":"Keurig Dr Pepper Inc. owns, manufactures, and distributors beverages and single serve brewing systems in the United States and internationally. It operates through three segments: U.S. Refreshment Beverages, U.S. Coffee, and International. The company manufactures and distributes branded concentrates, syrup, and finished beverages, as well as sales of owned brands and third-party brands; tea, cocoa, and other products; and offers finished goods relating to K-Cup pods, single serve brewers, specialty coffee, and ready to drink coffee products. It offers its products under the Dr Pepper, Canada Dry, Mott's, A&W, Peñafiel, Snapple, 7UP, Green Mountain Coffee Roasters, GHOST, Clamato, Core Hydration, The Original Donut Shop, Sunkist soda, Squirt, C4 Energy, Hawaiian Punch, Electrolit, Bai, Evian, Yoo-Hoo, Vita Coco, Big Red, Crush, McCafé, Tim Hortons, Van Houtte, Celestial Seasonings, Bigelow, Starbucks, Dunkin', Folgers, Peet's, and Swiss Miss brands, as well as other partner and private label brands. The company markets and sells its products to supermarkets, mass merchandisers, club stores, pure-play e-commerce retailers, office superstores, restaurants, hotel chains, office product and coffee distributors, partner brand owners, and directly to consumers through Keurig.com website. Keurig Dr Pepper Inc. was founded in 1981 and is headquartered in Burlington, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:24:15"},{"Company Name":"Kimberly-Clark Corporation","Symbol":"KMB","Current Price":"133.27","Latest MA":"133.30","Latest MA 5":133.0800009766,"Latest MA 9":135.015812717,"Latest MA 20":137.7503667603,"RSI":32.122700708,"Price Target":142.40167,"Difference from MA":"-0.02%","Difference from Open":"0.02%","Change from Yesterday":"0.32%","Change from Last Report":"0.12","Latest Volume":"636,610","Market Cap":"44,221,120,512","Earning Date":"22-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":17.46658,"PB Ratio":40.165764,"Previous Close":132.85,"ROE":2.0706,"DTE":595.098,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":0.398,"Trailing PEG":5.8543,"Trailing PE":18.131973,"Trailing PS":18.131973,"Quick Ratio":0.396,"Day High":133.645,"Day Low":132.52,"VS Average Volume":0.2712387097,"Company Summary":"Kimberly-Clark Corporation, together with its subsidiaries, manufactures and markets personal care products in the United States. It operates through three segments: North America, International Personal Care, and International Family Care and Professional. The company North America segment offers disposable diapers, training and youth pants, swimpants, baby wipes, feminine and incontinence care products, reusable underwear, facial and bathroom tissue, paper towels, napkins, wipers, tissue, towels, soaps and sanitizers, and other related products under the Huggies, Pull-Ups, GoodNites, Kotex, Poise, Depend, Kleenex, Scott, Cottonelle, Viva, Wypall, and other brand names. The International Personal Care segment provides baby and child care, adult care and feminine care, including disposable diapers, training and youth pants, swimpants, baby wipes, feminine and incontinence care products, reusable underwear, and other related products under the Huggies, Kotex, Goodfeel, Intimus, Depend and other brand names. The International Family Care and Professional segment offers facial and bathroom tissue, paper towels, napkins, wipers, tissue, towels, soaps and sanitizers, and other related products under the Kleenex, Scott, Viva, Andrex, Scottex, Wypall, and other brand names. It also sells household use products directly to supermarkets, mass merchandisers, drugstores, warehouse clubs, variety and department stores, and other retail outlets, as well as through other distributors and e-commerce; and professional use products directly to distributors, manufacturing, lodging, office building, food service, and public facilities, as well as through e-commerce. Kimberly-Clark Corporation was founded in 1872 and is headquartered in Dallas, Texas.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:24:15"},{"Company Name":"Hess Corporation","Symbol":"HES","Current Price":"140.95","Latest MA":"140.43","Latest MA 5":138.5900030518,"Latest MA 9":136.5733357747,"Latest MA 20":134.2500016785,"RSI":75.2792893865,"Price Target":159.2557,"Difference from MA":"0.37%","Difference from Open":"0.83%","Change from Yesterday":"0.26%","Change from Last Report":"-0.09","Latest Volume":"470,453","Market Cap":"43,591,749,632","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":18.546053,"PB Ratio":3.7686157,"Previous Close":140.58,"ROE":0.22753,"DTE":76.69,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":0.626,"Trailing PEG":3.5106,"Trailing PE":19.549236,"Trailing PS":19.549236,"Quick Ratio":0.868,"Day High":141.3092,"Day Low":139.2325,"VS Average Volume":0.2390895901,"Company Summary":"Hess Corporation, an exploration and production company, explores, develops, produces, purchases, transports, and sells crude oil, natural gas liquids, and natural gas in the United States, Guyana, the Malaysia\/Thailand Joint Development Area, and Malaysia. It operates in two segments, Exploration and Production, and Midstream. The company also conduct exploration activities principally offshore Guyana, in the U.S. Gulf of America, and offshore Suriname. In addition, the company is involved in gathering, compressing, and processing natural gas; fractionating natural gas liquids; gathering, terminaling, loading, and transporting crude oil and natural gas liquids; and storing and terminaling propane, as well as providing water handling services primarily in the Bakken Shale plays in the Williston Basin area of North Dakota. Hess Corporation was incorporated in 1920 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:24:15"},{"Company Name":"Take-Two Interactive Software, ","Symbol":"TTWO","Current Price":"235.66","Latest MA":"203.37","Latest MA 5":234.3060020752,"Latest MA 9":232.1100002035,"Latest MA 20":230.2130003052,"RSI":70.3231304994,"Price Target":243.05222,"Difference from MA":"15.88%","Difference from Open":"0.66%","Change from Yesterday":"0.39%","Change from Last Report":"-0.13","Latest Volume":"621,045","Market Cap":"43,099,152,384","Earning Date":"15-05-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":30.058674,"PB Ratio":19.522823,"Previous Close":234.74,"ROE":-1.1476101,"DTE":192.071,"Industry":"Electronic Gaming & Multimedia","Sector":"Communication Services","Beta":1.029,"Trailing PEG":3.7424,"Trailing PE":null,"Trailing PS":null,"Quick Ratio":0.676,"Day High":237.39,"Day Low":234.115,"VS Average Volume":0.2742374565,"Company Summary":"Take-Two Interactive Software, Inc. develops, publishes, and markets interactive entertainment solutions for consumers worldwide. The company develops and publishes action\/adventure products under the Grand Theft Auto, LA Noire, Max Payne, Midnight Club, and Red Dead Redemption names, as well as other franchises. It also publishes various entertainment properties across various platforms and a range of genres, such as shooter, action, role-playing, strategy, sports, and family\/casual entertainment under the BioShock, Mafia, Sid Meier's Civilization, XCOM series, Borderlands, and Tiny Tina's Wonderland names. In addition, the company publishes sports simulation titles comprising NBA 2K series, a basketball video game; the WWE 2K professional wrestling series; mobile titles, including WWE SuperCard; and PGA TOUR 2K. Further, it offers Kerbal Space Program; free-to-play mobile games, such as CSR Racing, Dragon City, Empires & Puzzles, FarmVille, Game of Thrones: Legends, Golf Rival, Harry Potter: Puzzles & Spells, Match Factory!, Merge Dragons!, Merge Magic!, Monster Legends, Toon Blast, Top Eleven, Top Troops, Toy Blast, Two Dots, Words With Friends, and Zynga Poker; and hyper-casual mobile titles, including Color Block Jam, Fill the Fridge!, Parking Jam 3D, Power Slap, Pull the Pin, Screw Jam, Twisted Tangle, and Tangled Snakes. The company's products are designed for console gaming systems; personal computers; and mobiles comprising smartphones and tablets. It provides its products through physical retail, digital download, online platforms, and cloud streaming services. Take-Two Interactive Software, Inc. was incorporated in 1993 and is based in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:24:15"},{"Company Name":"Public Service Enterprise Group","Symbol":"PEG","Current Price":"81.14","Latest MA":"82.40","Latest MA 5":80.128,"Latest MA 9":80.2801649984,"Latest MA 20":79.2526172943,"RSI":63.4242911049,"Price Target":85.67133,"Difference from MA":"-1.53%","Difference from Open":"0.62%","Change from Yesterday":"0.41%","Change from Last Report":"0.21","Latest Volume":"1,887,118","Market Cap":"40,488,697,856","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":19.936117,"PB Ratio":2.473328,"Previous Close":80.81,"ROE":0.11399999,"DTE":143.849,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.497,"Trailing PEG":2.4879,"Trailing PE":22.169397,"Trailing PS":22.169397,"Quick Ratio":0.552,"Day High":81.7209,"Day Low":80.514,"VS Average Volume":0.5987792267,"Company Summary":"Public Service Enterprise Group Incorporated, through its subsidiaries, operates in electric and gas utility, and nuclear generation businesses in the United States. It operates through PSE&G and PSEG Power segments. The PSE&G segment transmits electricity; distributes electricity and natural gas to residential, commercial, and industrial customers; and appliance services and repairs to customers through its service territory, as well as invests in solar generation projects, and energy efficiency and related programs. The PSEG Power segment engages in nuclear generation businesses; and supplies power and natural gas to nuclear power plants and gas storage facilities activities. As of December 31, 2024, it had electric transmission and distribution system of 25,000 circuit miles and 869,000 poles; 57 switching stations with an installed capacity of 40,000 megavolt-amperes (MVA), and 234 substations with an installed capacity of 10,750 MVA; four electric distribution headquarters and five electric sub-headquarters; 18,000 miles of gas mains, 12 gas distribution headquarters, two sub-headquarters, and two meter shop, as well as 54 natural gas metering and regulating stations; and 158 MegaWatts defined conditions of installed PV solar capacity. Public Service Enterprise Group Incorporated was founded in 1903 and is based in Newark, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:24:15"},{"Company Name":"CBRE Group Inc","Symbol":"CBRE","Current Price":"135.69","Latest MA":"131.59","Latest MA 5":131.9560023193,"Latest MA 9":129.3700016276,"Latest MA 20":127.2365015717,"RSI":84.0391637297,"Price Target":143.83333,"Difference from MA":"3.11%","Difference from Open":"0.85%","Change from Yesterday":"1.39%","Change from Last Report":"-0.11","Latest Volume":"693,379","Market Cap":"40,449,867,776","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":22.615,"PB Ratio":4.835192,"Previous Close":133.83,"ROE":0.11921,"DTE":100.422,"Industry":"Real Estate Services","Sector":"Real Estate","Beta":1.29,"Trailing PEG":0.9507,"Trailing PE":41.495415,"Trailing PS":41.495415,"Quick Ratio":0.796,"Day High":136.815,"Day Low":133.7487,"VS Average Volume":0.3568445831,"Company Summary":"CBRE Group, Inc. operates as a commercial real estate services and investment company in the United States, the United Kingdom, and internationally. The Advisory Services segment offers strategic advice and execution to owners, investors, and occupiers of real estate in connection with leasing of offices, and industrial and retail space; clients fully integrated property sales services under the CBRE Capital Markets brand; clients commercial mortgage and structured financing services; originates and sells commercial mortgage loans; property management services, such as marketing, building engineering, accounting, and financial services on a contractual basis for owners of and investors in office, industrial, and retail properties; and valuation services that include market value appraisals, litigation support, discounted cash flow analyses, and feasibility studies, as well as consulting services, such as property condition reports, hotel advisory, and environmental consulting. The Global Workplace Solutions segment provides facilities management, including day-to-day management of client-occupied space, headquarters, regional offices, administrative offices, data centers and other critical facilities, manufacturing and laboratory facilities, and distribution facilities and retail space; and project management services comprising building consulting, program, and project and cost management services under the Turner & Townsend brand name. The Real Estate Investments segment offers investment management services under the CBRE Investment Management brand to pension funds, insurance companies, sovereign wealth funds, foundations, endowments, and other institutional investors; and development services, such as real estate development and investment activities under the Trammell Crow Company and Telford Homes brands to users and investors in commercial real estate, and for their own account. CBRE Group, Inc. was founded in 1906 and is headquartered in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:24:15"},{"Company Name":"Garmin Ltd.","Symbol":"GRMN","Current Price":"208.71","Latest MA":"208.05","Latest MA 5":208.7399980469,"Latest MA 9":206.8422199843,"Latest MA 20":204.6799976807,"RSI":67.4763687884,"Price Target":198.5425,"Difference from MA":"0.32%","Difference from Open":"0.15%","Change from Yesterday":"-0.20%","Change from Last Report":"-0.07","Latest Volume":"254,346","Market Cap":"40,185,233,408","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":27.977213,"PB Ratio":4.917303,"Previous Close":209.13,"ROE":0.19036,"DTE":2.181,"Industry":"Scientific & Technical Instruments","Sector":"Technology","Beta":0.988,"Trailing PEG":2.8,"Trailing PE":27.498024,"Trailing PS":27.498024,"Quick Ratio":2.615,"Day High":209.6299,"Day Low":207.65,"VS Average Volume":0.243141551,"Company Summary":"Garmin Ltd. designs, develops, manufactures, markets, and distributes a range of wireless devices worldwide. The company offers running and multi-sport watches; cycling products; smartwatch devices; scales and monitors; Garmin Connect and Garmin Connect Mobile, which are web and mobile platforms where users can track and analyze their fitness, activities and workouts, and wellness data; and Connect IQ, enables third parties to create applications that run on Garmin devices. It also provides adventure watches; outdoor handhelds and satellite communicators; golf devices; consumer automotive; dog devices; InReach and Gramin response communication device; and Dive devices. In addition, the company designs, manufactures, and markets various aircraft avionics solutions, including integrated flight decks, electronic flight displays and instrumentation, navigation and communication products, automatic flight control systems and safety-enhancing technologies, audio control systems, engine indication systems, traffic awareness and avoidance solutions, ADS-B and transponders, weather information and avoidance solutions, datalink and connectivity solutions, and portable GPS navigators and wearables, as well as service products to the aviation market. Further, it offers chartplotters and multi-function displays, cartography products, fishfinders, sonar products, autopilot systems, radars, compliant instrument displays and sensors, VHF communication radios, handhelds and wearable devices, sailing products, audio products, digital switching products, trolling motors, and lighting products; and domain controllers and infotainment units, as well as software, map database, cameras, wearables, and automotive solutions. The company sells its products through independent retailers, dealers, distributors, installation and repair shops, and original equipment manufacturers, as well as online webshop. Garmin Ltd. was founded in 1989 and is based in Schaffhausen, Switzerland.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"12-06-2025 20:24:15"},{"Company Name":"Cardinal Health, Inc.","Symbol":"CAH","Current Price":"160.23","Latest MA":"131.01","Latest MA 5":155.0340004883,"Latest MA 9":154.8988889567,"Latest MA 20":154.1855005493,"RSI":78.2925858644,"Price Target":161.608,"Difference from MA":"22.30%","Difference from Open":"3.31%","Change from Yesterday":"4.36%","Change from Last Report":"0.17","Latest Volume":"1,369,607","Market Cap":"38,243,213,312","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":18.545137,"PB Ratio":-12.989866,"Previous Close":153.53,"ROE":null,"DTE":null,"Industry":"Medical Distribution","Sector":"Healthcare","Beta":0.677,"Trailing PEG":0.8072,"Trailing PE":25.075117,"Trailing PS":25.075117,"Quick Ratio":0.436,"Day High":160.32,"Day Low":152.08,"VS Average Volume":0.5659657009,"Company Summary":"Cardinal Health, Inc. operates as a healthcare services and products company in the United States, Canada, Europe, Asia, and internationally. It provides customized solutions for hospitals, healthcare systems, pharmacies, ambulatory surgery centers, clinical laboratories, physician offices, and patients in the home. The company operates in two segments: Pharmaceutical and Specialty Solutions, and Global Medical Products and Distribution. It distributes branded and generic pharmaceutical, specialty pharmaceutical, and over-the-counter healthcare and consumer products, as well as medical supplies. The company also provides services to pharmaceutical manufacturers and healthcare providers for specialty pharmaceutical products; offers pharmacy management services to hospitals; operates pharmacies, including pharmacies in community health centers; and repackages generic pharmaceuticals and over-the-counter healthcare products. In addition, it manufactures, sources, and distributes Cardinal Health branded medical, surgical, and laboratory products and devices that include exam and surgical gloves; needles, syringe, and sharps disposals; compression solution, incontinence, nutritional delivery, and wound care products; single-use surgical drapes, gowns, and apparel products; fluid suction and collection systems; urology products; operating room supply products; and electrode product lines. Further, the company distributes a range of national brand products, including medical, surgical, and laboratory products; provides supply chain services and solutions to hospitals, ambulatory surgery centers, clinical laboratories, and other healthcare providers; and assembles and sells sterile, and non-sterile procedure kits. Additionally, it manufactures, prepares, delivers, and distributes radiopharmaceuticals and related treatments; and optimizes direct shipments through integrated technology solutions. The company was incorporated in 1979 and is headquartered in Dublin, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:24:15"},{"Company Name":"Otis Worldwide Corporation","Symbol":"OTIS","Current Price":"96.66","Latest MA":"96.98","Latest MA 5":95.7519996948,"Latest MA 9":95.3788880412,"Latest MA 20":96.2919996338,"RSI":61.0868850219,"Price Target":101.85714,"Difference from MA":"-0.33%","Difference from Open":"1.44%","Change from Yesterday":"1.32%","Change from Last Report":"0.07","Latest Volume":"992,882","Market Cap":"38,149,480,448","Earning Date":"23-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":23.069214,"PB Ratio":-7.4548826,"Previous Close":95.4,"ROE":null,"DTE":null,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":0.974,"Trailing PEG":2.5719,"Trailing PE":25.303667,"Trailing PS":25.303667,"Quick Ratio":0.783,"Day High":96.665,"Day Low":94.9,"VS Average Volume":0.3487510384,"Company Summary":"Otis Worldwide Corporation engages in manufacturing, installation, and servicing of elevators and escalators in the United States, China, and internationally. The company operates through two segments, New Equipment and Service. The New Equipment segment designs, manufactures, sells, and installs a range of passenger and freight elevators, as well as escalators and moving walkways for residential and commercial buildings, and infrastructure projects. This segment serves real-estate and building developers, and general contractors. It sells its products directly to customers, as well as through agents and distributors. The Service segment performs maintenance and repair services, as well as modernization services to upgrade elevators and escalators. Otis Worldwide Corporation was founded in 1853 and is headquartered in Farmington, Connecticut.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"12-06-2025 20:24:15"},{"Company Name":"Prudential Financial, Inc.","Symbol":"PRU","Current Price":"104.46","Latest MA":"110.75","Latest MA 5":105.3119996948,"Latest MA 9":104.6766663615,"Latest MA 20":104.396519516,"RSI":49.6709116362,"Price Target":113.28571,"Difference from MA":"-5.68%","Difference from Open":"0.05%","Change from Yesterday":"-0.14%","Change from Last Report":"-0.03","Latest Volume":"594,370","Market Cap":"36,979,572,736","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":7.11096,"PB Ratio":1.2374724,"Previous Close":104.61,"ROE":0.07908,"DTE":148.073,"Industry":"Insurance - Life","Sector":"Financial Services","Beta":1.047,"Trailing PEG":0.6882,"Trailing PE":16.47634,"Trailing PS":16.47634,"Quick Ratio":0.881,"Day High":104.53,"Day Low":103.01,"VS Average Volume":0.3164228781,"Company Summary":"Prudential Financial, Inc., together with its subsidiaries, provides insurance, investment management, and other financial products and services in the United States, Japan and internationally. It operates through PGIM, Retirement Strategies, Group Insurance, Individual Life, and International Businesses segments. The PGIM segment offers investment management services and solutions related to public fixed income, public equity, real estate debt and equity, private credit and other alternatives, and multi-asset class strategies to institutional and retail clients, as well as its insurance and retirement businesses. The Retirement Strategies segment provides a range of retirement investment, and income products and services to retirement plan sponsors in the public, private, and not-for-profit sectors; develops and distributes individual variable and fixed annuity products. The Group Insurance segment offers various group life, and long-term and short-term group disability, as well as group corporate-, bank-, and trust-owned life insurance in the United States primarily for institutional clients for use in connection with employee and membership benefits plans; sells accidental death and dismemberment, and other supplemental health solutions; and plan administration services in connection with its insurance coverages. The Individual Life segment develops and distributes variable life, universal life, and term life insurance products. The International Businesses segment develops and distributes life insurance, retirement products, investment products, and certain accident and health products; and advisory and administration services . The company provides its products and services to individual and institutional customers through its proprietary and third-party distribution networks. Prudential Financial, Inc. was founded in 1875 and is headquartered in Newark, New Jersey.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:24:15"},{"Company Name":"Sysco Corporation","Symbol":"SYY","Current Price":"75.17","Latest MA":"73.50","Latest MA 5":75.0300006714,"Latest MA 9":74.278888482,"Latest MA 20":73.228000351,"RSI":66.0435928361,"Price Target":79.77824,"Difference from MA":"2.28%","Difference from Open":"0.89%","Change from Yesterday":"0.58%","Change from Last Report":"0.15","Latest Volume":"1,182,824","Market Cap":"36,438,806,528","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":15.278455,"PB Ratio":18.958385,"Previous Close":74.74,"ROE":0.93613,"DTE":751.105,"Industry":"Food Distribution","Sector":"Consumer Defensive","Beta":0.817,"Trailing PEG":1.4097,"Trailing PE":19.423773,"Trailing PS":19.423773,"Quick Ratio":0.72,"Day High":75.4651,"Day Low":74.202,"VS Average Volume":0.3677319007,"Company Summary":"Sysco Corporation, through its subsidiaries, engages in the marketing and distribution of various food and related products to the foodservice or food-away-from-home industry in the United States, Canada, the United Kingdom, France, and internationally. The company operates through U.S. Foodservice Operations, International Foodservice Operations, SYGMA, and Other segments. It distributes frozen food, such as meat, seafood, fully prepared entrées, fruits, vegetables, and desserts; canned and dry food products; fresh meat and seafood products; dairy products; beverages; imported specialties; and fresh produce products. The company also supplies various non-food items, including paper products comprising disposable napkins, plates, and cups; tableware consisting of glassware and silverware; cookware, such as pots, pans, and utensils; restaurant and kitchen equipment and supplies; and cleaning supplies. It serves restaurants, hospitals and nursing facilities, schools and colleges, hotels and motels, industrial caterers, and other foodservice venues. The company was incorporated in 1969 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:24:15"},{"Company Name":"Vulcan Materials Company (Holdi","Symbol":"VMC","Current Price":"265.62","Latest MA":"260.50","Latest MA 5":264.5299997559,"Latest MA 9":264.7466673448,"Latest MA 20":267.4582750854,"RSI":51.0672206063,"Price Target":294.38583,"Difference from MA":"1.97%","Difference from Open":"2.00%","Change from Yesterday":"1.72%","Change from Last Report":"-0.11","Latest Volume":"291,062","Market Cap":"35,089,465,344","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":29.253304,"PB Ratio":4.3137636,"Previous Close":261.12,"ROE":0.120749995,"DTE":67.823,"Industry":"Building Materials","Sector":"Basic Materials","Beta":0.836,"Trailing PEG":2.3415,"Trailing PE":37.411266,"Trailing PS":37.411266,"Quick Ratio":1.393,"Day High":266.15,"Day Low":259.755,"VS Average Volume":0.2492265775,"Company Summary":"Vulcan Materials Company produces and supplies construction aggregates in the United States. It operates through three segments: Aggregates, Asphalt, and Concrete. The company provides crushed stone, sand and gravel, sand, riprap and jetty stones, and other aggregates for use in construction and maintenance of highways, streets, and other public works, as well as in the construction of housing and commercial, industrial, and other nonresidential facilities; asphalt mix; asphalt construction paving services; and ready-mixed concrete products. The company was formerly known as Virginia Holdco, Inc. and changed its name to Vulcan Materials Company. Vulcan Materials Company was founded in 1909 and is headquartered in Birmingham, Alabama.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:24:15"},{"Company Name":"Old Dominion Freight Line, Inc.","Symbol":"ODFL","Current Price":"162.71","Latest MA":"180.45","Latest MA 5":163.050001709,"Latest MA 9":162.0994679091,"Latest MA 20":163.8179226379,"RSI":50.1262103498,"Price Target":168.14682,"Difference from MA":"-9.83%","Difference from Open":"0.76%","Change from Yesterday":"0.37%","Change from Last Report":"-0.05","Latest Volume":"380,818","Market Cap":"34,384,691,200","Earning Date":"23-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":27.577967,"PB Ratio":8.141606,"Previous Close":162.11,"ROE":0.26593,"DTE":1.416,"Industry":"Trucking","Sector":"Industrials","Beta":1.272,"Trailing PEG":3.0563,"Trailing PE":30.527206,"Trailing PS":30.527206,"Quick Ratio":1.194,"Day High":162.88,"Day Low":159.415,"VS Average Volume":0.2067327188,"Company Summary":"Old Dominion Freight Line, Inc. operates as a less-than-truckload motor carrier in the United States and North America. The company offers regional, inter-regional, and national less-than-truckload services, as well as expedited transportation. It also provides various value-added services, including container drayage, truckload brokerage, and supply chain consulting. In addition, the company operates service and fleet maintenance centers. As of December 31, 2024, it owned and operated 11,284 tractors, 31,451 linehaul trailers, and 15,263 pickup and delivery trailers. Old Dominion Freight Line, Inc. was founded in 1934 and is headquartered in Thomasville, North Carolina.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:26:30"},{"Company Name":"VICI Properties Inc.","Symbol":"VICI","Current Price":"32.45","Latest MA":"30.84","Latest MA 5":32.1740000153,"Latest MA 9":31.9122222477,"Latest MA 20":31.785,"RSI":70.7108956418,"Price Target":36.11957,"Difference from MA":"5.24%","Difference from Open":"-0.12%","Change from Yesterday":"-0.09%","Change from Last Report":"0.12","Latest Volume":"1,449,260","Market Cap":"34,290,241,536","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":11.886447,"PB Ratio":1.2886189,"Previous Close":32.48,"ROE":0.1012,"DTE":65.738,"Industry":"REIT - Diversified","Sector":"Real Estate","Beta":0.724,"Trailing PEG":null,"Trailing PE":12.9800005,"Trailing PS":12.9800005,"Quick Ratio":21.502,"Day High":32.56,"Day Low":32.305,"VS Average Volume":0.2076706273,"Company Summary":"VICI Properties Inc. is an S&P 500 experiential real estate investment trust that owns one of the largest portfolios of market-leading gaming, hospitality and entertainment destinations, including Caesars Palace Las Vegas, MGM Grand and the Venetian Resort Las Vegas, three of the most iconic entertainment facilities on the Las Vegas Strip. VICI Properties owns 93 experiential assets across a geographically diverse portfolio consisting of 54 gaming properties and 39 other experiential properties across the United States and Canada. The portfolio is comprised of approximately 127 million square feet and features approximately 60,300 hotel rooms and over 500 restaurants, bars, nightclubs and sportsbooks. Its properties are occupied by industry-leading gaming, leisure and hospitality operators under long-term, triple-net lease agreements. VICI Properties has a growing array of real estate and financing partnerships with leading operators in other experiential sectors, including Bowlero, Cabot, Canyon Ranch, Chelsea Piers, Great Wolf Resorts, Homefield and Kalahari Resorts. VICI Properties also owns four championship golf courses and 33 acres of undeveloped and underdeveloped land adjacent to the Las Vegas Strip. VICI Properties' goal is to own the highest quality and most productive experiential real estate portfolio through a strategy of partnering with the highest quality experiential place makers and operators.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:26:30"},{"Company Name":"The Hershey Company","Symbol":"HSY","Current Price":"168.90","Latest MA":"164.96","Latest MA 5":166.829,"Latest MA 9":164.7705548096,"Latest MA 20":160.6317495117,"RSI":70.7633688607,"Price Target":165.17625,"Difference from MA":"2.39%","Difference from Open":"0.50%","Change from Yesterday":"0.50%","Change from Last Report":"0.14","Latest Volume":"626,526","Market Cap":"34,218,803,200","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":20.106548,"PB Ratio":7.3038836,"Previous Close":168.05,"ROE":0.37483,"DTE":134.279,"Industry":"Confectioners","Sector":"Consumer Defensive","Beta":0.283,"Trailing PEG":46.2948,"Trailing PE":20.774294,"Trailing PS":20.774294,"Quick Ratio":0.794,"Day High":170.87,"Day Low":167.5001,"VS Average Volume":0.3859144901,"Company Summary":"The Hershey Company, together with its subsidiaries, engages in the manufacture and sale of confectionery products and pantry items in the United States and internationally. The company operates through three segments: North America Confectionery, North America Salty Snacks, and International. It offers chocolate and non-chocolate confectionery products; gum and mint refreshment products, including mints, chewing gums, and bubble gums; protein bars; pantry items, such as baking ingredients, toppings, beverages, and sundae syrups; and snack items comprising spreads, bars, snack bites, mixes, popcorn, and pretzels. The company provides its products primarily under the Hershey's, Reese's, Kisses, Jolly Rancher, Almond Joy, Brookside, barkTHINS, Cadbury, Good & Plenty, Heath, Kit Kat, Payday, Rolo, Twizzlers, Sour Strips, Whoppers, York, Ice Breakers, Breath Savers, Bubble Yum, Lily's, SkinnyPop, Pirates Booty, Dot's Homestyle Pretzels, and ONE Bar brands, as well as under the Pelon Pelo Rico, IO-IO, and Sofit brands. It markets and sells its products to wholesale distributors, chain grocery stores, mass merchandisers, chain drug stores, vending companies, wholesale clubs, convenience stores, dollar stores, concessionaires, and department stores. The company exports its products in approximately 80 countries worldwide. The Hershey Company was founded in 1894 and is headquartered in Hershey, Pennsylvania.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"12-06-2025 20:26:30"},{"Company Name":"Agilent Technologies, Inc.","Symbol":"A","Current Price":"119.45","Latest MA":"126.15","Latest MA 5":118.4459997559,"Latest MA 9":116.1022232056,"Latest MA 20":113.6235005951,"RSI":70.2108861669,"Price Target":136.825,"Difference from MA":"-5.31%","Difference from Open":"0.40%","Change from Yesterday":"-0.23%","Change from Last Report":"-0.08","Latest Volume":"580,693","Market Cap":"33,931,563,008","Earning Date":"28-05-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":21.141592,"PB Ratio":5.5272775,"Previous Close":119.72,"ROE":0.18882999,"DTE":60.039,"Industry":"Diagnostics & Research","Sector":"Healthcare","Beta":1.232,"Trailing PEG":1.9435,"Trailing PE":29.421183,"Trailing PS":29.421183,"Quick Ratio":1.417,"Day High":120.04,"Day Low":118.53,"VS Average Volume":0.2516399914,"Company Summary":"Agilent Technologies, Inc. provides application focused solutions to the life sciences, diagnostics, and applied chemical markets worldwide. The company operates in three segments: Life Sciences and Applied Markets, Diagnostics and Genomics, and Agilent CrossLab. The Life Sciences and Applied Markets segment offers liquid chromatography systems and components; liquid chromatography mass spectrometry systems; gas chromatography systems and components; gas chromatography mass spectrometry systems; inductively coupled plasma mass spectrometry instruments; atomic absorption instruments; microwave plasma-atomic emission spectrometry instruments; inductively coupled plasma optical emission spectrometry instruments; raman spectroscopy; laboratory software; information management and analytics; laboratory automation and robotic systems; dissolution testing; and vacuum pumps, and measurement technologies. This segment also offers GC and LC columns, sample preparation products, custom chemistries, and laboratory instrument supplies. The Diagnostics and Genomics segment provides genomics, contract manufacturing and research and development, pathology, companion diagnostics, reagent partnership, and biomolecular analysis businesses; and cell analysis plate based assays, flow cytometers, real-time cell analyzers, cell imaging systems, microplate readers, and related consumables. The Agilent CrossLab segment provides various services, including repairs, parts, maintenance, installations, training, compliance support, software as a service, asset management, and consulting services. The company markets its products through direct sales, distributors, resellers, manufacturer's representatives, and electronic commerce. Agilent Technologies, Inc. was incorporated in 1999 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:26:30"},{"Company Name":"WEC Energy Group, Inc.","Symbol":"WEC","Current Price":"105.75","Latest MA":"101.28","Latest MA 5":105.4819992065,"Latest MA 9":105.8366673787,"Latest MA 20":106.1935005188,"RSI":48.501777249,"Price Target":109.554,"Difference from MA":"4.42%","Difference from Open":"-0.28%","Change from Yesterday":"0.16%","Change from Last Report":"0.12","Latest Volume":"636,747","Market Cap":"33,748,422,656","Earning Date":"30-07-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":20.258621,"PB Ratio":2.6009002,"Previous Close":105.58,"ROE":0.12579,"DTE":153.016,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.439,"Trailing PEG":2.5792,"Trailing PE":20.614035,"Trailing PS":20.614035,"Quick Ratio":0.323,"Day High":106.28,"Day Low":105.4,"VS Average Volume":0.2813185075,"Company Summary":"WEC Energy Group, Inc., through its subsidiaries, provides regulated natural gas and electricity, and renewable and nonregulated renewable energy services in the United States. It operates through Wisconsin, Illinois, Other States, Electric Transmission, and Non-Utility Energy Infrastructure segments. The company generates and distributes electricity from coal, natural gas, oil, and nuclear, as well as renewable energy resources, including wind, solar, hydroelectric, and biomass; and distributes and transports natural gas. It also owns, maintains, monitors, and operates electric transmission systems; and generates, distributes, and sells steam. As of December 31, 2024, the company operated approximately 35,300 miles of overhead distribution lines and 37,100 miles of underground distribution cables, as well as 420 electric distribution substations and 640,100 line transformers; approximately 47,000 miles of natural gas distribution mains; 1,300 miles of natural gas transmission mains; 2.4 million natural gas lateral services; 510 natural gas distribution and transmission gate stations; and 67.0 billion cubic feet of working gas capacities in underground natural gas storage fields. The company was formerly known as Wisconsin Energy Corporation and changed its name to WEC Energy Group, Inc. in June 2015. WEC Energy Group, Inc. was founded in 1896 and is headquartered in Milwaukee, Wisconsin.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:26:30"},{"Company Name":"GE HealthCare Technologies Inc.","Symbol":"GEHC","Current Price":"73.40","Latest MA":"79.14","Latest MA 5":72.8020001221,"Latest MA 9":72.0000006782,"Latest MA 20":71.5700007629,"RSI":67.2022164421,"Price Target":87.403,"Difference from MA":"-7.25%","Difference from Open":"0.26%","Change from Yesterday":"0.00%","Change from Last Report":"-0.07","Latest Volume":"1,576,808","Market Cap":"33,608,759,296","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":15.717345,"PB Ratio":3.657929,"Previous Close":73.4,"ROE":0.26444,"DTE":97.515,"Industry":"Health Information Services","Sector":"Healthcare","Beta":1.291,"Trailing PEG":2.4537,"Trailing PE":15.420168,"Trailing PS":15.420168,"Quick Ratio":0.673,"Day High":73.795,"Day Low":72.33,"VS Average Volume":0.3233016957,"Company Summary":"GE HealthCare Technologies Inc. engages in the development, manufacture, and marketing of products, services, and complementary digital solutions used in the diagnosis, treatment, and monitoring of patients in the United States, Canada, and internationally. The company operates through four segments: Imaging, Advanced Visualization Solutions (AVS), Patient Care Solutions (PCS), and Pharmaceutical Diagnostics (PDx). The Imaging segment offers molecular imaging, computed tomography (CT) scanning, magnetic resonance (MR) imaging, image-guided therapy, X-ray systems, and women's health products. The AVS segment provides ultrasound, image guided therapies, and interventional solutions for screening, diagnosis, treatment, and monitoring of certain diseases in clinical areas, such as women's health, cardiovascular, and comprehensive care ultrasound as well as surgical visualization and guidance products. The PCS segment provides medical devices, consumables, services, and digital solutions. Its portfolio includes patient monitoring, diagnostic cardiology, consumables and services, digital solutions, maternal infant care, and anesthesia products. The PDx segment supplies diagnostic agents, including CT, angiography and X-ray, MR, single-photon emission computed tomography, and positron emission tomography to the radiology and nuclear medicine industries. The segment also provides contrast media pharmaceuticals that are administered to a patient prior to certain diagnostic scans to increase the visibility of tissues or structures during imaging exams; and molecular imaging agents or radiopharmaceuticals, which are molecular tracers labeled with radioisotopes. The company was formerly known as GE Healthcare Holding LLC and changed its name to GE HealthCare Technologies Inc. in December 2022. The company was incorporated in 2022 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:26:30"},{"Company Name":"Brown & Brown, Inc.","Symbol":"BRO","Current Price":"106.36","Latest MA":"111.00","Latest MA 5":106.9510003052,"Latest MA 9":109.10722229,"Latest MA 20":110.4267496338,"RSI":34.9855431908,"Price Target":118.37727,"Difference from MA":"-4.18%","Difference from Open":"1.27%","Change from Yesterday":"1.79%","Change from Last Report":"-0.37","Latest Volume":"4,145,130","Market Cap":"30,489,851,904","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":26.003668,"PB Ratio":4.474902,"Previous Close":104.48,"ROE":0.16519,"DTE":59.026,"Industry":"Insurance Brokers","Sector":"Financial Services","Beta":0.839,"Trailing PEG":null,"Trailing PE":29.625349,"Trailing PS":29.625349,"Quick Ratio":0.446,"Day High":107.1,"Day Low":104.355,"VS Average Volume":1.9710293919,"Company Summary":"Brown & Brown, Inc. markets and sells insurance products and services in the United States, Canada, Ireland, the United Kingdom, and internationally. It operates through four segments: Retail, Programs, Wholesale Brokerage, and Services. The Retail segment provides property and casualty, employee benefits insurance products, personal insurance products, specialties insurance products, risk management strategies, loss control survey and analysis, consultancy, and claims processing services. It serves commercial, public and quasi-public entities, professional, and individual customers. The Programs segment offers professional liability and related package insurance products for dentistry, legal, eyecare, insurance, financial, physicians, real estate title professionals, as well as supplementary insurance products related to weddings, events, medical facilities, and cyber liabilities. This segment also provides public entity-related and specialty programs through a network of independent agents; and program management services for insurance carrier partners. The Wholesale Brokerage segment markets and sells excess and surplus commercial and personal lines insurance through independent agents and brokers. The Services segment offers third-party claims administration and medical utilization management services in the workers' compensation and all-lines liability arenas, Medicare Set-aside, Social Security disability, Medicare benefits advocacy, and claims adjusting services. Brown & Brown, Inc. was founded in 1939 and is headquartered in Daytona Beach, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:26:30"},{"Company Name":"M&T Bank Corporation","Symbol":"MTB","Current Price":"183.16","Latest MA":"186.44","Latest MA 5":184.3759971924,"Latest MA 9":182.7011087375,"Latest MA 20":182.4173360901,"RSI":53.4932668006,"Price Target":200.675,"Difference from MA":"-1.76%","Difference from Open":"-0.17%","Change from Yesterday":"-0.74%","Change from Last Report":"0.06","Latest Volume":"320,855","Market Cap":"29,400,111,104","Earning Date":"16-07-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":11.250614,"PB Ratio":1.119341,"Previous Close":184.53,"ROE":0.09405,"DTE":null,"Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.61,"Trailing PEG":28.8816,"Trailing PE":12.251506,"Trailing PS":12.251506,"Quick Ratio":null,"Day High":183.72,"Day Low":181.66,"VS Average Volume":0.2449607657,"Company Summary":"M&T Bank Corporation operates as a bank holding company for Manufacturers and Traders Trust Company and Wilmington Trust, National Association that provides retail and commercial banking products and services in the United States. The company operates through three segments: Commercial Bank, Retail Bank, and Institutional Services and Wealth Management. It offers a range of credit products and banking services, such as commercial lending and leasing, letters of credits, deposit products, cash management services, commercial real estate loans, and credit facilities secured by various commercial real estate properties to middle-market and large commercial customers. The company also provides customers deposit products, including demand, savings and time accounts, and other services; automobile and recreational finance loans, home equity loans and lines of credit, credit cards, and other loan products, as well as residential mortgage and real estate loans; business loans, cash management, payroll, and direct deposit services to consumers and small businesses through branch network, telephone banking, internet banking, and automated teller machines. In addition, it offers trustee, agency, investment management, security brokerage, and administrative services; personal trust, planning and advisory, fiduciary, asset management, family office, and other services; and investment products, including mutual funds and annuities, and other services for corporations and institutions, investment bankers, corporate tax, finance and legal executives, and other institutional clients. M&T Bank Corporation was founded in 1856 and is headquartered in Buffalo, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:26:30"},{"Company Name":"IQVIA Holdings, Inc.","Symbol":"IQV","Current Price":"159.44","Latest MA":"180.84","Latest MA 5":156.9015014648,"Latest MA 9":151.2952779134,"Latest MA 20":145.3198738098,"RSI":76.7161712425,"Price Target":190.12895,"Difference from MA":"-11.83%","Difference from Open":"0.91%","Change from Yesterday":"0.38%","Change from Last Report":"0.00","Latest Volume":"541,757","Market Cap":"27,582,687,232","Earning Date":"06-05-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":13.209404,"PB Ratio":4.644126,"Previous Close":158.83,"ROE":0.2164,"DTE":242.907,"Industry":"Diagnostics & Research","Sector":"Healthcare","Beta":1.286,"Trailing PEG":0.9819,"Trailing PE":21.781078,"Trailing PS":21.781078,"Quick Ratio":0.723,"Day High":160.23,"Day Low":157.26,"VS Average Volume":0.2325683326,"Company Summary":"IQVIA Holdings Inc. provides clinical research services, commercial insights, and healthcare intelligence to the life sciences and healthcare industries in the Americas, Europe, Africa, and the Asia-Pacific. It operates through three segments: Technology & Analytics Solutions, Research & Development Solutions, and Contract Sales & Medical Solutions. The Technology & Analytics Solutions segment offers a range of cloud-based applications and related implementation services; real world solutions that enable life sciences and provider customers to generate and disseminate evidence, which informs health care decision making and improves patients' outcomes; and strategic and implementation consulting services, such as advanced analytics and commercial processes outsourcing services. This segment also provides country level performance metrics related to sales of pharmaceutical products, prescribing trends, medical treatment, and promotional activity across various channels, including retail, hospital, and mail order; and measurement of sales or prescribing activity at the regional, zip code, and individual prescriber level. The Research & Development Solutions segment offers project management and clinical monitoring; clinical trial support; strategic planning and design services; and patient and site centric solutions, as well as central laboratory, genomic, bioanalytical, ADME, discovery, and vaccine and biomarker laboratory services. The Contract Sales & Medical Solutions segment provides health care provider and patient engagement services, and scientific strategy and medical affairs services. It serves pharmaceutical, biotechnology, device and diagnostic, and consumer health companies. It has a strategic collaboration with Sarah Cannon Research Institute to enhance clinical trial processes. The company was formerly known as Quintiles IMS Holdings, Inc. and changed its name to IQVIA Holdings Inc. in November 2017. The company is based in Durham, North Carolina.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:26:30"},{"Company Name":"Centene Corporation","Symbol":"CNC","Current Price":"54.75","Latest MA":"59.92","Latest MA 5":55.2899993896,"Latest MA 9":55.1677771674,"Latest MA 20":57.1809997559,"RSI":33.0814944303,"Price Target":76.5,"Difference from MA":"-8.63%","Difference from Open":"-0.60%","Change from Yesterday":"-0.94%","Change from Last Report":"-0.24","Latest Volume":"2,185,039","Market Cap":"27,243,763,712","Earning Date":"25-04-2025","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":7.7769885,"PB Ratio":0.9757445,"Previous Close":55.27,"ROE":0.12527001,"DTE":65.384,"Industry":"Healthcare Plans","Sector":"Healthcare","Beta":0.457,"Trailing PEG":0.5738,"Trailing PE":8.075221,"Trailing PS":8.075221,"Quick Ratio":1.068,"Day High":55.26,"Day Low":54.29,"VS Average Volume":0.4618539735,"Company Summary":"Centene Corporation operates as a healthcare enterprise that provides programs and services to under-insured and uninsured families, and commercial organizations in the United States. The company operates through four segments: Medicaid, Medicare, Commercial, and Other. The Medicaid segment offers the temporary assistance for needy families; medicaid expansion; aged, blind, or disabled; and children's health insurance programs, as well as long-term services and supports; foster care; and medicare-medicaid plans. This segment also provides healthcare products and services. The Medicare segment offers special needs and medicare supplement, and prescription drug plans. The Commercial segment provides health insurance marketplace product for individual, small, and large group commercials. The Other segment operates clinical healthcare and pharmacies, as well as offers vision and dental, behavioral health, federal, and corporate management services. It provides services through primary and specialty care physicians, hospitals, behavioral health practitioners, and ancillary providers. The company was founded in 1984 and is headquartered in Saint Louis, Missouri.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:26:30"},{"Company Name":"PPL Corporation","Symbol":"PPL","Current Price":"34.25","Latest MA":"33.67","Latest MA 5":33.8326065063,"Latest MA 9":33.9496070014,"Latest MA 20":34.1769773483,"RSI":56.2557930126,"Price Target":37.47333,"Difference from MA":"1.73%","Difference from Open":"0.94%","Change from Yesterday":"1.39%","Change from Last Report":"0.10","Latest Volume":"1,875,343","Market Cap":"25,319,792,640","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":18.715847,"PB Ratio":1.7704834,"Previous Close":33.78,"ROE":0.07018,"DTE":121.312,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.668,"Trailing PEG":1.2943,"Trailing PE":25.5597,"Trailing PS":25.5597,"Quick Ratio":0.52,"Day High":34.31,"Day Low":33.84,"VS Average Volume":0.3327230092,"Company Summary":"PPL Corporation provides electricity and natural gas to approximately 3.5 million customers in the United States. It operates through three segments: Kentucky Regulated, Pennsylvania Regulated, and Rhode Island Regulated. The company delivers electricity to customers in Pennsylvania, Kentucky, Virginia, and Rhode Island; delivers natural gas to customers in Kentucky and Rhode Island; and generates electricity from power plants in Kentucky. PPL Corporation was founded in 1920 and is headquartered in Allentown, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:26:30"},{"Company Name":"International Paper Company","Symbol":"IP","Current Price":"47.12","Latest MA":"52.04","Latest MA 5":47.4339998474,"Latest MA 9":47.3422221205,"Latest MA 20":48.0228767929,"RSI":43.0857889855,"Price Target":54.32308,"Difference from MA":"-9.46%","Difference from Open":"0.92%","Change from Yesterday":"0.08%","Change from Last Report":"0.17","Latest Volume":"1,105,072","Market Cap":"24,874,741,760","Earning Date":"31-07-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":15.706666,"PB Ratio":1.3746426,"Previous Close":47.08,"ROE":0.03006,"DTE":57.086,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":0.994,"Trailing PEG":0.9443,"Trailing PE":40.273506,"Trailing PS":40.273506,"Quick Ratio":0.867,"Day High":47.14,"Day Low":46.3422,"VS Average Volume":0.2124218512,"Company Summary":"International Paper Company produces and sells renewable fiber-based packaging and pulp products in North America, Latin America, Europe, and North Africa. It operates through two segments, Industrial Packaging and Global Cellulose Fibers. The company offers linerboard, medium, whitetop, recycled linerboard, recycled medium and saturating kraft; and pulp for a range of applications, such as diapers, towel and tissue products, feminine care, incontinence, and other personal care products, as well as specialty pulps for use in textiles, construction materials, paints, coatings, and others. The company sells its products directly to end users and converters, as well as through agents, resellers, and distributors. The company was founded in 1898 and is headquartered in Memphis, Tennessee.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:26:30"},{"Company Name":"Dover Corporation","Symbol":"DOV","Current Price":"178.69","Latest MA":"186.60","Latest MA 5":179.8589981689,"Latest MA 9":178.693889228,"Latest MA 20":179.9975444946,"RSI":48.0750215321,"Price Target":201.3085,"Difference from MA":"-4.23%","Difference from Open":"0.57%","Change from Yesterday":"-0.25%","Change from Last Report":"0.01","Latest Volume":"284,623","Market Cap":"24,499,800,064","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":18.989906,"PB Ratio":3.432416,"Previous Close":179.14,"ROE":0.16876,"DTE":41.649,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":1.268,"Trailing PEG":2.2833,"Trailing PE":23.762634,"Trailing PS":23.762634,"Quick Ratio":1.489,"Day High":178.78,"Day Low":176.265,"VS Average Volume":0.2471494578,"Company Summary":"Dover Corporation provides equipment and components, consumable supplies, aftermarket parts, software and digital solutions, and support services worldwide. The company's Engineered Products segment provides various equipment, component, software, solution, and services that are used in vehicle aftermarket, aerospace and defense, industrial winch and hoist, and fluid dispensing end-market. This segment offers software solutions and services used in light and heavy-duty vehicle lifts, wheel service equipment, vehicle diagnostics, and vehicle collision repair solutions; winches, hoists, bearings, drives, and electric monitoring system; and radio frequency and microwave filters and switches, and signal intelligence solutions, as well as soldering and fluid dispensing solutions. Its Clean Energy & Fueling segment offers component, equipment, and software and service solution enabling safe storage and transport of fuel, cryogenic gases, and hazardous fluids, as well as operation of retail fueling and vehicle wash establishment. The company's Imaging & Identification segment provides precision marking and coding, product traceability equipment, brand protection, and digital textile printing equipment and solution, as well as consumable, software, and service to packaged and consumer goods, pharmaceutical, industrial manufacturing, textile, and other end-market. Its Pumps & Process Solutions segment manufactures specialty pump, connector, flow meter, fluid connecting solution, plastics and polymer processing equipment, and engineered components for rotating and reciprocating machines. The company's Climate & Sustainability Technologies segment manufactures refrigeration system, refrigeration display case, commercial glass refrigerator and freezer door, and brazed plate heat exchanger for industrial heating and cooling, and residential climate control applications. The company was incorporated in 1947 and is headquartered in Downers Grove, Illinois.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:26:30"},{"Company Name":"STERIS plc (Ireland)","Symbol":"STE","Current Price":"241.72","Latest MA":"222.26","Latest MA 5":242.2480008545,"Latest MA 9":242.4811128743,"Latest MA 20":244.9180014954,"RSI":47.3610106423,"Price Target":263.09888,"Difference from MA":"8.76%","Difference from Open":"0.37%","Change from Yesterday":"0.41%","Change from Last Report":"-0.10","Latest Volume":"114,381","Market Cap":"23,778,553,856","Earning Date":"14-05-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":24.244734,"PB Ratio":3.5983624,"Previous Close":240.74,"ROE":0.09458999,"DTE":33.292,"Industry":"Medical Devices","Sector":"Healthcare","Beta":0.943,"Trailing PEG":1.9514,"Trailing PE":39.24026,"Trailing PS":39.24026,"Quick Ratio":1.189,"Day High":242.125,"Day Low":239.74,"VS Average Volume":0.1762348504,"Company Summary":"STERIS plc provides infection prevention products and services worldwide. It operates through three segments: Healthcare, Applied Sterilization Technologies (AST), and Life Sciences. The Healthcare segment offers cleaning chemistries and sterility assurance products; automated endoscope reprocessing system and tracking products; endoscopy accessories, washers, sterilizers, and other pieces of capital equipment for the operation of a sterile processing department; and equipment used directly in procedure rooms, including surgical tables, lights, and connectivity solutions, as well as equipment management services. It also provides capital equipment installation, maintenance, upgradation, repair, and troubleshooting services; preventive maintenance programs and repair services; instrument, devices, and endoscope repair and maintenance services; and custom process improvement consulting and outsourced instrument sterile processing services. The AST segment provides contract sterilization and testing services for medical device and pharmaceutical manufacturers through a network of contract sterilization and laboratory facilities, as well as integrated sterilization equipment and control systems to medical device manufacturers and research institutions. The Life Sciences segment designs, manufactures, and sells consumable products, such as pharmaceutical detergents, cleanroom disinfectants and sterilants, pharmaceutical grade and research sterilizers and washers, sterility assurance and maintenance products, vaporized hydrogen peroxide room decontamination systems and sterilizers, and high purity water and pure steam generators. It also offers equipment installation, maintenance, upgradation, repair, and troubleshooting services; and preventive maintenance programs and repair services. It serves its products and services to hospitals, other healthcare providers, and pharmaceutical manufacturers. The company was founded in 1985 and is headquartered in Mentor, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:26:30"},{"Company Name":"Waters Corporation","Symbol":"WAT","Current Price":"347.87","Latest MA":"369.59","Latest MA 5":348.6519968262,"Latest MA 9":348.4233302138,"Latest MA 20":351.3599962769,"RSI":47.2977545514,"Price Target":387.56525,"Difference from MA":"-5.88%","Difference from Open":"0.77%","Change from Yesterday":"0.53%","Change from Last Report":"0.02","Latest Volume":"96,009","Market Cap":"20,701,429,760","Earning Date":"06-05-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":26.904099,"PB Ratio":10.5469475,"Previous Close":346.05,"ROE":0.40822,"DTE":78.582,"Industry":"Diagnostics & Research","Sector":"Healthcare","Beta":1.117,"Trailing PEG":2.2787,"Trailing PE":31.624544,"Trailing PS":31.624544,"Quick Ratio":1.141,"Day High":348.26,"Day Low":341.51,"VS Average Volume":0.1773301023,"Company Summary":"Waters Corporation provides analytical workflow solutions in Asia, the Americas, and Europe. It operates through two segments: Waters and TA. The company designs, manufactures, sells, and services high and ultra-performance liquid chromatography, as well as mass spectrometry (MS) technology systems and support products, including chromatography columns, other consumable products, and post-warranty service plans. It designs, manufactures, sells, and services thermal analysis, rheometry, and calorimetry instruments; and develops and supplies software-based products that interface with its instruments, as well as other manufacturers' instruments. In addition, the company offers MS technology are used in drug discovery and development comprising clinical trial testing, the analysis of proteins in disease processes, nutritional safety analysis, and environmental testing. Further, the company provides thermal analysis, rheometry, and calorimetry instruments for use in predicting the suitability and stability of fine chemicals, pharmaceuticals, water, polymers, metals, and viscous liquids for various industrial, consumer good, and healthcare products, as well as for life science research. Its products are used by clinical, pharmaceutical, biochemical, industrial, nutritional safety, environmental, academic, and governmental customers working in research and development, quality assurance, and other laboratory applications. The company was founded in 1958 and is headquartered in Milford, Massachusetts.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:26:30"},{"Company Name":"Weyerhaeuser Company","Symbol":"WY","Current Price":"27.27","Latest MA":"28.35","Latest MA 5":27.190000061,"Latest MA 9":26.7188891856,"Latest MA 20":26.1804358253,"RSI":69.3845064948,"Price Target":33.76923,"Difference from MA":"-3.80%","Difference from Open":"0.11%","Change from Yesterday":"-0.33%","Change from Last Report":"0.07","Latest Volume":"1,025,608","Market Cap":"19,778,195,456","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":31.709303,"PB Ratio":2.0517642,"Previous Close":27.36,"ROE":0.03706,"DTE":53.8,"Industry":"REIT - Specialty","Sector":"Real Estate","Beta":1.169,"Trailing PEG":1.8401,"Trailing PE":55.65306,"Trailing PS":55.65306,"Quick Ratio":1.1,"Day High":27.38,"Day Low":26.97,"VS Average Volume":0.2576791869,"Company Summary":"Weyerhaeuser Company, one of the world's largest private owners of timberlands, began operations in 1900. We own or control approximately 11 million acres of timberlands in the U.S. and manage additional timberlands under long-term licenses in Canada. We manage these timberlands on a sustainable basis in compliance with internationally recognized forestry standards. We are also one of the largest manufacturers of wood products in North America. Our company is a real estate investment trust. In 2022, we generated $10.2 billion in net sales and employed approximately 9,200 people who serve customers worldwide. Our common stock trades on the New York Stock Exchange under the symbol WY.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:26:30"},{"Company Name":"Lennox International, Inc.","Symbol":"LII","Current Price":"551.26","Latest MA":"597.50","Latest MA 5":553.1879985352,"Latest MA 9":554.5088897027,"Latest MA 20":569.2604945068,"RSI":37.1821978974,"Price Target":559.1667,"Difference from MA":"-7.74%","Difference from Open":"-0.23%","Change from Yesterday":"0.06%","Change from Last Report":"0.06","Latest Volume":"93,995","Market Cap":"19,561,351,168","Earning Date":"23-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":23.59846,"PB Ratio":22.950998,"Previous Close":550.95,"ROE":1.3148301,"DTE":174.757,"Industry":"Building Products & Equipment","Sector":"Industrials","Beta":1.145,"Trailing PEG":2.0707,"Trailing PE":24.587868,"Trailing PS":24.587868,"Quick Ratio":0.676,"Day High":555.42,"Day Low":548.7,"VS Average Volume":0.2227918729,"Company Summary":"Lennox International Inc., together with its subsidiaries, designs, manufactures, and markets products for the heating, ventilation, air conditioning, and refrigeration markets in the United States, Canada, and internationally. The Home Comfort Solutions segment provides furnaces, air conditioners, heat pumps, packaged heating and cooling systems, indoor air quality equipment, comfort control products, and replacement parts and supplies; residential heating, ventilation, cooling equipment, and air conditioning; and evaporator coils and unit heaters under Lennox, Dave Lennox Signature Collection, Armstrong Air, Ducane, AirEase, Concord, MagicPak, Advanced Distributor Products, Allied, Elite Series, Merit Series, Comfort Sync, Healthy Climate, iComfort, ComfortSense, and Lennox Stores name. The Building Climate Solutions segment offers unitary heating and air conditioning equipment, applied systems, controls, installation and service of commercial heating and cooling equipment, variable refrigerant flow commercial, curb, curb adapters, drop box diffusers, HVAC recycling, and salvage service. This segment also provides condensing units, unit coolers, fluid coolers, air cooled condensers, air handlers, and refrigeration rack systems for preserving food and other perishables; and compressor racks and industrial process chillers under the Lennox, Model L, CORE, Enlight, Xion, Energence, Prodigy, Strategos, Raider, Lennox VRF, Lennox National Account Services, Allied Commercial, Elite, AES Industries, Mechanical, and Reclaim, Heatcraft Worldwide and Chandler Refrigeration, Bohn, MAGNA, Larkin, Climate Control, Chandler Refrigeration, IntelliGen, and Interlink brand name. In addition, the company provides small package units, rooftop units, chillers, air handlers, and fan coils. It sells its products and services through direct sales, distributors, and company-owned parts and supplies stores. The company was founded in 1895 and is headquartered in Richardson, Texas.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:26:30"},{"Company Name":"Western Digital Corporation","Symbol":"WDC","Current Price":"55.89","Latest MA":"47.18","Latest MA 5":55.9960000305,"Latest MA 9":55.0247705926,"Latest MA 20":52.6526777573,"RSI":72.0409114145,"Price Target":59.00286,"Difference from MA":"18.47%","Difference from Open":"1.10%","Change from Yesterday":"0.40%","Change from Last Report":"0.00","Latest Volume":"1,292,748","Market Cap":"19,498,792,960","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":6.343927,"PB Ratio":3.767696,"Previous Close":55.67,"ROE":0.13558,"DTE":null,"Industry":"Computer Hardware","Sector":"Technology","Beta":1.543,"Trailing PEG":null,"Trailing PE":19.14041,"Trailing PS":19.14041,"Quick Ratio":0.954,"Day High":56.05,"Day Low":55.1321,"VS Average Volume":0.1675275781,"Company Summary":"Western Digital Corporation develops, manufactures, and sells data storage devices and solutions in the United States, China, Hong Kong, Europe, the Middle East, Africa, rest of Asia, and internationally. It offers client devices, including hard disk drives (HDDs) and solid state drives (SSDs) for desktop and notebook personal computers (PCs), gaming consoles, and set top boxes; and flash-based embedded storage products for mobile phones, tablets, notebook PCs, and other portable and wearable devices, as well as automotive, Internet of Things, industrial, and connected home applications. The company also provides enterprise HDDs; enterprise SSDs consisting of flash-based SSDs and software solutions for use in enterprise servers, online transactions, artificial intelligence-related workloads, data analysis, and other enterprise applications; and data storage platforms. In addition, it offers external HDD storage products in mobile and desktop form; client portable SSDs; removable cards that are used in consumer devices comprising mobile phones, tablets, imaging systems, and cameras and smart video systems; universal serial bus flash drives for use in the computing and consumer markets; and wireless drive products used in-field backup of created content, as well as wireless streaming of high-definition movies, photos, music, documents to tablets, smartphones, and PCs. The company sells its products under the Western Digital, SanDisk, and WD brands to original equipment manufacturers, distributors, dealers, resellers, and retailers. Western Digital Corporation was founded in 1970 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:26:30"},{"Company Name":"Mid-America Apartment Communiti","Symbol":"MAA","Current Price":"150.66","Latest MA":"156.34","Latest MA 5":150.7540001221,"Latest MA 9":151.504444987,"Latest MA 20":154.6994993286,"RSI":35.7829885604,"Price Target":170.76923,"Difference from MA":"-3.63%","Difference from Open":"0.05%","Change from Yesterday":"0.20%","Change from Last Report":"0.15","Latest Volume":"422,704","Market Cap":"18,096,977,920","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":36.303616,"PB Ratio":2.9606194,"Previous Close":150.36,"ROE":0.09368,"DTE":82.626,"Industry":"REIT - Residential","Sector":"Real Estate","Beta":0.778,"Trailing PEG":null,"Trailing PE":31.322247,"Trailing PS":31.322247,"Quick Ratio":0.043,"Day High":151.44,"Day Low":149.35,"VS Average Volume":0.4395629993,"Company Summary":"MAA, an S&P 500 company, is a real estate investment trust (REIT) focused on delivering full-cycle and superior investment performance for shareholders through the ownership, management, acquisition, development and redevelopment of quality apartment communities primarily in the Southeast, Southwest and Mid-Atlantic regions of the United States. As of March 31, 2025, MAA had ownership interest in 104,011 apartment units, including communities currently in development, across 16 states and the District of Columbia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:26:30"},{"Company Name":"Ball Corporation","Symbol":"BALL","Current Price":"55.18","Latest MA":"53.51","Latest MA 5":54.6179999695,"Latest MA 9":53.9366670905,"Latest MA 20":53.5642482605,"RSI":70.1647241131,"Price Target":60.75688,"Difference from MA":"3.11%","Difference from Open":"1.03%","Change from Yesterday":"0.46%","Change from Last Report":"0.05","Latest Volume":"584,868","Market Cap":"15,307,924,480","Earning Date":"06-05-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":15.631728,"PB Ratio":2.803292,"Previous Close":54.93,"ROE":0.08219,"DTE":126.809,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":1.083,"Trailing PEG":null,"Trailing PE":31.352274,"Trailing PS":31.352274,"Quick Ratio":0.638,"Day High":55.39,"Day Low":54.465,"VS Average Volume":0.2153852953,"Company Summary":"Ball Corporation supplies aluminum packaging products for the beverage, personal care, and household products industries in the United States, Brazil, and internationally. The company manufactures and sells aluminum beverage containers to fillers of carbonated soft drinks, beer, energy drinks, and other beverages. It manufactures and sells extruded aluminum aerosol containers, recloseable aluminum bottles, aluminum cups, and aluminum slugs. Ball Corporation was founded in 1880 and is headquartered in Westminster, Colorado.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:26:30"},{"Company Name":"Jacobs Solutions Inc.","Symbol":"J","Current Price":"127.44","Latest MA":"128.23","Latest MA 5":127.4749989624,"Latest MA 9":126.4383318753,"Latest MA 20":126.8162381439,"RSI":57.5533204694,"Price Target":144.00175,"Difference from MA":"-0.62%","Difference from Open":"0.76%","Change from Yesterday":"0.30%","Change from Last Report":"0.03","Latest Volume":"121,978","Market Cap":"15,312,079,872","Earning Date":"06-05-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":19.163157,"PB Ratio":3.96969,"Previous Close":127.06,"ROE":0.06804,"DTE":66.356,"Industry":"Engineering & Construction","Sector":"Industrials","Beta":0.76,"Trailing PEG":1.6525,"Trailing PE":42.197018,"Trailing PS":42.197018,"Quick Ratio":1.445,"Day High":127.4991,"Day Low":126.234,"VS Average Volume":0.1339215232,"Company Summary":"Jacobs Solutions Inc. engages in the infrastructure and advanced facilities, and consulting businesses in the United States, Europe, Canada, India, Asia, Australia, New Zealand, the Middle East, and Africa. The company offers consulting, planning, architecture, design, engineering, and infrastructure delivery services including project, program, and construction management and long-term operation of facilities. It also provides consulting services for consumer and manufacturing, defense and security, energy and utilities, financial services, government, health and life sciences, and transport sectors. The company was founded in 1947 and is headquartered in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:26:30"},{"Company Name":"CF Industries Holdings, Inc.","Symbol":"CF","Current Price":"93.21","Latest MA":"83.68","Latest MA 5":93.1139985962,"Latest MA 9":92.7522211032,"Latest MA 20":90.7664993744,"RSI":59.936806627,"Price Target":87.05947,"Difference from MA":"11.39%","Difference from Open":"-0.03%","Change from Yesterday":"-2.13%","Change from Last Report":"-0.18","Latest Volume":"1,128,080","Market Cap":"15,100,951,552","Earning Date":"06-08-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":15.082524,"PB Ratio":3.2108164,"Previous Close":95.24,"ROE":0.20794001,"DTE":45.169,"Industry":"Agricultural Inputs","Sector":"Basic Materials","Beta":0.955,"Trailing PEG":0.6546,"Trailing PE":12.329365,"Trailing PS":12.329365,"Quick Ratio":2.117,"Day High":94.5,"Day Low":92.5,"VS Average Volume":0.4367771232,"Company Summary":"CF Industries Holdings, Inc., together with its subsidiaries, engages in the manufacture and sale of hydrogen and nitrogen products for energy, fertilizer, emissions abatement, and other industrial activities in North America, Europe, and internationally. The company operates through Ammonia, Granular Urea, UAN, AN, and Other segments. Its principal products include anhydrous ammonia, granular urea, urea ammonium nitrate, and ammonium nitrate products. The company also offers diesel exhaust fluid, urea liquor, nitric acid, and aqua ammonia products. It primarily serves cooperatives, retailers, independent fertilizer distributors, traders, wholesalers, and industrial users. CF Industries Holdings, Inc. was founded in 1946 and is headquartered in Northbrook, Illinois.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"12-06-2025 20:26:30"},{"Company Name":"J.B. Hunt Transport Services, I","Symbol":"JBHT","Current Price":"140.47","Latest MA":"159.26","Latest MA 5":141.6789985352,"Latest MA 9":140.5449985758,"Latest MA 20":141.2692499084,"RSI":49.0831322167,"Price Target":152.08833,"Difference from MA":"-11.80%","Difference from Open":"0.40%","Change from Yesterday":"-0.31%","Change from Last Report":"-0.07","Latest Volume":"211,383","Market Cap":"13,933,369,344","Earning Date":"15-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":19.56337,"PB Ratio":3.6034222,"Previous Close":140.9,"ROE":0.13971,"DTE":49.659,"Industry":"Integrated Freight & Logistics","Sector":"Industrials","Beta":1.296,"Trailing PEG":1.8498,"Trailing PE":25.492739,"Trailing PS":25.492739,"Quick Ratio":0.665,"Day High":140.86,"Day Low":138.19,"VS Average Volume":0.1587648394,"Company Summary":"J.B. Hunt Transport Services, Inc. provides surface transportation, delivery, and logistic services in the United States. It operates through five segments: Intermodal (JBI), Dedicated Contract Services (DCS), Integrated Capacity Solutions (ICS), Final Mile Services (FMS), and Truckload (JBT). The JBI segment offers intermodal freight solutions. It operates 122,272 pieces of company-owned trailing equipment; owns and maintains its chassis fleet of 103,850 units; and manages a fleet of 6,153 company-owned tractors, 349 independent contractor trucks, and 8,117 company drivers. The DCS segment designs, develops, and executes supply chain solutions that support various transportation networks. As of December 31, 2024, it operated 12,048 company-owned trucks, 598 customer-owned trucks, and a contractor trucks. The company operates 27,149 owned pieces of trailing equipment and 4,897 customer-owned trailers. The ICS segment provides freight brokerage and transportation logistics solutions; flatbed, refrigerated, expedited, and less-than-truckload, as well as dry-van and intermodal solutions; online multimodal marketplace; and logistics management for customers to outsource their transportation functions. The FMS segment offers delivery services through 1,166 company-owned trucks, 206 customer-owned trucks, and 36 independent contractor trucks; and 1,123 owned pieces of trailing equipment and 104 customer-owned trailers. The JBT segment provides dry-van freight services by utilizing tractors and trailers operating over roads and highways through two company-owned tractors and 12,895 company-owned trailers. It transports or arranges for the transportation of freight, such as general merchandise, specialty consumer items, appliances, forest and paper products, food and beverages, building materials, soaps and cosmetics, automotive parts, agricultural products, electronics, and chemicals. The company was incorporated in 1961 and is headquartered in Lowell, Arkansas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:26:30"},{"Company Name":"Teradyne, Inc.","Symbol":"TER","Current Price":"86.07","Latest MA":"101.19","Latest MA 5":86.7180008545,"Latest MA 9":84.2588882785,"Latest MA 20":82.1170353088,"RSI":61.9204815651,"Price Target":96.48625,"Difference from MA":"-14.94%","Difference from Open":"0.20%","Change from Yesterday":"-0.83%","Change from Last Report":"-0.20","Latest Volume":"729,817","Market Cap":"13,807,349,760","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":20.251764,"PB Ratio":4.9434266,"Previous Close":86.79,"ROE":0.21551001,"DTE":2.458,"Industry":"Semiconductor Equipment & Materials","Sector":"Technology","Beta":1.673,"Trailing PEG":1.4531,"Trailing PE":24.382437,"Trailing PS":24.382437,"Quick Ratio":1.492,"Day High":86.565,"Day Low":85.6,"VS Average Volume":0.2160810537,"Company Summary":"Teradyne, Inc. designs, develops, manufactures, and sells automated test systems and robotics products in the United States, Asia Pacific, Europe, the Middle East, and Africa. It operates through Semiconductor Test, Robotics, and Other segments. The Semiconductor Test segment offers products and services for wafer level and device package testing, and system level testing of semiconductor devices in automotive, industrial, communications, consumer, smartphones, cloud, computer and electronic game, and other applications. This segment also provides FLEX test platform systems; J750 test system to address the volume semiconductor devices, including microcontrollers; Magnum platform that tests memory devices, such as flash memory and DRAM; and ETS platform for semiconductor manufacturers, and assembly and test subcontractors in the analog\/mixed signal markets. It serves integrated device manufacturers that integrate the fabrication of silicon wafers into their business; fabless companies that outsource the manufacturing of silicon wafers; foundries; and semiconductor assembly and test providers. The Robotics segment provides collaborative robotic arms, autonomous mobile robots, and advanced robotic control software for manufacturing, logistics, and industrial customers. It also provides semiconductor test systems and instruments, defense\/aerospace test instrumentation and systems, storage and system level test systems, wireless test systems and robotics products, and circuit-board test and inspection systems; production board test; and wireless test solutions for silicon validation, wireless module manufacturing, and wireless end device manufacturing under the LitePoint brand. Teradyne, Inc. was incorporated in 1960 and is headquartered in North Reading, Massachusetts.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"12-06-2025 20:26:30"},{"Company Name":"Franklin Resources, Inc.","Symbol":"BEN","Current Price":"22.68","Latest MA":"20.15","Latest MA 5":22.1650003052,"Latest MA 9":21.8461111705,"Latest MA 20":21.879249897,"RSI":76.5364849979,"Price Target":20.18182,"Difference from MA":"12.51%","Difference from Open":"1.09%","Change from Yesterday":"0.60%","Change from Last Report":"0.04","Latest Volume":"1,568,189","Market Cap":"11,916,187,648","Earning Date":"02-05-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.721154,"PB Ratio":0.9649757,"Previous Close":22.54,"ROE":0.02799,"DTE":24.117,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.458,"Trailing PEG":0.4589,"Trailing PE":32.862316,"Trailing PS":32.862316,"Quick Ratio":1.642,"Day High":22.695,"Day Low":22.265,"VS Average Volume":0.3047997058,"Company Summary":"Franklin Resources, Inc. is a publicly owned asset management holding company. Through its subsidiaries, the firm provides its services to individuals, institutions, pension plans, trusts, and partnerships. It launches equity, fixed income, balanced, and multi-asset mutual funds through its subsidiaries. The firm invests in the public equity, fixed income, and alternative markets. Franklin Resources, Inc. was founded in 1947 and is based in San Mateo, California with an additional office in Calgary, Canada; Dubai, United Arab Emirates; Edinburgh, United Kingdom; Fort Lauderdale, United States; Hyderabad, India; London, United Kingdom; Rancho Cordova, United states; Shanghai, China; Singapore; Stamford, United States; and Vienna, Austria.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"12-06-2025 20:26:30"},{"Company Name":"Henry Schein, Inc.","Symbol":"HSIC","Current Price":"71.02","Latest MA":"71.55","Latest MA 5":70.9600012817,"Latest MA 9":70.6433338081,"Latest MA 20":71.4220006714,"RSI":52.0425460386,"Price Target":76.35286,"Difference from MA":"-0.73%","Difference from Open":"0.61%","Change from Yesterday":"-0.17%","Change from Last Report":"-0.01","Latest Volume":"443,009","Market Cap":"8,877,854,720","Earning Date":"05-05-2025","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":13.657692,"PB Ratio":2.6228902,"Previous Close":71.14,"ROE":0.084680006,"DTE":68.32,"Industry":"Medical Distribution","Sector":"Healthcare","Beta":0.867,"Trailing PEG":1.742,"Trailing PE":22.124609,"Trailing PS":22.124609,"Quick Ratio":0.585,"Day High":71.34,"Day Low":70.32,"VS Average Volume":0.2990428797,"Company Summary":"Henry Schein, Inc. provides health care products and services to office-based dental and medical practitioners, and alternate sites of care worldwide. It operates through Global Distribution and Value-Added Services; Global Specialty Products; and Global Technology segments. The company offers dental merchandise, including infection-control products, handpieces, preventatives, impression materials, composites, anesthetics, teeth, dental implants, gypsum, acrylics, articulators, abrasives, and PPE products; dental equipment, such as dental chairs, delivery units and lights, digital dental laboratories, X-ray supplies and equipment, and high-tech and digital restoration equipment, as well as equipment repair; and branded and generic pharmaceuticals, vaccines, surgical products, diagnostic tests, and vitamins. It also provides financial services on a nonrecourse basis, education services for practitioners, consulting, and other services; and consumable merchandise under its own brand. In addition, the company manufactures, markets, and sells dental implant and biomaterial products; and endodontic, orthodontic and orthopedic products and other health care-related products and services. Further, it is involved in the development and distribution of practice management software, e-services, and other products to health care providers. The company serves customers in dental practices, laboratories, physician practices, and ambulatory surgery centers, as well as government, institutional health care clinics and other alternate care clinics. Henry Schein, Inc. was founded in 1932 and is headquartered in Melville, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:26:30"},{"Company Name":"Generac Holdlings Inc.","Symbol":"GNRC","Current Price":"129.64","Latest MA":"143.88","Latest MA 5":129.3312023804,"Latest MA 9":127.5840020006,"Latest MA 20":126.4338011902,"RSI":63.1972823579,"Price Target":152.0061,"Difference from MA":"-9.90%","Difference from Open":"0.96%","Change from Yesterday":"-0.11%","Change from Last Report":"-0.17","Latest Volume":"323,993","Market Cap":"7,659,102,208","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":15.790012,"PB Ratio":3.1017852,"Previous Close":129.78,"ROE":0.13798,"DTE":57.434,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":1.698,"Trailing PEG":1.3765,"Trailing PE":22.584671,"Trailing PS":22.584671,"Quick Ratio":0.772,"Day High":129.9325,"Day Low":127.71,"VS Average Volume":0.3788514473,"Company Summary":"Generac Holdings Inc. designs, manufactures, and distributes energy technology products and solution worldwide. The company offers residential automatic standby generators, automatic transfer switch, air-cooled engine residential standby generators, and liquid-cooled engine generators; Mobile Link, a remote monitoring system for home standby generators; residential battery storage systems; smart home solutions, such as smart thermostats and a suite of home monitoring products. It also provides smart home energy management devices and sensors for heating and cooling system; smart doorbell cameras; and portable and inverter generators; multiple portable battery solutions; manual transfer switches; outdoor power equipment, including trimmers, field and brush mowers, log splitters, stump grinders, chipper shredders, lawn and leaf vacuums, and pressure washers and water pumps; and battery-powered turf care products. In addition, the company offers commercial and industrial products comprising cleaner-burning natural gas fueled generators; light-commercial standby generators and related transfer switches; stationary generators; single-engine industrial generators; industrial standby generators; industrial transfer switches; light towers, mobile generators, commercial mobile pumps, heaters, dust-suppression equipment, and mobile energy storage systems; battery energy storage system and related inverter products; and aftermarket service parts and product accessories. Further, it provides Concerto energy-balancing software platform for controlling and dispatching distributed energy resources. The company distributes its products through independent residential dealers, industrial distributors and dealers, national and regional retailers, e-commerce partners, electrical\/HVAC\/solar wholesalers, solar installers, catalogs, equipment rental companies, and other equipment distributors; and directly to end users. The company was founded in 1959 and is based in Waukesha, Wisconsin.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:26:30"},{"Company Name":"Caesars Entertainment, Inc.","Symbol":"CZR","Current Price":"27.36","Latest MA":"31.84","Latest MA 5":27.1979996643,"Latest MA 9":26.6766663106,"Latest MA 20":27.6744998207,"RSI":51.4052869576,"Price Target":42.86667,"Difference from MA":"-14.09%","Difference from Open":"-0.60%","Change from Yesterday":"-1.95%","Change from Last Report":"-0.13","Latest Volume":"1,220,757","Market Cap":"5,688,964,608","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":20.414179,"PB Ratio":1.4308505,"Previous Close":27.9,"ROE":-0.03767,"DTE":606.801,"Industry":"Resorts & Casinos","Sector":"Consumer Cyclical","Beta":2.309,"Trailing PEG":null,"Trailing PE":null,"Trailing PS":null,"Quick Ratio":0.619,"Day High":27.69,"Day Low":27.065,"VS Average Volume":0.2142507384,"Company Summary":"Caesars Entertainment, Inc. operates as a gaming and hospitality company. The company owns, leases, brands, or manages domestic properties in 18 states with slot machines, video lottery terminals and e-tables, and hotel rooms, as well as table games, including poker. It also operates and conducts retail and online sports wagering across 32 jurisdictions in North America, and iGaming in five jurisdictions in North America; sports betting from retail and online sportsbooks; and other games, such as keno. In addition, the company operates dining venues, bars, nightclubs, lounges, hotels, and entertainment venues; and provides staffing and management services. The company was founded in 1937 and is based in Reno, Nevada.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:26:30"}]