[{"Company Name":"Broadcom Inc.","Symbol":"AVGO","Current Price":"239.37","Latest MA":"167.08","Price Target":237.19081,"Difference from MA":"43.26%","Difference from Open":"-0.26%","Change from Yesterday":"-0.13%","Change from Last Report":"0.00","Latest Volume":"1,325,081","Market Cap":"1,122,013,282,304","Earning Date":"2024-12-12","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":31.456276,"ROE":0.12509,"DTE":166.032,"Industry":"Semiconductors","Sector":"Technology","Beta":1.187,"Trailing PEG":0.6794,"Trailing PE":185.55814,"Trailing PS":23.96696,"Quick Ratio":0.841,"Day High":240.4,"Day Low":238.5,"VS Average Volume":0.0486603254,"Company Summary":"Broadcom Inc. designs, develops, and supplies various semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products worldwide. The company operates in two segments, Semiconductor Solutions and Infrastructure Software. It provides set-top box system-on-chips (SoCs); cable, digital subscriber line, and passive optical networking central office\/consumer premise equipment SoCs; wireless local area network access point SoCs; Ethernet switching and routing custom silicon solutions; serializer\/deserializer application specific integrated circuits; optical and copper, and physical layer devices; and fiber optic components and RF semiconductor devices. The company also offers RF front end modules and filter; Wi-Fi, Bluetooth, and global positioning system\/global navigation satellite system SoCs; custom touch controllers; inductive charging; attached small computer system interface, and redundant array of independent disks controllers and adapters; peripheral component interconnect express; fiber channel host bus adapters; read channel based SoCs; custom flash controllers; preamplifiers; optocouplers, industrial fiber optics, and motion control encoders and subsystems; light emitting diode, ethernet PHYs, switch ICs, and camera microcontrollers. Its products are used in various applications, including enterprise and data center networking, home connectivity, set-top boxes, broadband access, telecommunication equipment, smartphones and base stations, data center servers and storage systems, factory automation, power generation and alternative energy systems, and electronic displays. Broadcom Inc. was founded in 1961 and is headquartered in Palo Alto, California.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"26-12-2024 16:33:27"},{"Company Name":"Intel Corporation","Symbol":"INTC","Current Price":"20.13","Latest MA":"24.91","Price Target":24.32824,"Difference from MA":"-19.18%","Difference from Open":"-0.40%","Change from Yesterday":"-1.25%","Change from Last Report":"-0.15","Latest Volume":"1,771,886","Market Cap":"86,820,683,776","Earning Date":"2025-01-24","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":20.594402,"ROE":-0.15597,"DTE":47.906,"Industry":"Semiconductors","Sector":"Technology","Beta":1.026,"Trailing PEG":0.551,"Trailing PE":"N\/A","Trailing PS":1.6004698,"Quick Ratio":0.833,"Day High":20.26,"Day Low":20.08,"VS Average Volume":0.0252800646,"Company Summary":"Intel Corporation designs, develops, manufactures, markets, and sells computing and related products and services worldwide. It operates through Client Computing Group, Data Center and AI, Network and Edge, Mobileye, and Intel Foundry Services segments. The company's products portfolio comprises central processing units and chipsets, system-on-chips (SoCs), and multichip packages; mobile and desktop processors; hardware products comprising graphics processing units (GPUs), domain-specific accelerators, and field programmable gate arrays (FPGAs); and memory and storage, connectivity and networking, and other semiconductor products. It also offers silicon devices and software products; and optimization solutions for workloads, such as AI, cryptography, security, storage, networking, and leverages various features supporting diverse compute environments. In addition, the company develops and deploys advanced driver assistance systems (ADAS), and autonomous driving technologies and solutions; and provides advanced process technologies backed by an ecosystem of IP, EDA, and design services, as well as systems of chips, including advanced packaging technologies, software and accelerate bring-up, and integration of chips and driving standards. Further, it delivers and deploys intelligent edge platforms that allow developers to achieve agility and drive automation using AI for efficient operations with data integrity, as well as provides hardware and software platforms, tools, and ecosystem partnerships for digital transformation from the cloud to edge. The company serves original equipment manufacturers, original design manufacturers, cloud service providers, and other manufacturers and service providers. It has a strategic agreement with Synopsys, Inc. to develop EDA and IP solutions; and ARM that enables chip designers to build optimized compute SoCs on the Intel 18A process. Intel Corporation was incorporated in 1968 and is headquartered in Santa Clara, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"26-12-2024 16:33:27"},{"Company Name":"Tesla, Inc.","Symbol":"TSLA","Current Price":"459.82","Latest MA":"256.43","Price Target":283.8769,"Difference from MA":"79.32%","Difference from Open":"-1.15%","Change from Yesterday":"-0.82%","Change from Last Report":"-0.15","Latest Volume":"8,034,351","Market Cap":"1,476,049,764,352","Earning Date":"2025-01-24","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":140.9855,"ROE":0.20389,"DTE":18.078,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":2.295,"Trailing PEG":5.6075,"Trailing PE":125.97808,"Trailing PS":15.193513,"Quick Ratio":1.214,"Day High":465.3299,"Day Low":457.76,"VS Average Volume":0.0865261961,"Company Summary":"Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners; and provision of service and repairs to its energy product customers, including under warranty, as well as various financing options to its solar customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was incorporated in 2003 and is headquartered in Austin, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"26-12-2024 16:33:27"}]