[{"Company Name":"Coca-Cola Company (The)","Symbol":"KO","Current Price":"66.85","Latest MA":"65.74","Price Target":71.7132,"Difference from MA":"1.69%","Difference from Open":"-0.96%","Change from Yesterday":"3.56%","Change from Last Report":"0.03","Latest Volume":"17,933,641","Market Cap":"287,976,423,424","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":21.138538,"PB Ratio":10.864619,"Previous Close":64.55,"ROE":0.3723,"DTE":167.358,"Industry":"Beverages - Non-Alcoholic","Sector":"Consumer Defensive","Beta":0.62,"Trailing PEG":2.625,"Trailing PE":27.738588,"Trailing PS":6.21094,"Quick Ratio":0.784,"Day High":67.64,"Day Low":66.41,"VS Average Volume":1.0452316225,"Company Summary":"The Coca-Cola Company, a beverage company, manufactures, markets, and sells various nonalcoholic beverages worldwide. The company provides sparkling soft drinks, sparkling flavors; water, sports, coffee, and tea; juice, value-added dairy, and plant-based beverages; and other beverages. It also offers beverage concentrates and syrups, as well as fountain syrups to fountain retailers, such as restaurants and convenience stores. The company sells its products under the Coca-Cola, Diet Coke\/Coca-Cola Light, Coca-Cola Zero Sugar, caffeine free Diet Coke, Cherry Coke, Fanta Orange, Fanta Zero Orange, Fanta Zero Sugar, Fanta Apple, Sprite, Sprite Zero Sugar, Simply Orange, Simply Apple, Simply Grapefruit, Fresca, Schweppes, Thums Up, Aquarius, Ayataka, BODYARMOR, Ciel, Costa, Dasani, dogadan, FUZE TEA, Georgia, glacéau smartwater, glacéau vitaminwater, Gold Peak, Ice Dew, I LOHAS, Powerade, Topo Chico, AdeS, Del Valle, fairlife, innocent, Minute Maid, and Minute Maid Pulpy brands. It operates through a network of independent bottling partners, distributors, wholesalers, and retailers, as well as through bottling and distribution operators. The company was founded in 1886 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"11-02-2025 19:55:29"},{"Company Name":"ChampionX Corporation","Symbol":"CHX","Current Price":"29.96","Latest MA":"30.16","Price Target":41.14286,"Difference from MA":"-0.63%","Difference from Open":"1.78%","Change from Yesterday":"1.92%","Change from Last Report":"0.08","Latest Volume":"836,298","Market Cap":"5,717,322,240","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":12.607075,"PB Ratio":3.1465926,"Previous Close":29.4,"ROE":0.18280001,"DTE":39.049,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":2.39,"Trailing PEG":1.9788,"Trailing PE":18.160606,"Trailing PS":1.5597656,"Quick Ratio":1.112,"Day High":30.01,"Day Low":29.34,"VS Average Volume":0.3757163472,"Company Summary":"ChampionX Corporation provides chemistry solutions, artificial lift systems, and engineered equipment and technologies to oil and gas companies worldwide. The company operates through four segments: Production Chemical Technologies, Production & Automation Technologies, Drilling Technologies, and Reservoir Chemical Technologies. The Production Chemical Technologies segment offers onshore, offshore, and oil sands chemical solutions, such as corrosion inhibitors, scale inhibitors, emulsion breakers, and biocides to oil and natural gas production and midstream markets to manage and control corrosion, oil and water separation, flow assurance, sour gas treatment, and water-related issues. The Production & Automation Technologies segment provides artificial lift equipment, end-to-end digital automation solutions, and other production equipment and emissions monitoring solutions, including electrical submersible pumping systems, gas lift systems, jet pumps, multiplex surface pumps, plunger lift equipment, progressive cavity pumping systems, downhole rod lift systems, methane emissions monitoring solutions, chemical injection systems, flow control valves, and gauges under the Harbison-Fischer, Norris, Alberta Oil Tool, Oil Lift Technology, PCS Ferguson, Pro-Rod, Upco, Unbridled ESP, Norriseal-Wellmark, Quartzdyne, Spirit, Theta, Timberline, and Windrock brands. The Drilling Technologies segment offers polycrystalline diamond cutter inserts, bearings, valves, nozzles, and mining tools used in oil and gas drill bits under the US Synthetic brand; and high-density ceramic roof bolt mining tools for underground mining operations. The Reservoir Chemical Technologies segment provides chemistry-oriented solutions and technologies for well drilling, cementing, fracturing, acidizing, and other well interventions, as well as fracturing, drilling, cementing, acidizing additives. The company was founded in 1882 and is headquartered in The Woodlands, Texas.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"11-02-2025 19:55:29"},{"Company Name":"Royalty Pharma plc","Symbol":"RPRX","Current Price":"32.32","Latest MA":"27.52","Price Target":40.69778,"Difference from MA":"17.46%","Difference from Open":"2.28%","Change from Yesterday":"1.89%","Change from Last Report":"0.06","Latest Volume":"3,160,425","Market Cap":"19,042,394,112","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":6.8592143,"PB Ratio":2.0984287,"Previous Close":31.72,"ROE":0.17276,"DTE":74.157,"Industry":"Biotechnology","Sector":"Healthcare","Beta":0.466,"Trailing PEG":6.8856,"Trailing PE":12.724409,"Trailing PS":8.403517,"Quick Ratio":1.532,"Day High":32.7227,"Day Low":31.3,"VS Average Volume":0.8681770733,"Company Summary":"Royalty Pharma plc operates as a buyer of biopharmaceutical royalties and a funder of innovations in the biopharmaceutical industry in the United States. It is also involved in the identification, evaluation, and acquisition of royalties on various biopharmaceutical therapies. In addition, the company collaborates with innovators from academic institutions, research hospitals and not-for-profits, small and mid-cap biotechnology companies, and pharmaceutical companies. Its portfolio consists of royalties on approximately 35 commercial products and 14 development-stage product candidates that address various therapeutic areas, such as rare disease, cancer, neuroscience, immunology, respiratory, infectious disease, hematology, and diabetes. The company was founded in 1996 and is based in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"11-02-2025 19:55:29"},{"Company Name":"Super Micro Computer, Inc.","Symbol":"SMCI","Current Price":"40.13","Latest MA":"44.44","Price Target":40.79182,"Difference from MA":"-9.71%","Difference from Open":"-1.18%","Change from Yesterday":"-5.92%","Change from Last Report":"0.10","Latest Volume":"72,905,884","Market Cap":"23,498,723,328","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":10.996962,"PB Ratio":4.3057942,"Previous Close":42.65,"ROE":0.32469,"DTE":39.749,"Industry":"Computer Hardware","Sector":"Technology","Beta":1.279,"Trailing PEG":null,"Trailing PE":19.965176,"Trailing PS":1.5725726,"Quick Ratio":1.805,"Day High":42.39,"Day Low":38.5,"VS Average Volume":1.0507533286,"Company Summary":"Super Micro Computer, Inc., together with its subsidiaries, develops and manufactures high performance server and storage solutions based on modular and open architecture in the United States, Europe, Asia, and internationally. Its solutions range from complete server, storage systems, modular blade servers, blades, workstations, full racks, networking devices, server sub-systems, server management software, and security software. The company provides application-optimized server solutions, rackmount and blade servers, storage, and subsystems and accessories; and server software management solutions, such as Server Management Suite, including Supermicro Server Manager, Supermicro Power Management software, Supermicro Update Manager, SuperCloud Composer, and SuperDoctor 5. In addition, it offers server subsystems and accessories comprising server boards, chassis, power supplies, and other accessories. Further, the company provides server and storage system integration, configuration, and software upgrade and update services; and technical documentation services, as well as identifies service requirements, creates and executes project plans, and conducts verification testing and technical documentation, and training services. Additionally, it offers help desk and on-site product support services for its server and storage systems; and customer support services, including ongoing maintenance and technical support for its products. The company provides its products to enterprise data centers, cloud computing, artificial intelligence, and 5G and edge computing markets. It sells its products through direct and indirect sales force, distributors, value-added resellers, system integrators, and original equipment manufacturers. The company was incorporated in 1993 and is headquartered in San Jose, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"11-02-2025 19:55:29"},{"Company Name":"Energy Transfer LP","Symbol":"ET","Current Price":"19.90","Latest MA":"17.03","Price Target":22.20235,"Difference from MA":"16.86%","Difference from Open":"-1.00%","Change from Yesterday":"-0.95%","Change from Last Report":"-0.03","Latest Volume":"6,249,116","Market Cap":"68,136,009,728","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":14.416215,"PB Ratio":2.1732008,"Previous Close":20.09,"ROE":0.15253,"DTE":128.9,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":1.643,"Trailing PEG":0.6928,"Trailing PE":14.632353,"Trailing PS":0.8144201,"Quick Ratio":0.835,"Day High":20.1,"Day Low":19.8,"VS Average Volume":0.3749667282,"Company Summary":"Energy Transfer LP provides energy-related services. The company owns and operates natural gas transportation pipeline, and natural gas storage facilities in Texas and Oklahoma; and approximately 20,090 miles of interstate natural gas pipeline. It also sells natural gas to electric utilities, independent power plants, local distribution and other marketing companies, and industrial end-users. In addition, the company owns and operates natural gas gathering pipelines, processing plant, and treating and conditioning facilities in Texas, New Mexico, West Virginia, Pennsylvania, Ohio, Oklahoma, Arkansas, Kansas, Montana, North Dakota, Wyoming, and Louisiana; natural gas gathering, oil pipeline, and oil stabilization facilities in South Texas; and transports and supplies water to natural gas producer in Pennsylvania. Further, it owns 5,700 miles of natural gas liquid (NGL) pipeline; NGL fractionation facilities; NGL storage facilities; and other NGL storage assets and terminal. Additionally, the company provides crude oil transportation, terminalling, acquisition, and marketing activities; owns and operates approximately 14,500 miles of crude oil trunk and gathering pipelines in the Southwest, Midcontinent, and Midwest United States; and sells and distributes gasoline, middle distillate, and motor fuels and other petroleum products. It also offers natural gas compression services; carbon dioxide and hydrogen sulfide removal services; and manages coal and natural resources properties, as well as sells standing timber, leases coal-related infrastructure facilities, collects oil and gas royalty, and generate electrical power. The company was formerly known as Energy Transfer Equity, L.P. and changed its name to Energy Transfer LP in October 2018. Energy Transfer LP was founded in 1996 and is headquartered in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"11-02-2025 19:55:29"},{"Company Name":"GlobalFoundries Inc.","Symbol":"GFS","Current Price":"39.98","Latest MA":"43.39","Price Target":48.56842,"Difference from MA":"-7.87%","Difference from Open":"9.77%","Change from Yesterday":"5.94%","Change from Last Report":"0.25","Latest Volume":"4,024,785","Market Cap":"22,095,144,960","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":15.975066,"PB Ratio":1.915852,"Previous Close":37.74,"ROE":0.066479996,"DTE":24.599,"Industry":"Semiconductors","Sector":"Technology","Beta":1.527,"Trailing PEG":1.4932,"Trailing PE":30.287878,"Trailing PS":3.2617574,"Quick Ratio":1.74,"Day High":40.47,"Day Low":36.27,"VS Average Volume":2.4313492262,"Company Summary":"GlobalFoundries Inc., a semiconductor foundry, provides range of mainstream wafer fabrication services and technologies worldwide. It manufactures various semiconductor devices, including microprocessors, mobile application processors, baseband processors, network processors, radio frequency modems, microcontrollers, and power management units. GlobalFoundries Inc. has a strategic partnership with Efficient Computer to develop high-performance computer processors. The company was incorporated in 2008 and is headquartered in Malta, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"11-02-2025 19:55:29"},{"Company Name":"Edwards Lifesciences Corporatio","Symbol":"EW","Current Price":"70.53","Latest MA":"70.66","Price Target":79.489,"Difference from MA":"-0.19%","Difference from Open":"-0.28%","Change from Yesterday":"-0.80%","Change from Last Report":"-0.08","Latest Volume":"1,098,184","Market Cap":"41,598,595,072","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":28.833889,"PB Ratio":4.358008,"Previous Close":71.1,"ROE":0.19139,"DTE":7.353,"Industry":"Medical Devices","Sector":"Healthcare","Beta":1.12,"Trailing PEG":6.4601,"Trailing PE":27.23166,"Trailing PS":6.587372,"Quick Ratio":2.704,"Day High":71.05,"Day Low":70.32,"VS Average Volume":0.2289237322,"Company Summary":"Edwards Lifesciences Corporation provides products and technologies for structural heart disease and critical care monitoring in the United States, Europe, Japan, and internationally. It offers transcatheter heart valve replacement products for the minimally invasive replacement of aortic heart valves under the Edwards SAPIEN family of valves system; and transcatheter heart valve repair and replacement products to treat mitral and tricuspid valve diseases under the PASCAL PRECISION and Cardioband names. The company also provides surgical structural heart solutions, such as aortic surgical valve under the INSPIRIS name; INSPIRIS RESILLA aortic valve, which offers RESILIA tissue and VFit technology; KONECT RESILIA, a pre-assembled tissue valves conduit for complex combined procedures; and MITRIS RESILIA valve. In addition, it offers critical care solutions, including hemodynamic monitoring systems to measure a patient's heart function and fluid status in surgical and intensive care settings under the FloTrac, Acumen IQ sensors, ClearSight, Acumen IQ cuffs, and ForeSight names; HemoSphere, a monitoring platform that displays physiological information; and Acumen Hypotension Prediction Index software that alerts clinicians in advance of a patient developing dangerously low blood pressure. The company distributes its products through a direct sales force and independent distributors. Edwards Lifesciences Corporation was founded in 1958 and is headquartered in Irvine, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"11-02-2025 19:55:29"},{"Company Name":"Carrier Global Corporation","Symbol":"CARR","Current Price":"65.02","Latest MA":"71.62","Price Target":80.09421,"Difference from MA":"-9.21%","Difference from Open":"0.81%","Change from Yesterday":"-1.83%","Change from Last Report":"-0.01","Latest Volume":"4,721,359","Market Cap":"58,337,697,792","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":18.873785,"PB Ratio":3.9728706,"Previous Close":66.23,"ROE":0.13931,"DTE":85.607,"Industry":"Building Products & Equipment","Sector":"Industrials","Beta":1.212,"Trailing PEG":1.2017,"Trailing PE":38.247055,"Trailing PS":2.3522317,"Quick Ratio":0.513,"Day High":65.56,"Day Low":63.3,"VS Average Volume":0.9072146229,"Company Summary":"Carrier Global Corporation provides heating, ventilating, and air conditioning (HVAC), refrigeration, fire, security, and building automation technologies in the United States, Europe, the Asia Pacific, and internationally. It operates through three segments: HVAC, Refrigeration, and Fire & Security. The HVAC segment provides products, controls, services, and solutions to meet the heating, cooling, and ventilation needs of residential and commercial customers. Its products include air conditioners, heating systems, heat pumps, controls, and aftermarket components, as well as aftermarket repair and maintenance services and building automation solutions. The Refrigeration segment offers transport refrigeration and monitoring products and services, as well as digital solutions for trucks, trailers, shipping containers, intermodal applications, food retail, and warehouse cooling; and commercial refrigeration solutions, such as refrigerated cabinets, freezers, systems, and controls. The Fire & Security segment provides various residential, commercial, and industrial technologies, including fire, flame, gas, smoke, and carbon monoxide detection; portable fire extinguishers; fire suppression systems; intruder alarms; access control systems; video management systems; and electronic controls. This segment also offers fire and security service, such as audit, design, installation, and system integration, as well as aftermarket maintenance and repair and monitoring services. It offers its products under the Autronica, Det-Tronics, Edwards, Aritech, Fireye, GST, Kidde, LenelS2, Marioff, Onity, and Supra; Carrier, Toshiba, Automated Logic, Bryant, CIAT, Day & Night, Heil, NORESCO, and Riello; and Carrier Commercial Refrigeration, Carrier Transicold, and Sensitech brands. Carrier Global Corporation was incorporated in 2019 and is headquartered in Palm Beach Gardens, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"11-02-2025 19:55:29"},{"Company Name":"Welltower Inc.","Symbol":"WELL","Current Price":"142.14","Latest MA":"125.80","Price Target":148.47368,"Difference from MA":"12.99%","Difference from Open":"-0.13%","Change from Yesterday":"-0.68%","Change from Last Report":"0.06","Latest Volume":"871,330","Market Cap":"88,509,153,280","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":76.21448,"PB Ratio":2.897682,"Previous Close":143.11,"ROE":0.03417,"DTE":52.153,"Industry":"REIT - Healthcare Facilities","Sector":"Real Estate","Beta":1.194,"Trailing PEG":2.5934,"Trailing PE":90.53503,"Trailing PS":11.714458,"Quick Ratio":2.224,"Day High":143.58,"Day Low":141.59,"VS Average Volume":0.3179588569,"Company Summary":"Welltower Inc. (NYSE:WELL), a real estate investment trust (\"REIT\") and S&P 500 company headquartered in Toledo, Ohio, is driving the transformation of health care infrastructure. Welltower invests with leading seniors housing operators, post-acute providers and health systems to fund the real estate infrastructure needed to scale innovative care delivery models and improve people's wellness and overall health care experience. Welltower owns interests in properties concentrated in major, high-growth markets in the United States, Canada and the United Kingdom, consisting of seniors housing and post-acute communities and outpatient medical properties.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"11-02-2025 19:55:29"},{"Company Name":"Shopify Inc.","Symbol":"SHOP","Current Price":"119.94","Latest MA":"88.74","Price Target":122.82733,"Difference from MA":"35.16%","Difference from Open":"-1.91%","Change from Yesterday":"0.03%","Change from Last Report":"-0.30","Latest Volume":"24,631,521","Market Cap":"154,687,815,680","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":62.082355,"PB Ratio":15.31214,"Previous Close":119.9,"ROE":0.15031,"DTE":11.277,"Industry":"Software - Application","Sector":"Technology","Beta":2.365,"Trailing PEG":null,"Trailing PE":112.09345,"Trailing PS":18.836802,"Quick Ratio":5.62,"Day High":125.79,"Day Low":114.7002,"VS Average Volume":3.0722537487,"Company Summary":"Shopify Inc., a commerce company, provides a commerce platform and services in Canada, the United States, Europe, the Middle East, Africa, the Asia Pacific, Australia, China, and Latin America. The company's platform enables merchants to displays, manages, markets, and sells its products through various sales channels, including web and mobile storefronts, physical retail locations, pop-up shops, social media storefronts, native mobile apps, buy buttons, and marketplaces; and enables to manage products and inventory, process orders and payments, fulfill and ship orders, new buyers and build customer relationships, source products, leverage analytics and reporting, manage cash, payments and transactions, and access financing. It also sells custom themes and apps, and registration of domain names; and merchant solutions, which include accepting payments, shipping, and securing working capital. The company was formerly known as Jaded Pixel Technologies Inc. and changed its name to Shopify Inc. in November 2011. Shopify Inc. was incorporated in 2004 and is headquartered in Ottawa, Canada.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"11-02-2025 19:55:29"},{"Company Name":"Gilead Sciences, Inc.","Symbol":"GILD","Current Price":"95.67","Latest MA":"84.88","Price Target":101.2368,"Difference from MA":"12.71%","Difference from Open":"0.35%","Change from Yesterday":"0.19%","Change from Last Report":"0.03","Latest Volume":"2,254,625","Market Cap":"119,224,418,304","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":12.579869,"PB Ratio":6.4520807,"Previous Close":95.48,"ROE":0.00561,"DTE":126.415,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.192,"Trailing PEG":0.5558,"Trailing PE":1062.9445,"Trailing PS":4.213026,"Quick Ratio":0.962,"Day High":95.7994,"Day Low":95.03,"VS Average Volume":0.3214609215,"Company Summary":"Gilead Sciences, Inc., a biopharmaceutical company, discovers, develops, and commercializes medicines in the areas of unmet medical need in the United States, Europe, and internationally. The company provides Biktarvy, Genvoya, Descovy, Odefsey, Truvada, Complera\/ Eviplera, Stribild, Sunlencs, and Atripla products for the treatment of HIV\/AIDS; Veklury, an injection for intravenous use, for the treatment of COVID-19; and Epclusa, Harvoni, Vemlidy, and Viread for the treatment of viral hepatitis. It also offers Yescarta, Tecartus, and Trodelvy products for the treatment of oncology; Letairis, an oral formulation for the treatment of pulmonary arterial hypertension; and AmBisome, a liposomal formulation for the treatment of serious invasive fungal infections. The company has collaboration agreements with Arcus Biosciences, Inc.; Merck Sharp & Dohme Corp.; Pionyr Immunotherapeutics Inc.; Tizona Therapeutics, Inc.; Galapagos NV; Janssen Sciences Ireland Unlimited Company; Japan Tobacco, Inc.; Dragonfly Therapeutics, Inc.; Arcellx, Inc.; Everest Medicines; Merck & Co, Inc.; Tentarix Biotherapeutics Inc.; Marengo Therapeutics; and Assembly Biosciences, Inc. It also has research collaboration, option, and license agreement with Merus N.V. for the discovery of novel dual tumor-associated antigens (TAA) targeting trispecific antibodies. The company has a collaboration with Terray Therapeutics, Inc. to discover and develop small molecule therapies; and LEO Pharma to develop, manufacture, and commercialize the small molecule oral STAT6 program. The company was incorporated in 1987 and is headquartered in Foster City, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"11-02-2025 19:55:29"},{"Company Name":"Lyft, Inc.","Symbol":"LYFT","Current Price":"14.54","Latest MA":"13.45","Price Target":18.85711,"Difference from MA":"8.10%","Difference from Open":"-4.81%","Change from Yesterday":"-3.87%","Change from Last Report":"-0.07","Latest Volume":"18,963,371","Market Cap":"6,029,364,736","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":13.411393,"PB Ratio":9.193548,"Previous Close":15.12,"ROE":-0.1161,"DTE":189.385,"Industry":"Software - Application","Sector":"Technology","Beta":2.041,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":1.1042137,"Quick Ratio":0.58,"Day High":15.35,"Day Low":14.38,"VS Average Volume":1.3003800673,"Company Summary":"Lyft, Inc. operates a peer-to-peer marketplace for on-demand ridesharing in the United States and Canada. It operates multimodal transportation networks that offer access to various transportation options through the Lyft platform and mobile-based applications. The company's platform provides a ridesharing marketplace, which connects drivers with riders; Express Drive, a car rental program for drivers; and a network of shared bikes and scooters in various cities to address the needs of riders for short trips. It also offers centralized tools and enterprise transportation solutions, such as concierge transportation solutions for organizations; Lyft Pink subscription plans; Lyft Pass commuter programs; first-mile and last-mile services; and university safe rides programs. The company was formerly known as Zimride, Inc. and changed its name to Lyft, Inc. in April 2013. Lyft, Inc. was incorporated in 2007 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"11-02-2025 19:55:29"},{"Company Name":"Arista Networks, Inc.","Symbol":"ANET","Current Price":"117.13","Latest MA":"98.93","Price Target":113.53698,"Difference from MA":"18.40%","Difference from Open":"-0.65%","Change from Yesterday":"-2.58%","Change from Last Report":"-0.04","Latest Volume":"2,868,906","Market Cap":"147,555,680,256","Earning Date":"2025-02-10","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":47.38882,"PB Ratio":3.9886262,"Previous Close":120.23,"ROE":0.33833998,"DTE":0.755,"Industry":"Computer Hardware","Sector":"Technology","Beta":1.077,"Trailing PEG":2.7519,"Trailing PE":56.3125,"Trailing PS":22.312475,"Quick Ratio":3.516,"Day High":119.24,"Day Low":115.67,"VS Average Volume":0.353452795,"Company Summary":"Arista Networks Inc engages in the development, marketing, and sale of data-driven, client to cloud networking solutions for data center, campus, and routing environments in the Americas, Europe, the Middle East, Africa, and the Asia-Pacific. Its cloud networking solutions consist of Extensible Operating System (EOS), a publish-subscribe state-sharing networking operating system offered in combination with a set of network applications. The company offers data center and cloud networking systems, including newer artificial intelligence (AI) ethernet switching platforms; campus wired and wireless products, and routing systems addressing Core Routing, Edge Routing, Data Center Interconnect (DCI), Multi-cloud and Wide Area Networking (WAN) use cases; and a suite of value-add software solutions that leverage EOS to provide end-to-end orchestration, automation, analytics, network monitoring, and security. It also provides post contract customer support services, such as technical support, hardware repair and replacement parts beyond standard warranty, bug fixes, patches, and upgrade services. The company serves a range of industries comprising internet companies, service providers, financial services organizations, government agencies, media and entertainment companies, telecommunication service providers, and others. It markets and sells its products through distributors, system integrators, value-added resellers, and original equipment manufacturer partners, as well as through its direct sales force. The company was formerly known as Arastra, Inc. and changed its name to Arista Networks Inc in October 2008. Arista Networks Inc was incorporated in 2004 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"11-02-2025 19:55:29"},{"Company Name":"Coty Inc.","Symbol":"COTY","Current Price":"6.29","Latest MA":"8.29","Price Target":9.85238,"Difference from MA":"-24.15%","Difference from Open":"-10.21%","Change from Yesterday":"-7.16%","Change from Last Report":"0.00","Latest Volume":"7,625,023","Market Cap":"5,467,308,544","Earning Date":"2025-02-10","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":10.282882,"PB Ratio":1.4251701,"Previous Close":6.77,"ROE":0.04405,"DTE":94.436,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":1.914,"Trailing PEG":0.2158,"Trailing PE":"Infinity","Trailing PS":0.889268,"Quick Ratio":0.391,"Day High":7.09,"Day Low":6.27,"VS Average Volume":1.4912157391,"Company Summary":"Coty Inc., together with its subsidiaries, manufactures, markets, distributes, and sells beauty products worldwide. It operates through Prestige and Consumer Beauty segments. The company provides fragrance, color cosmetics, and skin and body care products. It offers Prestige segment products primarily through prestige retailers, including perfumeries, department stores, e-retailers, direct-to-consumer websites, and duty-free shops under the Burberry, Calvin Klein, Chloe, Davidoff, Escada, Gucci, Hugo Boss, Infiniment Coty Paris, Jil Sander, Joop!, Kylie Jenner, Lancaster, Marc Jacobs, Miu Miu, Orveda, philosophy, SKKN BY KIM, and Tiffany & Co. brands. The company provides Consumer Beauty segment products primarily through hypermarkets, supermarkets, drug stores, pharmacies, mid-tier department stores, traditional food and drug retailers, and e-commerce retailers under the Adidas, Beckham, Bozzano, Bourjois, Bruno Banani, CoverGirl, Jovan, Max Factor, Mexx, Monange, Nautica, Paixao, LeGer by Lena Gercke, Rimmel, Risque, Vera Wang, and Sally Hansen brands. It also sells its products through third-party distributors. The company was founded in 1904 and is headquartered in New York, New York. Coty Inc. is a subsidiary of JAB Beauty B.V.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"11-02-2025 19:55:29"},{"Company Name":"Amkor Technology, Inc.","Symbol":"AMKR","Current Price":"21.87","Latest MA":"29.04","Price Target":30.643,"Difference from MA":"-24.70%","Difference from Open":"-1.80%","Change from Yesterday":"-10.22%","Change from Last Report":"0.28","Latest Volume":"2,783,666","Market Cap":"5,393,820,160","Earning Date":"2025-02-10","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":10.91448,"PB Ratio":1.2954627,"Previous Close":24.36,"ROE":0.09133001,"DTE":32.538,"Industry":"Semiconductor Equipment & Materials","Sector":"Technology","Beta":1.852,"Trailing PEG":null,"Trailing PE":15.293708,"Trailing PS":0.8374996,"Quick Ratio":1.795,"Day High":23.17,"Day Low":21.66,"VS Average Volume":2.2031685428,"Company Summary":"Amkor Technology, Inc. provides outsourced semiconductor packaging and test services in the United States, Japan, Europe, and the Asia Pacific. It offers turnkey packaging and test services, including semiconductor wafer bump, wafer probe, wafer back-grind, package design, packaging, system-level and final test, and drop shipment services; flip chip scale package products for smartphones, tablets, and other mobile consumer electronic devices; flip chip stacked chip scale packages that are used to stack memory digital baseband, and as applications processors in mobile devices; flip-chip ball grid array packages for various networking, storage, computing, automotive, and consumer applications; and memory products for system memory or platform data storage. The company also provides wafer-level CSP packages for power management, transceivers, sensors, wireless charging, codecs, radar, and specialty silicon; wafer-level fan-out packages used in power management, transceivers, radar, and specialty silicon; silicon wafer integrated fan-out technology that replaces a laminate substrate with a thinner structure; leadframe packages for electronic devices and mixed-signal applications; and substrate-based wirebond packages used to connect a die to a substrate. In addition, it offers micro-electro-mechanical systems packages that are miniaturized mechanical and electromechanical devices; and advanced system-in-package modules used in radio frequency and front end modules, basebands, connectivity, fingerprint sensors, display and touch screen drivers, sensors and MEMS, and NAND memory and solid-state drives. Further, the company provides wafer, package, and system level test services, as well as burn-in test and test development services. It serves integrated device manufacturers, fabless semiconductor companies, original equipment manufacturers, and contract foundries. The company was founded in 1968 and is headquartered in Tempe, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"11-02-2025 19:55:29"},{"Company Name":"ON Semiconductor Corporation","Symbol":"ON","Current Price":"48.37","Latest MA":"67.91","Price Target":64.18069,"Difference from MA":"-28.78%","Difference from Open":"3.07%","Change from Yesterday":"2.83%","Change from Last Report":"-0.12","Latest Volume":"6,009,188","Market Cap":"20,384,133,120","Earning Date":"2025-02-10","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":12.172657,"PB Ratio":2.3984728,"Previous Close":47.04,"ROE":0.2183,"DTE":42.376,"Industry":"Semiconductors","Sector":"Technology","Beta":1.654,"Trailing PEG":1.5623,"Trailing PE":13.325068,"Trailing PS":2.7628639,"Quick Ratio":1.875,"Day High":48.95,"Day Low":46.83,"VS Average Volume":0.7904124353,"Company Summary":"ON Semiconductor Corporation provides intelligent sensing and power solutions in the United States and internationally. The company operates through Power Solutions Group, Advanced Solutions Group, and Intelligent Sensing Group. Its intelligent power technologies enable the electrification of the automotive industry that allows for lighter and longer-range electric vehicles, empowers fast-charging systems, and propels sustainable energy for the solar strings, industrial power, and storage systems. In addition, the company offers analog, discrete, module, and integrated semiconductor products that perform multiple application functions, includes power switching and conversion, signal conditioning, circuit protection, signal amplification, and voltage regulation functions. Further, it designs and develops analog, mixed-signal, power management ICs and sensor interface devices for automotive, industrial, compute and mobile markets. Additionally, the company offers single photon detectors, including silicon photomultipliers and single photon avalanche diode arrays, as well as actuator drivers for autofocus and image stabilization for a broad base of end-users in the different end-markets. ON Semiconductor Corporation was incorporated in 1992 and is headquartered in Scottsdale, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"11-02-2025 19:55:29"},{"Company Name":"McDonald's Corporation","Symbol":"MCD","Current Price":"309.80","Latest MA":"287.00","Price Target":326.81323,"Difference from MA":"7.94%","Difference from Open":"0.79%","Change from Yesterday":"0.45%","Change from Last Report":"-0.02","Latest Volume":"2,207,026","Market Cap":"222,008,885,248","Earning Date":"2025-02-10","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":23.221785,"PB Ratio":"N\/A","Previous Close":308.42,"ROE":"N\/A","DTE":"N\/A","Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":0.735,"Trailing PEG":2.8266,"Trailing PE":27.223198,"Trailing PS":8.558983,"Quick Ratio":0.584,"Day High":311.59,"Day Low":306.17,"VS Average Volume":0.7245467779,"Company Summary":"McDonald's Corporation operates and franchises restaurants under the McDonald's brand in the United States and internationally. It offers food and beverages, including hamburgers and cheeseburgers, various chicken sandwiches, fries, shakes, desserts, sundaes, cookies, pies, soft drinks, coffee, and other beverages; and full or limited breakfast, as well as sells various other products during limited-time promotions. The company owns and operates under various structures comprising conventional franchise, developmental license, or affiliate. McDonald's Corporation was founded in 1940 and is based in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"11-02-2025 19:55:29"},{"Company Name":"Interpublic Group of Companies,","Symbol":"IPG","Current Price":"27.12","Latest MA":"29.62","Price Target":35.323,"Difference from MA":"-8.43%","Difference from Open":"0.35%","Change from Yesterday":"-0.20%","Change from Last Report":"-0.07","Latest Volume":"1,334,107","Market Cap":"10,108,022,784","Earning Date":"2025-02-12","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":9.987555,"PB Ratio":2.7119577,"Previous Close":27.18,"ROE":0.21792999,"DTE":111.806,"Industry":"Advertising Agencies","Sector":"Communication Services","Beta":1.09,"Trailing PEG":146.2623,"Trailing PE":12.794812,"Trailing PS":1.0823568,"Quick Ratio":1.0,"Day High":27.22,"Day Low":26.93,"VS Average Volume":0.2224091784,"Company Summary":"The Interpublic Group of Companies, Inc. provides advertising and marketing services worldwide. It operates in three segments: Media, Data & Engagement Solutions, Integrated Advertising & Creativity Led Solutions, and Specialized Communications & Experiential Solutions. The Media, Data & Engagement Solutions segment provides media and communications services, digital services and products, advertising and marketing technology, e-commerce services, data management and analytics, strategic consulting, and digital brand experience under the IPG Mediabrands, UM, Initiative, Kinesso, Acxiom, Huge, MRM, and R\/GA brand names. The Integrated Advertising & Creativity Led Solutions segment offers advertising, corporate, and brand identity services; and strategic consulting under FCB, IPG Health, McCann Worldgroup, and MullenLowe Group brands. Specialized Communications & Experiential Solutions segment provides public relations and other specialized communications services, live events, sports and entertainment marketing, and strategic consulting under IPG DXTRA Health, The Weber Shandwick Collective, Golin, Jack Morton, Momentum, and Octagon brand names. The company was formerly known as McCann-Erickson Incorporated and changed its name to The Interpublic Group of Companies, Inc. in January 1961. The Interpublic Group of Companies, Inc. was founded in 1902 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"11-02-2025 19:55:29"},{"Company Name":"Cisco Systems, Inc.","Symbol":"CSCO","Current Price":"62.53","Latest MA":"54.00","Price Target":63.70375,"Difference from MA":"15.81%","Difference from Open":"0.00%","Change from Yesterday":"-0.44%","Change from Last Report":"0.02","Latest Volume":"6,830,017","Market Cap":"249,051,938,816","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":15.823201,"PB Ratio":5.5104427,"Previous Close":62.81,"ROE":0.20761,"DTE":70.647,"Industry":"Communication Equipment","Sector":"Technology","Beta":"N\/A","Trailing PEG":2.7968,"Trailing PE":26.837984,"Trailing PS":4.701222,"Quick Ratio":0.648,"Day High":62.798,"Day Low":62.175,"VS Average Volume":0.3433564685,"Company Summary":"Cisco Systems, Inc. designs, manufactures, and sells Internet Protocol based networking and other products related to the communications and information technology industry in the Americas, Europe, the Middle East, Africa, the Asia Pacific, Japan, and China. The company also offers switching portfolio encompasses campus switching as well as data center switching; enterprise routing portfolio interconnects public and private wireline and mobile networks, delivering highly secure, and reliable connectivity to campus, data center and branch networks; and wireless products include indoor and outdoor wireless coverage designed for seamless roaming use of voice, video, and data applications. In addition, it provides security, which comprising network security, identity and access management, secure access service edge, and threat intelligence, detection, and response offerings; collaboration products, such as Webex Suite, collaboration devices, contact center, and communication platform as a service; end-to-end collaboration solutions that can be delivered from the cloud, on-premise or within hybrid cloud environments allowing customers to transition their collaboration solutions from on-premise to the cloud; and observability offers network assurance, monitoring and analytics and observability suite. Further, the company offers a range of service and support options for its customers, including technical support and advanced services and advisory services. It serves businesses of various sizes, public institutions, governments, and service providers. The company sells its products and services directly, as well as through systems integrators, service providers, other resellers, and distributors. Cisco Systems, Inc. has strategic alliances with other companies. Cisco Systems, Inc. was incorporated in 1984 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"11-02-2025 19:55:29"},{"Company Name":"CVS Health Corporation","Symbol":"CVS","Current Price":"54.38","Latest MA":"55.38","Price Target":65.4576,"Difference from MA":"-1.81%","Difference from Open":"-0.33%","Change from Yesterday":"0.17%","Change from Last Report":"-0.02","Latest Volume":"5,416,633","Market Cap":"68,432,334,848","Earning Date":"2025-02-12","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":9.115688,"PB Ratio":0.9128143,"Previous Close":54.29,"ROE":0.06697,"DTE":110.116,"Industry":"Healthcare Plans","Sector":"Healthcare","Beta":0.543,"Trailing PEG":2.1759,"Trailing PE":13.802031,"Trailing PS":0.18633923,"Quick Ratio":0.542,"Day High":55.93,"Day Low":54.25,"VS Average Volume":0.4115982523,"Company Summary":"CVS Health Corporation provides health solutions in the United States. It operates through Health Care Benefits, Health Services, and Pharmacy & Consumer Wellness segments. The Health Care Benefits segment offers traditional, voluntary, and consumer-directed health insurance products and related services. It serves employer groups, individuals, college students, part-time and hourly workers, health plans, health care providers, governmental units, government-sponsored plans, labor groups, and expatriates. The Health Services segment offers pharmacy benefit management solutions, including plan design and administration, formulary management, retail pharmacy network management, specialty and mail order pharmacy, clinical, disease management, and medical spend management services. It serves employers, insurance companies, unions, government employee groups, health plans, prescription drug plans, Medicaid managed care plans, CMS, plans offered on public health insurance, and other sponsors of health benefit plans. The Pharmacy & Consumer Wellness segment sells prescription and over-the-counter drugs, consumer health and beauty products, and personal care products. This segment also distributes prescription drugs; and provides related pharmacy consulting and other ancillary services to care facilities and other care settings. It operates online retail pharmacy websites, LTC pharmacies and on-site pharmacies, retail specialty pharmacy stores, compounding pharmacies and branches for infusion and enteral nutrition services. The company was formerly known as CVS Caremark Corporation and changed its name to CVS Health Corporation in September 2014. CVS Health Corporation was incorporated in 1996 and is headquartered in Woonsocket, Rhode Island.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"11-02-2025 19:55:29"},{"Company Name":"Summit Materials, Inc.","Symbol":"SUM","Current Price":"52.49","Latest MA":"44.42","Price Target":50.97111,"Difference from MA":"18.18%","Difference from Open":"0.19%","Change from Yesterday":"0.08%","Change from Last Report":"0.00","Latest Volume":"4,694,636","Market Cap":"9,228,477,440","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":25.197056,"PB Ratio":2.0728192,"Previous Close":52.45,"ROE":0.04364,"DTE":65.584,"Industry":"Building Materials","Sector":"Basic Materials","Beta":1.142,"Trailing PEG":null,"Trailing PE":61.75294,"Trailing PS":2.457947,"Quick Ratio":2.431,"Day High":54.07,"Day Low":52.4,"VS Average Volume":1.2061852942,"Company Summary":"Summit Materials, Inc. operates as a vertically integrated construction materials company in the United States and Canada. It operates in three segments: West, East, and Cement. The company offers aggregates, cement, ready-mix concrete, asphalt paving mixes, and concrete products, as well as plastics components. It also provides asphalt paving and related services. In addition, the company operates municipal waste, construction, and demolition debris landfills; and liquid asphalt terminals. The company serves the public infrastructure, and residential and nonresidential end markets. Summit Materials, Inc. was founded in 2009 and is headquartered in Denver, Colorado. As of February 10, 2025, Summit Materials, Inc. operates as a subsidiary of Quikrete Holdings, Inc.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"11-02-2025 19:55:29"},{"Company Name":"Antero Resources Corporation","Symbol":"AR","Current Price":"40.26","Latest MA":"30.84","Price Target":40.90909,"Difference from MA":"30.53%","Difference from Open":"-0.25%","Change from Yesterday":"0.60%","Change from Last Report":"-0.09","Latest Volume":"1,276,019","Market Cap":"12,527,462,400","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":15.998028,"PB Ratio":1.7940376,"Previous Close":40.02,"ROE":0.0130900005,"DTE":59.551,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":3.378,"Trailing PEG":0.9278,"Trailing PE":287.5714,"Trailing PS":2.9322045,"Quick Ratio":0.261,"Day High":40.66,"Day Low":40.1,"VS Average Volume":0.3058391396,"Company Summary":"Antero Resources Corporation, an independent oil and natural gas company, engages in the development, production, exploration, and acquisition of natural gas, natural gas liquids (NGLs), and oil properties in the United States. It operates in three segments: Exploration and Development; Marketing; and Equity Method Investment in Antero Midstream. As of December 31, 2023, the company had approximately 515,000 net acres in the Appalachian Basin; and approximately 172,000 net acres in the Upper Devonian Shale. Its gathering and compression systems also comprise 631 miles of gas gathering pipelines in the Appalachian Basin. The company was formerly known as Antero Resources Appalachian Corporation and changed its name to Antero Resources Corporation in June 2013. Antero Resources Corporation was incorporated in 2002 and is headquartered in Denver, Colorado.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"11-02-2025 19:55:29"},{"Company Name":"Williams Companies, Inc. (The)","Symbol":"WMB","Current Price":"55.32","Latest MA":"50.11","Price Target":57.005,"Difference from MA":"10.40%","Difference from Open":"-1.09%","Change from Yesterday":"-1.51%","Change from Last Report":"0.02","Latest Volume":"3,051,148","Market Cap":"67,435,634,688","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":26.858671,"PB Ratio":5.441133,"Previous Close":56.17,"ROE":0.20583001,"DTE":182.368,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":1.062,"Trailing PEG":9.362,"Trailing PE":23.44068,"Trailing PS":6.5054636,"Quick Ratio":0.406,"Day High":55.93,"Day Low":54.69,"VS Average Volume":0.4231918994,"Company Summary":"The Williams Companies, Inc., together with its subsidiaries, operates as an energy infrastructure company primarily in the United States. It operates through Transmission & Gulf of Mexico, Northeast G&P, West, and Gas & NGL Marketing Services segments. The Transmission & Gulf of Mexico segment comprises natural gas pipelines; Transco, Northwest pipeline, MountainWest, and related natural gas storage facilities; and natural gas gathering and processing, and crude oil production handling and transportation assets in the Gulf Coast region. The Northeast G&P segment engages in the midstream gathering, processing, and fractionation activities in the Marcellus Shale region primarily in Pennsylvania and New York, and the Utica Shale region of eastern Ohio. The West segment consists of gas gathering, processing, and treating operations in the Rocky Mountain region of Colorado and Wyoming, the Barnett Shale region of north-central Texas, the Eagle Ford Shale region of South Texas, the Haynesville Shale region of northwest Louisiana, the Mid-Continent region that includes the Anadarko and Permian basins, and the DJ Basin of Colorado; and operates natural gas liquid (NGL) fractionation and storage facilities in central Kansas near Conway. The Gas & NGL Marketing Services segment provides wholesale marketing, trading, storage, and transportation of natural gas for natural gas utilities, municipalities, power generators, and producers; asset management services; and transports and markets NGLs. The company owns and operates 33,000 miles of pipelines. The Williams Companies, Inc. was founded in 1908 and is headquartered in Tulsa, Oklahoma.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"11-02-2025 19:55:29"},{"Company Name":"MGM Resorts International","Symbol":"MGM","Current Price":"34.47","Latest MA":"37.62","Price Target":47.92429,"Difference from MA":"-8.36%","Difference from Open":"1.86%","Change from Yesterday":"0.32%","Change from Last Report":"0.00","Latest Volume":"1,183,504","Market Cap":"10,263,098,368","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":15.715258,"PB Ratio":3.1664526,"Previous Close":34.36,"ROE":0.2901,"DTE":841.031,"Industry":"Resorts & Casinos","Sector":"Consumer Cyclical","Beta":2.241,"Trailing PEG":1.9158,"Trailing PE":12.354839,"Trailing PS":0.5959414,"Quick Ratio":1.062,"Day High":34.64,"Day Low":33.8552,"VS Average Volume":0.2856651837,"Company Summary":"MGM Resorts International, through its subsidiaries, owns and operates casino, hotel, and entertainment resorts in the United States and internationally. The company operates through three segments: Las Vegas Strip Resorts, Regional Operations, and MGM China. Its casino resorts offer gaming, hotel, convention, dining, entertainment, retail, and other resort amenities. The company's casino operations include slots and table games, as well as online sports betting and iGaming through BetMGM. Its customers include premium gaming customers; leisure and wholesale travel customers; business travelers; and group customers, including conventions, trade associations, and small meetings. The company was formerly known as MGM MIRAGE and changed its name to MGM Resorts International in June 2010. MGM Resorts International was incorporated in 1986 and is based in Las Vegas, Nevada.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"11-02-2025 19:55:29"},{"Company Name":"The Kraft Heinz Company","Symbol":"KHC","Current Price":"29.41","Latest MA":"32.50","Price Target":35.695,"Difference from MA":"-9.49%","Difference from Open":"1.47%","Change from Yesterday":"1.57%","Change from Last Report":"0.10","Latest Volume":"3,714,177","Market Cap":"35,567,738,880","Earning Date":"2025-02-12","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":9.671247,"PB Ratio":0.7358534,"Previous Close":28.96,"ROE":0.027999999,"DTE":41.451,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.475,"Trailing PEG":0.7917,"Trailing PE":26.5,"Trailing PS":1.361184,"Quick Ratio":0.448,"Day High":29.44,"Day Low":28.78,"VS Average Volume":0.3596046512,"Company Summary":"The Kraft Heinz Company, together with its subsidiaries, manufactures and markets food and beverage products in North America and internationally. Its products include condiments and sauces, cheese and dairy products, meals, meats, refreshment beverages, coffee, and other grocery products under the Kraft, Oscar Mayer, Heinz, Philadelphia, Lunchables, Velveeta, Ore-Ida, Maxwell House, Kool-Aid, Jell-O, Heinz, ABC, Master, Quero, Kraft, Golden Circle, Wattie's, Pudliszki, and Plasmon brands. It sells its products through its own sales organizations, as well as through independent brokers, agents, and distributors to chain, wholesale, cooperative, and independent grocery accounts; convenience, value, and club stores; pharmacies and drug stores; mass merchants; foodservice distributors; institutions, including hotels, restaurants, bakeries, hospitals, health care facilities, and government agencies; and online through various e-commerce platforms and retailers. The company was formerly known as H.J. Heinz Holding Corporation and changed its name to The Kraft Heinz Company in July 2015. The Kraft Heinz Company was founded in 1869 and is based in Pittsburgh, Pennsylvania.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"11-02-2025 19:55:29"},{"Company Name":"Paramount Global","Symbol":"PARA","Current Price":"10.55","Latest MA":"10.73","Price Target":12.75429,"Difference from MA":"-1.68%","Difference from Open":"0.33%","Change from Yesterday":"0.05%","Change from Last Report":"-0.14","Latest Volume":"2,402,266","Market Cap":"7,521,661,952","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":7.017066,"PB Ratio":0.4233855,"Previous Close":10.55,"ROE":-0.30080998,"DTE":91.924,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.767,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.26056266,"Quick Ratio":0.938,"Day High":10.705,"Day Low":10.5,"VS Average Volume":0.2403957665,"Company Summary":"Paramount Global operates as a media, streaming, and entertainment company worldwide. It operates through TV Media, Direct-to-Consumer, and Filmed Entertainment segments. The TV Media segment operates CBS Television Network, a domestic broadcast television network; CBS Stations, a television station; and international free-to-air networks comprising Network 10, Channel 5, Telefe, and Chilevisión; domestic premium and basic cable networks, such as Paramount+ with Showtime, MTV, Comedy Central, Paramount Network, The Smithsonian Channel, Nickelodeon, BET Media Group, and CBS Sports Network; and international extensions of these brands. This segment also offers domestic and international television studio operations, including CBS Studios, Paramount Television Studios, and Showtime\/MTV Entertainment Studios; CBS Media Ventures, which produces and distributes first-run syndicated programming; and digital properties consisting of CBS News Streaming and CBS Sports HQ. The Direct-to-Consumer segment provides a portfolio of domestic and international pay and free streaming services, including Paramount+, Pluto TV, BET+, and Noggin. The Filmed Entertainment segment produces and acquires films, series, and short-form content for release and licensing around the world, including in theaters, on streaming services, on television, through digital home entertainment, and DVDs\/Blu-rays; and operates a portfolio consisting of Paramount Pictures, Paramount Players, Paramount Animation, Nickelodeon Studio, Awesomeness, and Miramax. It also offers production, distribution, and advertising solutions. The company was formerly known as ViacomCBS Inc. and changed its name to Paramount Global in February 2022. The company was founded in 1914 and is headquartered in New York, New York. Paramount Global is a subsidiary of National Amusements, Inc.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"11-02-2025 19:55:29"},{"Company Name":"Applovin Corporation","Symbol":"APP","Current Price":"373.45","Latest MA":"207.55","Price Target":375.69092,"Difference from MA":"79.94%","Difference from Open":"-2.14%","Change from Yesterday":"-2.85%","Change from Last Report":"0.07","Latest Volume":"2,362,893","Market Cap":"125,326,835,712","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":50.72588,"PB Ratio":133.51807,"Previous Close":384.4,"ROE":1.1335399,"DTE":374.12,"Industry":"Software - Application","Sector":"Technology","Beta":1.862,"Trailing PEG":2.4797,"Trailing PE":112.824776,"Trailing PS":29.215553,"Quick Ratio":2.251,"Day High":383.34,"Day Low":366.96,"VS Average Volume":0.4356180627,"Company Summary":"AppLovin Corporation engages in building a software-based platform for advertisers to enhance the marketing and monetization of their content in the United States and internationally. It operates through two segments, Software Platform and Apps. The company's software solutions include AppDiscovery, a marketing software solution, which matches advertiser demand with publisher supply through auctions; MAX, an in-app bidding software that optimizes the value of a publisher's advertising inventory by running a real-time competitive auction; Adjust, a measurement and analytics marketing platform that provides marketers with the visibility, insights, and tools needed to grow their apps from early stage to maturity; and Wurl, a connected TV platform, which distributes streaming video for content companies and provides advertising and publishing solutions through its AdPool, ContentDiscovery, and Global FAST Pass products. It also offers SparkLabs, which uses app store optimization to enhance ad visibility; AppLovin Exchange, which connects buyers to mobile and CTV devices through a single and direct RTB exchange; and Array, an end-to-end app management suite for mobile operators and end users. In addition, the company operates various free-to-play mobile games. It serves individuals, small and independent businesses, enterprises, advertisers and advertising networks, mobile app publishers, indie studio developers, and internet platforms. AppLovin Corporation was incorporated in 2011 and is headquartered in Palo Alto, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"11-02-2025 19:55:29"},{"Company Name":"Exelon Corporation","Symbol":"EXC","Current Price":"41.99","Latest MA":"38.27","Price Target":42.89625,"Difference from MA":"9.73%","Difference from Open":"0.74%","Change from Yesterday":"0.45%","Change from Last Report":"-0.05","Latest Volume":"2,874,923","Market Cap":"42,192,814,080","Earning Date":"2025-02-12","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":15.949528,"PB Ratio":1.5848873,"Previous Close":41.8,"ROE":0.0933,"DTE":173.221,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.61,"Trailing PEG":2.4496,"Trailing PE":17.279835,"Trailing PS":1.8405521,"Quick Ratio":0.579,"Day High":42.1,"Day Low":41.47,"VS Average Volume":0.4495538586,"Company Summary":"Exelon Corporation, a utility services holding company, engages in the energy distribution and transmission businesses in the United States and Canada. The company is involved in the purchase and regulated retail sale of electricity and natural gas, transmission and distribution of electricity, and distribution of natural gas to retail customers. It also offers support services, including legal, human resources, information technology, supply management, financial, engineering, customer operations, transmission and distribution planning, asset management, system operations, and power procurement services. It serves distribution utilities, municipalities, and financial institutions, as well as commercial, industrial, governmental, and residential customers. Exelon Corporation was incorporated in 1999 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"11-02-2025 19:55:29"},{"Company Name":"NiSource Inc","Symbol":"NI","Current Price":"38.27","Latest MA":"34.27","Price Target":39.25714,"Difference from MA":"11.66%","Difference from Open":"0.57%","Change from Yesterday":"0.41%","Change from Last Report":"0.00","Latest Volume":"881,693","Market Cap":"17,861,298,176","Earning Date":"2025-02-12","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":20.575235,"PB Ratio":2.1399808,"Previous Close":38.11,"ROE":0.08756,"DTE":131.811,"Industry":"Utilities - Regulated Gas","Sector":"Utilities","Beta":0.507,"Trailing PEG":2.1466,"Trailing PE":23.332317,"Trailing PS":3.3768737,"Quick Ratio":0.207,"Day High":38.325,"Day Low":37.77,"VS Average Volume":0.2413820953,"Company Summary":"NiSource Inc., an energy holding company, operates as a regulated natural gas and electric utility company in the United States. It operates in two segments, Gas Distribution Operations and Electric Operations. The company distributes natural gas to approximately 3.3 million customers through approximately 55,000 miles of distribution main pipeline and the associated individual customer service lines; and 1,000 miles of transmission main pipeline in northern Indiana, Ohio, Pennsylvania, Virginia, Kentucky, and Maryland. It also generates, transmits, and distributes electricity to approximately 0.5 million customers in various counties in the northern part of Indiana, as well as engages in wholesale electric and transmission transactions. It owns and operates coal-fired electric generating stations in Wheatfield and Michigan City; combined cycle gas turbine in West Terre Haute; natural gas generating units in Wheatfield; hydro generating plants in Carroll County and White County; wind generating units in White County, Indiana; and solar generating units in Jasper County and White County. The company was formerly known as NIPSCO Industries, Inc. and changed its name to NiSource Inc. in April 1999. NiSource Inc. was founded in 1847 and is headquartered in Merrillville, Indiana.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"11-02-2025 19:55:29"},{"Company Name":"Vertiv Holdings, LLC","Symbol":"VRT","Current Price":"121.48","Latest MA":"105.62","Price Target":143.30527,"Difference from MA":"15.03%","Difference from Open":"-1.70%","Change from Yesterday":"-3.40%","Change from Last Report":"0.09","Latest Volume":"4,285,496","Market Cap":"45,597,696,000","Earning Date":"2025-02-12","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":34.009693,"PB Ratio":25.13656,"Previous Close":125.76,"ROE":0.32963002,"DTE":172.427,"Industry":"Electrical Equipment & Parts","Sector":"Industrials","Beta":1.586,"Trailing PEG":1.0965,"Trailing PE":80.99,"Trailing PS":6.0548277,"Quick Ratio":0.936,"Day High":124.8599,"Day Low":120.21,"VS Average Volume":0.5386753012,"Company Summary":"Vertiv Holdings Co, together with its subsidiaries, designs, manufactures, and services critical digital infrastructure technologies and life cycle services for data centers, communication networks, and commercial and industrial environments in the Americas, the Asia Pacific, Europe, the Middle East, and Africa. It offers AC and DC power management products, switchgear and busbar products, thermal management products, integrated rack systems, modular solutions, and management systems for monitoring and controlling digital infrastructure that are integral to the technologies used for various services, including e-commerce, online banking, file sharing, video on-demand, energy storage, wireless communications, Internet of Things, and online gaming. The company also provides lifecycle management services, predictive analytics, and professional services for deploying, maintaining, and optimizing its products and their related systems; and preventative maintenance, acceptance testing, engineering and consulting, performance assessments, remote monitoring, training, spare parts, and digital critical infrastructure software services. It offers its products primarily under the Vertiv, Liebert, NetSure, Geist, E&I, Powerbar, and Avocent brands. The company serves cloud services, financial services, healthcare, transportation, manufacturing, energy, education, government, social media, and retail industries through a network of direct sales professionals, independent sales representatives, channel partners, and original equipment manufacturers. Vertiv Holdings Co is headquartered in Westerville, Ohio.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"11-02-2025 19:55:29"},{"Company Name":"Robinhood Markets, Inc.","Symbol":"HOOD","Current Price":"54.07","Latest MA":"30.68","Price Target":50.88235,"Difference from MA":"76.25%","Difference from Open":"-3.27%","Change from Yesterday":"-3.91%","Change from Last Report":"0.09","Latest Volume":"11,539,957","Market Cap":"47,796,580,352","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":38.10833,"PB Ratio":6.6286626,"Previous Close":56.27,"ROE":0.07619,"DTE":102.747,"Industry":"Capital Markets","Sector":"Financial Services","Beta":1.839,"Trailing PEG":null,"Trailing PE":93.22414,"Trailing PS":19.84908,"Quick Ratio":0.547,"Day High":55.9899,"Day Low":53.9,"VS Average Volume":0.5104362034,"Company Summary":"Robinhood Markets, Inc. operates financial services platform in the United States. Its platform allows users to invest in stocks, exchange-traded funds (ETFs), American depository receipts, options, gold, and cryptocurrencies. The company offers fractional trading, recurring investments, fully-paid securities lending, access to investing on margin, cash sweep, instant withdrawals, retirement program, around-the-clock trading, and initial public offerings participation services. It also provides various learning and education solutions comprise Snacks, an accessible digest of business news stories for a new generation of investors.; Learn, which is an online collection of beginners' guides, feature tutorials, and financial dictionary; Newsfeeds that offer access to free, premium news from sites from various sites, such as Barron's, Reuters, and Dow Jones. In addition, the company offers In-App Education, a resource that covers investing fundamentals, including why people invest, a stock market overview, and tips on how to define investing goals, as well as allows customers to understand the basics of investing before their first trade; and Crypto Learn and Earn, an educational module available to various crypto customers through Robinhood Learn to teach customers the basics related to cryptocurrency. Further, it provides Robinhood credit cards, cash card and spending accounts, and wallets. Robinhood Markets, Inc. was incorporated in 2013 and is headquartered in Menlo Park, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"11-02-2025 19:55:29"}]