[{"Company Name":"Abbott Laboratories","Symbol":"ABT","Current Price":"127.43","Latest MA":"112.28","Price Target":133.07957,"Difference from MA":"13.50%","Difference from Open":"-0.44%","Change from Yesterday":"-0.28%","Change from Last Report":"0.00","Latest Volume":"1,058,215","Market Cap":"221,022,240,768","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":22.464441,"PB Ratio":5.5539575,"ROE":0.14840001,"DTE":37.589,"Industry":"Medical Devices","Sector":"Healthcare","Beta":0.722,"Trailing PEG":2.2988,"Trailing PE":16.657516,"Trailing PS":5.362405,"Quick Ratio":0.996,"Day High":128.905,"Day Low":127.43,"VS Average Volume":0.1850943606,"Company Summary":"Abbott Laboratories, together with its subsidiaries, discovers, develops, manufactures, and sells health care products worldwide. It operates in four segments: Established Pharmaceutical Products, Diagnostic Products, Nutritional Products, and Medical Devices. The company provides generic pharmaceuticals for the treatment of pancreatic exocrine insufficiency, irritable bowel syndrome or biliary spasm, intrahepatic cholestasis or depressive symptoms, gynecological disorder, hormone replacement therapy, dyslipidemia, hypertension, hypothyroidism, Ménière's disease and vestibular vertigo, pain, fever, inflammation, and migraine, as well as provides anti-infective clarithromycin, influenza vaccine, and products to regulate physiological rhythm of the colon. It also offers laboratory and transfusion medicine systems in the areas of immunoassay, clinical chemistry, hematology, and transfusion; molecular diagnostics polymerase chain reaction instrument systems that automate the extraction, purification, and preparation of DNA and RNA from patient samples, and detect and measure infectious agents; point of care systems; cartridges for testing blood gas, chemistry, electrolytes, coagulation, and immunoassay; rapid diagnostics lateral flow testing products; molecular point-of-care testing for HIV, SARS-CoV-2, influenza A and B, RSV, and strep A; cardiometabolic test systems; drug and alcohol test, and remote patient monitoring and consumer self-test systems; and informatics and automation solutions for laboratories. In addition, the company provides pediatric and adult nutritional products; rhythm management, electrophysiology, heart failure, vascular, and structural heart devices for the treatment of cardiovascular diseases; diabetes care products, such as glucose and blood glucose monitoring systems; and neuromodulation devices for the management of chronic pain and movement disorders. Abbott Laboratories was founded in 1888 and is based in North Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 17:16:35"},{"Company Name":"Lam Research Corporation","Symbol":"LRCX","Current Price":"79.17","Latest MA":"81.08","Price Target":91.08359,"Difference from MA":"-2.35%","Difference from Open":"-0.90%","Change from Yesterday":"5.74%","Change from Last Report":"0.00","Latest Volume":"7,431,533","Market Cap":"101,867,249,664","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":19.911821,"PB Ratio":12.087022,"ROE":0.49116,"DTE":58.827,"Industry":"Semiconductor Equipment & Materials","Sector":"Technology","Beta":1.486,"Trailing PEG":1.4446,"Trailing PE":24.06383,"Trailing PS":6.5335956,"Quick Ratio":1.685,"Day High":80.0,"Day Low":77.6,"VS Average Volume":0.6468848648,"Company Summary":"Lam Research Corporation designs, manufactures, markets, refurbishes, and services semiconductor processing equipment used in the fabrication of integrated circuits. The company offers ALTUS systems to deposit conformal films for tungsten metallization applications; SABRE electrochemical deposition products for copper interconnect transition that offers copper damascene manufacturing; and VECTOR plasma-enhanced CVD products. It also provides SPEED gapfill high-density plasma chemical vapor deposition products; and Striker single-wafer atomic layer deposition products for dielectric film solutions. In addition, the company offers Flex for dielectric etch applications; Vantex, a dielectric etch system that provides RF technology and repeatable wafer-to-wafer performance enabled by Equipment Intelligence solutions; Kiyo for conductor etch applications; Syndion for through-silicon via etch applications; and Versys metal products for metal etch processes. Further, it provides Coronus bevel clean products to enhance die yield; and Da Vinci, DV-Prime, EOS, and SP series products to address various wafer cleaning applications. The company sells its products in the United States, China, Europe, Japan, Korea, Southeast Asia, and Taiwan. Lam Research Corporation was incorporated in 1980 and is headquartered in Fremont, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 17:16:35"},{"Company Name":"Halliburton Company","Symbol":"HAL","Current Price":"26.39","Latest MA":"29.95","Price Target":34.41481,"Difference from MA":"-11.87%","Difference from Open":"-0.58%","Change from Yesterday":"-0.17%","Change from Last Report":"0.00","Latest Volume":"1,504,496","Market Cap":"23,188,060,160","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.564661,"PB Ratio":2.2507887,"ROE":0.26293,"DTE":83.993,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.905,"Trailing PEG":1.7644,"Trailing PE":9.326856,"Trailing PS":1.0049868,"Quick Ratio":1.377,"Day High":26.6227,"Day Low":26.28,"VS Average Volume":0.1469740316,"Company Summary":"Halliburton Company provides products and services to the energy industry worldwide. It operates through two segments, Completion and Production, and Drilling and Evaluation. The Completion and Production segment offers production enhancement services that include stimulation and sand control services; cementing services, such as well bonding and casing, and casing equipment; and completion tools that offer downhole solutions and services, including well completion products and services, intelligent well completions, and service tools, as well as liner hanger, sand control, and multilateral systems. This segment also provides electrical submersible pumps, as well as artificial lift services; production solutions comprising coiled tubing, hydraulic workover units, downhole tools, and pumping and nitrogen services; pipeline and process services, such as pre-commissioning, commissioning, maintenance, and decommissioning; and specialty chemicals and services. The Drilling and Evaluation segment offers drilling fluid systems, performance additives, completion fluids, solids control, specialized testing equipment, and waste management services; drilling systems and services; wireline and perforating services consists of open-hole logging, and cased-hole and slickline; and drill bits and services comprising roller cone rock bits, fixed cutter bits, hole enlargement, and related downhole tools and services, as well as coring equipment and services. This segment also provides cloud based digital services and artificial intelligence solutions on an open architecture for subsurface insights, integrated well construction, and reservoir and production management; testing and subsea services, such as acquisition and analysis of reservoir information and optimization solutions; and project management and integrated asset management services. Halliburton Company was founded in 1919 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 17:16:35"},{"Company Name":"Kinder Morgan, Inc.","Symbol":"KMI","Current Price":"28.20","Latest MA":"23.97","Price Target":29.585,"Difference from MA":"17.60%","Difference from Open":"2.27%","Change from Yesterday":"2.88%","Change from Last Report":"0.00","Latest Volume":"2,962,601","Market Cap":"62,639,136,768","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.918964,"PB Ratio":2.0601344,"ROE":0.083500005,"DTE":101.433,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.907,"Trailing PEG":1.999,"Trailing PE":24.098291,"Trailing PS":4.1343236,"Quick Ratio":0.291,"Day High":28.209,"Day Low":27.5,"VS Average Volume":0.2072932117,"Company Summary":"Kinder Morgan, Inc. operates as an energy infrastructure company primarily in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas gasification, liquefaction, and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and\/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, renewable fuel and feedstocks, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; owns interests in\/or operates oil fields and gasoline processing plants; and operates a crude oil pipeline system in West Texas, as well as owns and operates RNG and LNG facilities. It owns and operates approximately 82,000 miles of pipelines and 139 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1997 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 17:16:35"},{"Company Name":"GE Vernova Inc.","Symbol":"GEV","Current Price":"376.02","Latest MA":"266.74","Price Target":413.59042,"Difference from MA":"40.97%","Difference from Open":"3.02%","Change from Yesterday":"6.51%","Change from Last Report":"0.00","Latest Volume":"1,463,008","Market Cap":"103,651,418,112","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":36.32331,"PB Ratio":10.896288,"ROE":"N\/A","DTE":9.346,"Industry":"Utilities - Renewable","Sector":"Utilities","Beta":"N\/A","Trailing PEG":3.0616,"Trailing PE":67.38709,"Trailing PS":3.0111966,"Quick Ratio":0.717,"Day High":383.83,"Day Low":364.93,"VS Average Volume":0.4427164911,"Company Summary":"GE Vernova Inc., an energy company, engages in the provision of various products and services that generate, transfer, orchestrate, convert, and store electricity in the United States, Europe, Asia, the Americas, the Middle East, and Africa. The company operates through three segments: Power, Wind, and Electrification. The Power segment designs, manufactures, and services gas, nuclear, hydro, and steam technologies. The Wind segment offers wind generation technologies, including onshore and offshore wind turbines and blades. The Electrification segment provides grid solutions, power conversion, solar, and storage solutions; and electrification software for the transmission, distribution, conversion, storage, and orchestration of electricity from point of generation to point of consumption. The company was incorporated in 2023 and is headquartered in Cambridge, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 17:16:35"},{"Company Name":"Amphenol Corporation","Symbol":"APH","Current Price":"71.14","Latest MA":"67.73","Price Target":83.37647,"Difference from MA":"5.04%","Difference from Open":"-0.71%","Change from Yesterday":"2.49%","Change from Last Report":"0.00","Latest Volume":"1,016,805","Market Cap":"85,767,094,272","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":28.271107,"PB Ratio":9.071666,"ROE":0.25293,"DTE":57.565,"Industry":"Electronic Components","Sector":"Technology","Beta":1.238,"Trailing PEG":2.4645,"Trailing PE":37.052082,"Trailing PS":6.0261865,"Quick Ratio":1.208,"Day High":71.6,"Day Low":70.31,"VS Average Volume":0.1496498009,"Company Summary":"Amphenol Corporation, together with its subsidiaries, primarily designs, manufactures, and markets electrical, electronic, and fiber optic connectors in the United States, China, and internationally. It operates through three segments: Harsh Environment Solutions, Communications Solutions, and Interconnect and Sensor Systems. The company offers connectors and connector systems, including harsh environment data, power, high-speed, fiber optic, and radio frequency interconnect products; busbars and power distribution systems; and other connectors. It also provides value-add products, such as backplane interconnect systems, cable assemblies and harnesses, and cable management products; other products comprising flexible and rigid printed circuit boards, hinges, other mechanical, and production related products. In addition, the company offers consumer device, network infrastructure, and other antennas; coaxial, power, and specialty cables; and sensors and sensor-based products. It sells its products through its sales force, independent representatives, and a network of electronics distributors to original equipment manufacturers, electronic manufacturing services companies, original design manufacturers, and service providers in the automotive, broadband communication, commercial aerospace, industrial, information technology and data communication, military, mobile device, and mobile network markets. Amphenol Corporation was founded in 1932 and is headquartered in Wallingford, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 17:16:35"},{"Company Name":"Netflix, Inc.","Symbol":"NFLX","Current Price":"979.69","Latest MA":"764.41","Price Target":1063.7195,"Difference from MA":"28.16%","Difference from Open":"-0.70%","Change from Yesterday":"0.19%","Change from Last Report":"0.00","Latest Volume":"1,154,587","Market Cap":"419,069,263,872","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":32.304344,"PB Ratio":18.431509,"ROE":0.34714,"DTE":81.461,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.25,"Trailing PEG":2.8552,"Trailing PE":49.329807,"Trailing PS":11.149231,"Quick Ratio":0.975,"Day High":994.57,"Day Low":977.73,"VS Average Volume":0.3342227901,"Company Summary":"Netflix, Inc. provides entertainment services. It offers TV series, documentaries, feature films, and games across various genres and languages. The company also provides members the ability to receive streaming content through a host of internet-connected devices, including TVs, digital video players, TV set-top boxes, and mobile devices. It has operations in approximately 190 countries. The company was incorporated in 1997 and is headquartered in Los Gatos, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 17:16:35"},{"Company Name":"Schlumberger N.V.","Symbol":"SLB","Current Price":"40.78","Latest MA":"42.69","Price Target":53.26903,"Difference from MA":"-4.48%","Difference from Open":"-0.59%","Change from Yesterday":"-0.59%","Change from Last Report":"0.00","Latest Volume":"1,499,774","Market Cap":"57,126,662,144","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":10.842601,"PB Ratio":2.6770825,"ROE":0.21722999,"DTE":57.141,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.532,"Trailing PEG":1.9154,"Trailing PE":13.11254,"Trailing PS":1.5870721,"Quick Ratio":1.003,"Day High":41.345,"Day Low":40.73,"VS Average Volume":0.1160029448,"Company Summary":"Schlumberger Limited engages in the provision of technology for the energy industry worldwide. The company operates through four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company provides field development and hydrocarbon production, carbon management, and integration of adjacent energy systems; reservoir interpretation and data processing services for exploration data; and well construction and production improvement services and products. It also offers subsurface geology and fluids evaluation information; open and cased hole services; exploration and production pressure, and flow-rate measurement services; and pressure pumping, well stimulation, and coiled tubing equipment solutions. In addition, the company offers mud logging, directional drilling, measurement-while-drilling, and logging-while-drilling services, as well as engineering support services; supplies drilling fluid systems; designs, manufactures, and markets roller cone and fixed cutter drill bits; bottom-hole-assembly and borehole enlargement technologies; well cementing products and services; well planning, well drilling, engineering, supervision, logistics, procurement, and contracting of third parties, as well as drilling rig management solutions; and drilling equipment and services, as well as land drilling rigs and related services. Further, it provides artificial lift production equipment and optimization services; supplies packers, safety valves, sand control technology, and various intelligent well completions technology and equipment; designs and manufactures valves, chokes, actuators, and surface trees; and OneSubsea, an integrated solutions, products, systems, and services, including wellheads, subsea trees, manifolds and flowline connectors, control systems, connectors, and services. The company was formerly known as Socie´te´ de Prospection E´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 17:16:35"},{"Company Name":"Bank of America Corporation","Symbol":"BAC","Current Price":"46.88","Latest MA":"42.24","Price Target":52.16667,"Difference from MA":"10.98%","Difference from Open":"-0.50%","Change from Yesterday":"0.09%","Change from Last Report":"0.00","Latest Volume":"4,360,780","Market Cap":"356,759,076,864","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.82626,"PB Ratio":1.3252382,"ROE":0.08092,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.325,"Trailing PEG":2.0713,"Trailing PE":14.602803,"Trailing PS":3.7702014,"Quick Ratio":"N\/A","Day High":47.16,"Day Low":46.76,"VS Average Volume":0.1225808113,"Company Summary":"Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. It operates in four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, non-interest and interest-bearing checking accounts, and investment accounts and products; credit and debit cards; residential mortgages, and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research, and certain market-based services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 17:16:35"},{"Company Name":"Citigroup, Inc.","Symbol":"C","Current Price":"81.68","Latest MA":"65.71","Price Target":91.47222,"Difference from MA":"24.30%","Difference from Open":"0.48%","Change from Yesterday":"1.03%","Change from Last Report":"0.00","Latest Volume":"1,231,748","Market Cap":"153,318,703,104","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.831616,"PB Ratio":0.8015004,"ROE":0.03874,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.426,"Trailing PEG":0.874,"Trailing PE":13.727479,"Trailing PS":2.2121358,"Quick Ratio":"N\/A","Day High":81.69,"Day Low":80.99,"VS Average Volume":0.0833787768,"Company Summary":"Citigroup Inc., a diversified financial service holding company, provides various financial product and services to consumers, corporations, governments, and institutions worldwide. It operates through five segments: Services, Markets, Banking, U.S. Personal Banking, and Wealth. The Services segment includes Treasury and Trade Solutions, which provides cash management, trade, and working capital solutions to multinational corporations, financial institutions, and public sector organizations; and Securities Services, such as cross-border support for clients, local market expertise, post-trade technologies, data solutions, and various securities services solutions. The Markets segment offers sales and trading services for equities, foreign exchange, rates, spread products, and commodities to corporate, institutional, and public sector clients; and market-making services, including asset classes, risk management solutions, financing, prime brokerage, research, securities clearing, and settlement. The banking segment includes investment banking; advisory services related to mergers and acquisitions, divestitures, restructurings, and corporate defense activities; and corporate lending, which includes corporate and commercial banking. The U.S. Personal Banking segment provides co-branded cards and retail banking services. The Wealth segment provides financial services to high-net-worth clients through banking, lending, mortgages, investment, custody, and trust product offerings; and to professional industries, including law firms, consulting groups, accounting, and asset management. The company was founded in 1812 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 17:16:35"},{"Company Name":"Wells Fargo & Company","Symbol":"WFC","Current Price":"78.95","Latest MA":"63.59","Price Target":83.28571,"Difference from MA":"24.16%","Difference from Open":"-0.25%","Change from Yesterday":"0.54%","Change from Last Report":"0.00","Latest Volume":"1,205,883","Market Cap":"259,661,807,616","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":11.542313,"PB Ratio":1.604088,"ROE":0.099139996,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.136,"Trailing PEG":3.4646,"Trailing PE":14.702048,"Trailing PS":3.3343408,"Quick Ratio":"N\/A","Day High":79.23,"Day Low":78.78,"VS Average Volume":0.0728377238,"Company Summary":"Wells Fargo & Company, a financial services company, provides diversified banking, investment, mortgage, and consumer and commercial finance products and services in the United States and internationally. The company operates through four segments: Consumer Banking and Lending; Commercial Banking; Corporate and Investment Banking; and Wealth and Investment Management. The Consumer Banking and Lending segment offers diversified financial products and services for consumers and small businesses. Its financial products and services include checking and savings accounts, and credit and debit cards, as well as home, auto, personal, and small business lending services. The Commercial Banking segment provides financial solutions to private, family owned, and certain public companies. Its products and services include banking and credit products across various industry sectors and municipalities, secured lending and lease products, and treasury management services. The Corporate and Investment Banking segment offers a suite of capital markets, banking, and financial products and services, such as corporate banking, investment banking, treasury management, commercial real estate lending and servicing, equity, and fixed income solutions, as well as sales, trading, and research capabilities services to corporate, commercial real estate, government, and institutional clients. The Wealth and Investment Management segment provides personalized wealth management, brokerage, financial planning, lending, private banking, and trust and fiduciary products and services to affluent, high-net worth, and ultra-high-net worth clients. It also operates through financial advisors in brokerage and wealth offices, consumer bank branches, independent offices, and digitally through WellsTrade and Intuitive Investor. The company was founded in 1852 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 17:16:35"},{"Company Name":"JP Morgan Chase & Co.","Symbol":"JPM","Current Price":"267.88","Latest MA":"223.80","Price Target":265.5481,"Difference from MA":"19.69%","Difference from Open":"-0.28%","Change from Yesterday":"0.30%","Change from Last Report":"0.00","Latest Volume":"1,033,840","Market Cap":"749,421,133,824","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.657174,"PB Ratio":2.326357,"ROE":0.16216,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.091,"Trailing PEG":7.244,"Trailing PE":13.563544,"Trailing PS":4.621834,"Quick Ratio":"N\/A","Day High":268.98,"Day Low":267.1,"VS Average Volume":0.1084776209,"Company Summary":"JPMorgan Chase & Co. operates as a financial services company worldwide. It operates through three segments: Consumer & Community Banking, Commercial & Investment Bank, and Asset & Wealth Management. It offers deposit, investment and lending products, cash management, and payments and services; mortgage origination and servicing activities; residential mortgages and home equity loans; and credit cards, auto loans, leases, and travel services to consumers and small businesses through bank branches, ATMs, and digital and telephone banking. The company also provides investment banking products and services, including corporate strategy and structure advisory, and equity and debt market capital-raising services, as well as loan origination and syndication; payments; and cash and derivative instruments, risk management solutions, prime brokerage, and research, as well as offers securities services, including custody, fund accounting and administration, and securities lending products for asset managers, insurance companies, and public and private investment funds. In addition, it provides financial solutions, including lending, payments, investment banking, and asset management to small and midsized companies, local governments, nonprofit clients, and large corporations, as well as investors, developers, and owners of multifamily, office, retail, industrial, and affordable housing properties. Further, the company offers multi-asset investment management solutions in equities, fixed income, alternatives, and money market funds to institutional clients and retail investors; and retirement products and services, brokerage, custody, estate planning, lending, deposits, and investment management products to high net worth clients. JPMorgan Chase & Co. was founded in 1799 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 17:16:35"},{"Company Name":"Walgreens Boots Alliance, Inc.","Symbol":"WBA","Current Price":"11.42","Latest MA":"9.77","Price Target":12.414,"Difference from MA":"16.92%","Difference from Open":"1.24%","Change from Yesterday":"2.09%","Change from Last Report":"0.00","Latest Volume":"2,775,526","Market Cap":"9,868,627,968","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":7.716164,"PB Ratio":0.9446605,"ROE":-0.75969005,"DTE":277.898,"Industry":"Pharmaceutical Retailers","Sector":"Healthcare","Beta":0.669,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.06683436,"Quick Ratio":0.332,"Day High":11.6,"Day Low":11.25,"VS Average Volume":0.1139625361,"Company Summary":"Walgreens Boots Alliance, Inc. operates as a healthcare, pharmacy, and retail company in the United States, Germany, the United Kingdom, and internationally. It operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The U.S. Retail Pharmacy segment engages in operation of the retail drugstores, health and wellness services, specialty, and home delivery pharmacy services, which offers health and wellness, beauty, personal care and consumables, and general merchandise. The International segment offers sale of prescription drugs and health and wellness, beauty, personal care, and other consumer products outside the United States; and operates pharmacy-led health and beauty retail businesses under the Boots brand stores in the United Kingdom, the Republic of Ireland, and Thailand, as well as the Benavides brand in Mexico and the Ahumada brand in Chile. The U.S. Healthcare segment provides VillageMD, a national provider of value-based care with primary, multi-specialty, and urgent care providers serving patients in traditional clinic settings, in patients' homes and online appointments; Shields, a specialty pharmacy integrator and accelerator for hospitals; and CareCentrix, a participant in the post-acute and home care management sectors. Walgreens Boots Alliance, Inc. was founded in 1909 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"30-01-2025 17:16:35"},{"Company Name":"Alphabet Inc.","Symbol":"GOOGL","Current Price":"200.29","Latest MA":"174.35","Price Target":216.14644,"Difference from MA":"14.88%","Difference from Open":"1.16%","Change from Yesterday":"2.31%","Change from Last Report":"0.00","Latest Volume":"6,283,494","Market Cap":"2,461,784,342,528","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":22.263002,"PB Ratio":7.8198566,"ROE":0.32101002,"DTE":9.324,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.034,"Trailing PEG":1.2782,"Trailing PE":26.56366,"Trailing PS":7.243546,"Quick Ratio":1.761,"Day High":201.4,"Day Low":197.94,"VS Average Volume":0.2265344547,"Company Summary":"Alphabet Inc. offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube. It is also involved in the sale of apps and in-app purchases and digital content in the Google Play and YouTube; and devices, as well as in the provision of YouTube consumer subscription services. The Google Cloud segment offers infrastructure, cybersecurity, databases, analytics, AI, and other services; Google Workspace that include cloud-based communication and collaboration tools for enterprises, such as Gmail, Docs, Drive, Calendar, and Meet; and other services for enterprise customers. The Other Bets segment sells healthcare-related and internet services. The company was incorporated in 1998 and is headquartered in Mountain View, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 17:17:37"},{"Company Name":"Lumen Technologies, Inc.","Symbol":"LUMN","Current Price":"5.04","Latest MA":"5.48","Price Target":5.37091,"Difference from MA":"-8.11%","Difference from Open":"-0.89%","Change from Yesterday":"-1.60%","Change from Last Report":"0.00","Latest Volume":"1,158,172","Market Cap":"5,109,568,000","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":-7.5216613,"PB Ratio":14.940652,"ROE":-1.6673199,"DTE":5502.924,"Industry":"Telecom Services","Sector":"Communication Services","Beta":1.201,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.38429362,"Quick Ratio":0.988,"Day High":5.0922,"Day Low":4.96,"VS Average Volume":0.0816236551,"Company Summary":"Lumen Technologies, Inc., a facilities-based technology and communications company, provides various integrated products and services to business and residential customers in the United States and internationally. The company operates in two segments, Business and Mass Markets. It offers dark fiber, edge cloud services, internet protocol, managed security, software-defined wide area networks, secure access service edge, unified communications and collaboration, and optical wavelengths services; ethernet and VPN data networks services; and legacy services to manage cash flow, including time division multiplexing voice, private line, and other legacy services, as well as sells communication equipment, and IT solutions. The company also provides high speed and lower speed broadband service to residential and small business customers; local and long-distance voice services, professional services, and other ancillary services; and federal broadband and state support programs. It serves its products and services under the Lumen, Quantum Fiber, and CenturyLink brands. The company was formerly known as CenturyLink, Inc. and changed its name to Lumen Technologies, Inc. in September 2020. Lumen Technologies, Inc. was incorporated in 1968 and is headquartered in Monroe, Louisiana.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"30-01-2025 17:17:37"},{"Company Name":"Pfizer, Inc.","Symbol":"PFE","Current Price":"26.64","Latest MA":"27.17","Price Target":31.12955,"Difference from MA":"-1.94%","Difference from Open":"-0.07%","Change from Yesterday":"0.15%","Change from Last Report":"0.00","Latest Volume":"3,210,297","Market Cap":"150,983,344,128","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":9.122991,"PB Ratio":1.6357195,"ROE":0.04538,"DTE":73.408,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.615,"Trailing PEG":0.1994,"Trailing PE":35.523464,"Trailing PS":2.5428772,"Quick Ratio":0.64,"Day High":26.755,"Day Low":26.58,"VS Average Volume":0.0735711484,"Company Summary":"Pfizer Inc. discovers, develops, manufactures, markets, distributes, and sells biopharmaceutical products in the United States, Europe, and internationally. The company offers medicines and vaccines in various therapeutic areas, including cardiovascular metabolic, migraine, and women's health under the Eliquis, Nurtec ODT\/Vydura, Zavzpret, and the Premarin family brands; infectious diseases with unmet medical needs under the Prevnar family, Abrysvo, Nimenrix, FSME\/IMMUN-TicoVac, and Trumenba brands; and COVID-19 prevention and treatment, and potential future mRNA and antiviral products under the Comirnaty and Paxlovid brands. It also provides medicines and vaccines in various therapeutic areas, such as biosimilars for chronic immune and inflammatory diseases under the Xeljanz, Enbrel, Inflectra, Litfulo, Velsipity, and Cibinqo brands; amyloidosis, hemophilia, endocrine diseases, and sickle cell disease under the Vyndaqel family, Oxbryta, BeneFIX, Somavert, Ngenla, and Genotropin brands; sterile injectable and anti-infective medicines under the Sulperazon, Medrol, Zavicefta, Zithromax, and Panzyga brands; and biologics, small molecules, immunotherapies, and biosimilars under the Ibrance, Xtandi, Inlyta, Bosulif, Mektovi, Padcev, Adcetris, Talzenna, Tukysa, Elrexfio, Tivdak, Lorbrena, and Braftovi brands. In addition, the company involved in the contract manufacturing business. It serves wholesalers, retailers, hospitals, clinics, government agencies, pharmacies, individual provider offices, retail pharmacies, and integrated delivery systems. The company has collaboration agreements with Bristol-Myers Squibb Company; Astellas Pharma US, Inc.; Merck KGaA; and BioNTech SE, as well as has strategic clinical collaboration with Acepodia Inc. for the development of antibody-cell conjugation-based cell therapies in autoimmune diseases. Pfizer Inc. was founded in 1849 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 17:17:37"},{"Company Name":"Super Micro Computer, Inc.","Symbol":"SMCI","Current Price":"28.19","Latest MA":"47.17","Price Target":40.79182,"Difference from MA":"-40.24%","Difference from Open":"-1.36%","Change from Yesterday":"1.65%","Change from Last Report":"0.00","Latest Volume":"4,872,962","Market Cap":"16,507,077,632","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.6409535,"PB Ratio":3.0246782,"ROE":0.32469,"DTE":39.749,"Industry":"Computer Hardware","Sector":"Technology","Beta":1.279,"Trailing PEG":null,"Trailing PE":14.024876,"Trailing PS":1.1046804,"Quick Ratio":1.805,"Day High":28.63,"Day Low":28.01,"VS Average Volume":0.0658306767,"Company Summary":"Super Micro Computer, Inc., together with its subsidiaries, develops and manufactures high performance server and storage solutions based on modular and open architecture in the United States, Europe, Asia, and internationally. Its solutions range from complete server, storage systems, modular blade servers, blades, workstations, full racks, networking devices, server sub-systems, server management software, and security software. The company provides application-optimized server solutions, rackmount and blade servers, storage, and subsystems and accessories; and server software management solutions, such as Server Management Suite, including Supermicro Server Manager, Supermicro Power Management software, Supermicro Update Manager, SuperCloud Composer, and SuperDoctor 5. In addition, it offers server subsystems and accessories comprising server boards, chassis, power supplies, and other accessories. Further, the company provides server and storage system integration, configuration, and software upgrade and update services; and technical documentation services, as well as identifies service requirements, creates and executes project plans, and conducts verification testing and technical documentation, and training services. Additionally, it offers help desk and on-site product support services for its server and storage systems; and customer support services, including ongoing maintenance and technical support for its products. The company provides its products to enterprise data centers, cloud computing, artificial intelligence, and 5G and edge computing markets. It sells its products through direct and indirect sales force, distributors, value-added resellers, system integrators, and original equipment manufacturers. The company was incorporated in 1993 and is headquartered in San Jose, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"30-01-2025 17:17:37"},{"Company Name":"Juniper Networks, Inc.","Symbol":"JNPR","Current Price":"36.04","Latest MA":"37.73","Price Target":39.7,"Difference from MA":"-4.48%","Difference from Open":"0.95%","Change from Yesterday":"2.46%","Change from Last Report":"0.00","Latest Volume":"1,085,277","Market Cap":"11,932,447,744","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":18.047703,"PB Ratio":2.568598,"ROE":0.055760004,"DTE":39.109,"Industry":"Communication Equipment","Sector":"Technology","Beta":0.921,"Trailing PEG":null,"Trailing PE":47.421055,"Trailing PS":2.3702297,"Quick Ratio":1.069,"Day High":36.47,"Day Low":35.31,"VS Average Volume":0.267894553,"Company Summary":"Juniper Networks, Inc. designs, develops, and sells network products and services worldwide. The company offers routing products, such as ACX series universal access routers to deploy high-bandwidth services; MX series Ethernet routers that function as a universal edge platform; PTX series packet transport routers; wide-area network SDN controllers; and session smart routers. It also provides switching products, including EX series Ethernet switches to address the access, aggregation, and core layer switching requirements of micro branch, branch office, and campus environments; QFX series of core, spine, and top-of-rack data center switches; and juniper access points, which provide Wi-Fi access and performance. In addition, the company offers security products comprising SRX series services gateways for the data center; Branch SRX family provides an integrated and next-generation firewall; virtual firewall that delivers various features of physical firewalls; and advanced malware protection, a cloud-based service and Juniper ATP. Further, it offers Junos OS, a network operating system; Contrail networking, which provides an open-source and standards-based platform for SDN; Mist AI-driven Wired, Wireless, and WAN assurance solutions to set and measure key metrics; Mist AI-driven Marvis Virtual Network Assistant, which identifies the root cause of issues; Juniper Paragon Automation, a modular portfolio of cloud-native software applications; and Juniper Apstra to automate the network lifecycle in a single system. Additionally, the company provides software-as-a-service, technical support, maintenance, and professional services, as well as education and training programs. It sells its products through direct sales, distributors, value-added resellers, and original equipment manufacturers to end-users in the cloud, service provider, and enterprise markets. The company was incorporated in 1996 and is headquartered in Sunnyvale, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"30-01-2025 17:17:37"},{"Company Name":"Amcor plc","Symbol":"AMCR","Current Price":"9.68","Latest MA":"10.27","Price Target":11.29556,"Difference from MA":"-5.77%","Difference from Open":"-0.41%","Change from Yesterday":"-0.51%","Change from Last Report":"0.00","Latest Volume":"1,701,297","Market Cap":"13,990,891,520","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":12.192665,"PB Ratio":3.568006,"ROE":0.1958,"DTE":196.619,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":0.863,"Trailing PEG":1.9233,"Trailing PE":18.264153,"Trailing PS":1.032538,"Quick Ratio":0.591,"Day High":9.76,"Day Low":9.68,"VS Average Volume":0.1084704662,"Company Summary":"Amcor plc develops, produces, and sells packaging products in Europe, North America, Latin America, and the Asia Pacific. The company operates in two segments, Flexibles and Rigid Packaging. The Flexibles segment offers flexible and film packaging products in the food and beverage, medical and pharmaceutical, fresh produce, snack food, personal care, and other industries. The Rigid Packaging segment provides rigid containers for various beverage and food products, including carbonated soft drinks, water, juices, sports drinks, milk-based beverages, spirits and beer, sauces, dressings, spreads, and personal care items; and plastic caps for various applications. It sells its products through its direct sales force. The company was incorporated in 1926 and is headquartered in Zurich, Switzerland.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 17:17:37"},{"Company Name":"Advanced Micro Devices, Inc.","Symbol":"AMD","Current Price":"118.93","Latest MA":"144.69","Price Target":169.81767,"Difference from MA":"-17.80%","Difference from Open":"0.38%","Change from Yesterday":"1.32%","Change from Last Report":"0.00","Latest Volume":"7,347,684","Market Cap":"193,000,636,416","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":24.049076,"PB Ratio":3.3872547,"ROE":0.03262,"DTE":3.927,"Industry":"Semiconductors","Sector":"Technology","Beta":1.706,"Trailing PEG":0.3245,"Trailing PE":105.2477,"Trailing PS":7.9440475,"Quick Ratio":1.575,"Day High":120.44,"Day Low":118.43,"VS Average Volume":0.202318948,"Company Summary":"Advanced Micro Devices, Inc. operates as a semiconductor company worldwide. It operates through Data Center, Client, Gaming, and Embedded segments. The company offers x86 microprocessors and graphics processing units (GPUs) as an accelerated processing unit, chipsets, data center, and professional GPUs; and embedded processors, and semi-custom system-on-chip (SoC) products, microprocessor and SoC development services and technology, data processing unites, field programmable gate arrays (FPGA), and adaptive SoC products. It provides processors under the AMD Ryzen, AMD Ryzen PRO, Ryzen Threadripper, Ryzen Threadripper PRO, AMD Athlon, AMD Athlon PRO, and AMD PRO A-Series brand names; graphics under the AMD Radeon graphics and AMD Embedded Radeon graphics; and professional graphics under the AMD Radeon Pro graphics brand name. In addition, the company offers data center graphics under the Radeon Instinct and Radeon PRO V-series brands, as well as servers under the AMD Instinct accelerators brand; server microprocessors under the AMD EPYC brands; low power solutions under the AMD Athlon, AMD Geode, AMD Ryzen, AMD EPYC, AMD R-Series, and G-Series brands; FPGA products under the Virtex-6, Virtex-7, Virtex UltraScale+, Kintex-7, Kintex UltraScale, Kintex UltraScale+, Artix-7, Artix UltraScale+, Spartan-6, and Spartan-7 brands; adaptive SOCs under the Zynq-7000, Zynq UltraScale+ MPSoC, Zynq UltraScale+ RFSoCs, Versal HBM, Versal Premium, Versal Prime, Versal AI Core, Versal AI Edge, Vitis, and Vivado brands; and compute and network acceleration board products under the Alveo brand. It serves original equipment and design manufacturers, public cloud service providers, system integrators, independent distributors, and add-in-board manufacturers through its direct sales force, and sales representatives. Advanced Micro Devices, Inc. was incorporated in 1969 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 17:17:37"},{"Company Name":"PayPal Holdings, Inc.","Symbol":"PYPL","Current Price":"90.01","Latest MA":"76.77","Price Target":96.24829,"Difference from MA":"17.24%","Difference from Open":"0.28%","Change from Yesterday":"1.23%","Change from Last Report":"0.00","Latest Volume":"1,646,305","Market Cap":"90,238,631,936","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":18.338476,"PB Ratio":4.4883814,"ROE":0.22188,"DTE":65.718,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.436,"Trailing PEG":1.4784,"Trailing PE":21.533495,"Trailing PS":2.8686345,"Quick Ratio":0.261,"Day High":90.925,"Day Low":89.6,"VS Average Volume":0.1903763724,"Company Summary":"PayPal Holdings, Inc. operates a technology platform that enables digital payments on behalf of merchants and consumers worldwide. It operates a two-sided network at scale that connects merchants and consumers that enables its customers to connect, transact, and send and receive payments through online and in person, as well as transfer and withdraw funds using various funding sources, such as bank accounts, PayPal or Venmo account balance, PayPal and Venmo branded credit products comprising its installment products, credit and debit cards, and cryptocurrencies, as well as other stored value products, including gift cards and eligible rewards. The company provides payment solutions under the PayPal, PayPal Credit, Braintree, Venmo, Xoom, Zettle, Hyperwallet, Honey, and Paidy names. The company was founded in 1998 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 17:17:37"},{"Company Name":"Snap Inc.","Symbol":"SNAP","Current Price":"11.43","Latest MA":"11.46","Price Target":13.17057,"Difference from MA":"-0.28%","Difference from Open":"-1.80%","Change from Yesterday":"-1.81%","Change from Last Report":"0.00","Latest Volume":"2,871,142","Market Cap":"19,170,342,912","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":27.972641,"PB Ratio":8.645915,"ROE":-0.4062,"DTE":191.874,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":0.995,"Trailing PEG":496.0591,"Trailing PE":"N\/A","Trailing PS":3.7112973,"Quick Ratio":3.861,"Day High":11.66,"Day Low":11.41,"VS Average Volume":0.0974785671,"Company Summary":"Snap Inc. operates as a technology company in North America, Europe, and internationally. The company offers Snapchat, a visual messaging application with various tabs, such as camera, visual messaging, snap map, stories, and spotlight that enable people to communicate visually through short videos and images. It also provides Spectacles, an eyewear product that connects with Snapchat and captures photos and video from a human perspective; and advertising products, including AR ads and Snap ads comprises a single image or video ads, collection ads, dynamic ads, story ads, and commercials. The company was formerly known as Snapchat, Inc. and changed its name to Snap Inc. in September 2016. Snap Inc. was founded in 2010 and is headquartered in Santa Monica, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"30-01-2025 17:17:37"},{"Company Name":"Chipotle Mexican Grill, Inc.","Symbol":"CMG","Current Price":"59.18","Latest MA":"57.92","Price Target":66.30719,"Difference from MA":"2.18%","Difference from Open":"0.96%","Change from Yesterday":"1.49%","Change from Last Report":"0.00","Latest Volume":"1,091,278","Market Cap":"80,638,754,816","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":44.725964,"PB Ratio":22.332264,"ROE":0.45673,"DTE":124.061,"Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":1.266,"Trailing PEG":2.0257,"Trailing PE":54.796757,"Trailing PS":7.340898,"Quick Ratio":1.486,"Day High":59.57,"Day Low":58.5792,"VS Average Volume":0.1206300435,"Company Summary":"Chipotle Mexican Grill, Inc., together with its subsidiaries, owns and operates Chipotle Mexican Grill restaurants. It sells food and beverages through offering burritos, burrito bowls, quesadillas, tacos, and salads. The company also provides delivery and related services its app and website. It has operations in the United States, Canada, France, Germany, Dubai, and the United Kingdom. Chipotle Mexican Grill, Inc. was founded in 1993 and is headquartered in Newport Beach, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 17:17:37"},{"Company Name":"Western Union Company (The)","Symbol":"WU","Current Price":"10.45","Latest MA":"11.13","Price Target":12.46667,"Difference from MA":"-6.17%","Difference from Open":"0.82%","Change from Yesterday":"0.63%","Change from Last Report":"0.00","Latest Volume":"1,569,698","Market Cap":"3,528,331,264","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":5.7771015,"PB Ratio":5.4063144,"ROE":1.06689,"DTE":396.308,"Industry":"Credit Services","Sector":"Financial Services","Beta":0.888,"Trailing PEG":2.1003,"Trailing PE":5.3290815,"Trailing PS":0.83931947,"Quick Ratio":0.221,"Day High":10.46,"Day Low":10.345,"VS Average Volume":0.3421688743,"Company Summary":"The Western Union Company provides money movement and payment services worldwide. The company operates through Consumer Money Transfer and Consumer Services segments. The Consumer Money Transfer segment facilitates money transfers for international cross-border and intra-country transfers, primarily through a network of retail agent locations, as well as through websites and mobile devices. The Consumer Services segments offers bill payment services, which facilitate payments for consumers, businesses, and other organizations, as well as money order services, retail foreign exchange services, prepaid cards, lending partnerships, and digital wallets. The company was founded in 1851 and is headquartered in Denver, Colorado.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"30-01-2025 17:17:37"},{"Company Name":"Mondelez International, Inc.","Symbol":"MDLZ","Current Price":"57.41","Latest MA":"66.16","Price Target":72.4844,"Difference from MA":"-13.23%","Difference from Open":"-0.16%","Change from Yesterday":"0.60%","Change from Last Report":"0.00","Latest Volume":"1,008,465","Market Cap":"76,768,075,776","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":17.525276,"PB Ratio":2.756121,"ROE":0.13552,"DTE":73.232,"Industry":"Confectioners","Sector":"Consumer Defensive","Beta":0.561,"Trailing PEG":4.7878,"Trailing PE":20.358156,"Trailing PS":2.1235394,"Quick Ratio":0.295,"Day High":57.76,"Day Low":57.24,"VS Average Volume":0.109486959,"Company Summary":"Mondelez International, Inc., through its subsidiaries, manufactures, markets, and sells snack food and beverage products in the Latin America, North America, Asia, the Middle East, Africa, and Europe. It provides biscuits and baked snacks, including cookies, crackers, salted snacks, snack bars, and cakes and pastries; chocolates; and gums and candies, as well as various cheese and grocery, and powdered beverage products. The company's brand portfolio includes Oreo, Ritz, LU, CLIF Bar, and Tate's Bake Shop biscuits and baked snacks, as well as Cadbury Dairy Milk, Milka, and Toblerone chocolate. It serves supermarket chains, wholesalers, supercenters, club stores, mass merchandisers, distributors, convenience stores, gasoline stations, drug stores, value stores, and other retail food outlets through direct store delivery, company-owned and satellite warehouses, distribution centers, third party distributors, and other facilities, as well as through independent sales offices and agents. The company also sells products directly to businesses and consumers through e-retail platforms, retailer digital platforms, as well as through its direct-to-consumer websites and social media platforms. Mondelez International, Inc. was formerly known as Kraft Foods Inc. and changed its name to Mondelez International, Inc. in October 2012. The company was incorporated in 2000 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 17:17:37"},{"Company Name":"Merck & Company, Inc.","Symbol":"MRK","Current Price":"98.47","Latest MA":"108.73","Price Target":123.96542,"Difference from MA":"-9.43%","Difference from Open":"-0.94%","Change from Yesterday":"0.41%","Change from Last Report":"0.00","Latest Volume":"1,012,709","Market Cap":"249,106,284,544","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":10.587514,"PB Ratio":5.6028104,"ROE":0.28332,"DTE":85.572,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.411,"Trailing PEG":0.0693,"Trailing PE":20.601463,"Trailing PS":3.9431772,"Quick Ratio":0.917,"Day High":99.41,"Day Low":98.43,"VS Average Volume":0.086701227,"Company Summary":"Merck & Co., Inc. operates as a healthcare company worldwide. It operates through two segments, Pharmaceutical and Animal Health. The Pharmaceutical segment offers human health pharmaceutical products in the areas of oncology, hospital acute care, immunology, neuroscience, virology, cardiovascular, and diabetes under the Keytruda, Bridion, Adempas, Lagevrio, Belsomra, Simponi, and Januvia brands, as well as vaccine products consisting of preventive pediatric, adolescent, and adult vaccines under the Gardasil\/Gardasil 9, ProQuad, M-M-R II, Varivax, RotaTeq, Live Oral, Vaxneuvance, Pneumovax 23, and Vaqta names. The Animal Health segment discovers, develops, manufactures, and markets veterinary pharmaceuticals, vaccines, and health management solutions and services, as well as digitally connected identification, traceability, and monitoring products. vIt has development and commercialization agreement for three of Daiichi Sankyo's deruxtecan ADC candidates, which include patritumab deruxtecan, ifinatamab deruxtecan, and raludotatug deruxtecan for the treatment of multiple solid tumors both as monotherapy and\/or in combination with other treatments; and AstraZeneca PLC to co-development and co-commercialize AstraZeneca's Lynparza products for multiple cancer types, and Koselugo for multiple indications. It also has licensed to develop, manufacture and  commercialize LM-299, a novel investigational PD-1\/VEGF bispecific antibody from LaNova. The company also has a collaboration agreement with Eisai Co., Ltd., Bayer AG, and Ridgeback Biotherapeutics LP, as well Moderna, Inc. Merck & Co., Inc. was founded in 1891 and is headquartered in Rahway, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 17:17:37"},{"Company Name":"CNH Industrial N.V.","Symbol":"CNH","Current Price":"12.94","Latest MA":"10.94","Price Target":14.19474,"Difference from MA":"18.27%","Difference from Open":"-1.63%","Change from Yesterday":"-1.03%","Change from Last Report":"0.00","Latest Volume":"2,162,529","Market Cap":"16,155,556,864","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":15.075758,"PB Ratio":2.1139076,"ROE":0.22186,"DTE":356.262,"Industry":"Farm & Heavy Construction Machinery","Sector":"Industrials","Beta":1.597,"Trailing PEG":null,"Trailing PE":9.511029,"Trailing PS":0.7427159,"Quick Ratio":3.87,"Day High":13.17,"Day Low":12.92,"VS Average Volume":0.1797948246,"Company Summary":"CNH Industrial N.V., an equipment and services company, engages in the design, production, marketing, sale, and financing of agricultural and construction equipment in North America, Europe, the Middle East, Africa, South America, and the Asia Pacific. The company operates through three segments: Agriculture, Construction, and Financial Services. The Agriculture segment designs, manufactures, and distributes farm machinery and implements, including two-wheel and four-wheel drive tractors, crawler tractors, combines, grape and sugar cane harvesters, hay and forage equipment, planting and seeding equipment, soil preparation and cultivation implements, material handling equipment, and precision agriculture technology. This segment sells its agricultural equipment under the New Holland Agriculture and Case IH brands. The Construction segment designs, manufactures, and distributes construction equipment comprising excavators, crawler dozers, graders, wheel loaders, backhoe loaders, skid steer loaders, and compact track loaders under the CASE Construction Equipment, New Holland Construction, and Eurocomach brands. The Financial Services segment offers financing to end-use customers for the purchase of new and used agricultural and construction equipment and components, as well as revolving charge account financing and other financial services. It also provides wholesale financing to CNH Industrial brand dealers and distributors; trade receivables factoring services to CNH companies; and financial services to Iveco Group companies in the North America, South America, and Asia Pacific regions. The company was founded in 1842 and is headquartered in Basildon, the United Kingdom.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 17:17:37"}]