[{"Company Name":"Warner Bros. Discovery, Inc. - ","Symbol":"WBD","Current Price":"11.44","Latest MA":"10.45","Latest MA 5":10.8989998932,"Latest MA 9":10.8205555344,"Latest MA 20":10.4537499218,"Price Target":12.9832,"Difference from MA":"9.39%","Difference from Open":"1.37%","Change from Yesterday":"8.90%","Change from Last Report":"0.22","Latest Volume":"10,979,239","Market Cap":"28,051,998,720","Earning Date":"2025-02-27","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":-87.96155,"PB Ratio":0.7988125,"Previous Close":10.5,"ROE":-0.27295,"DTE":111.154,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.497,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.70877755,"Quick Ratio":0.437,"Day High":11.9,"Day Low":11.13,"VS Average Volume":0.3852573547,"Company Summary":"Warner Bros. Discovery, Inc. operates as a media and entertainment company worldwide. It operates through three segments: Studios, Network, and DTC. The Studios segment produces and releases feature films for initial exhibition in theaters; produces and licenses television programs to its networks and third parties and direct-to-consumer services; distributes films and television programs to various third parties and internal television; and offers streaming services and distribution through the home entertainment market, themed experience licensing, and interactive gaming. The Network segment comprises domestic and international television networks. The DTC segment offers premium pay-tv and streaming services. In addition, the company offers portfolio of content, brands, and franchises across television, film, streaming, and gaming under the Warner Bros. Motion Picture Group, Warner Bros. Television Group, DC, HBO, HBO Max, Max, Discovery Channel, discovery+, CNN, HGTV, Food Network, TNT Sports, TBS, TLC, OWN, Warner Bros. Games, Batman, Superman, Wonder Woman, Harry Potter, Looney Tunes, Hanna-Barbera, Game of Thrones, and The Lord of the Rings brands. Further, it provides content through distribution platforms, including linear network, free-to-air, and broadcast television; authenticated GO applications, digital distribution arrangements, content licensing arrangements, and direct-to-consumer subscription products. Warner Bros. Discovery, Inc. was incorporated in 2008 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"27-02-2025 16:42:14"},{"Company Name":"Viatris Inc.","Symbol":"VTRS","Current Price":"8.95","Latest MA":"10.89","Latest MA 5":10.8609999313,"Latest MA 9":10.8838889143,"Latest MA 20":10.8897499714,"Price Target":13.2,"Difference from MA":"-17.86%","Difference from Open":"-3.40%","Change from Yesterday":"-20.46%","Change from Last Report":"1.53","Latest Volume":"5,894,342","Market Cap":"10,676,662,272","Earning Date":"2025-02-27","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":3.350187,"PB Ratio":0.53944033,"Previous Close":11.24,"ROE":-0.043449998,"DTE":80.912,"Industry":"Drug Manufacturers - Specialty & Generic","Sector":"Healthcare","Beta":0.952,"Trailing PEG":0.0707,"Trailing PE":"N\/A","Trailing PS":0.7094835,"Quick Ratio":0.819,"Day High":9.2797,"Day Low":8.7701,"VS Average Volume":0.6345925004,"Company Summary":"Viatris Inc. operates as a healthcare company worldwide. The company operates in four segments: Developed Markets, Greater China, JANZ, and Emerging Markets. It offers prescription brand drugs, generic drugs, complex generic drugs, biosimilars, and active pharmaceutical ingredients (APIs). The company offers drugs in various therapeutic areas, including noncommunicable and infectious diseases; biosimilars in the areas of oncology, immunology, endocrinology, ophthalmology, and dermatology; and APIs for antibacterial, central nervous system agents, antihistamines\/antiasthmatics, cardiovascular, antivirals, antidiabetics, antifungals, and proton pump inhibitor areas, as well as support services, such as diagnostic clinics, educational seminars, and digital tools to help patients better manage their health. It provides it medicines in the form of oral solid doses, injectables, complex dosage forms, and APIs to retail and pharmacy establishments, wholesalers and distributors, payers, insurers and governments, and institutions. The company distributes its products through pharmaceutical wholesalers\/distributors, pharmaceutical retailers, institutional pharmacies, mail-order and e-commerce pharmacies, and specialty pharmacies. It sells its products under the Lyrica, Lipitor, Creon, Influvac, Wixela Inhub, EpiPen auto-injector, Fraxiparine, and Yupelri; Norvasc and Viagra; AMITIZA, Lipacreon, and Effexor; and Celebrex and ARV names, as well as glargine and SEMGLEE names. The company has collaboration and licensing agreements with Revance Therapeutics, Inc.; and Momenta Pharmaceuticals, Inc. Viatris Inc. was founded in 1961 and is headquartered in Canonsburg, Pennsylvania.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"27-02-2025 16:42:14"},{"Company Name":"Norwegian Cruise Line Holdings ","Symbol":"NCLH","Current Price":"24.22","Latest MA":"26.55","Latest MA 5":24.5640000763,"Latest MA 9":25.4533334012,"Latest MA 20":26.5514999733,"Price Target":30.76476,"Difference from MA":"-8.78%","Difference from Open":"-2.69%","Change from Yesterday":"-3.79%","Change from Last Report":"-1.35","Latest Volume":"3,246,748","Market Cap":"10,649,726,976","Earning Date":"2025-02-27","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":11.588517,"PB Ratio":9.380325,"Previous Close":25.05,"ROE":0.69788,"DTE":1240.664,"Industry":"Travel Services","Sector":"Consumer Cyclical","Beta":2.65,"Trailing PEG":0.3098,"Trailing PE":21.245613,"Trailing PS":1.1381876,"Quick Ratio":0.088,"Day High":26.0,"Day Low":24.2,"VS Average Volume":0.360660975,"Company Summary":"Norwegian Cruise Line Holdings Ltd., together with its subsidiaries, operates as a cruise company in North America, Europe, the Asia-Pacific, and internationally. The company operates through the Norwegian Cruise Line, Oceania Cruises, and Regent Seven Seas Cruises brands. It offers itineraries ranging from three days to a 180-days calling on various ports, including Scandinavia, Northern Europe, the Mediterranean, the Greek Isles, Alaska, Canada and New England, Hawaii, Asia, Tahiti and the South Pacific, Australia and New Zealand, Africa, India, South America, the Panama Canal, and the Caribbean. It distributes its products through retail\/travel advisor and onboard cruise sales channels, as well as meetings, incentives, and charters. Norwegian Cruise Line Holdings Ltd. was founded in 1966 and is based in Miami, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 16:42:14"},{"Company Name":"Vistra Corp.","Symbol":"VST","Current Price":"144.68","Latest MA":"162.56","Latest MA 5":144.7979995117,"Latest MA 9":154.8288887533,"Latest MA 20":162.5649997559,"Price Target":175.17188,"Difference from MA":"-11.00%","Difference from Open":"1.17%","Change from Yesterday":"-2.25%","Change from Last Report":"-1.69","Latest Volume":"2,271,886","Market Cap":"49,223,892,992","Earning Date":"2025-02-27","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":20.968115,"PB Ratio":16.626062,"Previous Close":148.19,"ROE":0.30168,"DTE":183.15,"Industry":"Utilities - Independent Power Producers","Sector":"Utilities","Beta":1.237,"Trailing PEG":0.9111,"Trailing PE":27.246704,"Trailing PS":3.026369,"Quick Ratio":0.408,"Day High":152.94,"Day Low":145.0,"VS Average Volume":0.3051159445,"Company Summary":"Vistra Corp., together with its subsidiaries, operates as an integrated retail electricity and power generation company. The company operates through six segments: Retail, Texas, East, West, Sunset, and Asset Closure. It retails electricity and natural gas to residential, commercial, and industrial customers across states in the United States and the District of Columbia. In addition, the company is involved in the electricity generation, wholesale energy purchases and sales, commodity risk management, fuel production, and fuel logistics management activities. It serves approximately 5 million customers with a generation capacity of approximately 41,000 megawatts with a portfolio of natural gas, nuclear, coal, solar, and battery energy storage facilities. The company was formerly known as Vistra Energy Corp. and changed its name to Vistra Corp. in July 2020. Vistra Corp. was founded in 1882 and is based in Irving, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 16:42:14"},{"Company Name":"Paramount Global","Symbol":"PARA","Current Price":"11.03","Latest MA":"11.04","Latest MA 5":11.3820000229,"Latest MA 9":11.3811111747,"Latest MA 20":11.0410000458,"Price Target":12.892,"Difference from MA":"-0.10%","Difference from Open":"0.73%","Change from Yesterday":"-1.69%","Change from Last Report":"1.01","Latest Volume":"2,252,978","Market Cap":"7,812,765,184","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":6.773006,"PB Ratio":0.45391002,"Previous Close":11.22,"ROE":-0.30945,"DTE":92.653,"Industry":"Entertainment","Sector":"Communication Services","Beta":"N\/A","Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.26719913,"Quick Ratio":0.995,"Day High":11.05,"Day Low":10.84,"VS Average Volume":0.2549446794,"Company Summary":"Paramount Global operates as a media, streaming, and entertainment company worldwide. It operates through TV Media, Direct-to-Consumer, and Filmed Entertainment segments. The TV Media segment operates CBS Television Network, a domestic broadcast television network; CBS Stations, a television station; and international free-to-air networks comprising Network 10, Channel 5, Telefe, and Chilevisión; domestic premium and basic cable networks, such as Paramount+ with Showtime, MTV, Comedy Central, Paramount Network, The Smithsonian Channel, Nickelodeon, BET Media Group, and CBS Sports Network; and international extensions of these brands. This segment also offers domestic and international television studio operations, including CBS Studios, Paramount Television Studios, and Showtime\/MTV Entertainment Studios; CBS Media Ventures, which produces and distributes first-run syndicated programming; and digital properties consisting of CBS News Streaming and CBS Sports HQ. The Direct-to-Consumer segment provides a portfolio of domestic and international pay and free streaming services, including Paramount+, Pluto TV, BET+, and Noggin. The Filmed Entertainment segment produces and acquires films, series, and short-form content for release and licensing around the world, including in theaters, on streaming services, on television, through digital home entertainment, and DVDs\/Blu-rays; and operates a portfolio consisting of Paramount Pictures, Paramount Players, Paramount Animation, Nickelodeon Studio, Awesomeness, and Miramax. It also offers production, distribution, and advertising solutions. The company was formerly known as ViacomCBS Inc. and changed its name to Paramount Global in February 2022. The company was founded in 1914 and is headquartered in New York, New York. Paramount Global is a subsidiary of National Amusements, Inc.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"27-02-2025 16:42:14"},{"Company Name":"NVIDIA Corporation","Symbol":"NVDA","Current Price":"129.50","Latest MA":"130.29","Latest MA 5":130.4239974976,"Latest MA 9":134.4122204251,"Latest MA 20":130.2944992065,"Price Target":173.3807,"Difference from MA":"-0.61%","Difference from Open":"-4.07%","Change from Yesterday":"-1.37%","Change from Last Report":"-0.38","Latest Volume":"55,520,563","Market Cap":"3,170,940,747,776","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":31.426943,"PB Ratio":39.950325,"Previous Close":131.28,"ROE":1.1917701,"DTE":12.583,"Industry":"Semiconductors","Sector":"Technology","Beta":"N\/A","Trailing PEG":0.9409,"Trailing PE":44.040478,"Trailing PS":24.302896,"Quick Ratio":3.672,"Day High":135.0,"Day Low":129.37,"VS Average Volume":0.2323922573,"Company Summary":"NVIDIA Corporation provides graphics and compute and networking solutions in the United States, Taiwan, China, Hong Kong, and internationally. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro\/NVIDIA RTX GPUs for enterprise workstation graphics; virtual GPU or vGPU software for cloud-based visual and virtual computing; automotive platforms for infotainment systems; and Omniverse software for building and operating metaverse and 3D internet applications. The Compute & Networking segment comprises Data Center computing platforms and end-to-end networking platforms, including Quantum for InfiniBand and Spectrum for Ethernet; NVIDIA DRIVE automated-driving platform and automotive development agreements; Jetson robotics and other embedded platforms; NVIDIA AI Enterprise and other software; and DGX Cloud software and services. The company's products are used in gaming, professional visualization, data center, and automotive markets. It sells its products to original equipment manufacturers, original device manufacturers, system integrators and distributors, independent software vendors, cloud service providers, consumer internet companies, add-in board manufacturers, distributors, automotive manufacturers and tier-1 automotive suppliers, and other ecosystem participants. It has a strategic collaboration with IQVIA to help realize the potential of AI in healthcare and life sciences. NVIDIA Corporation was incorporated in 1993 and is headquartered in Santa Clara, California.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"27-02-2025 16:42:14"},{"Company Name":"eBay Inc.","Symbol":"EBAY","Current Price":"62.94","Latest MA":"68.33","Latest MA 5":68.4779993896,"Latest MA 9":68.984444241,"Latest MA 20":68.3315001221,"Price Target":65.01034,"Difference from MA":"-7.89%","Difference from Open":"-2.10%","Change from Yesterday":"-9.05%","Change from Last Report":"-8.97","Latest Volume":"2,263,630","Market Cap":"30,148,259,840","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":12.057471,"PB Ratio":5.820771,"Previous Close":69.14,"ROE":0.34291,"DTE":150.155,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":"N\/A","Trailing PEG":null,"Trailing PE":15.934176,"Trailing PS":2.9318545,"Quick Ratio":1.124,"Day High":64.83,"Day Low":62.78,"VS Average Volume":0.5130126858,"Company Summary":"eBay Inc., together with its subsidiaries, operates marketplace platforms that connect buyers and sellers in the United States, the United Kingdom, China, Germany, and internationally. The company's marketplace platform includes its online marketplace at ebay.com, off-platform businesses, and the eBay suite of mobile apps. Its platforms enable users to list, sell, and buy various products. The company was founded in 1995 and is headquartered in San Jose, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"27-02-2025 16:42:14"},{"Company Name":"Salesforce, Inc.","Symbol":"CRM","Current Price":"293.10","Latest MA":"325.18","Latest MA 5":304.8859973145,"Latest MA 9":313.654442003,"Latest MA 20":325.1839993286,"Price Target":386.94916,"Difference from MA":"-9.87%","Difference from Open":"-6.26%","Change from Yesterday":"-4.57%","Change from Last Report":"-0.67","Latest Volume":"2,404,025","Market Cap":"280,161,746,944","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":26.302786,"PB Ratio":4.5894213,"Previous Close":307.33,"ROE":0.10258,"DTE":18.623,"Industry":"Software - Application","Sector":"Technology","Beta":"N\/A","Trailing PEG":1.3791,"Trailing PE":46.029873,"Trailing PS":7.4019446,"Quick Ratio":0.928,"Day High":300.4999,"Day Low":292.75,"VS Average Volume":0.357211898,"Company Summary":"Salesforce, Inc. provides Customer Relationship Management (CRM) technology that brings companies and customers together worldwide. The company's service includes sales to store data, monitor leads and progress, forecast opportunities, gain insights through analytics and artificial intelligence, and deliver quotes, contracts, and invoices; and service that enables companies to deliver trusted and highly personalized customer support at scale. In addition, its platform offering comprise a flexible platform that enables companies of various sizes, locations, and industries to build business workflow and apps with customer; online learning platform that allows anyone to learn in-demand Salesforce skills; and Slack, an intelligent productivity platform. The company's marketing services enables companies to plan, personalize, automate, and optimize customer marketing journey, connecting interaction, and connected products; and commerce services, which empowers shopping experience across various customer touchpoint, such as mobile, web, social, and stores and provides click-to-code tools that offers customers to build and deploy solutions. Further, its analytics offering includes Tableau, an end-to-end analytics solution for range of enterprise use cases and intelligent analytics with AI models, spot trends, predict outcomes, creates summaries, timely recommendations, and take action from any device; and integration service including MuleSoft, which provides building blocks to deliver end-to-end and connected experiences. Additionally, the company provides data cloud, a hyperscale data engine native to Salesforce; vertical services to meet the needs of customers in industries, such as financial services, healthcare and life sciences, manufacturing and automotive and government; and offers salesforce starter for small and medium-sized businesses. Salesforce, Inc. was incorporated in 1999 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 16:42:14"},{"Company Name":"Snowflake Inc.","Symbol":"SNOW","Current Price":"180.16","Latest MA":"182.63","Latest MA 5":171.8729993896,"Latest MA 9":179.0294451226,"Latest MA 20":182.6302485962,"Price Target":203.73714,"Difference from MA":"-1.35%","Difference from Open":"8.53%","Change from Yesterday":"8.14%","Change from Last Report":"-0.13","Latest Volume":"4,378,346","Market Cap":"59,482,099,712","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":193.7742,"PB Ratio":19.91051,"Previous Close":166.19,"ROE":-0.31455,"DTE":89.311,"Industry":"Software - Application","Sector":"Technology","Beta":"N\/A","Trailing PEG":7.2401,"Trailing PE":"N\/A","Trailing PS":16.398441,"Quick Ratio":1.684,"Day High":187.95,"Day Low":179.4,"VS Average Volume":0.8010684215,"Company Summary":"Snowflake Inc. provides a cloud-based data platform for various organizations in the United States and internationally. Its platform offers Data Cloud, which enables customers to consolidate data into a single source of truth to drive meaningful business insights, build data-driven applications, and share data and data products, as well as applies artificial intelligence (AI) for solving business problems. The company was formerly known as Snowflake Computing, Inc. and changed its name to Snowflake Inc. in April 2019. Snowflake Inc. was incorporated in 2012 and is based in Bozeman, Montana.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 16:42:14"},{"Company Name":"Keurig Dr Pepper Inc.","Symbol":"KDP","Current Price":"32.80","Latest MA":"32.35","Latest MA 5":33.9290000305,"Latest MA 9":33.296110967,"Latest MA 20":32.3497500267,"Price Target":37.605,"Difference from MA":"1.41%","Difference from Open":"0.05%","Change from Yesterday":"-2.77%","Change from Last Report":"0.00","Latest Volume":"12,404,636","Market Cap":"44,508,184,576","Earning Date":"2025-02-25","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":16.00244,"PB Ratio":1.8357582,"Previous Close":33.74,"ROE":0.057729997,"DTE":75.609,"Industry":"Beverages - Non-Alcoholic","Sector":"Consumer Defensive","Beta":0.616,"Trailing PEG":2.3958,"Trailing PE":31.242859,"Trailing PS":2.899367,"Quick Ratio":0.276,"Day High":32.98,"Day Low":32.71,"VS Average Volume":1.3119801635,"Company Summary":"Keurig Dr Pepper Inc. owns, manufactures, and distributors beverages and single serve brewing systems in the United States and internationally. It operates through three segments: U.S. Refreshment Beverages, U.S. Coffee, and International. The U.S. Refreshment Beverages segment manufactures and distributes branded concentrates, syrup, and finished beverages. Its U.S. Coffee segment offers finished goods relating to K-Cup pods, single serve brewers, specialty coffee, and ready to drink coffee products through Keurig.com website. The International segment provides sales in Canada, Mexico, the Caribbean, and other international markets from the manufacture and distribution of branded concentrates, syrup, and finished beverages; and sales in Canada from the manufacture and distribution of finished goods relating to the Company's single serve brewers, KCup pods, and other coffee products. It serves retailers, third-party bottlers and distributors, retail partners, hotel chains, office coffee distributors, and end-use consumers. The company offers its products under the Dr Pepper, Canada Dry, Green Mountain Coffee Roasters, Snapple, Mott's, The Original Donut Shop, Clamato, and Core Hydration brand name. Keurig Dr Pepper Inc. was founded in 1981 and is headquartered in Burlington, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"27-02-2025 16:42:14"},{"Company Name":"Hims & Hers Health, Inc.","Symbol":"HIMS","Current Price":"43.50","Latest MA":"47.55","Latest MA 5":45.1680000305,"Latest MA 9":53.328889211,"Latest MA 20":47.5535001755,"Price Target":42.45,"Difference from MA":"-8.52%","Difference from Open":"8.10%","Change from Yesterday":"3.90%","Change from Last Report":"-0.73","Latest Volume":"3,934,219","Market Cap":"9,664,221,184","Earning Date":"2025-02-24","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":94.565216,"PB Ratio":20.148218,"Previous Close":41.89,"ROE":0.30712998,"DTE":2.38,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":1.35,"Trailing PEG":3.9552,"Trailing PE":82.07548,"Trailing PS":6.5452957,"Quick Ratio":1.384,"Day High":44.67,"Day Low":42.6001,"VS Average Volume":0.2152915117,"Company Summary":"Hims & Hers Health, Inc. operates a telehealth platform that connects consumers to licensed healthcare professionals in the United States, the United Kingdom, and internationally. The company offers a range of curated prescription and non-prescription health and wellness products and services available to purchase on its websites and mobile application directly by customers. It also provides prescription medication on a recurring basis and ongoing care from healthcare providers; and over-the-counter drug and device products, cosmetics, and supplement products primarily focusing on general wellness, sexual health and wellness, skincare, and hair care. In addition, the company's curated non-prescription products include melatonin and biotin in the wellness specialty category; moisturizers, creams, sunscreen, serum, face oil, and face wash in the skincare specialty; condoms, climax delay spray and wipes, vibrators, and lubricants in the sexual health and wellness specialty; and shampoos, conditioners, scalp scrubs, and topical treatments, such as minoxidil in the hair care specialty category. Further, it offers medical consultation and post-consultation support services, as well as health and wellness products through wholesale partners. Hims & Hers Health, Inc. is based in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"27-02-2025 16:42:14"}]