[{"Company Name":"CSX Corporation","Symbol":"CSX","Current Price":"32.02","Latest MA":"33.76","Price Target":38.15846,"Difference from MA":"-5.16%","Difference from Open":"0.03%","Change from Yesterday":"0.31%","Change from Last Report":"-0.11","Latest Volume":"3,092,447","Market Cap":"61,748,006,912","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":16.185041,"PB Ratio":4.775541,"ROE":0.29458,"DTE":147.913,"Industry":"Railroads","Sector":"Industrials","Beta":1.191,"Trailing PEG":2.0413,"Trailing PE":17.031916,"Trailing PS":4.205981,"Quick Ratio":1.195,"Day High":32.15,"Day Low":31.92,"VS Average Volume":0.2498254827,"Company Summary":"CSX Corporation, together with its subsidiaries, provides rail-based freight transportation services. The company offers rail services; and transportation of intermodal containers and trailers, as well as other transportation services, such as rail-to-truck transfers and bulk commodity operations. It also transports chemicals, agricultural and food products, minerals, automotive, forest products, fertilizers, and metals and equipment; and coal, coke, and iron ore to electricity-generating power plants, steel manufacturers, and industrial plants, as well as exports coal to deep-water port facilities. In addition, the company provides intermodal services through a network of approximately 30 terminals transporting manufactured consumer goods in containers; and drayage services, including the pickup and delivery of intermodal shipments. It serves the automotive industry with distribution centers and storage locations, as well as connects non-rail served customers through transferring products, such as plastics and ethanol from rail to trucks. The company operates approximately 20,000 route mile rail network, which serves various population centers in 26 states east of the Mississippi River, the District of Columbia, and the Canadian provinces of Ontario and Quebec, as well as owns and leases approximately 3,500 locomotives. It serves production and distribution facilities through track connections. CSX Corporation was incorporated in 1978 and is headquartered in Jacksonville, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"14-01-2025 18:44:49"},{"Company Name":"TAL Education Group","Symbol":"TAL","Current Price":"9.57","Latest MA":"9.92","Price Target":13.85947,"Difference from MA":"-3.50%","Difference from Open":"0.79%","Change from Yesterday":"2.13%","Change from Last Report":"0.00","Latest Volume":"1,210,147","Market Cap":"5,786,009,600","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":21.00702,"PB Ratio":1.5423646,"ROE":0.019609999,"DTE":9.291,"Industry":"Education & Training Services","Sector":"Consumer Defensive","Beta":0.033,"Trailing PEG":0.7584,"Trailing PE":79.791664,"Trailing PS":3.1503627,"Quick Ratio":2.67,"Day High":9.6465,"Day Low":9.445,"VS Average Volume":0.187191645,"Company Summary":"TAL Education Group provides K-12 after-school tutoring services in the People's Republic of China. It provides learning services primarily through small-classes services; personalized premium services; and learning content solutions, such as print books, smart books, mobile apps, and AI-driven learning devices. The company also operates www.xueersi.com, an online education platform; provides investment management and consulting services; develops and sells software and networks, as well as related consulting services; and sells educational materials and products. It offers its services under the Haoweilai and Think Academy brands. TAL Education Group was founded in 2003 and is headquartered in Beijing, the People's Republic of China.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"14-01-2025 18:44:49"},{"Company Name":"Valley National Bancorp","Symbol":"VLY","Current Price":"8.89","Latest MA":"8.58","Price Target":11.05,"Difference from MA":"3.65%","Difference from Open":"0.23%","Change from Yesterday":"1.37%","Change from Last Report":"0.06","Latest Volume":"2,088,849","Market Cap":"4,965,651,968","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":9.866487,"PB Ratio":0.68405664,"ROE":0.049429998,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.086,"Trailing PEG":null,"Trailing PE":14.33871,"Trailing PS":3.1487265,"Quick Ratio":"N\/A","Day High":8.95,"Day Low":8.775,"VS Average Volume":0.2898220567,"Company Summary":"Valley National Bancorp operates as the holding company for Valley National Bank that provides various commercial, private banking, retail, insurance, and wealth management financial services products. It operates through Consumer Banking, Commercial Banking, and Treasury and Corporate other segments. The company offers non-interest bearing, savings, NOW, money market, and time deposit accounts; commercial and industrial, commercial real estate, residential mortgage, and automobile loans; loans secured by the cash surrender value of life insurance; home equity loans and lines of credit; automobile financing; and secured and unsecured other consumer loans. It also invests in various securities and interest-bearing deposits with other banks; and provides international banking services, such as standby and documentary letters of credit, and related products, as well as foreign exchange transactions, documentary collections, and foreign wire transfers services. In addition, the company offers investment services for individuals and small to medium sized businesses; and trusts investment strategies designed for various investment profiles and objectives. Further, it provides trust services, such as living and testamentary trusts, investment management, custodial and escrow services, and estate administration to individuals; tax credit advisory services; brokerage services; property and casualty, life, health, and title insurance agency services; and health care equipment lending and other commercial equipment leasing services, as well as owns real estate related investments. Additionally, the company offers online, mobile, and telephone banking services; receivable, payment, and security solution, merchant, payroll processing, and liquidity services; credit cards; and drive-in and night deposit, automated teller machine, remote deposit capture, and safe deposit facility services. Valley National Bancorp was founded in 1927 and is headquartered in Morristown, New Jersey.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-01-2025 18:44:49"},{"Company Name":"Procter & Gamble Company (The)","Symbol":"PG","Current Price":"159.55","Latest MA":"168.53","Price Target":180.38155,"Difference from MA":"-5.33%","Difference from Open":"0.44%","Change from Yesterday":"0.39%","Change from Last Report":"-0.04","Latest Volume":"1,716,635","Market Cap":"375,746,625,536","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":21.560665,"PB Ratio":7.3606753,"ROE":0.28766,"DTE":69.338,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":0.414,"Trailing PEG":3.3588,"Trailing PE":27.508621,"Trailing PS":4.4782386,"Quick Ratio":0.507,"Day High":159.77,"Day Low":158.31,"VS Average Volume":0.2539981777,"Company Summary":"The Procter & Gamble Company engages in the provision of branded consumer packaged goods worldwide. The company operates through five segments: Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care. The Beauty segment offers conditioners, shampoos, styling aids, and treatments under the Head & Shoulders, Herbal Essences, Pantene, and Rejoice brands; and antiperspirants and deodorants, personal cleansing, and skin care products under the Olay, Old Spice, Safeguard, Secret, SK-II, and Native brands. The Grooming segment provides blades and razors, shave products, appliances, and other grooming products under the Braun, Gillette, and Venus brand names. The Health Care segment offers toothbrushes, toothpastes, and other oral care products under the Crest and Oral-B brand names; and gastrointestinal, pain relief, rapid diagnostics, respiratory, vitamins\/minerals\/supplements, and other personal health care products under Metamucil, Neurobion, Pepto-Bismol, and Vicks brands. The Fabric & Home Care segment provides fabric enhancers, laundry additives, and laundry detergents under the Ariel, Downy, Gain, and Tide brands; and air care, dish care, P&G professional, and surface care products under the Cascade, Dawn, Fairy, Febreze, Mr. Clean, and Swiffer brands. The Baby, Feminine & Family Care segment offers baby wipes, and taped diapers and pants under the Luvs and Pampers brands; adult incontinence and feminine care products under the Always, Always Discreet, and Tampax brands; and paper towels, tissues, and toilet papers under the Bounty, Charmin, and Puffs brands. It sells its products primarily through mass merchandisers, e-commerce, grocery stores, membership club stores, drug stores, department stores, distributors, wholesalers, specialty beauty stores, high-frequency stores, pharmacies, electronics stores, and professional channels, as well as directly to consumers. The company was founded in 1837 and is headquartered in Cincinnati, Ohio.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"14-01-2025 18:44:49"},{"Company Name":"Alcoa Corporation","Symbol":"AA","Current Price":"36.56","Latest MA":"37.79","Price Target":48.43077,"Difference from MA":"-3.25%","Difference from Open":"-0.12%","Change from Yesterday":"-0.01%","Change from Last Report":"0.00","Latest Volume":"1,110,322","Market Cap":"9,444,812,800","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":9.280202,"PB Ratio":1.7990011,"ROE":-0.07142,"DTE":56.095,"Industry":"Aluminum","Sector":"Basic Materials","Beta":2.419,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.85830724,"Quick Ratio":0.671,"Day High":36.715,"Day Low":35.86,"VS Average Volume":0.2497251009,"Company Summary":"Alcoa Corporation, together with its subsidiaries, produces and sells bauxite, alumina, and aluminum products in the United States, Spain, Australia, Iceland, Norway, Brazil, Canada, and internationally. The company operates through two segments, Alumina and Aluminum. It engages in bauxite mining operations; and processes bauxite into alumina and sells it to customers who process it into industrial chemical products, as well as aluminum smelting and casting businesses. The company offers primary aluminum in the form of alloy ingot or value-add ingot to customers that produce products for the transportation, building and construction, packaging, wire, and other industrial markets; and flat-rolled aluminum in the form of sheet, which is sold primarily to customers that produce beverage and food cans. In addition, it owns hydro power plants that generates and sells electricity in the wholesale market to traders, large industrial consumers, distribution companies, and other generation companies. The company was formerly known as Alcoa Upstream Corporation and changed its name to Alcoa Corporation in October 2016. The company was founded in 1886 and is headquartered in Pittsburgh, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"14-01-2025 18:44:49"},{"Company Name":"Lam Research Corporation","Symbol":"LRCX","Current Price":"73.97","Latest MA":"81.69","Price Target":91.94916,"Difference from MA":"-9.45%","Difference from Open":"-1.43%","Change from Yesterday":"-0.70%","Change from Last Report":"-0.42","Latest Volume":"1,935,634","Market Cap":"95,176,466,432","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":17.929602,"PB Ratio":11.281074,"ROE":0.49116,"DTE":58.827,"Industry":"Semiconductor Equipment & Materials","Sector":"Technology","Beta":1.486,"Trailing PEG":1.4311,"Trailing PE":23.938513,"Trailing PS":6.10446,"Quick Ratio":1.685,"Day High":75.13,"Day Low":73.88,"VS Average Volume":0.1576694846,"Company Summary":"Lam Research Corporation designs, manufactures, markets, refurbishes, and services semiconductor processing equipment used in the fabrication of integrated circuits. The company offers ALTUS systems to deposit conformal films for tungsten metallization applications; SABRE electrochemical deposition products for copper interconnect transition that offers copper damascene manufacturing; and VECTOR plasma-enhanced CVD products. It also provides SPEED gapfill high-density plasma chemical vapor deposition products; and Striker single-wafer atomic layer deposition products for dielectric film solutions. In addition, the company offers Flex for dielectric etch applications; Vantex, a dielectric etch system that provides RF technology and repeatable wafer-to-wafer performance enabled by Equipment Intelligence solutions; Kiyo for conductor etch applications; Syndion for through-silicon via etch applications; and Versys metal products for metal etch processes. Further, it provides Coronus bevel clean products to enhance die yield; and Da Vinci, DV-Prime, EOS, and SP series products to address various wafer cleaning applications. The company sells its products in the United States, China, Europe, Japan, Korea, Southeast Asia, and Taiwan. Lam Research Corporation was incorporated in 1980 and is headquartered in Fremont, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"14-01-2025 18:44:49"},{"Company Name":"Johnson & Johnson","Symbol":"JNJ","Current Price":"143.15","Latest MA":"154.05","Price Target":171.61092,"Difference from MA":"-7.08%","Difference from Open":"-0.93%","Change from Yesterday":"-0.94%","Change from Last Report":"-0.13","Latest Volume":"2,480,436","Market Cap":"344,650,809,344","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":13.459399,"PB Ratio":4.911817,"ROE":0.20889,"DTE":50.958,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.518,"Trailing PEG":0.8647,"Trailing PE":23.661156,"Trailing PS":3.930063,"Quick Ratio":0.705,"Day High":144.58,"Day Low":142.92,"VS Average Volume":0.3201999555,"Company Summary":"Johnson & Johnson, together with its subsidiaries, researches, develops, manufactures, and sells various products in the healthcare field worldwide. The company's Innovative Medicine segment offers products for various therapeutic areas, such as immunology, including rheumatoid arthritis, psoriatic arthritis, inflammatory bowel disease, and psoriasis; infectious diseases comprising HIV\/AIDS; neuroscience, consisting of mood disorders, neurodegenerative disorders, and schizophrenia; oncology, such as prostate cancer, hematologic malignancies, lung cancer, and bladder cancer; cardiovascular and metabolism, including thrombosis, diabetes, and macular degeneration; and pulmonary hypertension comprising pulmonary arterial hypertension through retailers, wholesalers, distributors, hospitals, and healthcare professionals for prescription use. Its MedTech segment provides Interventional Solutions, including electrophysiology products to treat heart rhythm disorders; the heart recovery portfolio, which includes technologies to treat severe coronary artery disease requiring high-risk PCI or AMI cardiogenic shock; and neurovascular care that treats hemorrhagic and ischemic stroke. this segment also offers an orthopaedics portfolio that includes products and enabling technologies that support hips, knees, trauma, spine, sports, and other; surgery portfolios comprising advanced and general surgery technologies, as well as solutions for breast aesthetics, ear, nose, and throat procedures; contact lenses under the ACUVUE Brand; and TECNIS intraocular lenses for cataract surgery. It distributes its products to wholesalers, hospitals, and retailers, as well as physicians, nurses, hospitals, eye care professionals, and clinics. The company has a collaboration agreement with Stand Up To Cancer for research testing a combination of teclistamab and daratumumab to treat a rare disease AL amyloidosis. Johnson & Johnson was founded in 1886 and is based in New Brunswick, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"14-01-2025 18:44:49"},{"Company Name":"Las Vegas Sands Corp.","Symbol":"LVS","Current Price":"45.26","Latest MA":"46.17","Price Target":59.80632,"Difference from MA":"-1.97%","Difference from Open":"-1.48%","Change from Yesterday":"-3.76%","Change from Last Report":"-0.10","Latest Volume":"2,140,445","Market Cap":"32,814,673,920","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":16.253738,"PB Ratio":9.576809,"ROE":0.45166,"DTE":384.206,"Industry":"Resorts & Casinos","Sector":"Consumer Cyclical","Beta":1.117,"Trailing PEG":0.7007,"Trailing PE":22.40594,"Trailing PS":2.8995912,"Quick Ratio":0.864,"Day High":46.365,"Day Low":45.02,"VS Average Volume":0.4546111992,"Company Summary":"Las Vegas Sands Corp., together with its subsidiaries, develops, owns, and operates integrated resorts in Macao and Singapore. It owns and operates The Venetian Macao Resort Hotel, the Londoner Macao, The Parisian Macao, The Plaza Macao and Four Seasons Hotel Macao, Cotai Strip, and the Sands Macao in Macao, the People's Republic of China; and Marina Bay Sands in Singapore. The company's integrated resorts feature accommodations, gaming, entertainment and retail malls, convention and exhibition facilities, celebrity chef restaurants, and other amenities. Las Vegas Sands Corp. was founded in 1988 and is based in Las Vegas, Nevada.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"14-01-2025 18:44:49"},{"Company Name":"Kinder Morgan, Inc.","Symbol":"KMI","Current Price":"29.05","Latest MA":"23.24","Price Target":26.61176,"Difference from MA":"25.03%","Difference from Open":"1.66%","Change from Yesterday":"1.88%","Change from Last Report":"0.11","Latest Volume":"4,053,979","Market Cap":"64,549,748,736","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":23.01222,"PB Ratio":2.1229725,"ROE":0.083500005,"DTE":101.433,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.907,"Trailing PEG":2.0883,"Trailing PE":25.712389,"Trailing PS":4.2604284,"Quick Ratio":0.291,"Day High":29.08,"Day Low":28.48,"VS Average Volume":0.3055755388,"Company Summary":"Kinder Morgan, Inc. operates as an energy infrastructure company primarily in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas gasification, liquefaction, and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and\/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, renewable fuel and feedstocks, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; owns interests in\/or operates oil fields and gasoline processing plants; and operates a crude oil pipeline system in West Texas, as well as owns and operates RNG and LNG facilities. It owns and operates approximately 82,000 miles of pipelines and 139 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1997 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-01-2025 18:44:49"},{"Company Name":"Halliburton Company","Symbol":"HAL","Current Price":"27.83","Latest MA":"30.35","Price Target":36.70357,"Difference from MA":"-8.29%","Difference from Open":"0.47%","Change from Yesterday":"0.11%","Change from Last Report":"0.14","Latest Volume":"1,765,623","Market Cap":"24,448,710,656","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":9.100362,"PB Ratio":2.3731558,"ROE":0.26293,"DTE":83.993,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.905,"Trailing PEG":2.2035,"Trailing PE":9.730769,"Trailing PS":1.0596243,"Quick Ratio":1.377,"Day High":28.2,"Day Low":27.59,"VS Average Volume":0.1876511108,"Company Summary":"Halliburton Company provides products and services to the energy industry worldwide. It operates through two segments, Completion and Production, and Drilling and Evaluation. The Completion and Production segment offers production enhancement services that include stimulation and sand control services; cementing services, such as well bonding and casing, and casing equipment; and completion tools that offer downhole solutions and services, including well completion products and services, intelligent well completions, and service tools, as well as liner hanger, sand control, and multilateral systems. This segment also provides electrical submersible pumps, as well as artificial lift services; production solutions comprising coiled tubing, hydraulic workover units, downhole tools, and pumping and nitrogen services; pipeline and process services, such as pre-commissioning, commissioning, maintenance, and decommissioning; and specialty chemicals and services. The Drilling and Evaluation segment offers drilling fluid systems, performance additives, completion fluids, solids control, specialized testing equipment, and waste management services; drilling systems and services; wireline and perforating services consists of open-hole logging, and cased-hole and slickline; and drill bits and services comprising roller cone rock bits, fixed cutter bits, hole enlargement, and related downhole tools and services, as well as coring equipment and services. This segment also provides cloud based digital services and artificial intelligence solutions on an open architecture for subsurface insights, integrated well construction, and reservoir and production management; testing and subsea services, such as acquisition and analysis of reservoir information and optimization solutions; and project management and integrated asset management services. Halliburton Company was founded in 1919 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"14-01-2025 18:44:49"},{"Company Name":"GE Vernova Inc.","Symbol":"GEV","Current Price":"381.92","Latest MA":"250.89","Price Target":366.74707,"Difference from MA":"52.23%","Difference from Open":"1.49%","Change from Yesterday":"4.12%","Change from Last Report":"-0.46","Latest Volume":"1,270,258","Market Cap":"105,278,242,816","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":57.190468,"PB Ratio":11.067348,"ROE":"N\/A","DTE":9.346,"Industry":"Utilities - Renewable","Sector":"Utilities","Beta":"N\/A","Trailing PEG":3.1791,"Trailing PE":90.503105,"Trailing PS":3.0584579,"Quick Ratio":0.717,"Day High":388.8799,"Day Low":373.7,"VS Average Volume":0.4516925786,"Company Summary":"GE Vernova Inc., an energy company, engages in the provision of various products and services that generate, transfer, orchestrate, convert, and store electricity in the United States, Europe, Asia, the Americas, the Middle East, and Africa. The company operates through three segments: Power, Wind, and Electrification. The Power segment designs, manufactures, and services gas, nuclear, hydro, and steam technologies. The Wind segment offers wind generation technologies, including onshore and offshore wind turbines and blades. The Electrification segment provides grid solutions, power conversion, solar, and storage solutions; and electrification software for the transmission, distribution, conversion, storage, and orchestration of electricity from point of generation to point of consumption. The company was incorporated in 2023 and is headquartered in Cambridge, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-01-2025 18:44:49"},{"Company Name":"Amphenol Corporation","Symbol":"APH","Current Price":"69.30","Latest MA":"67.41","Price Target":77.73882,"Difference from MA":"2.80%","Difference from Open":"0.55%","Change from Yesterday":"1.33%","Change from Last Report":"-0.27","Latest Volume":"1,181,415","Market Cap":"83,548,774,400","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":31.89257,"PB Ratio":8.837031,"ROE":0.25293,"DTE":57.565,"Industry":"Electronic Components","Sector":"Technology","Beta":1.238,"Trailing PEG":2.0957,"Trailing PE":39.827587,"Trailing PS":5.870322,"Quick Ratio":1.208,"Day High":70.1,"Day Low":68.69,"VS Average Volume":0.17977227,"Company Summary":"Amphenol Corporation, together with its subsidiaries, primarily designs, manufactures, and markets electrical, electronic, and fiber optic connectors in the United States, China, and internationally. It operates through three segments: Harsh Environment Solutions, Communications Solutions, and Interconnect and Sensor Systems. The company offers connectors and connector systems, including harsh environment data, power, high-speed, fiber optic, and radio frequency interconnect products; busbars and power distribution systems; and other connectors. It also provides value-add products, such as backplane interconnect systems, cable assemblies and harnesses, and cable management products; other products comprising flexible and rigid printed circuit boards, hinges, other mechanical, and production related products. In addition, the company offers consumer device, network infrastructure, and other antennas; coaxial, power, and specialty cables; and sensors and sensor-based products. It sells its products through its sales force, independent representatives, and a network of electronics distributors to original equipment manufacturers, electronic manufacturing services companies, original design manufacturers, and service providers in the automotive, broadband communication, commercial aerospace, industrial, information technology and data communication, military, mobile device, and mobile network markets. Amphenol Corporation was founded in 1932 and is headquartered in Wallingford, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-01-2025 18:44:49"},{"Company Name":"Fifth Third Bancorp","Symbol":"FITB","Current Price":"42.48","Latest MA":"41.56","Price Target":50.54762,"Difference from MA":"2.21%","Difference from Open":"0.78%","Change from Yesterday":"1.70%","Change from Last Report":"-0.11","Latest Volume":"2,323,297","Market Cap":"28,201,705,472","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":11.7404175,"PB Ratio":1.5389074,"ROE":0.119160004,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.231,"Trailing PEG":3.3626,"Trailing PE":14.16,"Trailing PS":3.497669,"Quick Ratio":"N\/A","Day High":42.695,"Day Low":42.01,"VS Average Volume":0.5180746588,"Company Summary":"Fifth Third Bancorp operates as the bank holding company for Fifth Third Bank, National Association that engages in the provision of a range of financial products and services in the United States. It operates through three segments: Commercial Banking, Consumer and Small Business Banking, and Wealth and Asset Management. The Commercial Banking segment offers credit intermediation, cash management, and financial services; lending and depository products; and cash management, foreign exchange and international trade finance, derivatives and capital markets services, asset-based lending, real estate finance, public finance, commercial leasing, and syndicated finance for business, government, and professional customers. The Consumer and Small Banking segment provides a range of deposit and loan products to individuals and small businesses; home equity loans and lines of credit; credit cards; and cash management services. This segment also engages in the residential mortgage that include origination, retention and servicing of residential mortgage loans, sales and securitizations of loans, and hedging activities; indirect lending, including extending loans to consumers through automobile dealers, motorcycle dealers, powersport dealers, recreational vehicle dealers, and marine dealers; and home improvement and solar energy installation loans through contractors and installers. The Wealth & Asset Management segment provides various wealth management services for individuals, companies, and not-for-profit organizations. It offers retail brokerage services to individual clients; and broker dealer services to the institutional marketplace. This segment also provides wealth planning, investment management, banking, insurance, and trust and estate services; and advisory services for institutional clients comprising middle market businesses, non-profits, states, and municipalities. The company was founded in 1858 and is headquartered in Cincinnati, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-01-2025 18:44:49"},{"Company Name":"United Airlines Holdings, Inc.","Symbol":"UAL","Current Price":"106.52","Latest MA":"65.91","Price Target":120.61304,"Difference from MA":"61.63%","Difference from Open":"-0.74%","Change from Yesterday":"1.49%","Change from Last Report":"-0.62","Latest Volume":"1,950,649","Market Cap":"35,032,793,088","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":8.373861,"PB Ratio":3.0628483,"ROE":0.27245,"DTE":291.676,"Industry":"Airlines","Sector":"Industrials","Beta":1.393,"Trailing PEG":0.8317,"Trailing PE":12.6964,"Trailing PS":0.6256526,"Quick Ratio":0.694,"Day High":108.14,"Day Low":105.6,"VS Average Volume":0.3020726595,"Company Summary":"United Airlines Holdings, Inc., through its subsidiaries, provides air transportation services in North America, Asia, Europe, Africa, the Pacific, the Middle East, and Latin America. The company transports people and cargo through its mainline and regional fleets. It also offers catering, ground handling, flight academy, and maintenance services for third parties. The company was formerly known as United Continental Holdings, Inc. and changed its name to United Airlines Holdings, Inc. in June 2019. United Airlines Holdings, Inc. was incorporated in 1968 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"14-01-2025 18:44:49"},{"Company Name":"Capital One Financial Corporati","Symbol":"COF","Current Price":"182.47","Latest MA":"156.46","Price Target":206.58527,"Difference from MA":"16.62%","Difference from Open":"0.01%","Change from Yesterday":"1.04%","Change from Last Report":"-0.12","Latest Volume":"1,091,501","Market Cap":"69,563,039,744","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":11.7851305,"PB Ratio":1.1985917,"ROE":0.07479,"DTE":"N\/A","Industry":"Credit Services","Sector":"Financial Services","Beta":1.432,"Trailing PEG":1.9385,"Trailing PE":17.230406,"Trailing PS":2.6253176,"Quick Ratio":"N\/A","Day High":183.6277,"Day Low":181.38,"VS Average Volume":0.3707435856,"Company Summary":"Capital One Financial Corporation operates as the financial services holding company for the Capital One, National Association, which engages in the provision of various financial products and services in the United States, Canada, and the United Kingdom. It operates through three segments: Credit Card, Consumer Banking, and Commercial Banking. The company accepts checking accounts, money market deposits, negotiable order of withdrawals, savings deposits, and time deposits. Its loan products include credit card loans; auto and retail banking loans; and commercial and multifamily real estate, and commercial and industrial loans. The company also offers credit and debit card products; online direct banking services; and provides advisory, capital markets, treasury management, and depository services. It serves consumers, small businesses, and commercial clients through digital channels, branches, cafés, and other distribution channels located in New York, Louisiana, Texas, Maryland, Virginia, New Jersey, and California. The company was founded in 1988 and is headquartered in McLean, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-01-2025 18:44:49"},{"Company Name":"GE Aerospace","Symbol":"GE","Current Price":"174.58","Latest MA":"172.20","Price Target":209.18353,"Difference from MA":"1.38%","Difference from Open":"0.85%","Change from Yesterday":"1.87%","Change from Last Report":"-0.17","Latest Volume":"1,994,175","Market Cap":"188,946,202,624","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":33.197433,"PB Ratio":10.010896,"ROE":0.22552,"DTE":110.224,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.188,"Trailing PEG":null,"Trailing PE":34.366142,"Trailing PS":2.7010448,"Quick Ratio":0.804,"Day High":176.15,"Day Low":172.395,"VS Average Volume":0.4040104547,"Company Summary":"General Electric Company, doing business as GE Aerospace, designs and produces commercial and defense aircraft engines, integrated engine components, electric power, and mechanical aircraft systems. It also offers aftermarket services to support its products. The company operates in the United States, Europe, China, Asia, the Americas, the Middle East, and Africa. General Electric Company was incorporated in 1892 and is based in Evendale, Ohio.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"14-01-2025 18:44:49"},{"Company Name":"D.R. Horton, Inc.","Symbol":"DHI","Current Price":"141.74","Latest MA":"166.56","Price Target":176.91376,"Difference from MA":"-14.90%","Difference from Open":"-0.53%","Change from Yesterday":"2.37%","Change from Last Report":"-0.01","Latest Volume":"1,263,433","Market Cap":"45,474,304,000","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":9.0055065,"PB Ratio":1.8144113,"ROE":0.19631,"DTE":22.915,"Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":1.744,"Trailing PEG":0.5141,"Trailing PE":9.88424,"Trailing PS":1.2356677,"Quick Ratio":0.766,"Day High":143.55,"Day Low":141.31,"VS Average Volume":0.4309945706,"Company Summary":"D.R. Horton, Inc. operates as a homebuilding company in East, North, Southeast, South Central, Southwest, and Northwest regions in the United States. It engages in the acquisition and development of land; and construction and sale of residential homes in 125 markets across 36 states under the names of D.R. Horton. The company constructs and sells single-family detached homes; and attached homes, such as townhomes, duplexes, and triplexes. It provides mortgage financing services; and title insurance policies, and examination and closing services, as well as engages in the residential lot development business. In addition, the company develops, constructs, owns, leases, and sells multi-family and single-family rental properties; and owns non-residential real estate, including ranch land and improvements. It primarily serves homebuyers. D.R. Horton, Inc. was founded in 1978 and is headquartered in Arlington, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"14-01-2025 18:44:49"},{"Company Name":"Seagate Technology Holdings PLC","Symbol":"STX","Current Price":"90.51","Latest MA":"99.96","Price Target":114.9405,"Difference from MA":"-9.45%","Difference from Open":"1.29%","Change from Yesterday":"1.78%","Change from Last Report":"-0.14","Latest Volume":"1,267,545","Market Cap":"19,145,580,544","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":9.887751,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Computer Hardware","Sector":"Technology","Beta":1.07,"Trailing PEG":0.2821,"Trailing PE":23.387598,"Trailing PS":2.6353173,"Quick Ratio":0.63,"Day High":91.745,"Day Low":89.36,"VS Average Volume":0.5015014837,"Company Summary":"Seagate Technology Holdings plc engages in the provision of data storage technology and infrastructure solutions in Singapore, the United States, the Netherlands, and internationally. The company offers mass capacity storage products, including enterprise nearline hard disk drives (HDDs), enterprise nearline solid state drives (SSDs), enterprise nearline systems, video and image HDDs, and network-attached storage drives. It also offers legacy applications comprising Mission Critical HDDs and SSDs; external storage solutions under the Seagate Ultra Touch, One Touch, Expansion, and Basics product lines, as well as under the LaCie brand name; desktop drives for personal computers and workstation applications; notebook drives traditional notebooks, convertible systems, and external storage applications, DVR HDDs for video streaming applications, and gaming SSDs for gaming rigs. In addition, the company provides Lyve edge-to-cloud mass capacity platform, that includes modular hardware and software to support enterprises' on-premise and cloud storage infrastructure needs. It sells its products primarily to original equipment manufacturers, distributors, and retailers. The company was founded in 1978 and is based in Singapore.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"14-01-2025 18:44:49"},{"Company Name":"KeyCorp","Symbol":"KEY","Current Price":"17.17","Latest MA":"16.40","Price Target":21.215,"Difference from MA":"4.66%","Difference from Open":"0.34%","Change from Yesterday":"0.76%","Change from Last Report":"0.22","Latest Volume":"2,979,742","Market Cap":"18,997,018,624","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":11.089287,"PB Ratio":1.1857241,"ROE":0.0096700005,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.231,"Trailing PEG":0.7055,"Trailing PE":"Infinity","Trailing PS":3.9152968,"Quick Ratio":"N\/A","Day High":17.2395,"Day Low":17.105,"VS Average Volume":0.3087707714,"Company Summary":"KeyCorp operates as the holding company for KeyBank National Association that provides various retail and commercial banking products and services in the United States. It operates in two segments, Consumer Bank and Commercial Bank. The company offers various deposits, investment products and services; commercial leasing, investment management, consumer finance; and personal finance and financial wellness, student loan refinancing, mortgage and home equity, lending, credit card, treasury, business advisory, wealth management, asset management, cash management, portfolio management, and trust and related services to individuals and small and medium-sized businesses. It also provides a suite of banking and capital market products, such as syndicated finance, debt and equity capital market products, commercial payments, equipment finance, commercial mortgage banking, derivatives, foreign exchange, financial advisory, and public finance, as well as commercial mortgage loans to consumer, energy, healthcare, industrial, public sector, real estate, and technology sectors for middle market clients. In addition, the company offers community development financing, securities underwriting, brokerage, and investment banking services. The company was founded in 1849 and is headquartered in Cleveland, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-01-2025 18:44:49"},{"Company Name":"3M Company","Symbol":"MMM","Current Price":"136.16","Latest MA":"124.05","Price Target":145.84889,"Difference from MA":"9.76%","Difference from Open":"1.14%","Change from Yesterday":"1.09%","Change from Last Report":"-0.12","Latest Volume":"1,283,000","Market Cap":"74,147,151,872","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":17.17975,"PB Ratio":15.9737215,"ROE":1.1329399,"DTE":295.441,"Industry":"Conglomerates","Sector":"Industrials","Beta":1.001,"Trailing PEG":null,"Trailing PE":14.168575,"Trailing PS":2.2718046,"Quick Ratio":0.95,"Day High":136.83,"Day Low":134.55,"VS Average Volume":0.3758607739,"Company Summary":"3M Company provides diversified technology services in the United States and internationally. The company's Safety and Industrial segment offers industrial abrasives and finishing for metalworking applications; autobody repair solutions; closure systems for personal hygiene products, masking, and packaging materials; electrical products and materials for construction and maintenance, power distribution, and electrical original equipment manufacturers; structural adhesives and tapes; respiratory, hearing, eye, and fall protection solutions; and natural and color-coated mineral granules for shingles. Its Transportation and Electronics segment provides ceramic solutions; attachment\/bonding products, films, sound, and temperature management for transportation vehicles; premium large format graphic films for advertising and fleet signage; light management films and electronics assembly solutions; packaging and interconnection solutions; semiconductor production materials; data centers solutions; and reflective signage for highway, and vehicle safety. The company's Consumer segment provides consumer bandages, braces, supports, and consumer respirators; home cleaning products; retail abrasives, paint accessories, car care DIY products, picture hanging, and consumer air quality solutions; and stationery products. It offers its products through e-commerce and traditional wholesalers, retailers, jobbers, distributors, and dealers. 3M Company was founded in 1902 and is headquartered in Saint Paul, Minnesota.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-01-2025 18:44:49"},{"Company Name":"Charles Schwab Corporation (The","Symbol":"SCHW","Current Price":"71.52","Latest MA":"70.47","Price Target":85.14286,"Difference from MA":"1.49%","Difference from Open":"-1.70%","Change from Yesterday":"-1.61%","Change from Last Report":"-0.04","Latest Volume":"1,933,235","Market Cap":"130,921,644,032","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":18.007765,"PB Ratio":3.4412737,"ROE":0.12111,"DTE":144.242,"Industry":"Capital Markets","Sector":"Financial Services","Beta":0.952,"Trailing PEG":0.9031,"Trailing PE":27.9375,"Trailing PS":6.9877048,"Quick Ratio":0.481,"Day High":72.97,"Day Low":71.41,"VS Average Volume":0.2429637064,"Company Summary":"The Charles Schwab Corporation, together with its subsidiaries, operates as a savings and loan holding company that provides wealth management, securities brokerage, banking, asset management, custody, and financial advisory services in the United States and internationally. The company operates in two segments, Investor Services and Advisor Services. It offers brokerage accounts with equity and fixed income trading, margin lending, options trading, futures and forex trading, and cash management capabilities, including certificates of deposit; third-party mutual funds through the Mutual Fund Marketplace and Mutual Fund OneSource service, as well as mutual fund trading and clearing services to broker-dealers; exchange-traded funds; advisory solutions for managed portfolios, separately managed accounts, customized personal advice for tailored portfolios, specialized planning, and full-time portfolio management; banking products comprising checking and savings accounts, first lien residential real estate mortgage loans, home equity lines of credit, and pledged asset lines; and trust custody services, personal trust reporting services, and administrative trustee services. It also provides digital retirement calculators; integrated web-, mobile-, and software-based trading platforms, real-time market data, options trading, premium research, and multi-channel access; self-service education and support tools; online research and analysis tools; equity compensation plan sponsors full-service recordkeeping for stock plans, stock options, restricted stock, performance shares, and stock appreciation rights; retirement plan services; mutual fund clearing services; and advisor services, including interactive tools and educational content. The Company operates through branch offices. The Charles Schwab Corporation was founded in 1971 and is headquartered in Westlake, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-01-2025 18:44:49"},{"Company Name":"Citizens Financial Group, Inc.","Symbol":"CFG","Current Price":"45.10","Latest MA":"41.37","Price Target":51.505,"Difference from MA":"9.01%","Difference from Open":"0.87%","Change from Yesterday":"2.02%","Change from Last Report":"-0.09","Latest Volume":"1,406,445","Market Cap":"19,875,614,720","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":11.7515545,"PB Ratio":0.87989694,"ROE":0.05426,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.32,"Trailing PEG":null,"Trailing PE":17.686274,"Trailing PS":2.7934806,"Quick Ratio":"N\/A","Day High":45.41,"Day Low":44.555,"VS Average Volume":0.3358873552,"Company Summary":"Citizens Financial Group, Inc. operates as the bank holding company that provides retail and commercial banking products and services to individuals, small businesses, middle-market companies, corporations, and institutions in the United States. The company operates in two segments, Consumer Banking and Commercial Banking. The Consumer Banking segment offers deposit products, mortgage and home equity lending products, credit cards, business loans, wealth management, and investment services; and auto, education, and point-of-sale finance loans, as well as digital deposit products. This segment serves its customers through telephone service centers, as well as through its online and mobile platforms. The Commercial Banking segment provides various financial products and solutions, including lending and leasing, deposit and treasury management services, foreign exchange, and interest rate and commodity risk management solutions, as well as syndicated loans, corporate finance, mergers and acquisitions, and debt and equity capital markets services. This segment serves corporate banking, healthcare, technology, asset finance, franchise finance, leasing, asset-based lending, commercial real estate, mid-corporate, and private equity sponsor industries. The company was formerly known as RBS Citizens Financial Group, Inc. and changed its name to Citizens Financial Group, Inc. in April 2014. Citizens Financial Group, Inc. was founded in 1828 and is headquartered in Providence, Rhode Island.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-01-2025 18:44:49"},{"Company Name":"Regions Financial Corporation","Symbol":"RF","Current Price":"23.79","Latest MA":"22.64","Price Target":27.57522,"Difference from MA":"5.08%","Difference from Open":"-0.63%","Change from Yesterday":"0.68%","Change from Last Report":"-0.08","Latest Volume":"2,011,182","Market Cap":"21,621,874,688","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":10.574697,"PB Ratio":1.2771783,"ROE":0.10042,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.182,"Trailing PEG":4.5441,"Trailing PE":13.440679,"Trailing PS":3.2980282,"Quick Ratio":"N\/A","Day High":24.035,"Day Low":23.77,"VS Average Volume":0.2490301889,"Company Summary":"Regions Financial Corporation, a financial holding company, provides banking and bank-related services to individual and corporate customers. It operates through three segments: Corporate Bank, Consumer Bank, and Wealth Management. The Corporate Bank segment offers commercial banking services, such as commercial and industrial, commercial real estate, and investor real estate lending; equipment lease financing; deposit products; and securities underwriting and placement, loan syndication and placement, foreign exchange, derivatives, merger and acquisition, and other advisory services. It serves corporate, middle market, and commercial real estate developers and investors. The Consumer Bank segment provides consumer banking products and services related to residential first mortgages, home equity lines and loans, consumer credit cards, and other consumer loans, as well as deposits. The Wealth Management segment offers credit related products, and retirement and savings solutions; and trust and investment management, asset management, and estate planning services to individuals, businesses, governmental institutions, and non-profit entities. It also provides investment and insurance products; low-income housing tax credit corporate fund syndication services; and other specialty financing services. The company was founded in 1971 and is headquartered in Birmingham, Alabama.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-01-2025 18:44:49"}]