[{"Company Name":"Western Digital Corporation","Symbol":"WDC","Current Price":"61.48","Latest MA":"68.52","Price Target":"90.85","Difference from MA":"-10.27%","Difference from Open":"0.30%","Change from Yesterday":"-0.12%","Change from Last Report":"0.21","Latest Volume":"1,102,291","Market Cap":"21,255,856,128","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":6.837098,"ROE":0.033239998,"DTE":"N\/A","Industry":"Computer Hardware","Sector":"Technology","Beta":1.394,"Trailing PEG":null,"Trailing PE":67.56593,"Trailing PS":1.4814508,"Quick Ratio":0.683,"Day High":61.66,"Day Low":61.12,"VS Average Volume":0.2045227677,"Company Summary":"Western Digital Corporation develops, manufactures, and sells data storage devices and solutions in the United States, China, Hong Kong, Europe, the Middle East, Africa, rest of Asia, and internationally. It offers client devices, including hard disk drives (HDDs) and solid state drives (SSDs) for desktop and notebook personal computers (PCs), gaming consoles, and set top boxes; and flash-based embedded storage products for mobile phones, tablets, notebook PCs, and other portable and wearable devices, as well as automotive, Internet of Things, industrial, and connected home applications. The company also provides enterprise HDDs; enterprise SSDs consisting of flash-based SSDs and software solutions for use in enterprise servers, online transactions, artificial intelligence-related workloads, data analysis, and other enterprise applications; and data storage platforms. In addition, it offers external HDD storage products in mobile and desktop form; client portable SSDs; removable cards that are used in consumer devices comprising mobile phones, tablets, imaging systems, and cameras and smart video systems; universal serial bus flash drives for use in the computing and consumer markets; and wireless drive products used in-field backup of created content, as well as wireless streaming of high-definition movies, photos, music, documents to tablets, smartphones, and PCs. The company sells its products under the Western Digital, SanDisk, and WD brands to original equipment manufacturers, distributors, dealers, resellers, and retailers. Western Digital Corporation was founded in 1970 and is headquartered in San Jose, California.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"24-12-2024 19:43:34"},{"Company Name":"Lamb Weston Holdings, Inc.","Symbol":"LW","Current Price":"64.02","Latest MA":"72.75","Price Target":"68.83","Difference from MA":"-12.00%","Difference from Open":"-0.50%","Change from Yesterday":"0.19%","Change from Last Report":"0.15","Latest Volume":"1,142,383","Market Cap":"9,131,875,328","Earning Date":"2024-12-19","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.405457,"ROE":0.37015,"DTE":221.158,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.715,"Trailing PEG":3.391,"Trailing PE":25.204723,"Trailing PS":1.4143913,"Quick Ratio":0.486,"Day High":65.135,"Day Low":63.795,"VS Average Volume":0.4274105807,"Company Summary":"Lamb Weston Holdings, Inc. engages in the production, distribution, and marketing of frozen potato products in the United States, Canada, Mexico, and internationally. It offers frozen potatoes, commercial ingredients, and appetizers under the Lamb Weston brand, as well as under various customer labels. The company also provides its products under its owned or licensed brands, such as Grown in Idaho and Alexia, and other licensed brands, as well as under retailers' own brands. It sells its products through a network of internal sales personnel and independent brokers, agents, and distributors to quick service and full-service restaurants and chains, wholesale, grocery, mass merchants, club retailers, and specialty retailers, as well as foodservice distributors and institutions, including businesses, educational institutions, independent restaurants, regional chain restaurants, and convenience stores. The company was incorporated in 1950 and is headquartered in Eagle, Idaho.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"24-12-2024 19:43:34"}]