[{"Company Name":"Microsoft Corporation","Symbol":"MSFT","Current Price":"479.31","Latest MA":"417.72","Latest MA 5":473.1960026855,"Latest MA 9":469.1633337402,"Latest MA 20":462.0804978638,"RSI":83.9209469126,"Price Target":513.3414,"Difference from MA":"14.75%","Difference from Open":"0.90%","Change from Yesterday":"1.42%","Change from Last Report":"-0.01","Latest Volume":"8,246,391","Market Cap":"3,561,821,831,168","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":32.05485,"PB Ratio":11.067437,"Previous Close":472.62,"ROE":0.3361,"DTE":32.626,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.026,"Trailing PEG":2.2167,"Trailing PE":37.005405,"Trailing PS":37.005405,"Quick Ratio":1.244,"Day High":479.67,"Day Low":473.52,"VS Average Volume":0.3574845018,"Company Summary":"Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services. This segment also provides LinkedIn; and dynamics business solutions, including Dynamics 365, a set of intelligent, cloud-based applications across ERP, CRM, power apps, and power automate; and on-premises ERP and CRM applications. The Intelligent Cloud segment offers server products and cloud services, such as azure and other cloud services; SQL and windows server, visual studio, system center, and related client access licenses, as well as nuance and GitHub; and enterprise services including enterprise support services, industry solutions, and nuance professional services. The More Personal Computing segment offers Windows, including windows OEM licensing and other non-volume licensing of the Windows operating system; Windows commercial comprising volume licensing of the Windows operating system, windows cloud services, and other Windows commercial offerings; patent licensing; and windows Internet of Things; and devices, such as surface, HoloLens, and PC accessories. Additionally, this segment provides gaming, which includes Xbox hardware and content, and first- and third-party content; Xbox game pass and other subscriptions, cloud gaming, advertising, third-party disc royalties, and other cloud services; and search and news advertising, which includes Bing, Microsoft News and Edge, and third-party affiliates. The company sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online, and retail stores. The company was founded in 1975 and is headquartered in Redmond, Washington.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:15:04"},{"Company Name":"NVIDIA Corporation","Symbol":"NVDA","Current Price":"144.28","Latest MA":"128.19","Latest MA 5":143.0850029297,"Latest MA 9":141.7705582682,"Latest MA 20":137.83325177,"RSI":70.562130901,"Price Target":172.11107,"Difference from MA":"12.56%","Difference from Open":"1.62%","Change from Yesterday":"1.02%","Change from Last Report":"-0.02","Latest Volume":"100,927,158","Market Cap":"3,518,764,941,312","Earning Date":"27-08-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":35.020634,"PB Ratio":41.967716,"Previous Close":142.83,"ROE":1.15463,"DTE":12.267,"Industry":"Semiconductors","Sector":"Technology","Beta":2.122,"Trailing PEG":1.7709,"Trailing PE":46.543552,"Trailing PS":46.543552,"Quick Ratio":2.857,"Day High":145.0,"Day Low":141.87,"VS Average Volume":0.387099051,"Company Summary":"NVIDIA Corporation, a computing infrastructure company, provides graphics and compute and networking solutions in the United States, Singapore, Taiwan, China, Hong Kong, and internationally. The Compute & Networking segment comprises Data Center computing platforms and end-to-end networking platforms, including Quantum for InfiniBand and Spectrum for Ethernet; NVIDIA DRIVE automated-driving platform and automotive development agreements; Jetson robotics and other embedded platforms; NVIDIA AI Enterprise and other software; and DGX Cloud software and services. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro\/NVIDIA RTX GPUs for enterprise workstation graphics; virtual GPU or vGPU software for cloud-based visual and virtual computing; automotive platforms for infotainment systems; and Omniverse software for building and operating industrial AI and digital twin applications. It also customized agentic solutions designed in collaboration with NVIDIA to accelerate enterprise AI adoption. The company's products are used in gaming, professional visualization, data center, and automotive markets. It sells its products to original equipment manufacturers, original device manufacturers, system integrators and distributors, independent software vendors, cloud service providers, consumer internet companies, add-in board manufacturers, distributors, automotive manufacturers and tier-1 automotive suppliers, and other ecosystem participants. NVIDIA Corporation was incorporated in 1993 and is headquartered in Santa Clara, California.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:15:04"},{"Company Name":"Apple Inc.","Symbol":"AAPL","Current Price":"199.10","Latest MA":"223.43","Latest MA 5":201.1835784131,"Latest MA 9":201.5931006104,"Latest MA 20":202.6418952747,"RSI":40.4837973451,"Price Target":228.85326,"Difference from MA":"-10.89%","Difference from Open":"0.01%","Change from Yesterday":"0.16%","Change from Last Report":"0.03","Latest Volume":"22,626,663","Market Cap":"2,973,686,300,672","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":23.958832,"PB Ratio":44.530952,"Previous Close":198.78,"ROE":1.38015,"DTE":146.994,"Industry":"Consumer Electronics","Sector":"Technology","Beta":1.211,"Trailing PEG":1.8048,"Trailing PE":31.012135,"Trailing PS":31.012135,"Quick Ratio":0.68,"Day High":199.39,"Day Low":197.3601,"VS Average Volume":0.3671509485,"Company Summary":"Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod. It also provides AppleCare support and cloud services; and operates various platforms, including the App Store that allow customers to discover and download applications and digital content, such as books, music, video, games, and podcasts, as well as advertising services include third-party licensing arrangements and its own advertising platforms. In addition, the company offers various subscription-based services, such as Apple Arcade, a game subscription service; Apple Fitness+, a personalized fitness service; Apple Music, which offers users a curated listening experience with on-demand radio stations; Apple News+, a subscription news and magazine service; Apple TV+, which offers exclusive original content; Apple Card, a co-branded credit card; and Apple Pay, a cashless payment service, as well as licenses its intellectual property. The company serves consumers, and small and mid-sized businesses; and the education, enterprise, and government markets. It distributes third-party applications for its products through the App Store. The company also sells its products through its retail and online stores, and direct sales force; and third-party cellular network carriers, wholesalers, retailers, and resellers. Apple Inc. was founded in 1976 and is headquartered in Cupertino, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:15:04"},{"Company Name":"Amazon.com, Inc.","Symbol":"AMZN","Current Price":"212.63","Latest MA":"208.89","Latest MA 5":214.7990001221,"Latest MA 9":211.27722229,"Latest MA 20":207.4572504883,"RSI":60.1267508903,"Price Target":239.75708,"Difference from MA":"1.79%","Difference from Open":"0.42%","Change from Yesterday":"-0.27%","Change from Last Report":"-0.02","Latest Volume":"13,326,523","Market Cap":"2,257,418,190,848","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":34.574795,"PB Ratio":7.378036,"Previous Close":213.2,"ROE":0.2524,"DTE":51.641,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":1.334,"Trailing PEG":2.3592,"Trailing PE":34.631107,"Trailing PS":34.631107,"Quick Ratio":0.807,"Day High":213.58,"Day Low":211.33,"VS Average Volume":0.2710743823,"Company Summary":"Amazon.com, Inc. engages in the retail sale of consumer products, advertising, and subscriptions service through online and physical stores in North America and internationally. The company operates through three segments: North America, International, and Amazon Web Services (AWS). It also manufactures and sells electronic devices, including Kindle, fire tablets, fire TVs, echo, ring, blink, and eero; and develops and produces media content. In addition, the company offers programs that enable sellers to sell their products in its stores; and programs that allow authors, independent publishers, musicians, filmmakers, Twitch streamers, skill and app developers, and others to publish and sell content. Further, it provides compute, storage, database, analytics, machine learning, and other services, as well as advertising services through programs, such as sponsored ads, display, and video advertising. Additionally, the company offers Amazon Prime, a membership program. The company's products offered through its stores include merchandise and content purchased for resale and products offered by third-party sellers. It serves consumers, sellers, developers, enterprises, content creators, advertisers, and employees. Amazon.com, Inc. was incorporated in 1994 and is headquartered in Seattle, Washington.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:15:04"},{"Company Name":"Alphabet Inc.","Symbol":"GOOG","Current Price":"177.60","Latest MA":"175.91","Latest MA 5":177.7477968262,"Latest MA 9":173.9117619222,"Latest MA 20":171.6889923584,"RSI":64.8875097904,"Price Target":199.625,"Difference from MA":"0.96%","Difference from Open":"0.08%","Change from Yesterday":"-0.67%","Change from Last Report":"-0.01","Latest Volume":"9,041,153","Market Cap":"2,145,573,535,744","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":19.843464,"PB Ratio":6.252385,"Previous Close":178.79,"ROE":0.34789002,"DTE":8.254,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.014,"Trailing PEG":1.3702,"Trailing PE":19.821318,"Trailing PS":19.821318,"Quick Ratio":1.597,"Day High":178.112,"Day Low":176.12,"VS Average Volume":0.3449621103,"Company Summary":"Alphabet Inc. offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube. It is also involved in the sale of apps and in-app purchases and digital content in the Google Play and YouTube; and devices, as well as in the provision of YouTube consumer subscription services. The Google Cloud segment offers AI infrastructure, Vertex AI platform, cybersecurity, data and analytics, and other services; Google Workspace that include cloud-based communication and collaboration tools for enterprises, such as Calendar, Gmail, Docs, Drive, and Meet; and other services for enterprise customers. The Other Bets segment sells healthcare-related and internet services. The company was incorporated in 1998 and is headquartered in Mountain View, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:15:04"},{"Company Name":"Alphabet Inc.","Symbol":"GOOGL","Current Price":"176.20","Latest MA":"174.22","Latest MA 5":176.3419989014,"Latest MA 9":172.4853451199,"Latest MA 20":170.3776101685,"RSI":64.6331078361,"Price Target":201.4652,"Difference from MA":"1.14%","Difference from Open":"0.13%","Change from Yesterday":"-0.65%","Change from Last Report":"-0.02","Latest Volume":"12,011,314","Market Cap":"2,145,957,314,560","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":19.665178,"PB Ratio":6.203133,"Previous Close":177.35,"ROE":0.34789002,"DTE":8.254,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.014,"Trailing PEG":1.3592,"Trailing PE":19.665178,"Trailing PS":19.665178,"Quick Ratio":1.597,"Day High":176.72,"Day Low":174.745,"VS Average Volume":0.2981653024,"Company Summary":"Alphabet Inc. offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube. It is also involved in the sale of apps and in-app purchases and digital content in the Google Play and YouTube; and devices, as well as in the provision of YouTube consumer subscription services. The Google Cloud segment offers AI infrastructure, Vertex AI platform, cybersecurity, data and analytics, and other services; Google Workspace that include cloud-based communication and collaboration tools for enterprises, such as Calendar, Gmail, Docs, Drive, and Meet; and other services for enterprise customers. The Other Bets segment sells healthcare-related and internet services. The company was incorporated in 1998 and is headquartered in Mountain View, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:15:04"},{"Company Name":"Meta Platforms, Inc.","Symbol":"META","Current Price":"691.36","Latest MA":"614.99","Latest MA 5":695.9340117188,"Latest MA 9":687.7766739909,"Latest MA 20":661.4655036621,"RSI":66.4549218703,"Price Target":715.05,"Difference from MA":"12.42%","Difference from Open":"-0.22%","Change from Yesterday":"-0.40%","Change from Last Report":"0.03","Latest Volume":"4,010,610","Market Cap":"1,738,307,272,704","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":27.326483,"PB Ratio":9.427165,"Previous Close":694.14,"ROE":0.39835,"DTE":26.763,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.266,"Trailing PEG":2.2846,"Trailing PE":26.995703,"Trailing PS":26.995703,"Quick Ratio":2.501,"Day High":695.305,"Day Low":687.03,"VS Average Volume":0.2360187793,"Company Summary":"Meta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality and mixed reality headsets, augmented reality, and wearables worldwide. It operates through two segments, Family of Apps (FoA) and Reality Labs (RL). The FoA segment offers Facebook, which enables people to build community through feed, reels, stories, groups, marketplace, and other; Instagram that brings people closer through instagram feed, stories, reels, live, and messaging; Messenger, a messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls; Threads, an application for text-based updates and public conversations; and WhatsApp, a messaging application that is used by people and businesses to communicate and transact in a private way. The RL segment provides virtual, augmented, and mixed reality related products comprising consumer hardware, software, and content that help people feel connected, anytime, and anywhere. The company was formerly known as Facebook, Inc. and changed its name to Meta Platforms, Inc. in October 2021. The company was incorporated in 2004 and is headquartered in Menlo Park, California.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:15:04"},{"Company Name":"Broadcom Inc.","Symbol":"AVGO","Current Price":"255.23","Latest MA":"204.48","Latest MA 5":248.796,"Latest MA 9":252.2833324517,"Latest MA 20":242.1104990234,"RSI":66.9044124199,"Price Target":279.93256,"Difference from MA":"24.82%","Difference from Open":"2.02%","Change from Yesterday":"0.92%","Change from Last Report":"-0.03","Latest Volume":"11,106,928","Market Cap":"1,200,055,255,040","Earning Date":"05-06-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":41.36548,"PB Ratio":4.3097043,"Previous Close":252.91,"ROE":0.18977,"DTE":166.032,"Industry":"Semiconductors","Sector":"Technology","Beta":1.122,"Trailing PEG":1.4936,"Trailing PE":93.48901,"Trailing PS":93.48901,"Quick Ratio":0.73,"Day High":257.89,"Day Low":249.5,"VS Average Volume":0.3986812814,"Company Summary":"Broadcom Inc. designs, develops, and supplies various semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products worldwide. The company operates in two segments, Semiconductor Solutions and Infrastructure Software. It provides Ethernet switching and routing custom silicon solutions, optical and copper physical layer devices, and fiber optic transmitter and receiver components; set-top box system-on-chips (SoCs), data over cable service interface specifications cable modem and networking infrastructure, DSL access multiplexer\/PON optical line termination products, and Wi-Fi access point SoCs, as well as digital subscriber line (DSL)\/cable, passive optical networking (PON) gateways; and fiber optic components and mobile device connectivity solutions. The company also offers RF front end modules and filters; Wi-Fi, Bluetooth, and global positioning system\/global navigation satellite system SoCs; custom touch controllers; inductive charging application specific integrated circuits; serial attached small computer system interface and redundant array of independent disks controllers and adapters, peripheral component interconnect express switches, fiber channel host bus adapters, read channel based SoCs, custom flash controllers, and preamplifiers; and optocouplers, industrial fiber optics, industrial and medical sensors, motion control encoders and subsystems, light emitting diodes, ethernet PHYs, switch ICs, and camera microcontrollers. Its products are used in various applications in enterprise and data center networking, including artificial intelligence networking and connectivity, home connectivity, set-top boxes, broadband access, telecommunication equipment, smartphones and base stations, data center servers and storage systems, factory automation, power generation and alternative energy systems, and electronic displays. Broadcom Inc. was founded in 1961 and is headquartered in Palo Alto, California.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:15:04"},{"Company Name":"Oracle Corporation","Symbol":"ORCL","Current Price":"200.99","Latest MA":"162.82","Latest MA 5":181.2040197559,"Latest MA 9":175.6633456651,"Latest MA 20":167.273005061,"RSI":92.8269460014,"Price Target":204.78146,"Difference from MA":"23.45%","Difference from Open":"5.81%","Change from Yesterday":"13.95%","Change from Last Report":"-0.23","Latest Volume":"41,929,312","Market Cap":"563,622,445,056","Earning Date":"12-06-2025","Earning Time":"Before","Earning Day of Week":"Saturday","PE Ratio":28.071243,"PB Ratio":33.672325,"Previous Close":176.38,"ROE":1.03741,"DTE":632.501,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.324,"Trailing PEG":1.8619,"Trailing PE":47.070282,"Trailing PS":47.070282,"Quick Ratio":0.873,"Day High":202.49,"Day Low":188.88,"VS Average Volume":4.3127350996,"Company Summary":"Oracle Corporation offers products and services that address enterprise information technology environments worldwide. Its Oracle cloud software as a service offering include various cloud software applications, including Oracle Fusion cloud enterprise resource planning (ERP), Oracle Fusion cloud enterprise performance management, Oracle Fusion cloud supply chain and manufacturing management, Oracle Fusion cloud human capital management, Oracle Cerner healthcare, and NetSuite applications suite, as well as Oracle Fusion Sales, Service, and Marketing. The company also offers cloud-based industry solutions for various industries; Oracle application licenses; and Oracle license support services. In addition, it provides cloud and license business' infrastructure technologies, such as the Oracle Database and MySQL Database; Java, a software development language; and middleware, including development tools and others. The company's cloud and license business' infrastructure technologies also comprise cloud-based compute, storage, and networking capabilities; and Oracle autonomous database and MySQL HeatWave, as well as Internet-of-Things, digital assistant, and blockchain. Further, it provides hardware products and other hardware-related software offerings, including Oracle engineered systems, enterprise servers, storage solutions, industry-specific hardware, virtualization software, operating systems, management software, and related hardware services, as well as hardware support products; and consulting and customer services. The company markets and sells its cloud, license, hardware, support, and services offerings directly to businesses in various industries, government agencies, and educational institutions, as well as through indirect channels. Oracle Corporation was founded in 1977 and is headquartered in Austin, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:15:04"},{"Company Name":"Chevron Corporation","Symbol":"CVX","Current Price":"144.91","Latest MA":"147.97","Latest MA 5":142.8020012207,"Latest MA 9":140.6299993896,"Latest MA 20":138.9109037476,"RSI":74.7532655021,"Price Target":163.4874,"Difference from MA":"-2.07%","Difference from Open":"0.28%","Change from Yesterday":"0.08%","Change from Last Report":"0.00","Latest Volume":"3,767,674","Market Cap":"251,017,461,760","Earning Date":"02-05-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.125906,"PB Ratio":1.6956868,"Previous Close":144.78,"ROE":0.10079,"DTE":19.777,"Industry":"Oil & Gas Integrated","Sector":"Energy","Beta":0.801,"Trailing PEG":3.9281,"Trailing PE":16.580091,"Trailing PS":16.580091,"Quick Ratio":0.676,"Day High":145.2,"Day Low":143.43,"VS Average Volume":0.3890251547,"Company Summary":"Chevron Corporation, through its subsidiaries, engages in the integrated energy and chemicals operations in the United States and internationally. The company operates in two segments, Upstream and Downstream. The Upstream segment engages in the exploration, development, production, and transportation of crude oil and natural gas; liquefaction, transportation, and regasification of liquefied natural gas; transporting crude oil through pipelines; processing, transporting, storage, and marketing of natural gas; and carbon capture and storage, as well as a gas-to-liquids plant. The Downstream segment refines crude oil into petroleum products; markets crude oil, refined products, and lubricants; manufactures and markets renewable fuels; transports crude oil and refined products through pipeline, marine vessel, motor equipment, and rail car; and manufactures and markets commodity petrochemicals, plastics for industrial uses, and fuel and lubricant additives. The company was formerly known as ChevronTexaco Corporation and changed its name to Chevron Corporation in 2005. Chevron Corporation was founded in 1879 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:15:04"},{"Company Name":"ServiceNow, Inc.","Symbol":"NOW","Current Price":"1015.00","Latest MA":"979.86","Latest MA 5":1017.2379882812,"Latest MA 9":1015.502210829,"Latest MA 20":1018.6190032959,"RSI":51.6619600144,"Price Target":1085.3595,"Difference from MA":"3.59%","Difference from Open":"1.24%","Change from Yesterday":"1.06%","Change from Last Report":"0.03","Latest Volume":"331,692","Market Cap":"210,259,279,872","Earning Date":"23-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":60.77844,"PB Ratio":20.720205,"Previous Close":1004.33,"ROE":0.16858,"DTE":23.661,"Industry":"Software - Application","Sector":"Technology","Beta":0.956,"Trailing PEG":2.2379,"Trailing PE":138.47203,"Trailing PS":138.47203,"Quick Ratio":0.963,"Day High":1016.04,"Day Low":1004.075,"VS Average Volume":0.1901746645,"Company Summary":"ServiceNow, Inc. provides cloud-based solution for digital workflows in the North America, Europe, the Middle East and Africa, Asia Pacific, and internationally. The company operates the Now platform, an AI platform for digital transformation machine learning, robotic process automation, process mining, analytics, and low-code\/no-code development tools. It also provides asset management, integrated risk management, IT service management, Operational Technology management, Security Operations, strategic portfolio management, IT operations management products; customer service management product; and field service management applications. In addition, the company offers human resources, legal, and workplace service delivery products; app engine product; automation engine; platform privacy and security product; and source-to-pay operations. Further, ServiceNow, Inc. develops and operates a mobile-enabled manufacturing application. It serves government, financial services, healthcare and life science, manufacturing, Public Sector, retail, IT services, technology, and Telecom sectors through service providers and resale partners. The company was formerly known as Service-now.com and changed its name to ServiceNow, Inc. in May 2012. ServiceNow, Inc. was founded in 2004 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:15:04"},{"Company Name":"Amphenol Corporation","Symbol":"APH","Current Price":"94.47","Latest MA":"72.78","Latest MA 5":93.2699994507,"Latest MA 9":92.535555386,"Latest MA 20":89.5090003357,"RSI":84.5145124678,"Price Target":92.07706,"Difference from MA":"29.79%","Difference from Open":"1.88%","Change from Yesterday":"1.50%","Change from Last Report":"0.01","Latest Volume":"2,215,457","Market Cap":"114,270,912,512","Earning Date":"23-07-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":43.73611,"PB Ratio":11.090632,"Previous Close":93.07,"ROE":0.27526,"DTE":69.096,"Industry":"Electronic Components","Sector":"Technology","Beta":1.131,"Trailing PEG":2.3458,"Trailing PE":45.859226,"Trailing PS":45.859226,"Quick Ratio":1.218,"Day High":94.71,"Day Low":92.34,"VS Average Volume":0.2607694396,"Company Summary":"Amphenol Corporation, together with its subsidiaries, designs, manufactures, and markets electrical, electronic, and fiber optic connectors in the United States, China, and internationally. It operates through three segments: Harsh Environment Solutions, Communications Solutions, and Interconnect and Sensor Systems. The company offers connectors and connector systems, including harsh environment data, power, high-speed, fiber optic, and radio frequency interconnect products; busbars and power distribution systems; and power interconnect products. It also provides value-add products, such as backplane interconnect systems, cable assemblies and harnesses, and cable management products; other products comprising flexible and rigid printed circuit boards, hinges, other mechanical, and production related products. In addition, the company offers consumer device, network infrastructure, and other antennas; coaxial, power, and specialty cables; and sensors and sensor-based products. It sells its products through its sales force, independent representatives, and a network of electronics distributors to original equipment manufacturers, electronic manufacturing services companies, original design manufacturers, and service providers in the automotive, broadband communication, commercial aerospace, industrial, information technology and data communication, military, mobile device, and mobile network markets. Amphenol Corporation was founded in 1932 and is headquartered in Wallingford, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:15:04"},{"Company Name":"Trane Technologies plc","Symbol":"TT","Current Price":"425.44","Latest MA":"379.77","Latest MA 5":425.3559931641,"Latest MA 9":428.1477726237,"Latest MA 20":428.4779967041,"RSI":49.0017255011,"Price Target":413.84906,"Difference from MA":"12.02%","Difference from Open":"0.20%","Change from Yesterday":"0.59%","Change from Last Report":"0.02","Latest Volume":"629,000","Market Cap":"94,880,776,192","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":33.631622,"PB Ratio":12.693261,"Previous Close":422.96,"ROE":0.38632,"DTE":63.469,"Industry":"Building Products & Equipment","Sector":"Industrials","Beta":1.172,"Trailing PEG":3.2504,"Trailing PE":35.04448,"Trailing PS":35.04448,"Quick Ratio":0.7,"Day High":425.97,"Day Low":422.04,"VS Average Volume":0.4211975537,"Company Summary":"Trane Technologies plc designs, manufactures, sells, and services of solutions for heating, ventilation, air conditioning, and custom and transport refrigeration. It offers air conditioners, exchangers, and handlers; airside and terminal devices; air sourced heat pumps; chillers; coils and condensers; auxiliary power, cold storage, cold storage, and condensing units; controls contracting and commissioning, decarbonization programs, and gensets; dehumidifiers; energy and water efficiency programs; energy recovery ventilators; energy storage; furnaces; home automation; humidifiers; HVAC performance-monitoring products; and indoor air quality assessments and related products for HVAC and transport solutions. The company also provides asset management, building management, bus air purification, bus and rail HVAC, container refrigeration, control, cryogenic refrigeration, ductless, geothermal, data center and multi-pipe HVAC, package heating and cooling, rail refrigeration, residential air filtration, self-powered truck refrigeration, temporary heating and cooling, truck refrigeration, unitary, variable refrigerant flow, and trailer refrigeration systems. In addition, it offers industrial process refrigeration, installation contracting, lighting retrofit, medical grade refrigeration, refrigerant reclamation, renewable energy and storage, residential hybrid heating, telematics, thermostats\/controls and associated digital, and ventilation solutions; packaged rooftop units; rate chambers; residential air filters; thermal energy storage; transport heater products; ultra-low temperature freezers; energy infrastructure programs and management, repair and maintenance, smart and AI-enabled, and rental services; and water source heat pumps, as well as aftermarket and OEM parts and supplies. The company was formerly known as Ingersoll-Rand Plc and changed its name to Trane Technologies plc in March 2020. The company was founded in 1885 and is headquartered in Swords, Ireland.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"12-06-2025 20:15:04"},{"Company Name":"DoorDash, Inc.","Symbol":"DASH","Current Price":"217.00","Latest MA":"186.41","Latest MA 5":217.1420013428,"Latest MA 9":216.4744432237,"Latest MA 20":209.5614982605,"RSI":62.3557719447,"Price Target":217.46594,"Difference from MA":"16.41%","Difference from Open":"-0.71%","Change from Yesterday":"-0.37%","Change from Last Report":"-0.06","Latest Volume":"1,003,033","Market Cap":"91,952,447,488","Earning Date":"06-05-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":121.91012,"PB Ratio":10.957936,"Previous Close":217.8,"ROE":0.04336,"DTE":6.278,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":1.669,"Trailing PEG":1.1075,"Trailing PE":278.20514,"Trailing PS":278.20514,"Quick Ratio":1.442,"Day High":219.42,"Day Low":216.86,"VS Average Volume":0.173184617,"Company Summary":"DoorDash, Inc., together with its subsidiaries, operates a commerce platform that connects merchants, consumers, and independent contractors in the United States and internationally. The company operates DoorDash Marketplace and Wolt Marketplace, which provide various services, such as customer acquisition, demand generation, order fulfillment, merchandising, payment processing, and customer support. It also offers membership programs, including DashPass and Wolt+; and DoorDash Drive On-Demand and Wolt Drive, which are white-label delivery fulfillment services, as well as provides services that help merchants establish online ordering, build branded mobile apps, enable tableside order and pay, and enhance customer support. The company was formerly known as Palo Alto Delivery Inc. and changed its name to DoorDash, Inc. in 2015. DoorDash, Inc. was founded in 2013 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:15:04"},{"Company Name":"Mondelez International, Inc.","Symbol":"MDLZ","Current Price":"67.52","Latest MA":"63.32","Latest MA 5":66.9119986572,"Latest MA 9":66.9011107042,"Latest MA 20":66.4765001068,"RSI":62.8619983751,"Price Target":72.70815,"Difference from MA":"6.63%","Difference from Open":"0.85%","Change from Yesterday":"0.85%","Change from Last Report":"0.07","Latest Volume":"2,524,184","Market Cap":"87,426,236,416","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":19.68513,"PB Ratio":3.3905795,"Previous Close":66.95,"ROE":0.13302,"DTE":78.051,"Industry":"Confectioners","Sector":"Consumer Defensive","Beta":0.499,"Trailing PEG":4.0807,"Trailing PE":25.10037,"Trailing PS":25.10037,"Quick Ratio":0.325,"Day High":67.73,"Day Low":66.5,"VS Average Volume":0.3023958089,"Company Summary":"Mondelez International, Inc., through its subsidiaries, manufactures, markets, and sells snack food and beverage products in the Latin America, North America, Asia, the Middle East, Africa, and Europe. It provides biscuits and baked snacks, including cookies, crackers, salted snacks, snack bars, and cakes and pastries; chocolates; and gums and candies, as well as various cheese and grocery, and powdered beverage products. The company's brand portfolio includes Oreo, Ritz, LU, CLIF Bar, and Tate's Bake Shop biscuits and baked snacks, as well as Cadbury Dairy Milk, Milka, and Toblerone chocolate. It serves to supermarket chains, wholesalers, supercenters, club stores, mass merchandisers, distributors, convenience stores, gasoline stations, drug stores, value stores, and other retail food outlets through direct store delivery, company-owned and satellite warehouses, distribution centers, third party distributors, and other facilities, as well as through independent sales offices and agents. The company also sells products directly to businesses and consumers through e-retail platforms, retailer digital platforms, as well as through its direct-to-consumer websites and social media platforms. Mondelez International, Inc. was formerly known as Kraft Foods Inc. and changed its name to Mondelez International, Inc. in October 2012. The company was incorporated in 2000 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:15:04"},{"Company Name":"Fortinet, Inc.","Symbol":"FTNT","Current Price":"102.69","Latest MA":"99.34","Latest MA 5":102.6729996338,"Latest MA 9":102.6483332655,"Latest MA 20":103.1607498322,"RSI":49.6924314734,"Price Target":108.51,"Difference from MA":"3.38%","Difference from Open":"0.84%","Change from Yesterday":"0.66%","Change from Last Report":"-0.07","Latest Volume":"1,042,355","Market Cap":"78,604,394,496","Earning Date":"07-05-2025","Earning Time":"Before","Earning Day of Week":"Saturday","PE Ratio":42.61203,"PB Ratio":40.240986,"Previous Close":102.02,"ROE":2.05906,"DTE":54.842,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.072,"Trailing PEG":2.8485,"Trailing PE":42.261314,"Trailing PS":42.261314,"Quick Ratio":1.259,"Day High":102.79,"Day Low":101.7,"VS Average Volume":0.2024657052,"Company Summary":"Fortinet, Inc. provides cybersecurity and convergence of networking and security solutions worldwide. The company offers secure networking solutions that focus on the convergence of networking and security; network firewall solutions, which consist of FortiGate data centers, hyperscale, and distributed firewalls, as well as encrypted applications; wireless local area network (LAN) solutions; and secure connectivity solutions, including FortiSwitch secure ethernet switches, FortiAP wireless LAN access points, and FortiExtender 5G connectivity gateways. It also provides the Fortinet Unified Secure Access Service Edge (SASE) solutions that include firewall, software-defined wide-area network, secure web gateway, cloud access services broker, data loss prevention, and zero trust network access; and web application firewalls, cloud network security with virtualized firewalls, cloud-native firewalls, cloud-native application protection, and code security. In addition the company offers artificial intelligence-driven security operation solutions, which provides a suite of cybersecurity solutions that identify, protect, detect, respond, and recover from threats, as well as FortiEDR, FortiXDR, FortiNDR, FortiSandbox, FortiDeceptor, FortiDLP, and FortiRecon that helps organizations ensuring attackers face multiple layers of detection and mitigation across endpoints, networks, and applications. Further, it offers FortiGuard application security, content security, device security, NOC\/SOC security, and web security services; FortiCare technical support services; and training and certification programs, as well as operates FortiGuard Lab, a cybersecurity threat intelligence and research organization. The company serves large enterprises, communication service providers, government organizations, and small to medium-sized enterprises. Fortinet, Inc. was incorporated in 2000 and is headquartered in Sunnyvale, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"12-06-2025 20:15:04"},{"Company Name":"Zoetis Inc.","Symbol":"ZTS","Current Price":"168.64","Latest MA":"164.89","Latest MA 5":167.3680024414,"Latest MA 9":168.1955567084,"Latest MA 20":165.9080002136,"RSI":57.9302425559,"Price Target":195.372,"Difference from MA":"2.27%","Difference from Open":"1.29%","Change from Yesterday":"1.39%","Change from Last Report":"0.06","Latest Volume":"1,083,993","Market Cap":"75,079,876,608","Earning Date":"06-05-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":26.59937,"PB Ratio":16.159449,"Previous Close":166.33,"ROE":0.52085996,"DTE":145.628,"Industry":"Drug Manufacturers - Specialty & Generic","Sector":"Healthcare","Beta":0.944,"Trailing PEG":2.8315,"Trailing PE":30.27648,"Trailing PS":30.27648,"Quick Ratio":0.916,"Day High":168.73,"Day Low":165.52,"VS Average Volume":0.3784525728,"Company Summary":"Zoetis Inc. engages in the discovery, development, manufacture, and commercialization of animal health medicines, vaccines, diagnostic products and services, biodevices, genetic tests, and precision animal health products in the United States and internationally. The company commercializes products primarily across species, including livestock, such as cattle, swine, poultry, fish, and sheep; and companion animals comprising dogs, cats, and horses. It also offers parasiticides, vaccines, dermatology, anti-infectives, pain and sedation, other pharmaceutical, and animal health diagnostics. In addition, the company provides animal health diagnostics, including point-of-care diagnostic products, instruments and reagents, rapid immunoassay tests, reference laboratory kits and services, and blood glucose monitors; and other non-pharmaceutical products, which include nutritionals, as well as products and services in biodevices, genetic tests, and precision animal health. It markets its products to veterinarians, livestock producers, and pet owners. The company has collaboration Blacksmith Medicines, Inc. to discover and develop novel antibiotics for animal health. Zoetis Inc. was founded in 1950 and is headquartered in Parsippany, New Jersey.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:15:04"},{"Company Name":"Northrop Grumman Corporation","Symbol":"NOC","Current Price":"494.04","Latest MA":"481.30","Latest MA 5":490.4139936523,"Latest MA 9":489.2311086697,"Latest MA 20":480.0660472412,"RSI":70.3547067128,"Price Target":545.2713,"Difference from MA":"2.65%","Difference from Open":"1.07%","Change from Yesterday":"1.14%","Change from Last Report":"0.03","Latest Volume":"309,961","Market Cap":"71,106,191,360","Earning Date":"22-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":17.606558,"PB Ratio":4.750202,"Previous Close":488.46,"ROE":0.25412,"DTE":120.969,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":0.144,"Trailing PEG":3.1639,"Trailing PE":19.488758,"Trailing PS":19.488758,"Quick Ratio":0.741,"Day High":495.39,"Day Low":487.945,"VS Average Volume":0.2804211551,"Company Summary":"Northrop Grumman Corporation operates as an aerospace and defense technology company in the United States, the Asia\/Pacific, Europe, and internationally. The company's Aeronautics Systems segment designs, develops, manufactures, integrates, sustains, and modernizes aircraft systems. This segment also offers unmanned autonomous aircraft systems, including high-altitude long-endurance strategic, and surveillance and reconnaissance systems; and strategic long-range strike aircraft, tactical fighter and air dominance aircraft, and airborne battle management and command and control systems. Its Defense Systems segment designs, develops, integrates, and produces strategic deterrent systems, tactical weapons, and missile defense solutions; and provides sustainment, modernization, and training services for manned and unmanned aircraft and electronics systems. This segment also offers strategic missiles; integrated all-domain command and control systems; precision strike weapons; tactical solid rocket motors, and high speed air-breathing and hypersonic systems; high-performance gun systems, ammunition, precision munitions, and advanced fuzes; and aircraft and mission systems logistics support, sustainment, operation, and modernization. The company's Mission Systems segment provides command, control, communication and computer, intelligence, surveillance, and reconnaissance systems; radar, electro-optical\/infrared, and acoustic sensors; electronic warfare systems; advanced communications and network systems; microelectronics; navigation and positioning sensors; maritime power, propulsion, and payload launch systems; cyber solutions; and intelligence processing systems. Its Space Systems segment offers satellites, spacecraft systems, subsystems, sensors, and payloads; ground systems; missile defense systems and interceptors; and launch vehicles and related propulsion systems. Northrop Grumman Corporation was founded in 1939 and is based in Falls Church, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:15:04"},{"Company Name":"Autodesk, Inc.","Symbol":"ADSK","Current Price":"299.13","Latest MA":"287.96","Latest MA 5":297.701994873,"Latest MA 9":297.7633288574,"Latest MA 20":297.0729962769,"RSI":62.6905699891,"Price Target":336.86932,"Difference from MA":"3.88%","Difference from Open":"0.74%","Change from Yesterday":"0.80%","Change from Last Report":"-0.02","Latest Volume":"357,082","Market Cap":"63,997,366,272","Earning Date":"22-05-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":32.58497,"PB Ratio":24.460709,"Previous Close":296.77,"ROE":0.42361,"DTE":97.211,"Industry":"Software - Application","Sector":"Technology","Beta":1.449,"Trailing PEG":1.7601,"Trailing PE":64.19099,"Trailing PS":64.19099,"Quick Ratio":0.515,"Day High":299.67,"Day Low":296.11,"VS Average Volume":0.2344249865,"Company Summary":"Autodesk, Inc. provides 3D design, engineering, and entertainment technology solutions worldwide. It offers AutoCAD Civil 3D, a surveying, design, analysis, and documentation solution; Autodesk Build, a toolset for managing, sharing, and accessing project documents for streamlined workflows between the office, trailer, and jobsite; Revit, a software built for building information modeling to help professionals design, build, and maintain energy-efficient buildings; Autodesk BIM Collaborate Pro, cloud-based design collaboration and design management software; BuildingConnected, a SaaS preconstruction solution; and Tandem, a cloud-based platform that transforms the built asset lifecycle. The company also provides AutoCAD software, a customizable and extensible CAD application for professional design, drafting, detailing, and visualization; AutoCAD LT, a drafting and detailing software; Fusion, a 3D CAD, computer-aided manufacturing, and computer-aided engineering tool; Inventor, a software solution that offers a set of tools for 3D mechanical design, simulation, analysis, tooling, visualization, and documentation; product design and manufacturing collection tools; and Vault, a data management software for managing data in one central location, accelerate design processes, and streamline internal\/external collaboration. It offers Flow Production Tracking, a cloud-based production management software; Maya software, which provides 3D modeling, animation, effects, rendering, and compositing solutions for film and video artists, game developers, and design visualization professionals; Media and Entertainment Collection that offers end-to-end creative tools for entertainment creation; and 3ds Max software, which provides 3D modeling, animation, and rendering solutions. The company sells its products and services to customers directly, as well as through a network of resellers and distributors. Autodesk, Inc. was incorporated in 1982 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:15:04"},{"Company Name":"AFLAC Incorporated","Symbol":"AFL","Current Price":"102.00","Latest MA":"105.35","Latest MA 5":102.3609995117,"Latest MA 9":102.7461112467,"Latest MA 20":103.365154129,"RSI":41.7616506561,"Price Target":105.61538,"Difference from MA":"-3.18%","Difference from Open":"1.46%","Change from Yesterday":"0.64%","Change from Last Report":"0.00","Latest Volume":"761,533","Market Cap":"55,143,088,128","Earning Date":"05-08-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":14.2252445,"PB Ratio":2.1008239,"Previous Close":101.35,"ROE":0.14408,"DTE":42.513,"Industry":"Insurance - Life","Sector":"Financial Services","Beta":0.807,"Trailing PEG":null,"Trailing PE":15.862365,"Trailing PS":15.862365,"Quick Ratio":1.235,"Day High":102.0041,"Day Low":100.215,"VS Average Volume":0.3673175357,"Company Summary":"Aflac Incorporated, through its subsidiaries, provides supplemental health and life insurance products. The company operates in two segments, Aflac Japan and Aflac U.S. The Aflac Japan segment offers cancer, medical, nursing care, whole life, and GIFT insurance products, as well as WAYS and child endowment, and Tsumitasu insurance products in Japan. The Aflac U.S. segment provides accident, disability, cancer, critical illness, hospital indemnity, dental, vision, and life insurance products in the United States. The company sells its products through individual, independent corporate, and affiliated corporate agencies; banks; independent associates\/career agents; and brokers. Aflac Incorporated was founded in 1955 and is based in Columbus, Georgia.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:15:04"},{"Company Name":"MetLife, Inc.","Symbol":"MET","Current Price":"78.75","Latest MA":"80.28","Latest MA 5":79.3290014038,"Latest MA 9":79.1127780151,"Latest MA 20":79.0867505493,"RSI":47.2703343632,"Price Target":92.71429,"Difference from MA":"-1.90%","Difference from Open":"0.86%","Change from Yesterday":"-0.20%","Change from Last Report":"0.01","Latest Volume":"774,822","Market Cap":"52,868,071,424","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.127451,"PB Ratio":1.9286623,"Previous Close":78.91,"ROE":0.15982,"DTE":172.754,"Industry":"Insurance - Life","Sector":"Financial Services","Beta":0.839,"Trailing PEG":1.0914,"Trailing PE":12.8684635,"Trailing PS":12.8684635,"Quick Ratio":1.338,"Day High":78.755,"Day Low":77.73,"VS Average Volume":0.222381034,"Company Summary":"MetLife, Inc., a financial services company, provides insurance, annuities, employee benefits, and asset management services worldwide. It operates in six segments: Group Benefits; Retirement and Income Solutions; Asia; Latin America; Europe, the Middle East and Africa; and MetLife Holdings. The company offers life, dental, group short-and long-term disability, paid family and medical leave, individual disability, accidental death and dismemberment, accident and health, vision, and pet insurance, as well as prepaid legal plans; administrative services-only arrangements to employers; and general and separate account, and synthetic guaranteed interest contracts, as well as private floating rate funding agreements. It also provides pension risk transfers, institutional income annuities, structured settlements, and capital markets investment products; and other products and services, such as life insurance products and funding agreements for funding postretirement benefits, as well as company, bank, or trust-owned life insurance used to finance nonqualified benefit programs for executives. In addition, it offers fixed, indexed-linked, and variable annuities; pension products; regular savings products; whole and term life, endowments, universal and variable life, and group life products; longevity and funded reinsurance solutions; credit insurance products; accident & health products covering hospitalization, cancer, critical illness, income protection, and scheduled medical reimbursement plans; and protection against long-term health care services. MetLife, Inc. was incorporated in 1999 and is based in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:15:04"},{"Company Name":"Truist Financial Corporation","Symbol":"TFC","Current Price":"39.79","Latest MA":"42.17","Latest MA 5":40.3773996948,"Latest MA 9":39.9863329264,"Latest MA 20":40.0448498398,"RSI":46.4976374911,"Price Target":45.2155,"Difference from MA":"-5.66%","Difference from Open":"-0.53%","Change from Yesterday":"-1.17%","Change from Last Report":"0.01","Latest Volume":"2,809,751","Market Cap":"52,102,664,192","Earning Date":"18-07-2025","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":10.072658,"PB Ratio":0.88719165,"Previous Close":40.26,"ROE":0.0013400001,"DTE":null,"Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.815,"Trailing PEG":null,"Trailing PE":null,"Trailing PS":null,"Quick Ratio":null,"Day High":40.0099,"Day Low":39.495,"VS Average Volume":0.2835581446,"Company Summary":"Truist Financial Corporation, a financial services company, provides banking and trust services in the Southeastern and Mid-Atlantic United States. The company operates through three segments: Consumer Banking and Wealth, Corporate and Commercial Banking, and Insurance Holdings.Its deposit products include noninterest-bearing checking, interest-bearing checking, savings, and money market deposit accounts, as well as certificates of deposit and individual retirement accounts. The company also provides funding; asset management; automobile lending; credit card lending; consumer finance; home equity and mortgage lending; other direct retail lending; insurance; investment brokerage; mobile\/online banking; payment solutions; point-of-sale lending; retail and small business deposit products; small business lending; and wealth management\/private banking services. In addition, it offers asset based lending, investment banking and capital market, institutional trust, insurance premium finance, derivatives, commercial lending, international banking, leasing, merchant, commercial deposit and treasury, floor plan, mortgage warehouse lending, real estate lending, and supply chain financing services. Further, the company provides insurance brokerage, retail and wholesale brokerage, securities underwriting and market making, loan syndication, and investment management and advisory services. The company was formerly known as BB&T Corporation and changed its name to Truist Financial Corporation in December 2019. Truist Financial Corporation was founded in 1872 and is headquartered in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:15:04"},{"Company Name":"Nasdaq, Inc.","Symbol":"NDAQ","Current Price":"86.92","Latest MA":"78.60","Latest MA 5":86.2075005493,"Latest MA 9":85.1908336724,"Latest MA 20":83.4923750153,"RSI":88.9383175623,"Price Target":84.22222,"Difference from MA":"10.58%","Difference from Open":"0.37%","Change from Yesterday":"0.15%","Change from Last Report":"0.03","Latest Volume":"982,383","Market Cap":"49,901,248,512","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":27.680733,"PB Ratio":4.3205996,"Previous Close":86.79,"ROE":0.11415,"DTE":84.587,"Industry":"Financial Data & Stock Exchanges","Sector":"Financial Services","Beta":1.013,"Trailing PEG":1.7527,"Trailing PE":39.329185,"Trailing PS":39.329185,"Quick Ratio":0.212,"Day High":87.07,"Day Low":85.935,"VS Average Volume":0.2745031251,"Company Summary":"Nasdaq, Inc. operates as a technology company that serves capital markets and other industries worldwide. It operates in three segments: Capital Access Platforms, Financial Technology, and Market Services. The company distributes historical and real-time market data; develops and licenses Nasdaq-branded indices and financial products; investor relations intelligence, governance solutions, and sustainability solution products for public and private companies and organizations; and insights and workflow solutions, as well as operates listing platforms. It also offers Verafin, a cloud-based platform to detect, investigate, and report money laundering and financial frauds; AxiomSL, a risk data management and regulatory reporting solution; surveillance solutions, including a SaaS platform to assist in complying with market rules, regulations, and internal market surveillance policies; Calypso, a platform providing cross-asset, front-to-back trading, treasury, risk, and collateral management solutions; and handles assets comprising cash equities, equity derivatives, currencies, various interest-bearing securities, commodities, energy products, and digital currencies; and trade management and colocation services. In addition, the company provides equity derivative trading and clearing, cash equity trading, fixed income and commodities trading and clearing, and currency trading services; and operates various exchanges, including derivatives, commodities, cash equity, debt, structured products, and exchange traded products; and clearing, settlement, and central depository services. The company was formerly known as The NASDAQ OMX Group, Inc. and changed its name to Nasdaq, Inc. in September 2015. Nasdaq, Inc. was founded in 1971 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:15:04"},{"Company Name":"TE Connectivity plc","Symbol":"TEL","Current Price":"165.96","Latest MA":"147.83","Latest MA 5":165.7499986572,"Latest MA 9":163.8822217475,"Latest MA 20":162.2112133484,"RSI":72.5162620283,"Price Target":164.72833,"Difference from MA":"12.27%","Difference from Open":"0.07%","Change from Yesterday":"0.13%","Change from Last Report":"-0.01","Latest Volume":"451,726","Market Cap":"49,214,943,232","Earning Date":"23-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":18.460512,"PB Ratio":4.080549,"Previous Close":165.75,"ROE":0.1122,"DTE":46.476,"Industry":"Electronic Components","Sector":"Technology","Beta":1.222,"Trailing PEG":2.9068,"Trailing PE":36.0,"Trailing PS":36.0,"Quick Ratio":0.958,"Day High":166.25,"Day Low":164.25,"VS Average Volume":0.2282054145,"Company Summary":"TE Connectivity plc, together with its subsidiaries, manufactures and sells connectivity and sensor solutions in Europe, the Middle East, Africa, the Asia\u0096Pacific, and the Americas. The company operates through three segments: Transportation Solutions, Industrial Solutions, and Communications Solutions. It provides antennas, application tooling, cable assemblies, connectors, electromagnetic compatibility\/electromagnetic interference solutions, energy and power, fiber optics, heat shrink tubing, identification and labeling, medical components, passive components, relays and contactors, sensors, switches, terminals and splices, wires and cables, and wire protection and management solutions. The company also offers training and other services, including 3D printing for production, backshells prototyping, electrical installation training, HarnWare software, machine tooling service and repair, medical device design services, and microfluidic devices, as well as conducts automotive webinars. It serves 5G and wireless equipment, aerospace, appliances, automation and control, automotive, autosport, commercial and industrial vehicles, connected home, data centers and artificial intelligence, defense and military, energy solutions, e-mobility, industrial machinery, intelligent buildings, IoT connectivity, medical technologies, oil and gas\/marine, personal electronics and wearable technology, rail, sensor applications, space, and other industries. The company was formerly known as Tyco Electronics Ltd. and changed its name to TE Connectivity plc in March 2011. TE Connectivity plc was founded in 1941 and is based in Ballybrit, Ireland.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:15:04"},{"Company Name":"Xcel Energy Inc.","Symbol":"XEL","Current Price":"68.59","Latest MA":"68.42","Latest MA 5":68.5379996948,"Latest MA 9":68.7577781508,"Latest MA 20":69.7079999847,"RSI":43.0660979843,"Price Target":75.125,"Difference from MA":"0.24%","Difference from Open":"0.09%","Change from Yesterday":"0.50%","Change from Last Report":"0.03","Latest Volume":"815,274","Market Cap":"39,560,036,352","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":17.908615,"PB Ratio":1.9968557,"Previous Close":68.25,"ROE":0.102589995,"DTE":163.558,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.385,"Trailing PEG":2.6887,"Trailing PE":20.173529,"Trailing PS":20.173529,"Quick Ratio":0.516,"Day High":68.82,"Day Low":68.19,"VS Average Volume":0.2118885399,"Company Summary":"Xcel Energy Inc., through its subsidiaries, engages in the generation, purchasing, transmission, distribution, and sale of electricity in the United States. It operates through Regulated Electric Utility and Regulated Natural Gas Utility segments. The company generates electricity through wind, nuclear, hydroelectric, biomass, and solar energy sources, as well as coal, natural gas, oil, wood, and refuse-derived fuels. It also purchases, transports, distributes, and sells natural gas to retail customers, as well as transports customer-owned natural gas. In addition, the company develops and leases natural gas pipelines, and storage and compression facilities; and invests in rental housing projects and nonregulated assets, as well as procures equipment for the construction of renewable generation facilities. It serves residential, commercial, and industrial customers in the portions of Colorado, Michigan, Minnesota, New Mexico, North Dakota, South Dakota, Texas, and Wisconsin. Xcel Energy Inc. was formerly known as Northern States Power company. The company was incorporated in 1909 and is headquartered in Minneapolis, Minnesota.","Stock Sentiment":"N\/A","Row Color":"positive-row","Last Updated":"12-06-2025 20:15:04"},{"Company Name":"Consolidated Edison, Inc.","Symbol":"ED","Current Price":"102.99","Latest MA":"99.18","Latest MA 5":102.1320011597,"Latest MA 9":102.4711111111,"Latest MA 20":103.3159997101,"RSI":50.3919068936,"Price Target":105.6,"Difference from MA":"3.84%","Difference from Open":"-0.15%","Change from Yesterday":"0.43%","Change from Last Report":"-0.02","Latest Volume":"578,650","Market Cap":"37,106,884,608","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":18.325623,"PB Ratio":1.5589428,"Previous Close":102.55,"ROE":0.08331,"DTE":110.23,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.259,"Trailing PEG":3.5216,"Trailing PE":19.036968,"Trailing PS":19.036968,"Quick Ratio":0.88,"Day High":103.48,"Day Low":102.67,"VS Average Volume":0.2017131939,"Company Summary":"Consolidated Edison, Inc., through its subsidiaries, engages in the regulated electric, gas, and steam delivery businesses in the United States. The company offers electric services to approximately 3.7 million customers in New York City and Westchester County; gas to approximately 1.1 million customers in Manhattan, the Bronx, parts of Queens, and Westchester County; and steam to approximately 1,520 customers in parts of Manhattan. It also supplies electricity to approximately 0.3 million customers in southeastern New York and northern New Jersey; and gas to approximately 0.1 million customers in southeastern New York. In addition, the company operates 549 circuit miles of transmission lines; 15 transmission substations; 64 distribution substations; 90,755 in-service line transformers; 3,877 pole miles of overhead distribution lines; and 2,405 miles of underground distribution lines, as well as 4,384 miles of mains and 379,888 service lines for natural gas distribution. Further, it invests in electric and gas transmission projects. The company primarily sells electricity to industrial, commercial, residential, and government customers. Consolidated Edison, Inc. was founded in 1823 and is based in New York, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"12-06-2025 20:15:04"},{"Company Name":"Targa Resources, Inc.","Symbol":"TRGP","Current Price":"168.21","Latest MA":"184.54","Latest MA 5":166.6040025635,"Latest MA 9":165.0122232395,"Latest MA 20":163.0475002747,"RSI":59.9160899511,"Price Target":202.27571,"Difference from MA":"-8.85%","Difference from Open":"0.11%","Change from Yesterday":"-0.92%","Change from Last Report":"-0.08","Latest Volume":"590,853","Market Cap":"36,490,133,504","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":20.364407,"PB Ratio":14.9214945,"Previous Close":169.78,"ROE":0.41976002,"DTE":630.027,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":1.071,"Trailing PEG":1.3981,"Trailing PE":30.977903,"Trailing PS":30.977903,"Quick Ratio":0.486,"Day High":170.27,"Day Low":167.59,"VS Average Volume":0.2659146296,"Company Summary":"Targa Resources Corp., together with its subsidiary, Targa Resources Partners LP, owns, operates, acquires, and develops a portfolio of complementary domestic infrastructure assets in North America. It operates in two segments, Gathering and Processing, and Logistics and Transportation. The company is involved in gathering, compressing, treating, processing, transporting, and selling natural gas; storing, fractionating, treating, transporting, and selling natural gas liquids (NGL) and NGL products, including services to liquefied petroleum gas exporters; and gathering, storing, terminaling, purchasing, and selling crude oil. It is also involved in the purchase and resale of NGL products; and sale of propane, as well as provision of related logistics services to multi-state retailers, independent retailers, and other end-users. In addition, the company offers NGL balancing services; and transportation services to refineries and petrochemical companies in the Gulf Coast area, as well as purchases, markets, and resells natural gas. As of December 31, 2024, it leased and managed approximately 531 railcars; 131 tractors; and 6 vacuum trucks and 2 pressurized NGL barges, as well as owns 8 tractors. Targa Resources Corp. was incorporated in 2005 and is headquartered in Houston, Texas.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:15:04"},{"Company Name":"Vulcan Materials Company (Holdi","Symbol":"VMC","Current Price":"265.91","Latest MA":"260.50","Latest MA 5":264.5879997559,"Latest MA 9":264.7788895671,"Latest MA 20":267.4727750854,"RSI":51.8606852501,"Price Target":294.38583,"Difference from MA":"2.08%","Difference from Open":"2.12%","Change from Yesterday":"1.83%","Change from Last Report":"0.06","Latest Volume":"287,725","Market Cap":"35,127,775,232","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":29.285242,"PB Ratio":4.3184733,"Previous Close":261.12,"ROE":0.120749995,"DTE":67.823,"Industry":"Building Materials","Sector":"Basic Materials","Beta":0.836,"Trailing PEG":2.3415,"Trailing PE":37.452114,"Trailing PS":37.452114,"Quick Ratio":1.393,"Day High":266.15,"Day Low":259.755,"VS Average Volume":0.2463692169,"Company Summary":"Vulcan Materials Company produces and supplies construction aggregates in the United States. It operates through three segments: Aggregates, Asphalt, and Concrete. The company provides crushed stone, sand and gravel, sand, riprap and jetty stones, and other aggregates for use in construction and maintenance of highways, streets, and other public works, as well as in the construction of housing and commercial, industrial, and other nonresidential facilities; asphalt mix; asphalt construction paving services; and ready-mixed concrete products. The company was formerly known as Virginia Holdco, Inc. and changed its name to Vulcan Materials Company. Vulcan Materials Company was founded in 1909 and is headquartered in Birmingham, Alabama.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:15:04"},{"Company Name":"AvalonBay Communities, Inc.","Symbol":"AVB","Current Price":"207.78","Latest MA":"213.80","Latest MA 5":206.4719973145,"Latest MA 9":205.6722210015,"Latest MA 20":204.8900002136,"RSI":59.7523651172,"Price Target":232.4762,"Difference from MA":"-2.82%","Difference from Open":"0.54%","Change from Yesterday":"0.60%","Change from Last Report":"0.09","Latest Volume":"221,814","Market Cap":"29,581,221,888","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":37.505417,"PB Ratio":2.4793565,"Previous Close":206.54,"ROE":0.096920006,"DTE":71.138,"Industry":"REIT - Residential","Sector":"Real Estate","Beta":0.872,"Trailing PEG":7.0884,"Trailing PE":25.875467,"Trailing PS":25.875467,"Quick Ratio":0.036,"Day High":209.29,"Day Low":206.6,"VS Average Volume":0.2462277252,"Company Summary":"AvalonBay Communities, Inc., a member of the S&P 500, is an equity REIT that develops, redevelops, acquires and manages apartment communities in leading metropolitan areas in New England, the New York\/New Jersey Metro area, the Mid-Atlantic, the Pacific Northwest, and Northern and Southern California, as well as in the Company's expansion regions of Raleigh-Durham and Charlotte, North Carolina, Southeast Florida, Dallas and Austin, Texas, and Denver, Colorado. As of December 31, 2024, the Company owned or held a direct or indirect ownership interest in 306 apartment communities containing 93,518 apartment homes in 12 states and the District of Columbia, of which 17 communities were under development.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:17:12"},{"Company Name":"Las Vegas Sands Corp.","Symbol":"LVS","Current Price":"41.54","Latest MA":"43.72","Latest MA 5":41.5980009155,"Latest MA 9":41.4266670058,"Latest MA 20":41.2745002289,"RSI":53.1135540848,"Price Target":51.39471,"Difference from MA":"-4.98%","Difference from Open":"0.05%","Change from Yesterday":"-0.72%","Change from Last Report":"0.00","Latest Volume":"905,409","Market Cap":"29,353,326,592","Earning Date":"23-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":15.105454,"PB Ratio":10.880042,"Previous Close":41.84,"ROE":0.44687,"DTE":456.677,"Industry":"Resorts & Casinos","Sector":"Consumer Cyclical","Beta":1.022,"Trailing PEG":1.0691,"Trailing PE":23.206705,"Trailing PS":23.206705,"Quick Ratio":0.555,"Day High":41.84,"Day Low":40.91,"VS Average Volume":0.1415334261,"Company Summary":"Las Vegas Sands Corp., together with its subsidiaries, owns, develops, and operates integrated resorts in Macao and Singapore. The company owns and operates The Venetian Macao Resort Hotel, The Londoner Macao, The Parisian Macao, The Plaza Macao and Four Seasons Hotel Macao, and The Sands Macao in Macao, the People's Republic of China; and Marina Bay Sands in Singapore. Its integrated resorts feature accommodations, gaming, entertainment and retail malls, convention and exhibition facilities, celebrity chef restaurants, and other amenities. The company was founded in 1988 and is based in Las Vegas, Nevada.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:17:12"},{"Company Name":"Expand Energy Corporation","Symbol":"EXE","Current Price":"114.18","Latest MA":"103.29","Latest MA 5":114.2540007935,"Latest MA 9":115.6177783203,"Latest MA 20":115.329999527,"RSI":47.4486458695,"Price Target":128.37038,"Difference from MA":"10.54%","Difference from Open":"1.76%","Change from Yesterday":"1.74%","Change from Last Report":"0.16","Latest Volume":"1,200,968","Market Cap":"27,172,444,160","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":26.929247,"PB Ratio":1.5772897,"Previous Close":112.23,"ROE":-0.07096,"DTE":30.912,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":0.476,"Trailing PEG":0.3867,"Trailing PE":null,"Trailing PS":null,"Quick Ratio":0.476,"Day High":114.28,"Day Low":111.97,"VS Average Volume":0.275465023,"Company Summary":"Expand Energy Corporation operates as an independent natural gas production company in the United States. The company engages in acquisition, exploration, and development of properties to produce oil, natural gas, and natural gas liquids. It holds interests in the Marcellus Shale in the northern Appalachian Basin in Pennsylvania; the Marcellus and Utica Shales in Ohio and West Virginia; and the Haynesville and Bossier Shales in Louisiana. The company was formerly known as Chesapeake Energy Corporation and changed its name to Expand Energy Corporation in October 2024. Expand Energy Corporation was founded in 1989 and is based in Oklahoma City, Oklahoma.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:17:12"},{"Company Name":"Warner Bros. Discovery, Inc. - ","Symbol":"WBD","Current Price":"10.46","Latest MA":"9.92","Latest MA 5":10.0669999771,"Latest MA 9":9.9683332274,"Latest MA 20":9.6422500057,"RSI":71.0760123135,"Price Target":13.91773,"Difference from MA":"5.46%","Difference from Open":"-0.43%","Change from Yesterday":"-0.43%","Change from Last Report":"0.10","Latest Volume":"34,458,396","Market Cap":"25,891,143,680","Earning Date":"08-05-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":-80.50001,"PB Ratio":0.76487356,"Previous Close":10.51,"ROE":-0.27281,"DTE":106.412,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.517,"Trailing PEG":null,"Trailing PE":null,"Trailing PS":null,"Quick Ratio":0.44,"Day High":10.89,"Day Low":10.365,"VS Average Volume":0.786765109,"Company Summary":"Warner Bros. Discovery, Inc. operates as a media and entertainment company worldwide. It operates through three segments: Studios, Network, and DTC. The Studios segment produces and releases feature films for initial exhibition in theaters; produces and licenses television programs to its networks and third parties and direct-to-consumer services; distributes films and television programs to various third parties and internal television; and offers streaming services and distribution through the home entertainment market, themed experience licensing, and interactive gaming. The Network segment comprises domestic and international television networks. The DTC segment offers premium pay-tv and streaming services. In addition, the company offers portfolio of content, brands, and franchises across television, film, streaming, and gaming under the Warner Bros. Motion Picture Group, Warner Bros. Television Group, DC, HBO, HBO Max, Max, Discovery Channel, discovery+, CNN, HGTV, Food Network, TNT Sports, TBS, TLC, OWN, Warner Bros. Games, Adult Swim, Turner Classic Movies, Television Group, Hanna-Barbera, Harry Potter, DC, Looney Tunes, Scooby-Doo, Game of Thrones, Friends, and others brands. Further, it provides content through distribution platforms, including linear network, free-to-air, and broadcast television; authenticated GO applications, digital distribution arrangements, content licensing arrangements, and direct-to-consumer subscription products. Warner Bros. Discovery, Inc. was incorporated in 2008 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:17:12"},{"Company Name":"Atmos Energy Corporation","Symbol":"ATO","Current Price":"153.69","Latest MA":"147.36","Latest MA 5":152.6579981689,"Latest MA 9":153.0044434272,"Latest MA 20":154.6216398926,"RSI":49.9055745003,"Price Target":160.94833,"Difference from MA":"4.29%","Difference from Open":"0.58%","Change from Yesterday":"0.80%","Change from Last Report":"0.12","Latest Volume":"245,419","Market Cap":"24,411,658,240","Earning Date":"07-05-2025","Earning Time":"Before","Earning Day of Week":"Saturday","PE Ratio":21.525211,"PB Ratio":1.8580894,"Previous Close":152.47,"ROE":0.09186,"DTE":64.747,"Industry":"Utilities - Regulated Gas","Sector":"Utilities","Beta":0.703,"Trailing PEG":2.3701,"Trailing PE":21.435146,"Trailing PS":21.435146,"Quick Ratio":1.101,"Day High":153.87,"Day Low":152.74,"VS Average Volume":0.2135848229,"Company Summary":"Atmos Energy Corporation, together with its subsidiaries, engages in the regulated natural gas distribution, and pipeline and storage businesses in the United States. It operates through two segments, Distribution, and Pipeline and Storage. The Distribution segment is involved in the regulated natural gas distribution and related sales operations in eight states. This segment distributes natural gas to approximately 3.3 million residential, commercial, public authority, and industrial customers; and owned 73,689 miles of underground distribution and transmission mains. The Pipeline and Storage segment engages in the pipeline and storage operations. This segment transports natural gas for third parties and manages five underground storage facilities in Texas; provides ancillary services customary to the pipeline industry, including parking arrangements, lending, and inventory sales; and owned 5,645 miles of gas transmission lines. Atmos Energy Corporation was founded in 1906 and is headquartered in Dallas, Texas.","Stock Sentiment":"N\/A","Row Color":"positive-row","Last Updated":"12-06-2025 20:17:12"},{"Company Name":"Fortive Corporation","Symbol":"FTV","Current Price":"71.00","Latest MA":"74.47","Latest MA 5":72.2400009155,"Latest MA 9":71.9200007121,"Latest MA 20":71.513338089,"RSI":43.4743592714,"Price Target":83.40722,"Difference from MA":"-4.66%","Difference from Open":"0.42%","Change from Yesterday":"-0.42%","Change from Last Report":"-0.04","Latest Volume":"531,296","Market Cap":"24,131,620,864","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":17.026379,"PB Ratio":2.3575509,"Previous Close":71.3,"ROE":0.07695,"DTE":39.337,"Industry":"Scientific & Technical Instruments","Sector":"Technology","Beta":1.156,"Trailing PEG":1.0404,"Trailing PE":31.14035,"Trailing PS":31.14035,"Quick Ratio":0.717,"Day High":71.035,"Day Low":70.26,"VS Average Volume":0.1643033769,"Company Summary":"Fortive Corporation designs, develops, manufactures, and services professional and engineered products, software, and services in the United States, China, and internationally. It operates in three segments: Intelligent Operating Solutions, Precision Technologies, and Advanced Healthcare Solutions. The Intelligent Operating Solutions segment provides advanced instrumentation, software, and services, including electrical test and measurement, facility and asset lifecycle software applications, and connected worker safety and compliance solutions for manufacturing, process industries, healthcare, utilities and power, communications and electronics, and other industries. This segment markets its products and services under the ACCRUENT, FLUKE, GORDIAN, INDUSTRIAL SCIENTIFIC, INTELEX, PRUFTECHNIK, and SERVICECHANNEL brand names. The Precision Technologies segment offers electrical test and measurement, sensing and material technologies for industrial, power and energy, automotive, medical equipment, food and beverage, aerospace and defense, semiconductor, and other general industries under the ANDERSON-NEGELE, GEMS, SETRA, HENGSTLER-DYNAPAR, QUALITROL, PACIFIC SCIENTIFIC, KEITHLEY, and TEKTRONIX brand names. The Advanced Healthcare Solutions segment provides critical workflow solutions comprising instrument sterilization, instrument tracking, design and manufacture of cell therapy equipment, biomedical test tools, radiation detection and safety monitoring, and end-to-end clinical productivity software and solutions under the ASP, CENSIS, CENSITRAC, EVOTECH, FLUKE BIOMEDICAL, INVETECH, LANDAUER, PROVATION, RAYSAFE, and STERRAD brand names. Fortive Corporation was incorporated in 2015 and is headquartered in Everett, Washington.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:17:12"},{"Company Name":"Fox Corporation","Symbol":"FOXA","Current Price":"53.30","Latest MA":"50.98","Latest MA 5":54.2329993591,"Latest MA 9":54.3816663615,"Latest MA 20":55.004249939,"RSI":36.5629415388,"Price Target":56.8955,"Difference from MA":"4.56%","Difference from Open":"-2.64%","Change from Yesterday":"-2.48%","Change from Last Report":"-0.02","Latest Volume":"1,661,530","Market Cap":"22,923,868,160","Earning Date":"12-05-2025","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":14.290885,"PB Ratio":2.0836916,"Previous Close":54.66,"ROE":0.16621,"DTE":68.321,"Industry":"Entertainment","Sector":"Communication Services","Beta":0.527,"Trailing PEG":5.9836,"Trailing PE":13.194307,"Trailing PS":13.194307,"Quick Ratio":2.262,"Day High":54.99,"Day Low":53.275,"VS Average Volume":0.3867161052,"Company Summary":"Fox Corporation operates as a news, sports, and entertainment company in the United States (U.S.). The company operates through four segments: Cable Network Programming, Television, Credible, and The FOX Studio Lot. The Cable Network Programming segment produces and licenses news and sports content for distribution through traditional cable television systems, direct broadcast satellite operators and telecommunication companies, virtual multi-channel video programming distributors, and other digital platforms primarily in the U.S. Television segment produces, acquires, markets, and distributes programming through the FOX broadcast network, advertising supported video-on-demand service Tubi, and operates power broadcast television stations including duopolies and other digital platform; and produces content for third parties. The Credible segment engages in the consumer finance marketplace. The FOX Studio Lot segment provides television and film production services along with office space, studio operation services and includes all operations of the facility. The company was incorporated in 2018 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:17:12"},{"Company Name":"Hewlett Packard Enterprise Comp","Symbol":"HPE","Current Price":"18.09","Latest MA":"19.05","Latest MA 5":18.2129999084,"Latest MA 9":17.9661111789,"Latest MA 20":17.7657500725,"RSI":58.8445999595,"Price Target":21.12353,"Difference from MA":"-5.06%","Difference from Open":"0.14%","Change from Yesterday":"-0.74%","Change from Last Report":"-0.06","Latest Volume":"4,050,852","Market Cap":"23,731,499,008","Earning Date":"03-06-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":8.611905,"PB Ratio":0.99302655,"Previous Close":18.22,"ROE":0.06373,"DTE":73.382,"Industry":"Communication Equipment","Sector":"Technology","Beta":1.329,"Trailing PEG":11.1356,"Trailing PE":17.389423,"Trailing PS":17.389423,"Quick Ratio":0.794,"Day High":18.235,"Day Low":17.965,"VS Average Volume":0.1915360028,"Company Summary":"Hewlett Packard Enterprise Company provides solutions that allow customers to capture, analyze, and act upon data seamlessly in the Americas, Europe, the Middle East, Africa, the Asia Pacific, and Japan. It operates in five segments: Server, Hybrid Cloud, Intelligent Edge, Financial Services, and Corporate Investments and Other. The company offers general purpose servers for multi-workload computing and workload-optimized servers; HPE ProLiant Rack and Tower servers; HPE Synergy, a composable infrastructure for traditional and cloud-native applications; HPE Scale Up Servers product lines for critical applications, including large enterprise software applications and data analytics platforms; HPE Edgeline servers; HPE Cray EX; HPE Cray XD; and HPE NonStop. It also provides HPE Aruba products include hardware products, such as Wi-Fi access points, switches, and gateways; HPE Aruba Networking software and services comprising cloud-based management, network management and access control, software-defined wide-area networking, network security, analytics and assurance, location services software, private and public cellular core software, and professional and support services, as well as as-a-service and consumption models through the HPE GreenLake cloud for the Intelligent Edge portfolio of products. In addition, the company offers leasing, financing, IT consumption, utility programs, and asset management services for customers to facilitate technology deployment models and the acquisition of various IT solutions, including hardware, software, and services from Hewlett Packard Enterprise and others; consultative-led services; HPE and partner technology expertise and advice, and implementation services, as well as solution engagement capabilities; the Communications and Media Solutions (CMS) that offers software and related services; and Hewlett Packard Labs for research and development. It serves commercial and large enterprise groups, such as business and public sector enterprises; and through various partners comprising resellers, distribution partners, original equipment manufacturers, independent software vendors, systems integrators, and advisory firms. The company was founded in 1939 and is headquartered in Spring, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:17:12"},{"Company Name":"Edison International","Symbol":"EIX","Current Price":"49.71","Latest MA":"62.59","Latest MA 5":50.5879991455,"Latest MA 9":52.4855551147,"Latest MA 20":54.9224998932,"RSI":24.4196343474,"Price Target":70.26312,"Difference from MA":"-20.58%","Difference from Open":"0.22%","Change from Yesterday":"0.20%","Change from Last Report":"0.09","Latest Volume":"1,608,211","Market Cap":"19,126,618,112","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":8.721053,"PB Ratio":1.2770712,"Previous Close":49.61,"ROE":0.15001,"DTE":210.459,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.783,"Trailing PEG":0.543,"Trailing PE":7.031117,"Trailing PS":7.031117,"Quick Ratio":0.513,"Day High":50.155,"Day Low":49.42,"VS Average Volume":0.4540296052,"Company Summary":"Edison International, through its subsidiaries, engages in the generation and distribution of electric power. The company supplies and delivers through its electrical infrastructure to an approximately 50,000 square-mile area of southern California. It serves residential, commercial, industrial, public authorities, agricultural, and other sectors. The company's distribution network consists of approximately 13,000 circuit-miles of lines ranging from 55 kV to 500 kV and approximately 80 transmission substations; and approximately 38,000 circuit-miles of overhead lines, approximately 32,000 circuit-miles of underground lines, and approximately 730 distribution substations. Edison International was founded in 1886 and is based in Rosemead, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:17:12"},{"Company Name":"Erie Indemnity Company","Symbol":"ERIE","Current Price":"354.54","Latest MA":"398.64","Latest MA 5":360.9920026855,"Latest MA 9":361.5466672092,"Latest MA 20":360.2760005493,"RSI":39.9209349481,"Price Target":null,"Difference from MA":"-11.06%","Difference from Open":"-0.41%","Change from Yesterday":"-0.62%","Change from Last Report":"0.00","Latest Volume":"35,689","Market Cap":"18,538,862,592","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":26.45821,"PB Ratio":8.967524,"Previous Close":356.75,"ROE":0.3238,"DTE":0.615,"Industry":"Insurance Brokers","Sector":"Financial Services","Beta":0.357,"Trailing PEG":null,"Trailing PE":30.19932,"Trailing PS":30.19932,"Quick Ratio":1.254,"Day High":358.17,"Day Low":354.09,"VS Average Volume":0.256379127,"Company Summary":"Erie Indemnity Company operates as a managing attorney-in-fact for the subscribers at the Erie Insurance Exchange in the United States. It provides issuance and renewal services; sales related services, including agent compensation, and sales and advertising support services; underwriting services comprise underwriting and policy processing; and other services consist of customer services and administrative support services, as well as information technology services. The company was incorporated in 1925 and is based in Erie, Pennsylvania.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"12-06-2025 20:17:12"},{"Company Name":"Principal Financial Group Inc","Symbol":"PFG","Current Price":"76.68","Latest MA":"79.55","Latest MA 5":76.7479995117,"Latest MA 9":76.7033326552,"Latest MA 20":77.5682895508,"RSI":45.9026653519,"Price Target":82.5,"Difference from MA":"-3.61%","Difference from Open":"0.84%","Change from Yesterday":"0.25%","Change from Last Report":"0.03","Latest Volume":"332,981","Market Cap":"17,190,967,296","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":9.085308,"PB Ratio":1.5379369,"Previous Close":76.49,"ROE":0.09733,"DTE":39.589,"Industry":"Asset Management","Sector":"Financial Services","Beta":0.996,"Trailing PEG":null,"Trailing PE":16.4197,"Trailing PS":16.4197,"Quick Ratio":0.303,"Day High":76.71,"Day Low":75.455,"VS Average Volume":0.2345653531,"Company Summary":"Principal Financial Group, Inc. provides retirement, asset management, and insurance products and services to businesses, individuals, and institutional clients worldwide. The company operates through Retirement and Income Solutions, Principal Asset Management, and Benefits and Protection segments. The Retirement and Income Solutions segment provides retirement, and related financial products and services. This segment offers products and services for defined contribution plans, including 401(k) and 403(b) plans, defined benefit plans, nonqualified executive benefit plans, employee stock ownership plans, equity compensation, and pension risk transfer services; individual retirement accounts; investment only products; and mutual funds, individual variable annuities, registered index-linked annuities, and bank products, as well as trust and custody services. The Principal Asset Management segment provides equity, fixed income, real estate, and other alternative investments, as well as fund offerings. This segment also offers pension accumulation products and services, mutual funds, asset management, income annuities, and life insurance accumulation products, as well as voluntary savings plans. The Benefits and Protection segment provides specialty benefits, such as group dental and vision insurance, group life and other insurance, and group and individual disability insurance, as well as administers group dental, disability, and vision benefits; and individual life insurance products comprising universal, variable universal, indexed universal, and term life insurance products. This segment also offers insurance solutions for small and medium-sized businesses and their owners, as well as employees. The company was founded in 1879 and is based in Des Moines, Iowa.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"12-06-2025 20:17:12"},{"Company Name":"Snap-On Incorporated","Symbol":"SNA","Current Price":"320.20","Latest MA":"333.91","Latest MA 5":321.0880041504,"Latest MA 9":320.2355536567,"Latest MA 20":322.286864624,"RSI":47.7458570408,"Price Target":321.3889,"Difference from MA":"-4.11%","Difference from Open":"0.45%","Change from Yesterday":"-0.16%","Change from Last Report":"0.00","Latest Volume":"64,533","Market Cap":"16,743,578,624","Earning Date":"17-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":15.914513,"PB Ratio":3.032714,"Previous Close":320.72,"ROE":0.19538,"DTE":23.477,"Industry":"Tools & Accessories","Sector":"Industrials","Beta":0.766,"Trailing PEG":2.3955,"Trailing PE":16.755625,"Trailing PS":16.755625,"Quick Ratio":3.025,"Day High":320.425,"Day Low":317.885,"VS Average Volume":0.1596719121,"Company Summary":"Snap-on Incorporated manufactures and markets tools, equipment, diagnostics, and repair information and systems solutions for professional users worldwide. It operates through Commercial & Industrial Group, Snap-on Tools Group, Repair Systems & Information Group, and Financial Services segments. The company provides hand tools, including wrenches, sockets, ratchet wrenches, pliers, screwdrivers, punches and chisels, saws and cutting tools, pruning tools, torque measuring instruments, and other related products; power tools, such as cordless, pneumatic, and hydraulic and corded tools; and tool storage products comprising tool chests, roll cabinets, and other products. It also offers handheld and computer-based diagnostic products, service and repair information products, diagnostic software solutions, electronic parts catalogs, business management systems and services, point-of-sale systems, integrated systems for vehicle service shops, original equipment manufacturer purchasing facilitation services, and warranty management systems and analytics; and engineered solutions. In addition, the company provides solutions for the service of vehicles and industrial equipment that include wheel alignment equipment, wheel balancers, tire changers, vehicle lifts, test lane equipment, collision repair equipment, vehicle air conditioning service equipment, brake service equipment, fluid exchange equipment, transmission troubleshooting equipment, safety testing equipment, battery chargers, and hoists, as well as after-sales support services and training programs. Further, it offers financing programs to facilitate the sales of its products and support its franchise business. It serves the aviation and aerospace, natural resources, agriculture, infrastructure construction, government and military, mining, power generation, and technical education industries. Snap-on Incorporated was incorporated in 1920 and is headquartered in Kenosha, Wisconsin.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:17:12"},{"Company Name":"Deckers Outdoor Corporation","Symbol":"DECK","Current Price":"107.70","Latest MA":"153.23","Latest MA 5":109.1530010376,"Latest MA 9":107.8594451565,"Latest MA 20":112.9202502289,"RSI":41.9659835759,"Price Target":127.32429,"Difference from MA":"-29.71%","Difference from Open":"0.19%","Change from Yesterday":"-0.21%","Change from Last Report":"-0.09","Latest Volume":"700,591","Market Cap":"16,095,004,672","Earning Date":"22-05-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.934748,"PB Ratio":6.4374514,"Previous Close":107.93,"ROE":0.41818002,"DTE":11.022,"Industry":"Footwear & Accessories","Sector":"Consumer Cyclical","Beta":1.016,"Trailing PEG":1.9443,"Trailing PE":17.041931,"Trailing PS":17.041931,"Quick Ratio":2.934,"Day High":107.85,"Day Low":106.645,"VS Average Volume":0.1995058706,"Company Summary":"Deckers Outdoor Corporation, together with its subsidiaries, designs, markets, and distributes footwear, apparel, and accessories for casual lifestyle use and high-performance activities in the United States and internationally. The company offers premium footwear, apparel, and accessories under the UGG brand name; footwear, such as running, trail, hiking, fitness, and lifestyle shoes, as well as apparel and accessories under the HOKA brand name; and sandals, shoes, and boots under the Teva brand name. It also provides a casual footwear fashion line under the Koolaburra brand name; and footwear products under the AHNU brand name. The company sells its products through domestic and international retailers, international distributors, and directly to its consumers through its direct-to-consumer business, which includes e-commerce websites and retail stores. Deckers Outdoor Corporation was founded in 1973 and is headquartered in Goleta, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:17:12"},{"Company Name":"Omnicom Group Inc.","Symbol":"OMC","Current Price":"72.05","Latest MA":"82.63","Latest MA 5":72.0272342529,"Latest MA 9":71.193750373,"Latest MA 20":72.733109375,"RSI":48.5343104722,"Price Target":102.013,"Difference from MA":"-12.81%","Difference from Open":"-1.48%","Change from Yesterday":"-1.71%","Change from Last Report":"0.02","Latest Volume":"5,166,679","Market Cap":"14,108,860,416","Earning Date":"15-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":8.338541,"PB Ratio":3.2142856,"Previous Close":73.3,"ROE":0.31022,"DTE":129.051,"Industry":"Advertising Agencies","Sector":"Communication Services","Beta":0.955,"Trailing PEG":1.3661,"Trailing PE":9.842213,"Trailing PS":9.842213,"Quick Ratio":0.798,"Day High":73.36,"Day Low":71.08,"VS Average Volume":1.5654435128,"Company Summary":"Omnicom Group Inc., together with its subsidiaries, offers advertising, marketing, and corporate communications services. It provides a range of services in the areas of media and advertising, precision marketing, public relations, healthcare, branding and retail commerce, experiential, execution, and support. The company's services include advertising, branding, content marketing, corporate social responsibility consulting, crisis communications, custom publishing, data analytics, database management, digital\/direct marketing and post-production, digital transformation consulting, entertainment marketing, experiential marketing, field marketing, sales support, financial\/corporate business-to-business advertising, graphic arts\/digital imaging, healthcare marketing and communications, and instore design services. Its services also comprise interactive marketing, investor relations, marketing research, media planning and buying, retail media planning and buying, merchandising and point of sale, mobile marketing, multi-cultural marketing, non-profit marketing, organizational communications, package design, product placement, promotional marketing, public affairs, public relations, retail marketing, retail media and e-commerce, search engine marketing, shopper marketing, social media marketing, and sports and event marketing services. It operates in the North and Latin America, Europe, the Middle East and Africa (EMEA), and the Asia Pacific. The company was incorporated in 1944 and is based in New York, New York.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"12-06-2025 20:17:12"},{"Company Name":"Alexandria Real Estate Equities","Symbol":"ARE","Current Price":"72.89","Latest MA":"90.69","Latest MA 5":72.3390006104,"Latest MA 9":71.3016674805,"Latest MA 20":70.9417505035,"RSI":61.2154262025,"Price Target":97.30769,"Difference from MA":"-19.62%","Difference from Open":"-0.38%","Change from Yesterday":"-0.40%","Change from Last Report":"0.09","Latest Volume":"406,714","Market Cap":"12,610,031,616","Earning Date":"21-07-2025","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":21.190405,"PB Ratio":0.7100969,"Previous Close":73.19,"ROE":0.01476,"DTE":61.193,"Industry":"REIT - Office","Sector":"Real Estate","Beta":1.267,"Trailing PEG":null,"Trailing PE":95.91447,"Trailing PS":95.91447,"Quick Ratio":2.868,"Day High":73.2904,"Day Low":72.28,"VS Average Volume":0.232794039,"Company Summary":"Alexandria Real Estate Equities, Inc. (NYSE: ARE), an S&P 500 company, is a best-in-class, mission-driven life science REIT making a positive and lasting impact on the world. With our founding in 1994, Alexandria pioneered the life science real estate niche. Alexandria is the preeminent and longest-tenured owner, operator, and developer of collaborative Megacampus ecosystems in AAA life science innovation cluster locations, including Greater Boston, the San Francisco Bay Area, San Diego, Seattle, Maryland, Research Triangle, and New York City. As of March 31, 2025, Alexandria has a total market capitalization of $28.8 billion and an asset base in North America that includes 39.6 million RSF of operating properties and 4.0 million RSF of Class A\/A+ properties undergoing construction. Alexandria has a longstanding and proven track record of developing Class A\/A+ properties clustered in highly dynamic and collaborative Megacampus environments that enhance our tenants' ability to successfully recruit and retain world-class talent and inspire productivity, efficiency, creativity, and success. Alexandria also provides strategic capital to transformative life science companies through our venture capital platform. We believe our unique business model and diligent underwriting ensure a high-quality and diverse tenant base that results in higher occupancy levels, longer lease terms, higher rental income, higher returns, and greater long-term asset value.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:17:12"},{"Company Name":"Akamai Technologies, Inc.","Symbol":"AKAM","Current Price":"79.45","Latest MA":"86.94","Latest MA 5":78.203999939,"Latest MA 9":77.446665785,"Latest MA 20":77.1294992065,"RSI":68.0050044221,"Price Target":100.90652,"Difference from MA":"-8.62%","Difference from Open":"1.90%","Change from Yesterday":"1.61%","Change from Last Report":"-0.09","Latest Volume":"1,237,456","Market Cap":"11,308,595,200","Earning Date":"08-05-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":11.893712,"PB Ratio":2.531706,"Previous Close":78.19,"ROE":0.09821,"DTE":100.746,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.769,"Trailing PEG":1.0907,"Trailing PE":26.661072,"Trailing PS":26.661072,"Quick Ratio":1.032,"Day High":79.57,"Day Low":77.88,"VS Average Volume":0.525202555,"Company Summary":"Akamai Technologies, Inc. engages in the provision of security, delivery, and cloud computing solutions in the United States and internationally. The company offers security solutions that include web application and application programming interfaces (API) protection solutions, which protect web, API, and mobile app traffic from attacks; Bot & Abuse portfolio, which provides solutions to help customers protect against threats; Akamai Account Protector, which offers full account lifecycle protections including the ability to defend against account takeover and opening abuse, adversarial bot protection, protection against credential stuffing, inventory scalping, and hoarding; Akamai Content Protector, which provides solutions designed to stop persistent scrapers from stealing content; API security, which discovers, audits, and monitors API; and microservice and application component protection that analyzes and protects application traffic that moves between application components. It also offers cloud computing services, which include compute, storage, networking, database, and container management services; and Akamai App Platform, provides ready-to-run templates that address challenges in deploying, managing and scaling Kubernetes clusters at scale. In addition, the company offers delivery solutions that include web and mobile performance solutions, which enables dynamic websites and applications, as well as global traffic management, site acceleration, application load balancing, large-scale load testing, and real-user monitoring; and media delivery solutions, including video streaming and video player services, game and software delivery, broadcast operations, authoritative domain name system, resolution, and data and analytics. Akamai Technologies, Inc. was incorporated in 1998 and is headquartered in Cambridge, Massachusetts.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:17:12"},{"Company Name":"Pinnacle West Capital Corporati","Symbol":"PNW","Current Price":"90.13","Latest MA":"89.21","Latest MA 5":89.5000005493,"Latest MA 9":89.7411112128,"Latest MA 20":90.5224996033,"RSI":50.616346992,"Price Target":95.36733,"Difference from MA":"1.03%","Difference from Open":"0.83%","Change from Yesterday":"1.03%","Change from Last Report":"0.13","Latest Volume":"420,937","Market Cap":"10,761,431,040","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":19.258547,"PB Ratio":1.5970019,"Previous Close":89.21,"ROE":0.0919,"DTE":177.219,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.431,"Trailing PEG":4.4027,"Trailing PE":17.847523,"Trailing PS":17.847523,"Quick Ratio":0.188,"Day High":90.185,"Day Low":89.175,"VS Average Volume":0.3430283917,"Company Summary":"Pinnacle West Capital Corporation, through its subsidiary, provides retail and wholesale electric services primarily in the state of Arizona. The company engages in the generation, transmission, and distribution of electricity using nuclear, gas, oil, coal, and solar generating facilities. Its transmission facilities include overhead lines and underground lines; and distribution facilities consist of overhead lines and underground primary cables. The company also owns and maintains transmission and distribution substations; and owns energy storage facilities. Pinnacle West Capital Corporation was incorporated in 1985 and is headquartered in Phoenix, Arizona.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:17:12"},{"Company Name":"Moderna, Inc.","Symbol":"MRNA","Current Price":"27.52","Latest MA":"34.10","Latest MA 5":27.7099997559,"Latest MA 9":27.4222220866,"Latest MA 20":26.7384998093,"RSI":54.4725023846,"Price Target":47.63636,"Difference from MA":"-19.30%","Difference from Open":"0.84%","Change from Yesterday":"-0.83%","Change from Last Report":"-0.22","Latest Volume":"4,633,388","Market Cap":"10,643,140,608","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":-3.1632185,"PB Ratio":1.0580546,"Previous Close":27.75,"ROE":-0.29341,"DTE":7.401,"Industry":"Biotechnology","Sector":"Healthcare","Beta":1.859,"Trailing PEG":null,"Trailing PE":null,"Trailing PS":null,"Quick Ratio":3.916,"Day High":27.62,"Day Low":26.81,"VS Average Volume":0.4323428445,"Company Summary":"Moderna, Inc., a biotechnology company, provides messenger RNA medicines in the United States, Europe, and internationally. The company's respiratory vaccines include spikevax, mRESVIA, COVID, RSV, seasonal influenza, combination, and pandemic influenza vaccine; latent vaccines comprise cytomegalovirus, epstein-barr virus, herpes simplex virus, varicella zoster virus, and human immunodeficiency virus vaccines; enteric viruses include norovirus; public health vaccines consist of Zika, Nipah, and Mpox vaccines; and bacterial diseases vaccines, such as lyme vaccines. It also provides oncology therapeutics, such as individualized neoantigen and checkpoint adaptive immune modulation therapy; and rare disease products, including propionic and methylmalonic acidemia, glycogen storage disease type 1a, ornithine transcarbamylase deficiency, phenylketonuria, crigler-najjar syndrome type 1, and cystic fibrosis. It has strategic alliances and collaborations with AstraZeneca; Merck & Co., Inc; Vertex Pharmaceuticals Incorporated; Vertex Pharmaceuticals (Europe) Limited; Generation Bio Co.; immatics N.V.; Life Edit Therapeutics; Carisma Therapeutics, Inc.; CytomX Therapeutics; Defense Advanced Research Projects Agency; Biomedical Advanced Research and Development Authority; Institute for Life Changing Medicines; The Bill & Melinda Gates Foundation; and OpenAI. The company was formerly known as Moderna Therapeutics, Inc. and changed its name to Moderna, Inc. in August 2018. Moderna, Inc. was founded in 2010 and is headquartered in Cambridge, Massachusetts.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:17:12"},{"Company Name":"Stanley Black & Decker, Inc.","Symbol":"SWK","Current Price":"67.66","Latest MA":"76.37","Latest MA 5":67.6614987793,"Latest MA 9":66.3130546909,"Latest MA 20":66.7114598618,"RSI":57.5225043667,"Price Target":84.50188,"Difference from MA":"-11.41%","Difference from Open":"0.76%","Change from Yesterday":"-0.69%","Change from Last Report":"-0.20","Latest Volume":"770,922","Market Cap":"10,467,494,912","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":12.323771,"PB Ratio":1.1836926,"Previous Close":68.13,"ROE":0.04032,"DTE":81.597,"Industry":"Tools & Accessories","Sector":"Industrials","Beta":1.172,"Trailing PEG":null,"Trailing PE":28.668434,"Trailing PS":28.668434,"Quick Ratio":0.301,"Day High":67.84,"Day Low":66.6,"VS Average Volume":0.2529223525,"Company Summary":"Stanley Black & Decker, Inc. provides hand tools, power tools, outdoor products, and related accessories in the United States, Canada, Other Americas, Europe, and Asia. The company's Tools & Outdoor segment offers professional grade corded and cordless electric power tools and equipment, including drills, impact wrenches and drivers, grinders, saws, routers, concrete prep and placement tools, and sanders; pneumatic tools and fasteners, such as nail guns, nails, staplers and staples, and concrete and masonry anchors; corded and cordless electric power tools; hand-held vacuums, paint tools, and cleaning appliances; leveling and layout tools, planes, hammers, demolition tools, clamps, vises, knives, saws, chisels, and industrial and automotive tools; drill, screwdriver, router bits, abrasives, saw blades, and threading products; tool boxes, sawhorses, medical cabinets, and engineered storage solutions; and electric and gas-powered lawn and garden products. This segment sells its products under the DEWALT, CRAFTSMAN, CUB ADET, BLACK+DECKER, and HUSTLER brands through retailers, third-party distributors, independent dealers, and a direct sales force. Its Industrial segment provides threaded fasteners, blind rivets and tools, blind inserts and tools, drawn arc weld studs and systems, engineered plastic and mechanical fasteners, self-piercing riveting systems, precision nut running systems, micro fasteners, high-strength structural fasteners, axel swage, latches, heat shields, pins, couplings, fitting, and other engineered products; and attachments used on excavators and handheld tools. This segment sells its products through direct sales force and third-party distributors to the automotive, manufacturing, electronics, construction, aerospace, and other industries. The company was formerly known as The Stanley Works and changed its name to Stanley Black & Decker, Inc. in March 2010. The company was founded in 1843 and is headquartered in New Britain, Connecticut.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:17:12"},{"Company Name":"Assurant, Inc.","Symbol":"AIZ","Current Price":"197.43","Latest MA":"205.42","Latest MA 5":198.2489984131,"Latest MA 9":200.3854366726,"Latest MA 20":199.240428772,"RSI":44.6328425496,"Price Target":233.0,"Difference from MA":"-3.89%","Difference from Open":"0.82%","Change from Yesterday":"0.45%","Change from Last Report":"0.15","Latest Volume":"89,289","Market Cap":"10,009,902,080","Earning Date":"06-05-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":11.01702,"PB Ratio":1.9167848,"Previous Close":196.54,"ROE":0.13204001,"DTE":39.809,"Industry":"Insurance - Property & Casualty","Sector":"Financial Services","Beta":0.603,"Trailing PEG":null,"Trailing PE":15.411787,"Trailing PS":15.411787,"Quick Ratio":0.14,"Day High":197.515,"Day Low":195.12,"VS Average Volume":0.1540918763,"Company Summary":"Assurant, Inc. provides protection services to connected devices, homes, and automobiles in North America, Latin America, Europe, and the Asia Pacific. It operates in two segments, Global Lifestyle and Global Housing. The Global Lifestyle segment offers mobile device solutions, and extended service contracts and related services for consumer electronics and appliances, and financial services and other insurance products; and vehicle protection, commercial equipment, and other related services. The Global Housing segment provides lender-placed homeowners, manufactured housing, and flood insurance; renters insurance and related products; and voluntary manufactured housing, and condominium and homeowners insurance products. The company was formerly known as Fortis, Inc. and changed its name to Assurant, Inc. in February 2004. Assurant, Inc. was founded in 1892 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:17:12"},{"Company Name":"MGM Resorts International","Symbol":"MGM","Current Price":"33.03","Latest MA":"33.56","Latest MA 5":32.7960001526,"Latest MA 9":32.2655556234,"Latest MA 20":32.3280000343,"RSI":60.648986825,"Price Target":45.98158,"Difference from MA":"-1.58%","Difference from Open":"1.07%","Change from Yesterday":"-0.60%","Change from Last Report":"-0.02","Latest Volume":"1,264,835","Market Cap":"8,989,080,576","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":14.360869,"PB Ratio":3.2369657,"Previous Close":33.23,"ROE":0.2582,"DTE":880.101,"Industry":"Resorts & Casinos","Sector":"Consumer Cyclical","Beta":1.767,"Trailing PEG":1.8682,"Trailing PE":14.745535,"Trailing PS":14.745535,"Quick Ratio":1.089,"Day High":33.115,"Day Low":32.35,"VS Average Volume":0.2193614794,"Company Summary":"MGM Resorts International, through its subsidiaries, operates as a gaming and entertainment company in the United States, China, and internationally. The company operates through four segments: Las Vegas Strip Resorts, Regional Operations, MGM China, and MGM Digital. It operates casino resorts that offer gaming, hotel, convention, dining, entertainment, retail, and other resort amenities, as well as online\/digital games through its online platforms. The company's casino operations include slots and table games, as well as live dealer, online sports betting, and iGaming through BetMGM. Its customers include premium gaming customers; leisure and wholesale travel customers; business travelers; and group customers, including conventions, trade associations, and small meetings. The company was formerly known as MGM MIRAGE and changed its name to MGM Resorts International in June 2010. MGM Resorts International was incorporated in 1986 and is based in Las Vegas, Nevada.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:17:12"},{"Company Name":"Bio-Techne Corp","Symbol":"TECH","Current Price":"51.75","Latest MA":"63.20","Latest MA 5":50.6520004272,"Latest MA 9":49.8677779304,"Latest MA 20":48.9480741501,"RSI":69.2693593101,"Price Target":68.94923,"Difference from MA":"-18.12%","Difference from Open":"1.27%","Change from Yesterday":"0.41%","Change from Last Report":"-0.14","Latest Volume":"686,005","Market Cap":"8,112,692,736","Earning Date":"07-05-2025","Earning Time":"Before","Earning Day of Week":"Saturday","PE Ratio":23.630136,"PB Ratio":4.020042,"Previous Close":51.54,"ROE":0.0653,"DTE":20.986,"Industry":"Biotechnology","Sector":"Healthcare","Beta":1.381,"Trailing PEG":1.4101,"Trailing PE":62.3494,"Trailing PS":62.3494,"Quick Ratio":2.233,"Day High":52.2,"Day Low":50.5,"VS Average Volume":0.2937324126,"Company Summary":"Bio-Techne Corporation, together with its subsidiaries, develops, manufactures, and sells life science reagents, instruments, and services for the research, diagnostics, and bioprocessing markets worldwide. The company operates through two segments, Protein Sciences, and Diagnostics and Genomics. The Protein Sciences segment develops and manufactures biological reagents used in various aspects of life science research, diagnostics, and cell and gene therapy, such as cytokines and growth factors, antibodies, small molecules, tissue culture sera, and cell selection technologies. This segment also offers proteomic analytical tools for automated western blot and multiplexed ELISA workflow consists of manual and automated protein analysis instruments and immunoassays for use in quantifying proteins in various biological fluids. The Diagnostics and Genomics segment develops and manufactures diagnostic products, including controls, calibrators, and diagnostic assays for regulated diagnostics market, exosome-based molecular diagnostic assays, advanced tissue-based in-situ hybridization assays for spatial genomic and tissue biopsy analysis, and genetic and oncology kits for research and clinical applications; and sells products for genetic carrier screening, oncology diagnostics, molecular controls, and research, as well as instruments and process control products for hematology, blood chemistry and gases, and coagulation controls and reagents used in various diagnostic applications. The company has strategic partnership with ALZpath, Inc. to accelerate breakthroughs in neurodegenerative disease research and treatment, including Alzheimer's disease. The company was formerly known as Techne Corporation and changed its name to Bio-Techne Corporation in November 2014. Bio-Techne Corporation was incorporated in 1976 and is headquartered in Minneapolis, Minnesota.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:17:12"},{"Company Name":"Generac Holdlings Inc.","Symbol":"GNRC","Current Price":"129.86","Latest MA":"143.88","Latest MA 5":129.3758023804,"Latest MA 9":127.6087797784,"Latest MA 20":126.4449511902,"RSI":64.2832850046,"Price Target":152.0061,"Difference from MA":"-9.74%","Difference from Open":"1.14%","Change from Yesterday":"0.06%","Change from Last Report":"-0.00","Latest Volume":"237,152","Market Cap":"7,672,276,992","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":15.817173,"PB Ratio":3.1071205,"Previous Close":129.78,"ROE":0.13798,"DTE":57.434,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":1.698,"Trailing PEG":1.3765,"Trailing PE":22.623518,"Trailing PS":22.623518,"Quick Ratio":0.772,"Day High":129.9199,"Day Low":127.71,"VS Average Volume":0.2773065419,"Company Summary":"Generac Holdings Inc. designs, manufactures, and distributes energy technology products and solution worldwide. The company offers residential automatic standby generators, automatic transfer switch, air-cooled engine residential standby generators, and liquid-cooled engine generators; Mobile Link, a remote monitoring system for home standby generators; residential battery storage systems; smart home solutions, such as smart thermostats and a suite of home monitoring products. It also provides smart home energy management devices and sensors for heating and cooling system; smart doorbell cameras; and portable and inverter generators; multiple portable battery solutions; manual transfer switches; outdoor power equipment, including trimmers, field and brush mowers, log splitters, stump grinders, chipper shredders, lawn and leaf vacuums, and pressure washers and water pumps; and battery-powered turf care products. In addition, the company offers commercial and industrial products comprising cleaner-burning natural gas fueled generators; light-commercial standby generators and related transfer switches; stationary generators; single-engine industrial generators; industrial standby generators; industrial transfer switches; light towers, mobile generators, commercial mobile pumps, heaters, dust-suppression equipment, and mobile energy storage systems; battery energy storage system and related inverter products; and aftermarket service parts and product accessories. Further, it provides Concerto energy-balancing software platform for controlling and dispatching distributed energy resources. The company distributes its products through independent residential dealers, industrial distributors and dealers, national and regional retailers, e-commerce partners, electrical\/HVAC\/solar wholesalers, solar installers, catalogs, equipment rental companies, and other equipment distributors; and directly to end users. The company was founded in 1959 and is based in Waukesha, Wisconsin.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:17:12"},{"Company Name":"O'Reilly Automotive, Inc.","Symbol":"ORLY","Current Price":"90.61","Latest MA":"87.24","Latest MA 5":90.8112675171,"Latest MA 9":91.0517419434,"Latest MA 20":91.240150177,"RSI":47.0989497018,"Price Target":97.24107,"Difference from MA":"3.87%","Difference from Open":"0.63%","Change from Yesterday":"0.67%","Change from Last Report":"0.06","Latest Volume":"1,815,769","Market Cap":"77,461,504,000","Earning Date":"23-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":2.016355,"PB Ratio":-57.170345,"Previous Close":90.01,"ROE":null,"DTE":null,"Industry":"Auto Parts","Sector":"Consumer Cyclical","Beta":0.6,"Trailing PEG":2.1485,"Trailing PE":33.31434,"Trailing PS":33.31434,"Quick Ratio":0.084,"Day High":91.1,"Day Low":90.0,"VS Average Volume":0.2782669609,"Company Summary":"O'Reilly Automotive, Inc., together with its subsidiaries, operates as a retailer and supplier of automotive aftermarket parts, tools, supplies, equipment, and accessories in the United States, Puerto Rico, Mexico, and Canada. The company provides new and remanufactured automotive hard parts and maintenance items, such as alternators, batteries, brake system components, belts, chassis parts, driveline parts, engine parts, fuel pumps, hoses, starters, temperature control, water pumps, antifreeze, appearance products, engine additives, filters, fluids, lighting products, and oil and wiper blades; and accessories, including floor mats, seat covers, and truck accessories. It also offers auto body paint and related materials, automotive tools, and professional service provider service equipment. In addition, the company provides enhanced services and programs consisting used oil, oil filter, and battery recycling; battery, wiper, and bulb replacement; battery diagnostic testing; electrical and module testing; check engine light code extraction; loaner tool program; drum and rotor resurfacing; custom hydraulic hoses; and professional paint shop mixing and related materials. Further, it offers do-it-yourself and professional service for domestic and imported automobiles, vans, and trucks. The company offers its products under the BesTest, BrakeBest, Cartek, Import Direct, MasterPro, MicroGard, Murray, Omnispark, O'Reilly Auto Parts, Precision, PowerTorque, SuperStart, Syntec, and Ultima brands. O'Reilly Automotive, Inc. was founded in 1957 and is headquartered in Springfield, Missouri.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:17:12"}]