[{"Company Name":"Intel Corporation","Symbol":"INTC","Current Price":"19.91","Latest MA":"23.49","Price Target":23.82824,"Difference from MA":"-15.23%","Difference from Open":"0.20%","Change from Yesterday":"0.53%","Change from Last Report":"0.00","Latest Volume":"16,707,775","Market Cap":"85,871,828,992","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":21.1516,"PB Ratio":0.86194205,"ROE":-0.15597,"DTE":47.906,"Industry":"Semiconductors","Sector":"Technology","Beta":1.026,"Trailing PEG":0.5876,"Trailing PE":"N\/A","Trailing PS":1.5829785,"Quick Ratio":0.833,"Day High":20.08,"Day Low":19.78,"VS Average Volume":0.225717152,"Company Summary":"Intel Corporation designs, develops, manufactures, markets, and sells computing and related products and services worldwide. It operates through Client Computing Group, Data Center and AI, Network and Edge, Mobileye, and Intel Foundry Services segments. The company's products portfolio comprises central processing units and chipsets, system-on-chips (SoCs), and multichip packages; mobile and desktop processors; hardware products comprising graphics processing units (GPUs), domain-specific accelerators, and field programmable gate arrays (FPGAs); and memory and storage, connectivity and networking, and other semiconductor products. It also offers silicon devices and software products; and optimization solutions for workloads, such as AI, cryptography, security, storage, networking, and leverages various features supporting diverse compute environments. In addition, the company develops and deploys advanced driver assistance systems (ADAS), and autonomous driving technologies and solutions; and provides advanced process technologies backed by an ecosystem of IP, EDA, and design services, as well as systems of chips, including advanced packaging technologies, software and accelerate bring-up, and integration of chips and driving standards. Further, it delivers and deploys intelligent edge platforms that allow developers to achieve agility and drive automation using AI for efficient operations with data integrity, as well as provides hardware and software platforms, tools, and ecosystem partnerships for digital transformation from the cloud to edge. The company serves original equipment manufacturers, original design manufacturers, cloud service providers, and other manufacturers and service providers. It has a strategic agreement with Synopsys, Inc. to develop EDA and IP solutions; and ARM that enables chip designers to build optimized compute SoCs on the Intel 18A process. Intel Corporation was incorporated in 1968 and is headquartered in Santa Clara, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"29-01-2025 17:33:32"},{"Company Name":"International Paper Company","Symbol":"IP","Current Price":"57.92","Latest MA":"50.33","Price Target":56.46,"Difference from MA":"15.07%","Difference from Open":"-0.48%","Change from Yesterday":"-1.97%","Change from Last Report":"-0.05","Latest Volume":"2,339,233","Market Cap":"20,121,870,336","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":18.983316,"PB Ratio":2.3318167,"ROE":0.04797,"DTE":69.707,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":0.988,"Trailing PEG":0.5253,"Trailing PE":49.504272,"Trailing PS":1.0794995,"Quick Ratio":1.021,"Day High":58.975,"Day Low":57.9,"VS Average Volume":0.5170724106,"Company Summary":"International Paper Company produces and sells renewable fiber-based packaging and pulp products in North America, Latin America, Europe, and North Africa. It operates through two segments, Industrial Packaging and Global Cellulose Fibers. The company offers linerboard, medium, whitetop, recycled linerboard, recycled medium and saturating kraft; and pulp for a range of applications, such as diapers, towel and tissue products, feminine care, incontinence, and other personal care products, as well as specialty pulps for use in textiles, construction materials, paints, coatings, and others. It sells its products directly to end users and converters, as well as through agents, resellers, and distributors. The company was founded in 1898 and is headquartered in Memphis, Tennessee.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 17:33:32"},{"Company Name":"Apple Inc.","Symbol":"AAPL","Current Price":"236.93","Latest MA":"229.38","Price Target":245.794,"Difference from MA":"3.29%","Difference from Open":"1.19%","Change from Yesterday":"-0.52%","Change from Last Report":"0.10","Latest Volume":"11,746,379","Market Cap":"3,562,929,389,568","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":28.606615,"PB Ratio":62.896202,"ROE":1.5741299,"DTE":209.059,"Industry":"Consumer Electronics","Sector":"Technology","Beta":1.24,"Trailing PEG":2.1712,"Trailing PE":38.96875,"Trailing PS":9.111536,"Quick Ratio":0.745,"Day High":237.13,"Day Low":234.01,"VS Average Volume":0.2365840183,"Company Summary":"Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod. It also provides AppleCare support and cloud services; and operates various platforms, including the App Store that allow customers to discover and download applications and digital content, such as books, music, video, games, and podcasts, as well as advertising services include third-party licensing arrangements and its own advertising platforms. In addition, the company offers various subscription-based services, such as Apple Arcade, a game subscription service; Apple Fitness+, a personalized fitness service; Apple Music, which offers users a curated listening experience with on-demand radio stations; Apple News+, a subscription news and magazine service; Apple TV+, which offers exclusive original content; Apple Card, a co-branded credit card; and Apple Pay, a cashless payment service, as well as licenses its intellectual property. The company serves consumers, and small and mid-sized businesses; and the education, enterprise, and government markets. It distributes third-party applications for its products through the App Store. The company also sells its products through its retail and online stores, and direct sales force; and third-party cellular network carriers, wholesalers, retailers, and resellers. Apple Inc. was founded in 1976 and is headquartered in Cupertino, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 17:33:32"},{"Company Name":"Comcast Corporation","Symbol":"CMCSA","Current Price":"37.59","Latest MA":"39.58","Price Target":47.7025,"Difference from MA":"-5.04%","Difference from Open":"0.05%","Change from Yesterday":"0.07%","Change from Last Report":"-0.09","Latest Volume":"3,677,910","Market Cap":"143,839,641,600","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":8.653056,"PB Ratio":1.6803755,"ROE":0.16884,"DTE":117.127,"Industry":"Telecom Services","Sector":"Communication Services","Beta":1.004,"Trailing PEG":1.1651,"Trailing PE":10.132075,"Trailing PS":1.1687628,"Quick Ratio":0.605,"Day High":37.825,"Day Low":37.52,"VS Average Volume":0.1746097865,"Company Summary":"Comcast Corporation operates as a media and technology company worldwide. It operates through Residential Connectivity & Platforms, Business Services Connectivity, Media, Studios, and Theme Parks segments. The Residential Connectivity & Platforms segment provides residential broadband and wireless connectivity services, residential and business video services, sky-branded entertainment television networks, and advertising. The Business Services Connectivity segment offers connectivity services for small business locations, which include broadband, wireline voice, and wireless services, as well as solutions for medium-sized customers and larger enterprises; and small business connectivity services in the United Kingdom. The Media segment operates NBCUniversal's television and streaming business, including national and regional cable networks; the NBC and Telemundo broadcast networks and owned local broadcast television stations; and Peacock, a direct-to-consumer streaming services. It also operates international television networks comprising the Sky Sports networks, as well as other digital properties. The Studios segment operates NBCUniversal and Sky film and television studio production and distribution operations. The Theme Parks segment operates Universal theme parks in Orlando, Florida; Hollywood, California; Osaka, Japan; and Beijing, China. The company also offers a consolidated streaming platforms under the Philadelphia Flyers and the Wells Fargo Center arena in Philadelphia, Pennsylvania; and Xumo. Comcast Corporation was founded in 1963 and is headquartered in Philadelphia, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 17:33:32"},{"Company Name":"Unity Software Inc.","Symbol":"U","Current Price":"22.80","Latest MA":"20.01","Price Target":23.09783,"Difference from MA":"13.92%","Difference from Open":"-1.38%","Change from Yesterday":"-1.76%","Change from Last Report":"0.00","Latest Volume":"1,460,461","Market Cap":"9,184,751,616","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":28.971142,"PB Ratio":2.8831563,"ROE":-0.23091999,"DTE":68.801,"Industry":"Software - Application","Sector":"Technology","Beta":2.291,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":4.6731653,"Quick Ratio":2.26,"Day High":23.18,"Day Low":22.5001,"VS Average Volume":0.1333509435,"Company Summary":"Unity Software Inc. operates a platform that provides real-time 3D content and experiences. Its platform provides artificial intelligence solutions that support creators in building, running, and growing immersive, real-time 2D and 3D content for mobile phones, tablets, PCs, consoles, and augmented and virtual reality devices. The company also offers Create Solutions, a set of tools and services used to build, ship, and run real-time 2D and 3D content; and Grow Solutions, which allows customers to grow and engage their user base and monetize their content. It serves enterprises, mid-market companies, and government and non-profit institutions; mid-sized, small, and independent businesses; and individuals across various industries. The company offers its solutions directly through its online store, field sales operations, independent distributors, and resellers in North America, Denmark, China, Finland, the United Kingdom, Germany, Israel, Japan, Singapore, South Korea, Spain, and internationally. Unity Software Inc. was founded in 2004 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 17:33:32"},{"Company Name":"Altria Group, Inc.","Symbol":"MO","Current Price":"52.94","Latest MA":"50.53","Price Target":56.58769,"Difference from MA":"4.76%","Difference from Open":"0.26%","Change from Yesterday":"0.70%","Change from Last Report":"-0.02","Latest Volume":"1,477,747","Market Cap":"89,723,068,416","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":9.891647,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Tobacco","Sector":"Consumer Defensive","Beta":0.67,"Trailing PEG":3.6792,"Trailing PE":8.942551,"Trailing PS":4.4063973,"Quick Ratio":0.274,"Day High":53.11,"Day Low":52.74,"VS Average Volume":0.1850283437,"Company Summary":"Altria Group, Inc., through its subsidiaries, manufactures and sells smokeable and oral tobacco products in the United States. The company offers cigarettes primarily under the Marlboro brand; large cigars and pipe tobacco under the Black & Mild brand; moist smokeless tobacco and snus products under the Copenhagen, Skoal, Red Seal, and Husky brands; oral nicotine pouches under the on! brand; and e-vapor products under the NJOY ACE brand. It sells its products to distributors, as well as large retail organizations, such as chain stores. The company was founded in 1822 and is headquartered in Richmond, Virginia.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"29-01-2025 17:34:33"}]