[{"Company Name":"Cintas Corporation","Symbol":"CTAS","Current Price":"186.94","Latest MA":"196.96","Price Target":"204.69","Difference from MA":"-5.09%","Difference from Open":"3.01%","Change from Yesterday":"2.27%","Change from Last Report":"0.00","Latest Volume":"6,170,076","Market Cap":"75,429,543,936","Earning Date":"2024-12-19","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":39.319614,"ROE":0.40462002,"DTE":70.573,"Industry":"Specialty Business Services","Sector":"Industrials","Beta":1.313,"Trailing PEG":3.8689,"Trailing PE":45.045784,"Trailing PS":7.7317066,"Quick Ratio":0.703,"Day High":187.7389,"Day Low":181.15,"VS Average Volume":3.7558953743,"Company Summary":"Cintas Corporation engages in the provision of corporate identity uniforms and related business services primarily in the United States, Canada, and Latin America. It operates through Uniform Rental and Facility Services, First Aid and Safety Services, and All Other segments. The company rents and services uniforms and other garments, including flame resistant clothing, mats, mops and shop towels, and other ancillary items; and provides restroom cleaning services and supplies, as well as sells uniforms. In addition, the company offers first aid and safety services, and fire protection products and services. It provides its products and services through its distribution network and local delivery routes, or local representatives to small service and manufacturing companies, as well as major corporations. The company was founded in 1968 and is based in Cincinnati, Ohio. Cintas Corporation was formerly a subsidiary of Cintas Corporation.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"Paychex, Inc.","Symbol":"PAYX","Current Price":"139.54","Latest MA":"132.02","Price Target":"139.31","Difference from MA":"5.69%","Difference from Open":"2.17%","Change from Yesterday":"1.26%","Change from Last Report":"0.00","Latest Volume":"4,925,570","Market Cap":"50,243,190,784","Earning Date":"2024-12-19","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":26.285053,"ROE":0.45672,"DTE":22.517,"Industry":"Software—Application","Sector":"Technology","Beta":0.987,"Trailing PEG":4.1695,"Trailing PE":29.438818,"Trailing PS":9.460569,"Quick Ratio":0.599,"Day High":140.11,"Day Low":136.58,"VS Average Volume":2.6598262592,"Company Summary":"Paychex, Inc., together with its subsidiaries, provides integrated human capital management solutions (HCM) for payroll, benefits, human resources (HR), and insurance services for small to medium-sized businesses in the United States, Europe, and India. It offers payroll processing services; payroll tax administration services; employee payment services; and regulatory compliance services, such as new-hire reporting and garnishment processing. The company also provides HR solutions, including integrated HCM technology solutions and HR advisory services through both virtual and on-site availability of a professionally trained HR representative, as well as HR support to non-payroll clients through its HR Partner Plus solution; and retirement services administration, such as plan implementation, ongoing compliance with government regulations, employee and employer reporting, participant and employer online access, electronic funds transfer, and other administrative services. In addition, it offers cloud-based HR administration software products for employee benefits management and administration, time and attendance, digital communication solutions, recruiting, and onboarding solutions; plan administration outsourcing and state unemployment insurance services; various business services to small to medium-sized businesses comprising payroll funding and outsourcing services, which include payroll processing, invoicing, and tax preparation; and payment processing services, financial fitness programs, and a small-business loan resource center. Further, the company provides insurance services for property and casualty coverage, such as workers' compensation, business-owner policies, cyber security protection, and commercial auto, as well as health and benefits coverage, including health, dental, vision, and life. It markets and sells its services primarily through its direct sales force. The company was founded in 1971 and is headquartered in Rochester, New York.","Stock Sentiment":"Strong Sell","Row Color":"positive-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"FactSet Research Systems Inc.","Symbol":"FDS","Current Price":"483.52","Latest MA":"442.05","Price Target":"481.75","Difference from MA":"9.38%","Difference from Open":"-0.22%","Change from Yesterday":"-1.27%","Change from Last Report":"0.00","Latest Volume":"919,142","Market Cap":"18,368,344,064","Earning Date":"2024-12-19","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":28.22835,"ROE":0.30411,"DTE":82.338,"Industry":"Financial Data & Stock Exchanges","Sector":"Financial Services","Beta":0.752,"Trailing PEG":2.6595,"Trailing PE":34.61131,"Trailing PS":8.337665,"Quick Ratio":1.08,"Day High":485.68,"Day Low":470.33,"VS Average Volume":3.5534618671,"Company Summary":"FactSet Research Systems Inc., together with its subsidiaries, operates as a financial digital platform and enterprise solutions provider for the investment community worldwide. The company provides workstations, portfolio analytics, and enterprise data solutions, as well as managed services for supporting data, performance, risk, and reporting workflows. It offers subscription-based financial data and market intelligence on securities, companies, industries, and people that enable clients to research investment ideas, as well as analyze, monitor, and manage their portfolios. The company provides its services through its configurable desktop and mobile platform, data feeds, cloud-based digital solutions, and application programming interfaces. It serves investment professionals, including institutional asset managers, bankers, wealth managers, asset owners, partners, hedge funds, corporate users, and private equity and venture capital professionals. The company was founded in 1978 and is headquartered in Norwalk, Connecticut.","Stock Sentiment":"Strong Sell","Row Color":"positive-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"CarMax Inc","Symbol":"KMX","Current Price":"84.27","Latest MA":"77.11","Price Target":"86.00","Difference from MA":"9.28%","Difference from Open":"-1.32%","Change from Yesterday":"0.05%","Change from Last Report":"0.00","Latest Volume":"4,188,560","Market Cap":"12,969,826,304","Earning Date":"2024-12-19","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":21.795412,"ROE":0.06853,"DTE":314.637,"Industry":"Auto & Truck Dealerships","Sector":"Consumer Cyclical","Beta":1.686,"Trailing PEG":1.0226,"Trailing PE":28.663263,"Trailing PS":0.4685789,"Quick Ratio":0.349,"Day High":85.4,"Day Low":82.12,"VS Average Volume":2.0484430149,"Company Summary":"CarMax, Inc., through its subsidiaries, operates as a retailer of used vehicles and related products in the United States. It operates in two segments: CarMax Sales Operations and CarMax Auto Finance. The CarMax Sales Operations segment offers customers a range of makes and models of used vehicles, including domestic, imported, and luxury vehicles, as well as hybrid and electric vehicles; used vehicle auctions; extended protection plans to customers at the time of sale; and reconditioning and vehicle repair services. The CarMax Auto Finance segment provides financing alternatives for retail customers across a range of credit spectrum and arrangements with various financial institutions. The company was founded in 1993 and is based in Richmond, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"Lamb Weston Holdings, Inc.","Symbol":"LW","Current Price":"62.09","Latest MA":"73.47","Price Target":"70.67","Difference from MA":"-15.48%","Difference from Open":"-0.54%","Change from Yesterday":"-0.66%","Change from Last Report":"0.00","Latest Volume":"6,510,299","Market Cap":"8,856,579,072","Earning Date":"2024-12-19","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.27459,"ROE":0.37015,"DTE":221.158,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.715,"Trailing PEG":2.0946,"Trailing PE":24.444881,"Trailing PS":1.3717519,"Quick Ratio":0.486,"Day High":63.956,"Day Low":61.52,"VS Average Volume":2.4551212382,"Company Summary":"Lamb Weston Holdings, Inc. engages in the production, distribution, and marketing of frozen potato products in the United States, Canada, Mexico, and internationally. It offers frozen potatoes, commercial ingredients, and appetizers under the Lamb Weston brand, as well as under various customer labels. The company also provides its products under its owned or licensed brands, such as Grown in Idaho and Alexia, and other licensed brands, as well as under retailers' own brands. It sells its products through a network of internal sales personnel and independent brokers, agents, and distributors to quick service and full-service restaurants and chains, wholesale, grocery, mass merchants, club retailers, and specialty retailers, as well as foodservice distributors and institutions, including businesses, educational institutions, independent restaurants, regional chain restaurants, and convenience stores. The company was incorporated in 1950 and is headquartered in Eagle, Idaho.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"Darden Restaurants, Inc.","Symbol":"DRI","Current Price":"187.59","Latest MA":"156.68","Price Target":"195.44","Difference from MA":"19.73%","Difference from Open":"2.30%","Change from Yesterday":"2.26%","Change from Last Report":"0.00","Latest Volume":"2,685,841","Market Cap":"22,041,825,280","Earning Date":"2024-12-19","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":17.561136,"ROE":0.48619,"DTE":326.282,"Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":1.309,"Trailing PEG":1.9899,"Trailing PE":21.463387,"Trailing PS":1.9307159,"Quick Ratio":0.108,"Day High":188.879,"Day Low":181.09,"VS Average Volume":2.0721939244,"Company Summary":"Darden Restaurants, Inc., together with its subsidiaries, owns and operates full-service restaurants in the United States and Canada. It operates under Olive Garden, LongHorn Steakhouse, Cheddar's Scratch Kitchen, Yard House, The Capital Grille, Seasons 52, Bahama Breeze, Eddie V's Prime Seafood, and Capital Burger brand names. Darden Restaurants, Inc. was incorporated in 1995 and is based in Orlando, Florida.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"FedEx Corporation","Symbol":"FDX","Current Price":"275.73","Latest MA":"279.62","Price Target":"326.07","Difference from MA":"-1.39%","Difference from Open":"-6.21%","Change from Yesterday":"-0.05%","Change from Last Report":"0.00","Latest Volume":"6,888,730","Market Cap":"66,409,852,928","Earning Date":"2024-12-19","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":12.4645815,"ROE":0.1507,"DTE":"N\/A","Industry":"Integrated Freight & Logistics","Sector":"Industrials","Beta":1.177,"Trailing PEG":1.1255,"Trailing PE":17.60728,"Trailing PS":0.7581812,"Quick Ratio":1.152,"Day High":295.244,"Day Low":270.9,"VS Average Volume":4.0857283338,"Company Summary":"FedEx Corporation, together with its subsidiaries, provides transportation, e-commerce, and business services in the United States and internationally. It operates through FedEx Express, FedEx Ground, FedEx Freight, and FedEx Services segments. The FedEx Express segment offers express transportation, small-package ground delivery, and freight transportation services; and time-critical transportation services. The FedEx Ground segment provides small-package ground delivery services. The FedEx Freight segment offers less-than-truckload freight transportation services. The FedEx Services segment provides sales, marketing, information technology, communications, customer service, technical support, billing and collection, and back-office support services. In addition, the company offers supply chain management solutions; and air and ocean freight forwarding and cargo transportation, specialty transportation, customs brokerage, third party logistics and supply chain, and document and business solutions, as well as provides trade management tools and data. The company was founded in 1971 and is headquartered in Memphis, Tennessee.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"Lennar Corporation","Symbol":"LEN","Current Price":"138.08","Latest MA":"168.86","Price Target":"169.71","Difference from MA":"-18.23%","Difference from Open":"0.14%","Change from Yesterday":"-0.23%","Change from Last Report":"0.00","Latest Volume":"9,056,860","Market Cap":"37,306,593,280","Earning Date":"2024-12-18","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":8.730808,"ROE":0.15878001,"DTE":14.665,"Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":1.619,"Trailing PEG":1.0077,"Trailing PE":9.649197,"Trailing PS":1.0231427,"Quick Ratio":3.257,"Day High":139.89,"Day Low":136.57,"VS Average Volume":4.2301099556,"Company Summary":"Lennar Corporation, together with its subsidiaries, operates as a homebuilder primarily under the Lennar brand in the United States. It operates through Homebuilding East, Homebuilding Central, Homebuilding Texas, Homebuilding West, Financial Services, Multifamily, and Lennar Other segments. The company's homebuilding operations include the construction and sale of single-family attached and detached homes, as well as the purchase, development, and sale of residential land; and development, construction, and management of multifamily rental properties. It also offers residential mortgage financing, title, insurance, and closing services for home buyers and others, as well as originates and sells securitization commercial mortgage loans. In addition, the company is involved in the fund investment activity. It primarily serves first-time, move-up, active adult, and luxury homebuyers. Lennar Corporation was founded in 1954 and is based in Miami, Florida.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"Nike, Inc.","Symbol":"NKE","Current Price":"76.94","Latest MA":"81.39","Price Target":"85.63","Difference from MA":"-5.47%","Difference from Open":"1.29%","Change from Yesterday":"-0.21%","Change from Last Report":"0.00","Latest Volume":"33,380,631","Market Cap":"114,525,192,192","Earning Date":"2024-12-19","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":28.549273,"ROE":0.3798,"DTE":86.962,"Industry":"Footwear & Accessories","Sector":"Consumer Cyclical","Beta":1.035,"Trailing PEG":4.0079,"Trailing PE":23.746914,"Trailing PS":2.2899542,"Quick Ratio":1.417,"Day High":77.99,"Day Low":74.8587,"VS Average Volume":2.7300418331,"Company Summary":"NIKE, Inc., together with its subsidiaries, engages in the design, development, marketing, and sale of athletic footwear, apparel, equipment, accessories, and services worldwide. The company provides athletic and casual footwear, apparel, and accessories under the NIKE, Jumpman, Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks. It also sells a line of performance equipment and accessories comprising bags, sport balls, socks, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities under the NIKE brand; and various plastic products to other manufacturers. In addition, the company markets apparel with licensed college and professional team, and league logos, as well as sells sports apparel; licenses unaffiliated parties to manufacture and sell apparel, digital devices, and applications and other equipment for sports activities under NIKE-owned trademarks; and operates digital platforms, including fitness and activity apps; sport, fitness, and wellness content; and digital services and features in retail stores. It sells its products to footwear stores; sporting goods stores; athletic specialty stores; department stores; skate, tennis, and golf shops; and other retail accounts through NIKE-owned retail stores, digital platforms, independent distributors, licensees, and sales representatives. The company was founded in 1964 and is headquartered in Beaverton, Oregon.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"Carnival Corporation","Symbol":"CCL","Current Price":"26.80","Latest MA":"19.24","Price Target":"27.66","Difference from MA":"39.26%","Difference from Open":"3.96%","Change from Yesterday":"6.43%","Change from Last Report":"0.00","Latest Volume":"44,943,494","Market Cap":"35,054,399,488","Earning Date":"2024-12-20","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":13.836685,"ROE":0.20120001,"DTE":352.355,"Industry":"Travel Services","Sector":"Consumer Cyclical","Beta":2.668,"Trailing PEG":null,"Trailing PE":18.61111,"Trailing PS":1.4320192,"Quick Ratio":0.202,"Day High":27.14,"Day Low":25.44,"VS Average Volume":1.7413571914,"Company Summary":"Carnival Corporation & plc engages in the provision of leisure travel services in North America, Australia, Europe, Asia, and internationally. The company operates through four segments: NAA Cruise Operations, Europe Cruise Operations, Cruise Support, and Tour and Other. It operates port destinations, private islands, and a solar park, as well as owns and operates hotels, lodges, glass-domed railcars, and motor coaches. The company offers its services under the Carnival Cruise Line, Princess Cruises, Holland America Line, Seabourn, Costa Cruises, AIDA Cruises, P&O Cruises, and Cunard brand. Additionally, it sells its cruises primarily through travel agents, tour operators, vacation planners, and websites. Carnival Corporation & plc was founded in 1972 and is headquartered in Miami, Florida.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"Micron Technology, Inc.","Symbol":"MU","Current Price":"90.12","Latest MA":"109.64","Price Target":"133.33","Difference from MA":"-17.81%","Difference from Open":"5.52%","Change from Yesterday":"3.48%","Change from Last Report":"0.00","Latest Volume":"49,578,449","Market Cap":"100,408,999,936","Earning Date":"2024-12-18","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":9.369152,"ROE":0.01743,"DTE":31.194,"Industry":"Semiconductors","Sector":"Technology","Beta":1.179,"Trailing PEG":0.2286,"Trailing PE":25.82235,"Trailing PS":3.9986064,"Quick Ratio":1.592,"Day High":90.25,"Day Low":83.54,"VS Average Volume":2.088558185,"Company Summary":"Micron Technology, Inc. designs, develops, manufactures, and sells memory and storage products in the United States, Taiwan, Mainland China, rest of the Asia Pacific, Hong Kong, Japan, Europe, and internationally. The company operates through four segments: Compute and Networking Business Unit, Mobile Business Unit, Embedded Business Unit, and Storage Business Unit. It provides memory and storage technologies comprising dynamic random access memory semiconductor devices with low latency that provide high-speed data retrieval; non-volatile and re-writeable semiconductor storage devices; and non-volatile re-writable semiconductor memory devices that provide fast read speeds under the Micron and Crucial brands, as well as through private labels. The company offers serves the data center, PC, graphics, networking, automotive, industrial, and consumer embedded markets, as well as for smartphone and other mobile-device markets. It markets its products through its direct sales force, independent sales representatives, distributors, and retailers; and web-based customer direct sales channel, as well as through channel and distribution partners. Micron Technology, Inc. was founded in 1978 and is headquartered in Boise, Idaho.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"Accenture plc","Symbol":"ACN","Current Price":"366.37","Latest MA":"334.78","Price Target":"400.55","Difference from MA":"9.44%","Difference from Open":"-1.17%","Change from Yesterday":"-1.56%","Change from Last Report":"0.00","Latest Volume":"6,982,683","Market Cap":"229,157,109,760","Earning Date":"2024-12-19","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":26.254763,"ROE":0.26674998,"DTE":14.127,"Industry":"Information Technology Services","Sector":"Technology","Beta":1.245,"Trailing PEG":2.2934,"Trailing PE":30.684256,"Trailing PS":3.5311186,"Quick Ratio":0.984,"Day High":372.07,"Day Low":362.0,"VS Average Volume":2.7455456091,"Company Summary":"Accenture plc provides strategy and consulting, industry X, song, and technology and operation services in North America, Europe, the Middle East, Africa, and internationally. It offers systems integration and application management; security; intelligent platform; infrastructure; software engineering; data and AI; and automation services. The company also operates business processes; and designs, manufactures, and assembles automation equipment, robotics, and other commercial hardware products. It serves communications, media, and technology; banking and capital markets, and insurance; health and public service; consumer goods, retail, travel services; industrial; life science; chemicals, natural resources, energy, and utilities sectors. It has collaboration agreement with Kyoto University to advance learning, research, and innovation in human-centered  AI. The company was founded in 1951 and is based in Dublin, Ireland.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"Jabil Inc.","Symbol":"JBL","Current Price":"145.00","Latest MA":"118.30","Price Target":"165.13","Difference from MA":"22.57%","Difference from Open":"3.59%","Change from Yesterday":"3.25%","Change from Last Report":"0.00","Latest Volume":"6,852,215","Market Cap":"16,195,484,672","Earning Date":"2024-12-18","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":18.800867,"ROE":0.60295,"DTE":207.887,"Industry":"Electronic Components","Sector":"Technology","Beta":1.245,"Trailing PEG":null,"Trailing PE":13.705104,"Trailing PS":0.56072724,"Quick Ratio":0.58,"Day High":145.75,"Day Low":139.98,"VS Average Volume":4.9166061558,"Company Summary":"Jabil Inc. provides manufacturing services and solutions worldwide. It operates in two segments, Electronics Manufacturing Services and Diversified Manufacturing Services. The company offers electronics design, production, and product management services; electronic circuit design services, such as application-specific integrated circuit design, firmware development, and rapid prototyping services; and designs plastic and metal enclosures that include the electro-mechanics, such as the printed circuit board assemblies (PCBA). It also provides three-dimensional mechanical design comprising the analysis of electronic, electro-mechanical, and optical assemblies, as well as various industrial design, mechanism development, and tooling management services. In addition, the company provides computer-assisted design services consisting of PCBA design, as well as PCBA design validation and verification services; and other consulting services, such as the generation of a bill of materials, approved vendor list, and assembly equipment configuration for various PCBA designs. Further, it offers product and process validation services, such as product system, product safety, regulatory compliance, and reliability tests, as well as manufacturing test solution development services. Additionally, the company provides systems assembly, test, direct-order fulfillment, and configure-to-order services. It serves 5G, wireless and cloud, digital print and retail, industrial and semi-cap, networking and storage, automotive and transportation, connected devices, healthcare and packaging, and mobility industries. The company was formerly known as Jabil Circuit, Inc. and changed its name to Jabil Inc. in June 2017. Jabil Inc. was founded in 1966 and is headquartered in Saint Petersburg, Florida.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"Adobe Inc.","Symbol":"ADBE","Current Price":"447.17","Latest MA":"518.51","Price Target":"588.34","Difference from MA":"-13.76%","Difference from Open":"3.07%","Change from Yesterday":"2.24%","Change from Last Report":"0.00","Latest Volume":"8,091,947","Market Cap":"196,844,240,896","Earning Date":"2024-12-11","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":24.547848,"ROE":0.35355,"DTE":41.788,"Industry":"Software—Infrastructure","Sector":"Technology","Beta":1.299,"Trailing PEG":1.4631,"Trailing PE":36.23744,"Trailing PS":9.397252,"Quick Ratio":0.966,"Day High":451.18,"Day Low":433.01,"VS Average Volume":2.3323637185,"Company Summary":"Adobe Inc., together with its subsidiaries, operates as a diversified software company worldwide. It operates through three segments: Digital Media, Digital Experience, and Publishing and Advertising. The Digital Media segment offers products, services, and solutions that enable individuals, teams, and enterprises to create, publish, and promote content; and Document Cloud, a unified cloud-based document services platform. Its flagship product is Creative Cloud, a subscription service that allows members to access its creative products. This segment serves content creators, students, workers, marketers, educators, enthusiasts, and communicators. The Digital Experience segment provides an integrated platform and set of applications and services that enable brands and businesses to create, manage, execute, measure, monetize, and optimize customer experiences from analytics to commerce. This segment serves marketers, advertisers, agencies, publishers, merchandisers, merchants, web analysts, data scientists, developers, and executives across the C-suite. The Publishing and Advertising segment offers products and services, such as e-learning solutions, technical document publishing, web conferencing, document and forms platform, web application development, and high-end printing, as well as Advertising Cloud offerings. It also provides consulting, technical support, and learning services. The company offers its products and services directly to enterprise customers through its sales force and local field offices, as well as to end users through app stores and through its website at adobe.com. It also distributes products and services through distributors, value-added resellers, systems integrators, software vendors and developers, retailers, and original equipment manufacturers. The company was formerly known as Adobe Systems Incorporated and changed its name to Adobe Inc. in October 2018. Adobe Inc. was founded in 1982 and is headquartered in San Jose, California.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"ConAgra Brands, Inc.","Symbol":"CAG","Current Price":"27.11","Latest MA":"29.57","Price Target":"29.67","Difference from MA":"-8.33%","Difference from Open":"1.46%","Change from Yesterday":"1.12%","Change from Last Report":"0.00","Latest Volume":"14,502,479","Market Cap":"12,940,145,664","Earning Date":"2024-12-19","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.478752,"ROE":0.05605,"DTE":100.881,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.332,"Trailing PEG":0.3254,"Trailing PE":26.320389,"Trailing PS":1.083601,"Quick Ratio":0.291,"Day High":27.24,"Day Low":26.72,"VS Average Volume":2.8210466628,"Company Summary":"Conagra Brands, Inc., together with its subsidiaries, operates as a consumer packaged goods food company primarily in the United States. The company operates through four segments: Grocery & Snacks, Refrigerated & Frozen, International, and Foodservice. The Grocery & Snacks segment primarily offers shelf stable food products through various retail channels. The Refrigerated & Frozen segment provides temperature-controlled food products through various retail channels. The International segment offers food products in various temperature states through retail and foodservice channels outside of the United States. The Foodservice segment offers branded and customized food products, including meals, entrees, sauces, and various custom-manufactured culinary products packaged for restaurants and other foodservice establishments. The company sells its products under the Birds Eye, Marie Callender's, Duncan Hines, Healthy Choice, Slim Jim, Reddi-wip, Angie's, BOOMCHICKAPOP brands. The company was incorporated in 1919 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"Birkenstock Holding plc","Symbol":"BIRK","Current Price":"60.40","Latest MA":"52.91","Price Target":"68.90","Difference from MA":"14.17%","Difference from Open":"6.02%","Change from Yesterday":"4.88%","Change from Last Report":"0.00","Latest Volume":"2,428,251","Market Cap":"11,344,871,424","Earning Date":"2024-12-18","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":27.73301,"ROE":0.04422,"DTE":57.584,"Industry":"Footwear & Accessories","Sector":"Consumer Cyclical","Beta":"N\/A","Trailing PEG":null,"Trailing PE":56.448597,"Trailing PS":6.582579,"Quick Ratio":1.413,"Day High":61.03,"Day Low":56.4737,"VS Average Volume":1.9482694849,"Company Summary":"Birkenstock Holding plc manufactures and sells footwear products. It also offers sandals, shoes, closed-toe silhouettes, skincare products, and accessories. The company sells its products through e-commerce sites and a network of owned retail stores, as well as business-to-business channels. It operates in the United States, Brazil, Canada, Mexico, Europe, APMA, and internationally. Birkenstock Holding plc was founded in 1774 and is based in London, the United Kingdom. Birkenstock Holding plc operates as a subsidiary of BK LC Lux MidCo S.à r.l.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"General Mills, Inc.","Symbol":"GIS","Current Price":"63.61","Latest MA":"68.17","Price Target":"70.72","Difference from MA":"-6.69%","Difference from Open":"-1.09%","Change from Yesterday":"-0.62%","Change from Last Report":"0.00","Latest Volume":"4,787,855","Market Cap":"35,063,803,904","Earning Date":"2024-12-18","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.851175,"ROE":0.24168,"DTE":139.823,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.107,"Trailing PEG":3.3655,"Trailing PE":13.828261,"Trailing PS":1.7708455,"Quick Ratio":0.317,"Day High":64.5,"Day Low":63.33,"VS Average Volume":1.2079905901,"Company Summary":"General Mills, Inc. manufactures and markets branded consumer foods worldwide. The company operates through four segments: North America Retail; International; Pet; and North America Foodservice. It offers grain, ready-to-eat cereals, refrigerated yogurt, soup, meal kits, refrigerated and frozen dough products, dessert and baking mixes, bakery flour, frozen pizza and pizza snacks, snack bars, fruit and savory snacks, ice cream and frozen desserts, unbaked and fully baked frozen dough products, frozen hot snacks, ethnic meals, side dish mixes, frozen breakfast and entrees, nutrition bars, and frozen and shelf-stable vegetables. The company also manufactures and markets pet food products, including dog and cat food; and operates ice cream parlors. It markets its products under the Annie's, Betty Crocker, Bisquick, Blue Buffalo, Bugles, Cascadian Farm, Cheerios, Chex, Cinnamon Toast Crunch, Cocoa Puffs, Cookie Crisp, Dunkaroos, Edgard & Cooper, Fiber One, Fruit by the Foot, Fruit Gushers, Fruit Roll-Ups, Gardetto's, Gold Medal, Golden Grahams, Häagen-Dazs, Kitano, Kix, Lärabar, Latina, Lucky Charms, Muir Glen, Nature Valley, Nudges, Oatmeal Crisp, Old El Paso, Pillsbury, Progresso, Tastefuls, Total, Totino's , Trix, True Chews, True Solutions, Wanchai Ferry, Wheaties, Wilderness, and Yoki brands. The company sells its products to grocery stores, mass merchandisers, membership stores, natural food chains, drug, dollar and discount chains, e-commerce retailers, commercial and noncommercial foodservice distributors and operators, restaurants, convenience stores, and pet specialty stores. General Mills, Inc. was founded in 1866 and is headquartered in Minneapolis, Minnesota.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"ABM Industries Incorporated","Symbol":"ABM","Current Price":"50.34","Latest MA":"52.91","Price Target":"58.83","Difference from MA":"-4.86%","Difference from Open":"-0.61%","Change from Yesterday":"-1.56%","Change from Last Report":"0.00","Latest Volume":"1,220,810","Market Cap":"3,131,319,040","Earning Date":"2024-12-18","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.305387,"ROE":0.08438,"DTE":79.531,"Industry":"Specialty Business Services","Sector":"Industrials","Beta":1.132,"Trailing PEG":null,"Trailing PE":39.328125,"Trailing PS":0.3784117,"Quick Ratio":1.253,"Day High":51.24,"Day Low":50.29,"VS Average Volume":2.994339058,"Company Summary":"ABM Industries Incorporated, through its subsidiaries, engages in the provision of integrated facility, infrastructure, and mobility solutions in the United States and internationally. It operates through Business & Industry, Manufacturing & Distribution, Education, Aviation, and Technical Solutions segments. The company offers janitorial, facilities engineering, and parking services for commercial real estate properties, including corporate offices for high tech clients, sports and entertainment venues, and traditional hospitals and non-acute healthcare facilities; provides vehicle maintenance and other services to rental car providers. It also offers integrated facility services, engineering, and other specialized services in various types of manufacturing, distribution, and data center facilities. In addition, the company delivers custodial and landscaping and grounds for public school districts, private schools, colleges, and universities. Further, it supports airlines and airports with services comprising passenger assistance, catering logistics, air cabin maintenance, and transportation services. Additionally, the company provides electric vehicle power design, installation, and maintenance, as well as microgrid systems installations. ABM Industries Incorporated was founded in 1909 and is headquartered in New York, New York.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"Toro Company (The)","Symbol":"TTC","Current Price":"81.48","Latest MA":"87.57","Price Target":"95.00","Difference from MA":"-6.95%","Difference from Open":"0.70%","Change from Yesterday":"0.48%","Change from Last Report":"0.00","Latest Volume":"2,236,320","Market Cap":"8,244,472,832","Earning Date":"2024-12-18","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":17.314068,"ROE":0.2565,"DTE":67.875,"Industry":"Tools & Accessories","Sector":"Industrials","Beta":0.694,"Trailing PEG":null,"Trailing PE":20.319202,"Trailing PS":1.8357767,"Quick Ratio":0.765,"Day High":82.58,"Day Low":80.91,"VS Average Volume":2.8563035321,"Company Summary":"The Toro Company designs, manufactures, markets, and sells professional turf maintenance equipment and services. It operates through two segments: Professional and Residential. The Professional segment offers turf and landscape equipment products, including sports fields and grounds mowing and maintenance equipment, golf course mowing and maintenance equipment, landscape contractor mowing equipment, landscape creation and renovation equipment, and other maintenance equipment; rental, specialty, and underground construction equipment, such as horizontal directional drills, walk and ride trenchers, stand-on skid steers, vacuum excavators, stump grinders, turf renovation products, asset locators, pipe rehabilitation solutions, materials handling equipment, and other after-market tools; and snow and ice management equipment, such as snowplows, as well as stand-on snow and ice removal equipment, such as snowplow, snow brush, and snow thrower attachments, salt and sand spreaders, and related parts and accessories for light and medium duty trucks, utility task vehicles, skid steers, and front-end loaders. This segment also provides irrigation and lighting products that consist of sprinkler heads, electric and hydraulic valves, controllers, computer irrigation central control systems, coupling systems, and ag-irrigation drip tape and hose products, as well as professionally installed landscape lighting products offered through distributors and landscape contractors. The Residential segment provides walk power mowers, zero-turn riding mowers, snow throwers, replacement parts, and home solution products that include grass and hedge trimmers, leaf blowers, blower-vacuums, chainsaws, string trimmers, hoses, and hose-end retail irrigation products. It sells its products through a network of distributors, dealers, mass retailers, hardware retailers, equipment rental centers, home centers, and online. The company was founded in 1914 and is headquartered in Bloomington, Minnesota.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"Heico Corporation","Symbol":"HEI","Current Price":"238.94","Latest MA":"245.75","Price Target":"276.31","Difference from MA":"-2.77%","Difference from Open":"0.93%","Change from Yesterday":"0.53%","Change from Last Report":"0.00","Latest Volume":"620,383","Market Cap":"28,823,093,248","Earning Date":"2024-12-17","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":49.07474,"ROE":0.14435,"DTE":57.539,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.237,"Trailing PEG":3.826,"Trailing PE":64.929344,"Trailing PS":7.624247,"Quick Ratio":1.355,"Day High":240.29,"Day Low":233.79,"VS Average Volume":1.3450387869,"Company Summary":"HEICO Corporation, through its subsidiaries, designs, manufactures, and sells aerospace, defense, and electronic related products and services in the United States and internationally. Its Flight Support Group segment provides jet engine and aircraft component replacement parts; thermal insulation blankets and parts; renewable\/reusable insulation systems; and specialty components. This segment also distributes hydraulic, pneumatic, structural, interconnect, mechanical, and electro-mechanical components for the commercial, regional, and general aviation markets; and offers repair and overhaul services for jet engine and aircraft component parts, avionics, instruments, composites, and flight surfaces of commercial aircraft, as well as for avionics and navigation systems, and other instruments utilized on military aircraft. The company's Electronic Technologies Group segment provides electro-optical infrared simulation and test equipment; electro-optical laser products; electro-optical, microwave, and other power equipment; electromagnetic and radio frequency (RF) interference shielding and suppression filters; power conversion and interface; interconnection devices; and underwater locator beacons and emergency locator transmission beacons. This segment also offers traveling wave tube amplifiers and microwave power modules; memory products and specialty semiconductors; harsh environment connectivity products and custom molded cable assemblies; RF and microwave products; communications and electronic intercept receivers and tuners; self-sealing auxiliary fuel systems; active antenna systems and airborne antennas; nuclear radiation detectors; silicone products; power amplifiers; ceramic-to-metal feedthroughs and connectors; technical surveillance countermeasures equipment; RF receivers and sources; embedded computing solutions; test sockets and adapters; and radiation assurance services. The company was incorporated in 1957 and is headquartered in Hollywood, Florida.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"Broadcom Inc.","Symbol":"AVGO","Current Price":"220.79","Latest MA":"165.92","Price Target":"242.35","Difference from MA":"33.07%","Difference from Open":"0.20%","Change from Yesterday":"1.13%","Change from Last Report":"0.00","Latest Volume":"130,578,098","Market Cap":"1,031,217,348,608","Earning Date":"2024-12-12","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":42.14547,"ROE":0.12509,"DTE":166.032,"Industry":"Semiconductors","Sector":"Technology","Beta":1.187,"Trailing PEG":0.6259,"Trailing PE":172.49219,"Trailing PS":22.0275,"Quick Ratio":0.841,"Day High":230.29,"Day Low":218.91,"VS Average Volume":4.8394846174,"Company Summary":"Broadcom Inc. designs, develops, and supplies various semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products worldwide. The company operates in two segments, Semiconductor Solutions and Infrastructure Software. It provides set-top box system-on-chips (SoCs); cable, digital subscriber line, and passive optical networking central office\/consumer premise equipment SoCs; wireless local area network access point SoCs; Ethernet switching and routing custom silicon solutions; serializer\/deserializer application specific integrated circuits; optical and copper, and physical layer devices; and fiber optic components and RF semiconductor devices. The company also offers RF front end modules and filter; Wi-Fi, Bluetooth, and global positioning system\/global navigation satellite system SoCs; custom touch controllers; inductive charging; attached small computer system interface, and redundant array of independent disks controllers and adapters; peripheral component interconnect express; fiber channel host bus adapters; read channel based SoCs; custom flash controllers; preamplifiers; optocouplers, industrial fiber optics, and motion control encoders and subsystems; light emitting diode, ethernet PHYs, switch ICs, and camera microcontrollers. Its products are used in various applications, including enterprise and data center networking, home connectivity, set-top boxes, broadband access, telecommunication equipment, smartphones and base stations, data center servers and storage systems, factory automation, power generation and alternative energy systems, and electronic displays. Broadcom Inc. was founded in 1961 and is headquartered in Palo Alto, California.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"Costco Wholesale Corporation","Symbol":"COST","Current Price":"954.07","Latest MA":"884.38","Price Target":"1,035.27","Difference from MA":"7.88%","Difference from Open":"0.49%","Change from Yesterday":"-0.08%","Change from Last Report":"0.00","Latest Volume":"5,373,797","Market Cap":"423,510,736,896","Earning Date":"2024-12-12","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":47.798378,"ROE":0.30267,"DTE":42.118,"Industry":"Discount Stores","Sector":"Consumer Defensive","Beta":0.789,"Trailing PEG":5.8212,"Trailing PE":56.18787,"Trailing PS":1.6643966,"Quick Ratio":0.391,"Day High":961.9414,"Day Low":943.05,"VS Average Volume":2.7669633515,"Company Summary":"Costco Wholesale Corporation, together with its subsidiaries, engages in the operation of membership warehouses in the United States, Puerto Rico, Canada, Mexico, Japan, the United Kingdom, Korea, Australia, Taiwan, China, Spain, France, Iceland, New Zealand, and Sweden. The company offers branded and private-label products in a range of merchandise categories. It offers merchandise, such as sundries, dry groceries, candies, coolers, freezers, deli, liquor, and tobacco; appliances, electronics, health and beauty aids, hardware, lawn and garden, sporting goods, tires, toys and seasonal products, office supplies, automotive care products, postages, tickets, apparel, small appliances, furniture, domestics, housewares, special order kiosks, and jewelry; and meat, produce, service deli, and bakery products. The company also operates gasoline, pharmacies, optical, food courts, hearing-aid centers, and tire installation centers; and offers business delivery, travel, grocery, and various other services online. It also operates e-commerce websites. The company was formerly known as Costco Companies, Inc. and changed its name to Costco Wholesale Corporation in August 1999. Costco Wholesale Corporation was founded in 1976 and is based in Issaquah, Washington.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"Nordson Corporation","Symbol":"NDSN","Current Price":"209.73","Latest MA":"244.80","Price Target":"259.17","Difference from MA":"-14.32%","Difference from Open":"1.25%","Change from Yesterday":"0.38%","Change from Last Report":"0.00","Latest Volume":"920,942","Market Cap":"11,957,965,824","Earning Date":"2024-12-11","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":21.023457,"ROE":0.17406,"DTE":56.526,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":0.907,"Trailing PEG":1.6679,"Trailing PE":25.828817,"Trailing PS":4.487459,"Quick Ratio":1.358,"Day High":213.865,"Day Low":207.15,"VS Average Volume":3.3494524519,"Company Summary":"Nordson Corporation engineers, manufactures, and markets products and systems to dispense, apply, and control adhesives, coatings, polymers, sealants, biomaterials, and other fluids worldwide. It operates through three segments: Industrial Precision Solutions; Medical and Fluid Solutions; and Advanced Technology Solutions. The Industrial Precision Solutions segment provides dispensing, coating, and laminating systems for adhesives, lotions, liquids, and fibers to disposable products and roll goods; automated adhesive dispensing systems used in packaged goods industries; components and systems used in the thermoplastic and biopolymer melt stream; precision agriculture spraying solutions; fluid components, such as nozzles, pumps, and filters; and product assembly systems for use in paper and paperboard converting applications, and manufacturing roll goods. It also offers automated and manual dispensing products and systems for cold materials, container coating, liquid finishing, and powder coating, as well as ultraviolet equipment used primarily in curing and drying operations. The Medical and Fluid Solutions segment offers medical devices, including cannulas, catheters, and medical balloons; single-use plastic components; precision manual and semi-automated dispensers; minimally invasive interventional delivery devices; and plastic molded syringes, cartridges, tips, and fluid connection components. The Advanced Technology Solutions segment provides automated dispensing systems for the attachment, protection, and coating of fluids, as well as related gas plasma treatment systems for cleaning and conditioning surfaces; and bond testing and automated optical, acoustic microscopy, and x-ray inspection systems for use in semiconductor and printed circuit board industries. The company markets its products through direct sales force, as well as distributors and sales representatives. Nordson Corporation was founded in 1909 and is headquartered in Westlake, Ohio.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"Ciena Corporation","Symbol":"CIEN","Current Price":"87.38","Latest MA":"58.57","Price Target":"87.93","Difference from MA":"49.18%","Difference from Open":"2.98%","Change from Yesterday":"1.85%","Change from Last Report":"0.00","Latest Volume":"3,838,621","Market Cap":"12,465,281,024","Earning Date":"2024-12-12","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":41.462822,"ROE":0.047319997,"DTE":55.23,"Industry":"Communication Equipment","Sector":"Technology","Beta":0.938,"Trailing PEG":null,"Trailing PE":150.65517,"Trailing PS":3.1005616,"Quick Ratio":2.511,"Day High":89.22,"Day Low":84.54,"VS Average Volume":1.8025435325,"Company Summary":"Ciena Corporation provides hardware and software services for delivery of video, data, and voice traffic metro, aggregation, and access communications network worldwide. The company's Networking Platforms segment offers convergence of coherent optical transport, open optical networking, optical transport network switching, IP routing, and switching services. Its products include 6500 Packet-Optical Platform, Waveserver stackable interconnect system, and the 6500 Reconfigurable line system, and the 5400 family of Packet-Optical platforms, as well as 8100 coherent routing platforms; 3000 family of service delivery switches and the 5000 family of service aggregation switches, as well as 8700 Packetwave Platform and 6500 Packet Transport System. This segment also sells operating system software and enhanced software features embedded in each of its products. The company's Blue Planet Automation Software and Services segment provides multi-domain service orchestration, inventory, route optimization and analysis, multi-cloud orchestration, and unified assurance and analytics services. Its Platform Software and Service segment offers MCP domain controller solution, and OneControl unified management system, as well as planning tools. The company's Global Services segment provides maintenance support and training, installation and deployment, and consulting and network design services. Ciena Corporation was incorporated in 1992 and is headquartered in Hanover, Maryland.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"Ollie's Bargain Outlet Holdings","Symbol":"OLLI","Current Price":"117.91","Latest MA":"95.16","Price Target":"124.47","Difference from MA":"23.91%","Difference from Open":"0.63%","Change from Yesterday":"0.24%","Change from Last Report":"0.00","Latest Volume":"1,985,602","Market Cap":"7,225,159,680","Earning Date":"2024-12-10","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":31.47515,"ROE":0.13548,"DTE":31.499,"Industry":"Discount Stores","Sector":"Consumer Defensive","Beta":0.844,"Trailing PEG":null,"Trailing PE":35.092262,"Trailing PS":3.2601686,"Quick Ratio":1.19,"Day High":120.03,"Day Low":116.35,"VS Average Volume":1.7766899162,"Company Summary":"Ollie's Bargain Outlet Holdings, Inc. operates as a retailer of brand name merchandise in the United States. The company offers housewares, bed and bath, food, floor coverings, health and beauty aids, books and stationery, toys, and electronics; and other products, including hardware, candy, clothing, sporting goods, pet and lawn, and garden products. It provides its products primarily under the Ollie's, Ollie's Bargain Outlet, Good Stuff Cheap, Ollie's Army, Real Brands Real Cheap!, Real Brands! Real Bargains, Sarasota Breeze, Steelton Tools, American Way, and Middleton Home names. The company was formerly known as Bargain Holdings, Inc. and changed its name to Ollie's Bargain Outlet Holdings, Inc. in March 2015. The company was founded in 1982 and is headquartered in Harrisburg, Pennsylvania.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"Toll Brothers, Inc.","Symbol":"TOL","Current Price":"125.45","Latest MA":"138.42","Price Target":"161.71","Difference from MA":"-9.37%","Difference from Open":"1.33%","Change from Yesterday":"1.33%","Change from Last Report":"0.00","Latest Volume":"3,411,243","Market Cap":"12,518,404,096","Earning Date":"2024-12-09","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":7.8284807,"ROE":0.21799,"DTE":39.692,"Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":1.671,"Trailing PEG":1.0183,"Trailing PE":8.363333,"Trailing PS":1.1884457,"Quick Ratio":0.389,"Day High":125.875,"Day Low":122.86,"VS Average Volume":2.6322294344,"Company Summary":"Toll Brothers, Inc., together with its subsidiaries, designs, builds, markets, sells, and arranges finance for a range of detached and attached homes in luxury residential communities in the United States. It designs, builds, markets, and sells condominiums through Toll Brothers City Living. The company also develops a range of single-story living and first-floor primary bedroom suite home designs, as well as communities with recreational amenities, such as golf courses, marinas, pool complexes, country clubs, and fitness and recreation centers; and develops, operates, and rents apartments. In addition, it provides various interior fit-out options, such as flooring, wall tile, plumbing, cabinets, fixtures, appliances, lighting, and home-automation and security technologies. Further, the company owns and operates architectural, engineering, mortgage, title, land development, insurance, smart home technology, landscaping, lumber distribution, house component assembly, and component manufacturing operations. It serves luxury first-time, move-up, empty-nester, active-adult, and second-home buyers. Toll Brothers, Inc. was founded in 1967 and is headquartered in Fort Washington, Pennsylvania.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"Ferguson Enterprises Inc.","Symbol":"FERG","Current Price":"178.17","Latest MA":"201.82","Price Target":"226.18","Difference from MA":"-11.72%","Difference from Open":"3.40%","Change from Yesterday":"1.95%","Change from Last Report":"0.00","Latest Volume":"3,703,867","Market Cap":"35,756,224,512","Earning Date":"2024-12-10","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":17.25594,"ROE":0.32573003,"DTE":98.237,"Industry":"Industrial Distribution","Sector":"Industrials","Beta":1.2,"Trailing PEG":1.4889,"Trailing PE":21.363308,"Trailing PS":1.2065538,"Quick Ratio":0.8,"Day High":178.44,"Day Low":172.0,"VS Average Volume":2.2507124879,"Company Summary":"Ferguson Enterprises Inc. distributes plumbing and heating products in the United States and Canada. The company provides expertise, solutions, and products, including infrastructure, plumbing, appliances, fire, and fabrication, as well as heating, ventilation, and air conditioning (HVAC) to residential and non-residential customers. It also supplies specialist water and wastewater treatment products to residential, commercial, and infrastructure contractors, as well as supplies pipe, valves, and fittings solutions to industrial customers. In addition, it offers customized solutions, such as virtual design, fabrication, valve actuation, pre-assembly, kitting, installation, and project management services, as well as after-sales support that comprises warranty, credit, project-based billing, returns and maintenance, and repair and operations support. The company sells its products through a network of distribution centers, branches, counter service and specialist sales associates, showroom consultants, and e-commerce channels. Ferguson Enterprises Inc. was founded in 1953 and is headquartered in Newport News, Virginia.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"Oracle Corporation","Symbol":"ORCL","Current Price":"169.66","Latest MA":"155.16","Price Target":"197.07","Difference from MA":"9.34%","Difference from Open":"1.15%","Change from Yesterday":"0.52%","Change from Last Report":"0.00","Latest Volume":"13,608,685","Market Cap":"474,532,249,600","Earning Date":"2024-12-09","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":32.267452,"ROE":1.55578,"DTE":749.978,"Industry":"Software—Infrastructure","Sector":"Technology","Beta":1.013,"Trailing PEG":1.8299,"Trailing PE":41.481663,"Trailing PS":8.817843,"Quick Ratio":0.591,"Day High":171.26,"Day Low":165.63,"VS Average Volume":1.7358906668,"Company Summary":"Oracle Corporation offers products and services that address enterprise information technology environments worldwide. Its Oracle cloud software as a service offering include various cloud software applications, including Oracle Fusion cloud enterprise resource planning (ERP), Oracle Fusion cloud enterprise performance management, Oracle Fusion cloud supply chain and manufacturing management, Oracle Fusion cloud human capital management, Oracle Cerner healthcare, and NetSuite applications suite, as well as Oracle Fusion Sales, Service, and Marketing. The company also offers cloud-based industry solutions for various industries; Oracle application licenses; and Oracle license support services. In addition, it provides cloud and license business' infrastructure technologies, such as the Oracle Database and MySQL Database; Java, a software development language; and middleware, including development tools and others. The company's cloud and license business' infrastructure technologies also comprise cloud-based compute, storage, and networking capabilities; and Oracle autonomous database and MySQL HeatWave, as well as Internet-of-Things, digital assistant, and blockchain. Further, it provides hardware products and other hardware-related software offerings, including Oracle engineered systems, enterprise servers, storage solutions, industry-specific hardware, virtualization software, operating systems, management software, and related hardware services, as well as hardware support products; and consulting and customer services. The company markets and sells its cloud, license, hardware, support, and services offerings directly to businesses in various industries, government agencies, and educational institutions, as well as through indirect channels. Oracle Corporation was founded in 1977 and is headquartered in Austin, Texas.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"Prosperity Bancshares, Inc.","Symbol":"PB","Current Price":"74.95","Latest MA":"70.99","Price Target":"89.50","Difference from MA":"5.58%","Difference from Open":"1.97%","Change from Yesterday":"1.13%","Change from Last Report":"0.00","Latest Volume":"1,313,926","Market Cap":"7,140,089,344","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":12.950256,"ROE":0.0618,"DTE":"N\/A","Industry":"Banks—Regional","Sector":"Financial Services","Beta":0.906,"Trailing PEG":null,"Trailing PE":15.980809,"Trailing PS":6.2132144,"Quick Ratio":"N\/A","Day High":76.01,"Day Low":73.5,"VS Average Volume":2.4711281128,"Company Summary":"Prosperity Bancshares, Inc. operates as bank holding company for the Prosperity Bank that provides financial products and services to businesses and consumers. It accepts various deposit products, such as demand, savings, money market, and time accounts, as well as and certificates of deposit. The company also offers 1-4 family residential mortgage, commercial real estate and multifamily residential, commercial and industrial, agricultural, and non-real estate agricultural loans, as well as construction, land development, and other land loans; consumer loans, including automobile, recreational vehicle, boat, home improvement, personal, and deposit account collateralized loans; term loans and lines of credit; and consumer durables and home equity loans, as well as loans for working capital, business expansion, and purchase of equipment and machinery. In addition, it provides internet banking, mobile banking, trust and wealth management, retail brokerage, mortgage services, and treasury management, as well as debit and credit cards. The company was incorporated in 1983 and is headquartered in Houston, Texas.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"MongoDB, Inc.","Symbol":"MDB","Current Price":"245.63","Latest MA":"270.97","Price Target":"379.52","Difference from MA":"-9.35%","Difference from Open":"1.89%","Change from Yesterday":"0.26%","Change from Last Report":"0.00","Latest Volume":"3,307,375","Market Cap":"18,292,213,760","Earning Date":"2024-12-09","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":-78.287445,"ROE":-0.19561,"DTE":89.869,"Industry":"Software—Infrastructure","Sector":"Technology","Beta":1.153,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":10.052821,"Quick Ratio":4.76,"Day High":248.57,"Day Low":239.76,"VS Average Volume":1.8732353682,"Company Summary":"MongoDB, Inc., together with its subsidiaries, provides general purpose database platform worldwide. The company provides MongoDB Atlas, a hosted multi-cloud database-as-a-service solution; MongoDB Enterprise Advanced, a commercial database server for enterprise customers to run in the cloud, on-premises, or in a hybrid environment; and Community Server, a free-to-download version of its database, which includes the functionality that developers need to get started with MongoDB. It offers professional services comprising consulting and training. The company was formerly known as 10gen, Inc. and changed its name to MongoDB, Inc. in August 2013. MongoDB, Inc. was incorporated in 2007 and is headquartered in New York, New York.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"ResMed Inc.","Symbol":"RMD","Current Price":"237.27","Latest MA":"227.46","Price Target":"259.55","Difference from MA":"4.31%","Difference from Open":"2.71%","Change from Yesterday":"2.46%","Change from Last Report":"0.00","Latest Volume":"3,053,157","Market Cap":"34,830,286,848","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":23.865685,"ROE":0.23565,"DTE":16.366,"Industry":"Medical Instruments & Supplies","Sector":"Healthcare","Beta":0.687,"Trailing PEG":1.8008,"Trailing PE":31.42649,"Trailing PS":7.2450123,"Quick Ratio":1.435,"Day High":238.53,"Day Low":231.0,"VS Average Volume":3.2169106181,"Company Summary":"ResMed Inc. develops, manufactures, distributes, and markets medical devices and cloud-based software applications for the healthcare markets. The company operates in two segments, Sleep and Respiratory Care, and Software as a Service. It offers various products and solutions for a range of respiratory disorders, including ApneaLink Air, a portable diagnostic device that measures oximetry, respiratory effort, pulse, nasal flow, and snoring; and NightOwl, a portable, cloud-connected, and disposable diagnostic device that measures AHI based on derived peripheral arterial tone, actigraphy, and oximetry over several nights. The company also provides AirView, a cloud-based system that enables remote monitoring and changing of patients' device settings; myAir, a personalized therapy management application for patients with sleep apnea that provides support, education, and troubleshooting tools for increased patient engagement and improved compliance; U-Sleep, a compliance monitoring solution that enables home medical equipment (HME) to streamline their sleep programs; connectivity module and propeller solutions; and Propeller portal. It offers out-of-hospital software solution, such as Brightree business management software and service solutions to providers of HME, pharmacy, home infusion, orthotics, and prosthetics services; MatrixCare care management and related ancillary solutions to senior living, skilled nursing, life plan communities, home health, home care, and hospice organizations, as well as related accountable care organizations; HEALTHCAREfirst that offers electronic health record, software, billing and coding services, and analytics for home health and hospice agencies; and MEDIFOX DAN's software solutions. The company markets its products to sleep clinics, home healthcare dealers, and hospitals through a network of distributors and direct sales force. ResMed Inc. was founded in 1989 and is headquartered in San Diego, California.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"Lam Research Corporation","Symbol":"LRCX","Current Price":"71.79","Latest MA":"85.20","Price Target":"93.98","Difference from MA":"-15.74%","Difference from Open":"1.47%","Change from Yesterday":"0.81%","Change from Last Report":"0.00","Latest Volume":"29,404,476","Market Cap":"92,371,476,480","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":17.292961,"ROE":0.49116,"DTE":58.827,"Industry":"Semiconductor Equipment & Materials","Sector":"Technology","Beta":1.486,"Trailing PEG":1.38,"Trailing PE":23.233011,"Trailing PS":5.9245524,"Quick Ratio":1.685,"Day High":73.475,"Day Low":70.3,"VS Average Volume":2.3540070148,"Company Summary":"Lam Research Corporation designs, manufactures, markets, refurbishes, and services semiconductor processing equipment used in the fabrication of integrated circuits. The company offers ALTUS systems to deposit conformal films for tungsten metallization applications; SABRE electrochemical deposition products for copper interconnect transition that offers copper damascene manufacturing; and VECTOR plasma-enhanced CVD products. It also provides SPEED gapfill high-density plasma chemical vapor deposition products; and Striker single-wafer atomic layer deposition products for dielectric film solutions. In addition, the company offers Flex for dielectric etch applications; Vantex, a dielectric etch system that provides RF technology and repeatable wafer-to-wafer performance enabled by Equipment Intelligence solutions; Kiyo for conductor etch applications; Syndion for through-silicon via etch applications; and Versys metal products for metal etch processes. Further, it provides Coronus bevel clean products to enhance die yield; and Da Vinci, DV-Prime, EOS, and SP series products to address various wafer cleaning applications. The company sells its products in the United States, China, Europe, Japan, Korea, Southeast Asia, and Taiwan. Lam Research Corporation was incorporated in 1980 and is headquartered in Fremont, California.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"Knight-Swift Transportation Hol","Symbol":"KNX","Current Price":"51.95","Latest MA":"52.12","Price Target":"58.24","Difference from MA":"-0.32%","Difference from Open":"-0.33%","Change from Yesterday":"-0.63%","Change from Last Report":"0.00","Latest Volume":"3,799,215","Market Cap":"8,410,340,864","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":28.081081,"ROE":0.0050700004,"DTE":47.652,"Industry":"Trucking","Sector":"Industrials","Beta":0.934,"Trailing PEG":0.9895,"Trailing PE":225.86957,"Trailing PS":1.1247206,"Quick Ratio":0.741,"Day High":52.99,"Day Low":51.28,"VS Average Volume":1.9362678269,"Company Summary":"Knight-Swift Transportation Holdings Inc., together with its subsidiaries, provides freight transportation services in the United States and Mexico. The company operates through four segments: Truckload, Less-than-truckload (LTL), Logistics, and Intermodal. The Truckload segment provides transportation services, which include irregular route and dedicated, refrigerated, expedited, flatbed, and cross-border operations. This segment operated an average of 20,948 tractors, which comprised 18,821 company tractors and 2,127 independent contractor tractors, as well as 87,865 trailers. The LTL segment provides regional LTL transportation services through a network of approximately 120 service centers; and offers national coverage through partner carrier outside the network. This segment operated an average of 3,201 tractors and 8,482 trailers. The Logistic segment offers brokerage and other freight management services through third-party transportation providers and equipment. The Intermodal segment offers transportation services, including freight through third-party intermodal rail services on trailing equipment, such as containers and trailers on flat cars; and drayage services. This segment operated an average of 639 tractors and 12,730 intermodal containers. The company also provides repair and maintenance shop, equipment leasing, warranty, and insurance services; and warehousing and driving academy services, as well as manufactures trailer parts. It serves retail, food and beverage, consumer and paper products, transportation and logistics, housing, and building, automotive, and manufacturing industries. Knight-Swift Transportation Holdings Inc. was incorporated in 1989 and is headquartered in Phoenix, Arizona.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"CACI International, Inc.","Symbol":"CACI","Current Price":"402.72","Latest MA":"468.96","Price Target":"552.27","Difference from MA":"-14.12%","Difference from Open":"1.41%","Change from Yesterday":"0.70%","Change from Last Report":"0.00","Latest Volume":"514,179","Market Cap":"9,024,230,400","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":17.000195,"ROE":0.13324,"DTE":60.444,"Industry":"Information Technology Services","Sector":"Technology","Beta":0.918,"Trailing PEG":null,"Trailing PE":19.956392,"Trailing PS":1.1471615,"Quick Ratio":1.51,"Day High":411.19,"Day Low":397.0,"VS Average Volume":2.4755134661,"Company Summary":"CACI International Inc, through its subsidiaries, engages in the provision of expertise and technology to enterprise and mission customers in support of national security in the intelligence, defense, and federal civilian sectors. The company operates through two segments, Domestic Operations and International Operations. The Domestic Operations segment offers digital solutions by modernizing enterprise and agency-unique applications, enterprise infrastructure, and business processes; C4ISR solutions, including command, control, communications, and computer (C4), as well as intelligence, surveillance, and reconnaissance (ISR) technology and networks; and cyber solutions for cybersecurity, cyberspace, electronic warfare, and signals intelligence operations. This segment also provides space solutions, comprising intelligence fusion, data analytic, and decision support, as well as logistics solutions; engineering services, such as platform integration, modernization and sustainment, system engineering, naval architecture, training and simulation, and logistics engineering; design, implement, protect, and manage secure enterprise IT solutions for federal agencies; and mission support solutions, that include analytic services, as well as scenario-based instruction across the spectrum of intelligence processing, collection, and products. The International Operations segment provides a range of IT services, proprietary data, and software products to the commercial and government customers in the United Kingdom, continental Europe, and internationally. The company was founded in 1962 and is headquartered in Reston, Virginia.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"Columbia Banking System, Inc.","Symbol":"COLB","Current Price":"27.19","Latest MA":"24.84","Price Target":"33.25","Difference from MA":"9.45%","Difference from Open":"3.38%","Change from Yesterday":"2.99%","Change from Last Report":"0.00","Latest Volume":"6,424,026","Market Cap":"5,697,148,416","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":10.043217,"ROE":0.09771,"DTE":"N\/A","Industry":"Banks—Regional","Sector":"Financial Services","Beta":0.849,"Trailing PEG":null,"Trailing PE":11.719829,"Trailing PS":3.1152897,"Quick Ratio":"N\/A","Day High":27.42,"Day Low":26.292,"VS Average Volume":3.9245456611,"Company Summary":"Columbia Banking System, Inc. operates as the holding company of Umpqua Bank that provides banking, private banking, mortgage, and other financial services in the United States. The company offers deposit products, including business, non-interest bearing checking, interest-bearing checking and savings, money market, and certificate of deposit accounts; and insured cash sweep and other investment sweep solutions. It also provides commercial lending products, such as commercial lines of credit and term loans, accounts receivable and inventory financing, international trade finance, commercial property loans, multifamily loans, equipment loans, commercial equipment leases, real estate construction loans and permanent financing, and small business administration program financing, as well as capital markets. In addition, the company offers wealth management comprising financial planning, investment, trust, and insurance; treasury management, which includes digital and mobile banking solutions, ACH, wires, positive pay, remote deposit capture, integrated payments, integrated receivables, lockbox, cash vault, real-time payments, commercial card, and foreign exchange and international banking related products, as well as merchant services; and brokerage services, residential real estate loans and consumer loans. It serves its products to corporate, institutional, small business, and individual customers. The company was founded in 1953 and is headquartered in Tacoma, Washington.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"Elevance Health, Inc.","Symbol":"ELV","Current Price":"365.96","Latest MA":"491.45","Price Target":"499.39","Difference from MA":"-25.53%","Difference from Open":"0.08%","Change from Yesterday":"-0.14%","Change from Last Report":"0.00","Latest Volume":"3,438,136","Market Cap":"84,874,543,104","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":11.4986725,"ROE":0.15504,"DTE":61.87,"Industry":"Healthcare Plans","Sector":"Healthcare","Beta":0.853,"Trailing PEG":0.6808,"Trailing PE":13.317322,"Trailing PS":0.48774266,"Quick Ratio":1.34,"Day High":371.85,"Day Low":364.86,"VS Average Volume":1.7539926241,"Company Summary":"Elevance Health, Inc., together with its subsidiaries, operates as a health benefits company in the United States. The company operates through four segments: Health Benefits, CarelonRx, Carelon Services, and Corporate & Other. It offers a variety of health plans and services to program members; health products; an array of fee-based administrative managed care services; and specialty and other insurance products and services, such as stop loss, dental, vision, life, disability, and supplemental health insurance benefits. The company operates in the pharmacy services business; and markets and offers pharmacy services, including pharmacy benefit management, as well as home delivery and specialty pharmacies, claims adjudication, formulary management, pharmacy networks, rebate administration, a prescription drug database, and member services. In addition, it provides healthcare-related services and capabilities, including utilization management, behavioral health, integrated care delivery, palliative care, payment integrity services, subrogation services, and health and wellness programs, as well as services related to data management, information technology, and business operations. Further, the company is involved in the National Government Services business. The company provides its services under the Anthem Blue Cross and Blue Shield, Wellpoint, and Carelon brand names. The company was formerly known as Anthem, Inc. and changed its name to Elevance Health, Inc. in June 2022. Elevance Health, Inc. was incorporated in 2001 and is headquartered in Indianapolis, Indiana.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"Stifel Financial Corporation","Symbol":"SF","Current Price":"104.49","Latest MA":"92.89","Price Target":"115.00","Difference from MA":"12.48%","Difference from Open":"2.58%","Change from Yesterday":"2.17%","Change from Last Report":"0.00","Latest Volume":"2,132,521","Market Cap":"10,694,864,896","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":14.184291,"ROE":0.120349996,"DTE":41.426,"Industry":"Capital Markets","Sector":"Financial Services","Beta":1.081,"Trailing PEG":0.9381,"Trailing PE":18.895117,"Trailing PS":2.2580893,"Quick Ratio":0.847,"Day High":104.909,"Day Low":101.86,"VS Average Volume":3.6257682898,"Company Summary":"Stifel Financial Corp., a financial services and bank holding company, provides retail and institutional wealth management, and investment banking services to individual investors, corporations, municipalities, and institutions in the United States and internationally. It operates in three segments: Global Wealth Management, Institutional Group, and Other. The company provides private client services, including securities transaction and financial planning services; institutional equity and fixed income sales, trading and research, and municipal finance services; investment banking services, such as mergers and acquisitions, public offerings, and private placements; and retail and commercial banking services comprising personal and commercial lending programs, as well as deposit accounts. It participates in and manages underwritings for corporate and public finance; and offers financial advisory and securities brokerage services. The company was founded in 1890 and is headquartered in Saint Louis, Missouri.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"Abbott Laboratories","Symbol":"ABT","Current Price":"114.23","Latest MA":"110.98","Price Target":"131.82","Difference from MA":"2.93%","Difference from Open":"1.41%","Change from Yesterday":"1.61%","Change from Last Report":"0.00","Latest Volume":"11,945,003","Market Cap":"198,127,370,240","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":28.947056,"ROE":0.14840001,"DTE":37.589,"Industry":"Medical Devices","Sector":"Healthcare","Beta":0.722,"Trailing PEG":2.2138,"Trailing PE":34.720367,"Trailing PS":4.8069334,"Quick Ratio":0.996,"Day High":115.11,"Day Low":112.52,"VS Average Volume":2.3233203342,"Company Summary":"Abbott Laboratories, together with its subsidiaries, discovers, develops, manufactures, and sells health care products worldwide. It operates in four segments: Established Pharmaceutical Products, Diagnostic Products, Nutritional Products, and Medical Devices. The company provides generic pharmaceuticals for the treatment of pancreatic exocrine insufficiency, irritable bowel syndrome or biliary spasm, intrahepatic cholestasis or depressive symptoms, gynecological disorder, hormone replacement therapy, dyslipidemia, hypertension, hypothyroidism, Ménière's disease and vestibular vertigo, pain, fever, inflammation, and migraine, as well as provides anti-infective clarithromycin, influenza vaccine, and products to regulate physiological rhythm of the colon. It also offers laboratory and transfusion medicine systems in the areas of immunoassay, clinical chemistry, hematology, and transfusion; molecular diagnostics polymerase chain reaction instrument systems that automate the extraction, purification, and preparation of DNA and RNA from patient samples, and detect and measure infectious agents; point of care systems; cartridges for testing blood gas, chemistry, electrolytes, coagulation, and immunoassay; rapid diagnostics lateral flow testing products; molecular point-of-care testing for HIV, SARS-CoV-2, influenza A and B, RSV, and strep A; cardiometabolic test systems; drug and alcohol test, and remote patient monitoring and consumer self-test systems; and informatics and automation solutions for laboratories. In addition, the company provides pediatric and adult nutritional products; rhythm management, electrophysiology, heart failure, vascular, and structural heart devices for the treatment of cardiovascular diseases; diabetes care products, such as glucose and blood glucose monitoring systems; and neuromodulation devices for the management of chronic pain and movement disorders. Abbott Laboratories was founded in 1888 and is based in North Chicago, Illinois.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"Packaging Corporation of Americ","Symbol":"PKG","Current Price":"227.98","Latest MA":"208.67","Price Target":"251.00","Difference from MA":"9.26%","Difference from Open":"0.81%","Change from Yesterday":"0.23%","Change from Last Report":"0.00","Latest Volume":"1,955,428","Market Cap":"20,473,718,784","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.608772,"ROE":0.18972,"DTE":64.596,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":0.777,"Trailing PEG":2.9281,"Trailing PE":26.6021,"Trailing PS":2.5043998,"Quick Ratio":1.806,"Day High":228.84,"Day Low":225.78,"VS Average Volume":3.1900824019,"Company Summary":"Packaging Corporation of America manufactures and sells containerboard and corrugated packaging products in the United States. The company operates through three segments: Packaging, Paper, and Corporate and Other. The Packaging segment offers various containerboard and corrugated packaging products, such as conventional shipping containers used to protect and transport manufactured goods; multi-color boxes and displays that help to merchandise the packaged product in retail locations; and honeycomb protective packaging products, as well as packaging for meat, fresh fruit and vegetables, processed food, beverages, and other industrial and consumer products. This segment sells its corrugated products through a direct sales and marketing organization, independent brokers, and distribution partners. The Paper segment manufactures and sells commodity and specialty papers, as well as communication papers, including cut-size office papers, and printing and converting papers. This segment sells white papers through its sales and marketing organization. The Corporate and Other segment includes corporate support staff services and related assets and liabilities; and transportation assets, such as rail cars and trucks for transportation. Packaging Corporation of America was founded in 1867 and is headquartered in Lake Forest, Illinois.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"23-12-2024 08:52:00"},{"Company Name":"Crown Castle Inc.","Symbol":"CCI","Current Price":"90.66","Latest MA":"106.48","Price Target":"117.00","Difference from MA":"-14.86%","Difference from Open":"0.21%","Change from Yesterday":"-0.08%","Change from Last Report":"0.00","Latest Volume":"8,348,724","Market Cap":"39,400,656,896","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":33.32194,"ROE":0.20527,"DTE":559.592,"Industry":"REIT—Specialty","Sector":"Real Estate","Beta":0.875,"Trailing PEG":4.1725,"Trailing PE":32.148937,"Trailing PS":5.976135,"Quick Ratio":0.365,"Day High":91.8101,"Day Low":89.64,"VS Average Volume":2.8702102278,"Company Summary":"Crown Castle owns, operates and leases more than 40,000 cell towers and approximately 90,000 route miles of fiber supporting small cells and fiber solutions across every major U.S. market. This nationwide portfolio of communications infrastructure connects cities and communities to essential data, technology and wireless service - bringing information, ideas and innovations to the people and businesses that need them.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-12-2024 08:52:00"}]