[{"Company Name":"United Airlines Holdings, Inc.","Symbol":"UAL","Current Price":"109.20","Latest MA":"67.36","Price Target":123.00435,"Difference from MA":"62.11%","Difference from Open":"0.23%","Change from Yesterday":"1.69%","Change from Last Report":"0.11","Latest Volume":"1,439,887","Market Cap":"35,913,256,960","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":8.580588,"PB Ratio":3.1398258,"ROE":0.27245,"DTE":291.676,"Industry":"Airlines","Sector":"Industrials","Beta":1.393,"Trailing PEG":0.8529,"Trailing PE":13.015493,"Trailing PS":0.6413769,"Quick Ratio":0.694,"Day High":110.09,"Day Low":108.7,"VS Average Volume":0.2594865547,"Company Summary":"United Airlines Holdings, Inc., through its subsidiaries, provides air transportation services in North America, Asia, Europe, Africa, the Pacific, the Middle East, and Latin America. The company transports people and cargo through its mainline and regional fleets. It also offers catering, ground handling, flight academy, and maintenance services for third parties. The company was formerly known as United Continental Holdings, Inc. and changed its name to United Airlines Holdings, Inc. in June 2019. United Airlines Holdings, Inc. was incorporated in 1968 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"21-01-2025 16:46:19"},{"Company Name":"KeyCorp","Symbol":"KEY","Current Price":"17.70","Latest MA":"16.53","Price Target":21.17368,"Difference from MA":"7.10%","Difference from Open":"1.52%","Change from Yesterday":"-3.28%","Change from Last Report":"-0.23","Latest Volume":"2,474,632","Market Cap":"19,591,114,752","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":10.065035,"PB Ratio":1.2228054,"ROE":0.0096700005,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.231,"Trailing PEG":0.7586,"Trailing PE":"Infinity","Trailing PS":4.03774,"Quick Ratio":"N\/A","Day High":17.83,"Day Low":17.3003,"VS Average Volume":0.2498832947,"Company Summary":"KeyCorp operates as the holding company for KeyBank National Association that provides various retail and commercial banking products and services in the United States. It operates in two segments, Consumer Bank and Commercial Bank. The company offers various deposits, investment products and services; commercial leasing, investment management, consumer finance; and personal finance and financial wellness, student loan refinancing, mortgage and home equity, lending, credit card, treasury, business advisory, wealth management, asset management, cash management, portfolio management, and trust and related services to individuals and small and medium-sized businesses. It also provides a suite of banking and capital market products, such as syndicated finance, debt and equity capital market products, commercial payments, equipment finance, commercial mortgage banking, derivatives, foreign exchange, financial advisory, and public finance, as well as commercial mortgage loans to consumer, energy, healthcare, industrial, public sector, real estate, and technology sectors for middle market clients. In addition, the company offers community development financing, securities underwriting, brokerage, and investment banking services. The company was founded in 1849 and is headquartered in Cleveland, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 16:46:19"},{"Company Name":"3M Company","Symbol":"MMM","Current Price":"147.79","Latest MA":"125.16","Price Target":146.0711,"Difference from MA":"18.08%","Difference from Open":"1.57%","Change from Yesterday":"4.81%","Change from Last Report":"0.47","Latest Volume":"2,272,155","Market Cap":"80,480,370,688","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":17.313606,"PB Ratio":17.338102,"ROE":1.1329399,"DTE":295.441,"Industry":"Conglomerates","Sector":"Industrials","Beta":1.001,"Trailing PEG":null,"Trailing PE":15.394791,"Trailing PS":2.4658487,"Quick Ratio":0.95,"Day High":150.0,"Day Low":145.0,"VS Average Volume":0.6453115858,"Company Summary":"3M Company provides diversified technology services in the United States and internationally. The company's Safety and Industrial segment offers industrial abrasives and finishing for metalworking applications; autobody repair solutions; closure systems for personal hygiene products, masking, and packaging materials; electrical products and materials for construction and maintenance, power distribution, and electrical original equipment manufacturers; structural adhesives and tapes; respiratory, hearing, eye, and fall protection solutions; and natural and color-coated mineral granules for shingles. Its Transportation and Electronics segment provides ceramic solutions; attachment\/bonding products, films, sound, and temperature management for transportation vehicles; premium large format graphic films for advertising and fleet signage; light management films and electronics assembly solutions; packaging and interconnection solutions; semiconductor production materials; data centers solutions; and reflective signage for highway, and vehicle safety. The company's Consumer segment provides consumer bandages, braces, supports, and consumer respirators; home cleaning products; retail abrasives, paint accessories, car care DIY products, picture hanging, and consumer air quality solutions; and stationery products. It offers its products through e-commerce and traditional wholesalers, retailers, jobbers, distributors, and dealers. 3M Company was founded in 1902 and is headquartered in Saint Paul, Minnesota.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 16:46:19"},{"Company Name":"Charles Schwab Corporation (The","Symbol":"SCHW","Current Price":"81.34","Latest MA":"70.57","Price Target":86.25,"Difference from MA":"15.26%","Difference from Open":"3.18%","Change from Yesterday":"6.45%","Change from Last Report":"-0.50","Latest Volume":"3,080,350","Market Cap":"148,897,742,848","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":20.310272,"PB Ratio":3.9137754,"ROE":0.12111,"DTE":144.242,"Industry":"Capital Markets","Sector":"Financial Services","Beta":0.952,"Trailing PEG":0.9497,"Trailing PE":31.773438,"Trailing PS":7.9471464,"Quick Ratio":0.481,"Day High":81.94,"Day Low":78.27,"VS Average Volume":0.3997656186,"Company Summary":"The Charles Schwab Corporation, together with its subsidiaries, operates as a savings and loan holding company that provides wealth management, securities brokerage, banking, asset management, custody, and financial advisory services in the United States and internationally. The company operates in two segments, Investor Services and Advisor Services. It offers brokerage accounts with equity and fixed income trading, margin lending, options trading, futures and forex trading, and cash management capabilities, including certificates of deposit; third-party mutual funds through the Mutual Fund Marketplace and Mutual Fund OneSource service, as well as mutual fund trading and clearing services to broker-dealers; exchange-traded funds; advisory solutions for managed portfolios, separately managed accounts, customized personal advice for tailored portfolios, specialized planning, and full-time portfolio management; banking products comprising checking and savings accounts, first lien residential real estate mortgage loans, home equity lines of credit, and pledged asset lines; and trust custody services, personal trust reporting services, and administrative trustee services. It also provides digital retirement calculators; integrated web-, mobile-, and software-based trading platforms, real-time market data, options trading, premium research, and multi-channel access; self-service education and support tools; online research and analysis tools; equity compensation plan sponsors full-service recordkeeping for stock plans, stock options, restricted stock, performance shares, and stock appreciation rights; retirement plan services; mutual fund clearing services; and advisor services, including interactive tools and educational content. The Company operates through branch offices. The Charles Schwab Corporation was founded in 1971 and is headquartered in Westlake, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 16:46:19"},{"Company Name":"Huntington Bancshares Incorpora","Symbol":"HBAN","Current Price":"17.06","Latest MA":"15.06","Price Target":18.69526,"Difference from MA":"13.25%","Difference from Open":"0.29%","Change from Yesterday":"0.26%","Change from Last Report":"0.29","Latest Volume":"1,043,647","Market Cap":"24,799,096,832","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":10.996802,"PB Ratio":1.3608806,"ROE":0.08545,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.057,"Trailing PEG":2.8759,"Trailing PE":16.563107,"Trailing PS":3.7068906,"Quick Ratio":"N\/A","Day High":17.14,"Day Low":16.91,"VS Average Volume":0.0702263271,"Company Summary":"Huntington Bancshares Incorporated operates as the bank holding company for The Huntington National Bank that provides commercial, consumer, and mortgage banking services in the United States. The company offers financial products and services to consumer and business customers, including deposits, lending, payments, mortgage banking, dealer financing, investment management, trust, brokerage, insurance, and other financial products and services. It also provides 24-hour grace, asterisk-free checking, money scout, $50 safety zone, standby cash, early pay, instant access, savings goal getter, and Huntington heads up; digitally powered consumer and business financial solutions to consumer lending, regional banking, branch banking, and wealth management customers; direct and indirect consumer loans, as well as dealer finance loans and deposits; and private banking, wealth management and legacy planning through investment and portfolio management, fiduciary administration and trust, institutional custody, and full-service retail brokerage investment services. The company offers equipment financing, asset-based lending, distribution finance, structured lending, and municipal financing solutions, as well as Huntington ChoicePay. In addition, it offers lending, liquidity, treasury management and other payment services, and capital markets; government and non-profits, healthcare, technology and telecommunications, franchises, financial sponsors, and global services; and corporate risk management, institutional sales and trading, debt and equity issuance, and additional advisory services. The company offers its products through a network of channels, including branches and ATMs, online and mobile banking, and through customer call centers to customers in middle market banking, corporate, specialty, and government banking, asset finance, commercial real estate banking, and capital markets. The company was founded in 1866 and is headquartered in Columbus, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 16:46:19"},{"Company Name":"Bank of America Corporation","Symbol":"BAC","Current Price":"46.84","Latest MA":"41.89","Price Target":51.92857,"Difference from MA":"11.82%","Difference from Open":"0.48%","Change from Yesterday":"0.69%","Change from Last Report":"-0.01","Latest Volume":"5,921,175","Market Cap":"356,530,749,440","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.815386,"PB Ratio":1.3243902,"ROE":0.08092,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.325,"Trailing PEG":2.0616,"Trailing PE":14.593458,"Trailing PS":3.7677886,"Quick Ratio":"N\/A","Day High":46.91,"Day Low":46.545,"VS Average Volume":0.1697157221,"Company Summary":"Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. It operates in four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, non-interest and interest-bearing checking accounts, and investment accounts and products; credit and debit cards; residential mortgages, and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research, and certain market-based services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 16:46:19"},{"Company Name":"Morgan Stanley","Symbol":"MS","Current Price":"136.28","Latest MA":"111.58","Price Target":134.61111,"Difference from MA":"22.14%","Difference from Open":"-0.12%","Change from Yesterday":"-1.10%","Change from Last Report":"0.03","Latest Volume":"2,140,622","Market Cap":"219,001,962,496","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":14.495683,"PB Ratio":2.3397315,"ROE":0.11079001,"DTE":405.772,"Industry":"Capital Markets","Sector":"Financial Services","Beta":1.336,"Trailing PEG":3.9168,"Trailing PE":17.120604,"Trailing PS":3.757626,"Quick Ratio":1.83,"Day High":136.63,"Day Low":135.29,"VS Average Volume":0.321647112,"Company Summary":"Morgan Stanley, a financial holding company, provides various financial products and services to corporations, governments, financial institutions, and individuals in the Americas, Europe, the Middle East, Africa, and Asia. It operates through Institutional Securities, Wealth Management, and Investment Management segments. The Institutional Securities segment offers capital raising and financial advisory services, including services related to the underwriting of debt, equity, and other securities, as well as advice on mergers and acquisitions, restructurings, real estate, and project finance. This segment also provides equity and fixed income products comprising sales, financing, prime brokerage, and market-making services; foreign exchange and commodities; corporate and commercial real estate loans, commercial mortgage and secured lending facilities, and financing for sales and trading customers, and asset-backed and mortgage lending; and wealth management services, investment, and research services. The Wealth Management segment offers financial advisor-led brokerage, custody, administrative, and investment advisory services; self-directed brokerage services; financial and wealth planning services; workplace services, including stock plan administration; annuity and insurance products; securities-based lending, residential real estate loans, and other lending products; banking; and retirement plan services to individual investors and small to medium-sized businesses and institutions. The Investment Management segment provides equity, fixed income, alternatives and solutions, and liquidity and overlay services to benefit\/defined contribution plans, foundations, endowments, government entities, sovereign wealth funds, insurance companies, third-party fund sponsors, corporations, and individuals through institutional and intermediary channels. The company was founded in 1924 and is headquartered in New York, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"21-01-2025 16:46:19"},{"Company Name":"Wells Fargo & Company","Symbol":"WFC","Current Price":"78.07","Latest MA":"62.64","Price Target":82.52381,"Difference from MA":"24.64%","Difference from Open":"0.49%","Change from Yesterday":"1.30%","Change from Last Report":"1.28","Latest Volume":"1,070,328","Market Cap":"256,767,541,248","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":11.413659,"PB Ratio":1.5862083,"ROE":0.099139996,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.136,"Trailing PEG":3.5805,"Trailing PE":14.538176,"Trailing PS":3.2971754,"Quick Ratio":"N\/A","Day High":78.07,"Day Low":77.33,"VS Average Volume":0.062410622,"Company Summary":"Wells Fargo & Company, a financial services company, provides diversified banking, investment, mortgage, and consumer and commercial finance products and services in the United States and internationally. The company operates through four segments: Consumer Banking and Lending; Commercial Banking; Corporate and Investment Banking; and Wealth and Investment Management. The Consumer Banking and Lending segment offers diversified financial products and services for consumers and small businesses. Its financial products and services include checking and savings accounts, and credit and debit cards, as well as home, auto, personal, and small business lending services. The Commercial Banking segment provides financial solutions to private, family owned, and certain public companies. Its products and services include banking and credit products across various industry sectors and municipalities, secured lending and lease products, and treasury management services. The Corporate and Investment Banking segment offers a suite of capital markets, banking, and financial products and services, such as corporate banking, investment banking, treasury management, commercial real estate lending and servicing, equity, and fixed income solutions, as well as sales, trading, and research capabilities services to corporate, commercial real estate, government, and institutional clients. The Wealth and Investment Management segment provides personalized wealth management, brokerage, financial planning, lending, private banking, and trust and fiduciary products and services to affluent, high-net worth, and ultra-high-net worth clients. It also operates through financial advisors in brokerage and wealth offices, consumer bank branches, independent offices, and digitally through WellsTrade and Intuitive Investor. The company was founded in 1852 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 16:46:19"},{"Company Name":"Schlumberger N.V.","Symbol":"SLB","Current Price":"44.43","Latest MA":"42.84","Price Target":53.34935,"Difference from MA":"3.71%","Difference from Open":"1.09%","Change from Yesterday":"1.97%","Change from Last Report":"0.66","Latest Volume":"2,690,126","Market Cap":"62,246,428,672","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":11.843105,"PB Ratio":2.9166942,"ROE":0.21722999,"DTE":57.141,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.532,"Trailing PEG":1.9428,"Trailing PE":14.286174,"Trailing PS":1.7293077,"Quick Ratio":1.003,"Day High":44.43,"Day Low":43.66,"VS Average Volume":0.2190471731,"Company Summary":"Schlumberger Limited engages in the provision of technology for the energy industry worldwide. The company operates through four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company provides field development and hydrocarbon production, carbon management, and integration of adjacent energy systems; reservoir interpretation and data processing services for exploration data; and well construction and production improvement services and products. It also offers subsurface geology and fluids evaluation information; open and cased hole services; exploration and production pressure, and flow-rate measurement services; and pressure pumping, well stimulation, and coiled tubing equipment solutions. In addition, the company offers mud logging, directional drilling, measurement-while-drilling, and logging-while-drilling services, as well as engineering support services; supplies drilling fluid systems; designs, manufactures, and markets roller cone and fixed cutter drill bits; bottom-hole-assembly and borehole enlargement technologies; well cementing products and services; well planning, well drilling, engineering, supervision, logistics, procurement, and contracting of third parties, as well as drilling rig management solutions; and drilling equipment and services, as well as land drilling rigs and related services. Further, it provides artificial lift production equipment and optimization services; supplies packers, safety valves, sand control technology, and various intelligent well completions technology and equipment; designs and manufactures valves, chokes, actuators, and surface trees; and OneSubsea, an integrated solutions, products, systems, and services, including wellheads, subsea trees, manifolds and flowline connectors, control systems, connectors, and services. The company was formerly known as Socie´te´ de Prospection E´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 16:46:19"},{"Company Name":"Citigroup, Inc.","Symbol":"C","Current Price":"80.64","Latest MA":"64.69","Price Target":88.8355,"Difference from MA":"24.66%","Difference from Open":"0.27%","Change from Yesterday":"0.81%","Change from Last Report":"0.17","Latest Volume":"1,476,589","Market Cap":"151,369,351,168","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.719327,"PB Ratio":0.7913097,"ROE":0.03874,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.426,"Trailing PEG":0.8824,"Trailing PE":13.552941,"Trailing PS":2.1840098,"Quick Ratio":"N\/A","Day High":80.65,"Day Low":79.9204,"VS Average Volume":0.1025789425,"Company Summary":"Citigroup Inc., a diversified financial service holding company, provides various financial product and services to consumers, corporations, governments, and institutions worldwide. It operates through five segments: Services, Markets, Banking, U.S. Personal Banking, and Wealth. The Services segment includes Treasury and Trade Solutions, which provides cash management, trade, and working capital solutions to multinational corporations, financial institutions, and public sector organizations; and Securities Services, such as cross-border support for clients, local market expertise, post-trade technologies, data solutions, and various securities services solutions. The Markets segment offers sales and trading services for equities, foreign exchange, rates, spread products, and commodities to corporate, institutional, and public sector clients; and market-making services, including asset classes, risk management solutions, financing, prime brokerage, research, securities clearing, and settlement. The banking segment includes investment banking; advisory services related to mergers and acquisitions, divestitures, restructurings, and corporate defense activities; and corporate lending, which includes corporate and commercial banking. The U.S. Personal Banking segment provides co-branded cards and retail banking services. The Wealth segment provides financial services to high-net-worth clients through banking, lending, mortgages, investment, custody, and trust product offerings; and to professional industries, including law firms, consulting groups, accounting, and asset management. The company was founded in 1812 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 16:46:19"},{"Company Name":"Goldman Sachs Group, Inc. (The)","Symbol":"GS","Current Price":"619.02","Latest MA":"521.02","Price Target":634.0952,"Difference from MA":"18.81%","Difference from Open":"0.36%","Change from Yesterday":"-1.05%","Change from Last Report":"0.40","Latest Volume":"1,090,944","Market Cap":"194,315,649,024","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":12.131492,"PB Ratio":1.889488,"ROE":0.1017,"DTE":609.793,"Industry":"Capital Markets","Sector":"Financial Services","Beta":1.342,"Trailing PEG":3.9236,"Trailing PE":15.261761,"Trailing PS":3.9345505,"Quick Ratio":1.458,"Day High":619.1631,"Day Low":609.0,"VS Average Volume":0.5063458933,"Company Summary":"The Goldman Sachs Group, Inc., a financial institution, provides a range of financial services for corporations, financial institutions, governments, and individuals worldwide. It operates through Global Banking & Markets, Asset & Wealth Management, and Platform Solutions segments. The Global Banking & Markets segment provides financial advisory services, including strategic advisory assignments related to mergers and acquisitions, divestitures, corporate defense activities, restructurings, and spin-offs; and relationship lending, and acquisition financing, as well as secured lending, through structured credit and asset-backed lending and involved in financing under securities to resale agreements. This segment also offers client execution activities for cash and derivative instruments; credit and interest rate products; and provision of mortgages, currencies, commodities, and equities related products, as well as underwriting services. The Asset & Wealth Management segment manages assets across various classes, including equity, fixed income, hedge funds, credit funds, private equity, real estate, currencies, and commodities; and provides customized investment advisory solutions, wealth advisory services, personalized financial planning, and private banking services, as well as invests in corporate equity, credit, real estate, and infrastructure assets. The Platform Solutions segment offers credit cards and point-of-sale financing for purchase of goods or services. This segment also provides cash management services, such as deposit-taking and payment solutions for corporate and institutional clients. The Goldman Sachs Group, Inc. was founded in 1869 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 16:46:19"},{"Company Name":"Walgreens Boots Alliance, Inc.","Symbol":"WBA","Current Price":"10.94","Latest MA":"9.93","Price Target":12.414,"Difference from MA":"10.20%","Difference from Open":"-6.65%","Change from Yesterday":"-12.58%","Change from Last Report":"-1.31","Latest Volume":"8,594,567","Market Cap":"9,453,920,256","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":6.82251,"PB Ratio":0.9049632,"ROE":-0.75969005,"DTE":277.898,"Industry":"Pharmaceutical Retailers","Sector":"Healthcare","Beta":0.669,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.06402579,"Quick Ratio":0.332,"Day High":11.7371,"Day Low":10.9,"VS Average Volume":0.3593552537,"Company Summary":"Walgreens Boots Alliance, Inc. operates as a healthcare, pharmacy, and retail company in the United States, Germany, the United Kingdom, and internationally. It operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The U.S. Retail Pharmacy segment engages in operation of the retail drugstores, health and wellness services, specialty, and home delivery pharmacy services, which offers health and wellness, beauty, personal care and consumables, and general merchandise. The International segment offers sale of prescription drugs and health and wellness, beauty, personal care, and other consumer products outside the United States; and operates pharmacy-led health and beauty retail businesses under the Boots brand stores in the United Kingdom, the Republic of Ireland, and Thailand, as well as the Benavides brand in Mexico and the Ahumada brand in Chile. The U.S. Healthcare segment provides VillageMD, a national provider of value-based care with primary, multi-specialty, and urgent care providers serving patients in traditional clinic settings, in patients' homes and online appointments; Shields, a specialty pharmacy integrator and accelerator for hospitals; and CareCentrix, a participant in the post-acute and home care management sectors. Walgreens Boots Alliance, Inc. was founded in 1909 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"21-01-2025 16:46:19"},{"Company Name":"Delta Air Lines, Inc.","Symbol":"DAL","Current Price":"67.99","Latest MA":"52.04","Price Target":79.92864,"Difference from MA":"30.65%","Difference from Open":"1.84%","Change from Yesterday":"3.30%","Change from Last Report":"3.30","Latest Volume":"1,040,792","Market Cap":"43,872,657,408","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.045534,"PB Ratio":3.1942682,"ROE":0.4067,"DTE":186.78,"Industry":"Airlines","Sector":"Industrials","Beta":1.341,"Trailing PEG":null,"Trailing PE":12.756098,"Trailing PS":0.72748864,"Quick Ratio":0.268,"Day High":68.02,"Day Low":66.78,"VS Average Volume":0.1305372789,"Company Summary":"Delta Air Lines, Inc. provides scheduled air transportation for passengers and cargo in the United States and internationally. The company operates through two segments, Airline and Refinery. Its domestic network centered on core hubs in Atlanta, Minneapolis-St. Paul, Detroit, and Salt Lake City, as well as coastal hub positions in Boston, Los Angeles, New York-LaGuardia, New York-JFK, and Seattle; and international network centered on hubs and market presence in Amsterdam, Bogota, Lima, Mexico City, London-Heathrow, Paris-Charles de Gaulle, Sao Paulo, Seoul-Incheon, and Tokyo. The company sells its tickets through various distribution channels, including delta.com and the Fly Delta app; acts as a reservations specialists; and operates online travel and traditional brick and mortar agencies. It also provides aircraft maintenance and engineering support, repair, and overhaul services; and vacation packages to third-party consumers. The company operates through a fleet of approximately 1,273 aircrafts. Delta Air Lines, Inc. was founded in 1924 and is based in Atlanta, Georgia.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"21-01-2025 16:46:19"},{"Company Name":"Verizon Communications Inc.","Symbol":"VZ","Current Price":"39.52","Latest MA":"40.52","Price Target":47.1625,"Difference from MA":"-2.46%","Difference from Open":"1.67%","Change from Yesterday":"1.95%","Change from Last Report":"0.29","Latest Volume":"2,530,906","Market Cap":"166,364,577,792","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.372154,"PB Ratio":1.7271218,"ROE":0.10431,"DTE":182.615,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.418,"Trailing PEG":1.0291,"Trailing PE":17.108225,"Trailing PS":1.2393347,"Quick Ratio":0.51,"Day High":39.525,"Day Low":38.79,"VS Average Volume":0.1309314987,"Company Summary":"Verizon Communications Inc., through its subsidiaries, engages in the provision of communications, technology, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide. It operates in two segments, Verizon Consumer Group (Consumer) and Verizon Business Group (Business). The Consumer segment provides wireless services across the wireless networks in the United States under the Verizon and TracFone brands and through wholesale and other arrangements; and fixed wireless access (FWA) broadband through its wireless networks, as well as related equipment and devices, such as smartphones, tablets, smart watches, and other wireless-enabled connected devices. The segment also offers wireline services in the Mid-Atlantic and Northeastern United States, as well as Washington D.C. through its fiber-optic network, Verizon Fios product portfolio, and a copper-based network. The Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and conferencing, corporate networking, security and managed network, local and long-distance voice, and network access services to deliver various IoT services and products to businesses, government customers, and wireless and wireline carriers in the United States and internationally. The company was formerly known as Bell Atlantic Corporation and changed its name to Verizon Communications Inc. in June 2000. Verizon Communications Inc. was incorporated in 1983 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"21-01-2025 16:46:19"},{"Company Name":"American Airlines Group, Inc.","Symbol":"AAL","Current Price":"18.48","Latest MA":"12.82","Price Target":20.10636,"Difference from MA":"44.11%","Difference from Open":"-0.19%","Change from Yesterday":"1.12%","Change from Last Report":"0.48","Latest Volume":"2,108,664","Market Cap":"12,143,780,864","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":7.50716,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Airlines","Sector":"Industrials","Beta":1.399,"Trailing PEG":0.2224,"Trailing PE":44.0,"Trailing PS":0.22650814,"Quick Ratio":0.422,"Day High":18.6399,"Day Low":18.34,"VS Average Volume":0.0806041573,"Company Summary":"American Airlines Group Inc., through its subsidiaries, operates as a network air carrier. The company provides scheduled air transportation services for passengers and cargo through its hubs in Charlotte, Chicago, Dallas\/Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix, and Washington, D.C., as well as through partner gateways in London, Doha, Madrid, Seattle\/Tacoma, Sydney, and Tokyo. It operates a mainline fleet of 965 aircraft. The company was formerly known as AMR Corporation and changed its name to American Airlines Group Inc. in December 2013. American Airlines Group Inc. was founded in 1926 and is headquartered in Fort Worth, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 16:46:19"},{"Company Name":"TAL Education Group","Symbol":"TAL","Current Price":"9.45","Latest MA":"9.89","Price Target":13.85947,"Difference from MA":"-4.46%","Difference from Open":"1.07%","Change from Yesterday":"-4.05%","Change from Last Report":"0.75","Latest Volume":"2,158,862","Market Cap":"5,710,474,240","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":20.734142,"PB Ratio":1.5222293,"ROE":0.019609999,"DTE":9.291,"Industry":"Education & Training Services","Sector":"Consumer Defensive","Beta":0.033,"Trailing PEG":0.7989,"Trailing PE":78.75,"Trailing PS":3.1092353,"Quick Ratio":2.67,"Day High":9.5,"Day Low":9.205,"VS Average Volume":0.3423567033,"Company Summary":"TAL Education Group provides K-12 after-school tutoring services in the People's Republic of China. It provides learning services primarily through small-classes services; personalized premium services; and learning content solutions, such as print books, smart books, mobile apps, and AI-driven learning devices. The company also operates www.xueersi.com, an online education platform; provides investment management and consulting services; develops and sells software and networks, as well as related consulting services; and sells educational materials and products. It offers its services under the Haoweilai and Think Academy brands. TAL Education Group was founded in 2003 and is headquartered in Beijing, the People's Republic of China.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"21-01-2025 16:46:19"},{"Company Name":"Kinder Morgan, Inc.","Symbol":"KMI","Current Price":"30.84","Latest MA":"23.53","Price Target":27.91833,"Difference from MA":"31.08%","Difference from Open":"0.87%","Change from Yesterday":"1.78%","Change from Last Report":"0.29","Latest Volume":"1,481,707","Market Cap":"68,515,377,152","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":24.377712,"PB Ratio":2.2533977,"ROE":0.083500005,"DTE":101.433,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.907,"Trailing PEG":2.2194,"Trailing PE":27.292036,"Trailing PS":4.5221686,"Quick Ratio":0.291,"Day High":30.8799,"Day Low":30.5514,"VS Average Volume":0.1128683133,"Company Summary":"Kinder Morgan, Inc. operates as an energy infrastructure company primarily in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas gasification, liquefaction, and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and\/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, renewable fuel and feedstocks, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; owns interests in\/or operates oil fields and gasoline processing plants; and operates a crude oil pipeline system in West Texas, as well as owns and operates RNG and LNG facilities. It owns and operates approximately 82,000 miles of pipelines and 139 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1997 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 16:46:19"},{"Company Name":"Halliburton Company","Symbol":"HAL","Current Price":"29.92","Latest MA":"30.23","Price Target":36.28519,"Difference from MA":"-1.02%","Difference from Open":"-0.93%","Change from Yesterday":"0.12%","Change from Last Report":"0.07","Latest Volume":"1,094,314","Market Cap":"26,284,779,520","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":9.819978,"PB Ratio":2.551377,"ROE":0.26293,"DTE":83.993,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.905,"Trailing PEG":2.3699,"Trailing PE":10.461539,"Trailing PS":1.1392008,"Quick Ratio":1.377,"Day High":30.26,"Day Low":29.8,"VS Average Volume":0.1166375849,"Company Summary":"Halliburton Company provides products and services to the energy industry worldwide. It operates through two segments, Completion and Production, and Drilling and Evaluation. The Completion and Production segment offers production enhancement services that include stimulation and sand control services; cementing services, such as well bonding and casing, and casing equipment; and completion tools that offer downhole solutions and services, including well completion products and services, intelligent well completions, and service tools, as well as liner hanger, sand control, and multilateral systems. This segment also provides electrical submersible pumps, as well as artificial lift services; production solutions comprising coiled tubing, hydraulic workover units, downhole tools, and pumping and nitrogen services; pipeline and process services, such as pre-commissioning, commissioning, maintenance, and decommissioning; and specialty chemicals and services. The Drilling and Evaluation segment offers drilling fluid systems, performance additives, completion fluids, solids control, specialized testing equipment, and waste management services; drilling systems and services; wireline and perforating services consists of open-hole logging, and cased-hole and slickline; and drill bits and services comprising roller cone rock bits, fixed cutter bits, hole enlargement, and related downhole tools and services, as well as coring equipment and services. This segment also provides cloud based digital services and artificial intelligence solutions on an open architecture for subsurface insights, integrated well construction, and reservoir and production management; testing and subsea services, such as acquisition and analysis of reservoir information and optimization solutions; and project management and integrated asset management services. Halliburton Company was founded in 1919 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"21-01-2025 16:46:19"},{"Company Name":"New Oriental Education & Techno","Symbol":"EDU","Current Price":"46.22","Latest MA":"66.09","Price Target":85.49,"Difference from MA":"-30.07%","Difference from Open":"-7.69%","Change from Yesterday":"-23.99%","Change from Last Report":"2.51","Latest Volume":"3,103,524","Market Cap":"7,558,310,400","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":10.510829,"PB Ratio":1.9200732,"ROE":0.09543,"DTE":16.761,"Industry":"Education & Training Services","Sector":"Consumer Defensive","Beta":0.487,"Trailing PEG":1.0065,"Trailing PE":20.095654,"Trailing PS":1.6257994,"Quick Ratio":1.634,"Day High":50.63,"Day Low":44.46,"VS Average Volume":2.0116765138,"Company Summary":"New Oriental Education & Technology Group Inc. provides private educational services under the New Oriental brand in the People's Republic of China. The company operates through four segments: Educational Services and Test Preparation Courses; Online Education and Other Services; Overseas Study Consulting Services; and Educational Materials and Distribution. It offers test preparation courses to students taking language and entrance exams used by educational institutions in the United States, the Commonwealth countries, and the People's Republic of China. The company also provides non-academic tutoring courses; intelligent learning systems and devices to offer a digital learning experience for students; and overseas studies consulting services. In addition, it offers online education services through the Koolearn.com platform. Further, the company develops and edits educational materials for language training and test preparation. In addition, it offers educational programs, services, and products to students through schools; learning centers; and bookstores, as well as through its online learning platforms. The company was founded in 1993 and is headquartered in Beijing, the People's Republic of China.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"21-01-2025 16:46:19"},{"Company Name":"Amphenol Corporation","Symbol":"APH","Current Price":"70.88","Latest MA":"67.49","Price Target":77.91529,"Difference from MA":"5.02%","Difference from Open":"0.25%","Change from Yesterday":"2.13%","Change from Last Report":"0.35","Latest Volume":"1,490,624","Market Cap":"85,453,635,584","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":32.758545,"PB Ratio":9.03851,"ROE":0.25293,"DTE":57.565,"Industry":"Electronic Components","Sector":"Technology","Beta":1.238,"Trailing PEG":2.1533,"Trailing PE":40.73563,"Trailing PS":6.0041623,"Quick Ratio":1.208,"Day High":71.07,"Day Low":70.2,"VS Average Volume":0.2335846582,"Company Summary":"Amphenol Corporation, together with its subsidiaries, primarily designs, manufactures, and markets electrical, electronic, and fiber optic connectors in the United States, China, and internationally. It operates through three segments: Harsh Environment Solutions, Communications Solutions, and Interconnect and Sensor Systems. The company offers connectors and connector systems, including harsh environment data, power, high-speed, fiber optic, and radio frequency interconnect products; busbars and power distribution systems; and other connectors. It also provides value-add products, such as backplane interconnect systems, cable assemblies and harnesses, and cable management products; other products comprising flexible and rigid printed circuit boards, hinges, other mechanical, and production related products. In addition, the company offers consumer device, network infrastructure, and other antennas; coaxial, power, and specialty cables; and sensors and sensor-based products. It sells its products through its sales force, independent representatives, and a network of electronics distributors to original equipment manufacturers, electronic manufacturing services companies, original design manufacturers, and service providers in the automotive, broadband communication, commercial aerospace, industrial, information technology and data communication, military, mobile device, and mobile network markets. Amphenol Corporation was founded in 1932 and is headquartered in Wallingford, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"21-01-2025 16:46:19"}]