[{"Company Name":"Kyndryl Holdings, Inc.","Symbol":"KD","Current Price":"37.89","Latest MA":"28.32","Price Target":38.4,"Difference from MA":"33.79%","Difference from Open":"2.32%","Change from Yesterday":"-0.16%","Change from Last Report":"0.00","Latest Volume":"2,025,019","Market Cap":"8,800,748,544","Earning Date":"2025-02-03","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":18.668978,"PB Ratio":8.260301,"Previous Close":37.96,"ROE":-0.0779,"DTE":349.744,"Industry":"Information Technology Services","Sector":"Technology","Beta":1.719,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.5752499,"Quick Ratio":0.663,"Day High":37.92,"Day Low":36.8,"VS Average Volume":0.846860248,"Company Summary":"Kyndryl Holdings, Inc. operates as a technology services company and IT infrastructure services provider worldwide. The company offers cloud services; core enterprise and zCloud services; application, data, and artificial intelligence services; digital workplace services; security and resiliency services; and network services and edge services. It serves financial, technology, media and telecom, retail and travel, and automotive industries. The company was incorporated in 2020 and is headquartered in New York, New York.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:42:40"},{"Company Name":"Tyson Foods, Inc.","Symbol":"TSN","Current Price":"57.83","Latest MA":"59.62","Price Target":66.42667,"Difference from MA":"-3.00%","Difference from Open":"0.71%","Change from Yesterday":"2.37%","Change from Last Report":"0.29","Latest Volume":"3,424,193","Market Cap":"20,597,485,568","Earning Date":"2025-02-03","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":13.7646885,"PB Ratio":1.1189584,"Previous Close":56.49,"ROE":0.044710003,"DTE":52.863,"Industry":"Farm Products","Sector":"Consumer Defensive","Beta":0.775,"Trailing PEG":0.5014,"Trailing PE":25.702223,"Trailing PS":0.38637912,"Quick Ratio":0.861,"Day High":58.61,"Day Low":56.17,"VS Average Volume":1.4262152239,"Company Summary":"Tyson Foods, Inc., together with its subsidiaries, operates as a food company worldwide. It operates through four segments: Beef, Pork, Chicken, and Prepared Foods. The company processes live fed cattle and hogs; fabricates dressed beef and pork carcasses into primal and sub-primal meat cuts, as well as case ready beef and pork, and fully cooked meats; raises and processes chickens into fresh, frozen, and value-added chicken products, including breaded chicken strips, nuggets, patties, and other ready-to-fix or fully cooked chicken parts; and supplies poultry breeding stock. It also manufactures and markets frozen and refrigerated food products, including ready-to-eat sandwiches, flame-grilled hamburgers, Philly steaks, pepperoni, bacon, breakfast sausage, turkey, lunchmeat, hot dogs, flour and corn tortilla products, appetizers, snacks, prepared meals, ethnic foods, side dishes, meat dishes, breadsticks, and processed meats under the Tyson, Jimmy Dean, Hillshire Farm, Ball Park, Wright, Aidells, Gallo Salame, ibp, and State Fair brands. The company sells its products through its sales staff to grocery retailers, grocery wholesalers, meat distributors, warehouse club stores, military commissaries, industrial food processing companies, chain restaurants or their distributors, live markets, international export companies, and domestic distributors who serve restaurants and food service operations, such as plant and school cafeterias, convenience stores, hospitals, and other vendors, as well as through independent brokers and trading companies. The company was founded in 1935 and is headquartered in Springdale, Arkansas.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"03-02-2025 22:42:40"},{"Company Name":"NXP Semiconductors N.V.","Symbol":"NXPI","Current Price":"205.39","Latest MA":"235.07","Price Target":262.41095,"Difference from MA":"-12.63%","Difference from Open":"1.47%","Change from Yesterday":"-1.51%","Change from Last Report":"-0.02","Latest Volume":"2,886,681","Market Cap":"52,201,099,264","Earning Date":"2025-02-03","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":15.763025,"PB Ratio":5.5464344,"Previous Close":208.55,"ROE":0.29555,"DTE":104.495,"Industry":"Semiconductors","Sector":"Technology","Beta":1.494,"Trailing PEG":1.1543,"Trailing PE":19.617,"Trailing PS":4.0387697,"Quick Ratio":1.41,"Day High":207.06,"Day Low":198.21,"VS Average Volume":1.1718037014,"Company Summary":"NXP Semiconductors N.V. offers various semiconductor products. The company's product portfolio includes microcontrollers; application processors, including i.MX application processors, and i.MX 8 and 9 family of applications processors; communication processors; wireless connectivity solutions, such as near field communications, ultra-wideband, Bluetooth low-energy, Zigbee, and Wi-Fi and Wi-Fi\/Bluetooth integrated SoCs; analog and interface devices; radio frequency power amplifiers; and security controllers, as well as semiconductor-based environmental and inertial sensors, including pressure, inertial, magnetic, and gyroscopic sensors. Its products are used in various applications, including automotive, industrial and Internet of Things, mobile, and communication infrastructure. The company markets its products to various original equipment manufacturers, contract manufacturers, and distributors. It operates in China, the Netherlands, the United States, Singapore, Germany, Japan, South Korea, Taiwan, and internationally. N.V. was incorporated in 2006 and is headquartered in Eindhoven, the Netherlands.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:42:40"},{"Company Name":"Palantir Technologies Inc.","Symbol":"PLTR","Current Price":"83.44","Latest MA":"48.56","Price Target":53.41579,"Difference from MA":"71.82%","Difference from Open":"4.14%","Change from Yesterday":"1.08%","Change from Last Report":"0.02","Latest Volume":"75,966,674","Market Cap":"190,078,009,344","Earning Date":"2025-02-03","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":170.72821,"PB Ratio":42.098892,"Previous Close":82.49,"ROE":0.12409,"DTE":5.552,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":2.697,"Trailing PEG":3.2996,"Trailing PE":417.2,"Trailing PS":71.826805,"Quick Ratio":5.546,"Day High":84.25,"Day Low":78.47,"VS Average Volume":0.9052629073,"Company Summary":"Palantir Technologies Inc. builds and deploys software platforms for the intelligence community to assist in counterterrorism investigations and operations in the United States, the United Kingdom, and internationally. The company provides Palantir Gotham, a software platform which enables users to identify patterns hidden deep within datasets, ranging from signals intelligence sources to reports from confidential informants, as well as facilitates the handoff between analysts and operational users, helping operators plan and execute real-world responses to threats that have been identified within the platform. It also offers Palantir Foundry, a platform that transforms the ways organizations operate by creating a central operating system for their data; and allows individual users to integrate and analyze the data they need in one place. In addition, it provides Palantir Apollo, a software that delivers software and updates across the business, as well as enables customers to deploy their software virtually in any environment; and Palantir Artificial Intelligence Platform (AIP) that provides unified access to open-source, self-hosted, and commercial large language models (LLM) that can transform structured and unstructured data into LLM-understandable objects and can turn organizations' actions and processes into tools for humans and LLM-driven agents. The company was incorporated in 2003 and is headquartered in Denver, Colorado.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"03-02-2025 22:42:40"},{"Company Name":"Phillips 66","Symbol":"PSX","Current Price":"117.59","Latest MA":"128.38","Price Target":136.97421,"Difference from MA":"-8.41%","Difference from Open":"0.17%","Change from Yesterday":"-0.24%","Change from Last Report":"-0.12","Latest Volume":"3,629,214","Market Cap":"48,563,372,032","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":9.64144,"PB Ratio":1.690799,"Previous Close":117.87,"ROE":0.11121,"DTE":67.143,"Industry":"Oil & Gas Refining & Marketing","Sector":"Energy","Beta":1.319,"Trailing PEG":null,"Trailing PE":23.56513,"Trailing PS":0.3287128,"Quick Ratio":0.759,"Day High":118.39,"Day Low":115.25,"VS Average Volume":1.2578176608,"Company Summary":"Phillips 66 operates as an energy manufacturing and logistics company in the United States, the United Kingdom, Germany, and internationally. It operates through four segments: Midstream, Chemicals, Refining, and Marketing and Specialties (M&S). The Midstream segment transports crude oil and other feedstocks; delivers refined petroleum products to market; provides terminaling and storage services for crude oil and refined petroleum products; transports, stores, fractionates, exports, and markets natural gas liquids; provides other fee-based processing services; and gathers, processes, transports, and markets natural gas. The Chemicals segment produces and markets ethylene and other olefin products; aromatics and styrenics products, such as benzene, cyclohexane, styrene, and polystyrene; and various specialty chemical products, including organosulfur chemicals, solvents, catalysts, and chemicals used in drilling and mining. The Refining segment refines crude oil and other feedstocks into petroleum products, such as gasolines, distillates, aviation, and renewable. The M&S segment purchases for resale and markets refined petroleum products, including gasolines, distillates, and aviation fuels. This segment also manufactures and markets specialty products, such as base oils and lubricants. Phillips 66 was founded in 1875 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:42:40"},{"Company Name":"Franklin Resources, Inc.","Symbol":"BEN","Current Price":"20.79","Latest MA":"20.71","Price Target":21.41071,"Difference from MA":"0.34%","Difference from Open":"-5.52%","Change from Yesterday":"-6.54%","Change from Last Report":"0.02","Latest Volume":"7,637,760","Market Cap":"10,920,397,824","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.45417,"PB Ratio":0.8700657,"Previous Close":22.24,"ROE":0.04321,"DTE":25.715,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.402,"Trailing PEG":1.5589,"Trailing PE":32.476562,"Trailing PS":1.2880865,"Quick Ratio":1.307,"Day High":22.1075,"Day Low":20.745,"VS Average Volume":1.8061037726,"Company Summary":"Franklin Resources, Inc. is a publicly owned asset management holding company. Through its subsidiaries, the firm provides its services to individuals, institutions, pension plans, trusts, and partnerships. It launches equity, fixed income, balanced, and multi-asset mutual funds through its subsidiaries. The firm invests in the public equity, fixed income, and alternative markets. Franklin Resources, Inc. was founded in 1947 and is based in San Mateo, California with an additional office in Calgary, Canada; Dubai, United Arab Emirates; Edinburgh, United Kingdom; Fort Lauderdale, United States; Hyderabad, India; London, United Kingdom; Rancho Cordova, United states; Shanghai, China; Singapore; Stamford, United States; and Vienna, Austria.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"03-02-2025 22:42:40"},{"Company Name":"Exxon Mobil Corporation","Symbol":"XOM","Current Price":"106.91","Latest MA":"114.39","Price Target":129.63231,"Difference from MA":"-6.54%","Difference from Open":"0.25%","Change from Yesterday":"0.06%","Change from Last Report":"-0.13","Latest Volume":"10,286,040","Market Cap":"465,357,438,976","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":12.101211,"PB Ratio":1.7493291,"Previous Close":106.83,"ROE":0.14513999,"DTE":15.394,"Industry":"Oil & Gas Integrated","Sector":"Energy","Beta":0.88,"Trailing PEG":4.0957,"Trailing PE":13.635841,"Trailing PS":1.3534993,"Quick Ratio":0.978,"Day High":107.3,"Day Low":105.3225,"VS Average Volume":0.6619388142,"Company Summary":"Exxon Mobil Corporation engages in the exploration and production of crude oil and natural gas in the United States and internationally. It operates through Upstream, Energy Products, Chemical Products, and Specialty Products segments. The Upstream segment explores for and produces crude oil and natural gas. The Energy Products segment offers fuels, aromatics, and catalysts, as well as licensing services. It sells its products under the Exxon, Esso, and Mobil brands. The Chemical Products segment manufactures and markets petrochemicals including olefins, polyolefins, and intermediates. The Specialty Products segment offers performance products, including lubricants, basestocks, waxes, synthetics, elastomers, and resins. The company also involves in the manufacturing, trade, transport, and sale of crude oil, natural gas, petroleum products, petrochemicals, and other specialty products; and pursuit lower-emission business opportunities, including carbon capture and storage, hydrogen, lower-emission fuels, and lithium. Exxon Mobil Corporation was founded in 1870 and is based in Spring, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:42:40"},{"Company Name":"Booz Allen Hamilton Holding Cor","Symbol":"BAH","Current Price":"129.38","Latest MA":"150.81","Price Target":156.435,"Difference from MA":"-14.21%","Difference from Open":"0.03%","Change from Yesterday":"0.26%","Change from Last Report":"0.21","Latest Volume":"2,192,148","Market Cap":"16,386,092,032","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":18.447124,"PB Ratio":16.026878,"Previous Close":129.0,"ROE":0.72942,"DTE":301.126,"Industry":"Consulting Services","Sector":"Industrials","Beta":0.579,"Trailing PEG":null,"Trailing PE":19.311193,"Trailing PS":1.4336902,"Quick Ratio":1.485,"Day High":133.81,"Day Low":127.5,"VS Average Volume":1.1230019011,"Company Summary":"Booz Allen Hamilton Holding Corporation provides management and technology consulting, analytics, engineering, digital solutions, mission operations, and cyber services to governments, corporations, and not-for-profit organizations in the United States and internationally. It focuses on artificial intelligence services comprising of machine learning, predictive modeling, automation and decision analytics, and quantum computing. The company offers artificial intelligence, machine learning, and computer network related operations. In addition, it provides data science, engineering, visualization, and analysis related capabilities. Further, the company engages in user experience, user interface, graphic and web design, design thinking, sketching, and digital product design capabilities. Additionally, it architects and engineers help accelerate, scale, secure, and transform mission and business outcomes using the technologies and partner offering; offers software engineering in agile practices, DevSecOps, automation and Cloud, and Low\/No Code Platform engineering; systems and digital engineering; and tech strategy and product management. Booz Allen Hamilton Holding Corporation was founded in 1914 and is headquartered in McLean, Virginia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:42:40"},{"Company Name":"Gentex Corporation","Symbol":"GNTX","Current Price":"25.18","Latest MA":"29.92","Price Target":32.79091,"Difference from MA":"-15.85%","Difference from Open":"-0.55%","Change from Yesterday":"-2.85%","Change from Last Report":"-0.16","Latest Volume":"3,123,582","Market Cap":"5,726,737,920","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":11.687925,"PB Ratio":2.3687677,"Previous Close":25.92,"ROE":0.18513,"DTE":0.222,"Industry":"Auto Parts","Sector":"Consumer Cyclical","Beta":0.91,"Trailing PEG":1.1797,"Trailing PE":14.306818,"Trailing PS":2.4257522,"Quick Ratio":1.965,"Day High":25.9,"Day Low":24.565,"VS Average Volume":2.1238945635,"Company Summary":"Gentex Corporation designs, develops, manufactures, markets, and supplies digital vision, connected car, dimmable glass, and fire protection products in the United States, Germany, Japan, Mexico, Republic of Korea, and internationally. It operates through Automotive Products and Other segments. The company offers automotive products, including interior and exterior electrochromic automatic-dimming rearview mirrors, automotive electronics, and non-automatic-dimming rearview mirrors for automotive passenger cars, light trucks, pick-up trucks, sport utility vehicles, and vans for original equipment manufacturers, automotive suppliers, and various aftermarket and accessory customers. It also provides variable dimmable windows to aircraft manufacturers and airline operators. In addition, the company offers photoelectric smoke detectors and alarms, electrochemical carbon monoxide alarms and detectors, audible and visual signaling alarms, and bells and speakers used in fire detection systems in office buildings, hotels, and other commercial and residential buildings, as well as researches and develops nanofiber chemical sensing products. It sells its fire protection products directly, as well as through sales managers and manufacturer representative organizations to fire protection and security product distributors, electrical wholesale houses, and original equipment manufacturers of fire protection systems. Gentex Corporation was incorporated in 1974 and is headquartered in Zeeland, Michigan.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:42:40"},{"Company Name":"Chevron Corporation","Symbol":"CVX","Current Price":"149.40","Latest MA":"150.04","Price Target":176.75652,"Difference from MA":"-0.43%","Difference from Open":"0.27%","Change from Yesterday":"0.12%","Change from Last Report":"-0.12","Latest Volume":"5,952,275","Market Cap":"262,188,236,800","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":11.786839,"PB Ratio":1.7187842,"Previous Close":149.19,"ROE":0.103520006,"DTE":16.456,"Industry":"Oil & Gas Integrated","Sector":"Energy","Beta":1.078,"Trailing PEG":3.0857,"Trailing PE":15.354061,"Trailing PS":1.3677793,"Quick Ratio":0.675,"Day High":150.86,"Day Low":147.8,"VS Average Volume":0.7113934217,"Company Summary":"Chevron Corporation, through its subsidiaries, engages in the integrated energy and chemicals operations in the United States and internationally. The company operates in two segments, Upstream and Downstream. The Upstream segment is involved in the exploration, development, production, and transportation of crude oil and natural gas; processing, liquefaction, transportation, and regasification of liquefied natural gas; transportation of crude oil through pipelines; transportation, storage, and marketing of natural gas; and carbon capture and storage, as well as a gas-to-liquids plant. The Downstream segment refines crude oil into petroleum products; markets crude oil, refined products, and lubricants; manufactures and markets renewable fuels, commodity petrochemicals, plastics for industrial uses, and fuel and lubricant additives; and transports crude oil and refined products by pipeline, marine vessel, motor equipment, and rail car. The company was formerly known as ChevronTexaco Corporation and changed its name to Chevron Corporation in 2005. Chevron Corporation was founded in 1879 and is headquartered in San Ramon, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:42:40"},{"Company Name":"International Business Machines","Symbol":"IBM","Current Price":"260.82","Latest MA":"210.43","Price Target":242.47389,"Difference from MA":"23.95%","Difference from Open":"3.34%","Change from Yesterday":"2.04%","Change from Last Report":"0.10","Latest Volume":"5,731,650","Market Cap":"241,165,910,016","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":23.045076,"PB Ratio":9.864599,"Previous Close":255.7,"ROE":0.26729,"DTE":245.112,"Industry":"Information Technology Services","Sector":"Technology","Beta":0.71,"Trailing PEG":8.5427,"Trailing PE":40.626167,"Trailing PS":3.8537219,"Quick Ratio":0.896,"Day High":261.35,"Day Low":251.945,"VS Average Volume":1.3872853776,"Company Summary":"International Business Machines Corporation, together with its subsidiaries, provides integrated solutions and services worldwide. The company operates through Software, Consulting, Infrastructure, and Financing segments. The Software segment offers a hybrid cloud and AI platforms that allows clients to realize their digital and AI transformations across the applications, data, and environments in which they operate. The Consulting segment focuses on skills integration for strategy, experience, technology, and operations by domain and industry. The Infrastructure segment provides on-premises and cloud based server, and storage solutions, as well as life-cycle services for hybrid cloud infrastructure deployment. The Financing segment offers client and commercial financing, facilitates IBM clients' acquisition of hardware, software, and services. The company has a strategic partnership to various companies including hyperscalers, service providers, global system integrators, and software and hardware vendors that includes Adobe, Amazon Web services, Microsoft, Oracle, Salesforce, Samsung Electronics and SAP, and others. The company was formerly known as Computing-Tabulating-Recording Co. International Business Machines Corporation was incorporated in 1911 and is headquartered in Armonk, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Synchrony Financial","Symbol":"SYF","Current Price":"67.65","Latest MA":"56.39","Price Target":77.47619,"Difference from MA":"19.98%","Difference from Open":"1.38%","Change from Yesterday":"-1.97%","Change from Last Report":"0.06","Latest Volume":"3,037,346","Market Cap":"26,269,272,064","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":7.8281627,"PB Ratio":1.7842599,"Previous Close":68.73,"ROE":0.21279,"DTE":"N\/A","Industry":"Credit Services","Sector":"Financial Services","Beta":1.593,"Trailing PEG":1.9686,"Trailing PE":7.9125147,"Trailing PS":2.9165397,"Quick Ratio":"N\/A","Day High":68.29,"Day Low":65.56,"VS Average Volume":0.8305487916,"Company Summary":"Synchrony Financial, together with its subsidiaries, operates as a consumer financial services company in the United States. It provides credit products, such as credit cards, commercial credit products, and consumer installment loans. The company also offers private label credit cards, dual co-brand and general purpose credit cards, short- and long-term installment loans, and consumer banking products; and deposit products, including certificates of deposit, individual retirement accounts, money market accounts, and savings accounts, and sweep and affinity deposits, as well as accepts deposits through third-party securities brokerage firms. In addition, it provides debt cancellation products to its credit card customers through online, mobile, and direct mail; and healthcare payments and financing solutions under the CareCredit and Walgreens brands; payments and financing solutions in the apparel, specialty retail, outdoor, music, and luxury industries, such as American Eagle, Dick's Sporting Goods, Guitar Center, Kawasaki, Pandora, Polaris, Suzuki, and Sweetwater. The company offers its credit products through programs established with a group of national and regional retailers, local merchants, manufacturers, buying groups, industry associations, and healthcare service providers; and deposit products through various channels, such as digital and print. It serves digital, health and wellness, retail, home, auto, telecommunications, jewelry, pets, and other industries. The company was founded in 1932 and is headquartered in Stamford, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Starbucks Corporation","Symbol":"SBUX","Current Price":"108.09","Latest MA":"91.61","Price Target":105.97067,"Difference from MA":"17.98%","Difference from Open":"2.24%","Change from Yesterday":"0.39%","Change from Last Report":"-0.01","Latest Volume":"6,399,028","Market Cap":"122,779,377,664","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":29.50386,"PB Ratio":"N\/A","Previous Close":107.68,"ROE":"N\/A","DTE":"N\/A","Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":0.962,"Trailing PEG":2.6235,"Trailing PE":34.866806,"Trailing PS":3.3939269,"Quick Ratio":0.524,"Day High":108.3,"Day Low":105.52,"VS Average Volume":0.7243252225,"Company Summary":"Starbucks Corporation, together with its subsidiaries, operates as a roaster, marketer, and retailer of coffee worldwide. The company operates through three segments: North America, International, and Channel Development. Its stores offer coffee, tea, and other beverages, roasted whole beans and ground coffees, single serve products, and ready-to-drink beverages; and various food products, such as pastries, breakfast sandwiches, and lunch items. The company also licenses its trademarks through licensed stores, and grocery and foodservice accounts. The company offers its products under the Starbucks Coffee, Teavana, Seattle's Best Coffee, Ethos, and Starbucks Reserve brands. Starbucks Corporation was founded in 1971 and is based in Seattle, Washington.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Boeing Company (The)","Symbol":"BA","Current Price":"176.63","Latest MA":"165.58","Price Target":193.67583,"Difference from MA":"6.67%","Difference from Open":"1.45%","Change from Yesterday":"0.04%","Change from Last Report":"0.04","Latest Volume":"5,355,445","Market Cap":"132,331,028,480","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":41.77264,"PB Ratio":"N\/A","Previous Close":176.52,"ROE":"N\/A","DTE":"N\/A","Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.572,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":1.8055072,"Quick Ratio":0.238,"Day High":178.2,"Day Low":173.1277,"VS Average Volume":0.4836964488,"Company Summary":"The Boeing Company, together with its subsidiaries, designs, develops, manufactures, sells, services, and supports commercial jetliners, military aircraft, satellites, missile defense, human space flight and launch systems, and services worldwide. The company operates through Commercial Airplanes; Defense, Space & Security; and Global Services segments. The Commercial Airplanes segment develops, produces, and markets commercial jet aircraft for passenger and cargo requirements, as well as provides fleet support services. The Defense, Space & Security segment engages in the research, development, production, and modification of manned and unmanned military aircraft and weapons systems; strategic defense and intelligence systems, which include strategic missile and defense systems, command, control, communications, computers, intelligence, surveillance and reconnaissance, cyber and information solutions, and intelligence systems; and satellite systems, such as government and commercial satellites, and space exploration. The Global Services segment offers products and services, including supply chain and logistics management, engineering, maintenance and modifications, upgrades and conversions, spare parts, pilot and maintenance training systems and services, technical and maintenance documents, and data analytics and digital services to commercial and defense customers. The Boeing Company was incorporated in 1916 and is based in Arlington, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Sysco Corporation","Symbol":"SYY","Current Price":"72.51","Latest MA":"74.88","Price Target":83.6125,"Difference from MA":"-3.16%","Difference from Open":"0.26%","Change from Yesterday":"-0.56%","Change from Last Report":"0.13","Latest Volume":"2,172,077","Market Cap":"35,474,071,552","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":14.614885,"PB Ratio":19.172396,"Previous Close":72.92,"ROE":0.88346,"DTE":599.732,"Industry":"Food Distribution","Sector":"Consumer Defensive","Beta":1.2,"Trailing PEG":1.3638,"Trailing PE":18.592308,"Trailing PS":0.44505036,"Quick Ratio":0.695,"Day High":73.38,"Day Low":71.9213,"VS Average Volume":0.6987500153,"Company Summary":"Sysco Corporation, through its subsidiaries, engages in the marketing and distribution of various food and related products to the foodservice or food-away-from-home industry in the United States, Canada, the United Kingdom, France, and internationally. The company operates through U.S. Foodservice Operations, International Foodservice Operations, SYGMA, and Other segments. It distributes frozen food, such as meat, seafood, fully prepared entrées, fruits, vegetables, and desserts; canned and dry food products; fresh meat and seafood products; dairy products; beverages; imported specialties; and fresh produce products. The company also supplies various non-food items, including paper products comprising disposable napkins, plates, and cups; tableware consisting of glassware and silverware; cookware, such as pots, pans, and utensils; restaurant and kitchen equipment and supplies; and cleaning supplies. It serves restaurants, hospitals and nursing facilities, schools and colleges, hotels and motels, industrial caterers, and other foodservice venues. The company was incorporated in 1969 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"SoFi Technologies, Inc.","Symbol":"SOFI","Current Price":"15.47","Latest MA":"10.90","Price Target":13.29375,"Difference from MA":"41.94%","Difference from Open":"3.32%","Change from Yesterday":"-2.25%","Change from Last Report":"0.21","Latest Volume":"37,119,199","Market Cap":"16,948,286,464","Earning Date":"2025-01-27","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":33.322853,"PB Ratio":2.740489,"Previous Close":15.78,"ROE":0.037249997,"DTE":54.394,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.613,"Trailing PEG":null,"Trailing PE":39.673847,"Trailing PS":6.727617,"Quick Ratio":0.47,"Day High":15.77,"Day Low":14.895,"VS Average Volume":0.7625980443,"Company Summary":"SoFi Technologies, Inc. provides various financial services in the United States, Latin America, and Canada. It operates through three segments: Lending, Technology Platform, and Financial Services. The company offers lending and financial services and products that allows its members to borrow, save, spend, invest, and protect money. It offers personal loans, student loans, home loans, and related services. The company also operates Galileo, a technology platform that offers services to financial and non-financial institution; and Technisys, a cloud-native digital and core banking platform with financial services customers. In addition, it provides SoFi Money offers checking and savings accounts, debit cards, and cash management products; and SoFi Invest, a mobile-first investment platform that provides access to trading and advisory solutions, such as investing and robo-advisory. Further, the company offers SoFi Credit Card that provides cash backs on every purchase; Sofi Relay, a personal finance management product that allows to track all of their financial accounts comprising credit score and spending behaviors; SoFi Protect, which offers insurance product; SoFi Travel, an application that manages travel search and booking experience; SoFi At Work provides financial benefits to employees, including student loan payments made on their employees' behalf; Lantern Credit, a financial services marketplace platform for seeking alternative products and provide product comparisons; and other lending as a service that offers pre-qualified borrower referrals and sells loans to third-party partner. The company was founded in 2011 and is based in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"RTX Corporation","Symbol":"RTX","Current Price":"130.08","Latest MA":"117.39","Price Target":142.005,"Difference from MA":"10.81%","Difference from Open":"1.23%","Change from Yesterday":"0.89%","Change from Last Report":"0.03","Latest Volume":"3,087,470","Market Cap":"173,139,083,264","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":19.034296,"PB Ratio":2.833061,"Previous Close":128.95,"ROE":0.073460005,"DTE":69.597,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":0.54,"Trailing PEG":1.3336,"Trailing PE":36.642254,"Trailing PS":2.1904693,"Quick Ratio":0.602,"Day High":130.39,"Day Low":127.55,"VS Average Volume":0.6546644046,"Company Summary":"RTX Corporation, an aerospace and defense company, provides systems and services for the commercial, military, and government customers in the United States and internationally. It operates through three segments: Collins Aerospace, Pratt & Whitney, and Raytheon. The Collins Aerospace Systems segment offers aerospace and defense products, and aftermarket service solutions for civil and military aircraft manufacturers and commercial airlines, as well as regional, business, and general aviation, defense, and commercial space operations. This segment also designs, produces, and supports cabin interior, including oxygen systems, food and beverage preparation, storage and galley systems, and lavatory and wastewater management systems; battlespace, test and training range systems, crew escape systems, and simulation and training solutions; information management services; and aftermarket services that include spare parts, overhaul and repair, engineering and technical support, training and fleet management solutions, and asset and information management services. Its Pratt & Whitney segment supplies aircraft engines for commercial, military, business jet, and general aviation customers; and produces, sells, and services military and commercial auxiliary power units. The Raytheon segment provides defensive and offensive threat detection, tracking, and mitigation capabilities for U.S., foreign government, and commercial customers. The company was formerly known as Raytheon Technologies Corporation and changed its name to RTX Corporation in July 2023. RTX Corporation was incorporated in 1934 and is headquartered in Arlington, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Nucor Corporation","Symbol":"NUE","Current Price":"130.97","Latest MA":"142.99","Price Target":154.12167,"Difference from MA":"-8.40%","Difference from Open":"0.60%","Change from Yesterday":"2.02%","Change from Last Report":"0.10","Latest Volume":"3,788,021","Market Cap":"30,753,458,176","Earning Date":"2025-01-27","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":12.198269,"PB Ratio":1.5021563,"Previous Close":128.43,"ROE":0.13221,"DTE":32.901,"Industry":"Steel","Sector":"Basic Materials","Beta":1.567,"Trailing PEG":null,"Trailing PE":15.481088,"Trailing PS":0.9805667,"Quick Ratio":1.497,"Day High":133.43,"Day Low":126.23,"VS Average Volume":1.5794608681,"Company Summary":"Nucor Corporation engages in manufacture and sale of steel and steel products. It operates in three segments: steel mills, steel products, and raw materials. The Steel Mills segment produces hot-rolled, cold-rolled, and galvanized sheet steel products; plate steel products; wide-flange beams, beam blanks, and H-piling and sheet piling structural steel products; bar steel products, such as blooms, billets, concrete reinforcing and merchant bars, and engineered special bar quality products; and engages in the steel trading and rebar distribution businesses. This segment sells its products to steel service centers, fabricators, and manufacturers in the United States, Canada, and Mexico. The Steel Products segment offers steel joists and joist girders, steel decks, and galvanized torque tubes for used in solar arrays, hollow structural section steel tubing, electrical conduit, fabricated concrete reinforcing steel, cold finished steel, steel fasteners, steel grating and expanded metal, wire and wire mesh, metal building systems, insulated metal panels, steel racking, overhead doors, and utility towers and structures for communications and energy transmission. This segment is also involved in the piling distribution business. The Raw Materials segment produces direct reduced iron (DRI); brokers ferrous and nonferrous metals, pig iron, hot briquetted iron, and DRI; supplies ferro-alloys; processes ferrous and nonferrous scrap metal; and engages in the natural gas production and industrial gas business. This segment sells its ferrous scrap to electric arc furnace steel mills and foundries for manufacturing process; and nonferrous scrap metal to aluminum can producers, secondary aluminum smelters, steel mills and other processors, and consumers of various nonferrous metals. It markets its products through in-house sales force; and internal distribution and trading companies. Nucor Corporation was founded in 1905 and is headquartered in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"AT&T Inc.","Symbol":"T","Current Price":"24.24","Latest MA":"21.04","Price Target":26.61885,"Difference from MA":"15.22%","Difference from Open":"2.32%","Change from Yesterday":"2.19%","Change from Last Report":"-0.02","Latest Volume":"40,363,658","Market Cap":"173,946,241,024","Earning Date":"2025-01-27","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":10.802187,"PB Ratio":1.6991448,"Previous Close":23.73,"ROE":0.08759,"DTE":125.151,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.73,"Trailing PEG":4.0309,"Trailing PE":16.268456,"Trailing PS":1.425088,"Quick Ratio":0.42,"Day High":24.43,"Day Low":23.68,"VS Average Volume":1.1294278668,"Company Summary":"AT&T Inc. provides telecommunications and technology services worldwide. The company operates through two segments, Communications and Latin America. The Communications segment offers wireless voice and data communications services; and sells handsets, wireless data cards, wireless computing devices, carrying cases\/protective covers, and wireless chargers through its own company-owned stores, agents, and third-party retail stores. It also provides Virtual Private Networks, AT&T Dedicated Internet, Ethernet, data services, cloud solutions, outsourcing, and managed professional services, as well as customer premises equipment for multinational corporations, small and mid-sized businesses, governmental, and wholesale customers. In addition, this segment offers broadband services, including fiber connections, legacy telephony voice communication services, and other VoIP services and equipment to residential customers. This segment markets its communications services and products under the AT&T, AT&T Business, Cricket, AT&T PREPAID, and AT&T Fiber brand names. The Latin America segment provides postpaid and prepaid wireless services in Mexico under the AT&T and Unefon brand names, as well as sells smartphones through its owned stores, agents and third-party retail stores. The company was formerly known as SBC Communications Inc. and changed its name to AT&T Inc. in 2005. AT&T Inc. was incorporated in 1983 and is based in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Verizon Communications Inc.","Symbol":"VZ","Current Price":"39.98","Latest MA":"40.59","Price Target":47.66043,"Difference from MA":"-1.50%","Difference from Open":"1.70%","Change from Yesterday":"1.54%","Change from Last Report":"0.00","Latest Volume":"21,354,368","Market Cap":"168,301,002,752","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.203196,"PB Ratio":1.7472249,"Previous Close":39.39,"ROE":0.10431,"DTE":182.615,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.418,"Trailing PEG":1.0601,"Trailing PE":9.657005,"Trailing PS":1.2537601,"Quick Ratio":0.51,"Day High":40.12,"Day Low":39.146,"VS Average Volume":1.0437935557,"Company Summary":"Verizon Communications Inc., through its subsidiaries, engages in the provision of communications, technology, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide. It operates in two segments, Verizon Consumer Group (Consumer) and Verizon Business Group (Business). The Consumer segment provides wireless services across the wireless networks in the United States under the Verizon and TracFone brands and through wholesale and other arrangements; and fixed wireless access (FWA) broadband through its wireless networks, as well as related equipment and devices, such as smartphones, tablets, smart watches, and other wireless-enabled connected devices. The segment also offers wireline services in the Mid-Atlantic and Northeastern United States, as well as Washington D.C. through its fiber-optic network, Verizon Fios product portfolio, and a copper-based network. The Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and conferencing, corporate networking, security and managed network, local and long-distance voice, and network access services to deliver various IoT services and products to businesses, government customers, and wireless and wireline carriers in the United States and internationally. The company was formerly known as Bell Atlantic Corporation and changed its name to Verizon Communications Inc. in June 2000. Verizon Communications Inc. was incorporated in 1983 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Texas Instruments Incorporated","Symbol":"TXN","Current Price":"181.70","Latest MA":"196.49","Price Target":205.69379,"Difference from MA":"-7.53%","Difference from Open":"-0.44%","Change from Yesterday":"-1.66%","Change from Last Report":"-0.06","Latest Volume":"4,225,132","Market Cap":"165,749,833,728","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":25.131954,"PB Ratio":9.596493,"Previous Close":184.61,"ROE":0.29293,"DTE":84.399,"Industry":"Semiconductors","Sector":"Technology","Beta":0.98,"Trailing PEG":1.7865,"Trailing PE":34.87524,"Trailing PS":10.549923,"Quick Ratio":3.048,"Day High":183.31,"Day Low":178.43,"VS Average Volume":0.6848162424,"Company Summary":"Texas Instruments Incorporated designs, manufactures, and sells semiconductors to electronics designers and manufacturers in the United States and internationally. The company operates through Analog and Embedded Processing segments. The Analog segment offers power products to manage power requirements across various voltage levels, including battery-management solutions, DC\/DC switching regulators, AC\/DC and isolated controllers and converters, power switches, linear regulators, voltage references, and lighting products. This segment provides signal chain products that sense, condition, and measure signals to allow information to be transferred or converted for further processing and control, including amplifiers, data converters, interface products, motor drives, clocks, and logic and sensing products. The Embedded Processing segment offers microcontrollers that are used in electronic equipment; digital signal processors for mathematical computations; and applications processors for specific computing activity. This segment offers products for use in various markets, such as industrial, automotive, personal electronics, communications equipment, enterprise systems, and calculators and other. It provides DLP products primarily for use in project high-definition images; calculators; and application-specific integrated circuits. The company markets and sells its semiconductor products through direct sales and distributors, as well as through its website. Texas Instruments Incorporated was founded in 1930 and is headquartered in Dallas, Texas.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"NextEra Energy, Inc.","Symbol":"NEE","Current Price":"71.19","Latest MA":"76.28","Price Target":84.82429,"Difference from MA":"-6.68%","Difference from Open":"0.97%","Change from Yesterday":"-0.60%","Change from Last Report":"-0.02","Latest Volume":"6,131,088","Market Cap":"146,384,830,464","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":17.833567,"PB Ratio":2.9247296,"Previous Close":71.56,"ROE":0.09887999,"DTE":139.015,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.561,"Trailing PEG":3.6991,"Trailing PE":21.123146,"Trailing PS":5.5774145,"Quick Ratio":0.258,"Day High":71.79,"Day Low":70.19,"VS Average Volume":0.5568071857,"Company Summary":"NextEra Energy, Inc., through its subsidiaries, generates, transmits, distributes, and sells electric power to retail and wholesale customers in North America. The company generates electricity through wind, solar, nuclear,natural gas, and other clean energy. It also develops, constructs, and operates long-term contracted assets that consists of clean energy solutions, such as renewable generation facilities, battery storage projects, and electric transmission facilities; sells energy commodities; and owns, develops, constructs, manages and operates electric generation facilities in wholesale energy markets. The company had approximately 33,276 megawatts of net generating capacity; approximately 90,000 circuit miles of transmission and distribution lines; and 883 substations. It serves approximately 12 million people through approximately 5.9 million customer accounts in the east and lower west coasts of Florida. The company was formerly known as FPL Group, Inc. and changed its name to NextEra Energy, Inc. in 2010. NextEra Energy, Inc. was founded in 1925 and is headquartered in Juno Beach, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"American Airlines Group, Inc.","Symbol":"AAL","Current Price":"16.80","Latest MA":"13.18","Price Target":20.995,"Difference from MA":"27.39%","Difference from Open":"2.28%","Change from Yesterday":"-1.06%","Change from Last Report":"0.25","Latest Volume":"27,208,059","Market Cap":"11,043,821,568","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":5.469223,"PB Ratio":"N\/A","Previous Close":16.92,"ROE":"N\/A","DTE":"N\/A","Industry":"Airlines","Sector":"Industrials","Beta":1.399,"Trailing PEG":0.2335,"Trailing PE":13.544354,"Trailing PS":0.20599149,"Quick Ratio":0.422,"Day High":16.82,"Day Low":16.22,"VS Average Volume":0.9852505688,"Company Summary":"American Airlines Group Inc., through its subsidiaries, operates as a network air carrier. The company provides scheduled air transportation services for passengers and cargo through its hubs in Charlotte, Chicago, Dallas\/Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix, and Washington, D.C., as well as through partner gateways in London, Doha, Madrid, Seattle\/Tacoma, Sydney, and Tokyo. It operates a mainline fleet of 965 aircraft. The company was formerly known as AMR Corporation and changed its name to American Airlines Group Inc. in December 2013. American Airlines Group Inc. was founded in 1926 and is headquartered in Fort Worth, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Union Pacific Corporation","Symbol":"UNP","Current Price":"243.32","Latest MA":"237.89","Price Target":263.79358,"Difference from MA":"2.28%","Difference from Open":"0.45%","Change from Yesterday":"-1.82%","Change from Last Report":"-0.08","Latest Volume":"2,774,144","Market Cap":"147,514,458,112","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":18.064825,"PB Ratio":8.904666,"Previous Close":247.79,"ROE":0.43396,"DTE":197.154,"Industry":"Railroads","Sector":"Industrials","Beta":1.056,"Trailing PEG":2.5781,"Trailing PE":21.920721,"Trailing PS":6.073553,"Quick Ratio":0.56,"Day High":246.69,"Day Low":237.065,"VS Average Volume":1.0178253276,"Company Summary":"Union Pacific Corporation, through its subsidiary, Union Pacific Railroad Company, operates in the railroad business in the United States. The company offers transportation services for grain and grain products, fertilizers, food and refrigerated products, and coal and renewables to grain processors, animal feeders, ethanol producers, renewable biofuel producers, and other agricultural users; and construction products, industrial chemicals, plastics, forest products, specialized products, metals and ores, petroleum, liquid petroleum gases, soda ash, and sand, as well as finished automobiles, automotive parts, and merchandise in intermodal containers. Union Pacific Corporation was founded in 1862 and is headquartered in Omaha, Nebraska.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"GE Aerospace","Symbol":"GE","Current Price":"203.68","Latest MA":"175.10","Price Target":225.06589,"Difference from MA":"16.32%","Difference from Open":"1.84%","Change from Yesterday":"0.04%","Change from Last Report":"0.07","Latest Volume":"2,842,100","Market Cap":"218,689,175,552","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":31.7539,"PB Ratio":11.679569,"Previous Close":203.57,"ROE":0.22552,"DTE":110.224,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.188,"Trailing PEG":16.7829,"Trailing PE":33.44499,"Trailing PS":3.12623,"Quick Ratio":0.804,"Day High":204.71,"Day Low":198.97,"VS Average Volume":0.5339140932,"Company Summary":"General Electric Company, doing business as GE Aerospace, designs and produces commercial and defense aircraft engines, integrated engine components, electric power, and mechanical aircraft systems. It also offers aftermarket services to support its products. The company operates in the United States, Europe, China, Asia, the Americas, the Middle East, and Africa. General Electric Company was incorporated in 1892 and is based in Evendale, Ohio.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Freeport-McMoRan, Inc.","Symbol":"FCX","Current Price":"35.89","Latest MA":"43.76","Price Target":47.70762,"Difference from MA":"-17.99%","Difference from Open":"1.48%","Change from Yesterday":"0.16%","Change from Last Report":"-0.08","Latest Volume":"11,019,173","Market Cap":"51,571,417,088","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.26661,"PB Ratio":2.9389126,"Previous Close":35.85,"ROE":0.16870001,"DTE":33.531,"Industry":"Copper","Sector":"Basic Materials","Beta":1.91,"Trailing PEG":5.0477,"Trailing PE":27.607693,"Trailing PS":2.0113657,"Quick Ratio":1.048,"Day High":36.135,"Day Low":34.8901,"VS Average Volume":0.8843586229,"Company Summary":"Freeport-McMoRan Inc. engages in the mining of mineral properties in North America, South America, and Indonesia. It primarily explores for copper, gold, molybdenum, silver, and other metals. The company's assets include the Grasberg minerals district in Indonesia; Morenci, Bagdad, Safford, Sierrita, and Miami in Arizona; Chino and Tyrone in New Mexico; and Henderson and Climax in Colorado, North America, as well as Cerro Verde in Peru and El Abra in Chile. The company was formerly known as Freeport-McMoRan Copper & Gold Inc. and changed its name to Freeport-McMoRan Inc. in July 2014. Freeport-McMoRan Inc. was incorporated in 1987 and is headquartered in Phoenix, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"CSX Corporation","Symbol":"CSX","Current Price":"32.51","Latest MA":"33.79","Price Target":37.01231,"Difference from MA":"-3.80%","Difference from Open":"0.25%","Change from Yesterday":"-1.08%","Change from Last Report":"0.03","Latest Volume":"8,606,927","Market Cap":"62,683,291,648","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":15.366324,"PB Ratio":4.847875,"Previous Close":32.87,"ROE":0.29458,"DTE":147.913,"Industry":"Railroads","Sector":"Industrials","Beta":1.191,"Trailing PEG":2.1871,"Trailing PE":18.15922,"Trailing PS":4.269688,"Quick Ratio":1.195,"Day High":32.945,"Day Low":32.045,"VS Average Volume":0.6646044732,"Company Summary":"CSX Corporation, together with its subsidiaries, provides rail-based freight transportation services. The company offers rail services; and transportation of intermodal containers and trailers, as well as other transportation services, such as rail-to-truck transfers and bulk commodity operations. It also transports chemicals, agricultural and food products, minerals, automotive, forest products, fertilizers, and metals and equipment; and coal, coke, and iron ore to electricity-generating power plants, steel manufacturers, and industrial plants, as well as exports coal to deep-water port facilities. In addition, the company provides intermodal services through a network of approximately 30 terminals transporting manufactured consumer goods in containers; and drayage services, including the pickup and delivery of intermodal shipments. It serves the automotive industry with distribution centers and storage locations, as well as connects non-rail served customers through transferring products, such as plastics and ethanol from rail to trucks. The company operates approximately 20,000 route mile rail network, which serves various population centers in 26 states east of the Mississippi River, the District of Columbia, and the Canadian provinces of Ontario and Quebec, as well as owns and leases approximately 3,500 locomotives. It serves production and distribution facilities through track connections. CSX Corporation was incorporated in 1978 and is headquartered in Jacksonville, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"TAL Education Group","Symbol":"TAL","Current Price":"12.35","Latest MA":"9.96","Price Target":14.73579,"Difference from MA":"24.00%","Difference from Open":"3.57%","Change from Yesterday":"0.90%","Change from Last Report":"0.00","Latest Volume":"3,784,895","Market Cap":"7,459,873,792","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":25.926704,"PB Ratio":2.0367928,"Previous Close":12.23,"ROE":0.019609999,"DTE":9.291,"Industry":"Education & Training Services","Sector":"Consumer Defensive","Beta":0.033,"Trailing PEG":0.6531,"Trailing PE":64.97369,"Trailing PS":4.061747,"Quick Ratio":2.67,"Day High":12.49,"Day Low":11.85,"VS Average Volume":0.5487017082,"Company Summary":"TAL Education Group provides K-12 after-school tutoring services in the People's Republic of China. It provides learning services primarily through small-classes services; personalized premium services; and learning content solutions, such as print books, smart books, mobile apps, and AI-driven learning devices. The company also operates www.xueersi.com, an online education platform; provides investment management and consulting services; develops and sells software and networks, as well as related consulting services; and sells educational materials and products. It offers its services under the Haoweilai and Think Academy brands. TAL Education Group was founded in 2003 and is headquartered in Beijing, the People's Republic of China.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Valley National Bancorp","Symbol":"VLY","Current Price":"10.07","Latest MA":"8.88","Price Target":11.5,"Difference from MA":"13.48%","Difference from Open":"1.00%","Change from Yesterday":"-2.10%","Change from Last Report":"-0.05","Latest Volume":"7,691,881","Market Cap":"5,629,768,704","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":8.71193,"PB Ratio":0.7752385,"Previous Close":10.28,"ROE":0.049429998,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.086,"Trailing PEG":null,"Trailing PE":14.601449,"Trailing PS":3.5698438,"Quick Ratio":"N\/A","Day High":10.155,"Day Low":9.835,"VS Average Volume":0.9295261567,"Company Summary":"Valley National Bancorp operates as the holding company for Valley National Bank that provides various commercial, private banking, retail, insurance, and wealth management financial services products. It operates through Consumer Banking, Commercial Banking, and Treasury and Corporate other segments. The company offers non-interest bearing, savings, NOW, money market, and time deposit accounts; commercial and industrial, commercial real estate, residential mortgage, and automobile loans; loans secured by the cash surrender value of life insurance; home equity loans and lines of credit; automobile financing; and secured and unsecured other consumer loans. It also invests in various securities and interest-bearing deposits with other banks; and provides international banking services, such as standby and documentary letters of credit, and related products, as well as foreign exchange transactions, documentary collections, and foreign wire transfers services. In addition, the company offers investment services for individuals and small to medium sized businesses; and trusts investment strategies designed for various investment profiles and objectives. Further, it provides trust services, such as living and testamentary trusts, investment management, custodial and escrow services, and estate administration to individuals; tax credit advisory services; brokerage services; property and casualty, life, health, and title insurance agency services; and health care equipment lending and other commercial equipment leasing services, as well as owns real estate related investments. Additionally, the company offers online, mobile, and telephone banking services; receivable, payment, and security solution, merchant, payroll processing, and liquidity services; credit cards; and drive-in and night deposit, automated teller machine, remote deposit capture, and safe deposit facility services. Valley National Bancorp was founded in 1927 and is headquartered in Morristown, New Jersey.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Alaska Air Group, Inc.","Symbol":"ALK","Current Price":"73.53","Latest MA":"48.47","Price Target":87.094,"Difference from MA":"51.70%","Difference from Open":"3.48%","Change from Yesterday":"0.33%","Change from Last Report":"0.00","Latest Volume":"2,006,291","Market Cap":"9,052,940,288","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":9.344892,"PB Ratio":2.0705676,"Previous Close":73.25,"ROE":0.07513,"DTE":137.129,"Industry":"Airlines","Sector":"Industrials","Beta":1.593,"Trailing PEG":null,"Trailing PE":23.873377,"Trailing PS":0.8418208,"Quick Ratio":0.483,"Day High":74.85,"Day Low":71.0,"VS Average Volume":0.7405911319,"Company Summary":"Alaska Air Group, Inc., through its subsidiaries, operates airlines. It operates through three segments: Mainline, Regional, and Horizon. The company offers scheduled air transportation services on Boeing jet aircraft for passengers and cargo in the United States, and in parts of Canada, Mexico, Costa Rica, Belize, Guatemala, and the Bahamas; and for passengers across a shorter distance network within the United States, Canada, and Mexico. Alaska Air Group, Inc. was founded in 1932 and is based in Seattle, Washington.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Abbott Laboratories","Symbol":"ABT","Current Price":"128.53","Latest MA":"112.62","Price Target":133.07957,"Difference from MA":"14.13%","Difference from Open":"1.48%","Change from Yesterday":"0.48%","Change from Last Report":"0.12","Latest Volume":"3,724,709","Market Cap":"222,930,141,184","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":22.65836,"PB Ratio":5.6019,"Previous Close":127.93,"ROE":0.14840001,"DTE":37.589,"Industry":"Medical Devices","Sector":"Healthcare","Beta":0.722,"Trailing PEG":2.3001,"Trailing PE":16.8233,"Trailing PS":5.4086943,"Quick Ratio":0.996,"Day High":128.95,"Day Low":126.11,"VS Average Volume":0.6553207848,"Company Summary":"Abbott Laboratories, together with its subsidiaries, discovers, develops, manufactures, and sells health care products worldwide. It operates in four segments: Established Pharmaceutical Products, Diagnostic Products, Nutritional Products, and Medical Devices. The company provides generic pharmaceuticals for the treatment of pancreatic exocrine insufficiency, irritable bowel syndrome or biliary spasm, intrahepatic cholestasis or depressive symptoms, gynecological disorder, hormone replacement therapy, dyslipidemia, hypertension, hypothyroidism, Ménière's disease and vestibular vertigo, pain, fever, inflammation, and migraine, as well as provides anti-infective clarithromycin, influenza vaccine, and products to regulate physiological rhythm of the colon. It also offers laboratory and transfusion medicine systems in the areas of immunoassay, clinical chemistry, hematology, and transfusion; molecular diagnostics polymerase chain reaction instrument systems that automate the extraction, purification, and preparation of DNA and RNA from patient samples, and detect and measure infectious agents; point of care systems; cartridges for testing blood gas, chemistry, electrolytes, coagulation, and immunoassay; rapid diagnostics lateral flow testing products; molecular point-of-care testing for HIV, SARS-CoV-2, influenza A and B, RSV, and strep A; cardiometabolic test systems; drug and alcohol test, and remote patient monitoring and consumer self-test systems; and informatics and automation solutions for laboratories. In addition, the company provides pediatric and adult nutritional products; rhythm management, electrophysiology, heart failure, vascular, and structural heart devices for the treatment of cardiovascular diseases; diabetes care products, such as glucose and blood glucose monitoring systems; and neuromodulation devices for the management of chronic pain and movement disorders. Abbott Laboratories was founded in 1888 and is based in North Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Halliburton Company","Symbol":"HAL","Current Price":"25.63","Latest MA":"29.85","Price Target":34.41481,"Difference from MA":"-14.13%","Difference from Open":"-0.23%","Change from Yesterday":"-1.61%","Change from Last Report":"-0.02","Latest Volume":"8,574,536","Market Cap":"22,516,006,912","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.316433,"PB Ratio":2.1855545,"Previous Close":26.02,"ROE":0.26293,"DTE":83.993,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.905,"Trailing PEG":1.7409,"Trailing PE":9.056537,"Trailing PS":0.9758596,"Quick Ratio":1.377,"Day High":25.94,"Day Low":25.28,"VS Average Volume":0.8293969266,"Company Summary":"Halliburton Company provides products and services to the energy industry worldwide. It operates through two segments, Completion and Production, and Drilling and Evaluation. The Completion and Production segment offers production enhancement services that include stimulation and sand control services; cementing services, such as well bonding and casing, and casing equipment; and completion tools that offer downhole solutions and services, including well completion products and services, intelligent well completions, and service tools, as well as liner hanger, sand control, and multilateral systems. This segment also provides electrical submersible pumps, as well as artificial lift services; production solutions comprising coiled tubing, hydraulic workover units, downhole tools, and pumping and nitrogen services; pipeline and process services, such as pre-commissioning, commissioning, maintenance, and decommissioning; and specialty chemicals and services. The Drilling and Evaluation segment offers drilling fluid systems, performance additives, completion fluids, solids control, specialized testing equipment, and waste management services; drilling systems and services; wireline and perforating services consists of open-hole logging, and cased-hole and slickline; and drill bits and services comprising roller cone rock bits, fixed cutter bits, hole enlargement, and related downhole tools and services, as well as coring equipment and services. This segment also provides cloud based digital services and artificial intelligence solutions on an open architecture for subsurface insights, integrated well construction, and reservoir and production management; testing and subsea services, such as acquisition and analysis of reservoir information and optimization solutions; and project management and integrated asset management services. Halliburton Company was founded in 1919 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Ally Financial Inc.","Symbol":"ALLY","Current Price":"38.00","Latest MA":"37.55","Price Target":44.625,"Difference from MA":"1.20%","Difference from Open":"0.48%","Change from Yesterday":"-2.11%","Change from Last Report":"0.18","Latest Volume":"2,200,934","Market Cap":"11,604,744,192","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":6.8967643,"PB Ratio":0.93372977,"Previous Close":38.97,"ROE":0.06425,"DTE":"N\/A","Industry":"Credit Services","Sector":"Financial Services","Beta":1.389,"Trailing PEG":0.6088,"Trailing PE":21.111113,"Trailing PS":1.7156628,"Quick Ratio":"N\/A","Day High":38.63,"Day Low":37.53,"VS Average Volume":0.6631254725,"Company Summary":"Ally Financial Inc., a digital financial-services company, provides various digital financial products and services in the United States, Canada, and Bermuda. The company operates through Automotive Finance Operations, Insurance Operations, Mortgage Finance Operations, and Corporate Finance Operations segments. The Automotive Finance Operations segment offers automotive financing services, including providing retail installment sales contracts, loans and operating leases, term loans to dealers, financing dealer floorplans and other lines of credit to dealers, warehouse lines to automotive retailers, and fleet financing. It also provides financing services to companies and municipalities for the purchase or lease of vehicles, and vehicle-remarketing services. The Insurance Operations segment offers consumer finance protection and insurance products through the automotive dealer channel, and commercial insurance products directly to dealers. This segment provides vehicle service and maintenance contract, and guaranteed asset protection products; and underwrites commercial insurance coverages, which primarily insure dealers' vehicle inventory. The Mortgage Finance Operations segment manages consumer mortgage loan portfolio that includes bulk purchases of jumbo and low-to-moderate income mortgage loans originated by third parties, as well as direct-to-consumer mortgage offerings. The Corporate Finance Operations segment provides senior secured leveraged cash flow and asset-based loans to middle market companies; leveraged loans; and commercial real estate product to serve companies in the nursing facilities, senior housing, and medical office buildings. It also offers commercial banking products and services. In addition, it provides securities brokerage and investment advisory services. The company was formerly known as GMAC Inc. and changed its name to Ally Financial Inc. in May 2010. Ally Financial Inc. was founded in 1919 and is based in Detroit, Michigan.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Johnson & Johnson","Symbol":"JNJ","Current Price":"151.78","Latest MA":"154.46","Price Target":168.64,"Difference from MA":"-1.74%","Difference from Open":"-0.14%","Change from Yesterday":"-0.18%","Change from Last Report":"0.04","Latest Volume":"3,905,216","Market Cap":"365,428,572,160","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.6518345,"PB Ratio":5.207933,"Previous Close":152.15,"ROE":0.20889,"DTE":50.958,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.518,"Trailing PEG":0.9647,"Trailing PE":26.168964,"Trailing PS":4.1669927,"Quick Ratio":0.705,"Day High":152.4626,"Day Low":150.8,"VS Average Volume":0.4516853002,"Company Summary":"Johnson & Johnson, together with its subsidiaries, researches, develops, manufactures, and sells various products in the healthcare field worldwide. The company's Innovative Medicine segment offers products for various therapeutic areas, such as immunology, including rheumatoid arthritis, psoriatic arthritis, inflammatory bowel disease, and psoriasis; infectious diseases comprising HIV\/AIDS; neuroscience, consisting of mood disorders, neurodegenerative disorders, and schizophrenia; oncology, such as prostate cancer, hematologic malignancies, lung cancer, and bladder cancer; cardiovascular and metabolism, including thrombosis, diabetes, and macular degeneration; and pulmonary hypertension comprising pulmonary arterial hypertension through retailers, wholesalers, distributors, hospitals, and healthcare professionals for prescription use. Its MedTech segment provides Interventional Solutions, including electrophysiology products to treat heart rhythm disorders; the heart recovery portfolio, which includes technologies to treat severe coronary artery disease requiring high-risk PCI or AMI cardiogenic shock; and neurovascular care that treats hemorrhagic and ischemic stroke. this segment also offers an orthopaedics portfolio that includes products and enabling technologies that support hips, knees, trauma, spine, sports, and other; surgery portfolios comprising advanced and general surgery technologies, as well as solutions for breast aesthetics, ear, nose, and throat procedures; contact lenses under the ACUVUE Brand; and TECNIS intraocular lenses for cataract surgery. It distributes its products to wholesalers, hospitals, and retailers, as well as physicians, nurses, hospitals, eye care professionals, and clinics. The company has a collaboration agreement with Stand Up To Cancer for research testing a combination of teclistamab and daratumumab to treat a rare disease AL amyloidosis. Johnson & Johnson was founded in 1886 and is based in New Brunswick, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Lam Research Corporation","Symbol":"LRCX","Current Price":"80.35","Latest MA":"79.88","Price Target":91.18703,"Difference from MA":"0.59%","Difference from Open":"1.74%","Change from Yesterday":"-1.06%","Change from Last Report":"-0.12","Latest Volume":"7,864,587","Market Cap":"103,246,536,704","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.383467,"PB Ratio":12.267175,"Previous Close":81.05,"ROE":0.49116,"DTE":58.827,"Industry":"Semiconductor Equipment & Materials","Sector":"Technology","Beta":1.486,"Trailing PEG":1.5967,"Trailing PE":24.422493,"Trailing PS":6.622061,"Quick Ratio":1.685,"Day High":81.56,"Day Low":78.51,"VS Average Volume":0.664884952,"Company Summary":"Lam Research Corporation designs, manufactures, markets, refurbishes, and services semiconductor processing equipment used in the fabrication of integrated circuits. The company offers ALTUS systems to deposit conformal films for tungsten metallization applications; SABRE electrochemical deposition products for copper interconnect transition that offers copper damascene manufacturing; and VECTOR plasma-enhanced CVD products. It also provides SPEED gapfill high-density plasma chemical vapor deposition products; and Striker single-wafer atomic layer deposition products for dielectric film solutions. In addition, the company offers Flex for dielectric etch applications; Vantex, a dielectric etch system that provides RF technology and repeatable wafer-to-wafer performance enabled by Equipment Intelligence solutions; Kiyo for conductor etch applications; Syndion for through-silicon via etch applications; and Versys metal products for metal etch processes. Further, it provides Coronus bevel clean products to enhance die yield; and Da Vinci, DV-Prime, EOS, and SP series products to address various wafer cleaning applications. The company sells its products in the United States, China, Europe, Japan, Korea, Southeast Asia, and Taiwan. Lam Research Corporation was incorporated in 1980 and is headquartered in Fremont, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Alcoa Corporation","Symbol":"AA","Current Price":"34.35","Latest MA":"37.59","Price Target":48.04231,"Difference from MA":"-8.61%","Difference from Open":"0.51%","Change from Yesterday":"-2.70%","Change from Last Report":"-0.13","Latest Volume":"4,433,146","Market Cap":"8,875,786,240","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":10.662599,"PB Ratio":1.6906157,"Previous Close":35.32,"ROE":-0.07142,"DTE":56.095,"Industry":"Aluminum","Sector":"Basic Materials","Beta":2.419,"Trailing PEG":null,"Trailing PE":132.13461,"Trailing PS":0.80659634,"Quick Ratio":0.671,"Day High":35.22,"Day Low":33.42,"VS Average Volume":0.9350725011,"Company Summary":"Alcoa Corporation, together with its subsidiaries, produces and sells bauxite, alumina, and aluminum products in the United States, Spain, Australia, Iceland, Norway, Brazil, Canada, and internationally. The company operates through two segments, Alumina and Aluminum. It engages in bauxite mining operations; and processes bauxite into alumina and sells it to customers who process it into industrial chemical products, as well as aluminum smelting and casting businesses. The company offers primary aluminum in the form of alloy ingot or value-add ingot to customers that produce products for the transportation, building and construction, packaging, wire, and other industrial markets; and flat-rolled aluminum in the form of sheet, which is sold primarily to customers that produce beverage and food cans. In addition, it owns hydro power plants that generates and sells electricity in the wholesale market to traders, large industrial consumers, distribution companies, and other generation companies. The company was formerly known as Alcoa Upstream Corporation and changed its name to Alcoa Corporation in October 2016. The company was founded in 1886 and is headquartered in Pittsburgh, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Kinder Morgan, Inc.","Symbol":"KMI","Current Price":"27.61","Latest MA":"24.08","Price Target":29.585,"Difference from MA":"14.66%","Difference from Open":"2.89%","Change from Yesterday":"0.42%","Change from Last Report":"0.09","Latest Volume":"9,172,266","Market Cap":"61,350,584,320","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.48864,"PB Ratio":2.0177553,"Previous Close":27.1925,"ROE":0.083500005,"DTE":101.433,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.907,"Trailing PEG":2.0121,"Trailing PE":23.602564,"Trailing PS":4.0492764,"Quick Ratio":0.291,"Day High":27.79,"Day Low":26.73,"VS Average Volume":0.6327794972,"Company Summary":"Kinder Morgan, Inc. operates as an energy infrastructure company primarily in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas gasification, liquefaction, and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and\/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, renewable fuel and feedstocks, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; owns interests in\/or operates oil fields and gasoline processing plants; and operates a crude oil pipeline system in West Texas, as well as owns and operates RNG and LNG facilities. It owns and operates approximately 82,000 miles of pipelines and 139 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1997 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"GE Vernova Inc.","Symbol":"GEV","Current Price":"365.55","Latest MA":"269.33","Price Target":413.4468,"Difference from MA":"35.72%","Difference from Open":"4.34%","Change from Yesterday":"-2.30%","Change from Last Report":"0.07","Latest Volume":"3,310,886","Market Cap":"100,765,319,168","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":35.311913,"PB Ratio":10.592889,"Previous Close":372.88,"ROE":"N\/A","DTE":9.346,"Industry":"Utilities - Renewable","Sector":"Utilities","Beta":"N\/A","Trailing PEG":3.2318,"Trailing PE":65.393555,"Trailing PS":2.9273522,"Quick Ratio":0.717,"Day High":367.1951,"Day Low":348.95,"VS Average Volume":0.9792910233,"Company Summary":"GE Vernova Inc., an energy company, engages in the provision of various products and services that generate, transfer, orchestrate, convert, and store electricity in the United States, Europe, Asia, the Americas, the Middle East, and Africa. The company operates through three segments: Power, Wind, and Electrification. The Power segment designs, manufactures, and services gas, nuclear, hydro, and steam technologies. The Wind segment offers wind generation technologies, including onshore and offshore wind turbines and blades. The Electrification segment provides grid solutions, power conversion, solar, and storage solutions; and electrification software for the transmission, distribution, conversion, storage, and orchestration of electricity from point of generation to point of consumption. The company was incorporated in 2023 and is headquartered in Cambridge, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Amphenol Corporation","Symbol":"APH","Current Price":"70.13","Latest MA":"67.78","Price Target":84.08235,"Difference from MA":"3.47%","Difference from Open":"1.59%","Change from Yesterday":"-1.07%","Change from Last Report":"0.01","Latest Volume":"4,859,555","Market Cap":"84,549,427,200","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":27.669825,"PB Ratio":8.942871,"Previous Close":70.78,"ROE":0.25293,"DTE":57.565,"Industry":"Electronic Components","Sector":"Technology","Beta":1.238,"Trailing PEG":2.5142,"Trailing PE":36.526043,"Trailing PS":5.9406304,"Quick Ratio":1.208,"Day High":70.66,"Day Low":68.54,"VS Average Volume":0.7126564266,"Company Summary":"Amphenol Corporation, together with its subsidiaries, primarily designs, manufactures, and markets electrical, electronic, and fiber optic connectors in the United States, China, and internationally. It operates through three segments: Harsh Environment Solutions, Communications Solutions, and Interconnect and Sensor Systems. The company offers connectors and connector systems, including harsh environment data, power, high-speed, fiber optic, and radio frequency interconnect products; busbars and power distribution systems; and other connectors. It also provides value-add products, such as backplane interconnect systems, cable assemblies and harnesses, and cable management products; other products comprising flexible and rigid printed circuit boards, hinges, other mechanical, and production related products. In addition, the company offers consumer device, network infrastructure, and other antennas; coaxial, power, and specialty cables; and sensors and sensor-based products. It sells its products through its sales force, independent representatives, and a network of electronics distributors to original equipment manufacturers, electronic manufacturing services companies, original design manufacturers, and service providers in the automotive, broadband communication, commercial aerospace, industrial, information technology and data communication, military, mobile device, and mobile network markets. Amphenol Corporation was founded in 1932 and is headquartered in Wallingford, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Fifth Third Bancorp","Symbol":"FITB","Current Price":"43.66","Latest MA":"42.38","Price Target":50.7381,"Difference from MA":"3.02%","Difference from Open":"0.56%","Change from Yesterday":"-1.51%","Change from Last Report":"0.10","Latest Volume":"2,506,001","Market Cap":"29,242,476,544","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":10.681324,"PB Ratio":1.5814737,"Previous Close":44.31,"ROE":0.119160004,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.231,"Trailing PEG":3.5608,"Trailing PE":13.902865,"Trailing PS":3.6267488,"Quick Ratio":"N\/A","Day High":43.85,"Day Low":42.92,"VS Average Volume":0.5574852487,"Company Summary":"Fifth Third Bancorp operates as the bank holding company for Fifth Third Bank, National Association that engages in the provision of a range of financial products and services in the United States. It operates through three segments: Commercial Banking, Consumer and Small Business Banking, and Wealth and Asset Management. The Commercial Banking segment offers credit intermediation, cash management, and financial services; lending and depository products; and cash management, foreign exchange and international trade finance, derivatives and capital markets services, asset-based lending, real estate finance, public finance, commercial leasing, and syndicated finance for business, government, and professional customers. The Consumer and Small Banking segment provides a range of deposit and loan products to individuals and small businesses; home equity loans and lines of credit; credit cards; and cash management services. This segment also engages in the residential mortgage that include origination, retention and servicing of residential mortgage loans, sales and securitizations of loans, and hedging activities; indirect lending, including extending loans to consumers through automobile dealers, motorcycle dealers, powersport dealers, recreational vehicle dealers, and marine dealers; and home improvement and solar energy installation loans through contractors and installers. The Wealth & Asset Management segment provides various wealth management services for individuals, companies, and not-for-profit organizations. It offers retail brokerage services to individual clients; and broker dealer services to the institutional marketplace. This segment also provides wealth planning, investment management, banking, insurance, and trust and estate services; and advisory services for institutional clients comprising middle market businesses, non-profits, states, and municipalities. The company was founded in 1858 and is headquartered in Cincinnati, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Prologis, Inc.","Symbol":"PLD","Current Price":"118.02","Latest MA":"117.33","Price Target":129.19048,"Difference from MA":"0.59%","Difference from Open":"1.72%","Change from Yesterday":"-1.07%","Change from Last Report":"0.07","Latest Volume":"2,215,391","Market Cap":"109,307,166,720","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":38.023865,"PB Ratio":2.0620248,"Previous Close":119.25,"ROE":0.05662,"DTE":57.079,"Industry":"REIT - Industrial","Sector":"Real Estate","Beta":1.094,"Trailing PEG":0.5838,"Trailing PE":35.54819,"Trailing PS":13.266705,"Quick Ratio":0.417,"Day High":118.51,"Day Low":114.55,"VS Average Volume":0.5234008673,"Company Summary":"Prologis, Inc. is the global leader in logistics real estate with a focus on high-barrier, high-growth markets. At September 30, 2024, the company owned or had investments in, on a wholly owned basis or through co-investment ventures, properties and development projects expected to total approximately 1.2 billion square feet (116 million square meters) in 20 countries. Prologis leases modern logistics facilities to a diverse base of approximately 6,700 customers principally across two major categories: business-to-business and retail\/online fulfilment.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Capital One Financial Corporati","Symbol":"COF","Current Price":"201.23","Latest MA":"162.01","Price Target":212.02444,"Difference from MA":"24.21%","Difference from Open":"0.75%","Change from Yesterday":"-1.29%","Change from Last Report":"0.17","Latest Volume":"2,381,677","Market Cap":"76,714,917,888","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":11.032697,"PB Ratio":1.3218206,"Previous Close":203.71,"ROE":0.07479,"DTE":"N\/A","Industry":"Credit Services","Sector":"Financial Services","Beta":1.432,"Trailing PEG":2.097,"Trailing PE":17.392395,"Trailing PS":2.8952303,"Quick Ratio":"N\/A","Day High":202.3,"Day Low":197.115,"VS Average Volume":0.7611762183,"Company Summary":"Capital One Financial Corporation operates as the financial services holding company for the Capital One, National Association, which engages in the provision of various financial products and services in the United States, Canada, and the United Kingdom. It operates through three segments: Credit Card, Consumer Banking, and Commercial Banking. The company accepts checking accounts, money market deposits, negotiable order of withdrawals, savings deposits, and time deposits. Its loan products include credit card loans; auto and retail banking loans; and commercial and multifamily real estate, and commercial and industrial loans. The company also offers credit and debit card products; online direct banking services; and provides advisory, capital markets, treasury management, and depository services. It serves consumers, small businesses, and commercial clients through digital channels, branches, cafés, and other distribution channels located in New York, Louisiana, Texas, Maryland, Virginia, New Jersey, and California. The company was founded in 1988 and is headquartered in McLean, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"United Airlines Holdings, Inc.","Symbol":"UAL","Current Price":"105.30","Latest MA":"70.82","Price Target":129.49522,"Difference from MA":"48.69%","Difference from Open":"3.28%","Change from Yesterday":"-0.61%","Change from Last Report":"0.14","Latest Volume":"3,500,089","Market Cap":"34,630,676,480","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.103003,"PB Ratio":3.027692,"Previous Close":105.84,"ROE":0.27245,"DTE":291.676,"Industry":"Airlines","Sector":"Industrials","Beta":1.393,"Trailing PEG":0.994,"Trailing PE":11.142868,"Trailing PS":0.6184712,"Quick Ratio":0.694,"Day High":106.3,"Day Low":101.32,"VS Average Volume":0.6098851859,"Company Summary":"United Airlines Holdings, Inc., through its subsidiaries, provides air transportation services in North America, Asia, Europe, Africa, the Pacific, the Middle East, and Latin America. The company transports people and cargo through its mainline and regional fleets. It also offers catering, ground handling, flight academy, and maintenance services for third parties. The company was formerly known as United Continental Holdings, Inc. and changed its name to United Airlines Holdings, Inc. in June 2019. United Airlines Holdings, Inc. was incorporated in 1968 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Netflix, Inc.","Symbol":"NFLX","Current Price":"981.52","Latest MA":"768.34","Price Target":1063.7195,"Difference from MA":"27.74%","Difference from Open":"0.92%","Change from Yesterday":"0.39%","Change from Last Report":"-0.05","Latest Volume":"3,003,842","Market Cap":"419,852,058,624","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":32.36469,"PB Ratio":18.465939,"Previous Close":976.76,"ROE":0.34714,"DTE":81.461,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.25,"Trailing PEG":2.4191,"Trailing PE":49.496723,"Trailing PS":11.170057,"Quick Ratio":0.975,"Day High":987.6891,"Day Low":964.375,"VS Average Volume":0.863539,"Company Summary":"Netflix, Inc. provides entertainment services. It offers TV series, documentaries, feature films, and games across various genres and languages. The company also provides members the ability to receive streaming content through a host of internet-connected devices, including TVs, digital video players, TV set-top boxes, and mobile devices. It has operations in approximately 190 countries. The company was incorporated in 1997 and is headquartered in Los Gatos, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Old National Bancorp","Symbol":"ONB","Current Price":"23.53","Latest MA":"20.01","Price Target":27.61111,"Difference from MA":"17.60%","Difference from Open":"1.12%","Change from Yesterday":"-1.43%","Change from Last Report":"0.15","Latest Volume":"2,106,579","Market Cap":"7,505,740,288","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":8.909605,"PB Ratio":1.222973,"Previous Close":23.85,"ROE":0.08922,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.807,"Trailing PEG":null,"Trailing PE":14.005953,"Trailing PS":4.291775,"Quick Ratio":"N\/A","Day High":23.71,"Day Low":23.04,"VS Average Volume":0.6679303971,"Company Summary":"Old National Bancorp operates as the bank holding company for Old National Bank that provides various financial services to individual and commercial customers in the United States. It accepts deposit accounts, including noninterest-bearing demand, interest-bearing checking, negotiable order of withdrawal, savings and money market, and time deposits; and offers loans, such as home equity lines of credit, residential real estate loans, consumer loans, commercial loans, commercial real estate loans, agricultural loans, letters of credit, and lease financing. The company also provides debit and automated teller machine cards, telephone access, online banking, and other electronic and mobile banking services; cash management, private banking, brokerage, trust, investment advisory, and other traditional banking services; wealth management, investment, and foreign currency services; and treasury management, merchant, and capital markets services, as well as community development lending and equity investment solutions. The company was founded in 1834 and is headquartered in Evansville, Indiana.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"3M Company","Symbol":"MMM","Current Price":"149.84","Latest MA":"128.17","Price Target":154.29611,"Difference from MA":"16.91%","Difference from Open":"0.44%","Change from Yesterday":"-1.52%","Change from Last Report":"0.05","Latest Volume":"2,399,841","Market Cap":"80,834,183,168","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":17.634626,"PB Ratio":17.5786,"Previous Close":152.2,"ROE":1.1329399,"DTE":295.441,"Industry":"Conglomerates","Sector":"Industrials","Beta":1.001,"Trailing PEG":2.7486,"Trailing PE":20.639118,"Trailing PS":2.4766893,"Quick Ratio":0.95,"Day High":151.63,"Day Low":148.15,"VS Average Volume":0.6759580439,"Company Summary":"3M Company provides diversified technology services in the United States and internationally. The company's Safety and Industrial segment offers industrial abrasives and finishing for metalworking applications; autobody repair solutions; closure systems for personal hygiene products, masking, and packaging materials; electrical products and materials for construction and maintenance, power distribution, and electrical original equipment manufacturers; structural adhesives and tapes; respiratory, hearing, eye, and fall protection solutions; and natural and color-coated mineral granules for shingles. Its Transportation and Electronics segment provides ceramic solutions; attachment\/bonding products, films, sound, and temperature management for transportation vehicles; premium large format graphic films for advertising and fleet signage; light management films and electronics assembly solutions; packaging and interconnection solutions; semiconductor production materials; data centers solutions; and reflective signage for highway, and vehicle safety. The company's Consumer segment provides consumer bandages, braces, supports, and consumer respirators; home cleaning products; retail abrasives, paint accessories, car care DIY products, picture hanging, and consumer air quality solutions; and stationery products. It offers its products through e-commerce and traditional wholesalers, retailers, jobbers, distributors, and dealers. 3M Company was founded in 1902 and is headquartered in Saint Paul, Minnesota.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Seagate Technology Holdings PLC","Symbol":"STX","Current Price":"94.02","Latest MA":"99.86","Price Target":119.98667,"Difference from MA":"-5.85%","Difference from Open":"-0.62%","Change from Yesterday":"-2.57%","Change from Last Report":"-0.01","Latest Volume":"2,455,732","Market Cap":"19,903,633,408","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":9.601489,"PB Ratio":"N\/A","Previous Close":96.36,"ROE":"N\/A","DTE":"N\/A","Industry":"Computer Hardware","Sector":"Technology","Beta":1.07,"Trailing PEG":0.3093,"Trailing PE":17.093636,"Trailing PS":2.7396605,"Quick Ratio":0.63,"Day High":95.63,"Day Low":92.91,"VS Average Volume":0.8572582545,"Company Summary":"Seagate Technology Holdings plc engages in the provision of data storage technology and infrastructure solutions in Singapore, the United States, the Netherlands, and internationally. The company offers mass capacity storage products, including enterprise nearline hard disk drives (HDDs), enterprise nearline solid state drives (SSDs), enterprise nearline systems, video and image HDDs, and network-attached storage drives. It also offers legacy applications comprising Mission Critical HDDs and SSDs; external storage solutions under the Seagate Ultra Touch, One Touch, Expansion, and Basics product lines, as well as under the LaCie brand name; desktop drives for personal computers and workstation applications; notebook drives traditional notebooks, convertible systems, and external storage applications, DVR HDDs for video streaming applications, and gaming SSDs for gaming rigs. In addition, the company provides Lyve edge-to-cloud mass capacity platform, that includes modular hardware and software to support enterprises' on-premise and cloud storage infrastructure needs. It sells its products primarily to original equipment manufacturers, distributors, and retailers. The company was founded in 1978 and is based in Singapore.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"KeyCorp","Symbol":"KEY","Current Price":"17.62","Latest MA":"16.79","Price Target":21.04,"Difference from MA":"4.92%","Difference from Open":"1.03%","Change from Yesterday":"-2.14%","Change from Last Report":"0.34","Latest Volume":"7,807,835","Market Cap":"19,501,641,728","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":10.100605,"PB Ratio":1.2169349,"Previous Close":17.98,"ROE":0.0096700005,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.231,"Trailing PEG":0.7732,"Trailing PE":"N\/A","Trailing PS":4.0193,"Quick Ratio":"N\/A","Day High":17.745,"Day Low":17.295,"VS Average Volume":0.7189952087,"Company Summary":"KeyCorp operates as the holding company for KeyBank National Association that provides various retail and commercial banking products and services in the United States. It operates in two segments, Consumer Bank and Commercial Bank. The company offers various deposits, investment products and services; commercial leasing, investment management, consumer finance; and personal finance and financial wellness, student loan refinancing, mortgage and home equity, lending, credit card, treasury, business advisory, wealth management, asset management, cash management, portfolio management, and trust and related services to individuals and small and medium-sized businesses. It also provides a suite of banking and capital market products, such as syndicated finance, debt and equity capital market products, commercial payments, equipment finance, commercial mortgage banking, derivatives, foreign exchange, financial advisory, and public finance, as well as commercial mortgage loans to consumer, energy, healthcare, industrial, public sector, real estate, and technology sectors for middle market clients. In addition, the company offers community development financing, securities underwriting, brokerage, and investment banking services. The company was founded in 1849 and is headquartered in Cleveland, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"D.R. Horton, Inc.","Symbol":"DHI","Current Price":"137.57","Latest MA":"166.84","Price Target":167.265,"Difference from MA":"-17.55%","Difference from Open":"-1.64%","Change from Yesterday":"-3.14%","Change from Last Report":"0.00","Latest Volume":"2,422,773","Market Cap":"44,136,448,000","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":9.356296,"PB Ratio":1.7610313,"Previous Close":141.9,"ROE":0.19631,"DTE":22.915,"Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":1.744,"Trailing PEG":0.549,"Trailing PE":9.736023,"Trailing PS":1.1993144,"Quick Ratio":0.766,"Day High":139.98,"Day Low":136.555,"VS Average Volume":0.7927460377,"Company Summary":"D.R. Horton, Inc. operates as a homebuilding company in East, North, Southeast, South Central, Southwest, and Northwest regions in the United States. It engages in the acquisition and development of land; and construction and sale of residential homes in 125 markets across 36 states under the names of D.R. Horton. The company constructs and sells single-family detached homes; and attached homes, such as townhomes, duplexes, and triplexes. It provides mortgage financing services; and title insurance policies, and examination and closing services, as well as engages in the residential lot development business. In addition, the company develops, constructs, owns, leases, and sells multi-family and single-family rental properties; and owns non-residential real estate, including ranch land and improvements. It primarily serves homebuyers. D.R. Horton, Inc. was founded in 1978 and is headquartered in Arlington, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Charles Schwab Corporation (The","Symbol":"SCHW","Current Price":"82.96","Latest MA":"71.13","Price Target":89.5,"Difference from MA":"16.63%","Difference from Open":"2.05%","Change from Yesterday":"0.08%","Change from Last Report":"0.12","Latest Volume":"3,627,380","Market Cap":"151,863,263,232","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":16.002838,"PB Ratio":3.9917238,"Previous Close":82.72,"ROE":0.12111,"DTE":144.242,"Industry":"Capital Markets","Sector":"Financial Services","Beta":0.952,"Trailing PEG":0.9537,"Trailing PE":27.74582,"Trailing PS":8.105426,"Quick Ratio":0.481,"Day High":83.22,"Day Low":80.79,"VS Average Volume":0.4396346773,"Company Summary":"The Charles Schwab Corporation, together with its subsidiaries, operates as a savings and loan holding company that provides wealth management, securities brokerage, banking, asset management, custody, and financial advisory services in the United States and internationally. The company operates in two segments, Investor Services and Advisor Services. It offers brokerage accounts with equity and fixed income trading, margin lending, options trading, futures and forex trading, and cash management capabilities, including certificates of deposit; third-party mutual funds through the Mutual Fund Marketplace and Mutual Fund OneSource service, as well as mutual fund trading and clearing services to broker-dealers; exchange-traded funds; advisory solutions for managed portfolios, separately managed accounts, customized personal advice for tailored portfolios, specialized planning, and full-time portfolio management; banking products comprising checking and savings accounts, first lien residential real estate mortgage loans, home equity lines of credit, and pledged asset lines; and trust custody services, personal trust reporting services, and administrative trustee services. It also provides digital retirement calculators; integrated web-, mobile-, and software-based trading platforms, real-time market data, options trading, premium research, and multi-channel access; self-service education and support tools; online research and analysis tools; equity compensation plan sponsors full-service recordkeeping for stock plans, stock options, restricted stock, performance shares, and stock appreciation rights; retirement plan services; mutual fund clearing services; and advisor services, including interactive tools and educational content. The Company operates through branch offices. The Charles Schwab Corporation was founded in 1971 and is headquartered in Westlake, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Equitable Holdings, Inc.","Symbol":"EQH","Current Price":"53.73","Latest MA":"44.49","Price Target":57.72727,"Difference from MA":"20.75%","Difference from Open":"1.31%","Change from Yesterday":"-1.34%","Change from Last Report":"0.08","Latest Volume":"2,338,273","Market Cap":"16,834,029,568","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":7.3404536,"PB Ratio":10.225542,"Previous Close":54.42,"ROE":0.0433,"DTE":91.997,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.397,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":1.5605849,"Quick Ratio":1.374,"Day High":54.01,"Day Low":52.7,"VS Average Volume":0.8920429748,"Company Summary":"Equitable Holdings, Inc., together with its consolidated subsidiaries, operates as a diversified financial services company worldwide. The company operates through six segments: Individual Retirement, Group Retirement, Investment Management and Research, Protection Solutions, Wealth Management, and Legacy. The Individual Retirement segment offers a suite of variable annuity products primarily to affluent and high net worth individuals. The Group Retirement segment provides tax-deferred investment and retirement services or products to plans sponsored by educational entities, municipalities, and not-for-profit entities, as well as small and medium-sized businesses. The Investment Management and Research segment offers diversified investment management, research, and related services to various clients through institutional. The Protection Solutions segment provides life insurance products, such as VUL insurance and IUL insurance, term life, and employee benefits business, such as dental, vision, life, as well as short- and long-term disability insurance products to small and medium-sized businesses. The Wealth Management segment offers discretionary and non-discretionary investment advisory accounts, financial planning and advice, life insurance, and annuity products. The Legacy segment consists of the capital intensive fixed-rate GMxB business that includes ROP death benefits. The company was formerly known as AXA Equitable Holdings, Inc. and changed its name to Equitable Holdings, Inc. in January 2020. Equitable Holdings, Inc. was founded in 1859 and is based in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"MetLife, Inc.","Symbol":"MET","Current Price":"85.43","Latest MA":"79.28","Price Target":95.21429,"Difference from MA":"7.76%","Difference from Open":"0.86%","Change from Yesterday":"-1.31%","Change from Last Report":"0.12","Latest Volume":"2,169,158","Market Cap":"59,153,436,672","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":8.878371,"PB Ratio":1.9186974,"Previous Close":86.51,"ROE":0.13260001,"DTE":151.463,"Industry":"Insurance - Life","Sector":"Financial Services","Beta":1.039,"Trailing PEG":0.1522,"Trailing PE":17.328602,"Trailing PS":0.8291298,"Quick Ratio":1.349,"Day High":85.755,"Day Low":83.45,"VS Average Volume":0.6265736859,"Company Summary":"MetLife, Inc., a financial services company, provides insurance, annuities, employee benefits, and asset management services worldwide. It operates through six segments: Retirement and Income Solutions; Group Benefits; Asia; Latin America; Europe, the Middle East and Africa; and MetLife Holdings. The company offers life, dental, group short-and long-term disability, individual disability, pet insurance, accidental death and dismemberment, vision, and accident and health coverages, as well as prepaid legal plans; administrative services-only arrangements to employers; and general and separate account, and synthetic guaranteed interest contracts, as well as private floating rate funding agreements. It also provides pension risk transfers, institutional income annuities, structured settlements, and capital markets investment products; and other products and services, such as life insurance products and funding agreements for funding postretirement benefits, as well as company, bank, or trust-owned life insurance used to finance nonqualified benefit programs for executives. In addition, it provides fixed, indexed-linked, and variable annuities; pension products; regular savings products; whole and term life, endowments, universal and variable life, and group life products; longevity reinsurance solutions; credit insurance products; and protection against long-term health care services. MetLife, Inc. was incorporated in 1999 and is based in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Uber Technologies, Inc.","Symbol":"UBER","Current Price":"67.53","Latest MA":"70.33","Price Target":88.6338,"Difference from MA":"-3.99%","Difference from Open":"3.41%","Change from Yesterday":"0.96%","Change from Last Report":"-0.12","Latest Volume":"19,807,145","Market Cap":"142,188,068,864","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":21.305296,"PB Ratio":9.613468,"Previous Close":66.85,"ROE":0.34326,"DTE":80.343,"Industry":"Software - Application","Sector":"Technology","Beta":1.337,"Trailing PEG":0.7077,"Trailing PE":33.26355,"Trailing PS":3.3890612,"Quick Ratio":1.223,"Day High":68.85,"Day Low":65.1781,"VS Average Volume":0.7898130533,"Company Summary":"Uber Technologies, Inc. develops and operates proprietary technology applications in the United States, Canada, Latin America, Europe, the Middle East, Africa, and Asia excluding China and Southeast Asia. It operates through three segments: Mobility, Delivery, and Freight. The Mobility segment connects consumers with a range of transportation modalities, such as ridesharing, carsharing, micromobility, rentals, public transit, taxis, and other modalities; and offers riders in a variety of vehicle types, as well as financial partnerships products and advertising services. The Delivery segment allows to search for and discover restaurants to grocery, alcohol, convenience, and other retails; order a meal or other items; and Uber direct, a white-label Delivery-as-a-Service for retailers and restaurants, as well as advertising. The Freight segment manages transportation and logistics network, which connects shippers and carriers in digital marketplace including carriers upfronts, pricing, and shipment booking; and provides on-demand platform to automate logistics end-to-end transactions for small-and medium-sized business to global enterprises. The company was formerly known as Ubercab, Inc. and changed its name to Uber Technologies, Inc. in February 2011. Uber Technologies, Inc. was founded in 2009 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Coherent Corp.","Symbol":"COHR","Current Price":"88.23","Latest MA":"88.39","Price Target":112.86111,"Difference from MA":"-0.19%","Difference from Open":"4.50%","Change from Yesterday":"-2.90%","Change from Last Report":"-0.17","Latest Volume":"2,247,945","Market Cap":"13,646,005,248","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.323593,"PB Ratio":2.4782317,"Previous Close":90.49,"ROE":-0.00863,"DTE":50.88,"Industry":"Scientific & Technical Instruments","Sector":"Technology","Beta":1.654,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":2.7277062,"Quick Ratio":1.371,"Day High":89.3692,"Day Low":84.11,"VS Average Volume":0.7783511294,"Company Summary":"Coherent Corp. develops, manufactures, and markets engineered materials, optoelectronic components and devices, and optical and laser systems and subsystems for the use in the industrial, communications, electronics, and instrumentation markets worldwide. It operates through three segments: Networking, Materials, and Lasers. The Networking segment offers telecommunication products for fiber-optic transmission; datacom transceivers, including pluggable transceivers for ethernet and fiber channel applications; and advanced optics, such as fiber and precision optics used in projection displays, crystal materials and components for optical communications, filters and assemblies for life sciences, sensors, instrumentation, and semiconductor equipment, as well as ultraviolet (UV), visible, and near-infrared spectroscopy optics for industrial lasers. The Materials segments provides laser optics and accessories; infrared thermal imaging optics and assemblies; polycrystalline materials; thermoelectric components, subassemblies, and systems; ceramic and metal-matrix composite products; semiconductor lasers and laser bars; Q-switched laser modules, uncooled pump laser modules, and laser systems for superhard materials processing; laser processing heads and beam delivery systems; EELs, VCSELs, and detectors; pumps for amplifiers; precision optical assemblies, infrared optics, thin-film coatings and optical materials; optical solutions; and integrated circuits for transceivers. The Lasers segment offers UV gas and solid-state lasers; UV optical systems, line beams, and mask-based imaging systems; UV nanosecond lasers; continuous-wave lasers and systems; amplifiers; subsystems and standard systems; IR lasers; crystals and diode lasers, and specialty polishing and coating solutions. The company was formerly known as II-VI Incorporated and changed its name to Coherent Corp. in September 2022. Coherent Corp. was incorporated in 1971 and is headquartered in Saxonburg, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Corteva, Inc.","Symbol":"CTVA","Current Price":"64.86","Latest MA":"57.33","Price Target":67.09091,"Difference from MA":"13.14%","Difference from Open":"0.84%","Change from Yesterday":"-0.63%","Change from Last Report":"-0.07","Latest Volume":"2,301,784","Market Cap":"44,577,824,768","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.343895,"PB Ratio":1.8069872,"Previous Close":65.27,"ROE":0.02704,"DTE":22.883,"Industry":"Agricultural Inputs","Sector":"Basic Materials","Beta":0.773,"Trailing PEG":1.3032,"Trailing PE":67.5625,"Trailing PS":2.6794388,"Quick Ratio":0.88,"Day High":65.085,"Day Low":63.16,"VS Average Volume":0.6708147229,"Company Summary":"Corteva, Inc. operates in the agriculture business. It operates through two segments, Seed and Crop Protection. The Seed segment develops and supplies advanced germplasm and traits that produce optimum yield for farms. It offers trait technologies that enhance resistance to weather, disease, insects, and herbicides used to control weeds, as well as food and nutritional characteristics. This segment also provides digital solutions that assist farmer decision-making with a view to optimize product selection, and maximize yield and profitability. The Crop Protection segment offers products that protect against weeds, insects and other pests, and diseases, as well as enhances crop health above and below ground through nitrogen management and seed-applied technologies. This segment provides herbicides, insecticides, nitrogen stabilizers, and pasture and range management herbicides. It serves agricultural input industry. The company operates in the United States, Canada, Latin America, the Asia Pacific, Europe, the Middle East, and Africa. Corteva, Inc. was incorporated in 2018 and is headquartered in Indianapolis, Indiana.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Johnson Controls International ","Symbol":"JCI","Current Price":"77.13","Latest MA":"75.31","Price Target":88.53333,"Difference from MA":"2.42%","Difference from Open":"0.90%","Change from Yesterday":"-1.18%","Change from Last Report":"0.12","Latest Volume":"2,911,185","Market Cap":"50,916,519,936","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":18.941038,"PB Ratio":3.187585,"Previous Close":78.0,"ROE":0.0805,"DTE":54.68,"Industry":"Building Products & Equipment","Sector":"Industrials","Beta":1.306,"Trailing PEG":1.3301,"Trailing PE":37.08173,"Trailing PS":2.2183914,"Quick Ratio":0.557,"Day High":77.44,"Day Low":75.89,"VS Average Volume":0.7787029842,"Company Summary":"Johnson Controls International plc, together with its subsidiaries, engages in engineering, manufacturing, commissioning, and retrofitting building products and systems in the United States, Europe, the Asia Pacific, and internationally. It operates through four segments: Building Solutions North America, Building Solutions EMEA\/LA, Building Solutions Asia Pacific, and Global Products. The company designs, sells, installs, and services heating, ventilating, air conditioning, controls, building management, refrigeration, integrated electronic security, integrated fire detection and suppression systems, and fire protection and security products. It also provides energy efficiency solutions and technical services, including inspection, scheduled maintenance, and repair and replacement of mechanical and control systems, as well as data-driven smart building solutions. In addition, the company offers control software and software services. It sells its products and services to commercial, institutional, industrial, data center, and governmental customers. Johnson Controls International plc was incorporated in 1885 and is headquartered in Cork, Ireland.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Ford Motor Company","Symbol":"F","Current Price":"9.96","Latest MA":"10.79","Price Target":11.68125,"Difference from MA":"-7.72%","Difference from Open":"2.42%","Change from Yesterday":"-1.34%","Change from Last Report":"0.08","Latest Volume":"115,105,435","Market Cap":"39,564,054,528","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":5.9837947,"PB Ratio":0.8928251,"Previous Close":10.08,"ROE":0.0799,"DTE":359.359,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":1.636,"Trailing PEG":0.8746,"Trailing PE":11.3125,"Trailing PS":0.21650106,"Quick Ratio":0.942,"Day High":10.055,"Day Low":9.6,"VS Average Volume":1.9173200835,"Company Summary":"Ford Motor Company develops, delivers, and services a range of Ford trucks, commercial cars and vans, sport utility vehicles, and Lincoln luxury vehicles worldwide. It operates through Ford Blue, Ford Model e, and Ford Pro; Ford Next; and Ford Credit segments. The company sells Ford and Lincoln vehicles, service parts, and accessories through distributors and dealers, as well as through dealerships to commercial fleet customers, daily rental car companies, and governments. It also engages in vehicle-related financing and leasing activities to and through automotive dealers. In addition, the company provides retail installment sale contracts for new and used vehicles; and direct financing leases for new vehicles to retail and commercial customers, such as leasing companies, government entities, daily rental companies, and fleet customers. Further, it offers wholesale loans to dealers to finance the purchase of vehicle inventory; and loans to dealers to finance working capital and enhance dealership facilities, purchase dealership real estate, and other dealer vehicle programs. The company was incorporated in 1903 and is based in Dearborn, Michigan.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Boston Scientific Corporation","Symbol":"BSX","Current Price":"103.25","Latest MA":"85.43","Price Target":103.49156,"Difference from MA":"20.85%","Difference from Open":"1.81%","Change from Yesterday":"0.80%","Change from Last Report":"0.11","Latest Volume":"3,898,515","Market Cap":"152,165,580,800","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":36.703983,"PB Ratio":7.3463073,"Previous Close":102.36,"ROE":0.08916,"DTE":53.722,"Industry":"Medical Devices","Sector":"Healthcare","Beta":0.797,"Trailing PEG":1.8557,"Trailing PE":85.32645,"Trailing PS":9.563546,"Quick Ratio":0.847,"Day High":103.86,"Day Low":100.7,"VS Average Volume":0.7344628777,"Company Summary":"Boston Scientific Corporation develops, manufactures, and markets medical devices for use in various interventional medical specialties worldwide. It operates through two segments, MedSurg and Cardiovascular. The company offers devices to diagnose and treat gastrointestinal and pulmonary conditions, such as resolution clips, biliary stent systems, stents and electrocautery enhanced delivery systems, direct visualization systems, digital catheters, and single-use duodenoscopes; devices to treat urological conditions, including ureteral stents, catheters, baskets, guidewires, sheaths, balloons, single-use digital flexible ureteroscopes, holmium laser systems, artificial urinary sphincter, laser system, fiber, and hydrogel systems; and devices to treat neurological movement disorders and manage chronic pain, such as spinal cord stimulator system, proprietary programming software, radiofrequency generator, indirect decompression systems, practice optimization tools, and deep brain stimulation system. It also provides technologies for diagnosing and treating coronary artery disease and aortic valve conditions; WATCHMAN FLX, a Left Atrial Appendage Closure Device; and implantable devices that monitor the heart and deliver electricity to treat cardiac abnormalities, such as cardioverter and cardiac resynchronization therapy defibrillators, MRI S-ICD systems, cardiac resynchronization therapy pacemakers, quadripolar LV leads, ICD leads, pacing leads, remote patient management systems, insertable cardiac monitor systems, and remote cardiac monitoring systems. In addition, the company offers diagnosis and treatment of rate and rhythm disorders of the heart; peripheral arterial and venous diseases; and products to diagnose, treat and ease forms of cancer. The company was incorporated in 1979 and is headquartered in Marlborough, Massachusetts.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Ares Capital Corporation","Symbol":"ARCC","Current Price":"23.77","Latest MA":"20.88","Price Target":22.82143,"Difference from MA":"13.82%","Difference from Open":"2.19%","Change from Yesterday":"0.51%","Change from Last Report":"0.06","Latest Volume":"4,283,247","Market Cap":"15,941,967,872","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":10.779166,"PB Ratio":1.2022052,"Previous Close":23.67,"ROE":0.1338,"DTE":106.255,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.054,"Trailing PEG":null,"Trailing PE":9.142308,"Trailing PS":5.4261293,"Quick Ratio":1.29,"Day High":23.7791,"Day Low":23.18,"VS Average Volume":0.9629753616,"Company Summary":"Ares Capital Corporation is a business development company specializing in acquisition, recapitalization, mezzanine debt, restructurings, rescue financing, and leveraged buyout transactions of middle market companies. It also makes growth capital and general refinancing. It prefers to make investments in companies engaged in the basic and growth manufacturing, business services, consumer products, health care products and services, and information technology service sectors. The fund will also consider investments in industries such as restaurants, retail, oil and gas, and technology sectors. It focuses on investments in Northeast, Mid-Atlantic, Southeast and Southwest regions from its New York office, the Midwest region, from the Chicago office, and the Western region from the Los Angeles office. The fund typically invests between $20 million and $200 million and a maximum of $400 million in companies with an EBITDA between $10 million and $250 million. It makes debt investments between $10 million and $100 million The fund invests through revolvers, first lien loans, warrants, unitranche structures, second lien loans, mezzanine debt, private high yield, junior capital, subordinated debt, and non-control preferred and common equity. The fund also selectively considers third-party-led senior and subordinated debt financings and opportunistically considers the purchase of stressed and discounted debt positions. The fund prefers to be an agent and\/or lead the transactions in which it invests. The fund also seeks board representation in its portfolio companies.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Emerson Electric Company","Symbol":"EMR","Current Price":"128.24","Latest MA":"115.51","Price Target":140.15259,"Difference from MA":"11.02%","Difference from Open":"1.08%","Change from Yesterday":"-1.34%","Change from Last Report":"-0.00","Latest Volume":"2,744,964","Market Cap":"73,039,273,984","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":19.805565,"PB Ratio":3.3797495,"Previous Close":129.95,"ROE":0.05933,"DTE":30.376,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":1.292,"Trailing PEG":null,"Trailing PE":45.47681,"Trailing PS":4.1755815,"Quick Ratio":1.323,"Day High":129.09,"Day Low":126.24,"VS Average Volume":0.8722880463,"Company Summary":"Emerson Electric Co., a technology and software company, provides various solutions in the Americas, Asia, the Middle East, Africa, and Europe. It operates through seven segments: Final Control, Measurement & Analytical, Discrete Automation, Safety & Productivity, Control Systems & Software, Test & Measurement, and AspenTech. The Final Control segment provides control, isolation, shutoff, pressure relief, and pressure safety valves, actuators, and regulators for process and hybrid industries. The Measurement & Analytical segment offers intelligent instrumentation measuring the physical properties of liquids or gases, such as pressure, temperature, level, flow, acoustics, corrosion, pH, conductivity, water quality, toxic gases, and flame. The Discrete Automation segment offers solenoid and pneumatic valves, valve position indicators, pneumatic cylinders, actuators, air preparation equipment, pressure and temperature switches, electric linear motion solutions, programmable automation control systems, electrical distribution equipment, and materials joining solutions. The Safety & Productivity segment offers tools for professionals and homeowners; pipe-working tools, including pipe wrenches, pipe cutters, pipe threading and roll grooving equipment, battery hydraulic tools; electrical tools; and other professional tools. The Control Systems & Software segment provides control systems, safety instrumented systems, SCADA systems, application software, digital twins, asset performance management, and cybersecurity. The Test & Measurement provides software-connected automated test and measurement systems. The AspenTech segment provides asset optimization software that enables industrial manufacturers to design, operate, and maintain operations for enhancing performance through a combination of decades of modeling, simulation, and optimization capabilities. The company was incorporated in 1890 and is based in Saint Louis, Missouri.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Walt Disney Company (The)","Symbol":"DIS","Current Price":"113.93","Latest MA":"99.86","Price Target":124.56071,"Difference from MA":"14.09%","Difference from Open":"2.32%","Change from Yesterday":"0.80%","Change from Last Report":"0.09","Latest Volume":"6,267,906","Market Cap":"206,037,843,968","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":18.689304,"PB Ratio":2.0561643,"Previous Close":113.06,"ROE":0.0546,"DTE":45.188,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.398,"Trailing PEG":0.9926,"Trailing PE":41.88603,"Trailing PS":2.2885973,"Quick Ratio":0.531,"Day High":114.03,"Day Low":110.86,"VS Average Volume":0.6756001431,"Company Summary":"The Walt Disney Company operates as an entertainment company worldwide. It operates through three segments: Entertainment, Sports, and Experiences. The company produces and distributes film and television video streaming content under the ABC Television Network, Disney, Freeform, FX, Fox, National Geographic, and Star brand television channels, as well as ABC television stations and A+E television networks; and produces original content under the ABC Signature, Disney Branded Television, FX Productions, Lucasfilm, Marvel, National Geographic Studios, Pixar, Searchlight Pictures, Twentieth Century Studios, 20th Television, and Walt Disney Pictures banners. It also offers direct-to-consumer streaming services through Disney+, Disney+ Hotstar, Hulu, and Star+; sports-related entertainment services through ESPN, ESPN on ABC, ESPN+ DTC, and Star; sale\/licensing of film and episodic content to third-party television and VOD services; theatrical, home entertainment, and music distribution services; DVD and Blu-ray discs, electronic home video licenses, and VOD rental services; staging and licensing of live entertainment events; and post-production services. In addition, the company operates theme parks and resorts comprising Walt Disney World Resort, Disneyland Resort, Disneyland Paris, Hong Kong Disneyland Resort, Shanghai Disney Resort, Disney Cruise Line, Disney Vacation Club, National Geographic Expeditions, and Adventures by Disney, as well as Aulani, a Disney resort and spa in Hawaii. It also licenses its intellectual property to a third party for operations of the Tokyo Disney Resort; licenses trade names, characters, visual, literary, and other IP for use on merchandise, published materials, and games; operates a direct-to-home satellite distribution platform; sells branded merchandise through retail, online, and wholesale businesses; and develops and publishes books, comic books, and magazines. The company was founded in 1923 and is based in Burbank, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Pepsico, Inc.","Symbol":"PEP","Current Price":"150.19","Latest MA":"163.58","Price Target":172.62045,"Difference from MA":"-8.18%","Difference from Open":"0.42%","Change from Yesterday":"-0.26%","Change from Last Report":"0.03","Latest Volume":"4,666,457","Market Cap":"206,059,175,936","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":17.607145,"PB Ratio":10.60065,"Previous Close":150.69,"ROE":0.48819,"DTE":229.605,"Industry":"Beverages - Non-Alcoholic","Sector":"Consumer Defensive","Beta":0.542,"Trailing PEG":1.8127,"Trailing PE":22.151917,"Trailing PS":2.241723,"Quick Ratio":0.664,"Day High":151.12,"Day Low":148.83,"VS Average Volume":0.7373847811,"Company Summary":"PepsiCo, Inc. engages in the manufacture, marketing, distribution, and sale of various beverages and convenient foods worldwide. The company operates through seven segments: Frito-Lay North America; Quaker Foods North America; PepsiCo Beverages North America; Latin America; Europe; Africa, Middle East and South Asia; and Asia Pacific, Australia and New Zealand and China Region. It provides dips, cheese-flavored snacks, and spreads, as well as corn, potato, and tortilla chips; cereals, rice, pasta, mixes and syrups, granola bars, grits, oatmeal, rice cakes, and side dishes; beverage concentrates, fountain syrups, and finished goods; ready-to-drink tea, coffee, and juices; dairy products; and sparkling water makers and related products, as well as distributes alcoholic beverages under Hard MTN Dew brand. The company offers its products primarily under the Lay's, Doritos, Fritos, Tostitos, BaiCaoWei, Cheetos, Cap'n Crunch, Life, Pearl Milling Company, Gatorade, Pepsi-Cola, Mountain Dew, Quaker, Rice-A-Roni, Aquafina, Bubly, Emperador, Diet Mountain Dew, Diet Pepsi, Gatorade Zero, Crush, Propel, Dr Pepper, Schweppes, Marias Gamesa, Ruffles, Sabritas, Saladitas, Tostitos, 7UP, Diet 7UP, H2oh!, Manzanita Sol, Mirinda, Pepsi Black, Pepsi Max, San Carlos, Toddy, Walkers, Chipsy, Kurkure, Sasko, Spekko, White Star, Smith's, Sting, SodaStream, Lubimyj Sad, Agusha, Chudo, Domik v Derevne, Lipton, and other brands. It serves wholesale and other distributors, foodservice customers, grocery stores, drug stores, convenience stores, discount\/dollar stores, mass merchandisers, membership stores, hard discounters, e-commerce retailers and authorized independent bottlers, and others through a network of direct-store-delivery, customer warehouse, and distributor networks, as well as directly to consumers through e-commerce platforms and retailers. The company was founded in 1898 and is based in Purchase, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"NOV Inc.","Symbol":"NOV","Current Price":"14.40","Latest MA":"16.35","Price Target":18.91667,"Difference from MA":"-11.89%","Difference from Open":"1.23%","Change from Yesterday":"-0.69%","Change from Last Report":"0.17","Latest Volume":"2,463,791","Market Cap":"5,604,754,944","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":9.696485,"PB Ratio":0.86709195,"Previous Close":14.45,"ROE":0.17694001,"DTE":36.848,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.674,"Trailing PEG":null,"Trailing PE":5.335185,"Trailing PS":0.6293942,"Quick Ratio":1.55,"Day High":14.56,"Day Low":14.0,"VS Average Volume":0.6332015422,"Company Summary":"NOV Inc. designs, constructs, manufactures, and sells systems, components, and products for oil and gas drilling and production, and industrial and renewable energy sectors in the United States and internationally. It operates through two segments, Energy Equipment, and Energy Products and Services. The company provides solids control and waste management equipment and services, managed pressure drilling, drilling fluids, premium drillpipe, wired pipe, drilling optimization services, tubular inspection and coating services, instrumentation, downhole tools, and drill bits. It also offers equipment and technologies for hydraulic fracture stimulation, including downhole multistage fracturing tools, pressure pumping trucks, blenders, sanders, hydration and injection units, flowline, and manifolds; coiled tubing units, and wireline units and tools; connections and liner hangers; onshore production consists of composite pipe, surface transfer and progressive cavity pumps, and artificial lift systems; and offshore production, such as floating production systems and subsea production technologies, as well as manufactures industrial pumps and mixers. In addition, the company provides substructures, derricks, and masts; cranes; jacking systems; pipe lifting, racking, rotating, and assembly systems; mud pumps; pressure control equipment; drives and generators; rig instrumentation and control systems; mooring, anchor, and deck handling machinery; equipment components for offshore wind construction vessels; and pipelay and construction systems. Further, the company offers spare parts, repair, and rentals as well as comprehensive remote equipment monitoring, technical support, field service, and customer training. The company was formerly known as National Oilwell Varco, Inc. and changed its name to NOV Inc. in January 2021. NOV Inc. was founded in 1862 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Enterprise Products Partners L.","Symbol":"EPD","Current Price":"33.13","Latest MA":"29.55","Price Target":35.66722,"Difference from MA":"12.14%","Difference from Open":"4.89%","Change from Yesterday":"1.47%","Change from Last Report":"0.07","Latest Volume":"5,781,699","Market Cap":"71,822,753,792","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":11.467818,"PB Ratio":2.5336442,"Previous Close":32.65,"ROE":0.20665,"DTE":110.757,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":1.014,"Trailing PEG":3.166,"Trailing PE":12.456766,"Trailing PS":1.2680571,"Quick Ratio":0.719,"Day High":33.18,"Day Low":31.5101,"VS Average Volume":1.3245769701,"Company Summary":"Enterprise Products Partners L.P. provides midstream energy services to producers and consumers of natural gas, natural gas liquids (NGLs), crude oil, petrochemicals, and refined products. It operates in four segments: NGL Pipelines & Services, Crude Oil Pipelines & Services, Natural Gas Pipelines & Services, and Petrochemical & Refined Products Services. The NGL Pipelines & Services segment offers natural gas processing and related NGL marketing services. It operates natural gas processing facilities located in Colorado, Louisiana, Mississippi, New Mexico, Texas, and Wyoming; NGL pipelines; NGL fractionation facilities; NGL and related product storage facilities; and NGL marine terminals. The Crude Oil Pipelines & Services segment operates crude oil pipelines; and crude oil storage and marine terminals, which include a fleet of approximately 250 tractor-trailer tank trucks that are used to transport crude oil. It also engages in crude oil marketing activities. The Natural Gas Pipelines & Services segment operates natural gas pipeline systems to gather, treat, and transport natural gas. It leases underground salt dome natural gas storage facilities in Napoleonville, Louisiana; owns an underground salt dome storage cavern in Wharton County, Texas; and markets natural gas. The Petrochemical & Refined Products Services segment operates propylene fractionation facilities, including propylene fractionation units and propane dehydrogenation facilities, and related marketing activities; butane isomerization complex and related deisobutanizer operations; and octane enhancement, isobutane dehydrogenation, and high purity isobutylene production facilities. It also operates refined products pipelines and terminals; and ethylene export terminals; and provides refined products marketing and marine transportation services. Enterprise Products Partners L.P. was founded in 1968 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Pfizer, Inc.","Symbol":"PFE","Current Price":"26.27","Latest MA":"27.17","Price Target":31.12955,"Difference from MA":"-3.30%","Difference from Open":"-0.10%","Change from Yesterday":"-0.96%","Change from Last Report":"0.04","Latest Volume":"32,888,005","Market Cap":"148,900,167,680","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":8.96201,"PB Ratio":1.6131507,"Previous Close":26.52,"ROE":0.04538,"DTE":73.408,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.615,"Trailing PEG":0.1987,"Trailing PE":35.033333,"Trailing PS":2.5077922,"Quick Ratio":0.64,"Day High":26.465,"Day Low":26.15,"VS Average Volume":0.7581029909,"Company Summary":"Pfizer Inc. discovers, develops, manufactures, markets, distributes, and sells biopharmaceutical products in the United States, Europe, and internationally. The company offers medicines and vaccines in various therapeutic areas, including cardiovascular metabolic, migraine, and women's health under the Eliquis, Nurtec ODT\/Vydura, Zavzpret, and the Premarin family brands; infectious diseases with unmet medical needs under the Prevnar family, Abrysvo, Nimenrix, FSME\/IMMUN-TicoVac, and Trumenba brands; and COVID-19 prevention and treatment, and potential future mRNA and antiviral products under the Comirnaty and Paxlovid brands. It also provides medicines and vaccines in various therapeutic areas, such as biosimilars for chronic immune and inflammatory diseases under the Xeljanz, Enbrel, Inflectra, Litfulo, Velsipity, and Cibinqo brands; amyloidosis, hemophilia, endocrine diseases, and sickle cell disease under the Vyndaqel family, Oxbryta, BeneFIX, Somavert, Ngenla, and Genotropin brands; sterile injectable and anti-infective medicines under the Sulperazon, Medrol, Zavicefta, Zithromax, and Panzyga brands; and biologics, small molecules, immunotherapies, and biosimilars under the Ibrance, Xtandi, Inlyta, Bosulif, Mektovi, Padcev, Adcetris, Talzenna, Tukysa, Elrexfio, Tivdak, Lorbrena, and Braftovi brands. In addition, the company involved in the contract manufacturing business. It serves wholesalers, retailers, hospitals, clinics, government agencies, pharmacies, individual provider offices, retail pharmacies, and integrated delivery systems. The company has collaboration agreements with Bristol-Myers Squibb Company; Astellas Pharma US, Inc.; Merck KGaA; and BioNTech SE, as well as has strategic clinical collaboration with Acepodia Inc. for the development of antibody-cell conjugation-based cell therapies in autoimmune diseases. Pfizer Inc. was founded in 1849 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Alphabet Inc.","Symbol":"GOOGL","Current Price":"201.81","Latest MA":"174.61","Price Target":216.36867,"Difference from MA":"15.58%","Difference from Open":"0.57%","Change from Yesterday":"-1.12%","Change from Last Report":"-0.01","Latest Volume":"18,295,889","Market Cap":"2,479,013,756,928","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":22.434425,"PB Ratio":7.8792014,"Previous Close":204.02,"ROE":0.32101002,"DTE":9.324,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.034,"Trailing PEG":1.3332,"Trailing PE":26.729801,"Trailing PS":7.2942414,"Quick Ratio":1.761,"Day High":203.75,"Day Low":200.11,"VS Average Volume":0.6676767638,"Company Summary":"Alphabet Inc. offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube. It is also involved in the sale of apps and in-app purchases and digital content in the Google Play and YouTube; and devices, as well as in the provision of YouTube consumer subscription services. The Google Cloud segment offers infrastructure, cybersecurity, databases, analytics, AI, and other services; Google Workspace that include cloud-based communication and collaboration tools for enterprises, such as Gmail, Docs, Drive, Calendar, and Meet; and other services for enterprise customers. The Other Bets segment sells healthcare-related and internet services. The company was incorporated in 1998 and is headquartered in Mountain View, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Apollo Global Management, Inc. ","Symbol":"APO","Current Price":"168.10","Latest MA":"140.58","Price Target":187.11765,"Difference from MA":"19.58%","Difference from Open":"1.09%","Change from Yesterday":"-1.83%","Change from Last Report":"0.01","Latest Volume":"2,281,217","Market Cap":"95,113,674,752","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":19.789415,"PB Ratio":5.7766323,"Previous Close":170.98,"ROE":0.33501,"DTE":92.115,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.589,"Trailing PEG":null,"Trailing PE":17.750792,"Trailing PS":3.0031788,"Quick Ratio":1.877,"Day High":169.495,"Day Low":165.23,"VS Average Volume":0.4062624719,"Company Summary":"Apollo Global Management, Inc. is a private equity firm specializing in investments in credit, private equity, infrastructure, secondaries and real estate markets. The firm prefers to invest in private and public markets. The firm's private equity investments include traditional buyouts, recapitalization, distressed buyouts and debt investments in real estate, corporate partner buyouts, distressed asset, corporate carve-outs, middle market, growth, venture capital, turnaround, bridge, corporate restructuring, special situation, acquisition, and industry consolidation transactions. For credit strategies, the firm focuses to invest in multi-sector credit, semi-liquid credit, direct lending, first lien, unitranche, whole loans and private credit. The firm provides its services to endowment and sovereign wealth funds, as well as other institutional and individual investors. It manages client focused portfolios. The firm launches and manages hedge funds for its clients. It also manages real estate funds and private equity funds for its clients. The firm invests in the fixed income and alternative investment markets across the globe. Its fixed income investments include income-oriented senior loans, bonds, collateralized loan obligations, structured credit, opportunistic credit, non-performing loans, distressed debt, mezzanine debt, and value oriented fixed income securities. The firm seeks to invest in chemicals, commodities, consumer and retail, oil and gas, metals, mining, agriculture, commodities, distribution and transportation, financial and business services, manufacturing and industrial, media distribution, cable, entertainment and leisure, telecom, technology, natural resources, energy, packaging and materials, and satellite and wireless industries. It also focuses on clean energy, sustainable industry, climate solutions, energy transition, industrial decarbonization, sustainable mobility, sustainable resource use, and sustainable real estate. It seeks to invest in companies based in across Africa, Asia, North America with a focus on United States, Western Europe and Europe. It employs a combination of contrarian, value, and distressed strategies to make its investments. The firm seeks to make investments in the range of $75 million and $1500 million. The firm seeks to invest in companies with Enterprise value between $750 million to $2500 million. The firm conducts in-house research to create its investment portfolio. It seeks to acquire minority and majority positions in its portfolio companies. Apollo Global Management, Inc. was founded in 1990 and is headquartered in New York, New York with additional offices in North America, Asia, Africa and Europe.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Super Micro Computer, Inc.","Symbol":"SMCI","Current Price":"27.25","Latest MA":"46.40","Price Target":40.79182,"Difference from MA":"-41.28%","Difference from Open":"0.09%","Change from Yesterday":"-4.73%","Change from Last Report":"-0.24","Latest Volume":"37,046,358","Market Cap":"15,953,718,272","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.38481,"PB Ratio":2.9232833,"Previous Close":28.52,"ROE":0.32469,"DTE":39.749,"Industry":"Computer Hardware","Sector":"Technology","Beta":1.279,"Trailing PEG":null,"Trailing PE":13.554727,"Trailing PS":1.0676486,"Quick Ratio":1.805,"Day High":27.61,"Day Low":25.71,"VS Average Volume":0.5206304095,"Company Summary":"Super Micro Computer, Inc., together with its subsidiaries, develops and manufactures high performance server and storage solutions based on modular and open architecture in the United States, Europe, Asia, and internationally. Its solutions range from complete server, storage systems, modular blade servers, blades, workstations, full racks, networking devices, server sub-systems, server management software, and security software. The company provides application-optimized server solutions, rackmount and blade servers, storage, and subsystems and accessories; and server software management solutions, such as Server Management Suite, including Supermicro Server Manager, Supermicro Power Management software, Supermicro Update Manager, SuperCloud Composer, and SuperDoctor 5. In addition, it offers server subsystems and accessories comprising server boards, chassis, power supplies, and other accessories. Further, the company provides server and storage system integration, configuration, and software upgrade and update services; and technical documentation services, as well as identifies service requirements, creates and executes project plans, and conducts verification testing and technical documentation, and training services. Additionally, it offers help desk and on-site product support services for its server and storage systems; and customer support services, including ongoing maintenance and technical support for its products. The company provides its products to enterprise data centers, cloud computing, artificial intelligence, and 5G and edge computing markets. It sells its products through direct and indirect sales force, distributors, value-added resellers, system integrators, and original equipment manufacturers. The company was incorporated in 1993 and is headquartered in San Jose, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Lumen Technologies, Inc.","Symbol":"LUMN","Current Price":"4.91","Latest MA":"5.53","Price Target":5.37091,"Difference from MA":"-11.33%","Difference from Open":"3.70%","Change from Yesterday":"-0.91%","Change from Last Report":"0.41","Latest Volume":"7,540,319","Market Cap":"4,977,643,008","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":-7.327458,"PB Ratio":14.554896,"Previous Close":4.94,"ROE":-1.6673199,"DTE":5502.924,"Industry":"Telecom Services","Sector":"Communication Services","Beta":1.201,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.37437147,"Quick Ratio":0.988,"Day High":4.95,"Day Low":4.57,"VS Average Volume":0.531599504,"Company Summary":"Lumen Technologies, Inc., a facilities-based technology and communications company, provides various integrated products and services to business and residential customers in the United States and internationally. The company operates in two segments, Business and Mass Markets. It offers dark fiber, edge cloud services, internet protocol, managed security, software-defined wide area networks, secure access service edge, unified communications and collaboration, and optical wavelengths services; ethernet and VPN data networks services; and legacy services to manage cash flow, including time division multiplexing voice, private line, and other legacy services, as well as sells communication equipment, and IT solutions. The company also provides high speed and lower speed broadband service to residential and small business customers; local and long-distance voice services, professional services, and other ancillary services; and federal broadband and state support programs. It serves its products and services under the Lumen, Quantum Fiber, and CenturyLink brands. The company was formerly known as CenturyLink, Inc. and changed its name to Lumen Technologies, Inc. in September 2020. Lumen Technologies, Inc. was incorporated in 1968 and is headquartered in Monroe, Louisiana.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"03-02-2025 22:43:53"},{"Company Name":"Archer-Daniels-Midland Company","Symbol":"ADM","Current Price":"50.18","Latest MA":"56.11","Price Target":54.54545,"Difference from MA":"-10.57%","Difference from Open":"-1.38%","Change from Yesterday":"-2.07%","Change from Last Report":"-0.08","Latest Volume":"2,590,345","Market Cap":"24,012,836,864","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":10.740191,"PB Ratio":1.0667291,"Previous Close":51.23,"ROE":0.1075,"DTE":52.874,"Industry":"Farm Products","Sector":"Consumer Defensive","Beta":0.722,"Trailing PEG":null,"Trailing PE":14.095506,"Trailing PS":0.2705123,"Quick Ratio":0.375,"Day High":51.0,"Day Low":50.08,"VS Average Volume":0.8076937708,"Company Summary":"Archer-Daniels-Midland Company engages in the procurement, transportation, storage, processing, and merchandising of agricultural commodities, ingredients, flavors, and solutions in the United States, Switzerland, the Cayman Islands, Brazil, Mexico, Canada, the United Kingdom, and internationally. It operates in three segments: Ag Services and Oilseeds, Carbohydrate Solutions, and Nutrition. The company originates, merchandises, stores, and transports agricultural raw materials, such as oilseeds and soft seeds. It also engages in the agricultural commodity and feed product import, export, and distribution; and various structured trade finance activities. In addition, the company offers soybean meal and oil; vegetable and salad oils and protein meals; ingredients for the food, feed, energy, and industrial customers; margarine, shortening, and other food products; and partially refined oils to produce biodiesel and glycols for use in chemicals, paints, and other industrial products. Further, it provides peanuts, peanut-derived ingredients, and cotton cellulose pulp; sweeteners, corn and wheat starches, syrup, glucose, wheat flour, and dextrose; alcohol, and other food and animal feed ingredients; ethyl alcohol and ethanol; corn gluten feed and meal; distillers' grains; corn germ; and citric acids. Additionally, the company provides proteins, natural flavors, flavor systems, natural colors, emulsifiers, soluble fiber, polyols, hydrocolloids, probiotics, prebiotics, postbiotics, enzymes, and botanical extracts; and other specialty food and feed ingredients; edible beans; formula feeds, and animal health and nutrition products; and contract and private label pet treats and food products. It also offers futures commission merchant; commodity brokerage services; cash margins and securities pledged to commodity exchange clearinghouse; and cash pledged as security under certain insurance arrangements. The company was founded in 1902 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"03-02-2025 22:44:57"},{"Company Name":"Juniper Networks, Inc.","Symbol":"JNPR","Current Price":"34.52","Latest MA":"37.71","Price Target":39.7,"Difference from MA":"-8.47%","Difference from Open":"-0.48%","Change from Yesterday":"-0.77%","Change from Last Report":"0.01","Latest Volume":"3,381,943","Market Cap":"11,427,535,872","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":17.28403,"PB Ratio":2.4599102,"Previous Close":34.86,"ROE":0.055760004,"DTE":39.109,"Industry":"Communication Equipment","Sector":"Technology","Beta":0.921,"Trailing PEG":null,"Trailing PE":45.414474,"Trailing PS":2.2699354,"Quick Ratio":1.069,"Day High":35.0,"Day Low":34.375,"VS Average Volume":0.7783352642,"Company Summary":"Juniper Networks, Inc. designs, develops, and sells network products and services worldwide. The company offers routing products, such as ACX series universal access routers to deploy high-bandwidth services; MX series Ethernet routers that function as a universal edge platform; PTX series packet transport routers; wide-area network SDN controllers; and session smart routers. It also provides switching products, including EX series Ethernet switches to address the access, aggregation, and core layer switching requirements of micro branch, branch office, and campus environments; QFX series of core, spine, and top-of-rack data center switches; and juniper access points, which provide Wi-Fi access and performance. In addition, the company offers security products comprising SRX series services gateways for the data center; Branch SRX family provides an integrated and next-generation firewall; virtual firewall that delivers various features of physical firewalls; and advanced malware protection, a cloud-based service and Juniper ATP. Further, it offers Junos OS, a network operating system; Contrail networking, which provides an open-source and standards-based platform for SDN; Mist AI-driven Wired, Wireless, and WAN assurance solutions to set and measure key metrics; Mist AI-driven Marvis Virtual Network Assistant, which identifies the root cause of issues; Juniper Paragon Automation, a modular portfolio of cloud-native software applications; and Juniper Apstra to automate the network lifecycle in a single system. Additionally, the company provides software-as-a-service, technical support, maintenance, and professional services, as well as education and training programs. It sells its products through direct sales, distributors, value-added resellers, and original equipment manufacturers to end-users in the cloud, service provider, and enterprise markets. The company was incorporated in 1996 and is headquartered in Sunnyvale, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"03-02-2025 22:44:57"},{"Company Name":"PayPal Holdings, Inc.","Symbol":"PYPL","Current Price":"89.19","Latest MA":"77.18","Price Target":96.24829,"Difference from MA":"15.56%","Difference from Open":"3.11%","Change from Yesterday":"0.76%","Change from Last Report":"0.11","Latest Volume":"8,050,167","Market Cap":"89,416,548,352","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":18.200184,"PB Ratio":4.4474916,"Previous Close":88.58,"ROE":0.22188,"DTE":65.718,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.436,"Trailing PEG":1.468,"Trailing PE":21.337322,"Trailing PS":2.842501,"Quick Ratio":0.261,"Day High":89.4,"Day Low":86.0,"VS Average Volume":0.9573719081,"Company Summary":"PayPal Holdings, Inc. operates a technology platform that enables digital payments on behalf of merchants and consumers worldwide. It operates a two-sided network at scale that connects merchants and consumers that enables its customers to connect, transact, and send and receive payments through online and in person, as well as transfer and withdraw funds using various funding sources, such as bank accounts, PayPal or Venmo account balance, PayPal and Venmo branded credit products comprising its installment products, credit and debit cards, and cryptocurrencies, as well as other stored value products, including gift cards and eligible rewards. The company provides payment solutions under the PayPal, PayPal Credit, Braintree, Venmo, Xoom, Zettle, Hyperwallet, Honey, and Paidy names. The company was founded in 1998 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:44:57"},{"Company Name":"Advanced Micro Devices, Inc.","Symbol":"AMD","Current Price":"114.48","Latest MA":"144.11","Price Target":168.42233,"Difference from MA":"-20.56%","Difference from Open":"0.73%","Change from Yesterday":"-1.28%","Change from Last Report":"-0.01","Latest Volume":"27,346,721","Market Cap":"185,784,958,976","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":23.201569,"PB Ratio":3.2606163,"Previous Close":115.95,"ROE":0.03262,"DTE":3.927,"Industry":"Semiconductors","Sector":"Technology","Beta":1.706,"Trailing PEG":0.3206,"Trailing PE":102.21741,"Trailing PS":7.647045,"Quick Ratio":1.575,"Day High":115.16,"Day Low":112.98,"VS Average Volume":0.7575207072,"Company Summary":"Advanced Micro Devices, Inc. operates as a semiconductor company worldwide. It operates through Data Center, Client, Gaming, and Embedded segments. The company offers x86 microprocessors and graphics processing units (GPUs) as an accelerated processing unit, chipsets, data center, and professional GPUs; and embedded processors, and semi-custom system-on-chip (SoC) products, microprocessor and SoC development services and technology, data processing unites, field programmable gate arrays (FPGA), and adaptive SoC products. It provides processors under the AMD Ryzen, AMD Ryzen PRO, Ryzen Threadripper, Ryzen Threadripper PRO, AMD Athlon, AMD Athlon PRO, and AMD PRO A-Series brand names; graphics under the AMD Radeon graphics and AMD Embedded Radeon graphics; and professional graphics under the AMD Radeon Pro graphics brand name. In addition, the company offers data center graphics under the Radeon Instinct and Radeon PRO V-series brands, as well as servers under the AMD Instinct accelerators brand; server microprocessors under the AMD EPYC brands; low power solutions under the AMD Athlon, AMD Geode, AMD Ryzen, AMD EPYC, AMD R-Series, and G-Series brands; FPGA products under the Virtex-6, Virtex-7, Virtex UltraScale+, Kintex-7, Kintex UltraScale, Kintex UltraScale+, Artix-7, Artix UltraScale+, Spartan-6, and Spartan-7 brands; adaptive SOCs under the Zynq-7000, Zynq UltraScale+ MPSoC, Zynq UltraScale+ RFSoCs, Versal HBM, Versal Premium, Versal Prime, Versal AI Core, Versal AI Edge, Vitis, and Vivado brands; and compute and network acceleration board products under the Alveo brand. It serves original equipment and design manufacturers, public cloud service providers, system integrators, independent distributors, and add-in-board manufacturers through its direct sales force, and sales representatives. Advanced Micro Devices, Inc. was incorporated in 1969 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:44:57"},{"Company Name":"Amcor plc","Symbol":"AMCR","Current Price":"9.56","Latest MA":"10.27","Price Target":11.29556,"Difference from MA":"-6.90%","Difference from Open":"-0.26%","Change from Yesterday":"-1.64%","Change from Last Report":"0.16","Latest Volume":"25,711,049","Market Cap":"13,824,676,864","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":12.047813,"PB Ratio":3.5256171,"Previous Close":9.72,"ROE":0.1958,"DTE":196.619,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":0.863,"Trailing PEG":1.9257,"Trailing PE":18.04717,"Trailing PS":1.0202713,"Quick Ratio":0.591,"Day High":9.62,"Day Low":9.4,"VS Average Volume":1.6209433859,"Company Summary":"Amcor plc develops, produces, and sells packaging products in Europe, North America, Latin America, and the Asia Pacific. The company operates in two segments, Flexibles and Rigid Packaging. The Flexibles segment offers flexible and film packaging products in the food and beverage, medical and pharmaceutical, fresh produce, snack food, personal care, and other industries. The Rigid Packaging segment provides rigid containers for various beverage and food products, including carbonated soft drinks, water, juices, sports drinks, milk-based beverages, spirits and beer, sauces, dressings, spreads, and personal care items; and plastic caps for various applications. It sells its products through its direct sales force. The company was incorporated in 1926 and is headquartered in Zurich, Switzerland.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:44:57"},{"Company Name":"Ball Corporation","Symbol":"BALL","Current Price":"55.53","Latest MA":"61.07","Price Target":67.808,"Difference from MA":"-9.06%","Difference from Open":"1.75%","Change from Yesterday":"-0.25%","Change from Last Report":"0.12","Latest Volume":"2,269,161","Market Cap":"16,573,086,720","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":15.789413,"PB Ratio":2.4933774,"Previous Close":55.7,"ROE":0.14048,"DTE":90.836,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":0.899,"Trailing PEG":1.145,"Trailing PE":23.139582,"Trailing PS":1.2022551,"Quick Ratio":0.801,"Day High":55.84,"Day Low":54.46,"VS Average Volume":1.0417907981,"Company Summary":"Ball Corporation supplies aluminum packaging products for the beverage, personal care, and household products industries in the United States, Brazil, and internationally. The company manufactures and sells aluminum beverage containers to fillers of carbonated soft drinks, beer, energy drinks, and other beverages. It also manufactures and sells extruded aluminum aerosol containers, recloseable aluminum bottles, aluminum cups, and aluminum slugs. Ball Corporation was founded in 1880 and is headquartered in Westminster, Colorado.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:44:57"},{"Company Name":"Omnicom Group Inc.","Symbol":"OMC","Current Price":"87.75","Latest MA":"95.04","Price Target":112.11,"Difference from MA":"-7.66%","Difference from Open":"2.15%","Change from Yesterday":"1.06%","Change from Last Report":"0.30","Latest Volume":"2,146,003","Market Cap":"17,242,189,824","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":10.176959,"PB Ratio":4.332938,"Previous Close":86.79,"ROE":0.33923998,"DTE":155.236,"Industry":"Advertising Agencies","Sector":"Communication Services","Beta":0.968,"Trailing PEG":1.2692,"Trailing PE":11.988387,"Trailing PS":1.1176052,"Quick Ratio":0.788,"Day High":88.43,"Day Low":85.56,"VS Average Volume":0.9529743772,"Company Summary":"Omnicom Group Inc., together with its subsidiaries, offers advertising, marketing, and corporate communications services. It provides a range of services in the areas of advertising and media, precision marketing, commerce and branding, experiential, execution and support, public relations, and healthcare. The company's services include advertising, branding, content marketing, corporate social responsibility consulting, crisis communications, custom publishing, data analytics, database management, digital\/direct marketing and post-production, digital transformation consulting, entertainment marketing, experiential marketing, field marketing, sales support, financial\/corporate business-to-business advertising, graphic arts\/digital imaging, healthcare marketing and communications, and instore design services. Its services also comprise interactive marketing, investor relations, marketing research, media planning and buying, retail media planning and buying, merchandising and point of sale, mobile marketing, multi-cultural marketing, non-profit marketing, organizational communications, package design, product placement, promotional marketing, public affairs, public relations, retail marketing, retail media and e-commerce, search engine marketing, shopper marketing, social media marketing, and sports and event marketing services. It operates in the North and Latin America, Europe, the Middle East and Africa (EMEA), and the Asia Pacific. The company was incorporated in 1944 and is based in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:44:57"},{"Company Name":"Match Group, Inc.","Symbol":"MTCH","Current Price":"35.53","Latest MA":"34.24","Price Target":36.09261,"Difference from MA":"3.78%","Difference from Open":"1.14%","Change from Yesterday":"-0.49%","Change from Last Report":"0.17","Latest Volume":"2,848,025","Market Cap":"8,921,690,112","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":10.610278,"PB Ratio":"N\/A","Previous Close":35.7,"ROE":"N\/A","DTE":"N\/A","Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.487,"Trailing PEG":0.5774,"Trailing PE":15.933497,"Trailing PS":2.5597138,"Quick Ratio":2.265,"Day High":35.86,"Day Low":35.08,"VS Average Volume":0.6095180719,"Company Summary":"Match Group, Inc. engages in the provision of dating products. Its portfolio of brands includes Tinder, Hinge, Match, Meetic, OkCupid, Pairs, Plenty Of Fish, Azar, BLK, and Hakuna, as well as a various other brands, each built to increase users' likelihood of connecting with others. Its services are available in over 40 languages to users worldwide. The company was incorporated in 1986 and is based in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:44:57"},{"Company Name":"Electronic Arts Inc.","Symbol":"EA","Current Price":"122.66","Latest MA":"147.04","Price Target":148.46455,"Difference from MA":"-16.58%","Difference from Open":"0.52%","Change from Yesterday":"-0.15%","Change from Last Report":"0.02","Latest Volume":"3,206,907","Market Cap":"32,170,405,888","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":15.363188,"PB Ratio":4.357217,"Previous Close":122.91,"ROE":0.13962,"DTE":29.954,"Industry":"Electronic Gaming & Multimedia","Sector":"Communication Services","Beta":0.781,"Trailing PEG":1.943,"Trailing PE":31.451283,"Trailing PS":4.342071,"Quick Ratio":1.283,"Day High":123.48,"Day Low":120.5761,"VS Average Volume":1.1943849987,"Company Summary":"Electronic Arts Inc. develops, markets, publishes, and delivers games, content, and services for game consoles, PCs, mobile phones, and tablets worldwide. It develops and publishes games and services across various genres, such as sports, racing, first-person shooter, action, role-playing, and simulation through owned and licensed brands, such as EA SPORTS FC, Battlefield, Apex Legends, The Sims, Madden NFL, Need for Speed, Titanfall, and F1 brands. The company licenses its games to third parties to distribute and host its games and content. It markets and sells its games and services through digital distribution and retail channels, as well as directly to mass market retailers, specialty stores, and distribution arrangements. Electronic Arts Inc. was incorporated in 1982 and is headquartered in Redwood City, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:44:57"},{"Company Name":"Oscar Health, Inc.","Symbol":"OSCR","Current Price":"16.63","Latest MA":"16.84","Price Target":19.35714,"Difference from MA":"-1.23%","Difference from Open":"2.40%","Change from Yesterday":"-0.12%","Change from Last Report":"-0.15","Latest Volume":"2,126,142","Market Cap":"4,112,083,200","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":25.605099,"PB Ratio":3.5315351,"Previous Close":16.6,"ROE":0.02834,"DTE":31.141,"Industry":"Healthcare Plans","Sector":"Healthcare","Beta":1.664,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.50054425,"Quick Ratio":0.702,"Day High":16.91,"Day Low":16.16,"VS Average Volume":0.5010960449,"Company Summary":"Oscar Health, Inc. operates as a health insurance in the United States. The company offers health plans in individual and small group markets, as well as +Oscar, a technology driven platform that help providers and payors directly enable their shift to value-based care. It also provides reinsurance products. The company was formerly known as Mulberry Health Inc. and changed its name to Oscar Health, Inc. in January 2021. Oscar Health, Inc. was incorporated in 2012 and is headquartered in New York, New York.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"03-02-2025 22:44:57"},{"Company Name":"Marathon Petroleum Corporation","Symbol":"MPC","Current Price":"147.28","Latest MA":"158.27","Price Target":166.36842,"Difference from MA":"-6.94%","Difference from Open":"1.47%","Change from Yesterday":"0.97%","Change from Last Report":"0.06","Latest Volume":"2,217,767","Market Cap":"47,335,780,352","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":17.829409,"PB Ratio":2.5282807,"Previous Close":145.71,"ROE":0.21053,"DTE":114.328,"Industry":"Oil & Gas Refining & Marketing","Sector":"Energy","Beta":1.371,"Trailing PEG":null,"Trailing PE":11.417442,"Trailing PS":0.33178508,"Quick Ratio":0.727,"Day High":148.605,"Day Low":143.11,"VS Average Volume":0.8342487963,"Company Summary":"Marathon Petroleum Corporation, together with its subsidiaries, operates as an integrated downstream energy company primarily in the United States. The company operates through Refining & Marketing, and Midstream segments. The Refining & Marketing segment refines crude oil and other feedstocks at its refineries in the Gulf Coast, Mid-Continent, and West Coast regions of the United States; and purchases refined products and ethanol for resale and distributes refined products, including renewable diesel, through transportation, storage, distribution, and marketing services. Its refined products include transportation fuels, such as reformulated gasolines and blend-grade gasolines; heavy fuel oil; and asphalt. This segment also manufactures propane and petrochemicals. It sells refined products to wholesale marketing customers in the United States and internationally, buyers on the spot market, and independent entrepreneurs who operate primarily Marathon branded outlets, as well as through long-term fuel supply contracts to direct dealer locations primarily under the ARCO brand. The Midstream segment transports, stores, distributes, and markets crude oil and refined products through refining logistics assets, pipelines, terminals, towboats, and barges; gathers, processes, and transports natural gas; and gathers, transports, fractionates, stores, and markets natural gas liquids. Marathon Petroleum Corporation was founded in 1887 and is headquartered in Findlay, Ohio.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:44:57"},{"Company Name":"Snap Inc.","Symbol":"SNAP","Current Price":"11.15","Latest MA":"11.39","Price Target":13.142,"Difference from MA":"-2.05%","Difference from Open":"1.41%","Change from Yesterday":"-1.24%","Change from Last Report":"0.00","Latest Volume":"20,677,386","Market Cap":"18,709,276,672","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":27.355436,"PB Ratio":8.437972,"Previous Close":11.29,"ROE":-0.4062,"DTE":191.874,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":0.995,"Trailing PEG":496.0591,"Trailing PE":"N\/A","Trailing PS":3.622037,"Quick Ratio":3.861,"Day High":11.3,"Day Low":10.955,"VS Average Volume":0.7366106319,"Company Summary":"Snap Inc. operates as a technology company in North America, Europe, and internationally. The company offers Snapchat, a visual messaging application with various tabs, such as camera, visual messaging, snap map, stories, and spotlight that enable people to communicate visually through short videos and images. It also provides Spectacles, an eyewear product that connects with Snapchat and captures photos and video from a human perspective; and advertising products, including AR ads and Snap ads comprises a single image or video ads, collection ads, dynamic ads, story ads, and commercials. The company was formerly known as Snapchat, Inc. and changed its name to Snap Inc. in September 2016. Snap Inc. was founded in 2010 and is headquartered in Santa Monica, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"03-02-2025 22:44:57"},{"Company Name":"MPLX LP","Symbol":"MPLX","Current Price":"51.26","Latest MA":"44.73","Price Target":51.93938,"Difference from MA":"14.60%","Difference from Open":"1.91%","Change from Yesterday":"-1.31%","Change from Last Report":"-0.16","Latest Volume":"2,155,203","Market Cap":"52,224,196,608","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":11.775083,"PB Ratio":3.8909974,"Previous Close":51.0535,"ROE":"N\/A","DTE":162.559,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":1.344,"Trailing PEG":2.4702,"Trailing PE":12.0896225,"Trailing PS":4.7291675,"Quick Ratio":"N\/A","Day High":51.85,"Day Low":50.3,"VS Average Volume":1.0883582892,"Company Summary":"MPLX LP owns and operates midstream energy infrastructure and logistics assets primarily in the United States. It operates in two segments, Logistics and Storage, and Gathering and Processing. The company is involved in the gathering, processing, and transportation of natural gas; gathering, transportation, fractionation, storage, and marketing of natural gas liquids; gathering, storage, transportation, and distribution of crude oil and refined products, as well as other hydrocarbon-based products and renewables; and sale of residue gas and condensate. It also engages in the inland marine businesses comprising fleet of boats and barges transportation of light products, heavy oils, crude oil, renewable fuels, chemicals, and feedstocks in the Mid-Continent and Gulf Coast regions, as well as a marine repair facility located on the Ohio River; and distribution of fuel, as well as operates refining logistics, terminals, rail facilities, and storage caverns. In addition, the company operates terminal facilities for the receipt, storage, blending, additization, handling, and redelivery of refined petroleum products through the pipeline, rail, marine, and over-the-road modes of transportation. MPLX GP LLC acts as the general partner of MPLX LP. The company was incorporated in 2012 and is headquartered in Findlay, Ohio. MPLX LP operates as a subsidiary of Marathon Petroleum Corporation.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:44:57"},{"Company Name":"KKR & Co. Inc.","Symbol":"KKR","Current Price":"163.08","Latest MA":"135.51","Price Target":171.66946,"Difference from MA":"20.34%","Difference from Open":"0.66%","Change from Yesterday":"-2.42%","Change from Last Report":"-0.06","Latest Volume":"3,269,462","Market Cap":"150,489,907,200","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":26.83561,"PB Ratio":6.009286,"Previous Close":167.07,"ROE":0.08284,"DTE":83.045,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.606,"Trailing PEG":0.7446,"Trailing PE":50.64596,"Trailing PS":5.4101295,"Quick Ratio":0.792,"Day High":164.44,"Day Low":159.39,"VS Average Volume":0.9525100001,"Company Summary":"KKR & Co. Inc. is a private equity and real estate investment firm specializing in direct and fund of fund investments. It specializes in acquisitions, leveraged buyouts, management buyouts, credit special situations, growth equity, mature, mezzanine, distressed, turnaround, lower middle market, and middle market investments. The firm considers investments in all industries with a focus on software, security, semiconductors, consumer electronics, internet of things (iot), internet, information services, information technology infrastructure, financial technology, network and cyber security architecture, engineering and operations, content, technology and hardware, energy and infrastructure, real estate, services industry with a focus on business services, intelligence, industry-leading franchises and companies in natural resource, containers and packaging, agriculture, airports, ports, forestry, electric utilities, textiles, apparel and luxury goods, household durables, digital media, insurance, brokerage houses, non-durable goods distribution, supermarket retailing, grocery stores, food, beverage, and tobacco, hospitals, entertainment venues and production companies, publishing, printing services, capital goods, financial services, specialized finance, pipelines, and renewable energy. In energy and infrastructure, it focuses on the upstream oil and gas and equipment, minerals and royalties and services verticals. In real estate, the firm seeks to invest in private and public real estate securities including property-level equity, debt and special situations transactions and businesses with significant real estate holdings, and oil and natural gas properties. The firm also invests in asset services sector that encompasses a broad array of B2B, B2C and B2G services verticals including asset-based, transport, logistics, leisure\/hospitality, resource and utility support, infra-like, mission-critical, and environmental services. Within Americas, the firm prefers to invest in consumer products; chemicals, metals and mining; energy and natural resources; financial services; healthcare; industrials; media and communications; retail; and technology. Within Europe, the firm invests in consumer and retail; energy; financial services; health care; industrials and chemicals; media and digital; and telecom and technologies. Within Asia, it invests in consumer products; energy and resources; financial services; healthcare; industrials; logistics; media and telecom; retail; real estate; and technology. It also seeks to make impact investments focused on identifying and investing behind businesses with positive social or environmental impact. The firm seeks to invest in mid to high-end residential developments but can invest in other projects throughout Mainland China through outright ownership, joint ventures, and merger. It invests globally with a focus on Australia, emerging and developed Asia, Middle East and Africa, Nordic, Southeast Asia, Asia Pacific, Ireland, Hong Kong, Japan, Taiwan, India, Vietnam, Malaysia, Singapore, Indonesia, France, Germany, Netherlands, United Kingdom, Caribbean, Mexico, South America, North America, Brazil, Latin America, Korea with a focus on South Korea, and United States of America. In the United States and Europe, the firm focuses on buyouts of large, publicly traded companies. For middle market it seeks to invest in companies with enterprise values between $200 million to $1000 million. The firm prefers to invest in a range of debt and public equity investing and may co-invest. It seeks a board seat in its portfolio companies and a controlling ownership of a company or a strategic minority position. The firm may acquire majority and minority equity interests, particularly when making private equity investments in Asia or sponsoring investments as part of a large investor consortium. The firm typically holds its investment for a period of five to seven years and more and exits through initial public offerings, secondary offerings, and sales to strategic buyers. KKR & Co. Inc. was founded in 1976 and is based in New York, New York with additional offices across North America, Europe, Australia and Asia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:44:57"},{"Company Name":"Spotify Technology S.A.","Symbol":"SPOT","Current Price":"549.09","Latest MA":"396.05","Price Target":496.454,"Difference from MA":"38.64%","Difference from Open":"1.89%","Change from Yesterday":"-0.09%","Change from Last Report":"-0.06","Latest Volume":"2,042,963","Market Cap":"110,959,542,272","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":58.79354,"PB Ratio":23.890095,"Previous Close":548.55,"ROE":0.20703,"DTE":38.55,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.561,"Trailing PEG":null,"Trailing PE":156.43587,"Trailing PS":7.347341,"Quick Ratio":1.67,"Day High":554.6958,"Day Low":534.8937,"VS Average Volume":0.7722714377,"Company Summary":"Spotify Technology S.A., together with its subsidiaries, provides audio streaming subscription services worldwide. It operates through two segments, Premium and Ad-Supported. The Premium segment offers unlimited online and offline streaming access to its catalog of music and podcasts without commercial breaks to its subscribers. This segment sells directly to the end users. The Ad-Supported segment provides on-demand online access to its catalog of music and unlimited online access to the catalog of podcasts to its users on their computers, tablets, and compatible mobile devices. The company also offers sales, distribution and marketing, contract research and development, and customer and other support services. Spotify Technology S.A. was incorporated in 2006 and is based in Luxembourg City, Luxembourg.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:44:57"},{"Company Name":"Amgen Inc.","Symbol":"AMGN","Current Price":"288.78","Latest MA":"304.17","Price Target":316.04462,"Difference from MA":"-5.06%","Difference from Open":"0.83%","Change from Yesterday":"1.16%","Change from Last Report":"0.16","Latest Volume":"2,801,699","Market Cap":"155,230,388,224","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":13.865526,"PB Ratio":20.621466,"Previous Close":285.42,"ROE":0.5572,"DTE":802.418,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.599,"Trailing PEG":2.031,"Trailing PE":36.928772,"Trailing PS":4.771328,"Quick Ratio":0.804,"Day High":289.58,"Day Low":283.4,"VS Average Volume":0.7482664767,"Company Summary":"Amgen Inc. discovers, develops, manufactures, and delivers human therapeutics worldwide. The company's principal products include Enbrel to treat plaque psoriasis, rheumatoid arthritis, and psoriatic arthritis; Otezla for the treatment of adult patients with plaque psoriasis, psoriatic arthritis, and oral ulcers associated with Behçet's disease; Prolia to treat postmenopausal women with osteoporosis; XGEVA for skeletal-related events prevention; Repatha, which reduces the risks of myocardial infarction, stroke, and coronary revascularization; Nplate for the treatment of patients with immune thrombocytopenia; KYPROLIS to treat patients with relapsed or refractory multiple myeloma; Aranesp to treat a lower-than-normal number of red blood cells and anemia; EVENITY for the treatment of osteoporosis in postmenopausal for men and women; Vectibix to treat patients with wild-type RAS metastatic colorectal cancer; BLINCYTO for the treatment of patients with acute lymphoblastic leukemia; TEPEZZA to treat thyroid eye disease; and KRYSTEXXA for the treatment of chronic refractory gout. It also markets other products, including Neulasta, MVASI, AMJEVITA\/AMGEVITA, TEZSPIRE, Parsabiv, Aimovig, LUMAKRAS\/LUMYKRAS, EPOGEN, KANJINTI, TAVNEOS, RAVICTI, UPLIZNA and PROCYSBI. The company serves healthcare providers, including physicians or their clinics, dialysis centers, hospitals, and pharmacies. It distributes its products through pharmaceutical wholesale distributors, as well as direct-to-consumer channels. The company has collaboration agreements with AstraZeneca plc for the development and commercialization of TEZSPIRE; Novartis Pharma AG to develop and commercialize Aimovig; UCB for the development and commercialization of EVENITY; Kyowa Kirin Co., Ltd. for rocatinlimab development and commercialization; and BeiGene, Ltd. for oncology products expansion and development. Amgen Inc. was incorporated in 1980 and is headquartered in Thousand Oaks, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:44:57"},{"Company Name":"Chipotle Mexican Grill, Inc.","Symbol":"CMG","Current Price":"58.28","Latest MA":"57.84","Price Target":66.30719,"Difference from MA":"0.78%","Difference from Open":"3.42%","Change from Yesterday":"-0.20%","Change from Last Report":"0.07","Latest Volume":"7,863,005","Market Cap":"79,418,556,416","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":44.078503,"PB Ratio":21.994339,"Previous Close":58.35,"ROE":0.45673,"DTE":124.061,"Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":1.266,"Trailing PEG":2.0285,"Trailing PE":53.96759,"Trailing PS":7.229818,"Quick Ratio":1.486,"Day High":58.57,"Day Low":56.61,"VS Average Volume":0.8979397304,"Company Summary":"Chipotle Mexican Grill, Inc., together with its subsidiaries, owns and operates Chipotle Mexican Grill restaurants. It sells food and beverages through offering burritos, burrito bowls, quesadillas, tacos, and salads. The company also provides delivery and related services its app and website. It has operations in the United States, Canada, France, Germany, Dubai, and the United Kingdom. Chipotle Mexican Grill, Inc. was founded in 1993 and is headquartered in Newport Beach, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:44:57"},{"Company Name":"Mondelez International, Inc.","Symbol":"MDLZ","Current Price":"57.48","Latest MA":"66.07","Price Target":71.4844,"Difference from MA":"-13.00%","Difference from Open":"-0.63%","Change from Yesterday":"-0.81%","Change from Last Report":"0.26","Latest Volume":"5,066,961","Market Cap":"76,854,992,896","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":17.588554,"PB Ratio":2.7592413,"Previous Close":57.99,"ROE":0.13552,"DTE":73.232,"Industry":"Confectioners","Sector":"Consumer Defensive","Beta":0.561,"Trailing PEG":4.8598,"Trailing PE":20.381207,"Trailing PS":2.1259437,"Quick Ratio":0.295,"Day High":57.99,"Day Low":56.85,"VS Average Volume":0.5447203006,"Company Summary":"Mondelez International, Inc., through its subsidiaries, manufactures, markets, and sells snack food and beverage products in the Latin America, North America, Asia, the Middle East, Africa, and Europe. It provides biscuits and baked snacks, including cookies, crackers, salted snacks, snack bars, and cakes and pastries; chocolates; and gums and candies, as well as various cheese and grocery, and powdered beverage products. The company's brand portfolio includes Oreo, Ritz, LU, CLIF Bar, and Tate's Bake Shop biscuits and baked snacks, as well as Cadbury Dairy Milk, Milka, and Toblerone chocolate. It serves supermarket chains, wholesalers, supercenters, club stores, mass merchandisers, distributors, convenience stores, gasoline stations, drug stores, value stores, and other retail food outlets through direct store delivery, company-owned and satellite warehouses, distribution centers, third party distributors, and other facilities, as well as through independent sales offices and agents. The company also sells products directly to businesses and consumers through e-retail platforms, retailer digital platforms, as well as through its direct-to-consumer websites and social media platforms. Mondelez International, Inc. was formerly known as Kraft Foods Inc. and changed its name to Mondelez International, Inc. in October 2012. The company was incorporated in 2000 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:44:57"},{"Company Name":"Fox Corporation","Symbol":"FOXA","Current Price":"51.92","Latest MA":"42.83","Price Target":49.61368,"Difference from MA":"21.23%","Difference from Open":"2.57%","Change from Yesterday":"1.51%","Change from Last Report":"0.14","Latest Volume":"5,072,142","Market Cap":"23,097,131,008","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":13.415951,"PB Ratio":2.108084,"Previous Close":51.18,"ROE":0.17711,"DTE":70.271,"Industry":"Entertainment","Sector":"Communication Services","Beta":0.77,"Trailing PEG":9.2785,"Trailing PE":12.694376,"Trailing PS":1.6110156,"Quick Ratio":2.243,"Day High":52.135,"Day Low":50.58,"VS Average Volume":1.3307626615,"Company Summary":"Fox Corporation operates as a news, sports, and entertainment company in the United States (U.S.). The company operates through four segments: Cable Network Programming, Television, Credible, and The FOX Studio Lot. The Cable Network Programming segment produces and licenses news and sports content for distribution through traditional cable television systems, direct broadcast satellite operators and telecommunication companies, virtual multi-channel video programming distributors, and other digital platforms primarily in the U.S. Television segment produces, acquires, markets, and distributes programming through the FOX broadcast network, advertising supported video-on-demand service Tubi, and operates power broadcast television stations including duopolies and other digital platform; and produces content for third parties. The Credible segment engages in the consumer finance marketplace. The FOX Studio Lot segment provides television and film production services along with office space, studio operation services and includes all operations of the facility. The company was incorporated in 2018 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:44:57"},{"Company Name":"Estee Lauder Companies, Inc. (T","Symbol":"EL","Current Price":"82.64","Latest MA":"85.29","Price Target":84.71111,"Difference from MA":"-3.11%","Difference from Open":"1.26%","Change from Yesterday":"-1.05%","Change from Last Report":"0.15","Latest Volume":"3,013,456","Market Cap":"29,664,147,456","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":31.48252,"PB Ratio":5.8349814,"Previous Close":83.43,"ROE":0.03857,"DTE":196.892,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":1.044,"Trailing PEG":1.2803,"Trailing PE":147.5625,"Trailing PS":1.9198853,"Quick Ratio":0.789,"Day High":83.055,"Day Low":80.82,"VS Average Volume":0.725145332,"Company Summary":"The Estée Lauder Companies Inc. manufactures, markets, and sells skin care, makeup, fragrance, and hair care products worldwide. It offers skin care products, including moisturizers, serums, cleansers, toners, body care, exfoliators, acne care and oil correctors, facial masks, and sun care products; and makeup products, such as lipsticks, lip glosses, mascaras, foundations, eyeshadows, and powders, as well as compacts, brushes, and other makeup tools. The company also provides fragrance products in various forms comprising eau de parfum sprays and colognes, as well as lotions, powders, creams, candles, and soaps; and hair care products, including shampoos, conditioners, styling products, treatment, finishing sprays, and hair color products, as well as sells ancillary products and services. It offers its products under the Estée Lauder, Clinique, Origins, M·A·C, Bobbi Brown Cosmetics, La Mer, Aveda, Jo Malone London, TOM FORD, Too Faced, Dr.Jart+, and The Ordinary brands. The company sells its products through department stores, specialty-multi retailers, upscale perfumeries and pharmacies, and salons and spas; freestanding stores; its own and authorized retailer websites; third-party online malls; stores in airports; and duty-free locations. The Estée Lauder Companies Inc. was founded in 1946 and is headquartered in New York, New York.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"03-02-2025 22:44:57"},{"Company Name":"Merck & Company, Inc.","Symbol":"MRK","Current Price":"99.97","Latest MA":"108.34","Price Target":123.96542,"Difference from MA":"-7.72%","Difference from Open":"1.88%","Change from Yesterday":"1.29%","Change from Last Report":"0.20","Latest Volume":"8,037,585","Market Cap":"252,900,753,408","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":10.798606,"PB Ratio":5.688154,"Previous Close":98.82,"ROE":0.28332,"DTE":85.572,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.411,"Trailing PEG":0.0697,"Trailing PE":20.91527,"Trailing PS":4.003241,"Quick Ratio":0.917,"Day High":99.975,"Day Low":98.0,"VS Average Volume":0.694072789,"Company Summary":"Merck & Co., Inc. operates as a healthcare company worldwide. It operates through two segments, Pharmaceutical and Animal Health. The Pharmaceutical segment offers human health pharmaceutical products in the areas of oncology, hospital acute care, immunology, neuroscience, virology, cardiovascular, and diabetes under the Keytruda, Bridion, Adempas, Lagevrio, Belsomra, Simponi, and Januvia brands, as well as vaccine products consisting of preventive pediatric, adolescent, and adult vaccines under the Gardasil\/Gardasil 9, ProQuad, M-M-R II, Varivax, RotaTeq, Live Oral, Vaxneuvance, Pneumovax 23, and Vaqta names. The Animal Health segment discovers, develops, manufactures, and markets veterinary pharmaceuticals, vaccines, and health management solutions and services, as well as digitally connected identification, traceability, and monitoring products. vIt has development and commercialization agreement for three of Daiichi Sankyo's deruxtecan ADC candidates, which include patritumab deruxtecan, ifinatamab deruxtecan, and raludotatug deruxtecan for the treatment of multiple solid tumors both as monotherapy and\/or in combination with other treatments; and AstraZeneca PLC to co-development and co-commercialize AstraZeneca's Lynparza products for multiple cancer types, and Koselugo for multiple indications. It also has licensed to develop, manufacture and  commercialize LM-299, a novel investigational PD-1\/VEGF bispecific antibody from LaNova. The company also has a collaboration agreement with Eisai Co., Ltd., Bayer AG, and Ridgeback Biotherapeutics LP, as well Moderna, Inc. Merck & Co., Inc. was founded in 1891 and is headquartered in Rahway, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:44:57"},{"Company Name":"Mattel, Inc.","Symbol":"MAT","Current Price":"17.82","Latest MA":"18.59","Price Target":24.08615,"Difference from MA":"-4.18%","Difference from Open":"-1.14%","Change from Yesterday":"-4.21%","Change from Last Report":"-0.28","Latest Volume":"2,617,356","Market Cap":"6,001,143,296","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":11.257931,"PB Ratio":2.5950475,"Previous Close":18.64,"ROE":0.25217,"DTE":114.026,"Industry":"Leisure","Sector":"Consumer Cyclical","Beta":0.785,"Trailing PEG":1.26,"Trailing PE":11.347134,"Trailing PS":1.1209068,"Quick Ratio":1.695,"Day High":18.15,"Day Low":17.72,"VS Average Volume":0.8405980956,"Company Summary":"Mattel, Inc., a toy and family entertainment company, designs, manufactures, and markets toys and consumer products in North America, Latin America, Europe, the Middle East, Africa, and the Asia Pacific. The company operates through North America, International, and American Girl segments. It offers dolls and accessories, as well as books, content, gaming, and lifestyle products for children under the Barbie, American Girl, Disney Princess and Disney Frozen, Monster High, and Polly Pocket brands; die-cast vehicles, tracks, playsets, and accessories for kids, adults, and collectors under the Hot Wheels, Hot Wheels Monster Trucks, Hot Wheels Mario Kart, Matchbox, and Cars brand names; and infant, toddler, and preschool products comprising content, toys, live events, and other consumer products under the Fisher-Price, Little People and Imaginext, and Thomas & Friends, and Power wheels brands. The company also provides action figures, building sets, games, and other products under the Masters of the Universe, MEGA, UNO, Jurassic World, Minecraft, WWE, Lightyear, and Star Wars; and licensor partner brands, including Disney Pixar, Microsoft, NBCUniversal, and WWE. It sells its products directly to consumers through its catalog, website, and proprietary retail stores; retailers, including omnichannel retailers, discount and free-standing toy stores, chain stores, department stores, and other retail outlets; and wholesalers, as well as through agents and distributors. Mattel, Inc. was founded in 1945 and is headquartered in El Segundo, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:44:57"},{"Company Name":"CNH Industrial N.V.","Symbol":"CNH","Current Price":"12.59","Latest MA":"10.97","Price Target":14.19474,"Difference from MA":"14.69%","Difference from Open":"1.17%","Change from Yesterday":"-2.37%","Change from Last Report":"0.08","Latest Volume":"18,564,416","Market Cap":"15,718,413,312","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":14.918916,"PB Ratio":2.0567086,"Previous Close":12.88,"ROE":0.22186,"DTE":356.262,"Industry":"Farm & Heavy Construction Machinery","Sector":"Industrials","Beta":1.597,"Trailing PEG":null,"Trailing PE":9.253676,"Trailing PS":0.7226192,"Quick Ratio":3.87,"Day High":12.66,"Day Low":12.23,"VS Average Volume":1.5112538429,"Company Summary":"CNH Industrial N.V., an equipment and services company, engages in the design, production, marketing, sale, and financing of agricultural and construction equipment in North America, Europe, the Middle East, Africa, South America, and the Asia Pacific. The company operates through three segments: Agriculture, Construction, and Financial Services. The Agriculture segment designs, manufactures, and distributes farm machinery and implements, including two-wheel and four-wheel drive tractors, crawler tractors, combines, grape and sugar cane harvesters, hay and forage equipment, planting and seeding equipment, soil preparation and cultivation implements, material handling equipment, and precision agriculture technology. This segment sells its agricultural equipment under the New Holland Agriculture and Case IH brands. The Construction segment designs, manufactures, and distributes construction equipment comprising excavators, crawler dozers, graders, wheel loaders, backhoe loaders, skid steer loaders, and compact track loaders under the CASE Construction Equipment, New Holland Construction, and Eurocomach brands. The Financial Services segment offers financing to end-use customers for the purchase of new and used agricultural and construction equipment and components, as well as revolving charge account financing and other financial services. It also provides wholesale financing to CNH Industrial brand dealers and distributors; trade receivables factoring services to CNH companies; and financial services to Iveco Group companies in the North America, South America, and Asia Pacific regions. The company was founded in 1842 and is headquartered in Basildon, the United Kingdom.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 22:44:57"},{"Company Name":"Centene Corporation","Symbol":"CNC","Current Price":"65.39","Latest MA":"67.21","Price Target":79.44824,"Difference from MA":"-2.70%","Difference from Open":"2.50%","Change from Yesterday":"2.09%","Change from Last Report":"0.65","Latest Volume":"2,912,920","Market Cap":"33,015,644,160","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":8.928937,"PB Ratio":1.2215372,"Previous Close":64.03,"ROE":0.11559,"DTE":64.231,"Industry":"Healthcare Plans","Sector":"Healthcare","Beta":0.493,"Trailing PEG":0.6853,"Trailing PE":11.294473,"Trailing PS":0.22581902,"Quick Ratio":1.051,"Day High":66.81,"Day Low":63.8,"VS Average Volume":0.532700829,"Company Summary":"Centene Corporation operates as a healthcare enterprise that provides programs and services to under-insured and uninsured families, commercial organizations, and military families in the United States. The company operates through Medicaid, Medicare, Commercial, and Other segments. The Medicaid segment offers health plan coverage, including medicaid expansion, aged, blind, disabled, children's health insurance program, foster care, medicare-medicaid plans, long-term services and support. This segment also provides healthcare products. The Medicare segment offers special needs and medicare supplement, and prescription drug plans. The Commercial segment provides health insurance marketplace product for individual, small, and large group commercials. It also operates clinical healthcare and pharmacies, as well as offers dental and speech therapy services. In addition, the company engages in the government contracts business under the TRICARE program and other healthcare related government contracts. It provides services through primary and specialty care physicians, hospitals, and ancillary providers. Centene Corporation was founded in 1984 and is headquartered in Saint Louis, Missouri.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 22:44:57"}]