[{"Company Name":"Paychex, Inc.","Symbol":"PAYX","Current Price":"139.91","Latest MA":"131.00","Price Target":"139.31","Difference from MA":"6.80%","Difference from Open":"2.44%","Change from Yesterday":"1.55%","Change from Last Report":"0.14","Latest Volume":"1,081,674","Market Cap":"50,394,198,016","Earning Date":"2024-12-19","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":26.406511,"ROE":0.45672,"DTE":22.517,"Industry":"Software - Application","Sector":"Technology","Beta":0.987,"Trailing PEG":4.1178,"Trailing PE":29.462107,"Trailing PS":9.489003,"Quick Ratio":0.599,"Day High":139.95,"Day Low":136.58,"VS Average Volume":0.602595507,"Company Summary":"Paychex, Inc., together with its subsidiaries, provides integrated human capital management solutions (HCM) for payroll, benefits, human resources (HR), and insurance services for small to medium-sized businesses in the United States, Europe, and India. It offers payroll processing services; payroll tax administration services; employee payment services; and regulatory compliance services, such as new-hire reporting and garnishment processing. The company also provides HR solutions, including integrated HCM technology solutions and HR advisory services through both virtual and on-site availability of a professionally trained HR representative, as well as HR support to non-payroll clients through its HR Partner Plus solution; and retirement services administration, such as plan implementation, ongoing compliance with government regulations, employee and employer reporting, participant and employer online access, electronic funds transfer, and other administrative services. In addition, it offers cloud-based HR administration software products for employee benefits management and administration, time and attendance, digital communication solutions, recruiting, and onboarding solutions; plan administration outsourcing and state unemployment insurance services; various business services to small to medium-sized businesses comprising payroll funding and outsourcing services, which include payroll processing, invoicing, and tax preparation; and payment processing services, financial fitness programs, and a small-business loan resource center. Further, the company provides insurance services for property and casualty coverage, such as workers' compensation, business-owner policies, cyber security protection, and commercial auto, as well as health and benefits coverage, including health, dental, vision, and life. It markets and sells its services primarily through its direct sales force. The company was founded in 1971 and is headquartered in Rochester, New York.","Stock Sentiment":"Strong Sell","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Cintas Corporation","Symbol":"CTAS","Current Price":"187.54","Latest MA":"196.82","Price Target":"214.15","Difference from MA":"-4.72%","Difference from Open":"3.34%","Change from Yesterday":"2.51%","Change from Last Report":"0.20","Latest Volume":"1,451,734","Market Cap":"75,609,096,192","Earning Date":"2024-12-19","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":39.382812,"ROE":0.40462002,"DTE":70.573,"Industry":"Specialty Business Services","Sector":"Industrials","Beta":1.313,"Trailing PEG":3.8502,"Trailing PE":45.15301,"Trailing PS":7.750111,"Quick Ratio":0.703,"Day High":187.49,"Day Low":181.15,"VS Average Volume":0.9279214267,"Company Summary":"Cintas Corporation engages in the provision of corporate identity uniforms and related business services primarily in the United States, Canada, and Latin America. It operates through Uniform Rental and Facility Services, First Aid and Safety Services, and All Other segments. The company rents and services uniforms and other garments, including flame resistant clothing, mats, mops and shop towels, and other ancillary items; and provides restroom cleaning services and supplies, as well as sells uniforms. In addition, the company offers first aid and safety services, and fire protection products and services. It provides its products and services through its distribution network and local delivery routes, or local representatives to small service and manufacturing companies, as well as major corporations. The company was founded in 1968 and is based in Cincinnati, Ohio. Cintas Corporation was formerly a subsidiary of Cintas Corporation.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Carnival Corporation","Symbol":"CCL","Current Price":"26.46","Latest MA":"19.24","Price Target":"27.52","Difference from MA":"37.54%","Difference from Open":"2.66%","Change from Yesterday":"5.32%","Change from Last Report":"0.13","Latest Volume":"26,740,483","Market Cap":"35,584,786,432","Earning Date":"2024-12-20","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":12.995467,"ROE":0.20120001,"DTE":352.355,"Industry":"Travel Services","Sector":"Consumer Cyclical","Beta":2.668,"Trailing PEG":null,"Trailing PE":22.665983,"Trailing PS":1.4536862,"Quick Ratio":0.202,"Day High":26.5199,"Day Low":25.44,"VS Average Volume":1.0579654078,"Company Summary":"Carnival Corporation & plc engages in the provision of leisure travel services in North America, Australia, Europe, Asia, and internationally. The company operates through four segments: NAA Cruise Operations, Europe Cruise Operations, Cruise Support, and Tour and Other. It operates port destinations, private islands, and a solar park, as well as owns and operates hotels, lodges, glass-domed railcars, and motor coaches. The company offers its services under the Carnival Cruise Line, Princess Cruises, Holland America Line, Seabourn, Costa Cruises, AIDA Cruises, P&O Cruises, and Cunard brand. Additionally, it sells its cruises primarily through travel agents, tour operators, vacation planners, and websites. Carnival Corporation & plc was founded in 1972 and is headquartered in Miami, Florida.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Lamb Weston Holdings, Inc.","Symbol":"LW","Current Price":"63.27","Latest MA":"73.05","Price Target":"77.50","Difference from MA":"-13.39%","Difference from Open":"1.35%","Change from Yesterday":"1.30%","Change from Last Report":"0.36","Latest Volume":"1,509,423","Market Cap":"9,030,601,728","Earning Date":"2024-12-19","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":15.801429,"ROE":0.37015,"DTE":221.158,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.715,"Trailing PEG":2.1085,"Trailing PE":24.925198,"Trailing PS":1.3987055,"Quick Ratio":0.486,"Day High":63.956,"Day Low":61.52,"VS Average Volume":0.5831627928,"Company Summary":"Lamb Weston Holdings, Inc. engages in the production, distribution, and marketing of frozen potato products in the United States, Canada, Mexico, and internationally. It offers frozen potatoes, commercial ingredients, and appetizers under the Lamb Weston brand, as well as under various customer labels. The company also provides its products under its owned or licensed brands, such as Grown in Idaho and Alexia, and other licensed brands, as well as under retailers' own brands. It sells its products through a network of internal sales personnel and independent brokers, agents, and distributors to quick service and full-service restaurants and chains, wholesale, grocery, mass merchants, club retailers, and specialty retailers, as well as foodservice distributors and institutions, including businesses, educational institutions, independent restaurants, regional chain restaurants, and convenience stores. The company was incorporated in 1950 and is headquartered in Eagle, Idaho.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Accenture plc","Symbol":"ACN","Current Price":"368.75","Latest MA":"333.63","Price Target":"400.55","Difference from MA":"10.53%","Difference from Open":"-0.53%","Change from Yesterday":"-0.94%","Change from Last Report":"-0.10","Latest Volume":"1,881,322","Market Cap":"230,655,426,560","Earning Date":"2024-12-19","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":26.419546,"ROE":0.26674998,"DTE":14.127,"Industry":"Information Technology Services","Sector":"Technology","Beta":1.245,"Trailing PEG":2.3324,"Trailing PE":30.851883,"Trailing PS":3.5542064,"Quick Ratio":0.984,"Day High":370.47,"Day Low":362.0,"VS Average Volume":0.7636521573,"Company Summary":"Accenture plc provides strategy and consulting, industry X, song, and technology and operation services in North America, Europe, the Middle East, Africa, and internationally. It offers systems integration and application management; security; intelligent platform; infrastructure; software engineering; data and AI; and automation services. The company also operates business processes; and designs, manufactures, and assembles automation equipment, robotics, and other commercial hardware products. It serves communications, media, and technology; banking and capital markets, and insurance; health and public service; consumer goods, retail, travel services; industrial; life science; chemicals, natural resources, energy, and utilities sectors. It has collaboration agreement with Kyoto University to advance learning, research, and innovation in human-centered  AI. The company was founded in 1951 and is based in Dublin, Ireland.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Nike, Inc.","Symbol":"NKE","Current Price":"76.97","Latest MA":"80.82","Price Target":"88.53","Difference from MA":"-4.76%","Difference from Open":"1.33%","Change from Yesterday":"-0.23%","Change from Last Report":"0.14","Latest Volume":"19,202,777","Market Cap":"114,495,414,272","Earning Date":"2024-12-19","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":27.715921,"ROE":0.3798,"DTE":86.962,"Industry":"Footwear & Accessories","Sector":"Consumer Cyclical","Beta":1.035,"Trailing PEG":4.0162,"Trailing PE":23.74074,"Trailing PS":2.2893589,"Quick Ratio":1.417,"Day High":77.99,"Day Low":74.8587,"VS Average Volume":1.6431284338,"Company Summary":"NIKE, Inc., together with its subsidiaries, engages in the design, development, marketing, and sale of athletic footwear, apparel, equipment, accessories, and services worldwide. The company provides athletic and casual footwear, apparel, and accessories under the NIKE, Jumpman, Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks. It also sells a line of performance equipment and accessories comprising bags, sport balls, socks, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities under the NIKE brand; and various plastic products to other manufacturers. In addition, the company markets apparel with licensed college and professional team, and league logos, as well as sells sports apparel; licenses unaffiliated parties to manufacture and sell apparel, digital devices, and applications and other equipment for sports activities under NIKE-owned trademarks; and operates digital platforms, including fitness and activity apps; sport, fitness, and wellness content; and digital services and features in retail stores. It sells its products to footwear stores; sporting goods stores; athletic specialty stores; department stores; skate, tennis, and golf shops; and other retail accounts through NIKE-owned retail stores, digital platforms, independent distributors, licensees, and sales representatives. The company was founded in 1964 and is headquartered in Beaverton, Oregon.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Darden Restaurants, Inc.","Symbol":"DRI","Current Price":"185.94","Latest MA":"155.45","Price Target":"184.44","Difference from MA":"19.61%","Difference from Open":"1.40%","Change from Yesterday":"1.39%","Change from Last Report":"0.14","Latest Volume":"1,106,562","Market Cap":"21,854,412,800","Earning Date":"2024-12-19","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":17.463745,"ROE":0.48619,"DTE":326.282,"Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":1.309,"Trailing PEG":1.9459,"Trailing PE":21.25657,"Trailing PS":1.9142998,"Quick Ratio":0.108,"Day High":186.0,"Day Low":181.09,"VS Average Volume":0.8790561222,"Company Summary":"Darden Restaurants, Inc., together with its subsidiaries, owns and operates full-service restaurants in the United States and Canada. It operates under Olive Garden, LongHorn Steakhouse, Cheddar's Scratch Kitchen, Yard House, The Capital Grille, Seasons 52, Bahama Breeze, Eddie V's Prime Seafood, and Capital Burger brand names. Darden Restaurants, Inc. was incorporated in 1995 and is based in Orlando, Florida.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"ConAgra Brands, Inc.","Symbol":"CAG","Current Price":"27.20","Latest MA":"29.19","Price Target":"30.00","Difference from MA":"-6.83%","Difference from Open":"1.78%","Change from Yesterday":"1.32%","Change from Last Report":"0.22","Latest Volume":"2,373,818","Market Cap":"12,965,121,024","Earning Date":"2024-12-19","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.438242,"ROE":0.05605,"DTE":100.881,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.332,"Trailing PEG":0.3218,"Trailing PE":26.373789,"Trailing PS":1.0856924,"Quick Ratio":0.291,"Day High":27.23,"Day Low":26.72,"VS Average Volume":0.4761317169,"Company Summary":"Conagra Brands, Inc., together with its subsidiaries, operates as a consumer packaged goods food company primarily in the United States. The company operates through four segments: Grocery & Snacks, Refrigerated & Frozen, International, and Foodservice. The Grocery & Snacks segment primarily offers shelf stable food products through various retail channels. The Refrigerated & Frozen segment provides temperature-controlled food products through various retail channels. The International segment offers food products in various temperature states through retail and foodservice channels outside of the United States. The Foodservice segment offers branded and customized food products, including meals, entrees, sauces, and various custom-manufactured culinary products packaged for restaurants and other foodservice establishments. The company sells its products under the Birds Eye, Marie Callender's, Duncan Hines, Healthy Choice, Slim Jim, Reddi-wip, Angie's, BOOMCHICKAPOP brands. The company was incorporated in 1919 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"CarMax Inc","Symbol":"KMX","Current Price":"84.47","Latest MA":"77.12","Price Target":"84.86","Difference from MA":"9.53%","Difference from Open":"-1.09%","Change from Yesterday":"0.28%","Change from Last Report":"0.05","Latest Volume":"1,009,924","Market Cap":"12,999,838,720","Earning Date":"2024-12-19","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":21.836866,"ROE":0.06853,"DTE":314.637,"Industry":"Auto & Truck Dealerships","Sector":"Consumer Cyclical","Beta":1.686,"Trailing PEG":1.0303,"Trailing PE":28.72959,"Trailing PS":0.4696632,"Quick Ratio":0.349,"Day High":85.4,"Day Low":82.12,"VS Average Volume":0.5031769797,"Company Summary":"CarMax, Inc., through its subsidiaries, operates as a retailer of used vehicles and related products in the United States. It operates in two segments: CarMax Sales Operations and CarMax Auto Finance. The CarMax Sales Operations segment offers customers a range of makes and models of used vehicles, including domestic, imported, and luxury vehicles, as well as hybrid and electric vehicles; used vehicle auctions; extended protection plans to customers at the time of sale; and reconditioning and vehicle repair services. The CarMax Auto Finance segment provides financing alternatives for retail customers across a range of credit spectrum and arrangements with various financial institutions. The company was founded in 1993 and is based in Richmond, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"FedEx Corporation","Symbol":"FDX","Current Price":"279.51","Latest MA":"277.47","Price Target":"311.19","Difference from MA":"0.74%","Difference from Open":"-4.93%","Change from Yesterday":"1.17%","Change from Last Report":"-0.03","Latest Volume":"4,747,955","Market Cap":"68,190,359,552","Earning Date":"2024-12-19","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":12.399223,"ROE":0.1507,"DTE":"N\/A","Industry":"Integrated Freight & Logistics","Sector":"Industrials","Beta":1.177,"Trailing PEG":1.1261,"Trailing PE":17.811054,"Trailing PS":0.7785087,"Quick Ratio":1.152,"Day High":295.244,"Day Low":270.9,"VS Average Volume":2.9390476108,"Company Summary":"FedEx Corporation, together with its subsidiaries, provides transportation, e-commerce, and business services in the United States and internationally. It operates through FedEx Express, FedEx Ground, FedEx Freight, and FedEx Services segments. The FedEx Express segment offers express transportation, small-package ground delivery, and freight transportation services; and time-critical transportation services. The FedEx Ground segment provides small-package ground delivery services. The FedEx Freight segment offers less-than-truckload freight transportation services. The FedEx Services segment provides sales, marketing, information technology, communications, customer service, technical support, billing and collection, and back-office support services. In addition, the company offers supply chain management solutions; and air and ocean freight forwarding and cargo transportation, specialty transportation, customs brokerage, third party logistics and supply chain, and document and business solutions, as well as provides trade management tools and data. The company was founded in 1971 and is headquartered in Memphis, Tennessee.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Micron Technology, Inc.","Symbol":"MU","Current Price":"88.20","Latest MA":"109.52","Price Target":"135.74","Difference from MA":"-19.47%","Difference from Open":"3.27%","Change from Yesterday":"1.14%","Change from Last Report":"0.18","Latest Volume":"20,742,253","Market Cap":"98,141,659,136","Earning Date":"2024-12-18","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":6.862993,"ROE":0.01743,"DTE":31.194,"Industry":"Semiconductors","Sector":"Technology","Beta":1.179,"Trailing PEG":0.1458,"Trailing PE":25.239254,"Trailing PS":3.9083135,"Quick Ratio":1.592,"Day High":88.2596,"Day Low":83.54,"VS Average Volume":0.8893352757,"Company Summary":"Micron Technology, Inc. designs, develops, manufactures, and sells memory and storage products in the United States, Taiwan, Mainland China, rest of the Asia Pacific, Hong Kong, Japan, Europe, and internationally. The company operates through four segments: Compute and Networking Business Unit, Mobile Business Unit, Embedded Business Unit, and Storage Business Unit. It provides memory and storage technologies comprising dynamic random access memory semiconductor devices with low latency that provide high-speed data retrieval; non-volatile and re-writeable semiconductor storage devices; and non-volatile re-writable semiconductor memory devices that provide fast read speeds under the Micron and Crucial brands, as well as through private labels. The company offers serves the data center, PC, graphics, networking, automotive, industrial, and consumer embedded markets, as well as for smartphone and other mobile-device markets. It markets its products through its direct sales force, independent sales representatives, distributors, and retailers; and web-based customer direct sales channel, as well as through channel and distribution partners. Micron Technology, Inc. was founded in 1978 and is headquartered in Boise, Idaho.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Broadcom Inc.","Symbol":"AVGO","Current Price":"228.58","Latest MA":"165.61","Price Target":"238.81","Difference from MA":"38.02%","Difference from Open":"3.73%","Change from Yesterday":"4.80%","Change from Last Report":"-0.01","Latest Volume":"23,623,978","Market Cap":"1,068,582,043,648","Earning Date":"2024-12-12","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":30.12912,"ROE":0.12509,"DTE":166.032,"Industry":"Semiconductors","Sector":"Technology","Beta":1.187,"Trailing PEG":0.6189,"Trailing PE":177.35658,"Trailing PS":22.825634,"Quick Ratio":0.841,"Day High":229.1886,"Day Low":218.91,"VS Average Volume":0.9316608171,"Company Summary":"Broadcom Inc. designs, develops, and supplies various semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products worldwide. The company operates in two segments, Semiconductor Solutions and Infrastructure Software. It provides set-top box system-on-chips (SoCs); cable, digital subscriber line, and passive optical networking central office\/consumer premise equipment SoCs; wireless local area network access point SoCs; Ethernet switching and routing custom silicon solutions; serializer\/deserializer application specific integrated circuits; optical and copper, and physical layer devices; and fiber optic components and RF semiconductor devices. The company also offers RF front end modules and filter; Wi-Fi, Bluetooth, and global positioning system\/global navigation satellite system SoCs; custom touch controllers; inductive charging; attached small computer system interface, and redundant array of independent disks controllers and adapters; peripheral component interconnect express; fiber channel host bus adapters; read channel based SoCs; custom flash controllers; preamplifiers; optocouplers, industrial fiber optics, and motion control encoders and subsystems; light emitting diode, ethernet PHYs, switch ICs, and camera microcontrollers. Its products are used in various applications, including enterprise and data center networking, home connectivity, set-top boxes, broadband access, telecommunication equipment, smartphones and base stations, data center servers and storage systems, factory automation, power generation and alternative energy systems, and electronic displays. Broadcom Inc. was founded in 1961 and is headquartered in Palo Alto, California.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Lennar Corporation","Symbol":"LEN","Current Price":"139.27","Latest MA":"168.45","Price Target":"182.93","Difference from MA":"-17.32%","Difference from Open":"1.00%","Change from Yesterday":"0.64%","Change from Last Report":"0.13","Latest Volume":"1,495,281","Market Cap":"37,632,118,784","Earning Date":"2024-12-18","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":8.187875,"ROE":0.15878001,"DTE":14.665,"Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":1.619,"Trailing PEG":1.0101,"Trailing PE":9.733752,"Trailing PS":1.0320703,"Quick Ratio":3.257,"Day High":139.89,"Day Low":136.57,"VS Average Volume":0.7330020819,"Company Summary":"Lennar Corporation, together with its subsidiaries, operates as a homebuilder primarily under the Lennar brand in the United States. It operates through Homebuilding East, Homebuilding Central, Homebuilding Texas, Homebuilding West, Financial Services, Multifamily, and Lennar Other segments. The company's homebuilding operations include the construction and sale of single-family attached and detached homes, as well as the purchase, development, and sale of residential land; and development, construction, and management of multifamily rental properties. It also offers residential mortgage financing, title, insurance, and closing services for home buyers and others, as well as originates and sells securitization commercial mortgage loans. In addition, the company is involved in the fund investment activity. It primarily serves first-time, move-up, active adult, and luxury homebuyers. Lennar Corporation was founded in 1954 and is based in Miami, Florida.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Adobe Inc.","Symbol":"ADBE","Current Price":"448.81","Latest MA":"518.52","Price Target":"588.34","Difference from MA":"-13.45%","Difference from Open":"3.45%","Change from Yesterday":"2.59%","Change from Last Report":"-0.04","Latest Volume":"2,188,447","Market Cap":"197,522,145,280","Earning Date":"2024-12-11","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":19.45895,"ROE":0.35355,"DTE":41.788,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.299,"Trailing PEG":1.4311,"Trailing PE":36.244747,"Trailing PS":9.429615,"Quick Ratio":0.966,"Day High":449.48,"Day Low":433.01,"VS Average Volume":0.6533161261,"Company Summary":"Adobe Inc., together with its subsidiaries, operates as a diversified software company worldwide. It operates through three segments: Digital Media, Digital Experience, and Publishing and Advertising. The Digital Media segment offers products, services, and solutions that enable individuals, teams, and enterprises to create, publish, and promote content; and Document Cloud, a unified cloud-based document services platform. Its flagship product is Creative Cloud, a subscription service that allows members to access its creative products. This segment serves content creators, students, workers, marketers, educators, enthusiasts, and communicators. The Digital Experience segment provides an integrated platform and set of applications and services that enable brands and businesses to create, manage, execute, measure, monetize, and optimize customer experiences from analytics to commerce. This segment serves marketers, advertisers, agencies, publishers, merchandisers, merchants, web analysts, data scientists, developers, and executives across the C-suite. The Publishing and Advertising segment offers products and services, such as e-learning solutions, technical document publishing, web conferencing, document and forms platform, web application development, and high-end printing, as well as Advertising Cloud offerings. It also provides consulting, technical support, and learning services. The company offers its products and services directly to enterprise customers through its sales force and local field offices, as well as to end users through app stores and through its website at adobe.com. It also distributes products and services through distributors, value-added resellers, systems integrators, software vendors and developers, retailers, and original equipment manufacturers. The company was formerly known as Adobe Systems Incorporated and changed its name to Adobe Inc. in October 2018. Adobe Inc. was founded in 1982 and is headquartered in San Jose, California.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Costco Wholesale Corporation","Symbol":"COST","Current Price":"959.49","Latest MA":"883.17","Price Target":"1,035.27","Difference from MA":"8.64%","Difference from Open":"1.06%","Change from Yesterday":"0.45%","Change from Last Report":"0.07","Latest Volume":"1,562,597","Market Cap":"425,730,211,840","Earning Date":"2024-12-12","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":47.98037,"ROE":0.30267,"DTE":42.118,"Industry":"Discount Stores","Sector":"Consumer Defensive","Beta":0.789,"Trailing PEG":5.8257,"Trailing PE":56.415882,"Trailing PS":1.6731192,"Quick Ratio":0.391,"Day High":961.9414,"Day Low":943.05,"VS Average Volume":0.8304958271,"Company Summary":"Costco Wholesale Corporation, together with its subsidiaries, engages in the operation of membership warehouses in the United States, Puerto Rico, Canada, Mexico, Japan, the United Kingdom, Korea, Australia, Taiwan, China, Spain, France, Iceland, New Zealand, and Sweden. The company offers branded and private-label products in a range of merchandise categories. It offers merchandise, such as sundries, dry groceries, candies, coolers, freezers, deli, liquor, and tobacco; appliances, electronics, health and beauty aids, hardware, lawn and garden, sporting goods, tires, toys and seasonal products, office supplies, automotive care products, postages, tickets, apparel, small appliances, furniture, domestics, housewares, special order kiosks, and jewelry; and meat, produce, service deli, and bakery products. The company also operates gasoline, pharmacies, optical, food courts, hearing-aid centers, and tire installation centers; and offers business delivery, travel, grocery, and various other services online. It also operates e-commerce websites. The company was formerly known as Costco Companies, Inc. and changed its name to Costco Wholesale Corporation in August 1999. Costco Wholesale Corporation was founded in 1976 and is based in Issaquah, Washington.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"General Mills, Inc.","Symbol":"GIS","Current Price":"64.14","Latest MA":"67.65","Price Target":"70.78","Difference from MA":"-5.18%","Difference from Open":"-0.26%","Change from Yesterday":"0.15%","Change from Last Report":"0.09","Latest Volume":"2,024,661","Market Cap":"35,335,503,872","Earning Date":"2024-12-18","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.927601,"ROE":0.24168,"DTE":139.823,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.107,"Trailing PEG":3.2625,"Trailing PE":13.935412,"Trailing PS":1.7845672,"Quick Ratio":0.317,"Day High":64.5,"Day Low":63.33,"VS Average Volume":0.5259637074,"Company Summary":"General Mills, Inc. manufactures and markets branded consumer foods worldwide. The company operates through four segments: North America Retail; International; Pet; and North America Foodservice. It offers grain, ready-to-eat cereals, refrigerated yogurt, soup, meal kits, refrigerated and frozen dough products, dessert and baking mixes, bakery flour, frozen pizza and pizza snacks, snack bars, fruit and savory snacks, ice cream and frozen desserts, unbaked and fully baked frozen dough products, frozen hot snacks, ethnic meals, side dish mixes, frozen breakfast and entrees, nutrition bars, and frozen and shelf-stable vegetables. The company also manufactures and markets pet food products, including dog and cat food; and operates ice cream parlors. It markets its products under the Annie's, Betty Crocker, Bisquick, Blue Buffalo, Bugles, Cascadian Farm, Cheerios, Chex, Cinnamon Toast Crunch, Cocoa Puffs, Cookie Crisp, Dunkaroos, Edgard & Cooper, Fiber One, Fruit by the Foot, Fruit Gushers, Fruit Roll-Ups, Gardetto's, Gold Medal, Golden Grahams, Häagen-Dazs, Kitano, Kix, Lärabar, Latina, Lucky Charms, Muir Glen, Nature Valley, Nudges, Oatmeal Crisp, Old El Paso, Pillsbury, Progresso, Tastefuls, Total, Totino's , Trix, True Chews, True Solutions, Wanchai Ferry, Wheaties, Wilderness, and Yoki brands. The company sells its products to grocery stores, mass merchandisers, membership stores, natural food chains, drug, dollar and discount chains, e-commerce retailers, commercial and noncommercial foodservice distributors and operators, restaurants, convenience stores, and pet specialty stores. General Mills, Inc. was founded in 1866 and is headquartered in Minneapolis, Minnesota.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Jabil Inc.","Symbol":"JBL","Current Price":"145.67","Latest MA":"118.27","Price Target":"165.13","Difference from MA":"23.17%","Difference from Open":"4.06%","Change from Yesterday":"3.71%","Change from Last Report":"0.31","Latest Volume":"860,213","Market Cap":"16,267,527,168","Earning Date":"2024-12-18","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":14.414003,"ROE":0.60295,"DTE":207.887,"Industry":"Electronic Components","Sector":"Technology","Beta":1.245,"Trailing PEG":null,"Trailing PE":13.766068,"Trailing PS":0.5632215,"Quick Ratio":0.58,"Day High":145.75,"Day Low":139.98,"VS Average Volume":0.6568366638,"Company Summary":"Jabil Inc. provides manufacturing services and solutions worldwide. It operates in two segments, Electronics Manufacturing Services and Diversified Manufacturing Services. The company offers electronics design, production, and product management services; electronic circuit design services, such as application-specific integrated circuit design, firmware development, and rapid prototyping services; and designs plastic and metal enclosures that include the electro-mechanics, such as the printed circuit board assemblies (PCBA). It also provides three-dimensional mechanical design comprising the analysis of electronic, electro-mechanical, and optical assemblies, as well as various industrial design, mechanism development, and tooling management services. In addition, the company provides computer-assisted design services consisting of PCBA design, as well as PCBA design validation and verification services; and other consulting services, such as the generation of a bill of materials, approved vendor list, and assembly equipment configuration for various PCBA designs. Further, it offers product and process validation services, such as product system, product safety, regulatory compliance, and reliability tests, as well as manufacturing test solution development services. Additionally, the company provides systems assembly, test, direct-order fulfillment, and configure-to-order services. It serves 5G, wireless and cloud, digital print and retail, industrial and semi-cap, networking and storage, automotive and transportation, connected devices, healthcare and packaging, and mobility industries. The company was formerly known as Jabil Circuit, Inc. and changed its name to Jabil Inc. in June 2017. Jabil Inc. was founded in 1966 and is headquartered in Saint Petersburg, Florida.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Ferguson Enterprises Inc.","Symbol":"FERG","Current Price":"176.67","Latest MA":"201.24","Price Target":"226.18","Difference from MA":"-12.21%","Difference from Open":"2.53%","Change from Yesterday":"1.09%","Change from Last Report":"0.03","Latest Volume":"897,802","Market Cap":"35,455,197,184","Earning Date":"2024-12-10","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":16.426199,"ROE":0.32573003,"DTE":98.237,"Industry":"Industrial Distribution","Sector":"Industrials","Beta":1.2,"Trailing PEG":1.4612,"Trailing PE":21.183453,"Trailing PS":1.196396,"Quick Ratio":0.8,"Day High":176.81,"Day Low":172.0,"VS Average Volume":0.5545695054,"Company Summary":"Ferguson Enterprises Inc. distributes plumbing and heating products in the United States and Canada. The company provides expertise, solutions, and products, including infrastructure, plumbing, appliances, fire, and fabrication, as well as heating, ventilation, and air conditioning (HVAC) to residential and non-residential customers. It also supplies specialist water and wastewater treatment products to residential, commercial, and infrastructure contractors, as well as supplies pipe, valves, and fittings solutions to industrial customers. In addition, it offers customized solutions, such as virtual design, fabrication, valve actuation, pre-assembly, kitting, installation, and project management services, as well as after-sales support that comprises warranty, credit, project-based billing, returns and maintenance, and repair and operations support. The company sells its products through a network of distribution centers, branches, counter service and specialist sales associates, showroom consultants, and e-commerce channels. Ferguson Enterprises Inc. was founded in 1953 and is headquartered in Newport News, Virginia.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Ciena Corporation","Symbol":"CIEN","Current Price":"89.02","Latest MA":"58.59","Price Target":"87.93","Difference from MA":"51.95%","Difference from Open":"4.91%","Change from Yesterday":"3.71%","Change from Last Report":"-0.02","Latest Volume":"632,971","Market Cap":"12,692,816,896","Earning Date":"2024-12-12","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":26.187063,"ROE":0.047319997,"DTE":55.23,"Industry":"Communication Equipment","Sector":"Technology","Beta":0.938,"Trailing PEG":null,"Trailing PE":153.40517,"Trailing PS":3.157158,"Quick Ratio":2.511,"Day High":89.15,"Day Low":84.54,"VS Average Volume":0.2981397675,"Company Summary":"Ciena Corporation provides hardware and software services for delivery of video, data, and voice traffic metro, aggregation, and access communications network worldwide. The company's Networking Platforms segment offers convergence of coherent optical transport, open optical networking, optical transport network switching, IP routing, and switching services. Its products include 6500 Packet-Optical Platform, Waveserver stackable interconnect system, and the 6500 Reconfigurable line system, and the 5400 family of Packet-Optical platforms, as well as 8100 coherent routing platforms; 3000 family of service delivery switches and the 5000 family of service aggregation switches, as well as 8700 Packetwave Platform and 6500 Packet Transport System. This segment also sells operating system software and enhanced software features embedded in each of its products. The company's Blue Planet Automation Software and Services segment provides multi-domain service orchestration, inventory, route optimization and analysis, multi-cloud orchestration, and unified assurance and analytics services. Its Platform Software and Service segment offers MCP domain controller solution, and OneControl unified management system, as well as planning tools. The company's Global Services segment provides maintenance support and training, installation and deployment, and consulting and network design services. Ciena Corporation was incorporated in 1992 and is headquartered in Hanover, Maryland.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"MongoDB, Inc.","Symbol":"MDB","Current Price":"248.30","Latest MA":"270.99","Price Target":"379.52","Difference from MA":"-8.37%","Difference from Open":"3.00%","Change from Yesterday":"1.13%","Change from Last Report":"-0.01","Latest Volume":"1,013,880","Market Cap":"18,452,324,352","Earning Date":"2024-12-09","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":74.346344,"ROE":-0.19561,"DTE":89.869,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.153,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":10.140813,"Quick Ratio":4.76,"Day High":248.57,"Day Low":239.76,"VS Average Volume":0.5888505891,"Company Summary":"MongoDB, Inc., together with its subsidiaries, provides general purpose database platform worldwide. The company provides MongoDB Atlas, a hosted multi-cloud database-as-a-service solution; MongoDB Enterprise Advanced, a commercial database server for enterprise customers to run in the cloud, on-premises, or in a hybrid environment; and Community Server, a free-to-download version of its database, which includes the functionality that developers need to get started with MongoDB. It offers professional services comprising consulting and training. The company was formerly known as 10gen, Inc. and changed its name to MongoDB, Inc. in August 2013. MongoDB, Inc. was incorporated in 2007 and is headquartered in New York, New York.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Oracle Corporation","Symbol":"ORCL","Current Price":"170.50","Latest MA":"154.87","Price Target":"199.38","Difference from MA":"10.09%","Difference from Open":"1.65%","Change from Yesterday":"0.91%","Change from Last Report":"0.05","Latest Volume":"3,151,952","Market Cap":"476,378,234,880","Earning Date":"2024-12-09","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":24.154173,"ROE":1.55578,"DTE":749.978,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.013,"Trailing PEG":1.8205,"Trailing PE":41.745102,"Trailing PS":8.852146,"Quick Ratio":0.591,"Day High":170.56,"Day Low":165.63,"VS Average Volume":0.4068897081,"Company Summary":"Oracle Corporation offers products and services that address enterprise information technology environments worldwide. Its Oracle cloud software as a service offering include various cloud software applications, including Oracle Fusion cloud enterprise resource planning (ERP), Oracle Fusion cloud enterprise performance management, Oracle Fusion cloud supply chain and manufacturing management, Oracle Fusion cloud human capital management, Oracle Cerner healthcare, and NetSuite applications suite, as well as Oracle Fusion Sales, Service, and Marketing. The company also offers cloud-based industry solutions for various industries; Oracle application licenses; and Oracle license support services. In addition, it provides cloud and license business' infrastructure technologies, such as the Oracle Database and MySQL Database; Java, a software development language; and middleware, including development tools and others. The company's cloud and license business' infrastructure technologies also comprise cloud-based compute, storage, and networking capabilities; and Oracle autonomous database and MySQL HeatWave, as well as Internet-of-Things, digital assistant, and blockchain. Further, it provides hardware products and other hardware-related software offerings, including Oracle engineered systems, enterprise servers, storage solutions, industry-specific hardware, virtualization software, operating systems, management software, and related hardware services, as well as hardware support products; and consulting and customer services. The company markets and sells its cloud, license, hardware, support, and services offerings directly to businesses in various industries, government agencies, and educational institutions, as well as through indirect channels. Oracle Corporation was founded in 1977 and is headquartered in Austin, Texas.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Fastenal Company","Symbol":"FAST","Current Price":"75.15","Latest MA":"70.93","Price Target":"78.82","Difference from MA":"5.94%","Difference from Open":"1.90%","Change from Yesterday":"1.50%","Change from Last Report":"0.11","Latest Volume":"1,771,787","Market Cap":"43,046,653,952","Earning Date":"2025-01-17","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":34.36747,"ROE":0.32698002,"DTE":14.644,"Industry":"Industrial Distribution","Sector":"Industrials","Beta":0.979,"Trailing PEG":4.0542,"Trailing PE":37.383083,"Trailing PS":5.7548237,"Quick Ratio":2.013,"Day High":75.1692,"Day Low":73.48,"VS Average Volume":0.6592386738,"Company Summary":"Fastenal Company, together with its subsidiaries, engages in the wholesale distribution of industrial and construction supplies in the United States, Canada, Mexico, North America, and internationally. It offers fasteners, and related industrial and construction supplies under the Fastenal name. The company's fastener products include threaded fasteners, bolts, nuts, screws, studs, and related washers that are used in manufactured products and construction projects, as well as in the maintenance and repair of machines. It also offers miscellaneous supplies and hardware, including pins, machinery keys, concrete anchors, metal framing systems, wire ropes, strut products, rivets, and related accessories. The company serves the manufacturing market comprising original equipment manufacturers; maintenance, repair, and operations customers; non-residential construction market; farmers, truckers, railroads, mining companies, schools, and retail trades; and oil exploration, production, and refinement companies, as well as federal, state, and local governmental entities. Fastenal Company was founded in 1967 and is headquartered in Winona, Minnesota.","Stock Sentiment":"Sell","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Toll Brothers, Inc.","Symbol":"TOL","Current Price":"125.74","Latest MA":"138.24","Price Target":"161.71","Difference from MA":"-9.04%","Difference from Open":"1.57%","Change from Yesterday":"1.42%","Change from Last Report":"0.16","Latest Volume":"702,930","Market Cap":"12,528,882,688","Earning Date":"2024-12-09","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":7.864874,"ROE":0.21799,"DTE":39.692,"Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":1.671,"Trailing PEG":1.0049,"Trailing PE":8.370334,"Trailing PS":1.1894405,"Quick Ratio":0.389,"Day High":125.72,"Day Low":122.86,"VS Average Volume":0.5587003796,"Company Summary":"Toll Brothers, Inc., together with its subsidiaries, designs, builds, markets, sells, and arranges finance for a range of detached and attached homes in luxury residential communities in the United States. It designs, builds, markets, and sells condominiums through Toll Brothers City Living. The company also develops a range of single-story living and first-floor primary bedroom suite home designs, as well as communities with recreational amenities, such as golf courses, marinas, pool complexes, country clubs, and fitness and recreation centers; and develops, operates, and rents apartments. In addition, it provides various interior fit-out options, such as flooring, wall tile, plumbing, cabinets, fixtures, appliances, lighting, and home-automation and security technologies. Further, the company owns and operates architectural, engineering, mortgage, title, land development, insurance, smart home technology, landscaping, lumber distribution, house component assembly, and component manufacturing operations. It serves luxury first-time, move-up, empty-nester, active-adult, and second-home buyers. Toll Brothers, Inc. was founded in 1967 and is headquartered in Fort Washington, Pennsylvania.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Citizens Financial Group, Inc.","Symbol":"CFG","Current Price":"43.74","Latest MA":"40.46","Price Target":"51.42","Difference from MA":"8.12%","Difference from Open":"3.70%","Change from Yesterday":"3.09%","Change from Last Report":"0.25","Latest Volume":"2,214,136","Market Cap":"19,285,073,920","Earning Date":"2025-01-17","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":11.342841,"ROE":0.05426,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.32,"Trailing PEG":null,"Trailing PE":17.160784,"Trailing PS":2.7104814,"Quick Ratio":"N\/A","Day High":43.77,"Day Low":42.14,"VS Average Volume":0.506710411,"Company Summary":"Citizens Financial Group, Inc. operates as the bank holding company that provides retail and commercial banking products and services to individuals, small businesses, middle-market companies, corporations, and institutions in the United States. The company operates in two segments, Consumer Banking and Commercial Banking. The Consumer Banking segment offers deposit products, mortgage and home equity lending products, credit cards, business loans, wealth management, and investment services; and auto, education, and point-of-sale finance loans, as well as digital deposit products. This segment serves its customers through telephone service centers, as well as through its online and mobile platforms. The Commercial Banking segment provides various financial products and solutions, including lending and leasing, deposit and treasury management services, foreign exchange, and interest rate and commodity risk management solutions, as well as syndicated loans, corporate finance, mergers and acquisitions, and debt and equity capital markets services. This segment serves corporate banking, healthcare, technology, asset finance, franchise finance, leasing, asset-based lending, commercial real estate, mid-corporate, and private equity sponsor industries. The company was formerly known as RBS Citizens Financial Group, Inc. and changed its name to Citizens Financial Group, Inc. in April 2014. Citizens Financial Group, Inc. was founded in 1828 and is headquartered in Providence, Rhode Island.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Ally Financial Inc.","Symbol":"ALLY","Current Price":"35.27","Latest MA":"38.09","Price Target":"40.44","Difference from MA":"-7.40%","Difference from Open":"2.26%","Change from Yesterday":"1.91%","Change from Last Report":"0.09","Latest Volume":"582,436","Market Cap":"10,754,306,048","Earning Date":"2025-01-17","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":7.9479074,"ROE":0.06425,"DTE":"N\/A","Industry":"Credit Services","Sector":"Financial Services","Beta":1.389,"Trailing PEG":0.5536,"Trailing PE":14.1172,"Trailing PS":1.5899328,"Quick Ratio":"N\/A","Day High":35.293,"Day Low":34.25,"VS Average Volume":0.1722602945,"Company Summary":"Ally Financial Inc., a digital financial-services company, provides various digital financial products and services in the United States, Canada, and Bermuda. The company operates through Automotive Finance Operations, Insurance Operations, Mortgage Finance Operations, and Corporate Finance Operations segments. The Automotive Finance Operations segment offers automotive financing services, including providing retail installment sales contracts, loans and operating leases, term loans to dealers, financing dealer floorplans and other lines of credit to dealers, warehouse lines to automotive retailers, and fleet financing. It also provides financing services to companies and municipalities for the purchase or lease of vehicles, and vehicle-remarketing services. The Insurance Operations segment offers consumer finance protection and insurance products through the automotive dealer channel, and commercial insurance products directly to dealers. This segment provides vehicle service and maintenance contract, and guaranteed asset protection products; and underwrites commercial insurance coverages, which primarily insure dealers' vehicle inventory. The Mortgage Finance Operations segment manages consumer mortgage loan portfolio that includes bulk purchases of jumbo and low-to-moderate income mortgage loans originated by third parties, as well as direct-to-consumer mortgage offerings. The Corporate Finance Operations segment provides senior secured leveraged cash flow and asset-based loans to middle market companies; leveraged loans; and commercial real estate product to serve companies in the nursing facilities, senior housing, and medical office buildings. It also offers commercial banking products and services. In addition, it provides securities brokerage and investment advisory services. The company was formerly known as GMAC Inc. and changed its name to Ally Financial Inc. in May 2010. Ally Financial Inc. was founded in 1919 and is based in Detroit, Michigan.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Schlumberger N.V.","Symbol":"SLB","Current Price":"37.15","Latest MA":"43.47","Price Target":"55.43","Difference from MA":"-14.55%","Difference from Open":"0.87%","Change from Yesterday":"0.72%","Change from Last Report":"0.12","Latest Volume":"5,161,530","Market Cap":"52,496,674,816","Earning Date":"2025-01-17","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":10.33776,"ROE":0.21722999,"DTE":57.141,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.532,"Trailing PEG":1.6601,"Trailing PE":11.953377,"Trailing PS":1.4584435,"Quick Ratio":1.003,"Day High":37.25,"Day Low":36.62,"VS Average Volume":0.4267117436,"Company Summary":"Schlumberger Limited engages in the provision of technology for the energy industry worldwide. The company operates through four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company provides field development and hydrocarbon production, carbon management, and integration of adjacent energy systems; reservoir interpretation and data processing services for exploration data; and well construction and production improvement services and products. It also offers subsurface geology and fluids evaluation information; open and cased hole services; exploration and production pressure, and flow-rate measurement services; and pressure pumping, well stimulation, and coiled tubing equipment solutions. In addition, the company offers mud logging, directional drilling, measurement-while-drilling, and logging-while-drilling services, as well as engineering support services; supplies drilling fluid systems; designs, manufactures, and markets roller cone and fixed cutter drill bits; bottom-hole-assembly and borehole enlargement technologies; well cementing products and services; well planning, well drilling, engineering, supervision, logistics, procurement, and contracting of third parties, as well as drilling rig management solutions; and drilling equipment and services, as well as land drilling rigs and related services. Further, it provides artificial lift production equipment and optimization services; supplies packers, safety valves, sand control technology, and various intelligent well completions technology and equipment; designs and manufactures valves, chokes, actuators, and surface trees; and OneSubsea, an integrated solutions, products, systems, and services, including wellheads, subsea trees, manifolds and flowline connectors, control systems, connectors, and services. The company was formerly known as Socie´te´ de Prospection E´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Regions Financial Corporation","Symbol":"RF","Current Price":"23.81","Latest MA":"22.16","Price Target":"28.33","Difference from MA":"7.45%","Difference from Open":"3.39%","Change from Yesterday":"2.83%","Change from Last Report":"0.25","Latest Volume":"3,896,803","Market Cap":"21,653,686,272","Earning Date":"2025-01-17","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":10.586865,"ROE":0.10042,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.182,"Trailing PEG":4.3441,"Trailing PE":13.460452,"Trailing PS":3.3028805,"Quick Ratio":"N\/A","Day High":23.825,"Day Low":23.01,"VS Average Volume":0.5179057316,"Company Summary":"Regions Financial Corporation, a financial holding company, provides banking and bank-related services to individual and corporate customers. It operates through three segments: Corporate Bank, Consumer Bank, and Wealth Management. The Corporate Bank segment offers commercial banking services, such as commercial and industrial, commercial real estate, and investor real estate lending; equipment lease financing; deposit products; and securities underwriting and placement, loan syndication and placement, foreign exchange, derivatives, merger and acquisition, and other advisory services. It serves corporate, middle market, and commercial real estate developers and investors. The Consumer Bank segment provides consumer banking products and services related to residential first mortgages, home equity lines and loans, consumer credit cards, and other consumer loans, as well as deposits. The Wealth Management segment offers credit related products, and retirement and savings solutions; and trust and investment management, asset management, and estate planning services to individuals, businesses, governmental institutions, and non-profit entities. It also provides investment and insurance products; low-income housing tax credit corporate fund syndication services; and other specialty financing services. The company was founded in 1971 and is headquartered in Birmingham, Alabama.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"State Street Corporation","Symbol":"STT","Current Price":"97.96","Latest MA":"84.87","Price Target":"105.07","Difference from MA":"15.43%","Difference from Open":"2.63%","Change from Yesterday":"2.75%","Change from Last Report":"0.14","Latest Volume":"661,349","Market Cap":"28,740,526,080","Earning Date":"2025-01-17","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":10.367362,"ROE":0.0855,"DTE":"N\/A","Industry":"Asset Management","Sector":"Financial Services","Beta":1.48,"Trailing PEG":0.6333,"Trailing PE":15.366771,"Trailing PS":2.2904468,"Quick Ratio":"N\/A","Day High":98.04,"Day Low":94.83,"VS Average Volume":0.3021498887,"Company Summary":"State Street Corporation, through its subsidiaries, provides a range of financial products and services to institutional investors worldwide. The company offers investment servicing products and services, including custody, accounting, regulatory reporting, investor, and performance and analytics; middle office products, such as IBOR, transaction management, loans, cash, derivatives and collateral, record keeping, and client reporting and investment analytics; finance leasing; foreign exchange, and brokerage and other trading services; securities finance and enhanced custody products; deposit and short-term investment facilities; investment manager and alternative investment manager operations outsourcing; performance, risk, and compliance analytics; and financial data management to support institutional investors. It also engages in the provision of portfolio management and risk analytics, as well as trading and post-trade settlement services with integrated compliance and managed data. In addition, the company offers investment management strategies and products, such as core and enhanced indexing, multi-asset strategies, active quantitative and fundamental active capabilities, and alternative investment strategies. Further, it provides services and solutions, including environmental, social, and governance investing; defined benefit and defined contribution; and global fiduciary solutions, as well as exchange-traded funds under the SPDR ETF brand. The company provides its products and services to mutual funds, collective investment funds, UCITS, hedge funds and other investment pools, corporate and public retirement plans, insurance companies, foundations, endowments, and investment managers. State Street Corporation was founded in 1792 and is headquartered in Boston, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Truist Financial Corporation","Symbol":"TFC","Current Price":"43.66","Latest MA":"41.71","Price Target":"50.24","Difference from MA":"4.67%","Difference from Open":"3.18%","Change from Yesterday":"2.63%","Change from Last Report":"0.18","Latest Volume":"2,705,590","Market Cap":"57,972,797,440","Earning Date":"2025-01-17","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":11.093864,"ROE":-0.09505,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.035,"Trailing PEG":1.9441,"Trailing PE":"N\/A","Trailing PS":3.9989512,"Quick Ratio":"N\/A","Day High":43.67,"Day Low":42.28,"VS Average Volume":0.3366898324,"Company Summary":"Truist Financial Corporation, a financial services company, provides banking and trust services in the Southeastern and Mid-Atlantic United States. The company operates through three segments: Consumer Banking and Wealth, Corporate and Commercial Banking, and Insurance Holdings.Its deposit products include noninterest-bearing checking, interest-bearing checking, savings, and money market deposit accounts, as well as certificates of deposit and individual retirement accounts. The company also provides funding; asset management; automobile lending; credit card lending; consumer finance; home equity and mortgage lending; other direct retail lending; insurance; investment brokerage; mobile\/online banking; payment solutions; point-of-sale lending; retail and small business deposit products; small business lending; and wealth management\/private banking services. In addition, it offers asset based lending, investment banking and capital market, institutional trust, insurance premium finance, derivatives, commercial lending, international banking, leasing, merchant, commercial deposit and treasury, floor plan, mortgage warehouse lending, real estate lending, and supply chain financing services. Further, the company provides insurance brokerage, retail and wholesale brokerage, securities underwriting and market making, loan syndication, and investment management and advisory services. The company was formerly known as BB&T Corporation and changed its name to Truist Financial Corporation in December 2019. Truist Financial Corporation was founded in 1872 and is headquartered in Charlotte, North Carolina.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Huntington Bancshares Incorpora","Symbol":"HBAN","Current Price":"16.43","Latest MA":"14.64","Price Target":"18.97","Difference from MA":"12.19%","Difference from Open":"3.53%","Change from Yesterday":"3.33%","Change from Last Report":"0.27","Latest Volume":"8,993,887","Market Cap":"23,884,197,888","Earning Date":"2025-01-17","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":12.244169,"ROE":0.08545,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.057,"Trailing PEG":2.7206,"Trailing PE":15.961166,"Trailing PS":3.5701342,"Quick Ratio":"N\/A","Day High":16.44,"Day Low":15.83,"VS Average Volume":0.6656817995,"Company Summary":"Huntington Bancshares Incorporated operates as the bank holding company for The Huntington National Bank that provides commercial, consumer, and mortgage banking services in the United States. The company offers financial products and services to consumer and business customers, including deposits, lending, payments, mortgage banking, dealer financing, investment management, trust, brokerage, insurance, and other financial products and services. It also provides 24-hour grace, asterisk-free checking, money scout, $50 safety zone, standby cash, early pay, instant access, savings goal getter, and Huntington heads up; digitally powered consumer and business financial solutions to consumer lending, regional banking, branch banking, and wealth management customers; direct and indirect consumer loans, as well as dealer finance loans and deposits; and private banking, wealth management and legacy planning through investment and portfolio management, fiduciary administration and trust, institutional custody, and full-service retail brokerage investment services. The company offers equipment financing, asset-based lending, distribution finance, structured lending, and municipal financing solutions, as well as Huntington ChoicePay. In addition, it offers lending, liquidity, treasury management and other payment services, and capital markets; government and non-profits, healthcare, technology and telecommunications, franchises, financial sponsors, and global services; and corporate risk management, institutional sales and trading, debt and equity issuance, and additional advisory services. The company offers its products through a network of channels, including branches and ATMs, online and mobile banking, and through customer call centers to customers in middle market banking, corporate, specialty, and government banking, asset finance, commercial real estate banking, and capital markets. The company was founded in 1866 and is headquartered in Columbus, Ohio.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"The Travelers Companies, Inc.","Symbol":"TRV","Current Price":"241.83","Latest MA":"228.73","Price Target":"269.65","Difference from MA":"5.73%","Difference from Open":"3.11%","Change from Yesterday":"1.70%","Change from Last Report":"0.08","Latest Volume":"743,583","Market Cap":"54,880,935,936","Earning Date":"2025-01-17","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":11.396147,"ROE":0.19059,"DTE":29.004,"Industry":"Insurance - Property & Casualty","Sector":"Financial Services","Beta":0.63,"Trailing PEG":0.8175,"Trailing PE":12.416333,"Trailing PS":1.2103775,"Quick Ratio":0.198,"Day High":241.76,"Day Low":234.17,"VS Average Volume":0.6018989878,"Company Summary":"The Travelers Companies, Inc., through its subsidiaries, provides a range of commercial and personal property, and casualty insurance products and services to businesses, government units, associations, and individuals in the United States and internationally. The company operates through three segments: Business Insurance, Bond & Specialty Insurance, and Personal Insurance. The Business Insurance segment offers workers' compensation, commercial automobile and property, general liability, commercial multi-peril, employers' liability, public and product liability, professional indemnity, marine, aviation, onshore and offshore energy, construction, terrorism, personal accident, and kidnap and ransom insurance products. This segment operates through select accounts, which serve small businesses; commercial accounts that serve mid-sized businesses; national accounts, which serve large companies; and national property and other that serve large and mid-sized customers, commercial trucking industry, and agricultural businesses, as well as markets and distributes its products through brokers, wholesale agents, and program managers. The Bond & Specialty Insurance segment provides surety, fidelity, management and professional liability, and other property and casualty coverages and related risk management services through independent agencies and brokers. The Personal Insurance segment offers property and casualty insurance covering personal risks, primarily automobile and homeowners' insurance to individuals through independent agencies and brokers. The Travelers Companies, Inc. was founded in 1853 and is based in New York, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"F.N.B. Corporation","Symbol":"FNB","Current Price":"14.72","Latest MA":"14.38","Price Target":"18.88","Difference from MA":"2.39%","Difference from Open":"2.87%","Change from Yesterday":"2.22%","Change from Last Report":"0.27","Latest Volume":"641,255","Market Cap":"5,293,105,664","Earning Date":"2025-01-16","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":10.467556,"ROE":0.06687,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.976,"Trailing PEG":null,"Trailing PE":13.504587,"Trailing PS":3.5457568,"Quick Ratio":"N\/A","Day High":14.72,"Day Low":14.31,"VS Average Volume":0.2691086645,"Company Summary":"F.N.B. Corporation, a bank and financial holding company, provides a range of financial products and services primarily to consumers, corporations, governments, and small- to medium-sized businesses in the United States. The company operates through three segments: Community Banking, Wealth Management, and Insurance. The Community Banking segment offers commercial and consumer banking services, including corporate and small business banking, investment real estate financing, business credit, capital market, and lease financing services. It also provides consumer banking products and services, such as deposit products, mortgage and consumer lending services, and mobile and online banking services. The Wealth Management segment provides personal and corporate fiduciary services comprising administration of decedent and trust estates; and securities brokerage and investment advisory services, mutual funds, and annuities. The Insurance segment comprises commercial and personal insurance, and reinsurance products, as well as mezzanine financing options for small- to medium-sized businesses. The company operates community banking branches in Pennsylvania, Ohio, Maryland, West Virginia, North Carolina, South Carolina, Washington, D.C., and Virginia. F.N.B. Corporation was founded in 1864 and is headquartered in Pittsburgh, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"PNC Financial Services Group, I","Symbol":"PNC","Current Price":"193.25","Latest MA":"178.34","Price Target":"219.25","Difference from MA":"8.36%","Difference from Open":"2.09%","Change from Yesterday":"1.75%","Change from Last Report":"0.08","Latest Volume":"597,634","Market Cap":"76,717,998,080","Earning Date":"2025-01-16","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":12.831233,"ROE":0.099020004,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.121,"Trailing PEG":1.8749,"Trailing PE":16.330236,"Trailing PS":3.7452645,"Quick Ratio":"N\/A","Day High":193.37,"Day Low":189.0,"VS Average Volume":0.3252844172,"Company Summary":"The PNC Financial Services Group, Inc. operates as a diversified financial services company in the United States. It operates through three segments: Retail Banking, Corporate & Institutional Banking, and Asset Management Group segments. The company's Retail Banking segment offers checking, savings, and money market accounts, as well as time deposit; residential mortgages, home equity loans and lines of credit, auto loans, credit cards, education loans, and personal and small business loans and lines of credit; and brokerage, insurance, and investment and cash management services. This segment serves consumer and small business customers through a network of branches, digital channels, ATMs, and through phone-based customer contact centers. Its Corporate & Institutional Banking segment provides secured and unsecured loans, letters of credit, and equipment leases; cash and investment management services, receivables and disbursement management services, funds transfer services, international payment services, and access to online\/mobile information management and reporting; securities underwriting, loan syndications, customer-related trading, and mergers and acquisitions and equity capital markets advisory related services; and commercial loan servicing and technology solutions. It serves mid-sized and large corporations, and government and not-for-profit entities. The company's Asset Management Group segment offers investment and retirement planning, customized investment management, credit and cash management solutions, and trust management and administration services for high net worth and ultra high net worth individuals, and their families; and multi-generational family planning services for ultra high net worth individuals and their families. It also provides outsourced chief investment officer, custody, private real estate, cash and fixed income client solutions, and retirement plan fiduciary investment services for institutional clients. The company was founded in 1852 and is headquartered in Pittsburgh, Pennsylvania.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Goldman Sachs Group, Inc. (The)","Symbol":"GS","Current Price":"570.67","Latest MA":"505.01","Price Target":"606.84","Difference from MA":"13.00%","Difference from Open":"2.84%","Change from Yesterday":"2.98%","Change from Last Report":"0.11","Latest Volume":"1,316,904","Market Cap":"179,085,656,064","Earning Date":"2025-01-16","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":13.312252,"ROE":0.1017,"DTE":609.793,"Industry":"Capital Markets","Sector":"Financial Services","Beta":1.342,"Trailing PEG":3.7349,"Trailing PE":16.7155,"Trailing PS":3.62617,"Quick Ratio":1.458,"Day High":570.83,"Day Low":553.38,"VS Average Volume":0.6566452406,"Company Summary":"The Goldman Sachs Group, Inc., a financial institution, provides a range of financial services for corporations, financial institutions, governments, and individuals worldwide. It operates through Global Banking & Markets, Asset & Wealth Management, and Platform Solutions segments. The Global Banking & Markets segment provides financial advisory services, including strategic advisory assignments related to mergers and acquisitions, divestitures, corporate defense activities, restructurings, and spin-offs; and relationship lending, and acquisition financing, as well as secured lending, through structured credit and asset-backed lending and involved in financing under securities to resale agreements. This segment also offers client execution activities for cash and derivative instruments; credit and interest rate products; and provision of mortgages, currencies, commodities, and equities related products, as well as underwriting services. The Asset & Wealth Management segment manages assets across various classes, including equity, fixed income, hedge funds, credit funds, private equity, real estate, currencies, and commodities; and provides customized investment advisory solutions, wealth advisory services, personalized financial planning, and private banking services, as well as invests in corporate equity, credit, real estate, and infrastructure assets. The Platform Solutions segment offers credit cards and point-of-sale financing for purchase of goods or services. This segment also provides cash management services, such as deposit-taking and payment solutions for corporate and institutional clients. The Goldman Sachs Group, Inc. was founded in 1869 and is headquartered in New York, New York.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"PPG Industries, Inc.","Symbol":"PPG","Current Price":"121.43","Latest MA":"126.31","Price Target":"147.18","Difference from MA":"-3.87%","Difference from Open":"1.82%","Change from Yesterday":"1.60%","Change from Last Report":"0.08","Latest Volume":"721,658","Market Cap":"28,171,759,616","Earning Date":"2025-01-16","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":13.838129,"ROE":0.19149,"DTE":91.282,"Industry":"Specialty Chemicals","Sector":"Basic Materials","Beta":1.254,"Trailing PEG":1.0356,"Trailing PE":19.244057,"Trailing PS":1.5624936,"Quick Ratio":0.998,"Day High":121.44,"Day Low":118.58,"VS Average Volume":0.4267448654,"Company Summary":"PPG Industries, Inc. manufactures and distributes paints, coatings, and specialty materials in the United States, Canada, the Asia Pacific, Latin America, Europe, the Middle East, and Africa. It operates through two segments, Performance Coatings and Industrial Coatings. The Performance Coatings segment offers coatings, solvents, adhesives, sealants, sundries, and software for automotive and commercial transport\/fleet repair and refurbishing, light industrial coatings, and specialty coatings for signs; wood stains; paints, thermoplastics, pavement marking products, and other advanced technologies for pavement marking for government, commercial infrastructure, painting, and maintenance contractors; and coatings, sealants, transparencies, transparent armor, adhesives, engineered materials, and packaging and chemical management services for commercial, military, regional jet, and general aviation aircraft. The Industrial Coatings segment offers coatings, adhesives and sealants, and metal pretreatments, as well as services and coatings applications for appliances, agricultural and construction equipment, consumer electronics, automotive parts and accessories, building products, kitchenware, and transportation vehicles and other finished products; and on-site coatings services. It also provides coatings for metal cans, closures, plastic and aluminum tubes for food, beverage and personal care, promotional, and specialty packaging; amorphous precipitated silica for tire, battery separator, and other end-uses; TESLIN substrates for labels, e-passports, drivers' licenses, breathable membranes, and loyalty and identification cards; and organic light emitting diode materials, displays and lighting lens materials, optical lenses, color-change products, and photochromic dyes. PPG Industries, Inc. was incorporated in 1883 and is headquartered in Pittsburgh, Pennsylvania.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"First Horizon Corporation","Symbol":"FHN","Current Price":"19.88","Latest MA":"16.62","Price Target":"21.80","Difference from MA":"19.65%","Difference from Open":"3.70%","Change from Yesterday":"3.22%","Change from Last Report":"0.28","Latest Volume":"2,350,455","Market Cap":"10,544,444,416","Earning Date":"2025-01-16","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":12.391442,"ROE":0.08979,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.882,"Trailing PEG":null,"Trailing PE":14.518248,"Trailing PS":3.433554,"Quick Ratio":"N\/A","Day High":19.875,"Day Low":19.1027,"VS Average Volume":0.3621473368,"Company Summary":"First Horizon Corporation operates as the bank holding company for First Horizon Bank that provides various financial services. The company operates through Regional Banking and Specialty Banking segments. It offers general banking services for consumers, businesses, financial institutions, and governments. The company also accepts deposits; provides underwriting services for bank-eligible securities and other fixed-income securities by financial subsidiaries; sells loans and derivatives; financial planning; and offers investment and financial advisory services. In addition, it offers mortgage banking; loan syndications; brokerage services; commercial and business banking for business enterprises, consumer banking, and private client and wealth management services; capital markets, professional commercial real estate, mortgage warehouse and asset-based lending, franchise and equipment finance, tax credit finance, energy and healthcare finance, asset management, and corporate and correspondent banking services. Further, the company provides transaction processing services including check clearing services and remittance processing, credit cards, investment, and sale of mutual fund and retail insurances, as well as trust, fiduciary, and agency services. First Horizon Corporation was founded in 1864 and is headquartered in Memphis, Tennessee.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Bank of America Corporation","Symbol":"BAC","Current Price":"44.34","Latest MA":"41.12","Price Target":"50.10","Difference from MA":"7.83%","Difference from Open":"2.63%","Change from Yesterday":"2.20%","Change from Last Report":"0.12","Latest Volume":"14,459,893","Market Cap":"340,177,125,376","Earning Date":"2025-01-16","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":12.03846,"ROE":0.08092,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.325,"Trailing PEG":1.922,"Trailing PE":16.063406,"Trailing PS":3.5949647,"Quick Ratio":"N\/A","Day High":44.34,"Day Low":43.1024,"VS Average Volume":0.4219482716,"Company Summary":"Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. It operates in four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, non-interest and interest-bearing checking accounts, and investment accounts and products; credit and debit cards; residential mortgages, and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research, and certain market-based services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Morgan Stanley","Symbol":"MS","Current Price":"124.19","Latest MA":"107.75","Price Target":"128.08","Difference from MA":"15.26%","Difference from Open":"2.47%","Change from Yesterday":"3.05%","Change from Last Report":"0.14","Latest Volume":"2,913,673","Market Cap":"200,050,900,992","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":15.468701,"ROE":0.11079001,"DTE":405.772,"Industry":"Capital Markets","Sector":"Financial Services","Beta":1.336,"Trailing PEG":3.4887,"Trailing PE":18.871582,"Trailing PS":3.4324646,"Quick Ratio":1.83,"Day High":124.22,"Day Low":120.529,"VS Average Volume":0.457057356,"Company Summary":"Morgan Stanley, a financial holding company, provides various financial products and services to corporations, governments, financial institutions, and individuals in the Americas, Europe, the Middle East, Africa, and Asia. It operates through Institutional Securities, Wealth Management, and Investment Management segments. The Institutional Securities segment offers capital raising and financial advisory services, including services related to the underwriting of debt, equity, and other securities, as well as advice on mergers and acquisitions, restructurings, real estate, and project finance. This segment also provides equity and fixed income products comprising sales, financing, prime brokerage, and market-making services; foreign exchange and commodities; corporate and commercial real estate loans, commercial mortgage and secured lending facilities, and financing for sales and trading customers, and asset-backed and mortgage lending; and wealth management services, investment, and research services. The Wealth Management segment offers financial advisor-led brokerage, custody, administrative, and investment advisory services; self-directed brokerage services; financial and wealth planning services; workplace services, including stock plan administration; annuity and insurance products; securities-based lending, residential real estate loans, and other lending products; banking; and retirement plan services to individual investors and small to medium-sized businesses and institutions. The Investment Management segment provides equity, fixed income, alternatives and solutions, and liquidity and overlay services to benefit\/defined contribution plans, foundations, endowments, government entities, sovereign wealth funds, insurance companies, third-party fund sponsors, corporations, and individuals through institutional and intermediary channels. The company was founded in 1924 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"U.S. Bancorp","Symbol":"USB","Current Price":"48.47","Latest MA":"44.79","Price Target":"57.28","Difference from MA":"8.19%","Difference from Open":"2.51%","Change from Yesterday":"2.23%","Change from Last Report":"0.15","Latest Volume":"2,645,402","Market Cap":"75,606,851,584","Earning Date":"2025-01-16","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":11.145402,"ROE":0.09779,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.04,"Trailing PEG":1.1592,"Trailing PE":14.912308,"Trailing PS":3.0367856,"Quick Ratio":"N\/A","Day High":48.47,"Day Low":47.22,"VS Average Volume":0.3424473041,"Company Summary":"U.S. Bancorp, a financial services holding company, provides various financial services to individuals, businesses, institutional organizations, governmental entities, and other financial institutions in the United States. It operates through Wealth, Corporate, Commercial and Institutional Banking; Consumer and Business Banking; Payment Services; and Treasury and Corporate Support segments. The company offers depository services, including checking accounts, savings accounts, and time certificate contracts; and lending services, such as traditional credit products and credit card services, lease financing and import\/export trade, asset-backed lending, agricultural finance, and other products. It also provides ancillary services comprising capital markets, treasury management, and receivable lock-box collection services to corporate and governmental entity customers. In addition, the company offers asset management and fiduciary services for individuals, estates, foundations, business corporations, and charitable organizations. Further, it provides investment and insurance products to its customers principally within its domestic markets, as well as fund administration services to mutual and other funds. Additionally, the company provides corporate and purchasing card, and corporate trust services. Furthermore, it offers trust and investment management, merchant and ATM processing, mortgage banking, insurance, and brokerage and leasing services. U.S. Bancorp was founded in 1863 and is headquartered in Minneapolis, Minnesota.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Devon Energy Corporation","Symbol":"DVN","Current Price":"31.05","Latest MA":"41.84","Price Target":"50.04","Difference from MA":"-25.80%","Difference from Open":"1.97%","Change from Yesterday":"1.79%","Change from Last Report":"0.16","Latest Volume":"5,118,312","Market Cap":"20,406,597,632","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":6.6462708,"ROE":0.26279,"DTE":64.021,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":2.071,"Trailing PEG":14.898,"Trailing PE":5.7527776,"Trailing PS":1.4045424,"Quick Ratio":0.834,"Day High":31.075,"Day Low":30.3898,"VS Average Volume":0.5540197484,"Company Summary":"Devon Energy Corporation, an independent energy company, engages in the exploration, development, and production of oil, natural gas, and natural gas liquids in the United States. It operates in Delaware, Eagle Ford, Anadarko, Williston, and Powder River Basins. The company was founded in 1971 and is headquartered in Oklahoma City, Oklahoma.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Citigroup, Inc.","Symbol":"C","Current Price":"70.00","Latest MA":"63.20","Price Target":"82.14","Difference from MA":"10.77%","Difference from Open":"2.51%","Change from Yesterday":"2.32%","Change from Last Report":"0.14","Latest Volume":"5,236,410","Market Cap":"132,407,115,776","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":9.619401,"ROE":0.03874,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.426,"Trailing PEG":0.7548,"Trailing PE":19.94587,"Trailing PS":1.9104161,"Quick Ratio":"N\/A","Day High":70.01,"Day Low":68.05,"VS Average Volume":0.3885658967,"Company Summary":"Citigroup Inc., a diversified financial service holding company, provides various financial product and services to consumers, corporations, governments, and institutions worldwide. It operates through five segments: Services, Markets, Banking, U.S. Personal Banking, and Wealth. The Services segment includes Treasury and Trade Solutions, which provides cash management, trade, and working capital solutions to multinational corporations, financial institutions, and public sector organizations; and Securities Services, such as cross-border support for clients, local market expertise, post-trade technologies, data solutions, and various securities services solutions. The Markets segment offers sales and trading services for equities, foreign exchange, rates, spread products, and commodities to corporate, institutional, and public sector clients; and market-making services, including asset classes, risk management solutions, financing, prime brokerage, research, securities clearing, and settlement. The banking segment includes investment banking; advisory services related to mergers and acquisitions, divestitures, restructurings, and corporate defense activities; and corporate lending, which includes corporate and commercial banking. The U.S. Personal Banking segment provides co-branded cards and retail banking services. The Wealth segment provides financial services to high-net-worth clients through banking, lending, mortgages, investment, custody, and trust product offerings; and to professional industries, including law firms, consulting groups, accounting, and asset management. The company was founded in 1812 and is headquartered in New York, New York.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"The Bank of New York Mellon Cor","Symbol":"BK","Current Price":"77.84","Latest MA":"68.54","Price Target":"85.61","Difference from MA":"13.57%","Difference from Open":"1.22%","Change from Yesterday":"1.88%","Change from Last Report":"0.17","Latest Volume":"1,898,205","Market Cap":"56,603,021,312","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":11.794186,"ROE":0.08563,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.06,"Trailing PEG":0.6896,"Trailing PE":17.416107,"Trailing PS":3.1797662,"Quick Ratio":"N\/A","Day High":77.85,"Day Low":76.09,"VS Average Volume":0.4912920258,"Company Summary":"The Bank of New York Mellon Corporation provides a range of financial products and services in the United States and internationally. The company operates through Securities Services, Market and Wealth Services, Investment and Wealth Management, and other segments. The Securities Services segment offers custody, trust and depositary, accounting, exchange-traded funds, middle-office solutions, transfer agency, services for private equity and real estate funds, foreign exchange, securities lending, liquidity\/lending services, and data analytics. This segment also provides trustee, paying agency, fiduciary, escrow and other financial, issuer, and support services for brokers and investors. The Market and Wealth Services segment offers clearing and custody, investment, wealth and retirement solutions, technology and enterprise data management, trading, and prime brokerage services. This segment also provides integrated cash management solutions, including payments, foreign exchange, liquidity management, receivables processing and payables management, and trade finance and processing services. The Investment and Wealth Management segment offers investment management strategies and distribution of investment products, investment management, custody, wealth and estate planning, private banking, investment, and information management services. The Other segment engages in the provision of leasing, corporate treasury, derivative and other trading, corporate and bank-owned life insurance, renewable energy investment, and business exit services. It serves central banks and sovereigns, financial institutions, asset managers, insurance companies, corporations, local authorities and high net-worth individuals, and family offices. The Bank of New York Mellon Corporation was founded in 1784 and is headquartered in New York, New York.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Prologis, Inc.","Symbol":"PLD","Current Price":"104.39","Latest MA":"116.67","Price Target":"130.81","Difference from MA":"-10.53%","Difference from Open":"3.54%","Change from Yesterday":"2.83%","Change from Last Report":"0.12","Latest Volume":"3,408,605","Market Cap":"96,572,260,352","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":38.916157,"ROE":0.05662,"DTE":57.079,"Industry":"REIT - Industrial","Sector":"Real Estate","Beta":1.094,"Trailing PEG":0.4606,"Trailing PE":31.50151,"Trailing PS":11.721058,"Quick Ratio":0.417,"Day High":104.81,"Day Low":100.82,"VS Average Volume":0.8965469081,"Company Summary":"Prologis, Inc. is the global leader in logistics real estate with a focus on high-barrier, high-growth markets. At September 30, 2024, the company owned or had investments in, on a wholly owned basis or through co-investment ventures, properties and development projects expected to total approximately 1.2 billion square feet (116 million square meters) in 20 countries. Prologis leases modern logistics facilities to a diverse base of approximately 6,700 customers principally across two major categories: business-to-business and retail\/online fulfilment.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Alcoa Corporation","Symbol":"AA","Current Price":"38.09","Latest MA":"38.30","Price Target":"49.98","Difference from MA":"-0.56%","Difference from Open":"4.63%","Change from Yesterday":"4.12%","Change from Last Report":"0.04","Latest Volume":"2,281,919","Market Cap":"9,851,076,608","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":9.845921,"ROE":-0.07142,"DTE":56.095,"Industry":"Aluminum","Sector":"Basic Materials","Beta":2.419,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.89522684,"Quick Ratio":0.671,"Day High":38.3,"Day Low":36.29,"VS Average Volume":0.4752071348,"Company Summary":"Alcoa Corporation, together with its subsidiaries, produces and sells bauxite, alumina, and aluminum products in the United States, Spain, Australia, Iceland, Norway, Brazil, Canada, and internationally. The company operates through two segments, Alumina and Aluminum. It engages in bauxite mining operations; and processes bauxite into alumina and sells it to customers who process it into industrial chemical products, as well as aluminum smelting and casting businesses. The company offers primary aluminum in the form of alloy ingot or value-add ingot to customers that produce products for the transportation, building and construction, packaging, wire, and other industrial markets; and flat-rolled aluminum in the form of sheet, which is sold primarily to customers that produce beverage and food cans. In addition, it owns hydro power plants that generates and sells electricity in the wholesale market to traders, large industrial consumers, distribution companies, and other generation companies. The company was formerly known as Alcoa Upstream Corporation and changed its name to Alcoa Corporation in October 2016. The company was founded in 1886 and is headquartered in Pittsburgh, Pennsylvania.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Kinder Morgan, Inc.","Symbol":"KMI","Current Price":"26.89","Latest MA":"22.41","Price Target":"26.87","Difference from MA":"20.02%","Difference from Open":"2.54%","Change from Yesterday":"2.46%","Change from Last Report":"0.04","Latest Volume":"5,620,624","Market Cap":"59,728,789,504","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":21.12405,"ROE":0.083500005,"DTE":101.433,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.907,"Trailing PEG":1.9214,"Trailing PE":23.792036,"Trailing PS":3.9422343,"Quick Ratio":0.291,"Day High":26.935,"Day Low":26.145,"VS Average Volume":0.4067589463,"Company Summary":"Kinder Morgan, Inc. operates as an energy infrastructure company primarily in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas gasification, liquefaction, and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and\/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, renewable fuel and feedstocks, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; owns interests in\/or operates oil fields and gasoline processing plants; and operates a crude oil pipeline system in West Texas, as well as owns and operates RNG and LNG facilities. It owns and operates approximately 82,000 miles of pipelines and 139 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1997 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Wells Fargo & Company","Symbol":"WFC","Current Price":"70.97","Latest MA":"60.96","Price Target":"76.14","Difference from MA":"16.42%","Difference from Open":"2.60%","Change from Yesterday":"3.10%","Change from Last Report":"0.14","Latest Volume":"6,743,236","Market Cap":"236,342,853,632","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":12.955328,"ROE":0.099139996,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.136,"Trailing PEG":3.2098,"Trailing PE":14.757734,"Trailing PS":3.0349002,"Quick Ratio":"N\/A","Day High":70.99,"Day Low":68.77,"VS Average Volume":0.3851407031,"Company Summary":"Wells Fargo & Company, a financial services company, provides diversified banking, investment, mortgage, and consumer and commercial finance products and services in the United States and internationally. The company operates through four segments: Consumer Banking and Lending; Commercial Banking; Corporate and Investment Banking; and Wealth and Investment Management. The Consumer Banking and Lending segment offers diversified financial products and services for consumers and small businesses. Its financial products and services include checking and savings accounts, and credit and debit cards, as well as home, auto, personal, and small business lending services. The Commercial Banking segment provides financial solutions to private, family owned, and certain public companies. Its products and services include banking and credit products across various industry sectors and municipalities, secured lending and lease products, and treasury management services. The Corporate and Investment Banking segment offers a suite of capital markets, banking, and financial products and services, such as corporate banking, investment banking, treasury management, commercial real estate lending and servicing, equity, and fixed income solutions, as well as sales, trading, and research capabilities services to corporate, commercial real estate, government, and institutional clients. The Wealth and Investment Management segment provides personalized wealth management, brokerage, financial planning, lending, private banking, and trust and fiduciary products and services to affluent, high-net worth, and ultra-high-net worth clients. It also operates through financial advisors in brokerage and wealth offices, consumer bank branches, independent offices, and digitally through WellsTrade and Intuitive Investor. The company was founded in 1852 and is headquartered in San Francisco, California.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"JP Morgan Chase & Co.","Symbol":"JPM","Current Price":"238.87","Latest MA":"215.55","Price Target":"250.33","Difference from MA":"10.82%","Difference from Open":"3.00%","Change from Yesterday":"2.57%","Change from Last Report":"0.13","Latest Volume":"5,574,621","Market Cap":"672,697,352,192","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":14.049277,"ROE":0.16216,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.091,"Trailing PEG":4.5817,"Trailing PE":13.28921,"Trailing PS":4.1486626,"Quick Ratio":"N\/A","Day High":238.99,"Day Low":231.588,"VS Average Volume":0.6626353116,"Company Summary":"JPMorgan Chase & Co. operates as a financial services company worldwide. It operates through three segments: Consumer & Community Banking, Commercial & Investment Bank, and Asset & Wealth Management. It offers deposit, investment and lending products, cash management, and payments and services; mortgage origination and servicing activities; residential mortgages and home equity loans; and credit cards, auto loans, leases, and travel services to consumers and small businesses through bank branches, ATMs, and digital and telephone banking. The company also provides investment banking products and services, including corporate strategy and structure advisory, and equity and debt market capital-raising services, as well as loan origination and syndication; payments; and cash and derivative instruments, risk management solutions, prime brokerage, and research, as well as offers securities services, including custody, fund accounting and administration, and securities lending products for asset managers, insurance companies, and public and private investment funds. In addition, it provides financial solutions, including lending, payments, investment banking, and asset management to small and midsized companies, local governments, nonprofit clients, and large corporations, as well as investors, developers, and owners of multifamily, office, retail, industrial, and affordable housing properties. Further, the company offers multi-asset investment management solutions in equities, fixed income, alternatives, and money market funds to institutional clients and retail investors; and retirement products and services, brokerage, custody, estate planning, lending, deposits, and investment management products to high net worth clients. JPMorgan Chase & Co. was founded in 1799 and is headquartered in New York, New York.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Discover Financial Services","Symbol":"DFS","Current Price":"175.31","Latest MA":"142.85","Price Target":"176.08","Difference from MA":"22.73%","Difference from Open":"3.95%","Change from Yesterday":"3.62%","Change from Last Report":"0.16","Latest Volume":"665,201","Market Cap":"44,038,029,312","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":13.743108,"ROE":0.20263,"DTE":105.313,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.402,"Trailing PEG":4.2971,"Trailing PE":14.122383,"Trailing PS":3.7684436,"Quick Ratio":1.174,"Day High":175.472,"Day Low":168.655,"VS Average Volume":0.4259251789,"Company Summary":"Discover Financial Services, through its subsidiaries, provides digital banking products and services, and payment services in the United States. It operates in two segments, Digital Banking and Payment Services. The Digital Banking segment offers Discover-branded credit cards to individuals; personal loans, home loans, and other consumer lending; and direct-to-consumer deposit products comprising savings accounts, certificates of deposit, money market accounts, IRA certificates of deposit, IRA savings accounts and checking accounts, and sweep accounts. The Payment Services segment operates the PULSE to access automated teller machines, debit, and electronic funds transfer network; and Diners Club International, a payments network that issues Diners Club branded charge cards and\/or provides card acceptance services, as well as offers payment transaction processing and settlement services. The company was incorporated in 1960 and is based in Riverwoods, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Charles Schwab Corporation (The","Symbol":"SCHW","Current Price":"74.90","Latest MA":"70.41","Price Target":"83.53","Difference from MA":"6.37%","Difference from Open":"1.88%","Change from Yesterday":"1.68%","Change from Last Report":"0.04","Latest Volume":"2,765,836","Market Cap":"137,026,576,384","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":19.20467,"ROE":0.12111,"DTE":144.242,"Industry":"Capital Markets","Sector":"Financial Services","Beta":0.952,"Trailing PEG":1.1849,"Trailing PE":29.240236,"Trailing PS":7.3135443,"Quick Ratio":0.481,"Day High":74.99,"Day Low":73.3201,"VS Average Volume":0.3481136871,"Company Summary":"The Charles Schwab Corporation, together with its subsidiaries, operates as a savings and loan holding company that provides wealth management, securities brokerage, banking, asset management, custody, and financial advisory services in the United States and internationally. The company operates in two segments, Investor Services and Advisor Services. It offers brokerage accounts with equity and fixed income trading, margin lending, options trading, futures and forex trading, and cash management capabilities, including certificates of deposit; third-party mutual funds through the Mutual Fund Marketplace and Mutual Fund OneSource service, as well as mutual fund trading and clearing services to broker-dealers; exchange-traded funds; advisory solutions for managed portfolios, separately managed accounts, customized personal advice for tailored portfolios, specialized planning, and full-time portfolio management; banking products comprising checking and savings accounts, first lien residential real estate mortgage loans, home equity lines of credit, and pledged asset lines; and trust custody services, personal trust reporting services, and administrative trustee services. It also provides digital retirement calculators; integrated web-, mobile-, and software-based trading platforms, real-time market data, options trading, premium research, and multi-channel access; self-service education and support tools; online research and analysis tools; equity compensation plan sponsors full-service recordkeeping for stock plans, stock options, restricted stock, performance shares, and stock appreciation rights; retirement plan services; mutual fund clearing services; and advisor services, including interactive tools and educational content. The Company operates through branch offices. The Charles Schwab Corporation was founded in 1971 and is headquartered in Westlake, Texas.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"UnitedHealth Group Incorporated","Symbol":"UNH","Current Price":"500.37","Latest MA":"552.96","Price Target":"639.52","Difference from MA":"-9.51%","Difference from Open":"2.26%","Change from Yesterday":"2.36%","Change from Last Report":"0.14","Latest Volume":"3,074,436","Market Cap":"460,859,834,368","Earning Date":"2025-01-10","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":16.75241,"ROE":0.15252,"DTE":74.683,"Industry":"Healthcare Plans","Sector":"Healthcare","Beta":0.591,"Trailing PEG":1.3529,"Trailing PE":32.602867,"Trailing PS":1.1699979,"Quick Ratio":0.833,"Day High":501.08,"Day Low":488.73,"VS Average Volume":0.7213661874,"Company Summary":"UnitedHealth Group Incorporated operates as a diversified health care company in the United States. The company operates through four segments: UnitedHealthcare, Optum Health, Optum Insight, and Optum Rx. The UnitedHealthcare segment offers consumer-oriented health benefit plans and services for national employers, public sector employers, mid-sized employers, small businesses, and individuals; health care coverage, and health and well-being services to individuals age 50 and older addressing their needs; Medicaid plans, children's health insurance and health care programs; and health and dental benefits, and hospital and clinical services, as well as health care benefits products and services to state programs caring for the economically disadvantaged, medically underserved, and those without the benefit of employer-funded health care coverage. The Optum Health segment provides care delivery, care management, wellness and consumer engagement, and health financial services patients, consumers, care delivery systems, providers, employers, payers, and public-sector entities. The Optum Insight segment offers software and information products, advisory consulting arrangements, and managed services outsourcing contracts to hospital systems, physicians, health plans, governments, life sciences companies, and other organizations. The Optum Rx segment provides pharmacy care services and programs, including retail network contracting, home delivery, specialty and community health pharmacy services, infusion, and purchasing and clinical capabilities, as well as develops programs in the areas of step therapy, formulary management, drug adherence, and disease\/drug therapy management. UnitedHealth Group Incorporated was founded in 1974 and is based in Minnetonka, Minnesota.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Constellation Brands, Inc.","Symbol":"STZ","Current Price":"228.62","Latest MA":"244.31","Price Target":"289.00","Difference from MA":"-6.42%","Difference from Open":"0.03%","Change from Yesterday":"0.65%","Change from Last Report":"-0.08","Latest Volume":"621,465","Market Cap":"41,496,264,704","Earning Date":"2025-01-03","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":15.074495,"ROE":0.07111,"DTE":149.155,"Industry":"Beverages - Brewers","Sector":"Consumer Defensive","Beta":0.893,"Trailing PEG":1.1929,"Trailing PE":73.00958,"Trailing PS":4.071934,"Quick Ratio":0.321,"Day High":229.07,"Day Low":226.5,"VS Average Volume":0.4550820109,"Company Summary":"Constellation Brands, Inc., together with its subsidiaries, produces, imports, markets, and sells beer, wine, and spirits in the United States, Canada, Mexico, New Zealand, and Italy. The company provides beer primarily under the Corona Extra, Corona Familiar, Corona Hard Seltzer, Corona Light, Corona Non-Alcoholic, Corona Premier, Corona Refresca, Modelo Especial, Modelo Chelada, Modelo Negra, Modelo Oro, Victoria, Vicky Chamoy, and Pacifico brands. It also offers wine under the Cook's California Champagne, Kim Crawford, Meiomi, Mount Veeder, Ruffino, SIMI, My Favorite Neighbor, Robert Mondavi Winery, Schrader, and The Prisoner Wine Company brands; and spirits under the Casa Noble, Copper & Kings, High West, Mi CAMPO, Nelson's Green Brier, and SVEDKA brands. The company provides its products to wholesale distributors, retailers, on-premise locations, and state alcohol beverage control agencies. Constellation Brands, Inc. was founded in 1945 and is headquartered in Victor, New York.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Delta Air Lines, Inc.","Symbol":"DAL","Current Price":"61.42","Latest MA":"50.54","Price Target":"78.57","Difference from MA":"21.53%","Difference from Open":"2.66%","Change from Yesterday":"1.67%","Change from Last Report":"0.17","Latest Volume":"3,788,248","Market Cap":"39,626,706,944","Earning Date":"2025-01-10","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":8.288389,"ROE":0.4067,"DTE":186.78,"Industry":"Airlines","Sector":"Industrials","Beta":1.341,"Trailing PEG":null,"Trailing PE":8.517337,"Trailing PS":0.65708303,"Quick Ratio":0.268,"Day High":61.45,"Day Low":59.83,"VS Average Volume":0.4538749795,"Company Summary":"Delta Air Lines, Inc. provides scheduled air transportation for passengers and cargo in the United States and internationally. The company operates through two segments, Airline and Refinery. Its domestic network centered on core hubs in Atlanta, Minneapolis-St. Paul, Detroit, and Salt Lake City, as well as coastal hub positions in Boston, Los Angeles, New York-LaGuardia, New York-JFK, and Seattle; and international network centered on hubs and market presence in Amsterdam, Bogota, Lima, Mexico City, London-Heathrow, Paris-Charles de Gaulle, Sao Paulo, Seoul-Incheon, and Tokyo. The company sells its tickets through various distribution channels, including delta.com and the Fly Delta app; acts as a reservations specialists; and operates online travel and traditional brick and mortar agencies. It also provides aircraft maintenance and engineering support, repair, and overhaul services; and vacation packages to third-party consumers. The company operates through a fleet of approximately 1,273 aircrafts. Delta Air Lines, Inc. was founded in 1924 and is based in Atlanta, Georgia.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"20-12-2024 18:45:04"},{"Company Name":"Walgreens Boots Alliance, Inc.","Symbol":"WBA","Current Price":"9.49","Latest MA":"10.49","Price Target":"9.94","Difference from MA":"-9.51%","Difference from Open":"1.50%","Change from Yesterday":"1.55%","Change from Last Report":"0.37","Latest Volume":"4,902,470","Market Cap":"8,198,818,304","Earning Date":"2025-01-02","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":5.921311,"ROE":-0.75969005,"DTE":277.898,"Industry":"Pharmaceutical Retailers","Sector":"Healthcare","Beta":0.669,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.05552573,"Quick Ratio":0.332,"Day High":9.51,"Day Low":9.28,"VS Average Volume":0.2059840227,"Company Summary":"Walgreens Boots Alliance, Inc. operates as a healthcare, pharmacy, and retail company in the United States, Germany, the United Kingdom, and internationally. It operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The U.S. Retail Pharmacy segment engages in operation of the retail drugstores, health and wellness services, specialty, and home delivery pharmacy services, which offers health and wellness, beauty, personal care and consumables, and general merchandise. The International segment offers sale of prescription drugs and health and wellness, beauty, personal care, and other consumer products outside the United States; and operates pharmacy-led health and beauty retail businesses under the Boots brand stores in the United Kingdom, the Republic of Ireland, and Thailand, as well as the Benavides brand in Mexico and the Ahumada brand in Chile. The U.S. Healthcare segment provides VillageMD, a national provider of value-based care with primary, multi-specialty, and urgent care providers serving patients in traditional clinic settings, in patients' homes and online appointments; Shields, a specialty pharmacy integrator and accelerator for hospitals; and CareCentrix, a participant in the post-acute and home care management sectors. Walgreens Boots Alliance, Inc. was founded in 1909 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"20-12-2024 18:45:04"}]