[{"Company Name":"Nike, Inc.","Symbol":"NKE","Current Price":"74.68","Latest MA":"80.34","Price Target":86.47971,"Difference from MA":"-7.04%","Difference from Open":"-1.22%","Change from Yesterday":"-2.20%","Change from Last Report":"-2.28","Latest Volume":"2,445,839","Market Cap":"111,161,180,160","Earning Date":"2024-12-19","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":28.40451,"ROE":0.3798,"DTE":86.962,"Industry":"Footwear & Accessories","Sector":"Consumer Cyclical","Beta":1.035,"Trailing PEG":3.9808,"Trailing PE":23.049383,"Trailing PS":2.22269,"Quick Ratio":1.417,"Day High":75.77,"Day Low":74.55,"VS Average Volume":0.206644506,"Company Summary":"NIKE, Inc., together with its subsidiaries, engages in the design, development, marketing, and sale of athletic footwear, apparel, equipment, accessories, and services worldwide. The company provides athletic and casual footwear, apparel, and accessories under the NIKE, Jumpman, Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks. It also sells a line of performance equipment and accessories comprising bags, sport balls, socks, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities under the NIKE brand; and various plastic products to other manufacturers. In addition, the company markets apparel with licensed college and professional team, and league logos, as well as sells sports apparel; licenses unaffiliated parties to manufacture and sell apparel, digital devices, and applications and other equipment for sports activities under NIKE-owned trademarks; and operates digital platforms, including fitness and activity apps; sport, fitness, and wellness content; and digital services and features in retail stores. It sells its products to footwear stores; sporting goods stores; athletic specialty stores; department stores; skate, tennis, and golf shops; and other retail accounts through NIKE-owned retail stores, digital platforms, independent distributors, licensees, and sales representatives. The company was founded in 1964 and is headquartered in Beaverton, Oregon.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Micron Technology, Inc.","Symbol":"MU","Current Price":"85.82","Latest MA":"108.24","Price Target":131.7403,"Difference from MA":"-20.72%","Difference from Open":"-1.27%","Change from Yesterday":"-3.17%","Change from Last Report":"-0.00","Latest Volume":"8,895,004","Market Cap":"95,613,616,128","Earning Date":"2024-12-18","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":6.686208,"ROE":0.01743,"DTE":31.194,"Industry":"Semiconductors","Sector":"Technology","Beta":1.179,"Trailing PEG":0.2252,"Trailing PE":24.589111,"Trailing PS":3.807639,"Quick Ratio":1.592,"Day High":87.05,"Day Low":84.58,"VS Average Volume":0.4241105626,"Company Summary":"Micron Technology, Inc. designs, develops, manufactures, and sells memory and storage products in the United States, Taiwan, Mainland China, rest of the Asia Pacific, Hong Kong, Japan, Europe, and internationally. The company operates through four segments: Compute and Networking Business Unit, Mobile Business Unit, Embedded Business Unit, and Storage Business Unit. It provides memory and storage technologies comprising dynamic random access memory semiconductor devices with low latency that provide high-speed data retrieval; non-volatile and re-writeable semiconductor storage devices; and non-volatile re-writable semiconductor memory devices that provide fast read speeds under the Micron and Crucial brands, as well as through private labels. The company offers serves the data center, PC, graphics, networking, automotive, industrial, and consumer embedded markets, as well as for smartphone and other mobile-device markets. It markets its products through its direct sales force, independent sales representatives, distributors, and retailers; and web-based customer direct sales channel, as well as through channel and distribution partners. Micron Technology, Inc. was founded in 1978 and is headquartered in Boise, Idaho.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"QUALCOMM Incorporated","Symbol":"QCOM","Current Price":"154.54","Latest MA":"174.93","Price Target":204.70387,"Difference from MA":"-11.66%","Difference from Open":"-0.44%","Change from Yesterday":"-1.62%","Change from Last Report":"-1.72","Latest Volume":"1,004,022","Market Cap":"171,693,948,928","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":12.588001,"ROE":0.42253,"DTE":58.765,"Industry":"Semiconductors","Sector":"Technology","Beta":1.286,"Trailing PEG":1.553,"Trailing PE":17.267038,"Trailing PS":4.4067025,"Quick Ratio":1.64,"Day High":155.61,"Day Low":153.815,"VS Average Volume":0.1240605462,"Company Summary":"QUALCOMM Incorporated engages in the development and commercialization of foundational technologies for the wireless industry worldwide. It operates through three segments: Qualcomm CDMA Technologies (QCT); Qualcomm Technology Licensing (QTL); and Qualcomm Strategic Initiatives (QSI). The QCT segment develops and supplies integrated circuits and system software with advanced connectivity and high-performance, and low-power computing technologies for use in mobile devices; automotive systems for connectivity, digital cockpit, and ADAS\/AD; and IoT, including consumer electronic devices, industrial devices, and edge networking products. The QTL segment grants licenses or provides rights to use portions of its intellectual property portfolio, which include various patent rights useful in the manufacture and sale of wireless products comprising products implementing CDMA2000, WCDMA, LTE and\/or OFDMA-based 5G products. The QSI segment invests in early-stage companies in various industries, including 5G, artificial intelligence, automotive, consumer, enterprise, cloud, IoT, and extended reality, and investments, including non-marketable equity securities and, to a lesser extent, marketable equity securities, and convertible debt instruments. It also provides development, and other services and sells related products to the United States government agencies and their contractors. The company was incorporated in 1985 and is headquartered in San Diego, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Flagstar Financial, Inc.","Symbol":"FLG","Current Price":"8.93","Latest MA":"10.57","Price Target":12.18333,"Difference from MA":"-15.53%","Difference from Open":"-0.83%","Change from Yesterday":"-1.16%","Change from Last Report":"-1.16","Latest Volume":"1,911,818","Market Cap":"3,704,901,632","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":-23.47202,"ROE":-0.37158,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.0,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":2.596287,"Quick Ratio":"N\/A","Day High":9.0,"Day Low":8.82,"VS Average Volume":0.3134520969,"Company Summary":"Flagstar Financial, Inc. operates as the bank holding company for Flagstar Bank, N.A. that provides banking products and services in the United States. The company's deposit products include interest-bearing checking and money market, savings, non-interest-bearing, and retirement accounts, as well as certificates of deposit. Its loan products comprise multi-family loans; commercial real estate loans; acquisition, development, and construction loans; commercial and industrial loans; one-to-four family loans; specialty finance loans and leases; warehouse loans; and other loans, such as home equity lines of credit, boat and recreational vehicle indirect lending, point of sale consumer loans, and other consumer loans, including overdraft loans. The company offers cash management products; non-deposit investment and insurance products; and online banking, mobile banking, and bank-by-phone services. It primarily serves individuals, small and mid-size businesses, and professional associations. The company was formerly known as New York Community Bancorp, Inc. and changed its name to Flagstar Financial, Inc. in October 2024. Flagstar Financial, Inc. was founded in 1859 and is headquartered in Hicksville, New York.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Boeing Company (The)","Symbol":"BA","Current Price":"175.13","Latest MA":"166.67","Price Target":182.83833,"Difference from MA":"5.08%","Difference from Open":"0.81%","Change from Yesterday":"-3.00%","Change from Last Report":"1.94","Latest Volume":"8,858,833","Market Cap":"131,031,801,856","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":250.66554,"ROE":"N\/A","DTE":"N\/A","Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.572,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":1.7877806,"Quick Ratio":0.238,"Day High":175.36,"Day Low":170.17,"VS Average Volume":0.6704661474,"Company Summary":"The Boeing Company, together with its subsidiaries, designs, develops, manufactures, sells, services, and supports commercial jetliners, military aircraft, satellites, missile defense, human space flight and launch systems, and services worldwide. The company operates through Commercial Airplanes; Defense, Space & Security; and Global Services segments. The Commercial Airplanes segment develops, produces, and markets commercial jet aircraft for passenger and cargo requirements, as well as provides fleet support services. The Defense, Space & Security segment engages in the research, development, production, and modification of manned and unmanned military aircraft and weapons systems; strategic defense and intelligence systems, which include strategic missile and defense systems, command, control, communications, computers, intelligence, surveillance and reconnaissance, cyber and information solutions, and intelligence systems; and satellite systems, such as government and commercial satellites, and space exploration. The Global Services segment offers products and services, including supply chain and logistics management, engineering, maintenance and modifications, upgrades and conversions, spare parts, pilot and maintenance training systems and services, technical and maintenance documents, and data analytics and digital services to commercial and defense customers. The Boeing Company was incorporated in 1916 and is based in Arlington, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"SiriusXM Holdings Inc.","Symbol":"SIRI","Current Price":"22.78","Latest MA":"27.87","Price Target":25.53846,"Difference from MA":"-18.26%","Difference from Open":"-0.91%","Change from Yesterday":"-1.53%","Change from Last Report":"-1.51","Latest Volume":"1,275,908","Market Cap":"7,727,598,080","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.1809025,"ROE":-0.46799,"DTE":98.775,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.05,"Trailing PEG":0.1961,"Trailing PE":"N\/A","Trailing PS":0.878236,"Quick Ratio":0.26,"Day High":23.0,"Day Low":22.445,"VS Average Volume":0.2067347234,"Company Summary":"Sirius XM Holdings Inc. operates as an audio entertainment company in North America. It operates in two segments, Sirius XM, and Pandora and Off-platform. The company's Sirius XM segment provides music, sports, entertainment, comedy, talk, news, traffic and weather channels, and other content, as well as podcast and infotainment services on subscription fee basis; and live, curated, and exclusive and on demand programming services through satellite radio systems and streamed through applications for mobile and home devices, and other consumer electronic equipment. This segment also distributes satellite radios through automakers and retailers, as well as its website; podcasts, including true crime, news, politics, music, comedy, sports, and entertainment; and offers location-based services through two-way wireless connectivity, including safety, security, convenience, maintenance and data, remote vehicles diagnostic, and stolen or parked vehicle locator services. In addition, this segment provides music channels on the DISH Network satellite television service as a programming package; Travel Link, a suite of data services that include graphical weather, fuel prices, sports schedule and scores, and movie listings; graphic information related to road closings, traffic flow, and incident data for consumers with in-vehicle navigation systems; real-time weather services in vehicles, boats, and planes; and music programming and commercial-free music services for office, restaurants, and other business. Its Pandora and Off-platform segment operates music, comedy, and podcast streaming platform, which offers personalized experience for listener through computers, tablets, mobile devices, vehicle speakers, and connected devices; and provides advertising services. The company was incorporated in 2013 and is headquartered in New York.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Alphabet Inc.","Symbol":"GOOGL","Current Price":"190.93","Latest MA":"171.83","Price Target":211.11646,"Difference from MA":"11.11%","Difference from Open":"0.74%","Change from Yesterday":"-0.93%","Change from Last Report":"0.46","Latest Volume":"4,550,903","Market Cap":"2,344,119,959,552","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":21.297565,"ROE":0.32101002,"DTE":9.324,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.034,"Trailing PEG":1.2497,"Trailing PE":25.321619,"Trailing PS":6.8973308,"Quick Ratio":1.761,"Day High":191.6286,"Day Low":189.1276,"VS Average Volume":0.164699549,"Company Summary":"Alphabet Inc. offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube. It is also involved in the sale of apps and in-app purchases and digital content in the Google Play and YouTube; and devices, as well as in the provision of YouTube consumer subscription services. The Google Cloud segment offers infrastructure, cybersecurity, databases, analytics, AI, and other services; Google Workspace that include cloud-based communication and collaboration tools for enterprises, such as Gmail, Docs, Drive, Calendar, and Meet; and other services for enterprise customers. The Other Bets segment sells healthcare-related and internet services. The company was incorporated in 1998 and is headquartered in Mountain View, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Pfizer, Inc.","Symbol":"PFE","Current Price":"26.32","Latest MA":"27.71","Price Target":31.86304,"Difference from MA":"-5.04%","Difference from Open":"-0.62%","Change from Yesterday":"-1.07%","Change from Last Report":"-0.42","Latest Volume":"7,260,726","Market Cap":"149,127,987,200","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":8.970337,"ROE":0.04538,"DTE":73.408,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.615,"Trailing PEG":0.1981,"Trailing PE":35.086933,"Trailing PS":2.511629,"Quick Ratio":0.64,"Day High":26.57,"Day Low":26.24,"VS Average Volume":0.1694306695,"Company Summary":"Pfizer Inc. discovers, develops, manufactures, markets, distributes, and sells biopharmaceutical products in the United States, Europe, and internationally. The company offers medicines and vaccines in various therapeutic areas, including cardiovascular metabolic, migraine, and women's health under the Eliquis, Nurtec ODT\/Vydura, Zavzpret, and the Premarin family brands; infectious diseases with unmet medical needs under the Prevnar family, Abrysvo, Nimenrix, FSME\/IMMUN-TicoVac, and Trumenba brands; and COVID-19 prevention and treatment, and potential future mRNA and antiviral products under the Comirnaty and Paxlovid brands. It also provides medicines and vaccines in various therapeutic areas, such as biosimilars for chronic immune and inflammatory diseases under the Xeljanz, Enbrel, Inflectra, Litfulo, Velsipity, and Cibinqo brands; amyloidosis, hemophilia, endocrine diseases, and sickle cell disease under the Vyndaqel family, Oxbryta, BeneFIX, Somavert, Ngenla, and Genotropin brands; sterile injectable and anti-infective medicines under the Sulperazon, Medrol, Zavicefta, Zithromax, and Panzyga brands; and biologics, small molecules, immunotherapies, and biosimilars under the Ibrance, Xtandi, Inlyta, Bosulif, Mektovi, Padcev, Adcetris, Talzenna, Tukysa, Elrexfio, Tivdak, Lorbrena, and Braftovi brands. In addition, the company involved in the contract manufacturing business. It serves wholesalers, retailers, hospitals, clinics, government agencies, pharmacies, individual provider offices, retail pharmacies, and integrated delivery systems. The company has collaboration agreements with Bristol-Myers Squibb Company; Astellas Pharma US, Inc.; Merck KGaA; and BioNTech SE, as well as has strategic clinical collaboration with Acepodia Inc. for the development of antibody-cell conjugation-based cell therapies in autoimmune diseases. Pfizer Inc. was founded in 1849 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"General Motors Company","Symbol":"GM","Current Price":"53.46","Latest MA":"48.70","Price Target":59.39923,"Difference from MA":"9.78%","Difference from Open":"-0.52%","Change from Yesterday":"-1.53%","Change from Last Report":"-1.51","Latest Volume":"1,457,993","Market Cap":"58,785,714,176","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":5.0632753,"ROE":0.14167,"DTE":174.581,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":1.414,"Trailing PEG":8.4509,"Trailing PE":5.7055497,"Trailing PS":0.32172742,"Quick Ratio":0.948,"Day High":53.78,"Day Low":52.93,"VS Average Volume":0.1189854232,"Company Summary":"General Motors Company designs, builds, and sells trucks, crossovers, cars, and automobile parts; and provide software-enabled services and subscriptions worldwide. The company operates through GM North America, GM International, Cruise, and GM Financial segments. It markets its vehicles primarily under the Buick, Cadillac, Chevrolet, GMC, Baojun, and Wuling brand names. In addition, the company sells trucks, crossovers, cars, and automobile parts through retail dealers, and distributors and dealers, as well as to fleet customers, including daily rental car companies, commercial fleet customers, leasing companies, and governments. Further, it offers range of after-sale services through dealer network, such as maintenance, light repairs, collision repairs, vehicle accessories, and extended service warranties. Additionally, the company provides automotive financing; and software-enabled services and subscriptions. General Motors Company was founded in 1908 and is headquartered in Detroit, Michigan.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Advanced Micro Devices, Inc.","Symbol":"AMD","Current Price":"123.17","Latest MA":"150.28","Price Target":183.16273,"Difference from MA":"-18.04%","Difference from Open":"-0.31%","Change from Yesterday":"-1.53%","Change from Last Report":"0.40","Latest Volume":"10,248,186","Market Cap":"199,889,125,376","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":23.991581,"ROE":0.03262,"DTE":3.927,"Industry":"Semiconductors","Sector":"Technology","Beta":1.706,"Trailing PEG":0.3238,"Trailing PE":109.00416,"Trailing PS":8.227583,"Quick Ratio":1.575,"Day High":124.075,"Day Low":122.35,"VS Average Volume":0.280402027,"Company Summary":"Advanced Micro Devices, Inc. operates as a semiconductor company worldwide. It operates through Data Center, Client, Gaming, and Embedded segments. The company offers x86 microprocessors and graphics processing units (GPUs) as an accelerated processing unit, chipsets, data center, and professional GPUs; and embedded processors, and semi-custom system-on-chip (SoC) products, microprocessor and SoC development services and technology, data processing unites, field programmable gate arrays (FPGA), and adaptive SoC products. It provides processors under the AMD Ryzen, AMD Ryzen PRO, Ryzen Threadripper, Ryzen Threadripper PRO, AMD Athlon, AMD Athlon PRO, and AMD PRO A-Series brand names; graphics under the AMD Radeon graphics and AMD Embedded Radeon graphics; and professional graphics under the AMD Radeon Pro graphics brand name. In addition, the company offers data center graphics under the Radeon Instinct and Radeon PRO V-series brands, as well as servers under the AMD Instinct accelerators brand; server microprocessors under the AMD EPYC brands; low power solutions under the AMD Athlon, AMD Geode, AMD Ryzen, AMD EPYC, AMD R-Series, and G-Series brands; FPGA products under the Virtex-6, Virtex-7, Virtex UltraScale+, Kintex-7, Kintex UltraScale, Kintex UltraScale+, Artix-7, Artix UltraScale+, Spartan-6, and Spartan-7 brands; adaptive SOCs under the Zynq-7000, Zynq UltraScale+ MPSoC, Zynq UltraScale+ RFSoCs, Versal HBM, Versal Premium, Versal Prime, Versal AI Core, Versal AI Edge, Vitis, and Vivado brands; and compute and network acceleration board products under the Alveo brand. It serves original equipment and design manufacturers, public cloud service providers, system integrators, independent distributors, and add-in-board manufacturers through its direct sales force, and sales representatives. Advanced Micro Devices, Inc. was incorporated in 1969 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Starbucks Corporation","Symbol":"SBUX","Current Price":"90.10","Latest MA":"89.36","Price Target":103.304,"Difference from MA":"0.83%","Difference from Open":"-1.08%","Change from Yesterday":"-2.35%","Change from Last Report":"-2.34","Latest Volume":"2,087,215","Market Cap":"102,155,370,496","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":24.119738,"ROE":"N\/A","DTE":"N\/A","Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":0.962,"Trailing PEG":1.8665,"Trailing PE":27.220543,"Trailing PS":2.8238282,"Quick Ratio":0.524,"Day High":91.305,"Day Low":89.84,"VS Average Volume":0.2646307874,"Company Summary":"Starbucks Corporation, together with its subsidiaries, operates as a roaster, marketer, and retailer of coffee worldwide. The company operates through three segments: North America, International, and Channel Development. Its stores offer coffee, tea, and other beverages, roasted whole beans and ground coffees, single serve products, and ready-to-drink beverages; and various food products, such as pastries, breakfast sandwiches, and lunch items. The company also licenses its trademarks through licensed stores, and grocery and foodservice accounts. The company offers its products under the Starbucks Coffee, Teavana, Seattle's Best Coffee, Ethos, and Starbucks Reserve brands. Starbucks Corporation was founded in 1971 and is based in Seattle, Washington.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Microsoft Corporation","Symbol":"MSFT","Current Price":"424.12","Latest MA":"427.81","Price Target":508.5454,"Difference from MA":"-0.86%","Difference from Open":"-0.46%","Change from Yesterday":"-1.44%","Change from Last Report":"-0.05","Latest Volume":"3,536,131","Market Cap":"3,153,243,930,624","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":28.24411,"ROE":0.35604,"DTE":33.657,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.904,"Trailing PEG":2.26,"Trailing PE":35.050823,"Trailing PS":12.405067,"Quick Ratio":1.163,"Day High":426.11,"Day Low":421.9,"VS Average Volume":0.1690961381,"Company Summary":"Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services. This segment also provides LinkedIn; and dynamics business solutions, including Dynamics 365, a set of intelligent, cloud-based applications across ERP, CRM, power apps, and power automate; and on-premises ERP and CRM applications. The Intelligent Cloud segment offers server products and cloud services, such as azure and other cloud services; SQL and windows server, visual studio, system center, and related client access licenses, as well as nuance and GitHub; and enterprise services including enterprise support services, industry solutions, and nuance professional services. The More Personal Computing segment offers Windows, including windows OEM licensing and other non-volume licensing of the Windows operating system; Windows commercial comprising volume licensing of the Windows operating system, windows cloud services, and other Windows commercial offerings; patent licensing; and windows Internet of Things; and devices, such as surface, HoloLens, and PC accessories. Additionally, this segment provides gaming, which includes Xbox hardware and content, and first- and third-party content; Xbox game pass and other subscriptions, cloud gaming, advertising, third-party disc royalties, and other cloud services; and search and news advertising, which includes Bing, Microsoft News and Edge, and third-party affiliates. The company sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online, and retail stores. The company was founded in 1975 and is headquartered in Redmond, Washington.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Mondelez International, Inc.","Symbol":"MDLZ","Current Price":"59.38","Latest MA":"67.78","Price Target":78.4044,"Difference from MA":"-12.39%","Difference from Open":"-1.24%","Change from Yesterday":"-1.34%","Change from Last Report":"-1.38","Latest Volume":"1,662,824","Market Cap":"79,402,344,448","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":17.467583,"ROE":0.13552,"DTE":73.232,"Industry":"Confectioners","Sector":"Consumer Defensive","Beta":0.561,"Trailing PEG":4.7568,"Trailing PE":21.056738,"Trailing PS":2.1964078,"Quick Ratio":0.295,"Day High":60.33,"Day Low":59.34,"VS Average Volume":0.218402295,"Company Summary":"Mondelez International, Inc., through its subsidiaries, manufactures, markets, and sells snack food and beverage products in the Latin America, North America, Asia, the Middle East, Africa, and Europe. It provides biscuits and baked snacks, including cookies, crackers, salted snacks, snack bars, and cakes and pastries; chocolates; and gums and candies, as well as various cheese and grocery, and powdered beverage products. The company's brand portfolio includes Oreo, Ritz, LU, CLIF Bar, and Tate's Bake Shop biscuits and baked snacks, as well as Cadbury Dairy Milk, Milka, and Toblerone chocolate. It serves supermarket chains, wholesalers, supercenters, club stores, mass merchandisers, distributors, convenience stores, gasoline stations, drug stores, value stores, and other retail food outlets through direct store delivery, company-owned and satellite warehouses, distribution centers, third party distributors, and other facilities, as well as through independent sales offices and agents. The company also sells products directly to businesses and consumers through e-retail platforms, retailer digital platforms, as well as through its direct-to-consumer websites and social media platforms. Mondelez International, Inc. was formerly known as Kraft Foods Inc. and changed its name to Mondelez International, Inc. in October 2012. The company was incorporated in 2000 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"SoFi Technologies, Inc.","Symbol":"SOFI","Current Price":"15.69","Latest MA":"9.57","Price Target":11.36667,"Difference from MA":"63.94%","Difference from Open":"0.84%","Change from Yesterday":"-2.00%","Change from Last Report":"1.13","Latest Volume":"10,318,663","Market Cap":"17,026,001,920","Earning Date":"2025-01-27","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":64.05127,"ROE":0.037249997,"DTE":54.394,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.613,"Trailing PEG":null,"Trailing PE":130.75,"Trailing PS":6.758466,"Quick Ratio":0.47,"Day High":15.705,"Day Low":15.42,"VS Average Volume":0.1945099063,"Company Summary":"SoFi Technologies, Inc. provides various financial services in the United States, Latin America, and Canada. It operates through three segments: Lending, Technology Platform, and Financial Services. The company offers lending and financial services and products that allows its members to borrow, save, spend, invest, and protect money. It offers personal loans, student loans, home loans, and related services. The company also operates Galileo, a technology platform that offers services to financial and non-financial institution; and Technisys, a cloud-native digital and core banking platform with financial services customers. In addition, it provides SoFi Money offers checking and savings accounts, debit cards, and cash management products; and SoFi Invest, a mobile-first investment platform that provides access to trading and advisory solutions, such as investing and robo-advisory. Further, the company offers SoFi Credit Card that provides cash backs on every purchase; Sofi Relay, a personal finance management product that allows to track all of their financial accounts comprising credit score and spending behaviors; SoFi Protect, which offers insurance product; SoFi Travel, an application that manages travel search and booking experience; SoFi At Work provides financial benefits to employees, including student loan payments made on their employees' behalf; Lantern Credit, a financial services marketplace platform for seeking alternative products and provide product comparisons; and other lending as a service that offers pre-qualified borrower referrals and sells loans to third-party partner. The company was founded in 2011 and is based in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Tesla, Inc.","Symbol":"TSLA","Current Price":"419.33","Latest MA":"259.71","Price Target":283.8769,"Difference from MA":"61.46%","Difference from Open":"0.03%","Change from Yesterday":"-2.81%","Change from Last Report":"-0.83","Latest Volume":"28,688,220","Market Cap":"1,346,074,836,992","Earning Date":"2025-01-24","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":128.57089,"ROE":0.20389,"DTE":18.078,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":2.295,"Trailing PEG":5.2361,"Trailing PE":114.25888,"Trailing PS":13.855634,"Quick Ratio":1.214,"Day High":427.0,"Day Low":415.75,"VS Average Volume":0.3085832923,"Company Summary":"Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners; and provision of service and repairs to its energy product customers, including under warranty, as well as various financing options to its solar customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was incorporated in 2003 and is headquartered in Austin, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Intel Corporation","Symbol":"INTC","Current Price":"19.86","Latest MA":"24.77","Price Target":24.32824,"Difference from MA":"-19.83%","Difference from Open":"-0.75%","Change from Yesterday":"-2.19%","Change from Last Report":"-0.38","Latest Volume":"15,266,150","Market Cap":"85,656,182,784","Earning Date":"2025-01-24","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":20.318174,"ROE":-0.15597,"DTE":47.906,"Industry":"Semiconductors","Sector":"Technology","Beta":1.026,"Trailing PEG":0.5483,"Trailing PE":"N\/A","Trailing PS":1.5790032,"Quick Ratio":0.833,"Day High":20.115,"Day Low":19.73,"VS Average Volume":0.2210706977,"Company Summary":"Intel Corporation designs, develops, manufactures, markets, and sells computing and related products and services worldwide. It operates through Client Computing Group, Data Center and AI, Network and Edge, Mobileye, and Intel Foundry Services segments. The company's products portfolio comprises central processing units and chipsets, system-on-chips (SoCs), and multichip packages; mobile and desktop processors; hardware products comprising graphics processing units (GPUs), domain-specific accelerators, and field programmable gate arrays (FPGAs); and memory and storage, connectivity and networking, and other semiconductor products. It also offers silicon devices and software products; and optimization solutions for workloads, such as AI, cryptography, security, storage, networking, and leverages various features supporting diverse compute environments. In addition, the company develops and deploys advanced driver assistance systems (ADAS), and autonomous driving technologies and solutions; and provides advanced process technologies backed by an ecosystem of IP, EDA, and design services, as well as systems of chips, including advanced packaging technologies, software and accelerate bring-up, and integration of chips and driving standards. Further, it delivers and deploys intelligent edge platforms that allow developers to achieve agility and drive automation using AI for efficient operations with data integrity, as well as provides hardware and software platforms, tools, and ecosystem partnerships for digital transformation from the cloud to edge. The company serves original equipment manufacturers, original design manufacturers, cloud service providers, and other manufacturers and service providers. It has a strategic agreement with Synopsys, Inc. to develop EDA and IP solutions; and ARM that enables chip designers to build optimized compute SoCs on the Intel 18A process. Intel Corporation was incorporated in 1968 and is headquartered in Santa Clara, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Cleveland-Cliffs Inc.","Symbol":"CLF","Current Price":"9.02","Latest MA":"13.26","Price Target":14.401,"Difference from MA":"-31.97%","Difference from Open":"-1.72%","Change from Yesterday":"-2.33%","Change from Last Report":"-2.35","Latest Volume":"4,148,501","Market Cap":"4,456,560,128","Earning Date":"2025-01-27","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":15.292204,"ROE":-0.05365,"DTE":53.573,"Industry":"Steel","Sector":"Basic Materials","Beta":1.965,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.2231404,"Quick Ratio":0.498,"Day High":9.185,"Day Low":8.99,"VS Average Volume":0.3035001678,"Company Summary":"Cleveland-Cliffs Inc. operates as a flat-rolled steel producer in North America. The company offers hot-rolled, cold-rolled, electrogalvanized, hot-dip galvanized, hot-dip galvannealed, aluminized, galvalume, enameling, and advanced high-strength steel products; austenitic, martensitic, duplex, precipitation hardening, and ferritic stainless steel products; plates; and grain oriented and non-oriented electrical steel products, as well as slab, scrap, iron ore, coal, and coke. It also provides tubular components, including carbon steel, stainless steel, and electric resistance welded tubing. In addition, the company offers tinplate products, such as electrolytic tin coated and chrome coated sheet, and tin mill products; tooling and sampling; ingots, rolled blooms, and cast blooms; and hot-briquetted iron products. Further, it owns five iron ore mines in Minnesota and Michigan. The company serves automotive, infrastructure and manufacturing, distributors and converters, and steel producers. The company was formerly known as Cliffs Natural Resources Inc. and changed its name to Cleveland-Cliffs Inc. in August 2017. Cleveland-Cliffs Inc. was founded in 1847 and is headquartered in Cleveland, Ohio.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Verizon Communications Inc.","Symbol":"VZ","Current Price":"39.43","Latest MA":"41.22","Price Target":47.49583,"Difference from MA":"-4.34%","Difference from Open":"-0.92%","Change from Yesterday":"-1.28%","Change from Last Report":"-1.22","Latest Volume":"4,474,887","Market Cap":"165,996,642,304","Earning Date":"2025-01-24","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":8.339981,"ROE":0.10431,"DTE":182.615,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.418,"Trailing PEG":1.0594,"Trailing PE":17.070389,"Trailing PS":1.2365937,"Quick Ratio":0.51,"Day High":39.84,"Day Low":39.41,"VS Average Volume":0.2605246313,"Company Summary":"Verizon Communications Inc., through its subsidiaries, engages in the provision of communications, technology, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide. It operates in two segments, Verizon Consumer Group (Consumer) and Verizon Business Group (Business). The Consumer segment provides wireless services across the wireless networks in the United States under the Verizon and TracFone brands and through wholesale and other arrangements; and fixed wireless access (FWA) broadband through its wireless networks, as well as related equipment and devices, such as smartphones, tablets, smart watches, and other wireless-enabled connected devices. The segment also offers wireline services in the Mid-Atlantic and Northeastern United States, as well as Washington D.C. through its fiber-optic network, Verizon Fios product portfolio, and a copper-based network. The Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and conferencing, corporate networking, security and managed network, local and long-distance voice, and network access services to deliver various IoT services and products to businesses, government customers, and wireless and wireline carriers in the United States and internationally. The company was formerly known as Bell Atlantic Corporation and changed its name to Verizon Communications Inc. in June 2000. Verizon Communications Inc. was incorporated in 1983 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Mobileye Global Inc.","Symbol":"MBLY","Current Price":"19.79","Latest MA":"18.29","Price Target":20.22852,"Difference from MA":"8.24%","Difference from Open":"1.13%","Change from Yesterday":"-1.07%","Change from Last Report":"-1.19","Latest Volume":"1,750,752","Market Cap":"16,052,343,808","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":47.000954,"ROE":-0.21936001,"DTE":0.439,"Industry":"Auto Parts","Sector":"Consumer Cyclical","Beta":0.059,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":8.913017,"Quick Ratio":4.215,"Day High":19.9397,"Day Low":18.9,"VS Average Volume":0.2684197527,"Company Summary":"Mobileye Global Inc. develops and deploys advanced driver assistance systems (ADAS) and autonomous driving technologies and solutions worldwide. The company operates through Mobileye and Other segments. It offers Driver Assist comprising ADAS and autonomous vehicle solutions that covers safety features, such as real-time detection of road users, geometry, semantics, and markings to provide safety alerts and emergency interventions; Cloud-Enhanced Driver Assist, a solution for drivers with interpretations of a scene in real-time; Mobileye SuperVision Lite, a navigation and assisted driving solution; and Mobileye SuperVision, an operational point-to-point assisted driving navigation solution on various road types and includes cloud-based enhancements, such as road experience management. The company also provides Mobileye Chauffeur, a first-generation solution for eyes-off\/hands-off driving with a human driver still in the driver's seat; Mobileye Drive, a self-driving system comprising of radar and lidar subsystems, as well as collision avoidance systems, including Mobileye 8 Connect for light and medium-duty vehicles, and Mobileye Shield+ for large vehicles. It serves original equipment manufacturers. The company was founded in 1999 and is headquartered in Jerusalem, Israel. Mobileye Global Inc. operates as a subsidiary of Intel Overseas Funding Corporation.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Western Digital Corporation","Symbol":"WDC","Current Price":"59.37","Latest MA":"68.25","Price Target":89.2,"Difference from MA":"-13.02%","Difference from Open":"-0.49%","Change from Yesterday":"-1.93%","Change from Last Report":"-2.19","Latest Volume":"1,129,017","Market Cap":"20,524,683,264","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":6.601911,"ROE":0.033239998,"DTE":"N\/A","Industry":"Computer Hardware","Sector":"Technology","Beta":1.394,"Trailing PEG":null,"Trailing PE":65.24175,"Trailing PS":1.4304909,"Quick Ratio":0.683,"Day High":59.78,"Day Low":58.82,"VS Average Volume":0.2151711071,"Company Summary":"Western Digital Corporation develops, manufactures, and sells data storage devices and solutions in the United States, China, Hong Kong, Europe, the Middle East, Africa, rest of Asia, and internationally. It offers client devices, including hard disk drives (HDDs) and solid state drives (SSDs) for desktop and notebook personal computers (PCs), gaming consoles, and set top boxes; and flash-based embedded storage products for mobile phones, tablets, notebook PCs, and other portable and wearable devices, as well as automotive, Internet of Things, industrial, and connected home applications. The company also provides enterprise HDDs; enterprise SSDs consisting of flash-based SSDs and software solutions for use in enterprise servers, online transactions, artificial intelligence-related workloads, data analysis, and other enterprise applications; and data storage platforms. In addition, it offers external HDD storage products in mobile and desktop form; client portable SSDs; removable cards that are used in consumer devices comprising mobile phones, tablets, imaging systems, and cameras and smart video systems; universal serial bus flash drives for use in the computing and consumer markets; and wireless drive products used in-field backup of created content, as well as wireless streaming of high-definition movies, photos, music, documents to tablets, smartphones, and PCs. The company sells its products under the Western Digital, SanDisk, and WD brands to original equipment manufacturers, distributors, dealers, resellers, and retailers. Western Digital Corporation was founded in 1970 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"American Airlines Group, Inc.","Symbol":"AAL","Current Price":"17.27","Latest MA":"12.29","Price Target":17.43952,"Difference from MA":"40.52%","Difference from Open":"0.00%","Change from Yesterday":"-0.43%","Change from Last Report":"0.32","Latest Volume":"4,511,059","Market Cap":"11,345,366,016","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":7.595053,"ROE":"N\/A","DTE":"N\/A","Industry":"Airlines","Sector":"Industrials","Beta":1.399,"Trailing PEG":0.2112,"Trailing PE":41.107143,"Trailing PS":0.21161595,"Quick Ratio":0.422,"Day High":17.37,"Day Low":17.15,"VS Average Volume":0.1582378102,"Company Summary":"American Airlines Group Inc., through its subsidiaries, operates as a network air carrier. The company provides scheduled air transportation services for passengers and cargo through its hubs in Charlotte, Chicago, Dallas\/Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix, and Washington, D.C., as well as through partner gateways in London, Doha, Madrid, Seattle\/Tacoma, Sydney, and Tokyo. It operates a mainline fleet of 965 aircraft. The company was formerly known as AMR Corporation and changed its name to American Airlines Group Inc. in December 2013. American Airlines Group Inc. was founded in 1926 and is headquartered in Fort Worth, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Southwest Airlines Company","Symbol":"LUV","Current Price":"33.47","Latest MA":"29.25","Price Target":31.63905,"Difference from MA":"14.44%","Difference from Open":"-0.65%","Change from Yesterday":"-1.61%","Change from Last Report":"-1.67","Latest Volume":"1,278,982","Market Cap":"20,073,199,616","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":20.488869,"ROE":-0.00447,"DTE":87.36,"Industry":"Airlines","Sector":"Industrials","Beta":1.153,"Trailing PEG":0.511,"Trailing PE":"N\/A","Trailing PS":0.7332407,"Quick Ratio":0.783,"Day High":33.83,"Day Low":33.21,"VS Average Volume":0.1810614683,"Company Summary":"Southwest Airlines Co. operates as a passenger airline company that provides scheduled air transportation services in the United States and near-international markets. As of December 31, 2023, the company operated a total fleet of 817 Boeing 737 aircraft; and served 121 destinations in 42 states, the District of Columbia, and the Commonwealth of Puerto Rico, as well as ten near-international countries, including Mexico, Jamaica, the Bahamas, Aruba, the Dominican Republic, Costa Rica, Belize, Cuba, the Cayman Islands, and Turks and Caicos. It also provides inflight entertainment and connectivity services on Wi-Fi enabled aircraft; and Rapid Rewards loyalty program that enables program members to earn points for dollars spent on Southwest base fares. In addition, the company offers a suite of digital platforms to support customers' travel needs, including websites and apps; and SWABIZ, an online booking tool. Further, it provides ancillary services, such as Southwest's EarlyBird Check-In, upgraded boarding, and transportation of pets and unaccompanied minors. Southwest Airlines Co. was incorporated in 1967 and is headquartered in Dallas, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Comcast Corporation","Symbol":"CMCSA","Current Price":"37.23","Latest MA":"39.98","Price Target":47.91679,"Difference from MA":"-6.87%","Difference from Open":"-1.72%","Change from Yesterday":"-1.85%","Change from Last Report":"-1.85","Latest Volume":"2,553,309","Market Cap":"142,462,091,264","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":8.512361,"ROE":0.16884,"DTE":117.127,"Industry":"Telecom Services","Sector":"Communication Services","Beta":1.004,"Trailing PEG":1.1769,"Trailing PE":10.03504,"Trailing PS":1.1575696,"Quick Ratio":0.605,"Day High":37.88,"Day Low":37.11,"VS Average Volume":0.1361569823,"Company Summary":"Comcast Corporation operates as a media and technology company worldwide. It operates through Residential Connectivity & Platforms, Business Services Connectivity, Media, Studios, and Theme Parks segments. The Residential Connectivity & Platforms segment provides residential broadband and wireless connectivity services, residential and business video services, sky-branded entertainment television networks, and advertising. The Business Services Connectivity segment offers connectivity services for small business locations, which include broadband, wireline voice, and wireless services, as well as solutions for medium-sized customers and larger enterprises; and small business connectivity services in the United Kingdom. The Media segment operates NBCUniversal's television and streaming business, including national and regional cable networks; the NBC and Telemundo broadcast networks and owned local broadcast television stations; and Peacock, a direct-to-consumer streaming services. It also operates international television networks comprising the Sky Sports networks, as well as other digital properties. The Studios segment operates NBCUniversal and Sky film and television studio production and distribution operations. The Theme Parks segment operates Universal theme parks in Orlando, Florida; Hollywood, California; Osaka, Japan; and Beijing, China. The company also offers a consolidated streaming platforms under the Philadelphia Flyers and the Wells Fargo Center arena in Philadelphia, Pennsylvania; and Xumo. Comcast Corporation was founded in 1963 and is headquartered in Philadelphia, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Johnson & Johnson","Symbol":"JNJ","Current Price":"143.06","Latest MA":"155.11","Price Target":174.28,"Difference from MA":"-7.77%","Difference from Open":"-1.23%","Change from Yesterday":"-1.33%","Change from Last Report":"-1.37","Latest Volume":"1,104,640","Market Cap":"344,434,114,560","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":13.468831,"ROE":0.20889,"DTE":50.958,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.518,"Trailing PEG":0.8695,"Trailing PE":23.64628,"Trailing PS":3.927592,"Quick Ratio":0.705,"Day High":144.88,"Day Low":142.95,"VS Average Volume":0.1514787706,"Company Summary":"Johnson & Johnson, together with its subsidiaries, researches, develops, manufactures, and sells various products in the healthcare field worldwide. The company's Innovative Medicine segment offers products for various therapeutic areas, such as immunology, including rheumatoid arthritis, psoriatic arthritis, inflammatory bowel disease, and psoriasis; infectious diseases comprising HIV\/AIDS; neuroscience, consisting of mood disorders, neurodegenerative disorders, and schizophrenia; oncology, such as prostate cancer, hematologic malignancies, lung cancer, and bladder cancer; cardiovascular and metabolism, including thrombosis, diabetes, and macular degeneration; and pulmonary hypertension comprising pulmonary arterial hypertension through retailers, wholesalers, distributors, hospitals, and healthcare professionals for prescription use. Its MedTech segment provides Interventional Solutions, including electrophysiology products to treat heart rhythm disorders; the heart recovery portfolio, which includes technologies to treat severe coronary artery disease requiring high-risk PCI or AMI cardiogenic shock; and neurovascular care that treats hemorrhagic and ischemic stroke. this segment also offers an orthopaedics portfolio that includes products and enabling technologies that support hips, knees, trauma, spine, sports, and other; surgery portfolios comprising advanced and general surgery technologies, as well as solutions for breast aesthetics, ear, nose, and throat procedures; contact lenses under the ACUVUE Brand; and TECNIS intraocular lenses for cataract surgery. It distributes its products to wholesalers, hospitals, and retailers, as well as physicians, nurses, hospitals, eye care professionals, and clinics. The company has a collaboration agreement with Stand Up To Cancer for research testing a combination of teclistamab and daratumumab to treat a rare disease AL amyloidosis. Johnson & Johnson was founded in 1886 and is based in New Brunswick, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Lam Research Corporation","Symbol":"LRCX","Current Price":"71.77","Latest MA":"82.60","Price Target":92.82013,"Difference from MA":"-13.11%","Difference from Open":"-0.32%","Change from Yesterday":"-2.25%","Change from Last Report":"-2.23","Latest Volume":"1,530,539","Market Cap":"92,348,186,624","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":17.21136,"ROE":0.49116,"DTE":58.827,"Industry":"Semiconductor Equipment & Materials","Sector":"Technology","Beta":1.486,"Trailing PEG":1.4109,"Trailing PE":23.227152,"Trailing PS":5.923059,"Quick Ratio":1.685,"Day High":72.44,"Day Low":71.27,"VS Average Volume":0.1269342255,"Company Summary":"Lam Research Corporation designs, manufactures, markets, refurbishes, and services semiconductor processing equipment used in the fabrication of integrated circuits. The company offers ALTUS systems to deposit conformal films for tungsten metallization applications; SABRE electrochemical deposition products for copper interconnect transition that offers copper damascene manufacturing; and VECTOR plasma-enhanced CVD products. It also provides SPEED gapfill high-density plasma chemical vapor deposition products; and Striker single-wafer atomic layer deposition products for dielectric film solutions. In addition, the company offers Flex for dielectric etch applications; Vantex, a dielectric etch system that provides RF technology and repeatable wafer-to-wafer performance enabled by Equipment Intelligence solutions; Kiyo for conductor etch applications; Syndion for through-silicon via etch applications; and Versys metal products for metal etch processes. Further, it provides Coronus bevel clean products to enhance die yield; and Da Vinci, DV-Prime, EOS, and SP series products to address various wafer cleaning applications. The company sells its products in the United States, China, Europe, Japan, Korea, Southeast Asia, and Taiwan. Lam Research Corporation was incorporated in 1980 and is headquartered in Fremont, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Super Micro Computer, Inc.","Symbol":"SMCI","Current Price":"31.21","Latest MA":"54.01","Price Target":41.92818,"Difference from MA":"-42.22%","Difference from Open":"-0.19%","Change from Yesterday":"-2.25%","Change from Last Report":"2.06","Latest Volume":"14,079,876","Market Cap":"18,273,492,992","Earning Date":"2025-01-27","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":8.458609,"ROE":0.32469,"DTE":39.749,"Industry":"Computer Hardware","Sector":"Technology","Beta":1.279,"Trailing PEG":null,"Trailing PE":15.525672,"Trailing PS":1.2228917,"Quick Ratio":1.805,"Day High":31.38,"Day Low":30.12,"VS Average Volume":0.1772512061,"Company Summary":"Super Micro Computer, Inc., together with its subsidiaries, develops and manufactures high performance server and storage solutions based on modular and open architecture in the United States, Europe, Asia, and internationally. Its solutions range from complete server, storage systems, modular blade servers, blades, workstations, full racks, networking devices, server sub-systems, server management software, and security software. The company provides application-optimized server solutions, rackmount and blade servers, storage, and subsystems and accessories; and server software management solutions, such as Server Management Suite, including Supermicro Server Manager, Supermicro Power Management software, Supermicro Update Manager, SuperCloud Composer, and SuperDoctor 5. In addition, it offers server subsystems and accessories comprising server boards, chassis, power supplies, and other accessories. Further, the company provides server and storage system integration, configuration, and software upgrade and update services; and technical documentation services, as well as identifies service requirements, creates and executes project plans, and conducts verification testing and technical documentation, and training services. Additionally, it offers help desk and on-site product support services for its server and storage systems; and customer support services, including ongoing maintenance and technical support for its products. The company provides its products to enterprise data centers, cloud computing, artificial intelligence, and 5G and edge computing markets. It sells its products through direct and indirect sales force, distributors, value-added resellers, system integrators, and original equipment manufacturers. The company was incorporated in 1993 and is headquartered in San Jose, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Procter & Gamble Company (The)","Symbol":"PG","Current Price":"166.92","Latest MA":"168.58","Price Target":180.99692,"Difference from MA":"-0.99%","Difference from Open":"-1.03%","Change from Yesterday":"-1.50%","Change from Last Report":"-1.54","Latest Volume":"1,012,409","Market Cap":"393,103,278,080","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":22.522425,"ROE":0.28766,"DTE":69.338,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":0.414,"Trailing PEG":3.5849,"Trailing PE":28.779308,"Trailing PS":4.685099,"Quick Ratio":0.507,"Day High":168.96,"Day Low":166.71,"VS Average Volume":0.1485883135,"Company Summary":"The Procter & Gamble Company engages in the provision of branded consumer packaged goods worldwide. The company operates through five segments: Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care. The Beauty segment offers conditioners, shampoos, styling aids, and treatments under the Head & Shoulders, Herbal Essences, Pantene, and Rejoice brands; and antiperspirants and deodorants, personal cleansing, and skin care products under the Olay, Old Spice, Safeguard, Secret, SK-II, and Native brands. The Grooming segment provides blades and razors, shave products, appliances, and other grooming products under the Braun, Gillette, and Venus brand names. The Health Care segment offers toothbrushes, toothpastes, and other oral care products under the Crest and Oral-B brand names; and gastrointestinal, pain relief, rapid diagnostics, respiratory, vitamins\/minerals\/supplements, and other personal health care products under Metamucil, Neurobion, Pepto-Bismol, and Vicks brands. The Fabric & Home Care segment provides fabric enhancers, laundry additives, and laundry detergents under the Ariel, Downy, Gain, and Tide brands; and air care, dish care, P&G professional, and surface care products under the Cascade, Dawn, Fairy, Febreze, Mr. Clean, and Swiffer brands. The Baby, Feminine & Family Care segment offers baby wipes, and taped diapers and pants under the Luvs and Pampers brands; adult incontinence and feminine care products under the Always, Always Discreet, and Tampax brands; and paper towels, tissues, and toilet papers under the Bounty, Charmin, and Puffs brands. It sells its products primarily through mass merchandisers, e-commerce, grocery stores, membership club stores, drug stores, department stores, distributors, wholesalers, specialty beauty stores, high-frequency stores, pharmacies, electronics stores, and professional channels, as well as directly to consumers. The company was founded in 1837 and is headquartered in Cincinnati, Ohio.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"CSX Corporation","Symbol":"CSX","Current Price":"32.00","Latest MA":"33.81","Price Target":38.65846,"Difference from MA":"-5.35%","Difference from Open":"-0.90%","Change from Yesterday":"-1.39%","Change from Last Report":"-1.42","Latest Volume":"1,371,993","Market Cap":"61,709,438,976","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":15.724198,"ROE":0.29458,"DTE":147.913,"Industry":"Railroads","Sector":"Industrials","Beta":1.191,"Trailing PEG":2.0467,"Trailing PE":17.021276,"Trailing PS":4.203354,"Quick Ratio":1.195,"Day High":32.34,"Day Low":31.915,"VS Average Volume":0.1153827038,"Company Summary":"CSX Corporation, together with its subsidiaries, provides rail-based freight transportation services. The company offers rail services; and transportation of intermodal containers and trailers, as well as other transportation services, such as rail-to-truck transfers and bulk commodity operations. It also transports chemicals, agricultural and food products, minerals, automotive, forest products, fertilizers, and metals and equipment; and coal, coke, and iron ore to electricity-generating power plants, steel manufacturers, and industrial plants, as well as exports coal to deep-water port facilities. In addition, the company provides intermodal services through a network of approximately 30 terminals transporting manufactured consumer goods in containers; and drayage services, including the pickup and delivery of intermodal shipments. It serves the automotive industry with distribution centers and storage locations, as well as connects non-rail served customers through transferring products, such as plastics and ethanol from rail to trucks. The company operates approximately 20,000 route mile rail network, which serves various population centers in 26 states east of the Mississippi River, the District of Columbia, and the Canadian provinces of Ontario and Quebec, as well as owns and leases approximately 3,500 locomotives. It serves production and distribution facilities through track connections. CSX Corporation was incorporated in 1978 and is headquartered in Jacksonville, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Halliburton Company","Symbol":"HAL","Current Price":"26.89","Latest MA":"30.76","Price Target":37.19655,"Difference from MA":"-12.58%","Difference from Open":"0.35%","Change from Yesterday":"0.43%","Change from Last Report":"0.39","Latest Volume":"1,419,060","Market Cap":"23,627,311,104","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":8.645185,"ROE":0.26293,"DTE":83.993,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.905,"Trailing PEG":2.1234,"Trailing PE":9.403847,"Trailing PS":1.0240242,"Quick Ratio":1.377,"Day High":26.92,"Day Low":26.54,"VS Average Volume":0.1508175528,"Company Summary":"Halliburton Company provides products and services to the energy industry worldwide. It operates through two segments, Completion and Production, and Drilling and Evaluation. The Completion and Production segment offers production enhancement services that include stimulation and sand control services; cementing services, such as well bonding and casing, and casing equipment; and completion tools that offer downhole solutions and services, including well completion products and services, intelligent well completions, and service tools, as well as liner hanger, sand control, and multilateral systems. This segment also provides electrical submersible pumps, as well as artificial lift services; production solutions comprising coiled tubing, hydraulic workover units, downhole tools, and pumping and nitrogen services; pipeline and process services, such as pre-commissioning, commissioning, maintenance, and decommissioning; and specialty chemicals and services. The Drilling and Evaluation segment offers drilling fluid systems, performance additives, completion fluids, solids control, specialized testing equipment, and waste management services; drilling systems and services; wireline and perforating services consists of open-hole logging, and cased-hole and slickline; and drill bits and services comprising roller cone rock bits, fixed cutter bits, hole enlargement, and related downhole tools and services, as well as coring equipment and services. This segment also provides cloud based digital services and artificial intelligence solutions on an open architecture for subsurface insights, integrated well construction, and reservoir and production management; testing and subsea services, such as acquisition and analysis of reservoir information and optimization solutions; and project management and integrated asset management services. Halliburton Company was founded in 1919 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Freeport-McMoRan, Inc.","Symbol":"FCX","Current Price":"37.92","Latest MA":"45.60","Price Target":52.91714,"Difference from MA":"-16.83%","Difference from Open":"-1.29%","Change from Yesterday":"-2.41%","Change from Last Report":"-2.41","Latest Volume":"2,194,630","Market Cap":"54,495,571,968","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":17.500023,"ROE":0.16870001,"DTE":33.531,"Industry":"Copper","Sector":"Basic Materials","Beta":1.91,"Trailing PEG":10.1643,"Trailing PE":27.481884,"Trailing PS":2.1254125,"Quick Ratio":1.048,"Day High":38.48,"Day Low":37.745,"VS Average Volume":0.2043273304,"Company Summary":"Freeport-McMoRan Inc. engages in the mining of mineral properties in North America, South America, and Indonesia. It primarily explores for copper, gold, molybdenum, silver, and other metals. The company's assets include the Grasberg minerals district in Indonesia; Morenci, Bagdad, Safford, Sierrita, and Miami in Arizona; Chino and Tyrone in New Mexico; and Henderson and Climax in Colorado, North America, as well as Cerro Verde in Peru and El Abra in Chile. The company was formerly known as Freeport-McMoRan Copper & Gold Inc. and changed its name to Freeport-McMoRan Inc. in July 2014. Freeport-McMoRan Inc. was incorporated in 1987 and is headquartered in Phoenix, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Amphenol Corporation","Symbol":"APH","Current Price":"69.62","Latest MA":"67.15","Price Target":77.08667,"Difference from MA":"3.68%","Difference from Open":"-0.01%","Change from Yesterday":"-1.61%","Change from Last Report":"-1.58","Latest Volume":"1,084,199","Market Cap":"83,934,568,448","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":32.317516,"ROE":0.25293,"DTE":57.565,"Industry":"Electronic Components","Sector":"Technology","Beta":1.238,"Trailing PEG":2.1693,"Trailing PE":39.78286,"Trailing PS":5.897429,"Quick Ratio":1.208,"Day High":69.77,"Day Low":69.13,"VS Average Volume":0.1629463162,"Company Summary":"Amphenol Corporation, together with its subsidiaries, primarily designs, manufactures, and markets electrical, electronic, and fiber optic connectors in the United States, China, and internationally. It operates through three segments: Harsh Environment Solutions, Communications Solutions, and Interconnect and Sensor Systems. The company offers connectors and connector systems, including harsh environment data, power, high-speed, fiber optic, and radio frequency interconnect products; busbars and power distribution systems; and other connectors. It also provides value-add products, such as backplane interconnect systems, cable assemblies and harnesses, and cable management products; other products comprising flexible and rigid printed circuit boards, hinges, other mechanical, and production related products. In addition, the company offers consumer device, network infrastructure, and other antennas; coaxial, power, and specialty cables; and sensors and sensor-based products. It sells its products through its sales force, independent representatives, and a network of electronics distributors to original equipment manufacturers, electronic manufacturing services companies, original design manufacturers, and service providers in the automotive, broadband communication, commercial aerospace, industrial, information technology and data communication, military, mobile device, and mobile network markets. Amphenol Corporation was founded in 1932 and is headquartered in Wallingford, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"AT&T Inc.","Symbol":"T","Current Price":"22.48","Latest MA":"20.51","Price Target":25.765,"Difference from MA":"9.60%","Difference from Open":"-1.34%","Change from Yesterday":"-1.68%","Change from Last Report":"-0.60","Latest Volume":"4,945,071","Market Cap":"161,264,648,192","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":10.253614,"ROE":0.08759,"DTE":125.151,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.73,"Trailing PEG":1.7595,"Trailing PE":18.272358,"Trailing PS":1.3211917,"Quick Ratio":0.42,"Day High":22.775,"Day Low":22.44,"VS Average Volume":0.1458719093,"Company Summary":"AT&T Inc. provides telecommunications and technology services worldwide. The company operates through two segments, Communications and Latin America. The Communications segment offers wireless voice and data communications services; and sells handsets, wireless data cards, wireless computing devices, carrying cases\/protective covers, and wireless chargers through its own company-owned stores, agents, and third-party retail stores. It also provides Virtual Private Networks, AT&T Dedicated Internet, Ethernet, data services, cloud solutions, outsourcing, and managed professional services, as well as customer premises equipment for multinational corporations, small and mid-sized businesses, governmental, and wholesale customers. In addition, this segment offers broadband services, including fiber connections, legacy telephony voice communication services, and other VoIP services and equipment to residential customers. This segment markets its communications services and products under the AT&T, AT&T Business, Cricket, AT&T PREPAID, and AT&T Fiber brand names. The Latin America segment provides postpaid and prepaid wireless services in Mexico under the AT&T and Unefon brand names, as well as sells smartphones through its owned stores, agents and third-party retail stores. The company was formerly known as SBC Communications Inc. and changed its name to AT&T Inc. in 2005. AT&T Inc. was incorporated in 1983 and is based in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Huntington Bancshares Incorpora","Symbol":"HBAN","Current Price":"16.27","Latest MA":"14.74","Price Target":18.53737,"Difference from MA":"10.40%","Difference from Open":"0.06%","Change from Yesterday":"-0.64%","Change from Last Report":"-0.67","Latest Volume":"1,788,881","Market Cap":"23,637,219,328","Earning Date":"2025-01-17","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":12.0923395,"ROE":0.08545,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.057,"Trailing PEG":2.7805,"Trailing PE":15.796118,"Trailing PS":3.5332167,"Quick Ratio":"N\/A","Day High":16.27,"Day Low":16.11,"VS Average Volume":0.1269988925,"Company Summary":"Huntington Bancshares Incorporated operates as the bank holding company for The Huntington National Bank that provides commercial, consumer, and mortgage banking services in the United States. The company offers financial products and services to consumer and business customers, including deposits, lending, payments, mortgage banking, dealer financing, investment management, trust, brokerage, insurance, and other financial products and services. It also provides 24-hour grace, asterisk-free checking, money scout, $50 safety zone, standby cash, early pay, instant access, savings goal getter, and Huntington heads up; digitally powered consumer and business financial solutions to consumer lending, regional banking, branch banking, and wealth management customers; direct and indirect consumer loans, as well as dealer finance loans and deposits; and private banking, wealth management and legacy planning through investment and portfolio management, fiduciary administration and trust, institutional custody, and full-service retail brokerage investment services. The company offers equipment financing, asset-based lending, distribution finance, structured lending, and municipal financing solutions, as well as Huntington ChoicePay. In addition, it offers lending, liquidity, treasury management and other payment services, and capital markets; government and non-profits, healthcare, technology and telecommunications, franchises, financial sponsors, and global services; and corporate risk management, institutional sales and trading, debt and equity issuance, and additional advisory services. The company offers its products through a network of channels, including branches and ATMs, online and mobile banking, and through customer call centers to customers in middle market banking, corporate, specialty, and government banking, asset finance, commercial real estate banking, and capital markets. The company was founded in 1866 and is headquartered in Columbus, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Schlumberger N.V.","Symbol":"SLB","Current Price":"37.59","Latest MA":"43.18","Price Target":55.85621,"Difference from MA":"-12.94%","Difference from Open":"-0.12%","Change from Yesterday":"-0.53%","Change from Last Report":"-0.54","Latest Volume":"2,470,748","Market Cap":"53,089,779,712","Earning Date":"2025-01-17","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":10.565379,"ROE":0.21722999,"DTE":57.141,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.532,"Trailing PEG":1.6851,"Trailing PE":12.088426,"Trailing PS":1.4749209,"Quick Ratio":1.003,"Day High":37.87,"Day Low":37.25,"VS Average Volume":0.2053329688,"Company Summary":"Schlumberger Limited engages in the provision of technology for the energy industry worldwide. The company operates through four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company provides field development and hydrocarbon production, carbon management, and integration of adjacent energy systems; reservoir interpretation and data processing services for exploration data; and well construction and production improvement services and products. It also offers subsurface geology and fluids evaluation information; open and cased hole services; exploration and production pressure, and flow-rate measurement services; and pressure pumping, well stimulation, and coiled tubing equipment solutions. In addition, the company offers mud logging, directional drilling, measurement-while-drilling, and logging-while-drilling services, as well as engineering support services; supplies drilling fluid systems; designs, manufactures, and markets roller cone and fixed cutter drill bits; bottom-hole-assembly and borehole enlargement technologies; well cementing products and services; well planning, well drilling, engineering, supervision, logistics, procurement, and contracting of third parties, as well as drilling rig management solutions; and drilling equipment and services, as well as land drilling rigs and related services. Further, it provides artificial lift production equipment and optimization services; supplies packers, safety valves, sand control technology, and various intelligent well completions technology and equipment; designs and manufactures valves, chokes, actuators, and surface trees; and OneSubsea, an integrated solutions, products, systems, and services, including wellheads, subsea trees, manifolds and flowline connectors, control systems, connectors, and services. The company was formerly known as Socie´te´ de Prospection E´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"United Airlines Holdings, Inc.","Symbol":"UAL","Current Price":"96.65","Latest MA":"62.97","Price Target":109.65652,"Difference from MA":"53.49%","Difference from Open":"-1.65%","Change from Yesterday":"-3.03%","Change from Last Report":"-3.01","Latest Volume":"1,461,970","Market Cap":"31,785,865,216","Earning Date":"2025-01-20","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":7.798588,"ROE":0.27245,"DTE":291.676,"Industry":"Airlines","Sector":"Industrials","Beta":1.393,"Trailing PEG":0.8104,"Trailing PE":11.519666,"Trailing PS":0.5676656,"Quick Ratio":0.694,"Day High":98.31,"Day Low":95.3,"VS Average Volume":0.2170697536,"Company Summary":"United Airlines Holdings, Inc., through its subsidiaries, provides air transportation services in North America, Asia, Europe, Africa, the Pacific, the Middle East, and Latin America. The company transports people and cargo through its mainline and regional fleets. It also offers catering, ground handling, flight academy, and maintenance services for third parties. The company was formerly known as United Continental Holdings, Inc. and changed its name to United Airlines Holdings, Inc. in June 2019. United Airlines Holdings, Inc. was incorporated in 1968 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Bank of America Corporation","Symbol":"BAC","Current Price":"43.84","Latest MA":"41.30","Price Target":49.12524,"Difference from MA":"6.16%","Difference from Open":"-0.11%","Change from Yesterday":"-1.11%","Change from Last Report":"-1.13","Latest Volume":"3,380,559","Market Cap":"336,379,052,032","Earning Date":"2025-01-16","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":11.88704,"ROE":0.08092,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.325,"Trailing PEG":1.9646,"Trailing PE":15.884058,"Trailing PS":3.554827,"Quick Ratio":"N\/A","Day High":43.956,"Day Low":43.555,"VS Average Volume":0.0989072874,"Company Summary":"Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. It operates in four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, non-interest and interest-bearing checking accounts, and investment accounts and products; credit and debit cards; residential mortgages, and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research, and certain market-based services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"KeyCorp","Symbol":"KEY","Current Price":"17.00","Latest MA":"16.20","Price Target":21.24706,"Difference from MA":"4.97%","Difference from Open":"-0.15%","Change from Yesterday":"-1.12%","Change from Last Report":"-1.13","Latest Volume":"1,027,750","Market Cap":"16,856,766,464","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":10.921783,"ROE":0.0096700005,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.231,"Trailing PEG":0.7091,"Trailing PE":"Infinity","Trailing PS":3.4741895,"Quick Ratio":"N\/A","Day High":17.105,"Day Low":16.89,"VS Average Volume":0.1091702941,"Company Summary":"KeyCorp operates as the holding company for KeyBank National Association that provides various retail and commercial banking products and services in the United States. It operates in two segments, Consumer Bank and Commercial Bank. The company offers various deposits, investment products and services; commercial leasing, investment management, consumer finance; and personal finance and financial wellness, student loan refinancing, mortgage and home equity, lending, credit card, treasury, business advisory, wealth management, asset management, cash management, portfolio management, and trust and related services to individuals and small and medium-sized businesses. It also provides a suite of banking and capital market products, such as syndicated finance, debt and equity capital market products, commercial payments, equipment finance, commercial mortgage banking, derivatives, foreign exchange, financial advisory, and public finance, as well as commercial mortgage loans to consumer, energy, healthcare, industrial, public sector, real estate, and technology sectors for middle market clients. In addition, the company offers community development financing, securities underwriting, brokerage, and investment banking services. The company was founded in 1849 and is headquartered in Cleveland, Ohio.","Stock Sentiment":"N\/A","Row Color":"positive-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Devon Energy Corporation","Symbol":"DVN","Current Price":"31.86","Latest MA":"41.29","Price Target":50.11571,"Difference from MA":"-22.85%","Difference from Open":"1.92%","Change from Yesterday":"2.08%","Change from Last Report":"2.11","Latest Volume":"3,524,933","Market Cap":"20,928,176,128","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":6.8161445,"ROE":0.26279,"DTE":64.021,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":2.071,"Trailing PEG":14.898,"Trailing PE":5.8998146,"Trailing PS":1.4404416,"Quick Ratio":0.834,"Day High":31.88,"Day Low":31.11,"VS Average Volume":0.3687621648,"Company Summary":"Devon Energy Corporation, an independent energy company, engages in the exploration, development, and production of oil, natural gas, and natural gas liquids in the United States. It operates in Delaware, Eagle Ford, Anadarko, Williston, and Powder River Basins. The company was founded in 1971 and is headquartered in Oklahoma City, Oklahoma.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"JP Morgan Chase & Co.","Symbol":"JPM","Current Price":"239.11","Latest MA":"217.04","Price Target":247.39555,"Difference from MA":"10.17%","Difference from Open":"0.14%","Change from Yesterday":"-0.91%","Change from Last Report":"-0.85","Latest Volume":"1,092,130","Market Cap":"673,175,961,600","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":14.059273,"ROE":0.16216,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.091,"Trailing PEG":4.7432,"Trailing PE":13.291273,"Trailing PS":4.151614,"Quick Ratio":"N\/A","Day High":239.515,"Day Low":237.11,"VS Average Volume":0.1258913069,"Company Summary":"JPMorgan Chase & Co. operates as a financial services company worldwide. It operates through three segments: Consumer & Community Banking, Commercial & Investment Bank, and Asset & Wealth Management. It offers deposit, investment and lending products, cash management, and payments and services; mortgage origination and servicing activities; residential mortgages and home equity loans; and credit cards, auto loans, leases, and travel services to consumers and small businesses through bank branches, ATMs, and digital and telephone banking. The company also provides investment banking products and services, including corporate strategy and structure advisory, and equity and debt market capital-raising services, as well as loan origination and syndication; payments; and cash and derivative instruments, risk management solutions, prime brokerage, and research, as well as offers securities services, including custody, fund accounting and administration, and securities lending products for asset managers, insurance companies, and public and private investment funds. In addition, it provides financial solutions, including lending, payments, investment banking, and asset management to small and midsized companies, local governments, nonprofit clients, and large corporations, as well as investors, developers, and owners of multifamily, office, retail, industrial, and affordable housing properties. Further, the company offers multi-asset investment management solutions in equities, fixed income, alternatives, and money market funds to institutional clients and retail investors; and retirement products and services, brokerage, custody, estate planning, lending, deposits, and investment management products to high net worth clients. JPMorgan Chase & Co. was founded in 1799 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Wells Fargo & Company","Symbol":"WFC","Current Price":"70.30","Latest MA":"61.33","Price Target":74.54182,"Difference from MA":"14.63%","Difference from Open":"-0.16%","Change from Yesterday":"-1.11%","Change from Last Report":"-1.14","Latest Volume":"1,643,374","Market Cap":"234,063,151,104","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":12.830364,"ROE":0.099139996,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.136,"Trailing PEG":3.3152,"Trailing PE":14.615385,"Trailing PS":3.0056262,"Quick Ratio":"N\/A","Day High":70.55,"Day Low":69.77,"VS Average Volume":0.094547986,"Company Summary":"Wells Fargo & Company, a financial services company, provides diversified banking, investment, mortgage, and consumer and commercial finance products and services in the United States and internationally. The company operates through four segments: Consumer Banking and Lending; Commercial Banking; Corporate and Investment Banking; and Wealth and Investment Management. The Consumer Banking and Lending segment offers diversified financial products and services for consumers and small businesses. Its financial products and services include checking and savings accounts, and credit and debit cards, as well as home, auto, personal, and small business lending services. The Commercial Banking segment provides financial solutions to private, family owned, and certain public companies. Its products and services include banking and credit products across various industry sectors and municipalities, secured lending and lease products, and treasury management services. The Corporate and Investment Banking segment offers a suite of capital markets, banking, and financial products and services, such as corporate banking, investment banking, treasury management, commercial real estate lending and servicing, equity, and fixed income solutions, as well as sales, trading, and research capabilities services to corporate, commercial real estate, government, and institutional clients. The Wealth and Investment Management segment provides personalized wealth management, brokerage, financial planning, lending, private banking, and trust and fiduciary products and services to affluent, high-net worth, and ultra-high-net worth clients. It also operates through financial advisors in brokerage and wealth offices, consumer bank branches, independent offices, and digitally through WellsTrade and Intuitive Investor. The company was founded in 1852 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Delta Air Lines, Inc.","Symbol":"DAL","Current Price":"60.12","Latest MA":"50.87","Price Target":75.74636,"Difference from MA":"18.18%","Difference from Open":"-0.08%","Change from Yesterday":"-1.76%","Change from Last Report":"-1.86","Latest Volume":"1,361,908","Market Cap":"38,794,358,784","Earning Date":"2025-01-10","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":8.114293,"ROE":0.4067,"DTE":186.78,"Industry":"Airlines","Sector":"Industrials","Beta":1.341,"Trailing PEG":null,"Trailing PE":8.338432,"Trailing PS":0.64328116,"Quick Ratio":0.268,"Day High":60.24,"Day Low":59.36,"VS Average Volume":0.1676761775,"Company Summary":"Delta Air Lines, Inc. provides scheduled air transportation for passengers and cargo in the United States and internationally. The company operates through two segments, Airline and Refinery. Its domestic network centered on core hubs in Atlanta, Minneapolis-St. Paul, Detroit, and Salt Lake City, as well as coastal hub positions in Boston, Los Angeles, New York-LaGuardia, New York-JFK, and Seattle; and international network centered on hubs and market presence in Amsterdam, Bogota, Lima, Mexico City, London-Heathrow, Paris-Charles de Gaulle, Sao Paulo, Seoul-Incheon, and Tokyo. The company sells its tickets through various distribution channels, including delta.com and the Fly Delta app; acts as a reservations specialists; and operates online travel and traditional brick and mortar agencies. It also provides aircraft maintenance and engineering support, repair, and overhaul services; and vacation packages to third-party consumers. The company operates through a fleet of approximately 1,273 aircrafts. Delta Air Lines, Inc. was founded in 1924 and is based in Atlanta, Georgia.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Kinder Morgan, Inc.","Symbol":"KMI","Current Price":"27.25","Latest MA":"22.68","Price Target":26.525,"Difference from MA":"20.12%","Difference from Open":"0.33%","Change from Yesterday":"0.26%","Change from Last Report":"0.26","Latest Volume":"1,570,792","Market Cap":"60,539,686,912","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":21.37104,"ROE":0.083500005,"DTE":101.433,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.907,"Trailing PEG":1.9902,"Trailing PE":24.115044,"Trailing PS":3.9957552,"Quick Ratio":0.291,"Day High":27.2599,"Day Low":26.935,"VS Average Volume":0.1136214826,"Company Summary":"Kinder Morgan, Inc. operates as an energy infrastructure company primarily in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas gasification, liquefaction, and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and\/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, renewable fuel and feedstocks, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; owns interests in\/or operates oil fields and gasoline processing plants; and operates a crude oil pipeline system in West Texas, as well as owns and operates RNG and LNG facilities. It owns and operates approximately 82,000 miles of pipelines and 139 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1997 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Walgreens Boots Alliance, Inc.","Symbol":"WBA","Current Price":"9.33","Latest MA":"10.54","Price Target":10.35714,"Difference from MA":"-11.45%","Difference from Open":"-1.58%","Change from Yesterday":"-3.00%","Change from Last Report":"-3.01","Latest Volume":"3,338,434","Market Cap":"8,056,343,040","Earning Date":"2025-01-02","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":5.818413,"ROE":-0.75969005,"DTE":277.898,"Industry":"Pharmaceutical Retailers","Sector":"Healthcare","Beta":0.669,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.05456083,"Quick Ratio":0.332,"Day High":9.53,"Day Low":9.3,"VS Average Volume":0.1417455379,"Company Summary":"Walgreens Boots Alliance, Inc. operates as a healthcare, pharmacy, and retail company in the United States, Germany, the United Kingdom, and internationally. It operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The U.S. Retail Pharmacy segment engages in operation of the retail drugstores, health and wellness services, specialty, and home delivery pharmacy services, which offers health and wellness, beauty, personal care and consumables, and general merchandise. The International segment offers sale of prescription drugs and health and wellness, beauty, personal care, and other consumer products outside the United States; and operates pharmacy-led health and beauty retail businesses under the Boots brand stores in the United Kingdom, the Republic of Ireland, and Thailand, as well as the Benavides brand in Mexico and the Ahumada brand in Chile. The U.S. Healthcare segment provides VillageMD, a national provider of value-based care with primary, multi-specialty, and urgent care providers serving patients in traditional clinic settings, in patients' homes and online appointments; Shields, a specialty pharmacy integrator and accelerator for hospitals; and CareCentrix, a participant in the post-acute and home care management sectors. Walgreens Boots Alliance, Inc. was founded in 1909 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"UnitedHealth Group Incorporated","Symbol":"UNH","Current Price":"503.88","Latest MA":"552.83","Price Target":636.04694,"Difference from MA":"-8.85%","Difference from Open":"-0.59%","Change from Yesterday":"-1.20%","Change from Last Report":"-1.20","Latest Volume":"1,051,432","Market Cap":"463,712,714,752","Earning Date":"2025-01-10","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":16.85818,"ROE":0.15252,"DTE":74.683,"Industry":"Healthcare Plans","Sector":"Healthcare","Beta":0.591,"Trailing PEG":1.4103,"Trailing PE":32.719482,"Trailing PS":1.1772406,"Quick Ratio":0.833,"Day High":507.0,"Day Low":500.66,"VS Average Volume":0.2366591782,"Company Summary":"UnitedHealth Group Incorporated operates as a diversified health care company in the United States. The company operates through four segments: UnitedHealthcare, Optum Health, Optum Insight, and Optum Rx. The UnitedHealthcare segment offers consumer-oriented health benefit plans and services for national employers, public sector employers, mid-sized employers, small businesses, and individuals; health care coverage, and health and well-being services to individuals age 50 and older addressing their needs; Medicaid plans, children's health insurance and health care programs; and health and dental benefits, and hospital and clinical services, as well as health care benefits products and services to state programs caring for the economically disadvantaged, medically underserved, and those without the benefit of employer-funded health care coverage. The Optum Health segment provides care delivery, care management, wellness and consumer engagement, and health financial services patients, consumers, care delivery systems, providers, employers, payers, and public-sector entities. The Optum Insight segment offers software and information products, advisory consulting arrangements, and managed services outsourcing contracts to hospital systems, physicians, health plans, governments, life sciences companies, and other organizations. The Optum Rx segment provides pharmacy care services and programs, including retail network contracting, home delivery, specialty and community health pharmacy services, infusion, and purchasing and clinical capabilities, as well as develops programs in the areas of step therapy, formulary management, drug adherence, and disease\/drug therapy management. UnitedHealth Group Incorporated was founded in 1974 and is based in Minnetonka, Minnesota.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"30-12-2024 17:57:55"},{"Company Name":"Citigroup, Inc.","Symbol":"C","Current Price":"70.33","Latest MA":"63.47","Price Target":80.24789,"Difference from MA":"10.82%","Difference from Open":"0.22%","Change from Yesterday":"-0.93%","Change from Last Report":"-0.94","Latest Volume":"1,741,292","Market Cap":"133,021,769,728","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":9.664056,"ROE":0.03874,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.426,"Trailing PEG":0.7067,"Trailing PE":20.038462,"Trailing PS":1.9192846,"Quick Ratio":"N\/A","Day High":70.5,"Day Low":69.795,"VS Average Volume":0.1289877074,"Company Summary":"Citigroup Inc., a diversified financial service holding company, provides various financial product and services to consumers, corporations, governments, and institutions worldwide. It operates through five segments: Services, Markets, Banking, U.S. Personal Banking, and Wealth. The Services segment includes Treasury and Trade Solutions, which provides cash management, trade, and working capital solutions to multinational corporations, financial institutions, and public sector organizations; and Securities Services, such as cross-border support for clients, local market expertise, post-trade technologies, data solutions, and various securities services solutions. The Markets segment offers sales and trading services for equities, foreign exchange, rates, spread products, and commodities to corporate, institutional, and public sector clients; and market-making services, including asset classes, risk management solutions, financing, prime brokerage, research, securities clearing, and settlement. The banking segment includes investment banking; advisory services related to mergers and acquisitions, divestitures, restructurings, and corporate defense activities; and corporate lending, which includes corporate and commercial banking. The U.S. Personal Banking segment provides co-branded cards and retail banking services. The Wealth segment provides financial services to high-net-worth clients through banking, lending, mortgages, investment, custody, and trust product offerings; and to professional industries, including law firms, consulting groups, accounting, and asset management. The company was founded in 1812 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-12-2024 17:57:55"}]