[{"Company Name":"Schlumberger N.V.","Symbol":"SLB","Current Price":"41.85","Latest MA":"42.82","Price Target":53.72767,"Difference from MA":"-2.26%","Difference from Open":"3.47%","Change from Yesterday":"1.86%","Change from Last Report":"1.86","Latest Volume":"1,437,789","Market Cap":"59,105,538,048","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":12.220473,"PB Ratio":2.7476532,"ROE":0.21722999,"DTE":57.141,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.532,"Trailing PEG":1.8117,"Trailing PE":13.4581995,"Trailing PS":1.6420485,"Quick Ratio":1.003,"Day High":42.0,"Day Low":41.855,"VS Average Volume":0.118309814,"Company Summary":"Schlumberger Limited engages in the provision of technology for the energy industry worldwide. The company operates through four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company provides field development and hydrocarbon production, carbon management, and integration of adjacent energy systems; reservoir interpretation and data processing services for exploration data; and well construction and production improvement services and products. It also offers subsurface geology and fluids evaluation information; open and cased hole services; exploration and production pressure, and flow-rate measurement services; and pressure pumping, well stimulation, and coiled tubing equipment solutions. In addition, the company offers mud logging, directional drilling, measurement-while-drilling, and logging-while-drilling services, as well as engineering support services; supplies drilling fluid systems; designs, manufactures, and markets roller cone and fixed cutter drill bits; bottom-hole-assembly and borehole enlargement technologies; well cementing products and services; well planning, well drilling, engineering, supervision, logistics, procurement, and contracting of third parties, as well as drilling rig management solutions; and drilling equipment and services, as well as land drilling rigs and related services. Further, it provides artificial lift production equipment and optimization services; supplies packers, safety valves, sand control technology, and various intelligent well completions technology and equipment; designs and manufactures valves, chokes, actuators, and surface trees; and OneSubsea, an integrated solutions, products, systems, and services, including wellheads, subsea trees, manifolds and flowline connectors, control systems, connectors, and services. The company was formerly known as Socie´te´ de Prospection E´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"17-01-2025 16:30:12"},{"Company Name":"Truist Financial Corporation","Symbol":"TFC","Current Price":"46.55","Latest MA":"42.55","Price Target":50.033,"Difference from MA":"9.39%","Difference from Open":"3.58%","Change from Yesterday":"3.49%","Change from Last Report":"3.49","Latest Volume":"1,072,983","Market Cap":"61,796,052,992","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":10.224208,"PB Ratio":1.046985,"ROE":-0.09505,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.035,"Trailing PEG":1.9441,"Trailing PE":"N\/A","Trailing PS":4.2626786,"Quick Ratio":"N\/A","Day High":46.55,"Day Low":46.55,"VS Average Volume":0.1392554479,"Company Summary":"Truist Financial Corporation, a financial services company, provides banking and trust services in the Southeastern and Mid-Atlantic United States. The company operates through three segments: Consumer Banking and Wealth, Corporate and Commercial Banking, and Insurance Holdings.Its deposit products include noninterest-bearing checking, interest-bearing checking, savings, and money market deposit accounts, as well as certificates of deposit and individual retirement accounts. The company also provides funding; asset management; automobile lending; credit card lending; consumer finance; home equity and mortgage lending; other direct retail lending; insurance; investment brokerage; mobile\/online banking; payment solutions; point-of-sale lending; retail and small business deposit products; small business lending; and wealth management\/private banking services. In addition, it offers asset based lending, investment banking and capital market, institutional trust, insurance premium finance, derivatives, commercial lending, international banking, leasing, merchant, commercial deposit and treasury, floor plan, mortgage warehouse lending, real estate lending, and supply chain financing services. Further, the company provides insurance brokerage, retail and wholesale brokerage, securities underwriting and market making, loan syndication, and investment management and advisory services. The company was formerly known as BB&T Corporation and changed its name to Truist Financial Corporation in December 2019. Truist Financial Corporation was founded in 1872 and is headquartered in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"17-01-2025 16:30:12"},{"Company Name":"Concentrix Corporation","Symbol":"CNXC","Current Price":"48.78","Latest MA":"55.00","Price Target":68.83333,"Difference from MA":"-11.30%","Difference from Open":"3.88%","Change from Yesterday":"1.46%","Change from Last Report":"0.00","Latest Volume":"1,996,913","Market Cap":"3,133,529,600","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":3.834152,"PB Ratio":0.75349873,"ROE":0.05799,"DTE":139.233,"Industry":"Information Technology Services","Sector":"Technology","Beta":0.674,"Trailing PEG":0.3775,"Trailing PE":13.148248,"Trailing PS":0.33329615,"Quick Ratio":1.204,"Day High":50.2,"Day Low":45.7,"VS Average Volume":2.8168939182,"Company Summary":"Concentrix Corporation engages in the provision of technology-infused customer experience (CX) solutions worldwide. The company provides CX process optimization, technology innovation, front- and back-office automation, analytics, and business transformation services, across various channels of communication, such as voice, chat, email, social media, asynchronous messaging, and custom applications. It also offers customer lifecycle management; customer experience\/user experience strategy and design; analytics and actionable insights; digital transformation services that design and engineer CX solutions to enable efficient customer self-service and build customer loyalty; customer engagement solutions and services that address the entirety of the customer lifecycle; AI technology that can intelligently act on customer intent to improve customer experience with non-human engagement; voice of the customer and analytics solutions to gather and analyze customer feedback to foster loyalty to, and growth with, clients; analytics and consulting solutions that synthesize data and provide professional insight to improve clients' customer experience strategies; vertical business process outsourcing (BPO) services; and back office BPO services that support clients in non-customer facing areas. The company's clients include technology and consumer electronics, retail, travel and e-commerce, communications and media, banking, financial services and insurance, healthcare, and others, as well as global IPOs, social brands, and banks. Concentrix Corporation was founded in 2004 and is based in Newark, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"17-01-2025 16:30:12"},{"Company Name":"JP Morgan Chase & Co.","Symbol":"JPM","Current Price":"254.16","Latest MA":"219.91","Price Target":262.4343,"Difference from MA":"15.57%","Difference from Open":"0.06%","Change from Yesterday":"-0.20%","Change from Last Report":"-0.04","Latest Volume":"1,834,563","Market Cap":"711,030,996,992","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.202556,"PB Ratio":2.2071862,"ROE":0.16216,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.091,"Trailing PEG":4.9626,"Trailing PE":12.862222,"Trailing PS":4.3850737,"Quick Ratio":"N\/A","Day High":254.1575,"Day Low":254.1575,"VS Average Volume":0.2027506164,"Company Summary":"JPMorgan Chase & Co. operates as a financial services company worldwide. It operates through three segments: Consumer & Community Banking, Commercial & Investment Bank, and Asset & Wealth Management. It offers deposit, investment and lending products, cash management, and payments and services; mortgage origination and servicing activities; residential mortgages and home equity loans; and credit cards, auto loans, leases, and travel services to consumers and small businesses through bank branches, ATMs, and digital and telephone banking. The company also provides investment banking products and services, including corporate strategy and structure advisory, and equity and debt market capital-raising services, as well as loan origination and syndication; payments; and cash and derivative instruments, risk management solutions, prime brokerage, and research, as well as offers securities services, including custody, fund accounting and administration, and securities lending products for asset managers, insurance companies, and public and private investment funds. In addition, it provides financial solutions, including lending, payments, investment banking, and asset management to small and midsized companies, local governments, nonprofit clients, and large corporations, as well as investors, developers, and owners of multifamily, office, retail, industrial, and affordable housing properties. Further, the company offers multi-asset investment management solutions in equities, fixed income, alternatives, and money market funds to institutional clients and retail investors; and retirement products and services, brokerage, custody, estate planning, lending, deposits, and investment management products to high net worth clients. JPMorgan Chase & Co. was founded in 1799 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"17-01-2025 16:30:12"}]