[{"Company Name":"FirstEnergy Corp.","Symbol":"FE","Current Price":"40.15","Latest MA":"41.32","Price Target":46.21467,"Difference from MA":"-2.82%","Difference from Open":"-0.47%","Change from Yesterday":"-0.17%","Change from Last Report":"-0.07","Latest Volume":"661,144","Market Cap":"23,139,127,296","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":13.917728,"PB Ratio":1.8619859,"Previous Close":40.22,"ROE":0.083050005,"DTE":173.13,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.495,"Trailing PEG":1.2139,"Trailing PE":25.903227,"Trailing PS":1.7454271,"Quick Ratio":0.406,"Day High":40.385,"Day Low":40.12,"VS Average Volume":0.2203703148,"Company Summary":"FirstEnergy Corp., through its subsidiaries, generates, transmits, and distributes electricity in the United States. It operates through Regulated Distribution and Regulated Transmission segments. The company owns and operates coal-fired, nuclear, hydroelectric, wind, and solar power generating facilities. It operates 24,080 circuit miles of overhead and underground transmission lines; and electric distribution systems, including 274,518 miles of overhead pole line and underground conduit carrying primary, secondary, and street lighting circuits. The company serves approximately 6 million customers in Ohio, Pennsylvania, West Virginia, Maryland, New Jersey, and New York. FirstEnergy Corp. was incorporated in 1996 and is headquartered in Akron, Ohio.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-02-2025 16:52:36"},{"Company Name":"Cloudflare, Inc.","Symbol":"NET","Current Price":"142.66","Latest MA":"94.77","Price Target":115.04138,"Difference from MA":"50.54%","Difference from Open":"-0.19%","Change from Yesterday":"-1.13%","Change from Last Report":"-0.06","Latest Volume":"638,072","Market Cap":"48,961,765,376","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":167.06676,"PB Ratio":50.287273,"Previous Close":144.29,"ROE":-0.1122,"DTE":149.085,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.097,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":31.143131,"Quick Ratio":3.258,"Day High":144.0,"Day Low":141.2,"VS Average Volume":0.2032519833,"Company Summary":"Cloudflare, Inc. operates as a cloud services provider that delivers a range of services to businesses worldwide. The company provides an integrated cloud-based security solution to secure a range of combination of platforms, including public cloud, private cloud, on-premise, software-as-a-service applications, and IoT devices; and website and application security products comprising web application firewall, bot management, distributed denial of service, API gateways, SSL\/TLS encryption, script management, security center, and rate limiting products. It offers website and application performance solutions, including content delivery, load balancing, DNS, agro smart routing, video stream delivery, web optimization, cache reserve, cloudfare waiting room, and cloudfare data localization suite; SASE platform through cloudfare one that provides a cloud-based network-as-a-service; network services which deliver network connectivity, security, and performance, including magic WAN, magic transit, magic firewall, cloudflare network interconnect, and spectrum. In addition, the company provides zero trust services, such as cloudflare access, cloudflare gateway, remote browser isolation, cloud access security broker, cloud email security, and data loss prevention products that protects, inspects, and provides privilege rules to grant access to data and application. Further, it provides developer-based solutions consisting of cloudflare workers, R2 object storage, workers KV, durable objects, cloudfare pages, cloudfare stream, and cloudfare images; and consumer products comprising of 1.1.1.1, a DNS resolver, WARP, a virtual private network, and cloudfare registrar that secures registration and management of domain names. The company serves customers in the technology, healthcare, financial services, consumer and retail, industrial, and non-profit industries, as well as government. Cloudflare, Inc. was incorporated in 2009 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 16:52:36"},{"Company Name":"Warner Music Group Corp.","Symbol":"WMG","Current Price":"31.51","Latest MA":"30.65","Price Target":35.5555,"Difference from MA":"2.81%","Difference from Open":"1.32%","Change from Yesterday":"-1.84%","Change from Last Report":"0.80","Latest Volume":"840,513","Market Cap":"16,375,148,544","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":20.39733,"PB Ratio":33.772774,"Previous Close":32.1,"ROE":1.25054,"DTE":669.764,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.365,"Trailing PEG":1.2845,"Trailing PE":37.963856,"Trailing PS":2.5658333,"Quick Ratio":0.512,"Day High":31.51,"Day Low":29.9135,"VS Average Volume":0.491347622,"Company Summary":"Warner Music Group Corp. operates as a music entertainment company in the United States, the United Kingdom, Germany, and internationally. It operates through Recorded Music and Music Publishing segments. The Recorded Music segment is involved in the discovery and development of recording artists, as well as related marketing, promotion, distribution, sale, and licensing of music created by such recording artists; markets its music catalog through compilations and reissuances of previously released music and video titles, as well as previously unreleased materials; and conducts its operation primarily through a collection of record labels, such as Warner Records and Atlantic Records, as well as Asylum, Big Beat, Canvasback, East West, Erato, FFRR, Fueled by Ramen, Nonesuch, Parlophone, Reprise, Roadrunner, Sire, Spinnin' Records, Warner Classics, and Warner Music Nashville. This segment markets, distributes, and sells music and video products to retailers and wholesale distributors; independent labels to retail and wholesale distributors; and various distribution centers and ventures, as well as retail outlets, online physical retailers, streaming services, and download services. The Music Publishing segment owns and acquires rights to approximately one million musical compositions comprising pop hits, American standards, folk songs, and motion picture and theatrical compositions. Its catalog includes approximately 150,000 songwriters and composers; and various genres, including pop, rock, jazz, classical, country, R&B, hip-hop, rap, reggae, Latin, folk, blues, symphonic, soul, Broadway, electronic, alternative, and gospel. This segment also administers the music and soundtracks of various third-party television and film producers and studios. The company was founded in 1929 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 16:52:36"},{"Company Name":"Eli Lilly and Company","Symbol":"LLY","Current Price":"863.90","Latest MA":"849.57","Price Target":975.08575,"Difference from MA":"1.69%","Difference from Open":"2.90%","Change from Yesterday":"2.58%","Change from Last Report":"-0.00","Latest Volume":"1,117,589","Market Cap":"776,919,056,384","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":29.514206,"PB Ratio":54.59084,"Previous Close":842.18,"ROE":0.65318,"DTE":218.081,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.43,"Trailing PEG":0.7971,"Trailing PE":93.29374,"Trailing PS":19.012636,"Quick Ratio":0.63,"Day High":866.99,"Day Low":835.97,"VS Average Volume":0.2861137708,"Company Summary":"Eli Lilly and Company discovers, develops, and markets human pharmaceuticals worldwide. The company offers Basaglar, Humalog, Humalog Mix 75\/25, Humalog U-100, Humalog U-200, Humalog Mix 50\/50, insulin lispro, insulin lispro protamine, insulin lispro mix 75\/25, Humulin, Humulin 70\/30, Humulin N, Humulin R, and Humulin U-500 for diabetes; Jardiance, Mounjaro, and Trulicity for type 2 diabetes; and Zepbound for obesity. It provides oncology products, including Alimta, Cyramza, Erbitux, Jaypirca, Retevmo, Tyvyt, and Verzenio. In addition, the company offers Olumiant for rheumatoid arthritis, atopic dermatitis, severe alopecia areata, and COVID-19; Taltz for plaque psoriasis, psoriatic arthritis, ankylosing spondylitis, and non-radiographic axial spondylarthritis; Omvoh for ulcerative colitis; Cymbalta for depressive disorder, diabetic peripheral neuropathic pain, generalized anxiety disorder, fibromyalgia, and chronic musculoskeletal pain; Ebglyss for severe atopic dermatitis; and Emgality for migraine prevention and episodic cluster headache. Further, it provides Cialis for erectile dysfunction and benign prostatic hyperplasia; and Forteo for osteoporosis. It operates Lilly Seaport Innovation Center (LSC), a research and development facility in the Boston Seaport to advancing Lilly's efforts in RNA and DNA-based therapies as well as discovering new drug targets to create life-changing medicines across several disease states, including diabetes, obesity, cardiovascular diseases, neurodegeneration, and chronic pain. It has collaborations with Incyte Corporation; Boehringer Ingelheim Pharmaceuticals, Inc.; F. Hoffmann-La Roche Ltd and Genentech, Inc.; Biologics, Inc., AbCellera Biologics Inc.; Verge Genomics; and Chugai Pharmaceutical Co., Ltd, as well as development collaboration with Eli Lilly and Company for developing QIAstat-Dx IVD panel, for the detection of various APOE genotypes. The company was founded in 1876 and is headquartered in Indianapolis, Indiana.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 16:52:36"},{"Company Name":"Gates Industrial Corporation pl","Symbol":"GTES","Current Price":"21.95","Latest MA":"18.95","Price Target":24.45455,"Difference from MA":"15.84%","Difference from Open":"4.62%","Change from Yesterday":"5.68%","Change from Last Report":"-0.14","Latest Volume":"495,141","Market Cap":"5,591,060,480","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":12.744734,"PB Ratio":1.7974125,"Previous Close":20.77,"ROE":0.063379996,"DTE":72.92,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":1.387,"Trailing PEG":null,"Trailing PE":26.445786,"Trailing PS":1.6294767,"Quick Ratio":1.844,"Day High":22.125,"Day Low":20.89,"VS Average Volume":0.2095765727,"Company Summary":"Gates Industrial Corporation plc manufactures and sells engineered power transmission and fluid power solutions worldwide. It operates in two segments, Power Transmission and Fluid Power. The company offers synchronous or asynchronous belts, including V-belts, CVT belts, and Micro-V belts, as well as related components, such as sprockets, pulleys, water pumps, tensioners, and other accessories; solutions for stationary and mobile drives, engine systems, and personal mobility application platforms; metal drive components; and kits for automotive replacement channels. It also provides fluid power solutions comprising stationary hydraulics, mobile hydraulics, vehicle systems, and other industrial application platforms; and hydraulics, including hoses, tubing, coupling, and fittings, as well as assemblies. The company's products are used in applications across various markets, including industrial off-highway, such as construction and agriculture; first-fit end markets; industrial on-highway commercial vehicles comprising heavy-duty trucks and buses, energy and resources, automotive, and personal mobility; and various industrial applications, such as automated manufacturing and logistics systems. It sells its products under the Gates brand. It offers its products to replacement channel customers, as well as to original equipment manufacturers. The company was founded in 1911 and is headquartered in Denver, Colorado.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 16:52:36"},{"Company Name":"Linde plc","Symbol":"LIN","Current Price":"454.54","Latest MA":"451.52","Price Target":491.0177,"Difference from MA":"0.67%","Difference from Open":"1.01%","Change from Yesterday":"0.19%","Change from Last Report":"-0.13","Latest Volume":"232,196","Market Cap":"216,432,869,376","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":27.065231,"PB Ratio":5.5250463,"Previous Close":453.7,"ROE":0.1619,"DTE":54.828,"Industry":"Specialty Chemicals","Sector":"Basic Materials","Beta":0.949,"Trailing PEG":2.5598,"Trailing PE":34.43485,"Trailing PS":6.553607,"Quick Ratio":0.734,"Day High":456.99,"Day Low":450.01,"VS Average Volume":0.1014421016,"Company Summary":"Linde plc operates as an industrial gas company in the Americas, Europe, the Middle East, Africa, Asia, and South Pacific. It offers atmospheric gases, including oxygen, nitrogen, argon, and rare gases; and process gases, such as carbon dioxide, helium, hydrogen, electronic gases, specialty gases, and acetylene. The company also designs and constructs turnkey process plants for third-party customers, as well as for the gas businesses in various locations, such as air separation, hydrogen, synthesis, olefin, and natural gas plants. It serves a range of industries, including healthcare, chemicals and energy, manufacturing, metals and mining, food and beverage, and electronics. The company was founded in 1879 and is based in Woking, the United Kingdom.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 16:52:36"},{"Company Name":"nVent Electric plc","Symbol":"NVT","Current Price":"63.10","Latest MA":"70.58","Price Target":81.8,"Difference from MA":"-10.59%","Difference from Open":"-0.81%","Change from Yesterday":"-0.75%","Change from Last Report":"-0.31","Latest Volume":"681,060","Market Cap":"10,400,713,728","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":18.995287,"PB Ratio":3.1674445,"Previous Close":63.58,"ROE":0.18530001,"DTE":72.196,"Industry":"Electrical Equipment & Parts","Sector":"Industrials","Beta":1.25,"Trailing PEG":null,"Trailing PE":18.397959,"Trailing PS":2.938802,"Quick Ratio":0.917,"Day High":64.88,"Day Low":62.63,"VS Average Volume":0.4029664236,"Company Summary":"nVent Electric plc, together with its subsidiaries, designs, manufactures, markets, installs, and services electrical connection and protection solutions in North America, Europe, the Middle East, Africa, the Asia Pacific, and internationally. The company operates through three segments: Enclosures, Electrical & Fastening Solutions, and Thermal Management. The Enclosures segment provides solutions to protect electronics and data in mission critical applications, including data solutions. This segment also offers digital and automation solutions, system integrations, and global services. The Electrical & Fastening Solutions segment provides solutions that connect and protect power and data infrastructure. This segment also offers power connections, fastening solutions, cable management solutions, grounding and bonding systems, and tools and test instruments. The Thermal Management segment offers heat management solutions that protect people and assets. This segment includes heat tracing for freeze protection and process temperature maintenance and control; pipe freeze protection, surface deicing, hot water temperature maintenance, floor heating, fire-rated wiring, and leak detection; and heat trace systems, connected controls, remote monitoring, and annual service programs. The company markets its products through electrical distributors, contractors, and original equipment manufacturers under the CADDY, ERICO, GARDNER BENDER, HOFFMAN, ILSCO, RAYCHEM, SCHROFF, and TRACER brand names. Its products are used for various applications, such as industrial, commercial and residential, infrastructure, and energy. nVent Electric plc was founded in 1903 and is based in London, the United Kingdom.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-02-2025 16:52:36"},{"Company Name":"Roblox Corporation","Symbol":"RBLX","Current Price":"63.17","Latest MA":"49.32","Price Target":62.75,"Difference from MA":"28.08%","Difference from Open":"5.05%","Change from Yesterday":"-16.30%","Change from Last Report":"-0.13","Latest Volume":"16,495,078","Market Cap":"41,453,801,472","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":-46.788586,"PB Ratio":218.582,"Previous Close":75.47,"ROE":-7.00543,"DTE":985.81,"Industry":"Electronic Gaming & Multimedia","Sector":"Communication Services","Beta":1.561,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":12.323742,"Quick Ratio":0.792,"Day High":65.825,"Day Low":60.11,"VS Average Volume":2.1723306568,"Company Summary":"Roblox Corporation develops and operates an online entertainment platform in the United States and internationally. It offers Roblox Studio, a free toolset that allows developers and creators to build, publish, and operate 3D experiences, and other content; Roblox Client, an application that allows users to explore 3D experience; and Roblox Cloud, which provides services and infrastructure that power the platform. Roblox Corporation was incorporated in 2004 and is headquartered in San Mateo, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 16:52:36"},{"Company Name":"Rithm Capital Corp.","Symbol":"RITM","Current Price":"11.89","Latest MA":"10.82","Price Target":13.09091,"Difference from MA":"9.94%","Difference from Open":"1.93%","Change from Yesterday":"3.52%","Change from Last Report":"0.76","Latest Volume":"1,231,256","Market Cap":"6,182,212,608","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":5.7565556,"PB Ratio":0.9660522,"Previous Close":11.49,"ROE":0.07756,"DTE":389.996,"Industry":"REIT - Mortgage","Sector":"Real Estate","Beta":1.788,"Trailing PEG":null,"Trailing PE":12.137755,"Trailing PS":2.0563123,"Quick Ratio":0.722,"Day High":11.97,"Day Low":11.665,"VS Average Volume":0.345471906,"Company Summary":"Rithm Capital Corp. operates as an asset manager focused on real estate, credit, and financial services. It operates through Origination and Servicing, Investment Portfolio, Mortgage Loans Receivable, and Asset Management segments. Its investment portfolio primarily comprises of mortgage servicing rights (MSR), and MSR financing receivables, title, appraisal and property preservation, excess MSRs, and services advance investments; real estate securities, call rights, SFR properties, and residential mortgage loans; consumer and business purpose loans; and asset management related investments. The company qualifies as a real estate investment trust for federal income tax purposes. It generally would not be subject to federal corporate income taxes if it distributes at least 90% of its taxable income to its stockholders. The company was formerly known as New Residential Investment Corp. and changed its name to Rithm Capital Corp. in August 2022. Rithm Capital Corp. was incorporated in 2011 and is based in New York, New York.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"06-02-2025 16:52:36"},{"Company Name":"Tapestry, Inc.","Symbol":"TPR","Current Price":"85.21","Latest MA":"51.50","Price Target":73.042,"Difference from MA":"65.46%","Difference from Open":"-2.89%","Change from Yesterday":"16.08%","Change from Last Report":"0.53","Latest Volume":"3,552,675","Market Cap":"19,856,996,352","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.562162,"PB Ratio":6.6580715,"Previous Close":73.38,"ROE":0.29924,"DTE":295.298,"Industry":"Luxury Goods","Sector":"Consumer Cyclical","Beta":1.556,"Trailing PEG":2.2903,"Trailing PE":24.69855,"Trailing PS":2.9790707,"Quick Ratio":4.233,"Day High":87.8749,"Day Low":84.26,"VS Average Volume":0.7290984293,"Company Summary":"Tapestry, Inc. provides luxury accessories and branded lifestyle products in North America, Greater China, rest of Asia, and internationally. The company operates in three segments: Coach, Kate Spade, and Stuart Weitzman. It offers women's handbags; and women's accessories, such as small leather goods which includes mini and micro handbags, money pieces, wristlets, pouches, and cosmetic cases, as well as novelty accessories including address books, time management and travel accessories, sketchbooks, and portfolios; and belts, key rings, and charms. The company also provides men products, which includes bag collections, such as business cases, computer bags, messenger-style bags, backpacks, and totes; small leather goods including wallets, card cases, travel organizers, and belts; and footwear, watches, fragrances, sunglasses, novelty accessories, and ready-to-wear items. In addition, it offers other products including women's footwear and fragrances; eyewear and sunglasses; and jewelry, such as bracelets, necklaces, rings, and earrings, watches, and other women's seasonal lifestyle apparel collections, including outerwear, ready-to-wear and cold weather accessories, such as gloves, scarves, and hats. Further, the company provides kids items, housewares, and home accessories, such as fashion bedding and tableware, stationery, and gifts. It offers its products through retail and outlet stores, brand e-commerce sites, and concession shop-in-shops, wholesale, and third-party distributors under the Coach, Kate Spade, and Stuart Weitzman brand names. The company was formerly known as Coach, Inc. and changed its name to Tapestry, Inc. in October 2017. Tapestry, Inc. was founded in 1941 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 16:52:36"},{"Company Name":"Kenvue Inc.","Symbol":"KVUE","Current Price":"20.34","Latest MA":"21.49","Price Target":24.43667,"Difference from MA":"-5.35%","Difference from Open":"-0.95%","Change from Yesterday":"-1.93%","Change from Last Report":"-0.15","Latest Volume":"2,404,312","Market Cap":"38,997,069,824","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":15.794868,"PB Ratio":3.6615663,"Previous Close":20.74,"ROE":0.098809995,"DTE":82.929,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":"N\/A","Trailing PEG":1.9259,"Trailing PE":36.98182,"Trailing PS":2.5226126,"Quick Ratio":0.58,"Day High":21.1,"Day Low":20.31,"VS Average Volume":0.1904688721,"Company Summary":"Kenvue Inc. operates as a consumer health company worldwide. The company operates through three segments: Self Care, Skin Health and Beauty, and Essential Health. The Self Care segment offers cough, cold and allergy, pain care, digestive health, smoking cessation, eye care, and other products under the Tylenol, Motrin, Benadryl, Nicorette, Zarbee's, ORSLTM, Rhinocort, Calpol, and Zyrtec brands. The Skin Health and Beauty segment provides face and body care, hair, sun, and other care products under the Neutrogena, Aveeno, Dr.Ci:Labo, Le Petit Marseillais, Lubriderm, Rogaine, and OGX brand names. The Essential Health segment offers oral and baby, women's health, wound, and other care products under the Listerine, Johnson's, Band-Aid, and Stayfree, o.b., tampons, Carefree, and Desitin Diaper Rash brands. The company was incorporated in 2022 and is headquartered in Skillman, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-02-2025 16:52:36"},{"Company Name":"Affirm Holdings, Inc.","Symbol":"AFRM","Current Price":"62.79","Latest MA":"46.94","Price Target":66.05789,"Difference from MA":"33.77%","Difference from Open":"-0.33%","Change from Yesterday":"-0.02%","Change from Last Report":"-0.24","Latest Volume":"942,677","Market Cap":"19,498,178,560","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":-302.60242,"PB Ratio":6.9527183,"Previous Close":62.8,"ROE":-0.16519,"DTE":251.092,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":3.477,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":7.722262,"Quick Ratio":12.914,"Day High":63.3599,"Day Low":62.0,"VS Average Volume":0.1158527323,"Company Summary":"Affirm Holdings, Inc. operates payment network in the United States, Canada, and internationally. The company's platform includes point-of-sale payment solution for consumers, merchant commerce solutions, and a consumer-focused app. Its commerce platform, agreements with originating banks, and capital markets partners enables consumers to pay for a purchase over time. The company has active merchants covering small businesses, large enterprises, direct-to-consumer brands, brick-and-mortar stores, and companies with an omni-channel presence. Its merchants represent a range of industries, including sporting goods and outdoors, home and lifestyle, travel and ticketing, electronics, fashion and beauty, equipment and auto, and general merchandise. Affirm Holdings, Inc. was founded in 2012 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 16:52:36"},{"Company Name":"Bristol-Myers Squibb Company","Symbol":"BMY","Current Price":"58.47","Latest MA":"51.85","Price Target":61.72,"Difference from MA":"12.78%","Difference from Open":"1.92%","Change from Yesterday":"-2.07%","Change from Last Report":"-0.62","Latest Volume":"5,563,256","Market Cap":"118,593,159,168","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":8.294917,"PB Ratio":6.91739,"Previous Close":59.71,"ROE":-0.3133,"DTE":299.052,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.441,"Trailing PEG":2.0894,"Trailing PE":"N\/A","Trailing PS":2.5001192,"Quick Ratio":1.016,"Day High":59.07,"Day Low":56.91,"VS Average Volume":0.507058526,"Company Summary":"Bristol-Myers Squibb Company discovers, develops, licenses, manufactures, markets, distributes, and sells biopharmaceutical products worldwide. It offers products for hematology, oncology, cardiovascular, immunology, fibrotic, and neuroscience diseases. The company's products include Eliquis for reduction in risk of stroke\/systemic embolism in non-valvular atrial fibrillation, and for the treatment of DVT\/PE; Opdivo for various anti-cancer indications, including bladder, blood, CRC, head and neck, RCC, HCC, lung, melanoma, MPM, stomach and esophageal cancer; Pomalyst\/Imnovid for multiple myeloma; Orencia for active rheumatoid arthritis and psoriatic arthritis; and Sprycel for the treatment of Philadelphia chromosome-positive chronic myeloid leukemia. It also provides Yervoy for the treatment of patients with unresectable or metastatic melanoma; Empliciti for the treatment of multiple myeloma; Abecma for the treatment of relapsed or refractory multiple myeloma; Reblozyl for the treatment of anemia; Opdualag for the treatment of unresectable or metastatic melanoma; and Zeposia to treat relapsing forms of multiple sclerosis. In addition, the company offers Breyanzi for the treatment of relapsed or refractory large B-cell lymphoma; Onureg for the treatment of AML; Inrebic for the treatment of myelofibrosis; Camzyos for the treatment of symptomatic obstructive HCM to enhance functional capacity and symptom; Sotyktu for the treatment of moderate-to-severe plaque psoriasis; Augtyro for the treatment of locally advanced or metastatic ROS1-positive NSCLC; Revlimid, an oral immunomodulatory drug for the treatment of multiple myeloma; and Abraxane to treat breast cancer, NSCLC and pancreatic cancer. It sells products to wholesalers, distributors, pharmacies, retailers, hospitals, clinics, and government agencies. The company was formerly known as Bristol-Myers Company. Bristol-Myers Squibb Company was founded in 1887 and is headquartered in Princeton, New Jersey.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"06-02-2025 16:52:36"},{"Company Name":"BorgWarner Inc.","Symbol":"BWA","Current Price":"31.69","Latest MA":"33.18","Price Target":39.41765,"Difference from MA":"-4.50%","Difference from Open":"-0.53%","Change from Yesterday":"1.60%","Change from Last Report":"-0.46","Latest Volume":"552,442","Market Cap":"6,930,603,008","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":6.3067694,"PB Ratio":1.1258348,"Previous Close":31.17,"ROE":0.15923999,"DTE":74.606,"Industry":"Auto Parts","Sector":"Consumer Cyclical","Beta":1.186,"Trailing PEG":1.2103,"Trailing PE":7.8440595,"Trailing PS":0.48913848,"Quick Ratio":1.407,"Day High":32.98,"Day Low":31.5,"VS Average Volume":0.2425001427,"Company Summary":"BorgWarner Inc., together with its subsidiaries, provides solutions for combustion, hybrid, and electric vehicles worldwide. It offers turbochargers, eBoosters, eTurbos, timing systems, emissions systems, thermal systems, gasoline ignition technology, smart remote actuators, powertrain sensors, cabin heaters, battery modules and systems, battery heaters, and battery charging. The company provides power electronics, control modules, software, friction, and mechanical products for automatic transmissions and torque-management products. It sells its products to original equipment manufacturers of light vehicles, which comprise passenger cars, sport-utility vehicles, vans, and light trucks; commercial vehicles, including medium-duty and heavy-duty trucks, and buses; and off-highway vehicles, such as agricultural and construction machinery, and marine applications, as well as to tier one vehicle systems suppliers and the aftermarket for light, commercial, and off-highway vehicles. The company was formerly known as Borg-Warner Automotive, Inc. BorgWarner Inc. was incorporated in 1987 and is headquartered in Auburn Hills, Michigan.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-02-2025 16:52:36"},{"Company Name":"Microchip Technology Incorporat","Symbol":"MCHP","Current Price":"53.98","Latest MA":"71.86","Price Target":77.64167,"Difference from MA":"-24.88%","Difference from Open":"0.60%","Change from Yesterday":"0.90%","Change from Last Report":"0.32","Latest Volume":"879,017","Market Cap":"28,987,799,552","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":23.433193,"PB Ratio":4.618807,"Previous Close":53.5,"ROE":0.118030004,"DTE":102.895,"Industry":"Semiconductors","Sector":"Technology","Beta":1.526,"Trailing PEG":8.9386,"Trailing PE":37.48611,"Trailing PS":5.273769,"Quick Ratio":0.405,"Day High":54.0,"Day Low":53.21,"VS Average Volume":0.1022294307,"Company Summary":"Microchip Technology Incorporated engages in the development, manufacture, and sale of smart, connected, and secure embedded control solutions in the Americas, Europe, and Asia. The company offers general purpose 8-bit, 16-bit, and 32-bit mixed-signal microcontrollers; 32-bit embedded mixed-signal microprocessors; and specialized microcontrollers for automotive, industrial, computing, communications, lighting, power supplies, motor control, human machine interface, security, wired connectivity, and wireless connectivity applications. It also provides analog, interface, mixed signal, and timing products comprising power management, linear, mixed-signal, high-voltage, thermal management, discrete diodes, and metal oxide semiconductor field effect transistors (MOSFETS), radio frequency (RF), drivers, safety, security, timing, USB, Ethernet, wireless, and other interface products; field-programmable gate array (FPGA) products; and application development tools that enable system designers to program microcontroller, FPGA, and microprocessor products for specific applications. In addition, the company offers serial electrically erasable programmable read-only memory, serial flash memories, parallel flash memories, serial static random access memories, and serial electrically erasable random access memories for the production of very small footprint devices; and licenses its SuperFlash embedded flash and non-volatile memory technologies to foundries, integrated device manufacturers, and design partners for use in the manufacture of microcontroller products, gate array, RF, analog, and neuromorphic compute products that require embedded non-volatile memory, as well as provides engineering services. Further, it offers wafer foundry and assembly, and test subcontracting manufacturing services; and timing systems products, application specific integrated circuits, and aerospace products. The company was incorporated in 1989 and is headquartered in Chandler, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-02-2025 16:52:36"},{"Company Name":"Skechers U.S.A., Inc.","Symbol":"SKX","Current Price":"76.28","Latest MA":"66.41","Price Target":83.64867,"Difference from MA":"14.86%","Difference from Open":"0.61%","Change from Yesterday":"2.51%","Change from Last Report":"-0.22","Latest Volume":"279,894","Market Cap":"11,516,143,616","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":15.596311,"PB Ratio":2.6419146,"Previous Close":74.41,"ROE":0.15761,"DTE":42.625,"Industry":"Footwear & Accessories","Sector":"Consumer Cyclical","Beta":1.233,"Trailing PEG":null,"Trailing PE":18.788177,"Trailing PS":1.3209805,"Quick Ratio":1.149,"Day High":76.74,"Day Low":75.545,"VS Average Volume":0.1542145441,"Company Summary":"Skechers U.S.A., Inc. designs, develops, markets, and distributes footwear for men, women, and children worldwide. The company operates through Wholesale and Direct-to-Consumer segments. It offers footwear under Skechers Hands Free Slip-ins, Skechers Arch Fit, and Skechers Air-Cooled Memory Foam brands. In addition, the company provides men's and women's slip-resistant and safety-toe casuals, and boots for protective footwear in their work environments. It sells its products through department stores, family shoe stores, specialty running and sporting goods retailers, and big box club stores; franchisee and licensee third-party store operators; company-owned retail stores; digital commerce sites and mobile applications; and concept, factory outlet, and big box stores. The company licenses its Skechers brand. Skechers U.S.A., Inc. was incorporated in 1992 and is headquartered in Manhattan Beach, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 16:52:36"},{"Company Name":"Amazon.com, Inc.","Symbol":"AMZN","Current Price":"237.96","Latest MA":"199.25","Price Target":249.69365,"Difference from MA":"19.43%","Difference from Open":"-0.13%","Change from Yesterday":"0.76%","Change from Last Report":"0.13","Latest Volume":"5,639,332","Market Cap":"2,502,149,537,792","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":38.347866,"PB Ratio":9.651592,"Previous Close":236.17,"ROE":0.22558,"DTE":61.175,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":1.146,"Trailing PEG":1.9409,"Trailing PE":50.846157,"Trailing PS":4.034892,"Quick Ratio":0.827,"Day High":239.5,"Day Low":237.25,"VS Average Volume":0.1549161911,"Company Summary":"Amazon.com, Inc. engages in the retail sale of consumer products, advertising, and subscriptions service through online and physical stores in North America and internationally. The company operates through three segments: North America, International, and Amazon Web Services (AWS). It also manufactures and sells electronic devices, including Kindle, Fire tablets, Fire TVs, Echo, Ring, Blink, and eero; and develops and produces media content. In addition, the company offers programs that enable sellers to sell their products in its stores; and programs that allow authors, independent publishers, musicians, filmmakers, Twitch streamers, skill and app developers, and others to publish and sell content. Further, it provides compute, storage, database, analytics, machine learning, and other services, as well as advertising services through programs, such as sponsored ads, display, and video advertising. Additionally, the company offers Amazon Prime, a membership program. The company's products offered through its stores include merchandise and content purchased for resale and products offered by third-party sellers. It serves consumers, sellers, developers, enterprises, content creators, advertisers, and employees. Amazon.com, Inc. was incorporated in 1994 and is headquartered in Seattle, Washington.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"06-02-2025 16:52:36"},{"Company Name":"Skyworks Solutions, Inc.","Symbol":"SWKS","Current Price":"64.64","Latest MA":"96.17","Price Target":74.96952,"Difference from MA":"-32.78%","Difference from Open":"3.37%","Change from Yesterday":"-25.76%","Change from Last Report":"0.58","Latest Volume":"5,921,092","Market Cap":"10,391,100,416","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":14.066469,"PB Ratio":1.6302264,"Previous Close":87.08,"ROE":0.12777,"DTE":15.691,"Industry":"Semiconductors","Sector":"Technology","Beta":1.205,"Trailing PEG":1.1252,"Trailing PE":19.890768,"Trailing PS":2.376847,"Quick Ratio":3.333,"Day High":66.21,"Day Low":62.01,"VS Average Volume":2.308183066,"Company Summary":"Skyworks Solutions, Inc., together with its subsidiaries, designs, develops, manufactures, and markets proprietary semiconductor products in the United States, China, South Korea, Taiwan, Europe, the Middle East, Africa, and the rest of Asia-Pacific. Its product portfolio includes amplifiers, antenna tuners, attenuators, automotive tuners and digital radios, DC\/DC converters, demodulators, detectors, diodes, wireless analog system on chip products, directional couplers, diversity receive modules, filters, front-end modules, hybrids, light emitting diode drivers, low noise amplifiers, mixers, modulators, optocouplers\/optoisolators, phase locked loops, phase shifters, power dividers\/combiners, power over ethernet, power isolators, receivers, switches, synthesizers, timing devices, voltage controlled oscillators\/synthesizers, and voltage regulators. The company products are the used in aerospace, automotive, broadband, cellular infrastructure, connected home, defense, entertainment and gaming, industrial, medical, military, smartphone, tablet, and wearable markets. It sells its products through direct sales force, electronic component distributors, and independent sales representatives. Skyworks Solutions, Inc. was founded in 1962 and is based in Irvine, California.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"06-02-2025 16:52:36"},{"Company Name":"Cognizant Technology Solutions ","Symbol":"CTSH","Current Price":"85.85","Latest MA":"76.71","Price Target":86.35174,"Difference from MA":"11.92%","Difference from Open":"1.71%","Change from Yesterday":"2.69%","Change from Last Report":"-0.28","Latest Volume":"673,530","Market Cap":"42,566,488,064","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":16.033033,"PB Ratio":2.9464254,"Previous Close":83.6,"ROE":0.16478,"DTE":12.891,"Industry":"Information Technology Services","Sector":"Technology","Beta":1.052,"Trailing PEG":1.3946,"Trailing PE":19.035475,"Trailing PS":2.1927924,"Quick Ratio":1.839,"Day High":86.68,"Day Low":83.35,"VS Average Volume":0.2276829132,"Company Summary":"Cognizant Technology Solutions Corporation, a professional services company, provides consulting and technology, and outsourcing services in North America, Europe, and internationally. It operates through four segments: Financial Services, Health Sciences, Products and Resources, and Communications, Media and Technology. The company provides customer experience, robotic process automation, analytics, and AI services in areas, such as digital lending, fraud detection, and next generation payments; the shift towards consumerism, outcome-based contracting, digital health, delivering integrated seamless, omni-channel, and patient-centered experience; and services that drive operational improvements in areas, such as clinical development, pharmacovigilance, and manufacturing, as well as claims processing, enrollment, membership, and billing to healthcare providers and payers, and life sciences companies, including pharmaceutical, biotech, and medical device companies. It offers solution to manufacturers, automakers, retailers and travel and hospitality companies, as well as companies providing logistics, energy and utility services; and digital content, business process improvement, technology modernization, and the creation of unified and compelling user experience services to communications, media and entertainment, education, and information services and technology companies. The company was incorporated in 1988 and is headquartered in Teaneck, New Jersey.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"06-02-2025 16:52:36"},{"Company Name":"Fiserv, Inc.","Symbol":"FI","Current Price":"230.68","Latest MA":"189.16","Price Target":251.7103,"Difference from MA":"21.95%","Difference from Open":"0.51%","Change from Yesterday":"0.50%","Change from Last Report":"-0.00","Latest Volume":"187,626","Market Cap":"131,235,389,440","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":19.248549,"PB Ratio":4.738015,"Previous Close":229.53,"ROE":0.10618,"DTE":89.406,"Industry":"Information Technology Services","Sector":"Technology","Beta":0.919,"Trailing PEG":1.5442,"Trailing PE":42.95624,"Trailing PS":6.5219855,"Quick Ratio":0.215,"Day High":231.13,"Day Low":228.27,"VS Average Volume":0.0689233866,"Company Summary":"Fiserv, Inc., together with its subsidiaries, provides payments and financial services technology services in the United States, Europe, the Middle East and Africa, Latin America, the Asia-Pacific, and internationally. It operates through Merchant Acceptance, Financial Technology, and Payments and Network segments. The Merchant Acceptance segment provides merchant acquiring and digital commerce services; mobile payment services; security and fraud protection products; Clover, a cloud based POS and integrated commerce operating system for small and mid-sized businesses and independent software vendors; and Carat, an integrated operating system for large businesses. This segment distributes through various channels, including direct sales teams, strategic partnerships with agent sales forces, independent software vendors, financial institutions, and other strategic partners in the form of joint venture alliances, revenue sharing alliances, and referral agreement. The Financial Technology segment offers customer deposit and loan accounts, as well as manages an institution's general ledger and central information files. This segment also provides digital banking, financial and risk management, professional services and consulting, check processing, and other products and services. The Payments and Network segment offers card transactions, such as debit, credit, and prepaid card processing and services; funds access, debit payments, cardless ATM access, and surcharge-free ATM network; security and fraud protection products; card production; print services; and various network services, as well as non-card digital payment software and services, including bill payment, account-to-account transfers, person-to-person payments, electronic billing, and security and fraud protection products. It serves merchants, banks, credit unions, other financial institutions, and corporate clients. Fiserv, Inc. was incorporated in 1984 and is headquartered in Milwaukee, Wisconsin.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 16:52:36"},{"Company Name":"MetLife, Inc.","Symbol":"MET","Current Price":"82.33","Latest MA":"79.08","Price Target":95.14286,"Difference from MA":"4.10%","Difference from Open":"-1.12%","Change from Yesterday":"-3.15%","Change from Last Report":"0.15","Latest Volume":"765,208","Market Cap":"57,003,470,848","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":7.6821504,"PB Ratio":1.8489611,"Previous Close":85.0,"ROE":0.13260001,"DTE":151.463,"Industry":"Insurance - Life","Sector":"Financial Services","Beta":1.039,"Trailing PEG":0.1495,"Trailing PE":13.4298525,"Trailing PS":0.79899466,"Quick Ratio":1.349,"Day High":83.16,"Day Low":81.195,"VS Average Volume":0.2243322287,"Company Summary":"MetLife, Inc., a financial services company, provides insurance, annuities, employee benefits, and asset management services worldwide. It operates through six segments: Retirement and Income Solutions; Group Benefits; Asia; Latin America; Europe, the Middle East and Africa; and MetLife Holdings. The company offers life, dental, group short-and long-term disability, individual disability, pet insurance, accidental death and dismemberment, vision, and accident and health coverages, as well as prepaid legal plans; administrative services-only arrangements to employers; and general and separate account, and synthetic guaranteed interest contracts, as well as private floating rate funding agreements. It also provides pension risk transfers, institutional income annuities, structured settlements, and capital markets investment products; and other products and services, such as life insurance products and funding agreements for funding postretirement benefits, as well as company, bank, or trust-owned life insurance used to finance nonqualified benefit programs for executives. In addition, it provides fixed, indexed-linked, and variable annuities; pension products; regular savings products; whole and term life, endowments, universal and variable life, and group life products; longevity reinsurance solutions; credit insurance products; and protection against long-term health care services. MetLife, Inc. was incorporated in 1999 and is based in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 16:52:36"},{"Company Name":"Illinois Tool Works Inc.","Symbol":"ITW","Current Price":"251.96","Latest MA":"254.03","Price Target":262.4658,"Difference from MA":"-0.82%","Difference from Open":"-1.31%","Change from Yesterday":"-0.90%","Change from Last Report":"-0.19","Latest Volume":"132,422","Market Cap":"74,403,790,848","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":22.188036,"PB Ratio":21.942001,"Previous Close":254.24,"ROE":1.08036,"DTE":246.05,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":1.109,"Trailing PEG":2.9006,"Trailing PE":21.498293,"Trailing PS":4.6651073,"Quick Ratio":0.902,"Day High":254.485,"Day Low":248.47,"VS Average Volume":0.1462963024,"Company Summary":"Illinois Tool Works Inc. manufactures and sells industrial products and equipment in the United States and internationally. It operates through seven segments: Automotive OEM; Food Equipment; Test & Measurement and Electronics; Welding; Polymers & Fluids; Construction Products; and Specialty Products. The Automotive OEM segment offers plastic and metal components, fasteners, and assemblies for automobiles, light trucks, and other industrial uses. The Food Equipment segment provides warewashing, refrigeration, cooking, and food processing equipment; kitchen exhaust, ventilation, and pollution control systems; and food equipment maintenance and repair services. The Test & Measurement and Electronics segment produces and sells equipment, consumables, and related software for testing and measuring of materials and structures, as well as equipment and consumables used in the production of electronic subassemblies and microelectronics. The Welding segment produces arc welding equipment; and metal arc welding consumables and related accessories. The Polymers & Fluids segment produces adhesives, sealants, lubrication and cutting fluids, and fluids and polymers for auto aftermarket maintenance and appearance. The Construction Products segment offers engineered fastening systems and solutions for the residential construction, renovation\/remodel, and commercial construction markets. The Specialty Products segment provides beverage packaging equipment and consumables, product coding and marking equipment and consumables, and appliance components and fasteners. It serves the automotive OEM and tiers, MRO, commercial food equipment, construction, general industrial, industrial capital goods, consumer durables, automotive aftermarket end, and other markets. The company distributes its products directly to industrial manufacturers, as well as through independent distributors. Illinois Tool Works Inc. was founded in 1912 and is based in Glenview, Illinois.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"06-02-2025 16:52:36"},{"Company Name":"CDW Corporation","Symbol":"CDW","Current Price":"199.16","Latest MA":"204.44","Price Target":225.9291,"Difference from MA":"-2.58%","Difference from Open":"-2.76%","Change from Yesterday":"-3.38%","Change from Last Report":"0.14","Latest Volume":"100,209","Market Cap":"26,540,859,392","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":18.62445,"PB Ratio":11.292171,"Previous Close":206.13,"ROE":0.53360003,"DTE":278.653,"Industry":"Information Technology Services","Sector":"Technology","Beta":1.053,"Trailing PEG":null,"Trailing PE":24.957394,"Trailing PS":1.2740917,"Quick Ratio":1.221,"Day High":205.0,"Day Low":198.49,"VS Average Volume":0.0700164405,"Company Summary":"CDW Corporation provides information technology (IT) solutions in the United States, the United Kingdom, and Canada. It operates through three segments: Corporate, Small Business, and Public. The company offers discrete hardware and software products and services, as well as integrated IT solutions, including on-premise and cloud capabilities across hybrid infrastructure, digital experience, and security. It also provides hardware products comprising notebooks\/mobile devices, tablets, network communications, desktop computers, collaboration, data storage and servers, and others; and software products, such as cloud solutions, software assurance, application suites, security, virtualization, operating systems, and network management. In addition, the company offers advisory and design, software development, implementation, managed, professional, configuration, partner, and telecom services, as well as warranties; delivers and manages mission critical software, systems, and network solutions; and implementation and installation, and repair services to its customers through various third-party service providers. It serves government, education, and healthcare customers; and small, medium, and large business customers. CDW Corporation was formerly known as CDW Computer Centers, Inc. and changed its name to CDW Corporation in June 2003. The company was founded in 1984 and is based in Vernon Hills, Illinois.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-02-2025 16:52:36"},{"Company Name":"RTX Corporation","Symbol":"RTX","Current Price":"129.52","Latest MA":"117.99","Price Target":142.005,"Difference from MA":"9.77%","Difference from Open":"0.36%","Change from Yesterday":"0.28%","Change from Last Report":"-0.07","Latest Volume":"188,335","Market Cap":"172,536,201,216","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":18.950134,"PB Ratio":2.8208647,"Previous Close":129.16,"ROE":0.073460005,"DTE":69.597,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":0.54,"Trailing PEG":1.3357,"Trailing PE":36.48451,"Trailing PS":2.182842,"Quick Ratio":0.602,"Day High":129.745,"Day Low":129.06,"VS Average Volume":0.0413360725,"Company Summary":"RTX Corporation, an aerospace and defense company, provides systems and services for the commercial, military, and government customers in the United States and internationally. It operates through three segments: Collins Aerospace, Pratt & Whitney, and Raytheon. The Collins Aerospace Systems segment offers aerospace and defense products, and aftermarket service solutions for civil and military aircraft manufacturers and commercial airlines, as well as regional, business, and general aviation, defense, and commercial space operations. This segment also designs, produces, and supports cabin interior, including oxygen systems, food and beverage preparation, storage and galley systems, and lavatory and wastewater management systems; battlespace, test and training range systems, crew escape systems, and simulation and training solutions; information management services; and aftermarket services that include spare parts, overhaul and repair, engineering and technical support, training and fleet management solutions, and asset and information management services. Its Pratt & Whitney segment supplies aircraft engines for commercial, military, business jet, and general aviation customers; and produces, sells, and services military and commercial auxiliary power units. The Raytheon segment provides defensive and offensive threat detection, tracking, and mitigation capabilities for U.S., foreign government, and commercial customers. The company was formerly known as Raytheon Technologies Corporation and changed its name to RTX Corporation in July 2023. RTX Corporation was incorporated in 1934 and is headquartered in Arlington, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 16:52:36"},{"Company Name":"Uber Technologies, Inc.","Symbol":"UBER","Current Price":"67.25","Latest MA":"70.25","Price Target":88.44265,"Difference from MA":"-4.27%","Difference from Open":"2.40%","Change from Yesterday":"4.26%","Change from Last Report":"-0.18","Latest Volume":"7,455,654","Market Cap":"141,598,474,240","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":15.630738,"PB Ratio":9.573605,"Previous Close":64.48,"ROE":0.34326,"DTE":80.343,"Industry":"Software - Application","Sector":"Technology","Beta":1.337,"Trailing PEG":0.6826,"Trailing PE":14.746712,"Trailing PS":3.3750083,"Quick Ratio":1.223,"Day High":67.657,"Day Low":65.54,"VS Average Volume":0.2815477127,"Company Summary":"Uber Technologies, Inc. develops and operates proprietary technology applications in the United States, Canada, Latin America, Europe, the Middle East, Africa, and Asia excluding China and Southeast Asia. It operates through three segments: Mobility, Delivery, and Freight. The Mobility segment connects consumers with a range of transportation modalities, such as ridesharing, carsharing, micromobility, rentals, public transit, taxis, and other modalities; and offers riders in a variety of vehicle types, as well as financial partnerships products and advertising services. The Delivery segment allows to search for and discover restaurants to grocery, alcohol, convenience, and other retails; order a meal or other items; and Uber direct, a white-label Delivery-as-a-Service for retailers and restaurants, as well as advertising. The Freight segment manages transportation and logistics network, which connects shippers and carriers in digital marketplace including carriers upfronts, pricing, and shipment booking; and provides on-demand platform to automate logistics end-to-end transactions for small-and medium-sized business to global enterprises. The company was formerly known as Ubercab, Inc. and changed its name to Uber Technologies, Inc. in February 2011. Uber Technologies, Inc. was founded in 2009 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-02-2025 16:52:36"},{"Company Name":"Stanley Black & Decker, Inc.","Symbol":"SWK","Current Price":"85.91","Latest MA":"92.25","Price Target":101.06333,"Difference from MA":"-6.87%","Difference from Open":"-1.03%","Change from Yesterday":"0.34%","Change from Last Report":"-0.56","Latest Volume":"182,223","Market Cap":"13,244,229,632","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":12.962226,"PB Ratio":1.4948149,"Previous Close":85.62,"ROE":-0.02031,"DTE":79.081,"Industry":"Tools & Accessories","Sector":"Industrials","Beta":1.255,"Trailing PEG":null,"Trailing PE":45.45503,"Trailing PS":0.8610381,"Quick Ratio":0.34,"Day High":87.205,"Day Low":85.83,"VS Average Volume":0.1033909307,"Company Summary":"Stanley Black & Decker, Inc. provides hand tools, power tools, outdoor products, and related accessories in the United States, Canada, Other Americas, Europe, and Asia. Its Tools & Outdoor segment offers professional grade corded and cordless electric power tools and equipment, including drills, impact wrenches and drivers, grinders, saws, routers, and sanders; pneumatic tools and fasteners, such as nail guns, nails, staplers and staples, and concrete and masonry anchors; corded and cordless electric power tools; hand-held vacuums, paint tools, and cleaning appliances; leveling and layout tools, planes, hammers, demolition tools, clamps, vises, knives, saws, chisels, and industrial and automotive tools; drill, screwdriver, router bits, abrasives, saw blades, and threading products; tool boxes, sawhorses, medical cabinets, and engineered storage solutions; and electric and gas-powered lawn and garden products. This segment sells its products under the DEWALT, CRAFTSMAN, CUB ADET, BLACK+DECKER, and HUSTLER brands through retailers, third-party distributors, independent dealers, and a direct sales force. The company's Industrial segment provides threaded fasteners, blind rivets and tools, blind inserts and tools, drawn arc weld studs and systems, engineered plastic and mechanical fasteners, self-piercing riveting systems, precision nut running systems, micro fasteners, high-strength structural fasteners, axel swage, latches, heat shields, pins, couplings, fitting, and other engineered products; and attachments used on excavators and handheld tools. This segment sells its products through direct sales force and third-party distributors to the automotive, manufacturing, electronics, construction, aerospace, and other industries. The company was formerly known as The Stanley Works and changed its name to Stanley Black & Decker, Inc. in March 2010. Stanley Black & Decker, Inc. was founded in 1843 and is headquartered in New Britain, Connecticut.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"06-02-2025 16:52:36"},{"Company Name":"Bunge Limited","Symbol":"BG","Current Price":"69.15","Latest MA":"91.43","Price Target":96.634,"Difference from MA":"-24.37%","Difference from Open":"-2.29%","Change from Yesterday":"-1.03%","Change from Last Report":"-0.60","Latest Volume":"161,770","Market Cap":"9,655,207,936","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":7.7083516,"PB Ratio":0.95264995,"Previous Close":69.87,"ROE":0.10922,"DTE":63.434,"Industry":"Farm Products","Sector":"Consumer Defensive","Beta":0.655,"Trailing PEG":null,"Trailing PE":8.654569,"Trailing PS":0.17715329,"Quick Ratio":0.715,"Day High":70.825,"Day Low":69.15,"VS Average Volume":0.0943255406,"Company Summary":"Bunge Global SA operates as an agribusiness and food company worldwide. It operates through four segments: Agribusiness, Refined and Specialty Oils, Milling, and Sugar and Bioenergy. The Agribusiness segment purchases, stores, transports, processes, and sells agricultural commodities and commodity products, including oilseeds primarily soybeans, rapeseed, canola, and sunflower seeds, as well as grains comprising wheat and corn; and processes oilseeds into vegetable oils and protein meals. This segment offers its products for animal feed manufacturers, livestock producers, wheat and corn millers, and other oilseed processors, as well as third-party edible oil processing and biofuel companies for biofuel production applications. The Refined and Specialty Oils segment sells packaged and bulk oils and fats that comprise cooking oils, shortenings, margarines, mayonnaise, renewable diesel feedstocks, and other products for baked goods companies, snack food producers, confectioners, restaurant chains, foodservice operators, infant nutrition companies, and other food manufacturers, as well as grocery chains, wholesalers, distributors, and other retailers. This segment also refines and fractionates palm oil, palm kernel oil, coconut oil, and shea butter, and olive oil; and produces specialty ingredients derived from vegetable oils, such as lecithin. The Milling segment provides wheat flours and bakery mixes; corn milling products that comprise dry-milled corn meals and flours, wet-milled masa and flours, and flaking and brewer's grits, as well as soy-fortified corn meal, corn-soy blends, and other products; whole grain and fiber ingredients; die-cut pellets; and non-GMO products. The Sugar and Bioenergy segment produces sugar and ethanol; and generates electricity from burning sugarcane bagasse. Bunge Global SA was founded in 1818 and is headquartered in Chesterfield, Missouri.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-02-2025 16:52:36"},{"Company Name":"Johnson Controls International ","Symbol":"JCI","Current Price":"86.12","Latest MA":"75.66","Price Target":93.10476,"Difference from MA":"13.83%","Difference from Open":"-0.93%","Change from Yesterday":"0.13%","Change from Last Report":"-0.20","Latest Volume":"953,838","Market Cap":"56,851,173,376","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":20.650942,"PB Ratio":3.559119,"Previous Close":86.01,"ROE":0.0805,"DTE":54.68,"Industry":"Building Products & Equipment","Sector":"Industrials","Beta":1.306,"Trailing PEG":1.4667,"Trailing PE":40.431923,"Trailing PS":2.4769595,"Quick Ratio":0.557,"Day High":87.21,"Day Low":86.03,"VS Average Volume":0.2496938506,"Company Summary":"Johnson Controls International plc, together with its subsidiaries, engages in engineering, manufacturing, commissioning, and retrofitting building products and systems in the United States, Europe, the Asia Pacific, and internationally. It operates through four segments: Building Solutions North America, Building Solutions EMEA\/LA, Building Solutions Asia Pacific, and Global Products. The company designs, sells, installs, and services heating, ventilating, air conditioning, controls, building management, refrigeration, integrated electronic security, integrated fire detection and suppression systems, and fire protection and security products. It also provides energy efficiency solutions and technical services, including inspection, scheduled maintenance, and repair and replacement of mechanical and control systems, as well as data-driven smart building solutions. In addition, the company offers control software and software services. It sells its products and services to commercial, institutional, industrial, data center, and governmental customers. Johnson Controls International plc was incorporated in 1885 and is headquartered in Cork, Ireland.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 16:52:36"},{"Company Name":"T. Rowe Price Group, Inc.","Symbol":"TROW","Current Price":"112.58","Latest MA":"111.58","Price Target":111.42857,"Difference from MA":"0.90%","Difference from Open":"0.92%","Change from Yesterday":"1.70%","Change from Last Report":"-0.02","Latest Volume":"152,598","Market Cap":"25,106,454,528","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":11.67589,"PB Ratio":2.4401793,"Previous Close":110.7,"ROE":0.20495,"DTE":3.247,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.423,"Trailing PEG":2.3881,"Trailing PE":12.304372,"Trailing PS":3.6327727,"Quick Ratio":1.904,"Day High":112.97,"Day Low":110.77,"VS Average Volume":0.1045552711,"Company Summary":"T. Rowe Price Group, Inc. is a publicly owned investment manager. The firm provides its services to individuals, institutional investors, retirement plans, financial intermediaries, and institutions. It launches and manages equity and fixed income mutual funds. The firm invests in the public equity and fixed income markets across the globe. It employs fundamental and quantitative analysis with a bottom-up approach. The firm utilizes in-house and external research to make its investments. It employs socially responsible investing with a focus on environmental, social, and governance issues. It makes investment in late-stage venture capital transactions and usually invests between $3 million and $5 million. The firm was previously known as T. Rowe Group, Inc. and T. Rowe Price Associates, Inc. T. Rowe Price Group, Inc. was founded in 1937 and is based in Baltimore, Maryland, with additional offices in Colorado Springs, Colorado; Owings Mills, Maryland; San Francisco, California; New York, New York; Philadelphia, Pennsylvania; Tampa, Florida; Toronto, Ontario; Hellerup, Denmark; Amsterdam, The Netherlands; Luxembourg, Grand Duchy of Luxembourg; Zurich, Switzerland; Dubai, United Arab Emirates; London, United Kingdom; Sydney, New South Wales; Hong Kong; Tokyo, Japan; Singapore; Frankfurt, Shanghai, China; Germany, Madrid, Spain, Milan, Italy, Stockholm, Sweden, Melbourne, Australia, Amsterdam, Netherlands and Washington, DC.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"06-02-2025 16:52:36"},{"Company Name":"Ford Motor Company","Symbol":"F","Current Price":"9.32","Latest MA":"10.74","Price Target":11.16083,"Difference from MA":"-13.15%","Difference from Open":"-1.74%","Change from Yesterday":"-6.85%","Change from Last Report":"-0.11","Latest Volume":"49,540,835","Market Cap":"37,059,063,808","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":5.3663945,"PB Ratio":0.836296,"Previous Close":10.01,"ROE":0.0799,"DTE":359.359,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":1.636,"Trailing PEG":0.8686,"Trailing PE":10.596251,"Trailing PS":0.20279333,"Quick Ratio":0.942,"Day High":9.64,"Day Low":9.29,"VS Average Volume":0.7991966322,"Company Summary":"Ford Motor Company develops, delivers, and services a range of Ford trucks, commercial cars and vans, sport utility vehicles, and Lincoln luxury vehicles worldwide. It operates through Ford Blue, Ford Model e, and Ford Pro; Ford Next; and Ford Credit segments. The company sells Ford and Lincoln vehicles, service parts, and accessories through distributors and dealers, as well as through dealerships to commercial fleet customers, daily rental car companies, and governments. It also engages in vehicle-related financing and leasing activities to and through automotive dealers. In addition, the company provides retail installment sale contracts for new and used vehicles; and direct financing leases for new vehicles to retail and commercial customers, such as leasing companies, government entities, daily rental companies, and fleet customers. Further, it offers wholesale loans to dealers to finance the purchase of vehicle inventory; and loans to dealers to finance working capital and enhance dealership facilities, purchase dealership real estate, and other dealer vehicle programs. The company was incorporated in 1903 and is based in Dearborn, Michigan.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"06-02-2025 16:52:36"},{"Company Name":"Ares Capital Corporation","Symbol":"ARCC","Current Price":"22.88","Latest MA":"20.95","Price Target":23.03846,"Difference from MA":"9.20%","Difference from Open":"-0.91%","Change from Yesterday":"-0.95%","Change from Last Report":"-0.11","Latest Volume":"690,540","Market Cap":"15,363,507,200","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":10.61446,"PB Ratio":1.157192,"Previous Close":23.1,"ROE":0.1338,"DTE":106.255,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.054,"Trailing PEG":null,"Trailing PE":9.3770485,"Trailing PS":5.2292404,"Quick Ratio":1.29,"Day High":23.1,"Day Low":22.87,"VS Average Volume":0.1485487488,"Company Summary":"Ares Capital Corporation is a business development company specializing in acquisition, recapitalization, mezzanine debt, restructurings, rescue financing, and leveraged buyout transactions of middle market companies. It also makes growth capital and general refinancing. It prefers to make investments in companies engaged in the basic and growth manufacturing, business services, consumer products, health care products and services, and information technology service sectors. The fund will also consider investments in industries such as restaurants, retail, oil and gas, and technology sectors. It focuses on investments in Northeast, Mid-Atlantic, Southeast and Southwest regions from its New York office, the Midwest region, from the Chicago office, and the Western region from the Los Angeles office. The fund typically invests between $20 million and $200 million and a maximum of $400 million in companies with an EBITDA between $10 million and $250 million. It makes debt investments between $10 million and $100 million The fund invests through revolvers, first lien loans, warrants, unitranche structures, second lien loans, mezzanine debt, private high yield, junior capital, subordinated debt, and non-control preferred and common equity. The fund also selectively considers third-party-led senior and subordinated debt financings and opportunistically considers the purchase of stressed and discounted debt positions. The fund prefers to be an agent and\/or lead the transactions in which it invests. The fund also seeks board representation in its portfolio companies.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 16:52:36"},{"Company Name":"Emerson Electric Company","Symbol":"EMR","Current Price":"125.67","Latest MA":"115.87","Price Target":142.07571,"Difference from MA":"8.46%","Difference from Open":"-0.33%","Change from Yesterday":"0.73%","Change from Last Report":"-0.03","Latest Volume":"297,310","Market Cap":"70,862,495,744","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":19.301245,"PB Ratio":3.311767,"Previous Close":124.76,"ROE":0.05933,"DTE":30.376,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":1.292,"Trailing PEG":null,"Trailing PE":35.29916,"Trailing PS":4.0511374,"Quick Ratio":1.323,"Day High":128.0,"Day Low":125.48,"VS Average Volume":0.0975161603,"Company Summary":"Emerson Electric Co., a technology and software company, provides various solutions in the Americas, Asia, the Middle East, Africa, and Europe. It operates through seven segments: Final Control, Measurement & Analytical, Discrete Automation, Safety & Productivity, Control Systems & Software, Test & Measurement, and AspenTech. The Final Control segment provides control, isolation, shutoff, pressure relief, and pressure safety valves, actuators, and regulators for process and hybrid industries. The Measurement & Analytical segment offers intelligent instrumentation measuring the physical properties of liquids or gases, such as pressure, temperature, level, flow, acoustics, corrosion, pH, conductivity, water quality, toxic gases, and flame. The Discrete Automation segment offers solenoid and pneumatic valves, valve position indicators, pneumatic cylinders, actuators, air preparation equipment, pressure and temperature switches, electric linear motion solutions, programmable automation control systems, electrical distribution equipment, and materials joining solutions. The Safety & Productivity segment offers tools for professionals and homeowners; pipe-working tools, including pipe wrenches, pipe cutters, pipe threading and roll grooving equipment, battery hydraulic tools; electrical tools; and other professional tools. The Control Systems & Software segment provides control systems, safety instrumented systems, SCADA systems, application software, digital twins, asset performance management, and cybersecurity. The Test & Measurement provides software-connected automated test and measurement systems. The AspenTech segment provides asset optimization software that enables industrial manufacturers to design, operate, and maintain operations for enhancing performance through a combination of decades of modeling, simulation, and optimization capabilities. The company was incorporated in 1890 and is based in Saint Louis, Missouri.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-02-2025 16:52:36"}]