[{"Company Name":"BGC Group, Inc.","Symbol":"BGC","Current Price":"9.34","Latest MA":"9.50","Price Target":12.0,"Difference from MA":"-1.72%","Difference from Open":"1.41%","Change from Yesterday":"-1.58%","Change from Last Report":"0.00","Latest Volume":"3,526,039","Market Cap":"4,584,539,136","Earning Date":"2025-02-14","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":7.9829063,"PB Ratio":5.029618,"Previous Close":9.49,"ROE":0.124639995,"DTE":123.934,"Industry":"Capital Markets","Sector":"Financial Services","Beta":1.472,"Trailing PEG":null,"Trailing PE":37.36,"Trailing PS":2.1109953,"Quick Ratio":1.724,"Day High":9.78,"Day Low":9.04,"VS Average Volume":1.1814552446,"Company Summary":"BGC Group, Inc. operates as a financial brokerage and technology company in the United States and internationally. The company offers various brokerage products, such as fixed income, such as government bonds, corporate bonds, and other debt instruments, as well as related interest rate derivatives and credit derivatives; equities, energy and commodities, shipping, insurance, and futures and options. It also provides trade execution, connectivity solutions, brokerage services, clearing, trade compression and other post-trade services, information, and other back-office services to an assortment of financial and non-financial institutions. In addition, the company offers electronic and hybrid brokerage, other financial technology solutions, market data and related information services. Further, its integrated platform is designed to provide flexibility to customers with regard to price discovery, execution and processing of transactions, Hybrid, or in various markets, as well as fully electronic brokerage services in connection with transactions executed either OTC or through an exchange. The company primarily serves banks, broker-dealers, investment banks, trading firms, hedge funds, governments, and corporations, as well as investment firms. BGC Group, Inc. was founded in 1945 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"16-02-2025 19:33:53"},{"Company Name":"Roku, Inc.","Symbol":"ROKU","Current Price":"99.07","Latest MA":"72.61","Price Target":100.06185,"Difference from MA":"36.45%","Difference from Open":"-1.53%","Change from Yesterday":"14.14%","Change from Last Report":"0.00","Latest Volume":"18,340,877","Market Cap":"14,384,865,280","Earning Date":"2025-02-14","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":225.15909,"PB Ratio":5.784772,"Previous Close":86.8,"ROE":-0.0537,"DTE":20.568,"Industry":"Entertainment","Sector":"Communication Services","Beta":2.048,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":3.4975011,"Quick Ratio":2.412,"Day High":104.96,"Day Low":96.16,"VS Average Volume":5.0888641333,"Company Summary":"Roku, Inc., together with its subsidiaries, operates a TV streaming platform in the United states and internationally. The company operates in two segments, Platform and Devices. Its streaming platform allows users to find and access TV shows, movies, news, sports, and others. The Platform segment offers digital advertising, including direct and programmatic video advertising, media and entertainment promotional spending, and related services; and streaming services distribution, such as subscription and transaction revenue shares, and sale of premium subscriptions and branded app buttons on remote controls. The Devices segment provides sale of streaming players, Roku-branded TVs, smart home products and services, audio products, and related accessories as well as licensing arrangements with service operators. Roku, Inc. was incorporated in 2002 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"16-02-2025 19:33:53"},{"Company Name":"Moderna, Inc.","Symbol":"MRNA","Current Price":"32.99","Latest MA":"60.82","Price Target":60.59636,"Difference from MA":"-45.76%","Difference from Open":"7.98%","Change from Yesterday":"3.35%","Change from Last Report":"0.00","Latest Volume":"25,131,466","Market Cap":"12,695,145,472","Earning Date":"2025-02-14","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":-4.4956594,"PB Ratio":1.165148,"Previous Close":31.92,"ROE":-0.2877,"DTE":6.513,"Industry":"Biotechnology","Sector":"Healthcare","Beta":1.585,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":3.923098,"Quick Ratio":3.347,"Day High":33.91,"Day Low":29.2543,"VS Average Volume":2.373832316,"Company Summary":"Moderna, Inc., a biotechnology company, discovers, develops, and commercializes messenger RNA therapeutics and vaccines for the treatment of infectious diseases, immuno-oncology, rare diseases, autoimmune, and cardiovascular diseases in the United States, Europe, and internationally. Its respiratory vaccines include COVID-19, influenza, and respiratory syncytial virus, spikevax, and hMPV\/PIV3 vaccines; latent vaccines comprise cytomegalovirus, epstein-barr virus, herpes simplex virus, varicella zoster virus, and human immunodeficiency virus vaccines; public health vaccines consists of Zika, Nipah, Mpox vaccines; and infectious diseases vaccines, such as lyme and norovirus vaccines. The company also offers systemic secreted and cell surface therapeutics; cancer vaccines, such as personalized cancer, KRAS, and checkpoint vaccines; intratumoral immuno-oncology products; rare disease intracellular therapeutics; and inhaled pulmonary therapeutics. It has strategic alliances and collaborations with AstraZeneca; Merck & Co., Inc; Vertex Pharmaceuticals Incorporated; Vertex Pharmaceuticals (Europe) Limited; Chiesi Farmaceutici S.p.A.; Metagenomi, Inc.; Carisma Therapeutics, Inc.; CytomX Therapeutics; Defense Advanced Research Projects Agency; Biomedical Advanced Research and Development Authority; Institute for Life Changing Medicines; The Bill & Melinda Gates Foundation; and OpenAI. The company was formerly known as Moderna Therapeutics, Inc. and changed its name to Moderna, Inc. in August 2018. Moderna, Inc. was founded in 2010 and is headquartered in Cambridge, Massachusetts.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"16-02-2025 19:33:53"},{"Company Name":"Coinbase Global, Inc.","Symbol":"COIN","Current Price":"274.31","Latest MA":"237.64","Price Target":320.70834,"Difference from MA":"15.43%","Difference from Open":"-4.76%","Change from Yesterday":"-7.98%","Change from Last Report":"0.00","Latest Volume":"18,992,572","Market Cap":"69,641,551,872","Earning Date":"2025-02-14","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":40.23716,"PB Ratio":6.7702446,"Previous Close":298.11,"ROE":0.31151,"DTE":45.049,"Industry":"Financial Data & Stock Exchanges","Sector":"Financial Services","Beta":3.615,"Trailing PEG":0.7107,"Trailing PE":28.905165,"Trailing PS":11.066078,"Quick Ratio":1.11,"Day High":291.5,"Day Low":274.0,"VS Average Volume":1.8301584689,"Company Summary":"Coinbase Global, Inc. operates platform for crypto assets in the United States and internationally. It offers the primary financial account in the crypto economy for consumers; a brokerage platform with a pool of liquidity across the crypto marketplace for institutions; and a suite of products granting access to build onchain for developers. The company was founded in 2012 and is based in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"16-02-2025 19:33:53"},{"Company Name":"DraftKings Inc.","Symbol":"DKNG","Current Price":"53.49","Latest MA":"38.63","Price Target":54.81429,"Difference from MA":"38.46%","Difference from Open":"9.72%","Change from Yesterday":"15.16%","Change from Last Report":"0.00","Latest Volume":"48,198,405","Market Cap":"26,207,748,096","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":24.112082,"PB Ratio":25.890612,"Previous Close":46.45,"ROE":-0.54814,"DTE":132.104,"Industry":"Gambling","Sector":"Consumer Cyclical","Beta":1.923,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":5.4969387,"Quick Ratio":0.511,"Day High":53.61,"Day Low":48.04,"VS Average Volume":5.6803860386,"Company Summary":"DraftKings Inc. operates as a digital sports entertainment and gaming company in the United States and internationally. It provides online sports betting, daily fantasy sports, media, digital lottery courier, media, and other products, as well as retails sportsbooks. The company also offers iGaming, or online casino products, which includes blackjack, roulette, baccarat and slot machines. In addition, the company also engages in the design and development of sports betting and casino gaming software for online and retail sportsbooks, and iGaming operators. Further, it offers DraftKings marketplace, a digital collectibles ecosystem designed for mainstream accessibility that offers curated NFT on marketplace. The company was founded in 2012 and is headquartered in Boston, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"16-02-2025 19:33:53"},{"Company Name":"DaVita Inc.","Symbol":"DVA","Current Price":"157.42","Latest MA":"155.97","Price Target":161.59332,"Difference from MA":"0.93%","Difference from Open":"2.22%","Change from Yesterday":"-11.09%","Change from Last Report":"0.00","Latest Volume":"5,099,069","Market Cap":"12,593,599,488","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":11.873039,"PB Ratio":104.66756,"Previous Close":177.06,"ROE":0.5174,"DTE":576.988,"Industry":"Medical Care Facilities","Sector":"Healthcare","Beta":0.934,"Trailing PEG":1.1726,"Trailing PE":14.657356,"Trailing PS":0.9826811,"Quick Ratio":1.145,"Day High":159.27,"Day Low":150.11,"VS Average Volume":7.0516008674,"Company Summary":"DaVita Inc. provides kidney dialysis services for patients suffering from chronic kidney failure in the United States. The company operates kidney dialysis centers and provides related lab services in outpatient dialysis centers. It also offers outpatient, hospital inpatient, and home-based hemodialysis services; operates clinical laboratories that provide routine laboratory tests for dialysis and other physician-prescribed laboratory tests for ESRD patients; and management and administrative services to outpatient dialysis centers. In addition, the company offers integrated care and disease management services to patients in risk-based and other integrated care arrangements; clinical research programs; physician services; and comprehensive kidney care services. Further, it engages in the provision of acute inpatient dialysis services and related laboratory services; and transplant software business. The company was formerly known as DaVita HealthCare Partners Inc. and changed its name to DaVita Inc. in September 2016. DaVita Inc. was incorporated in 1994 and is headquartered in Denver, Colorado.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"16-02-2025 19:33:53"},{"Company Name":"GE HealthCare Technologies Inc.","Symbol":"GEHC","Current Price":"92.21","Latest MA":"85.21","Price Target":99.457,"Difference from MA":"8.21%","Difference from Open":"-1.06%","Change from Yesterday":"-1.36%","Change from Last Report":"0.00","Latest Volume":"3,421,330","Market Cap":"42,167,447,552","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":17.634415,"PB Ratio":4.988909,"Previous Close":93.48,"ROE":0.25686002,"DTE":108.368,"Industry":"Health Information Services","Sector":"Healthcare","Beta":1.33,"Trailing PEG":2.4351,"Trailing PE":21.246542,"Trailing PS":2.143526,"Quick Ratio":0.748,"Day High":93.2099,"Day Low":91.18,"VS Average Volume":1.1432843951,"Company Summary":"GE HealthCare Technologies Inc. engages in the development, manufacture, and marketing of products, services, and complementary digital solutions used in the diagnosis, treatment, and monitoring of patients in the United States, Canada, and internationally. The company operates through four segments: Imaging, Advanced Visualization Solutions (AVS), Patient Care Solutions (PCS), and Pharmaceutical Diagnostics (PDx). The Imaging segment offers molecular imaging, computed tomography (CT) scanning, magnetic resonance (MR) imaging, image-guided therapy, X-ray systems, and women's health products. The AVS segment provides ultrasound, image guided therapies, and interventional solutions for screening, diagnosis, treatment, and monitoring of certain diseases in clinical areas, such as women's health, cardiovascular, and comprehensive care ultrasound as well as surgical visualization and guidance products. The PCS segment provides medical devices, consumables, services, and digital solutions. Its portfolio includes patient monitoring, diagnostic cardiology, consumables and services, digital solutions, maternal infant care, and anesthesia products. The PDx segment supplies diagnostic agents, including CT, angiography and X-ray, MR, single-photon emission computed tomography, and positron emission tomography to the radiology and nuclear medicine industries. The segment also provides contrast media pharmaceuticals that are administered to a patient prior to certain diagnostic scans to increase the visibility of tissues or structures during imaging exams; and molecular imaging agents or radiopharmaceuticals, which are molecular tracers labeled with radioisotopes. The company was formerly known as GE Healthcare Holding LLC and changed its name to GE HealthCare Technologies Inc. in December 2022. The company was incorporated in 2022 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"16-02-2025 19:33:53"},{"Company Name":"Iron Mountain Incorporated (Del","Symbol":"IRM","Current Price":"95.41","Latest MA":"110.94","Price Target":119.25,"Difference from MA":"-14.00%","Difference from Open":"0.43%","Change from Yesterday":"0.17%","Change from Last Report":"0.00","Latest Volume":"2,520,966","Market Cap":"28,011,708,416","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":44.370968,"PB Ratio":"N\/A","Previous Close":95.25,"ROE":2.25057,"DTE":"N\/A","Industry":"REIT - Specialty","Sector":"Real Estate","Beta":1.039,"Trailing PEG":null,"Trailing PE":156.40984,"Trailing PS":4.5548167,"Quick Ratio":0.469,"Day High":96.96,"Day Low":93.95,"VS Average Volume":1.4023199502,"Company Summary":"Iron Mountain Incorporated (NYSE: IRM) is a global leader in information management services. Founded in 1951 and trusted by more than 240,000 customers worldwide, Iron Mountain serves to protect and elevate the power of our customers' work. Through a range of offerings including digital transformation, data centers, secure records storage, information management, asset lifecycle management, secure destruction and art storage and logistics, Iron Mountain helps businesses bring light to their dark data, enabling customers to unlock value and intelligence from their stored digital and physical assets at speed and with security, while helping them meet their environmental goals.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"16-02-2025 19:33:53"},{"Company Name":"Duke Energy Corporation (Holdin","Symbol":"DUK","Current Price":"111.60","Latest MA":"110.75","Price Target":121.445,"Difference from MA":"0.76%","Difference from Open":"-1.47%","Change from Yesterday":"-1.16%","Change from Last Report":"0.00","Latest Volume":"3,564,745","Market Cap":"86,601,596,928","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.55656,"PB Ratio":1.7618364,"Previous Close":112.905,"ROE":0.09077,"DTE":166.283,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.487,"Trailing PEG":2.4518,"Trailing PE":19.578947,"Trailing PS":2.852772,"Quick Ratio":0.258,"Day High":113.93,"Day Low":111.53,"VS Average Volume":1.1033885583,"Company Summary":"Duke Energy Corporation, together with its subsidiaries, operates as an energy company in the United States. It operates through two segments: Electric Utilities and Infrastructure (EU&I), and Gas Utilities and Infrastructure (GU&I). The EU&I segment generates, transmits, distributes, and sells electricity in the Carolinas, Florida, and the Midwest. It generates electricity through coal, hydroelectric, natural gas, oil, solar and wind sources, renewables, and nuclear fuel. This segment also engages in the wholesale of electricity to municipalities, electric cooperative utilities, and load-serving entities. The GU&I segment distributes natural gas to residential, commercial, industrial, and power generation natural gas customers; and invests in pipeline transmission projects, renewable natural gas projects, and natural gas storage facilities. The company was formerly known as Duke Energy Holding Corp. and changed its name to Duke Energy Corporation in April 2006. Duke Energy Corporation was founded in 1904 and is headquartered in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"16-02-2025 19:33:53"},{"Company Name":"US Foods Holding Corp.","Symbol":"USFD","Current Price":"71.25","Latest MA":"63.01","Price Target":79.825,"Difference from MA":"13.09%","Difference from Open":"0.32%","Change from Yesterday":"0.20%","Change from Last Report":"0.00","Latest Volume":"3,795,466","Market Cap":"16,414,503,936","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":15.4933405,"PB Ratio":3.6270618,"Previous Close":71.11,"ROE":0.1065,"DTE":120.009,"Industry":"Food Distribution","Sector":"Consumer Defensive","Beta":1.672,"Trailing PEG":null,"Trailing PE":35.272278,"Trailing PS":0.43336338,"Quick Ratio":0.662,"Day High":71.87,"Day Low":70.4,"VS Average Volume":1.9534573236,"Company Summary":"US Foods Holding Corp., together with its subsidiaries, engages in marketing, sale, and distribution of fresh, frozen, and dry food and non-food products to foodservice customers in the United States. Its customers include independently owned single and multi-unit restaurants, regional concepts, national restaurant chains, hospitals, nursing homes, hotels and motels, country clubs, government and military organizations, colleges and universities, and retail locations. The company was formerly known as USF Holding Corp. and changed its name to US Foods Holding Corp. in February 2016. US Foods Holding Corp. was incorporated in 2007 and is headquartered in Rosemont, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"16-02-2025 19:33:53"},{"Company Name":"CBRE Group Inc","Symbol":"CBRE","Current Price":"143.73","Latest MA":"125.27","Price Target":153.72726,"Difference from MA":"14.74%","Difference from Open":"0.79%","Change from Yesterday":"0.42%","Change from Last Report":"0.00","Latest Volume":"2,078,167","Market Cap":"43,983,962,112","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":20.040434,"PB Ratio":5.0854473,"Previous Close":143.13,"ROE":0.113479994,"DTE":63.74,"Industry":"Real Estate Services","Sector":"Real Estate","Beta":1.398,"Trailing PEG":1.2653,"Trailing PE":45.920124,"Trailing PS":1.2297359,"Quick Ratio":0.931,"Day High":145.57,"Day Low":140.77,"VS Average Volume":1.0697808618,"Company Summary":"CBRE Group, Inc. operates as a commercial real estate services and investment company in the United States, the United Kingdom, and internationally. The Advisory Services segment offers strategic advice and execution to owners, investors, and occupiers of real estate in connection with leasing of offices, and industrial and retail space; clients fully integrated property sales services under the CBRE Capital Markets brand; clients commercial mortgage and structured financing services; originates and sells commercial mortgage loans; property management services, such as marketing, building engineering, accounting, and financial services on a contractual basis for owners of and investors in office, industrial, and retail properties; and valuation services that include market value appraisals, litigation support, discounted cash flow analyses, and feasibility studies, as well as consulting services, such as property condition reports, hotel advisory, and environmental consulting. The Global Workplace Solutions segment provides facilities management, including day-to-day management of client-occupied space, headquarters, regional offices, administrative offices, data centers and other critical facilities, manufacturing and laboratory facilities, and distribution facilities and retail space; and project management services comprising building consulting, program, and project and cost management services under the Turner & Townsend brand name. The Real Estate Investments segment offers investment management services under the CBRE Investment Management brand to pension funds, insurance companies, sovereign wealth funds, foundations, endowments, and other institutional investors; and development services, such as real estate development and investment activities under the Trammell Crow Company and Telford Homes brands to users and investors in commercial real estate, and for their own account. CBRE Group, Inc. was founded in 1906 and is headquartered in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"16-02-2025 19:33:53"},{"Company Name":"Summit Materials, Inc.","Symbol":"SUM","Current Price":"52.49","Latest MA":"44.31","Price Target":"N\/A","Difference from MA":"18.47%","Difference from Open":"0.19%","Change from Yesterday":"-0.08%","Change from Last Report":"0.00","Latest Volume":"4,694,636","Market Cap":"9,228,477,440","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":24.99524,"PB Ratio":2.0728192,"Previous Close":52.45,"ROE":0.04364,"DTE":65.584,"Industry":"Building Materials","Sector":"Basic Materials","Beta":1.142,"Trailing PEG":null,"Trailing PE":61.75294,"Trailing PS":2.457947,"Quick Ratio":2.431,"Day High":54.07,"Day Low":52.4,"VS Average Volume":1.1620564474,"Company Summary":"Summit Materials, Inc. operates as a vertically integrated construction materials company in the United States and Canada. It operates in three segments: West, East, and Cement. The company offers aggregates, cement, ready-mix concrete, asphalt paving mixes, and concrete products, as well as plastics components. It also provides asphalt paving and related services. In addition, the company operates municipal waste, construction, and demolition debris landfills; and liquid asphalt terminals. The company serves the public infrastructure, and residential and nonresidential end markets. Summit Materials, Inc. was founded in 2009 and is headquartered in Denver, Colorado. As of February 10, 2025, Summit Materials, Inc. operates as a subsidiary of Quikrete Holdings, Inc.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"16-02-2025 19:33:53"},{"Company Name":"Howmet Aerospace Inc.","Symbol":"HWM","Current Price":"133.42","Latest MA":"105.56","Price Target":133.46826,"Difference from MA":"26.39%","Difference from Open":"3.53%","Change from Yesterday":"4.17%","Change from Last Report":"0.00","Latest Volume":"3,731,901","Market Cap":"54,038,167,552","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":33.834606,"PB Ratio":12.023069,"Previous Close":128.08,"ROE":0.26889,"DTE":76.219,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.336,"Trailing PEG":null,"Trailing PE":47.312057,"Trailing PS":7.2729697,"Quick Ratio":0.822,"Day High":133.92,"Day Low":126.89,"VS Average Volume":1.4913764027,"Company Summary":"Howmet Aerospace Inc. provides advanced engineered solutions for the aerospace and transportation industries. It operates through four segments: Engine Products, Fastening Systems, Engineered Structures, and Forged Wheels. The Engine Products segment offers airfoils and seamless rolled rings primarily for aircraft engines and industrial gas turbines; and rotating and structural parts. The Fastening Systems segment produces aerospace fastening systems, commercial transportation, industrial, and other fasteners. The Engineered Structures segment provides titanium ingots and mill products, aluminum and nickel forgings, and machined components and assemblies for aerospace and defense applications; and titanium forgings, extrusions, and forming and machining services for airframe, wing, aero-engine, and landing gear components. The Forged Wheels segment offers forged aluminum wheels and related products for heavy-duty trucks and commercial transportation markets. The company operates in the United States, Japan, France, Germany, the United Kingdom, Mexico, Italy, Canada, Poland, China, and internationally. The company was formerly known as Arconic Inc. Howmet Aerospace Inc. was founded in 1888 and is based in Pittsburgh, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"16-02-2025 19:33:53"},{"Company Name":"GoDaddy Inc.","Symbol":"GDDY","Current Price":"182.19","Latest MA":"176.47","Price Target":219.75945,"Difference from MA":"3.24%","Difference from Open":"-6.45%","Change from Yesterday":"-14.28%","Change from Last Report":"0.00","Latest Volume":"4,122,673","Market Cap":"25,726,685,184","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":19.84031,"PB Ratio":38.19497,"Previous Close":212.54,"ROE":2.48416,"DTE":559.413,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.148,"Trailing PEG":null,"Trailing PE":28.246513,"Trailing PS":5.6255326,"Quick Ratio":0.437,"Day High":195.7,"Day Low":181.72,"VS Average Volume":3.2501377654,"Company Summary":"GoDaddy Inc. engages in the design and development of cloud-based products in the United States and internationally. It operates through two segments: Applications and Commerce, and Core Platform. The Applications and Commerce segment provides applications products, including Websites + Marketing, a mobile-optimized online tool that enables customers to build websites and e-commerce enabled online stores; and Managed WordPress, a streamlined and optimized website building that allows customers to easily build and manage a faster WordPress site; Managed WooCommerce Stores to sell anything and anywhere online; and marketing tools and services, such as GoDaddy Studio mobile application, search engine optimization, Meta and Google My Business, and email and social media marketing designed to help businesses acquire and engage customers and create content. The segment also offers connected commerce comprising Smart Terminal, a dual screen all-in-one Point-of-Sale system that allows customers to manage in-store inventory and product catalogs and take payments; GoDaddy Payments, a payment facilitator that enables customers to accept all major forms of payments; and email service plans with a multi-feature web interface, and Microsoft Office 365 accounts that connects to customers' domains. The Core Platform segment offers domain products, including primary registrations, domain aftermarket platform, and domain name add-ons, as well as GoDaddy Registry, a provider of domain name registry services; and hosting and security services comprising shared website hosting, virtual private servers, and managed wordpress hosting services, as well as security products with a comprehensive suite of tools designed to help secure customers' online presence. The company serves small businesses, individuals, organizations, developers, designers, and domain investors. GoDaddy Inc. was founded in 1997 and is headquartered in Tempe, Arizona.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"16-02-2025 19:33:53"},{"Company Name":"Informatica Inc.","Symbol":"INFA","Current Price":"19.75","Latest MA":"25.43","Price Target":22.79412,"Difference from MA":"-22.35%","Difference from Open":"18.48%","Change from Yesterday":"-21.53%","Change from Last Report":"0.00","Latest Volume":"27,833,350","Market Cap":"5,994,816,512","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":14.995634,"PB Ratio":2.5983424,"Previous Close":25.17,"ROE":0.00439,"DTE":80.64,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.987,"Trailing PEG":null,"Trailing PE":658.3334,"Trailing PS":3.6553357,"Quick Ratio":1.653,"Day High":19.85,"Day Low":16.38,"VS Average Volume":13.472845778,"Company Summary":"Informatica Inc. develops an artificial intelligence-powered platform that connects, manages, and unifies data across multi-vendor, multi-cloud, and hybrid systems at enterprise scale worldwide. The company's platform includes a suite of interoperable data management products, including data integration products to ingest, transform, and integrate data; API and application integration products that enable users to create and manage APIs and integration processes for app-to-app synchronization, business process orchestration, B2B partner management, application development, and API management; data quality and observability products to profile, cleanse, standardize, observe, and monitor data to deliver accurate, complete, and consistent data; and master data management products to create an authoritative single source of truth of business-critical data. Its platform also includes customer and business 360 application that allow business analysts to create 360-degree views of business data domains like customer, product, supplier, reference, and finance with simplified business user experiences; data catalog products that enables customers to quickly find, access, and understand enterprise data using a simple Google-like search experience; governance and privacy products that help users define policies, govern data, and ensure compliance with industry and corporate policies; and a data marketplace that delivers cloud shopping experience for data consumers and enables data sharing and AI models across organizations to facilitate data-driven decision making. In addition, the company provides CLAIRE GPT, GenAI-powered data management assistant. Further, it offers maintenance and professional services. The company sells its products through its direct sales team. The company was founded in 1993 and is headquartered in Redwood City, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"16-02-2025 19:33:53"},{"Company Name":"Zoetis Inc.","Symbol":"ZTS","Current Price":"157.52","Latest MA":"178.56","Price Target":207.07,"Difference from MA":"-11.78%","Difference from Open":"-3.94%","Change from Yesterday":"-4.49%","Change from Last Report":"0.00","Latest Volume":"7,612,519","Market Cap":"70,536,200,192","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":22.925272,"PB Ratio":14.81008,"Previous Close":164.93,"ROE":0.51142,"DTE":143.166,"Industry":"Drug Manufacturers - Specialty & Generic","Sector":"Healthcare","Beta":0.895,"Trailing PEG":2.4501,"Trailing PE":28.797077,"Trailing PS":7.6205926,"Quick Ratio":0.968,"Day High":164.54,"Day Low":156.34,"VS Average Volume":2.749863636,"Company Summary":"Zoetis Inc. engages in the discovery, development, manufacture, and commercialization of animal health medicines, vaccines, diagnostic products and services, biodevices, genetic tests, and precision animal health products in the United States and internationally. The company commercializes products primarily across species, including livestock, such as cattle, swine, poultry, fish, and sheep; and companion animals comprising dogs, cats, and horses. It also offers parasiticides, vaccines, dermatology, anti-infectives, pain and sedation, other pharmaceutical, and animal health diagnostics. In addition, the company provides animal health diagnostics, including point-of-care diagnostic products, instruments and reagents, rapid immunoassay tests, reference laboratory kits and services, and blood glucose monitors; and other non-pharmaceutical products, which include nutritionals, as well as products and services in biodevices, genetic tests, and precision animal health. It markets its products to veterinarians, livestock producers, and pet owners. The company has collaboration Blacksmith Medicines, Inc. to discover and develop novel antibiotics for animal health. Zoetis Inc. was founded in 1950 and is headquartered in Parsippany, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"16-02-2025 19:33:53"},{"Company Name":"Crocs, Inc.","Symbol":"CROX","Current Price":"108.43","Latest MA":"120.72","Price Target":130.02357,"Difference from MA":"-10.18%","Difference from Open":"-1.07%","Change from Yesterday":"-1.47%","Change from Last Report":"0.00","Latest Volume":"2,465,510","Market Cap":"6,078,173,696","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":7.8307357,"PB Ratio":3.3372316,"Previous Close":110.05,"ROE":0.57761,"DTE":92.677,"Industry":"Footwear & Accessories","Sector":"Consumer Cyclical","Beta":1.934,"Trailing PEG":null,"Trailing PE":6.8280854,"Trailing PS":1.4817196,"Quick Ratio":0.627,"Day High":110.73,"Day Low":106.25,"VS Average Volume":1.6389357165,"Company Summary":"Crocs, Inc., together with its subsidiaries, designs, develops, manufactures, markets, distributes, and sells casual lifestyle footwear and accessories for men, women, and children under the Crocs and HEYDUDE Brands in the United States and internationally. The company offers various footwear products, including clogs, sandals, platforms, wedges, boots, slides, flip flops, flips, sneakers, and slippers, as well as lace and beads, straps, strap covers, bags, socks, and charms. It sells its products through wholesalers, retail stores, e-commerce sites, third-party marketplaces, and kiosks\/store-in-store locations. Crocs, Inc. was founded in 1999 and is headquartered in Broomfield, Colorado.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"16-02-2025 19:33:53"},{"Company Name":"Bruker Corporation","Symbol":"BRKR","Current Price":"50.04","Latest MA":"60.85","Price Target":68.41615,"Difference from MA":"-17.77%","Difference from Open":"-2.83%","Change from Yesterday":"-2.17%","Change from Last Report":"0.00","Latest Volume":"2,044,190","Market Cap":"7,585,964,032","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.072565,"PB Ratio":4.2213597,"Previous Close":51.15,"ROE":0.0705,"DTE":115.376,"Industry":"Medical Devices","Sector":"Healthcare","Beta":1.164,"Trailing PEG":null,"Trailing PE":65.84211,"Trailing PS":2.2534351,"Quick Ratio":0.579,"Day High":51.95,"Day Low":49.84,"VS Average Volume":1.3140922003,"Company Summary":"Bruker Corporation, together with its subsidiaries, develops, manufactures, and distributes scientific instruments, and analytical and diagnostic solutions in the United States, Europe, the Asia Pacific, and internationally. The company operates through four segments: Bruker Scientific Instruments (BSI) BioSpin, BSI CALID, BSI Nano, and Bruker Energy & Supercon Technologies. It offers life science tools, and single and multiple modality systems; life science mass spectrometry; MALDI Biotyper rapid pathogen identification platform and related test kits, DNA test strips, and fluorescence-based polymerase chain reaction technology; genotype and fluorotype molecular diagnostics kits; research, analytical, and process analysis instruments and solutions; SARS-CoV 2 testing for the diagnosis of COVID-19 infection; and Fluorotyper-SARS-CoV 2 plus kits. It also provides range of portable analytical and bioanalytical detection systems, and related products; X-ray instruments; analytical tools for electron microscopes, as well as handheld, portable, and mobile X-ray fluorescence spectrometry instruments; atomic force microscopy instrumentation; non-contact nanometer resolution solution topography; and automated X-ray metrology, automated AFM defect-detection, and photomask repair and cleaning equipment. In addition, the company offers advanced optical fluorescence microscopy instruments; products and services to support the multi-omics needs of researchers in translational research, drug, and biomarker discovery; superconducting materials, such as metallic low temperature superconductors; devices and complex tools based on metallic low temperature superconductors; and non-superconducting high technology tools, such as synchrotron and beamline instrumentation. The company was incorporated in 1991 and is headquartered in Billerica, Massachusetts.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"16-02-2025 19:33:53"},{"Company Name":"American Electric Power Company","Symbol":"AEP","Current Price":"101.83","Latest MA":"96.20","Price Target":101.95294,"Difference from MA":"5.86%","Difference from Open":"0.61%","Change from Yesterday":"0.83%","Change from Last Report":"0.00","Latest Volume":"2,700,426","Market Cap":"54,296,879,104","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.171476,"PB Ratio":2.0140426,"Previous Close":100.99,"ROE":0.113859996,"DTE":170.447,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.565,"Trailing PEG":1.5387,"Trailing PE":18.249105,"Trailing PS":2.7532098,"Quick Ratio":0.237,"Day High":102.915,"Day Low":100.94,"VS Average Volume":0.9309743178,"Company Summary":"American Electric Power Company, Inc., an electric public utility holding company, engages in the generation, transmission, and distribution of electricity for sale to retail and wholesale customers in the United States. It operates through Vertically Integrated Utilities, Transmission and Distribution Utilities, AEP Transmission Holdco, and Generation & Marketing segments. The company generates electricity using coal and lignite, natural gas, renewable, nuclear, hydro, solar, wind, and other energy sources. It also supplies and markets electric power at wholesale to other electric utility companies, rural electric cooperatives, municipalities, and other market participants. American Electric Power Company, Inc. was incorporated in 1906 and is headquartered in Columbus, Ohio.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"16-02-2025 19:33:53"},{"Company Name":"PPL Corporation","Symbol":"PPL","Current Price":"33.73","Latest MA":"32.02","Price Target":35.76438,"Difference from MA":"5.34%","Difference from Open":"-2.20%","Change from Yesterday":"-1.98%","Change from Last Report":"0.00","Latest Volume":"6,264,032","Market Cap":"24,884,711,424","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":17.276173,"PB Ratio":1.7683759,"Previous Close":34.41,"ROE":0.06341,"DTE":119.791,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.852,"Trailing PEG":1.1007,"Trailing PE":28.108332,"Trailing PS":2.94076,"Quick Ratio":0.548,"Day High":34.65,"Day Low":33.7,"VS Average Volume":1.4090652551,"Company Summary":"PPL Corporation, an energy company, focuses on providing electricity and natural gas to approximately 3.6 million customers in the United States. It operates through three segments: Kentucky Regulated, Pennsylvania Regulated, and Rhode Island Regulated. The company delivers electricity to customers in Pennsylvania, Kentucky, Virginia, and Rhode Island; delivers natural gas to customers in Kentucky and Rhode Island; and generates electricity from power plants in Kentucky. PPL Corporation was founded in 1920 and is headquartered in Allentown, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"16-02-2025 19:33:53"},{"Company Name":"Digital Realty Trust, Inc.","Symbol":"DLR","Current Price":"164.28","Latest MA":"166.16","Price Target":188.83333,"Difference from MA":"-1.13%","Difference from Open":"-0.32%","Change from Yesterday":"-0.32%","Change from Last Report":"0.00","Latest Volume":"4,795,044","Market Cap":"56,310,583,296","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":68.08179,"PB Ratio":2.6834805,"Previous Close":164.81,"ROE":0.02664,"DTE":77.704,"Industry":"REIT - Specialty","Sector":"Real Estate","Beta":0.65,"Trailing PEG":10.4668,"Trailing PE":102.03726,"Trailing PS":10.361057,"Quick Ratio":1.378,"Day High":165.63,"Day Low":157.22,"VS Average Volume":2.2431054961,"Company Summary":"Digital Realty brings companies and data together by delivering the full spectrum of data center, colocation, and interconnection solutions. PlatformDIGITAL, the company's global data center platform, provides customers with a secure data meeting place and a proven Pervasive Datacenter Architecture (PDx) solution methodology for powering innovation and efficiently managing Data Gravity challenges. Digital Realty gives its customers access to the connected data communities that matter to them with a global data center footprint of 300+ facilities in 50+ metros across 25+ countries on six continents.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"16-02-2025 19:33:53"},{"Company Name":"TransUnion","Symbol":"TRU","Current Price":"99.74","Latest MA":"96.53","Price Target":117.6,"Difference from MA":"3.33%","Difference from Open":"-0.50%","Change from Yesterday":"-0.51%","Change from Last Report":"0.00","Latest Volume":"2,402,790","Market Cap":"19,459,272,704","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":20.087204,"PB Ratio":4.6096964,"Previous Close":100.25,"ROE":0.07179,"DTE":120.652,"Industry":"Financial Data & Stock Exchanges","Sector":"Financial Services","Beta":1.624,"Trailing PEG":1.1182,"Trailing PE":68.7862,"Trailing PS":4.6511,"Quick Ratio":1.398,"Day High":101.19,"Day Low":98.93,"VS Average Volume":1.6289659941,"Company Summary":"TransUnion operates as a global consumer credit reporting agency that provides risk and information solutions. The company operates through U.S. Markets, International, and Consumer Interactive segments. The U.S. Markets segment provides consumer reports, actionable insights, and analytic services to businesses, which uses its services to acquire new customers; assess consumer ability to pay for services; identify cross-selling opportunities; measure and manage debt portfolio risk; collect debt; verify consumer identities; and mitigate fraud risk. This segment serves various industry vertical markets, including financial services, technology, commerce and communications, insurance, media, services and collections, tenant and employment, and public sectors. The International segment offers credit reports, analytics, technology solutions, and other value-added risk management services; consumer services, which help consumers to manage their personal finances; consumer credit reporting, insurance and auto information solutions, and commercial credit information services. It serves customers in financial services, retail credit, insurance, automotive, collections, public sector, and communications industries through direct and indirect channels. The company was formerly known as TransUnion Holding Company, Inc. and changed its name to TransUnion in March 2015. TransUnion was founded in 1968 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"16-02-2025 19:33:53"},{"Company Name":"Palo Alto Networks, Inc.","Symbol":"PANW","Current Price":"200.03","Latest MA":"180.35","Price Target":211.28064,"Difference from MA":"10.91%","Difference from Open":"4.19%","Change from Yesterday":"-0.92%","Change from Last Report":"0.00","Latest Volume":"13,794,164","Market Cap":"131,259,686,912","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":54.99182,"PB Ratio":20.719908,"Previous Close":201.88,"ROE":0.23378,"DTE":15.221,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.135,"Trailing PEG":2.2307,"Trailing PE":113.65341,"Trailing PS":15.3152895,"Quick Ratio":0.726,"Day High":201.33,"Day Low":188.7584,"VS Average Volume":2.3044269898,"Company Summary":"Palo Alto Networks, Inc. provides cybersecurity solutions worldwide. The company's network security platforms include Prisma Access, a security services edge (SSE) solution, as well as Strata Cloud Manager, a network security management solution. It also provides cloud security solutions, including Prisma Cloud, a cloud native application protection platform; and Code to Cloud platform, as well as offers VM-Series and CN-Series virtual firewalls for inline network security on multi- and hybrid-cloud environments. In addition, the company provides security operation solutions through Cortex platform that includes Cortex XSIAM, an AI-driven security operations platform; Cortex XDR for the prevention, detection, and response to complex cybersecurity attacks; and Cortex XSOAR for security orchestration, automation, and response; and Cortex Xpanse for attack surface management, as well as offers threat intelligence and advisory services under the Unit 42 name. Further, it provides subscription services covering the areas of threat prevention, malware and persistent threat, URL filtering, laptop and mobile device protection, DNS security, Internet of Things security, SaaS security API, and SaaS security inline, as well as threat intelligence, and data loss prevention. Additionally, the company offers professional services, including architecture design and planning, implementation, configuration, and firewall migration; education services, such as certifications, as well as online and in-classroom training; and support services. It sells its products and services through its channel partners, as well as directly to medium to large enterprises, service providers, and government entities operating in various industries, including education, energy, financial services, government entities, healthcare, Internet and media, manufacturing, public sector, and telecommunications. The company was incorporated in 2005 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"16-02-2025 19:33:53"},{"Company Name":"Pacific Gas & Electric Co.","Symbol":"PCG","Current Price":"15.29","Latest MA":"19.06","Price Target":20.81176,"Difference from MA":"-19.77%","Difference from Open":"-2.49%","Change from Yesterday":"-3.53%","Change from Last Report":"0.00","Latest Volume":"24,416,667","Market Cap":"33,539,837,952","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":9.393334,"PB Ratio":1.1739864,"Previous Close":15.85,"ROE":0.088879995,"DTE":191.911,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.989,"Trailing PEG":0.9338,"Trailing PE":13.295652,"Trailing PS":1.3735139,"Quick Ratio":0.893,"Day High":15.92,"Day Low":15.25,"VS Average Volume":1.0465648634,"Company Summary":"PG&E Corporation, through its subsidiary, Pacific Gas and Electric Company, engages in the sale and delivery of electricity and natural gas to customers in northern and central California, the United States. It generates electricity using nuclear, hydroelectric, fossil fuel-fired, fuel cell, and photovoltaic sources. The company owns and operates interconnected transmission lines; electric transmission substations, distribution lines, switching and distribution substations; and natural gas transmission, storage, and distribution system consisting of distribution pipelines, backbone and local transmission pipelines, and various storage facilities. It serves residential, commercial, industrial, and agricultural customers, as well as natural gas-fired electric generation facilities. PG&E Corporation was incorporated in 1905 and is based in Oakland, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"16-02-2025 19:33:53"},{"Company Name":"DexCom, Inc.","Symbol":"DXCM","Current Price":"89.07","Latest MA":"77.62","Price Target":100.18783,"Difference from MA":"14.76%","Difference from Open":"3.53%","Change from Yesterday":"5.92%","Change from Last Report":"0.00","Latest Volume":"7,554,280","Market Cap":"34,799,648,768","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":35.83484,"PB Ratio":16.54961,"Previous Close":84.09,"ROE":0.27628002,"DTE":120.275,"Industry":"Medical Devices","Sector":"Healthcare","Beta":1.142,"Trailing PEG":1.3893,"Trailing PE":62.725353,"Trailing PS":8.628725,"Quick Ratio":1.223,"Day High":89.84,"Day Low":86.0,"VS Average Volume":2.183235259,"Company Summary":"DexCom, Inc., a medical device company, focuses on the design, development, and commercialization of continuous glucose monitoring (CGM) systems in the United States and internationally. The company provides its systems for use by people with diabetes, as well as for use by healthcare providers. Its products include Dexcom G6 and Dexcom G7, integrated CGM systems for diabetes management; Dexcom Share, a remote monitoring system; Dexcom Real-Time API, which enables authorized third-party software developers to integrate real-time CGM data into their digital health apps and devices; and Dexcom ONE, that is designed to replace finger stick blood glucose testing for diabetes treatment decisions. It has also submitted FDA review for Dexcom Stelo for people with type 2 diabetes. The company has a collaboration and license agreement with Verily Life Sciences LLC and Verily Ireland Limited to develop blood-based or interstitial glucose monitoring products. It markets its products directly to endocrinologists, physicians, and diabetes educators. The company was incorporated in 1999 and is headquartered in San Diego, California.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"16-02-2025 19:33:53"},{"Company Name":"Molson Coors Beverage Company","Symbol":"TAP","Current Price":"60.36","Latest MA":"55.64","Price Target":65.11909,"Difference from MA":"8.49%","Difference from Open":"1.75%","Change from Yesterday":"3.11%","Change from Last Report":"0.00","Latest Volume":"3,271,555","Market Cap":"12,233,341,952","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":9.095074,"PB Ratio":0.93681616,"Previous Close":58.54,"ROE":0.08611,"DTE":45.687,"Industry":"Beverages - Brewers","Sector":"Consumer Defensive","Beta":0.867,"Trailing PEG":2.8305,"Trailing PE":11.282244,"Trailing PS":1.0521495,"Quick Ratio":0.595,"Day High":60.5,"Day Low":58.95,"VS Average Volume":1.7869977141,"Company Summary":"Molson Coors Beverage Company manufactures, markets, and sells beer and other malt beverage products under various brands in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company offers flavored malt beverages including hard seltzers, craft, spirits and energy, and ready to drink beverages. It provides its products under Aspall Cider, Blue Moon, Coors Original, Five Trail, Hop Valley brands, Leinenkugel's, Madri, Miller Genuine Draft, Molson Ultra, Sharp's, Staropramen, and Vizzy Hard Seltzer above premier brands; Bergenbier, Borsodi, Carling, Coors Banquet, Coors Light, Jelen, Kamenitza, Miller Lite, Molson Canadian, and Niksicko, Ozujsko under the premium brands; and Branik, Icehouse, Keystone, Miller High Life, Milwaukee's Best, and Steel Reserve under the economy brands. The company was formerly known as Molson Coors Brewing Company and changed its name to Molson Coors Beverage Company in January 2020. Molson Coors Beverage Company was founded in 1774 and is based in Golden, Colorado.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"16-02-2025 19:33:53"},{"Company Name":"Wynn Resorts, Limited","Symbol":"WYNN","Current Price":"88.82","Latest MA":"86.45","Price Target":112.56667,"Difference from MA":"2.75%","Difference from Open":"5.08%","Change from Yesterday":"10.38%","Change from Last Report":"0.00","Latest Volume":"8,891,770","Market Cap":"9,450,536,960","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":17.286343,"PB Ratio":"N\/A","Previous Close":80.47,"ROE":"N\/A","DTE":"N\/A","Industry":"Resorts & Casinos","Sector":"Consumer Cyclical","Beta":1.765,"Trailing PEG":2.2918,"Trailing PE":20.41839,"Trailing PS":1.3258401,"Quick Ratio":1.789,"Day High":89.45,"Day Low":83.525,"VS Average Volume":3.7916378832,"Company Summary":"Wynn Resorts, Limited designs, develops, and operates integrated resorts. The company operates through four segments: Wynn Palace, Wynn Macau, Las Vegas Operations, and Encore Boston Harbor. The Wynn Palace segment operates private gaming salons and sky casinos; a luxury hotel tower with suites, and villas, including a health club, spa, salon, and pool; food and beverage outlets; retail space; meeting and convention space; and performance lake and floral art displays. The Wynn Macau segment operates casino space with private gaming salons, sky casinos, and a poker room; a luxury hotel tower, that include health clubs, spas, a salon, and a pool; food and beverage outlets; retail space; meeting and convention space; and Chinese zodiac-inspired ceiling attractions. The Las Vegas Operations segment operates casino space with private gaming salons, a sky casino, a poker room, and a race and sports book; a luxury hotel tower with suites, and villas, including swimming pools, private cabanas, full-service spas and salons, and a wedding chapel; food and beverage outlets; meeting and convention space; retail space; and theaters, nightclubs, a beach club. The Encore Boston Harbor segment operates casino space with gaming areas, and a poker room; a luxury hotel tower including a spa and salon; food and beverage outlets and a nightclub; retail space; meeting and convention space; and a waterfront park, floral displays, and water shuttle service. Wynn Resorts, Limited was incorporated in 2002 and is based in Las Vegas, Nevada.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"16-02-2025 19:33:53"},{"Company Name":"Ingersoll Rand Inc.","Symbol":"IR","Current Price":"85.72","Latest MA":"95.50","Price Target":103.07312,"Difference from MA":"-10.24%","Difference from Open":"-2.59%","Change from Yesterday":"-7.38%","Change from Last Report":"0.00","Latest Volume":"6,662,297","Market Cap":"34,534,875,136","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":22.582973,"PB Ratio":3.3927016,"Previous Close":92.55,"ROE":0.08424,"DTE":46.436,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":1.435,"Trailing PEG":1.2366,"Trailing PE":41.611652,"Trailing PS":4.773307,"Quick Ratio":1.582,"Day High":89.22,"Day Low":85.57,"VS Average Volume":3.0860397897,"Company Summary":"Ingersoll Rand Inc. provides various mission-critical air, gas, liquid, and solid flow creation technologies services and solutions worldwide. It operates through two segments, Industrial Technologies and Services, and Precision and Science Technologies. The Industrial Technologies and Services segment designs, manufactures, markets, and services air and gas compression, vacuum, and blower products; fluid transfer equipment and loading systems; and power tools and lifting equipment, including associated aftermarket parts, consumables, air treatment equipment, controls, other accessories, and services under the under the Ingersoll Rand, Gardner Denver, Nash, CompAir, Elmo Rietschle brands, etc. The Precision and Science Technologies segment designs, manufactures, and markets diaphragm, piston, water-powered, peristaltic, gear, vane, progressive cavity, and syringe pumps; and gas boosters, hydrogen compression systems, automated liquid handling systems, odorant injection systems, controls, software, and other related components and accessories for liquid and gas dosing, transfer, dispensing, compression, sampling, pressure management, and flow control in specialized or critical applications under the Air Dimensions, Albin, ARO, Dosatron, Haskel, Ingersoll Rand, LMI, Maximus, Milton Roy, MP, Oberdorfer, Seepex, Thomas, Welch, Williams, YZ, and Zinnser Analytic brand names. This segment's products are used in medical, life sciences, industrial manufacturing, water and wastewater, chemical processing, energy, food and beverage, agriculture, and other markets. It sells through an integrated network of direct sales representatives and independent distributors. The company was formerly known as Gardner Denver Holdings, Inc. and changed its name to Ingersoll Rand Inc. in March 2020. Ingersoll Rand Inc. was founded in 1859 and is headquartered in Davidson, North Carolina.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"16-02-2025 19:33:53"},{"Company Name":"Datadog, Inc.","Symbol":"DDOG","Current Price":"131.01","Latest MA":"129.95","Price Target":159.6545,"Difference from MA":"0.82%","Difference from Open":"-1.95%","Change from Yesterday":"-3.59%","Change from Last Report":"0.00","Latest Volume":"8,524,993","Market Cap":"44,507,111,424","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":61.32451,"PB Ratio":16.425526,"Previous Close":135.89,"ROE":0.07753,"DTE":67.868,"Industry":"Software - Application","Sector":"Technology","Beta":1.149,"Trailing PEG":0.8262,"Trailing PE":251.9423,"Trailing PS":16.580683,"Quick Ratio":2.57,"Day High":135.81,"Day Low":129.7101,"VS Average Volume":1.6851908666,"Company Summary":"Datadog, Inc. operates an observability and security platform for cloud applications in North America and internationally. The company's products comprise infrastructure and application performance monitoring, log management, digital experience monitoring, continuous profiler, database monitoring, data streams and universal service monitoring, network monitoring, incident management, workflow automation, observability pipelines, cloud cost and cloud security management, application security management, cloud SIEM, sensitive data scanner, and CI visibility. Datadog, Inc. was incorporated in 2010 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"16-02-2025 19:33:53"},{"Company Name":"Airbnb, Inc.","Symbol":"ABNB","Current Price":"161.42","Latest MA":"131.39","Price Target":153.21545,"Difference from MA":"22.86%","Difference from Open":"2.05%","Change from Yesterday":"14.45%","Change from Last Report":"0.00","Latest Volume":"21,543,810","Market Cap":"101,781,774,336","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":32.60641,"PB Ratio":11.955266,"Previous Close":141.04,"ROE":0.31948,"DTE":27.271,"Industry":"Travel Services","Sector":"Consumer Cyclical","Beta":1.128,"Trailing PEG":23.81,"Trailing PE":39.17961,"Trailing PS":9.167877,"Quick Ratio":1.059,"Day High":163.93,"Day Low":156.93,"VS Average Volume":4.5657439872,"Company Summary":"Airbnb, Inc., together with its subsidiaries, operates a platform that enables hosts to offer stays and experiences to guests worldwide. Its marketplace connects hosts and guests online or through mobile devices to book spaces and experiences. It also offers gift cards. The company was formerly known as AirBed & Breakfast, Inc. and changed its name to Airbnb, Inc. in November 2010. Airbnb, Inc. was founded in 2007 and is headquartered in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"16-02-2025 19:33:53"},{"Company Name":"Brookfield Corporation","Symbol":"BN","Current Price":"60.92","Latest MA":"53.71","Price Target":66.875,"Difference from MA":"13.42%","Difference from Open":"-0.75%","Change from Yesterday":"0.89%","Change from Last Report":"0.00","Latest Volume":"2,338,876","Market Cap":"91,890,507,776","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.378194,"PB Ratio":2.1943665,"Previous Close":60.38,"ROE":0.011109999,"DTE":141.969,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.771,"Trailing PEG":null,"Trailing PE":196.51613,"Trailing PS":1.0355611,"Quick Ratio":0.923,"Day High":61.5,"Day Low":60.64,"VS Average Volume":1.1029000406,"Company Summary":"Brookfield Corporation is an alternative asset manager and REIT\/Real Estate Investment Manager firm focuses on real estate, renewable power, infrastructure and venture capital and private equity assets. It manages a range of public and private investment products and services for institutional and retail clients. It typically makes investments in sizeable, premier assets across geographies and asset classes. It invests both its own capital as well as capital from other investors. Within private equity and venture capital, it focuses on acquisition, early ventures, control buyouts and financially distressed, buyouts and corporate carve-outs, recapitalizations, convertible, senior and mezzanine financings, operational and capital structure restructuring, strategic re-direction, turnaround, and under-performing midmarket companies. It invests in both public debt and equity markets. It invests in private equity sectors with focus on Business Services include infrastructure, healthcare, road fuel distribution and marketing, construction and real estate; Industrials include manufacturers of automotive batteries, graphite electrodes, returnable plastic packaging, and sanitation management and development; and Residential\/ infrastructure services. It targets companies which likely possess underlying real assets, primarily in sectors such as industrial products, building materials, metals, mining, homebuilding, oil and gas, paper and packaging, manufacturing and forest product sectors. It invests globally with focus on North America including Brazil, the United States, Canada; Europe; and Australia; and Asia-Pacific. The firm considers equity investments in the range of $2 million to $500 million. It has a four-year investment period and a 10-year term with two one-year extensions. The firm prefers to take minority stake and majority stake. Brookfield Corporation was founded in 1997 and based in Toronto, Canada with additional offices across Northern America; South America; Europe; Middle East and Asia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"16-02-2025 19:33:53"},{"Company Name":"Noble Corporation plc A","Symbol":"NE","Current Price":"29.12","Latest MA":"34.90","Price Target":39.63636,"Difference from MA":"-16.57%","Difference from Open":"-2.12%","Change from Yesterday":"-1.65%","Change from Last Report":"0.00","Latest Volume":"2,331,824","Market Cap":"4,670,353,408","Earning Date":"2025-02-17","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":9.973389,"PB Ratio":0.99661183,"Previous Close":29.61,"ROE":0.11773,"DTE":45.023,"Industry":"Oil & Gas Drilling","Sector":"Energy","Beta":1.002,"Trailing PEG":null,"Trailing PE":8.564706,"Trailing PS":1.7651159,"Quick Ratio":1.381,"Day High":30.07,"Day Low":28.87,"VS Average Volume":1.4339934998,"Company Summary":"Noble Corporation plc operates as an offshore drilling contractor for the oil and gas industry worldwide. The company provides contract drilling services to the oil and gas industry through its fleet of mobile offshore drilling units. It operates drilling rigs, such as floaters and jackups. Noble Corporation plc was founded in 1921 and is headquartered in Sugar Land, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"16-02-2025 19:33:53"}]