[{"Company Name":"BGC Group, Inc.","Symbol":"BGC","Current Price":"9.34","Latest MA":"9.50","Price Target":12.0,"Difference from MA":"-1.72%","Difference from Open":"1.41%","Change from Yesterday":"-1.58%","Change from Last Report":"0.00","Latest Volume":"3,526,039","Market Cap":"4,548,402,688","Earning Date":"2025-02-14","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":7.9829063,"PB Ratio":5.264938,"Previous Close":9.49,"ROE":0.12765999,"DTE":152.907,"Industry":"Capital Markets","Sector":"Financial Services","Beta":1.472,"Trailing PEG":null,"Trailing PE":40.608696,"Trailing PS":2.1458383,"Quick Ratio":1.424,"Day High":9.78,"Day Low":9.04,"VS Average Volume":1.1825222727,"Company Summary":"BGC Group, Inc. operates as a financial brokerage and technology company in the United States and internationally. The company offers various brokerage products, such as fixed income, such as government bonds, corporate bonds, and other debt instruments, as well as related interest rate derivatives and credit derivatives; equities, energy and commodities, shipping, insurance, and futures and options. It also provides trade execution, connectivity solutions, brokerage services, clearing, trade compression and other post-trade services, information, and other back-office services to an assortment of financial and non-financial institutions. In addition, the company offers electronic and hybrid brokerage, other financial technology solutions, market data and related information services. Further, its integrated platform is designed to provide flexibility to customers with regard to price discovery, execution and processing of transactions, Hybrid, or in various markets, as well as fully electronic brokerage services in connection with transactions executed either OTC or through an exchange. The company primarily serves banks, broker-dealers, investment banks, trading firms, hedge funds, governments, and corporations, as well as investment firms. BGC Group, Inc. was founded in 1945 and is headquartered in New York, New York.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"Roku, Inc.","Symbol":"ROKU","Current Price":"99.07","Latest MA":"72.61","Price Target":100.06185,"Difference from MA":"36.45%","Difference from Open":"-1.53%","Change from Yesterday":"14.14%","Change from Last Report":"0.00","Latest Volume":"18,340,877","Market Cap":"14,384,865,280","Earning Date":"2025-02-14","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":244.61728,"PB Ratio":5.8462176,"Previous Close":86.8,"ROE":-0.0722,"DTE":24.921,"Industry":"Entertainment","Sector":"Communication Services","Beta":2.072,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":3.6919525,"Quick Ratio":2.309,"Day High":104.96,"Day Low":96.16,"VS Average Volume":5.4083322669,"Company Summary":"Roku, Inc., together with its subsidiaries, operates a TV streaming platform in the United states and internationally. The company operates in two segments, Platform and Devices. Its streaming platform allows users to find and access TV shows, movies, news, sports, and others. The Platform segment offers digital advertising, including direct and programmatic video advertising, media and entertainment promotional spending, and related services; and streaming services distribution, such as subscription and transaction revenue shares, and sale of premium subscriptions and branded app buttons on remote controls. The Devices segment provides sale of streaming players, Roku-branded TVs, smart home products and services, audio products, and related accessories as well as licensing arrangements with service operators. Roku, Inc. was incorporated in 2002 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"Moderna, Inc.","Symbol":"MRNA","Current Price":"32.99","Latest MA":"60.82","Price Target":62.00545,"Difference from MA":"-45.76%","Difference from Open":"7.98%","Change from Yesterday":"3.35%","Change from Last Report":"0.00","Latest Volume":"25,131,466","Market Cap":"12,695,145,472","Earning Date":"2025-02-14","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":-4.923565,"PB Ratio":1.064915,"Previous Close":31.92,"ROE":-0.17524,"DTE":11.361,"Industry":"Biotechnology","Sector":"Healthcare","Beta":1.585,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":2.4985526,"Quick Ratio":3.954,"Day High":33.91,"Day Low":29.2543,"VS Average Volume":2.3780878564,"Company Summary":"Moderna, Inc., a biotechnology company, discovers, develops, and commercializes messenger RNA therapeutics and vaccines for the treatment of infectious diseases, immuno-oncology, rare diseases, autoimmune, and cardiovascular diseases in the United States, Europe, and internationally. Its respiratory vaccines include COVID-19, influenza, and respiratory syncytial virus, spikevax, and hMPV\/PIV3 vaccines; latent vaccines comprise cytomegalovirus, epstein-barr virus, herpes simplex virus, varicella zoster virus, and human immunodeficiency virus vaccines; public health vaccines consists of Zika, Nipah, Mpox vaccines; and infectious diseases vaccines, such as lyme and norovirus vaccines. The company also offers systemic secreted and cell surface therapeutics; cancer vaccines, such as personalized cancer, KRAS, and checkpoint vaccines; intratumoral immuno-oncology products; rare disease intracellular therapeutics; and inhaled pulmonary therapeutics. It has strategic alliances and collaborations with AstraZeneca; Merck & Co., Inc; Vertex Pharmaceuticals Incorporated; Vertex Pharmaceuticals (Europe) Limited; Chiesi Farmaceutici S.p.A.; Metagenomi, Inc.; Carisma Therapeutics, Inc.; CytomX Therapeutics; Defense Advanced Research Projects Agency; Biomedical Advanced Research and Development Authority; Institute for Life Changing Medicines; The Bill & Melinda Gates Foundation; and OpenAI. The company was formerly known as Moderna Therapeutics, Inc. and changed its name to Moderna, Inc. in August 2018. Moderna, Inc. was founded in 2010 and is headquartered in Cambridge, Massachusetts.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"Coinbase Global, Inc.","Symbol":"COIN","Current Price":"274.31","Latest MA":"237.64","Price Target":320.70834,"Difference from MA":"15.43%","Difference from Open":"-4.76%","Change from Yesterday":"-7.98%","Change from Last Report":"0.00","Latest Volume":"18,992,572","Market Cap":"68,673,507,328","Earning Date":"2025-02-14","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":40.23716,"PB Ratio":7.866196,"Previous Close":298.11,"ROE":0.21316,"DTE":51.515,"Industry":"Financial Data & Stock Exchanges","Sector":"Financial Services","Beta":3.343,"Trailing PEG":0.7724,"Trailing PE":46.493217,"Trailing PS":13.732312,"Quick Ratio":0.029,"Day High":291.5,"Day Low":274.0,"VS Average Volume":1.8345259518,"Company Summary":"Coinbase Global, Inc. provides financial infrastructure and technology for the crypto economy in the United States and internationally. The company offers the primary financial account in the crypto economy for consumers; and a marketplace with a pool of liquidity for transacting in crypto assets for institutions. It also provides technology and services that enable developers to build crypto products and securely accept crypto assets as payment. The company was founded in 2012 and is based in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"DraftKings Inc.","Symbol":"DKNG","Current Price":"53.49","Latest MA":"38.63","Price Target":52.92857,"Difference from MA":"38.46%","Difference from Open":"9.72%","Change from Yesterday":"15.16%","Change from Last Report":"0.00","Latest Volume":"48,198,405","Market Cap":"26,083,223,552","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":24.497929,"PB Ratio":24.214577,"Previous Close":46.45,"ROE":-0.44426,"DTE":124.782,"Industry":"Gambling","Sector":"Consumer Cyclical","Beta":1.819,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":5.663145,"Quick Ratio":0.572,"Day High":53.61,"Day Low":48.04,"VS Average Volume":6.1242508027,"Company Summary":"DraftKings Inc. operates as a digital sports entertainment and gaming company in the United States and internationally. It provides online sports betting and casino, daily fantasy sports, media, and other consumer products, as well as retails sportsbooks. The company also engages in the design and development of sports betting and casino gaming software for online and retail sportsbooks, and iGaming operators. In addition, it offers DraftKings marketplace, a digital collectibles ecosystem designed for mainstream accessibility that offers curated NFT drops and supports secondary-market transactions. The company was founded in 2012 and is headquartered in Boston, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"DaVita Inc.","Symbol":"DVA","Current Price":"157.42","Latest MA":"155.97","Price Target":161.59332,"Difference from MA":"0.93%","Difference from Open":"2.22%","Change from Yesterday":"-11.09%","Change from Last Report":"0.00","Latest Volume":"5,099,069","Market Cap":"12,912,218,112","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":11.873039,"PB Ratio":33.636753,"Previous Close":177.06,"ROE":0.44884,"DTE":549.552,"Industry":"Medical Care Facilities","Sector":"Healthcare","Beta":0.887,"Trailing PEG":1.3189,"Trailing PE":16.963362,"Trailing PS":1.0193899,"Quick Ratio":1.265,"Day High":159.27,"Day Low":150.11,"VS Average Volume":7.7575623419,"Company Summary":"DaVita Inc. provides kidney dialysis services for patients suffering from chronic kidney failure in the United States. The company operates kidney dialysis centers and provides related lab services in outpatient dialysis centers. It also offers outpatient, hospital inpatient, and home-based hemodialysis services; operates clinical laboratories that provide routine laboratory tests for dialysis and other physician-prescribed laboratory tests for ESRD patients; and management and administrative services to outpatient dialysis centers. In addition, the company offers integrated care and disease management services to patients in risk-based and other integrated care arrangements; clinical research programs; physician services; and comprehensive kidney care services. Further, it engages in the provision of acute inpatient dialysis services and related laboratory services; and transplant software business. The company was formerly known as DaVita HealthCare Partners Inc. and changed its name to DaVita Inc. in September 2016. DaVita Inc. was incorporated in 1994 and is headquartered in Denver, Colorado.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"GE HealthCare Technologies Inc.","Symbol":"GEHC","Current Price":"92.21","Latest MA":"85.21","Price Target":99.457,"Difference from MA":"8.21%","Difference from Open":"-1.06%","Change from Yesterday":"-1.36%","Change from Last Report":"0.00","Latest Volume":"3,421,330","Market Cap":"42,167,447,552","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":17.628986,"PB Ratio":5.065092,"Previous Close":93.48,"ROE":0.21853,"DTE":126.093,"Industry":"Health Information Services","Sector":"Healthcare","Beta":"N\/A","Trailing PEG":2.4686,"Trailing PE":21.246542,"Trailing PS":2.1559103,"Quick Ratio":0.883,"Day High":93.2099,"Day Low":91.18,"VS Average Volume":1.1444236387,"Company Summary":"GE HealthCare Technologies Inc. engages in the development, manufacture, and marketing of products, services, and complementary digital solutions used in the diagnosis, treatment, and monitoring of patients in the United States, Canada, and internationally. The company operates through four segments: Imaging, Ultrasound, Patient Care Solutions, and Pharmaceutical Diagnostics. The Imaging segment offers molecular imaging, computed tomography (CT) scanning, magnetic resonance (MR) imaging, image-guided therapy, X-ray systems, and women's health products. The Ultrasound segment provides medical devices and solutions for screening, diagnosis, treatment, and monitoring of certain diseases in clinical areas, such as radiology and primary care, women's health, cardiovascular, and point of care and handheld ultrasound solutions, as well as surgical visualization and guidance products. The Patient Care Solutions segment provides medical devices, consumables, services, and digital solutions. Its portfolio includes patient monitoring solutions, anesthesia delivery and respiratory care products, electrocardiogram solutions, maternal infant care products, and consumables and services. The Pharmaceutical Diagnostics supplies diagnostic agents, including CT, angiography and X-ray, MR, single-photon emission computed tomography, positron emission tomography, and ultrasound to the radiology and nuclear medicine industry. The segment also provides contrast media pharmaceuticals that are administered to a patient prior to certain diagnostic scans to increase the visibility of tissues or structures during imaging exams; and molecular imaging agents or radiopharmaceuticals, which are molecular tracers labeled with radioisotopes. It has an AI collaboration with Mass General Brigham. The company was formerly known as GE Healthcare Holding LLC and changed its name to GE HealthCare Technologies Inc. in December 2022. The company was incorporated in 2022 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"Duke Energy Corporation (Holdin","Symbol":"DUK","Current Price":"111.60","Latest MA":"111.77","Price Target":121.445,"Difference from MA":"-0.15%","Difference from Open":"-1.47%","Change from Yesterday":"-2.06%","Change from Last Report":"0.00","Latest Volume":"3,564,745","Market Cap":"86,601,596,928","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.55656,"PB Ratio":1.7889489,"Previous Close":112.905,"ROE":0.088369995,"DTE":169.205,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.457,"Trailing PEG":2.5034,"Trailing PE":19.578947,"Trailing PS":2.9108803,"Quick Ratio":0.29,"Day High":113.93,"Day Low":111.53,"VS Average Volume":1.101763566,"Company Summary":"Duke Energy Corporation, together with its subsidiaries, operates as an energy company in the United States. It operates through two segments: Electric Utilities and Infrastructure (EU&I), and Gas Utilities and Infrastructure (GU&I). The EU&I segment generates, transmits, distributes, and sells electricity in the Carolinas, Florida, and the Midwest. It generates electricity through coal, hydroelectric, natural gas, oil, solar and wind sources, renewables, and nuclear fuel. This segment also engages in the wholesale of electricity to municipalities, electric cooperative utilities, and load-serving entities. The GU&I segment distributes natural gas to residential, commercial, industrial, and power generation natural gas customers; and invests in pipeline transmission projects, renewable natural gas projects, and natural gas storage facilities. The company was formerly known as Duke Energy Holding Corp. and changed its name to Duke Energy Corporation in April 2006. Duke Energy Corporation was founded in 1904 and is headquartered in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"US Foods Holding Corp.","Symbol":"USFD","Current Price":"71.25","Latest MA":"63.01","Price Target":79.45,"Difference from MA":"13.09%","Difference from Open":"0.32%","Change from Yesterday":"0.20%","Change from Last Report":"0.00","Latest Volume":"3,795,466","Market Cap":"16,596,903,936","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":15.485899,"PB Ratio":3.641335,"Previous Close":71.11,"ROE":0.12368,"DTE":107.859,"Industry":"Food Distribution","Sector":"Consumer Defensive","Beta":1.661,"Trailing PEG":null,"Trailing PE":35.272278,"Trailing PS":0.44469494,"Quick Ratio":0.681,"Day High":71.87,"Day Low":70.4,"VS Average Volume":1.9888053699,"Company Summary":"US Foods Holding Corp., together with its subsidiaries, engages in marketing, sale, and distribution of fresh, frozen, and dry food and non-food products to foodservice customers in the United States. The company's customers include independently owned single and multi-unit restaurants, regional concepts, national restaurant chains, hospitals, nursing homes, hotels and motels, country clubs, government and military organizations, colleges and universities, and retail locations. The company was formerly known as USF Holding Corp. and changed its name to US Foods Holding Corp. in February 2016. US Foods Holding Corp. was incorporated in 2007 and is headquartered in Rosemont, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"Summit Materials, Inc.","Symbol":"SUM","Current Price":"52.49","Latest MA":"44.31","Price Target":"N\/A","Difference from MA":"18.47%","Difference from Open":"0.19%","Change from Yesterday":"-0.08%","Change from Last Report":"0.00","Latest Volume":"4,694,636","Market Cap":"9,228,477,440","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":24.99524,"PB Ratio":2.0728192,"Previous Close":52.45,"ROE":0.04364,"DTE":65.584,"Industry":"Building Materials","Sector":"Basic Materials","Beta":1.142,"Trailing PEG":null,"Trailing PE":61.75294,"Trailing PS":2.457947,"Quick Ratio":2.431,"Day High":54.07,"Day Low":52.4,"VS Average Volume":1.1774317858,"Company Summary":"Summit Materials, Inc. operates as a vertically integrated construction materials company in the United States and Canada. It operates in three segments: West, East, and Cement. The company offers aggregates, cement, ready-mix concrete, asphalt paving mixes, and concrete products, as well as plastics components. It also provides asphalt paving and related services. In addition, the company operates municipal waste, construction, and demolition debris landfills; and liquid asphalt terminals. The company serves the public infrastructure, and residential and nonresidential end markets. Summit Materials, Inc. was founded in 2009 and is headquartered in Denver, Colorado. As of February 10, 2025, Summit Materials, Inc. operates as a subsidiary of Quikrete Holdings, Inc.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"Howmet Aerospace Inc.","Symbol":"HWM","Current Price":"133.42","Latest MA":"105.56","Price Target":131.85957,"Difference from MA":"26.39%","Difference from Open":"3.53%","Change from Yesterday":"4.17%","Change from Last Report":"0.00","Latest Volume":"3,731,901","Market Cap":"53,981,732,864","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":34.108456,"PB Ratio":12.212357,"Previous Close":128.08,"ROE":0.25719,"DTE":78.925,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.293,"Trailing PEG":null,"Trailing PE":47.65,"Trailing PS":7.4252725,"Quick Ratio":0.824,"Day High":133.92,"Day Low":126.89,"VS Average Volume":1.5120934217,"Company Summary":"Howmet Aerospace Inc. provides advanced engineered solutions for the aerospace and transportation industries in the United States, Japan, France, Germany, the United Kingdom, Mexico, Italy, Canada, Poland, China, and internationally. It operates through four segments: Engine Products, Fastening Systems, Engineered Structures, and Forged Wheels. The Engine Products segment offers airfoils and seamless rolled rings primarily for aircraft engines and industrial gas turbines; and rotating and structural parts. The Fastening Systems segment produces aerospace fastening systems, as well as commercial transportation, industrial, and other fasteners; and latches, bearings, fluid fittings, and installation tools. The Engineered Structures segment provides titanium ingots and mill products, aluminum and nickel forgings, and machined components and assemblies for aerospace and defense applications; and titanium forgings, extrusions, and forming and machining services for airframe, wing, aero-engine, and landing gear components. The Forged Wheels segment offers forged aluminum wheels and related products for heavy-duty trucks and commercial transportation markets. The company was formerly known as Arconic Inc. Howmet Aerospace Inc. was founded in 1888 and is based in Pittsburgh, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"GoDaddy Inc.","Symbol":"GDDY","Current Price":"182.19","Latest MA":"176.47","Price Target":218.42612,"Difference from MA":"3.24%","Difference from Open":"-6.45%","Change from Yesterday":"-14.28%","Change from Last Report":"0.00","Latest Volume":"4,122,673","Market Cap":"25,577,838,592","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":19.84031,"PB Ratio":71.67191,"Previous Close":212.54,"ROE":"N\/A","DTE":1107.373,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.114,"Trailing PEG":null,"Trailing PE":28.290373,"Trailing PS":5.7081923,"Quick Ratio":0.339,"Day High":195.7,"Day Low":181.72,"VS Average Volume":3.3855533885,"Company Summary":"GoDaddy Inc. engages in the design and development of cloud-based products in the United States and internationally. It operates through two segments: Applications and Commerce, and Core Platform. The Applications and Commerce segment provides applications products, including Websites + Marketing, a mobile-optimized online tool that enables customers to build websites and e-commerce enabled online stores; and Managed WordPress, a streamlined and optimized website building that allows customers to easily build and manage a faster WordPress site; Managed WooCommerce Stores to sell anything and anywhere online; and marketing tools and services, such as GoDaddy Studio mobile application, search engine optimization, Meta and Google My Business, and email and social media marketing designed to help businesses acquire and engage customers and create content. The segment also offers connected commerce comprising Smart Terminal, a dual screen all-in-one Point-of-Sale system that allows customers to manage in-store inventory and product catalogs and take payments; GoDaddy Payments, a payment facilitator that enables customers to accept all major forms of payments; and email service plans with a multi-feature web interface, and Microsoft Office 365 accounts that connects to customers' domains. The Core Platform segment offers domain products, including primary registrations, domain aftermarket platform, and domain name add-ons, as well as GoDaddy Registry, a provider of domain name registry services; and hosting and security services comprising shared website hosting, virtual private servers, and managed wordpress hosting services, as well as security products with a comprehensive suite of tools designed to help secure customers' online presence. The company serves small businesses, individuals, organizations, developers, designers, and domain investors. GoDaddy Inc. was founded in 1997 and is headquartered in Tempe, Arizona.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"Informatica Inc.","Symbol":"INFA","Current Price":"19.75","Latest MA":"25.43","Price Target":24.55882,"Difference from MA":"-22.35%","Difference from Open":"18.48%","Change from Yesterday":"-21.53%","Change from Last Report":"0.00","Latest Volume":"27,833,350","Market Cap":"6,031,057,408","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":14.755544,"PB Ratio":2.5044382,"Previous Close":25.17,"ROE":0.028970001,"DTE":77.673,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.044,"Trailing PEG":null,"Trailing PE":658.3334,"Trailing PS":3.6399844,"Quick Ratio":1.895,"Day High":19.85,"Day Low":16.38,"VS Average Volume":17.0771311173,"Company Summary":"Informatica Inc. develops an artificial intelligence-powered platform that connects, manages, and unifies data across multi-vendor, multi-cloud, and hybrid systems at enterprise scale worldwide. The company's platform includes a suite of interoperable data management products, including data integration products to ingest, transform, and integrate data; API and application integration products that enable users to create and manage APIs and integration processes for app-to-app synchronization, business process orchestration, B2B partner management, application development, and API management; data quality and observability products to profile, cleanse, standardize, observe, and monitor data to deliver accurate, complete, and consistent data; and master data management products to create an authoritative single source of truth of business-critical data. Its platform also includes customer and business 360 application that allow business analysts to create 360-degree views of business data domains like customer, product, supplier, reference, and finance with simplified business user experiences; data catalog products that enables customers to quickly find, access, and understand enterprise data using a simple Google-like search experience; governance and privacy products that help users define policies, govern data, and ensure compliance with industry and corporate policies; and a data marketplace that delivers cloud shopping experience for data consumers and enables data sharing and AI models across organizations to facilitate data-driven decision making. In addition, the company provides CLAIRE GPT, GenAI-powered data management assistant. Further, it offers maintenance and professional services. The company sells its products through its direct sales team. The company was founded in 1993 and is headquartered in Redwood City, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"Zoetis Inc.","Symbol":"ZTS","Current Price":"157.52","Latest MA":"178.56","Price Target":207.07,"Difference from MA":"-11.78%","Difference from Open":"-3.94%","Change from Yesterday":"-4.49%","Change from Last Report":"0.00","Latest Volume":"7,612,519","Market Cap":"71,067,508,736","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":22.925272,"PB Ratio":13.589855,"Previous Close":164.93,"ROE":0.47303,"DTE":129.442,"Industry":"Drug Manufacturers - Specialty & Generic","Sector":"Healthcare","Beta":0.896,"Trailing PEG":2.5654,"Trailing PE":28.744526,"Trailing PS":7.7652435,"Quick Ratio":1.836,"Day High":164.54,"Day Low":156.34,"VS Average Volume":2.8217266292,"Company Summary":"Zoetis Inc. engages in the discovery, development, manufacture, and commercialization of animal health medicines, vaccines, and diagnostic products and services in the United States and internationally. The company commercializes products primarily across species, including livestock, such as cattle, swine, poultry, fish, and sheep and others; and companion animals comprising dogs, cats, and horses. It also offers parasiticides, vaccines, dermatology, other pharmaceutical, anti-infectives, animal health diagnostics, and medicated feed additives. In addition, the company provides animal health diagnostics, including point-of-care diagnostic products, instruments and reagents, rapid immunoassay tests, reference laboratory kits and services, and blood glucose monitors; and other non-pharmaceutical products, which include nutritionals, as well as products and services in biodevices, genetic tests, and precision animal health. It markets its products to veterinarians, livestock producers, and pet owners. The company has collaboration Blacksmith Medicines, Inc. to discover and develop novel antibiotics for animal health. Zoetis Inc. was founded in 1952 and is headquartered in Parsippany, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"Liberty Global Ltd.","Symbol":"LBTYA","Current Price":"11.03","Latest MA":"16.74","Price Target":19.48518,"Difference from MA":"-34.11%","Difference from Open":"0.00%","Change from Yesterday":"0.73%","Change from Last Report":"0.00","Latest Volume":"2,865,726","Market Cap":"4,002,875,136","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":-8.161544,"PB Ratio":0.2124504,"Previous Close":10.95,"ROE":-0.20661,"DTE":103.004,"Industry":"Telecom Services","Sector":"Communication Services","Beta":1.097,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.52158123,"Quick Ratio":1.051,"Day High":11.045,"Day Low":10.87,"VS Average Volume":1.2606527867,"Company Summary":"Liberty Global Ltd., together with its subsidiaries, provides broadband internet, video, fixed-line telephony, and mobile communications services to residential and business customers. It offers value-added broadband services, such as WiFi features, security, anti-virus, firewall, spam protection, smart home services, online storage solutions, and web spaces; and Connect Box that delivers in-home Wi-Fi service. The company provides various tiers of digital video programming and audio services, as well as digital video recorders and multimedia home gateway systems; Horizon 5, a cloud-based, multi-screen entertainment platform that combines linear television, including recording and replay features and video-on-demand services; Horizon Go, an online mobile app; and channels, including general entertainment, sports, movies, series, documentaries, lifestyles, news, adult, children, and ethnic and foreign channels. In addition, it offers postpaid and prepaid mobile services; circuit-switched telephony services; and personal call manager, unified messaging, and a second or third phone line at an incremental cost. Further, the company offers business services comprising voice, advanced data, video, wireless, cloud-based services, and mobile and converged fixed-mobile services to small or home offices, small businesses, and medium and large enterprises, as well as on a wholesale basis to other operators. It operates in Belgium, Switzerland, Ireland, Slovakia, and internationally. Liberty Global Ltd. was founded in 2004 and is based in Hamilton, Bermuda.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"Crocs, Inc.","Symbol":"CROX","Current Price":"108.43","Latest MA":"120.72","Price Target":130.02357,"Difference from MA":"-10.18%","Difference from Open":"-1.07%","Change from Yesterday":"-1.47%","Change from Last Report":"0.00","Latest Volume":"2,465,510","Market Cap":"6,126,295,040","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":7.8307357,"PB Ratio":3.6758425,"Previous Close":110.05,"ROE":0.57069,"DTE":102.834,"Industry":"Footwear & Accessories","Sector":"Consumer Cyclical","Beta":2.017,"Trailing PEG":null,"Trailing PE":6.8280854,"Trailing PS":1.5043333,"Quick Ratio":0.826,"Day High":110.73,"Day Low":106.25,"VS Average Volume":1.6592369762,"Company Summary":"Crocs, Inc., together with its subsidiaries, designs, develops, manufactures, markets, distributes, and sells casual lifestyle footwear and accessories for men, women, and children under Crocs and HEYDUDE Brand in the United States and internationally. The company offers various footwear products, including clogs, sandals, slides, flips, wedges, platforms, socks, boots, charms, flip flops, sneakers, and slippers. It sells its products through wholesalers, retail stores, e-commerce sites, third-party marketplaces, and kiosks\/store-in-store locations. Crocs, Inc. was founded in 1999 and is headquartered in Broomfield, Colorado.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"Bruker Corporation","Symbol":"BRKR","Current Price":"50.04","Latest MA":"60.85","Price Target":68.41615,"Difference from MA":"-17.77%","Difference from Open":"-2.83%","Change from Yesterday":"-2.17%","Change from Last Report":"0.00","Latest Volume":"2,044,190","Market Cap":"7,585,964,032","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.072565,"PB Ratio":4.1979866,"Previous Close":51.15,"ROE":0.19725999,"DTE":132.635,"Industry":"Medical Devices","Sector":"Healthcare","Beta":1.204,"Trailing PEG":null,"Trailing PE":65.84211,"Trailing PS":2.3404078,"Quick Ratio":0.658,"Day High":51.95,"Day Low":49.84,"VS Average Volume":1.3150246255,"Company Summary":"Bruker Corporation, together with its subsidiaries, develops, manufactures, and distributes scientific instruments, and analytical and diagnostic solutions in the United States, Europe, the Asia Pacific, and internationally. The company operates through four segments: Bruker Scientific Instruments (BSI) BioSpin, BSI CALID, BSI Nano, and Bruker Energy & Supercon Technologies. It offers life science tools, and single and multiple modality systems; life science mass spectrometry; MALDI Biotyper rapid pathogen identification platform and related test kits, DNA test strips, and fluorescence-based polymerase chain reaction technology; genotype and fluorotype molecular diagnostics kits; research, analytical, and process analysis instruments and solutions; SARS-CoV 2 testing for the diagnosis of COVID-19 infection; and Fluorotyper-SARS-CoV 2 plus kits. It also provides range of portable analytical and bioanalytical detection systems, and related products; X-ray instruments; analytical tools for electron microscopes, as well as handheld, portable, and mobile X-ray fluorescence spectrometry instruments; atomic force microscopy instrumentation; non-contact nanometer resolution solution topography; and automated X-ray metrology, automated AFM defect-detection, and photomask repair and cleaning equipment. In addition, the company offers advanced optical fluorescence microscopy instruments; products and services to support the multi-omics needs of researchers in translational research, drug, and biomarker discovery; superconducting materials, such as metallic low temperature superconductors; devices and complex tools based on metallic low temperature superconductors; and non-superconducting high technology tools, such as synchrotron and beamline instrumentation. The company was incorporated in 1991 and is headquartered in Billerica, Massachusetts.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"American Electric Power Company","Symbol":"AEP","Current Price":"101.83","Latest MA":"96.20","Price Target":101.65882,"Difference from MA":"5.86%","Difference from Open":"0.61%","Change from Yesterday":"0.83%","Change from Last Report":"0.00","Latest Volume":"2,700,426","Market Cap":"54,296,879,104","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.171476,"PB Ratio":2.0370483,"Previous Close":100.99,"ROE":0.10182,"DTE":165.878,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.539,"Trailing PEG":1.526,"Trailing PE":18.249105,"Trailing PS":2.769938,"Quick Ratio":0.3,"Day High":102.915,"Day Low":100.94,"VS Average Volume":0.9163099842,"Company Summary":"American Electric Power Company, Inc., an electric public utility holding company, engages in the generation, transmission, and distribution of electricity for sale to retail and wholesale customers in the United States. It operates through Vertically Integrated Utilities, Transmission and Distribution Utilities, AEP Transmission Holdco, and Generation & Marketing segments. The company generates electricity using coal and lignite, natural gas, renewable, nuclear, hydro, solar, wind, and other energy sources. It also supplies and markets electric power at wholesale to other electric utility companies, rural electric cooperatives, municipalities, and other market participants. American Electric Power Company, Inc. was incorporated in 1906 and is headquartered in Columbus, Ohio.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"PPL Corporation","Symbol":"PPL","Current Price":"33.73","Latest MA":"32.02","Price Target":35.63938,"Difference from MA":"5.34%","Difference from Open":"-2.20%","Change from Yesterday":"-1.98%","Change from Last Report":"0.00","Latest Volume":"6,264,032","Market Cap":"24,884,711,424","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":17.276173,"PB Ratio":1.7658762,"Previous Close":34.41,"ROE":0.05864,"DTE":117.528,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.834,"Trailing PEG":1.1229,"Trailing PE":28.108332,"Trailing PS":3.0046742,"Quick Ratio":0.807,"Day High":34.65,"Day Low":33.7,"VS Average Volume":1.4247614265,"Company Summary":"PPL Corporation, an energy company, focuses on providing electricity and natural gas to approximately 3.6 million customers in the United States. It operates through three segments: Kentucky Regulated, Pennsylvania Regulated, and Rhode Island Regulated. The company delivers electricity to customers in Pennsylvania, Kentucky, Virginia, and Rhode Island; delivers natural gas to customers in Kentucky and Rhode Island; and generates electricity from power plants in Kentucky. PPL Corporation was founded in 1920 and is headquartered in Allentown, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"Digital Realty Trust, Inc.","Symbol":"DLR","Current Price":"164.28","Latest MA":"166.16","Price Target":188.83333,"Difference from MA":"-1.13%","Difference from Open":"-0.32%","Change from Yesterday":"-0.32%","Change from Last Report":"0.00","Latest Volume":"4,795,044","Market Cap":"55,544,545,280","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":139.22034,"PB Ratio":2.6534436,"Previous Close":164.81,"ROE":0.01956,"DTE":79.825,"Industry":"REIT - Specialty","Sector":"Real Estate","Beta":0.609,"Trailing PEG":10.5005,"Trailing PE":132.48387,"Trailing PS":10.334149,"Quick Ratio":1.6,"Day High":165.63,"Day Low":157.22,"VS Average Volume":2.2749693985,"Company Summary":"Digital Realty brings companies and data together by delivering the full spectrum of data center, colocation, and interconnection solutions. PlatformDIGITAL, the company's global data center platform, provides customers with a secure data meeting place and a proven Pervasive Datacenter Architecture (PDx) solution methodology for powering innovation and efficiently managing Data Gravity challenges. Digital Realty gives its customers access to the connected data communities that matter to them with a global data center footprint of 300+ facilities in 50+ metros across 25+ countries on six continents.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"TransUnion","Symbol":"TRU","Current Price":"99.74","Latest MA":"96.53","Price Target":117.2,"Difference from MA":"3.33%","Difference from Open":"-0.50%","Change from Yesterday":"-0.51%","Change from Last Report":"0.00","Latest Volume":"2,402,790","Market Cap":"19,439,325,184","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":19.966568,"PB Ratio":4.6079926,"Previous Close":100.25,"ROE":0.057189997,"DTE":121.901,"Industry":"Financial Data & Stock Exchanges","Sector":"Financial Services","Beta":1.624,"Trailing PEG":1.1239,"Trailing PE":68.7862,"Trailing PS":4.739796,"Quick Ratio":1.451,"Day High":101.19,"Day Low":98.93,"VS Average Volume":1.6175273701,"Company Summary":"TransUnion operates as a global consumer credit reporting agency that provides risk and information solutions. The company operates through U.S. Markets, International, and Consumer Interactive segments. The U.S. Markets segment provides consumer reports, actionable insights, and analytic services to businesses, which uses its services to acquire new customers; assess consumer ability to pay for services; identify cross-selling opportunities; measure and manage debt portfolio risk; collect debt; verify consumer identities; and mitigate fraud risk. This segment serves various industry vertical markets, including financial services, technology, commerce and communications, insurance, media, services and collections, tenant and employment, and public sectors. The International segment offers credit reports, analytics, technology solutions, and other value-added risk management services; consumer services, which help consumers to manage their personal finances; consumer credit reporting, insurance and auto information solutions, and commercial credit information services. It serves customers in financial services, retail credit, insurance, automotive, collections, public sector, and communications industries through direct and indirect channels. The company was formerly known as TransUnion Holding Company, Inc. and changed its name to TransUnion in March 2015. TransUnion was founded in 1968 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"Palo Alto Networks, Inc.","Symbol":"PANW","Current Price":"200.03","Latest MA":"180.35","Price Target":210.80191,"Difference from MA":"10.91%","Difference from Open":"4.19%","Change from Yesterday":"-0.92%","Change from Last Report":"0.00","Latest Volume":"13,794,164","Market Cap":"131,259,686,912","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":54.994995,"PB Ratio":25.15784,"Previous Close":201.88,"ROE":0.74517995,"DTE":27.28,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.118,"Trailing PEG":2.2513,"Trailing PE":51.821243,"Trailing PS":16.351254,"Quick Ratio":0.771,"Day High":201.33,"Day Low":188.7584,"VS Average Volume":2.3681130858,"Company Summary":"Palo Alto Networks, Inc. provides cybersecurity solutions worldwide. The company's network security platforms include Prisma Access, a security services edge (SSE) solution, as well as Strata Cloud Manager, a network security management solution. It also provides cloud security solutions, including Prisma Cloud, a cloud native application protection platform; and Code to Cloud platform, as well as offers VM-Series and CN-Series virtual firewalls for inline network security on multi- and hybrid-cloud environments. In addition, the company provides security operation solutions through Cortex platform that includes Cortex XSIAM, an AI-driven security operations platform; Cortex XDR for the prevention, detection, and response to complex cybersecurity attacks; and Cortex XSOAR for security orchestration, automation, and response; and Cortex Xpanse for attack surface management, as well as offers threat intelligence and advisory services under the Unit 42 name. Further, it provides subscription services covering the areas of threat prevention, malware and persistent threat, URL filtering, laptop and mobile device protection, DNS security, Internet of Things security, SaaS security API, and SaaS security inline, as well as threat intelligence, and data loss prevention. Additionally, the company offers professional services, including architecture design and planning, implementation, configuration, and firewall migration; education services, such as certifications, as well as online and in-classroom training; and support services. It sells its products and services through its channel partners, as well as directly to medium to large enterprises, service providers, and government entities operating in various industries, including education, energy, financial services, government entities, healthcare, Internet and media, manufacturing, public sector, and telecommunications. The company was incorporated in 2005 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"Pacific Gas & Electric Co.","Symbol":"PCG","Current Price":"15.29","Latest MA":"19.06","Price Target":20.98824,"Difference from MA":"-19.77%","Difference from Open":"-2.49%","Change from Yesterday":"-3.53%","Change from Last Report":"0.00","Latest Volume":"24,416,667","Market Cap":"33,539,837,952","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":9.393334,"PB Ratio":1.2179385,"Previous Close":15.85,"ROE":0.10674,"DTE":221.631,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":1.035,"Trailing PEG":0.968,"Trailing PE":13.295652,"Trailing PS":1.3508332,"Quick Ratio":0.804,"Day High":15.92,"Day Low":15.25,"VS Average Volume":1.0513754876,"Company Summary":"PG&E Corporation, through its subsidiary, Pacific Gas and Electric Company, engages in the sale and delivery of electricity and natural gas to customers in northern and central California, the United States. It generates electricity using nuclear, hydroelectric, fossil fuel-fired, fuel cell, and photovoltaic sources. The company owns and operates interconnected transmission lines; electric transmission substations, distribution lines, transmission switching substations, and distribution substations; and natural gas transmission, storage, and distribution system consisting of distribution pipelines, backbone and local transmission pipelines, and various storage facilities. It serves residential, commercial, industrial, and agricultural customers, as well as natural gas-fired electric generation facilities. PG&E Corporation was incorporated in 1905 and is based in Oakland, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"DexCom, Inc.","Symbol":"DXCM","Current Price":"89.07","Latest MA":"77.62","Price Target":100.01391,"Difference from MA":"14.76%","Difference from Open":"3.53%","Change from Yesterday":"5.92%","Change from Last Report":"0.00","Latest Volume":"7,554,280","Market Cap":"34,790,297,600","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":35.887974,"PB Ratio":17.57845,"Previous Close":84.09,"ROE":0.32061002,"DTE":130.935,"Industry":"Medical Devices","Sector":"Healthcare","Beta":1.173,"Trailing PEG":1.3116,"Trailing PE":62.725353,"Trailing PS":8.79876,"Quick Ratio":2.033,"Day High":89.84,"Day Low":86.0,"VS Average Volume":2.190821165,"Company Summary":"DexCom, Inc., a medical device company, focuses on the design, development, and commercialization of continuous glucose monitoring (CGM) systems in the United States and internationally. The company provides its systems for use by people with diabetes, as well as for use by healthcare providers. Its products include Dexcom G6 and Dexcom G7, integrated CGM systems for diabetes management; Dexcom Share, a remote monitoring system; Dexcom Real-Time API, which enables authorized third-party software developers to integrate real-time CGM data into their digital health apps and devices; and Dexcom ONE, that is designed to replace finger stick blood glucose testing for diabetes treatment decisions. It has also submitted FDA review for Dexcom Stelo for people with type 2 diabetes. The company has a collaboration and license agreement with Verily Life Sciences LLC and Verily Ireland Limited to develop blood-based or interstitial glucose monitoring products. It markets its products directly to endocrinologists, physicians, and diabetes educators. The company was incorporated in 1999 and is headquartered in San Diego, California.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"Molson Coors Beverage Company","Symbol":"TAP","Current Price":"60.36","Latest MA":"55.64","Price Target":65.11909,"Difference from MA":"8.49%","Difference from Open":"1.75%","Change from Yesterday":"3.11%","Change from Last Report":"0.00","Latest Volume":"3,271,555","Market Cap":"12,228,574,208","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":9.13719,"PB Ratio":0.9339894,"Previous Close":58.54,"ROE":0.071669996,"DTE":48.838,"Industry":"Beverages - Brewers","Sector":"Consumer Defensive","Beta":0.827,"Trailing PEG":2.7452,"Trailing PE":11.282244,"Trailing PS":1.0467699,"Quick Ratio":0.628,"Day High":60.5,"Day Low":58.95,"VS Average Volume":1.8038463765,"Company Summary":"Molson Coors Beverage Company manufactures, markets, and sells beer and other malt beverage products under various brands in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company offers flavored malt beverages including hard seltzers, craft, spirits and energy, and ready to drink beverages. It provides its products under Aspall Cider, Blue Moon, Coors Original, Five Trail, Hop Valley brands, Leinenkugel's, Madri, Miller Genuine Draft, Molson Ultra, Sharp's, Staropramen, and Vizzy Hard Seltzer above premier brands; Bergenbier, Borsodi, Carling, Coors Banquet, Coors Light, Jelen, Kamenitza, Miller Lite, Molson Canadian, and Niksicko, Ozujsko under the premium brands; and Branik, Icehouse, Keystone, Miller High Life, Milwaukee's Best, and Steel Reserve under the economy brands. The company was formerly known as Molson Coors Brewing Company and changed its name to Molson Coors Beverage Company in January 2020. Molson Coors Beverage Company was founded in 1774 and is based in Golden, Colorado.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"Wynn Resorts, Limited","Symbol":"WYNN","Current Price":"88.82","Latest MA":"86.45","Price Target":112.45556,"Difference from MA":"2.75%","Difference from Open":"5.08%","Change from Yesterday":"10.38%","Change from Last Report":"0.00","Latest Volume":"8,891,770","Market Cap":"9,753,767,936","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":17.565092,"PB Ratio":"N\/A","Previous Close":80.47,"ROE":"N\/A","DTE":"N\/A","Industry":"Resorts & Casinos","Sector":"Consumer Cyclical","Beta":1.802,"Trailing PEG":2.0763,"Trailing PE":10.662665,"Trailing PS":1.368062,"Quick Ratio":1.019,"Day High":89.45,"Day Low":83.525,"VS Average Volume":3.9387336546,"Company Summary":"Wynn Resorts, Limited designs, develops, and operates integrated resorts. The company operates through four segments: Wynn Palace, Wynn Macau, Las Vegas Operations, and Encore Boston Harbor. The Wynn Palace segment operates private gaming salons and sky casinos; a luxury hotel tower with suites, and villas, including a health club, spa, salon, and pool; food and beverage outlets; retail space; meeting and convention space; and performance lake and floral art displays. The Wynn Macau segment operates casino space with private gaming salons, sky casinos, and a poker room; a luxury hotel tower, that include health clubs, spas, a salon, and a pool; food and beverage outlets; retail space; meeting and convention space; and Chinese zodiac-inspired ceiling attractions. The Las Vegas Operations segment operates casino space with private gaming salons, a sky casino, a poker room, and a race and sports book; a luxury hotel tower with suites, and villas, including swimming pools, private cabanas, full-service spas and salons, and a wedding chapel; food and beverage outlets; meeting and convention space; retail space; and theaters, nightclubs, a beach club. The Encore Boston Harbor segment operates casino space with gaming areas, and a poker room; a luxury hotel tower including a spa and salon; food and beverage outlets and a nightclub; retail space; meeting and convention space; and a waterfront park, floral displays, and water shuttle service. Wynn Resorts, Limited was incorporated in 2002 and is based in Las Vegas, Nevada.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"Datadog, Inc.","Symbol":"DDOG","Current Price":"131.01","Latest MA":"129.95","Price Target":160.4045,"Difference from MA":"0.82%","Difference from Open":"-1.95%","Change from Yesterday":"-3.59%","Change from Last Report":"0.00","Latest Volume":"8,524,688","Market Cap":"44,507,111,424","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":60.651093,"PB Ratio":16.87186,"Previous Close":135.89,"ROE":0.08663999,"DTE":36.865,"Industry":"Software - Application","Sector":"Technology","Beta":1.095,"Trailing PEG":0.857,"Trailing PE":251.9423,"Trailing PS":17.54876,"Quick Ratio":2.07,"Day High":135.81,"Day Low":129.7101,"VS Average Volume":1.7013365511,"Company Summary":"Datadog, Inc. operates an observability and security platform for cloud applications in North America and internationally. The company's products comprise infrastructure and application performance monitoring, log management, digital experience monitoring, continuous profiler, database monitoring, data streams and universal service monitoring, network monitoring, incident management, workflow automation, observability pipelines, cloud cost and cloud security management, application security management, cloud SIEM, sensitive data scanner, and CI visibility. Datadog, Inc. was incorporated in 2010 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"Airbnb, Inc.","Symbol":"ABNB","Current Price":"161.42","Latest MA":"131.39","Price Target":153.21545,"Difference from MA":"22.86%","Difference from Open":"2.05%","Change from Yesterday":"14.45%","Change from Last Report":"0.00","Latest Volume":"21,543,810","Market Cap":"100,850,688,000","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":32.60641,"PB Ratio":12.133193,"Previous Close":141.04,"ROE":0.20873,"DTE":26.614,"Industry":"Travel Services","Sector":"Consumer Cyclical","Beta":1.156,"Trailing PEG":20.8039,"Trailing PE":39.37073,"Trailing PS":9.303569,"Quick Ratio":1.008,"Day High":163.93,"Day Low":156.93,"VS Average Volume":4.8576852962,"Company Summary":"Airbnb, Inc., together with its subsidiaries, operates a platform that enables hosts to offer stays and experiences to guests worldwide. The company's marketplace connects hosts and guests online or through mobile devices to book spaces and experiences. It primarily offers private rooms, primary homes, and vacation homes. The company was formerly known as AirBed & Breakfast, Inc. and changed its name to Airbnb, Inc. in November 2010. Airbnb, Inc. was founded in 2007 and is headquartered in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"Brookfield Corporation","Symbol":"BN","Current Price":"60.92","Latest MA":"53.71","Price Target":66.875,"Difference from MA":"13.42%","Difference from Open":"-0.75%","Change from Yesterday":"0.89%","Change from Last Report":"0.00","Latest Volume":"2,338,876","Market Cap":"91,890,507,776","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.378194,"PB Ratio":2.2270153,"Previous Close":60.38,"ROE":0.02106,"DTE":147.727,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.753,"Trailing PEG":null,"Trailing PE":196.51613,"Trailing PS":0.9408745,"Quick Ratio":0.88,"Day High":61.5,"Day Low":60.64,"VS Average Volume":1.1023230605,"Company Summary":"Brookfield Corporation is an alternative asset manager and REIT\/Real Estate Investment Manager firm focuses on real estate, renewable power, infrastructure and venture capital and private equity assets. It manages a range of public and private investment products and services for institutional and retail clients. It typically makes investments in sizeable, premier assets across geographies and asset classes. It invests both its own capital as well as capital from other investors. Within private equity and venture capital, it focuses on acquisition, early ventures, control buyouts and financially distressed, buyouts and corporate carve-outs, recapitalizations, convertible, senior and mezzanine financings, operational and capital structure restructuring, strategic re-direction, turnaround, and under-performing midmarket companies. It invests in both public debt and equity markets. It invests in private equity sectors with focus on Business Services include infrastructure, healthcare, road fuel distribution and marketing, construction and real estate; Industrials include manufacturers of automotive batteries, graphite electrodes, returnable plastic packaging, and sanitation management and development; and Residential\/ infrastructure services. It targets companies which likely possess underlying real assets, primarily in sectors such as industrial products, building materials, metals, mining, homebuilding, oil and gas, paper and packaging, manufacturing and forest product sectors. It invests globally with focus on North America including Brazil, the United States, Canada; Europe; and Australia; and Asia-Pacific. The firm considers equity investments in the range of $2 million to $500 million. It has a four-year investment period and a 10-year term with two one-year extensions. The firm prefers to take minority stake and majority stake. Brookfield Corporation was founded in 1997 and based in Toronto, Canada with additional offices across Northern America; South America; Europe; Middle East and Asia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"Ventas, Inc.","Symbol":"VTR","Current Price":"66.53","Latest MA":"60.38","Price Target":71.84211,"Difference from MA":"10.19%","Difference from Open":"2.70%","Change from Yesterday":"2.45%","Change from Last Report":"0.00","Latest Volume":"4,151,183","Market Cap":"29,078,996,992","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":82.1358,"PB Ratio":2.858186,"Previous Close":64.94,"ROE":-0.00543,"DTE":136.679,"Industry":"REIT - Healthcare Facilities","Sector":"Real Estate","Beta":1.39,"Trailing PEG":null,"Trailing PE":350.1579,"Trailing PS":6.061768,"Quick Ratio":1.095,"Day High":66.64,"Day Low":64.48,"VS Average Volume":1.5577367245,"Company Summary":"Ventas, Inc. (NYSE: VTR) is a leading S&P 500 real estate investment trust enabling exceptional environments that benefit a large and growing aging population. With approximately 1,350 properties in North America and the United Kingdom, Ventas occupies an essential role in the longevity economy. The Company's growth is fueled by its over 800 senior housing communities, which provide valuable services to residents and enable them to thrive in supported environments. The Ventas portfolio also includes outpatient medical buildings, research centers and healthcare facilities. The Company aims to deliver outsized performance by leveraging its unmatched operational expertise, data-driven insights from its Ventas OI platform, extensive relationships and strong financial position. Ventas's seasoned team of talented professionals shares a commitment to excellence, integrity and a common purpose of helping people live longer, healthier, happier lives.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"Cisco Systems, Inc.","Symbol":"CSCO","Current Price":"64.87","Latest MA":"54.36","Price Target":68.53708,"Difference from MA":"19.34%","Difference from Open":"1.66%","Change from Yesterday":"1.61%","Change from Last Report":"0.00","Latest Volume":"23,678,733","Market Cap":"258,361,655,296","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":16.225492,"PB Ratio":5.718442,"Previous Close":63.84,"ROE":0.20761,"DTE":70.647,"Industry":"Communication Equipment","Sector":"Technology","Beta":"N\/A","Trailing PEG":2.8673,"Trailing PE":28.451756,"Trailing PS":4.8769565,"Quick Ratio":0.648,"Day High":65.07,"Day Low":63.44,"VS Average Volume":1.1860329039,"Company Summary":"Cisco Systems, Inc. designs, manufactures, and sells Internet Protocol based networking and other products related to the communications and information technology industry in the Americas, Europe, the Middle East, Africa, the Asia Pacific, Japan, and China. The company also offers switching portfolio encompasses campus switching as well as data center switching; enterprise routing portfolio interconnects public and private wireline and mobile networks, delivering highly secure, and reliable connectivity to campus, data center and branch networks; and wireless products include indoor and outdoor wireless coverage designed for seamless roaming use of voice, video, and data applications. In addition, it provides security, which comprising network security, identity and access management, secure access service edge, and threat intelligence, detection, and response offerings; collaboration products, such as Webex Suite, collaboration devices, contact center, and communication platform as a service; end-to-end collaboration solutions that can be delivered from the cloud, on-premise or within hybrid cloud environments allowing customers to transition their collaboration solutions from on-premise to the cloud; and observability offers network assurance, monitoring and analytics and observability suite. Further, the company offers a range of service and support options for its customers, including technical support and advanced services and advisory services. It serves businesses of various sizes, public institutions, governments, and service providers. The company sells its products and services directly, as well as through systems integrators, service providers, other resellers, and distributors. Cisco Systems, Inc. has strategic alliances with other companies. Cisco Systems, Inc. was incorporated in 1984 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"Albemarle Corporation","Symbol":"ALB","Current Price":"81.21","Latest MA":"92.00","Price Target":104.64444,"Difference from MA":"-11.73%","Difference from Open":"1.31%","Change from Yesterday":"2.47%","Change from Last Report":"0.00","Latest Volume":"2,237,930","Market Cap":"9,548,103,680","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":33.187847,"PB Ratio":1.1923358,"Previous Close":79.25,"ROE":-0.17662,"DTE":35.334,"Industry":"Specialty Chemicals","Sector":"Basic Materials","Beta":1.551,"Trailing PEG":7.0772,"Trailing PE":"N\/A","Trailing PS":1.4684922,"Quick Ratio":1.509,"Day High":82.3862,"Day Low":79.59,"VS Average Volume":1.0446959947,"Company Summary":"Albemarle Corporation develops, manufactures, and markets engineered specialty chemicals worldwide. It operates through three segments: Energy Storage, Specialties and Ketjen. The Energy Storage segment offers lithium compounds, including lithium carbonate, lithium hydroxide, and lithium chloride; technical services for the handling and use of reactive lithium products; and lithium-containing by-products recycling services. The Specialties segment provides bromine-based specialty chemicals, including elemental bromine, alkyl and inorganic bromides, brominated powdered activated carbon, and other bromine fine chemicals; lithium specialties, such as butyllithium and lithium aluminum hydride; develops and manufactures cesium products for the chemical and pharmaceutical industries; and zirconium, barium, and titanium products for pyrotechnical applications that include airbag initiators. The Ketjen segment offers clean fuels technologies (CFT), which is composed of hydroprocessing catalysts (HPC) together with isomerization and akylation catalysts; fluidized catalytic cracking (FCC) catalysts and additives; and performance catalyst solutions (PCS), which is composed of organometallics and curatives. The company serves the energy storage, petroleum refining, consumer electronics, construction, automotive, lubricants, pharmaceuticals, and crop protection markets. Albemarle Corporation was founded in 1887 and is headquartered in Charlotte, North Carolina.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"CVS Health Corporation","Symbol":"CVS","Current Price":"65.83","Latest MA":"55.57","Price Target":70.6976,"Difference from MA":"18.46%","Difference from Open":"-1.58%","Change from Yesterday":"-0.81%","Change from Last Report":"0.00","Latest Volume":"8,900,698","Market Cap":"82,998,468,608","Earning Date":"2025-02-12","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":9.601249,"PB Ratio":1.1050123,"Previous Close":66.37,"ROE":0.06697,"DTE":110.116,"Industry":"Healthcare Plans","Sector":"Healthcare","Beta":0.543,"Trailing PEG":0.6986,"Trailing PE":17.98634,"Trailing PS":0.22600238,"Quick Ratio":0.542,"Day High":66.89,"Day Low":65.58,"VS Average Volume":0.6457612184,"Company Summary":"CVS Health Corporation provides health solutions in the United States. It operates through Health Care Benefits, Health Services, and Pharmacy & Consumer Wellness segments. The Health Care Benefits segment offers traditional, voluntary, and consumer-directed health insurance products and related services. It serves employer groups, individuals, college students, part-time and hourly workers, health plans, health care providers, governmental units, government-sponsored plans, labor groups, and expatriates. The Health Services segment offers pharmacy benefit management solutions, including plan design and administration, formulary management, retail pharmacy network management, specialty and mail order pharmacy, clinical, disease management, and medical spend management services. It serves employers, insurance companies, unions, government employee groups, health plans, prescription drug plans, Medicaid managed care plans, CMS, plans offered on public health insurance, and other sponsors of health benefit plans. The Pharmacy & Consumer Wellness segment sells prescription and over-the-counter drugs, consumer health and beauty products, and personal care products. This segment also distributes prescription drugs; and provides related pharmacy consulting and other ancillary services to care facilities and other care settings. It operates online retail pharmacy websites, LTC pharmacies and on-site pharmacies, retail specialty pharmacy stores, compounding pharmacies and branches for infusion and enteral nutrition services. The company was formerly known as CVS Caremark Corporation and changed its name to CVS Health Corporation in September 2014. CVS Health Corporation was incorporated in 1996 and is headquartered in Woonsocket, Rhode Island.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"Antero Resources Corporation","Symbol":"AR","Current Price":"39.84","Latest MA":"30.99","Price Target":43.18182,"Difference from MA":"28.55%","Difference from Open":"-1.26%","Change from Yesterday":"-0.77%","Change from Last Report":"0.00","Latest Volume":"3,810,918","Market Cap":"12,397,411,328","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":10.724784,"PB Ratio":1.775322,"Previous Close":40.15,"ROE":0.0130900005,"DTE":59.551,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":3.378,"Trailing PEG":0.9308,"Trailing PE":284.57144,"Trailing PS":2.9017644,"Quick Ratio":0.261,"Day High":40.5,"Day Low":39.41,"VS Average Volume":0.8961625967,"Company Summary":"Antero Resources Corporation, an independent oil and natural gas company, engages in the development, production, exploration, and acquisition of natural gas, natural gas liquids (NGLs), and oil properties in the United States. It operates in three segments: Exploration and Development; Marketing; and Equity Method Investment in Antero Midstream. As of December 31, 2023, the company had approximately 515,000 net acres in the Appalachian Basin; and approximately 172,000 net acres in the Upper Devonian Shale. Its gathering and compression systems also comprise 631 miles of gas gathering pipelines in the Appalachian Basin. The company was formerly known as Antero Resources Appalachian Corporation and changed its name to Antero Resources Corporation in June 2013. Antero Resources Corporation was incorporated in 2002 and is headquartered in Denver, Colorado.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"Tenet Healthcare Corporation","Symbol":"THC","Current Price":"133.31","Latest MA":"147.84","Price Target":172.16,"Difference from MA":"-9.83%","Difference from Open":"-0.54%","Change from Yesterday":"-0.19%","Change from Last Report":"0.00","Latest Volume":"1,782,042","Market Cap":"12,677,381,120","Earning Date":"2025-02-12","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":10.164309,"PB Ratio":3.3060534,"Previous Close":133.57,"ROE":0.59564996,"DTE":159.393,"Industry":"Medical Care Facilities","Sector":"Healthcare","Beta":2.15,"Trailing PEG":0.6196,"Trailing PE":4.0767584,"Trailing PS":0.6044908,"Quick Ratio":1.383,"Day High":137.57,"Day Low":132.59,"VS Average Volume":1.3429659858,"Company Summary":"Tenet Healthcare Corporation operates as a diversified healthcare services company in the United States. The company operates through two segments: Hospital Operations and Services, and Ambulatory Care. Its general hospitals offer acute care services, operating and recovery rooms, radiology and respiratory therapy services, clinical laboratories, and pharmacies. The company also provides intensive and critical care, and\/or coronary care units; cardiovascular, digestive disease, neurosciences, musculoskeletal, and obstetrics services; outpatient services, including physical therapy; tertiary care services, such as cardiothoracic surgery, complex spinal surgery, neonatal intensive care, and neurosurgery services; quaternary care services in heart and kidney transplants; and limb salvaging vascular procedure, acute level 1 trauma, intravascular stroke care, minimally invasive cardiac valve replacement, imaging, surgical robotic, and telemedicine access services. In addition, it offers a range of procedures and services, such as orthopedics, total joint replacement, and spinal and other musculoskeletal procedures; gastroenterology; pain management; otolaryngology; ophthalmology; and urology. It operates hospitals, ambulatory surgery centers, imaging centers, surgical hospitals, off-campus emergency departments, and micro-hospitals. Tenet Healthcare Corporation was founded in 1967 and is headquartered in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"Williams Companies, Inc. (The)","Symbol":"WMB","Current Price":"56.98","Latest MA":"50.40","Price Target":58.20762,"Difference from MA":"13.05%","Difference from Open":"-1.37%","Change from Yesterday":"-0.84%","Change from Last Report":"0.00","Latest Volume":"5,338,928","Market Cap":"69,459,189,760","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":23.953655,"PB Ratio":5.6044064,"Previous Close":57.46,"ROE":0.20583001,"DTE":182.368,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":1.062,"Trailing PEG":9.6164,"Trailing PE":31.307692,"Trailing PS":6.700674,"Quick Ratio":0.406,"Day High":57.895,"Day Low":56.89,"VS Average Volume":0.7183912663,"Company Summary":"The Williams Companies, Inc., together with its subsidiaries, operates as an energy infrastructure company primarily in the United States. It operates through Transmission & Gulf of Mexico, Northeast G&P, West, and Gas & NGL Marketing Services segments. The Transmission & Gulf of Mexico segment comprises natural gas pipelines; Transco, Northwest pipeline, MountainWest, and related natural gas storage facilities; and natural gas gathering and processing, and crude oil production handling and transportation assets in the Gulf Coast region. The Northeast G&P segment engages in the midstream gathering, processing, and fractionation activities in the Marcellus Shale region primarily in Pennsylvania and New York, and the Utica Shale region of eastern Ohio. The West segment consists of gas gathering, processing, and treating operations in the Rocky Mountain region of Colorado and Wyoming, the Barnett Shale region of north-central Texas, the Eagle Ford Shale region of South Texas, the Haynesville Shale region of northwest Louisiana, the Mid-Continent region that includes the Anadarko and Permian basins, and the DJ Basin of Colorado; and operates natural gas liquid (NGL) fractionation and storage facilities in central Kansas near Conway. The Gas & NGL Marketing Services segment provides wholesale marketing, trading, storage, and transportation of natural gas for natural gas utilities, municipalities, power generators, and producers; asset management services; and transports and markets NGLs. The company owns and operates 33,000 miles of pipelines. The Williams Companies, Inc. was founded in 1908 and is headquartered in Tulsa, Oklahoma.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"Dominion Energy, Inc.","Symbol":"D","Current Price":"55.59","Latest MA":"55.40","Price Target":58.48312,"Difference from MA":"0.35%","Difference from Open":"-2.34%","Change from Yesterday":"-1.97%","Change from Last Report":"0.00","Latest Volume":"3,613,277","Market Cap":"46,696,157,184","Earning Date":"2025-02-12","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":15.460305,"PB Ratio":1.7834456,"Previous Close":56.71,"ROE":0.085030004,"DTE":156.351,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.596,"Trailing PEG":1.9856,"Trailing PE":25.26818,"Trailing PS":3.199901,"Quick Ratio":0.381,"Day High":56.97,"Day Low":55.45,"VS Average Volume":0.791305938,"Company Summary":"Dominion Energy, Inc. produces and distributes energy in the United States. It operates through three operating segments: Dominion Energy Virginia, Dominion Energy South Carolina, and Contracted Energy. The Dominion Energy Virginia segment generates, transmits, and distributes regulated electricity to approximately 2.8 million residential, commercial, industrial, and governmental customers in Virginia and North Carolina. The Dominion Energy South Carolina segment generates, transmits, and distributes electricity to approximately 0.8 million customers in the central, southern, and southwestern portions of South Carolina; and distributes natural gas to approximately 0.4 million residential, commercial, and industrial customers in South Carolina. The Contracted Energy segment is involved in the nonregulated long-term contracted renewable electric generation and renewable natural gas facility. As of December 31, 2023, the company's portfolio of assets included approximately 29.5 gigawatt of electric generating capacity; 10,600 miles of electric transmission lines; 79,300 miles of electric distribution lines; and 94,800 miles of gas distribution mains and related service facilities. The company was formerly known as Dominion Resources, Inc. Dominion Energy, Inc. was incorporated in 1983 and is headquartered in Richmond, Virginia.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"MGM Resorts International","Symbol":"MGM","Current Price":"39.81","Latest MA":"37.49","Price Target":48.98667,"Difference from MA":"6.19%","Difference from Open":"-3.40%","Change from Yesterday":"-1.39%","Change from Last Report":"0.00","Latest Volume":"6,447,974","Market Cap":"11,719,029,760","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":14.020174,"PB Ratio":3.6569908,"Previous Close":40.37,"ROE":0.2901,"DTE":841.031,"Industry":"Resorts & Casinos","Sector":"Consumer Cyclical","Beta":2.241,"Trailing PEG":2.2372,"Trailing PE":16.5875,"Trailing PS":0.68048215,"Quick Ratio":1.062,"Day High":41.32,"Day Low":39.72,"VS Average Volume":1.4719435874,"Company Summary":"MGM Resorts International, through its subsidiaries, owns and operates casino, hotel, and entertainment resorts in the United States and internationally. The company operates through three segments: Las Vegas Strip Resorts, Regional Operations, and MGM China. Its casino resorts offer gaming, hotel, convention, dining, entertainment, retail, and other resort amenities. The company's casino operations include slots and table games, as well as online sports betting and iGaming through BetMGM. Its customers include premium gaming customers; leisure and wholesale travel customers; business travelers; and group customers, including conventions, trade associations, and small meetings. The company was formerly known as MGM MIRAGE and changed its name to MGM Resorts International in June 2010. MGM Resorts International was incorporated in 1986 and is based in Las Vegas, Nevada.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"The Kraft Heinz Company","Symbol":"KHC","Current Price":"28.92","Latest MA":"32.45","Price Target":33.37619,"Difference from MA":"-10.89%","Difference from Open":"-1.01%","Change from Yesterday":"-1.13%","Change from Last Report":"0.00","Latest Volume":"8,581,026","Market Cap":"34,559,111,168","Earning Date":"2025-02-12","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":10.082487,"PB Ratio":0.7234703,"Previous Close":29.25,"ROE":0.027999999,"DTE":41.451,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.475,"Trailing PEG":0.7903,"Trailing PE":12.79646,"Trailing PS":1.3225837,"Quick Ratio":0.448,"Day High":29.59,"Day Low":28.84,"VS Average Volume":0.8126668053,"Company Summary":"The Kraft Heinz Company, together with its subsidiaries, manufactures and markets food and beverage products in North America and internationally. Its products include condiments and sauces, cheese and dairy products, meals, meats, refreshment beverages, coffee, and other grocery products under the Kraft, Oscar Mayer, Heinz, Philadelphia, Lunchables, Velveeta, Ore-Ida, Maxwell House, Kool-Aid, Jell-O, Heinz, ABC, Master, Quero, Kraft, Golden Circle, Wattie's, Pudliszki, and Plasmon brands. It sells its products through its own sales organizations, as well as through independent brokers, agents, and distributors to chain, wholesale, cooperative, and independent grocery accounts; convenience, value, and club stores; pharmacies and drug stores; mass merchants; foodservice distributors; institutions, including hotels, restaurants, bakeries, hospitals, health care facilities, and government agencies; and online through various e-commerce platforms and retailers. The company was formerly known as H.J. Heinz Holding Corporation and changed its name to The Kraft Heinz Company in July 2015. The Kraft Heinz Company was founded in 1869 and is based in Pittsburgh, Pennsylvania.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"Paramount Global","Symbol":"PARA","Current Price":"11.30","Latest MA":"10.72","Price Target":12.75429,"Difference from MA":"5.39%","Difference from Open":"3.67%","Change from Yesterday":"4.53%","Change from Last Report":"0.00","Latest Volume":"15,125,064","Market Cap":"8,047,814,656","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":7.512349,"PB Ratio":0.45326915,"Previous Close":10.81,"ROE":-0.30080998,"DTE":91.924,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.71,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.27878943,"Quick Ratio":0.938,"Day High":11.34,"Day Low":10.84,"VS Average Volume":1.5379712044,"Company Summary":"Paramount Global operates as a media, streaming, and entertainment company worldwide. It operates through TV Media, Direct-to-Consumer, and Filmed Entertainment segments. The TV Media segment operates CBS Television Network, a domestic broadcast television network; CBS Stations, a television station; and international free-to-air networks comprising Network 10, Channel 5, Telefe, and Chilevisión; domestic premium and basic cable networks, such as Paramount+ with Showtime, MTV, Comedy Central, Paramount Network, The Smithsonian Channel, Nickelodeon, BET Media Group, and CBS Sports Network; and international extensions of these brands. This segment also offers domestic and international television studio operations, including CBS Studios, Paramount Television Studios, and Showtime\/MTV Entertainment Studios; CBS Media Ventures, which produces and distributes first-run syndicated programming; and digital properties consisting of CBS News Streaming and CBS Sports HQ. The Direct-to-Consumer segment provides a portfolio of domestic and international pay and free streaming services, including Paramount+, Pluto TV, BET+, and Noggin. The Filmed Entertainment segment produces and acquires films, series, and short-form content for release and licensing around the world, including in theaters, on streaming services, on television, through digital home entertainment, and DVDs\/Blu-rays; and operates a portfolio consisting of Paramount Pictures, Paramount Players, Paramount Animation, Nickelodeon Studio, Awesomeness, and Miramax. It also offers production, distribution, and advertising solutions. The company was formerly known as ViacomCBS Inc. and changed its name to Paramount Global in February 2022. The company was founded in 1914 and is headquartered in New York, New York. Paramount Global is a subsidiary of National Amusements, Inc.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"Exelon Corporation","Symbol":"EXC","Current Price":"42.85","Latest MA":"38.45","Price Target":43.45875,"Difference from MA":"11.46%","Difference from Open":"-0.23%","Change from Yesterday":"-0.28%","Change from Last Report":"0.00","Latest Volume":"7,847,630","Market Cap":"43,073,675,264","Earning Date":"2025-02-12","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":15.318561,"PB Ratio":1.6173472,"Previous Close":42.97,"ROE":0.0933,"DTE":173.221,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.61,"Trailing PEG":2.548,"Trailing PE":17.489796,"Trailing PS":1.8789773,"Quick Ratio":0.579,"Day High":43.15,"Day Low":42.735,"VS Average Volume":1.1894653989,"Company Summary":"Exelon Corporation, a utility services holding company, engages in the energy distribution and transmission businesses in the United States and Canada. The company is involved in the purchase and regulated retail sale of electricity and natural gas, transmission and distribution of electricity, and distribution of natural gas to retail customers. It also offers support services, including legal, human resources, information technology, supply management, financial, engineering, customer operations, transmission and distribution planning, asset management, system operations, and power procurement services. It serves distribution utilities, municipalities, and financial institutions, as well as commercial, industrial, governmental, and residential customers. Exelon Corporation was incorporated in 1999 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"NiSource Inc","Symbol":"NI","Current Price":"39.68","Latest MA":"34.49","Price Target":40.54286,"Difference from MA":"15.06%","Difference from Open":"0.13%","Change from Yesterday":"0.20%","Change from Last Report":"0.00","Latest Volume":"5,198,862","Market Cap":"18,647,220,224","Earning Date":"2025-02-12","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":19.72275,"PB Ratio":2.2191153,"Previous Close":39.6,"ROE":0.08756,"DTE":131.811,"Industry":"Utilities - Regulated Gas","Sector":"Utilities","Beta":0.507,"Trailing PEG":2.2411,"Trailing PE":24.493828,"Trailing PS":3.525461,"Quick Ratio":0.207,"Day High":39.985,"Day Low":39.54,"VS Average Volume":1.3772454677,"Company Summary":"NiSource Inc., an energy holding company, operates as a regulated natural gas and electric utility company in the United States. It operates in two segments, Gas Distribution Operations and Electric Operations. The company distributes natural gas to approximately 3.3 million customers through approximately 55,000 miles of distribution main pipeline and the associated individual customer service lines; and 1,000 miles of transmission main pipeline in northern Indiana, Ohio, Pennsylvania, Virginia, Kentucky, and Maryland. It also generates, transmits, and distributes electricity to approximately 0.5 million customers in various counties in the northern part of Indiana, as well as engages in wholesale electric and transmission transactions. It owns and operates coal-fired electric generating stations in Wheatfield and Michigan City; combined cycle gas turbine in West Terre Haute; natural gas generating units in Wheatfield; hydro generating plants in Carroll County and White County; wind generating units in White County, Indiana; and solar generating units in Jasper County and White County. The company was formerly known as NIPSCO Industries, Inc. and changed its name to NiSource Inc. in April 1999. NiSource Inc. was founded in 1847 and is headquartered in Merrillville, Indiana.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"Vertiv Holdings, LLC","Symbol":"VRT","Current Price":"108.05","Latest MA":"105.95","Price Target":138.44684,"Difference from MA":"1.98%","Difference from Open":"-1.14%","Change from Yesterday":"-1.13%","Change from Last Report":"0.00","Latest Volume":"6,627,050","Market Cap":"41,135,067,136","Earning Date":"2025-02-12","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":24.29706,"PB Ratio":22.356714,"Previous Close":109.28,"ROE":0.32963002,"DTE":172.427,"Industry":"Electrical Equipment & Parts","Sector":"Industrials","Beta":1.586,"Trailing PEG":0.9872,"Trailing PE":84.41407,"Trailing PS":5.462244,"Quick Ratio":0.936,"Day High":109.3,"Day Low":105.86,"VS Average Volume":0.7853140391,"Company Summary":"Vertiv Holdings Co, together with its subsidiaries, designs, manufactures, and services critical digital infrastructure technologies and life cycle services for data centers, communication networks, and commercial and industrial environments in the Americas, the Asia Pacific, Europe, the Middle East, and Africa. It offers AC and DC power management products, switchgear and busbar products, thermal management products, integrated rack systems, modular solutions, and management systems for monitoring and controlling digital infrastructure that are integral to the technologies used for various services, including e-commerce, online banking, file sharing, video on-demand, energy storage, wireless communications, Internet of Things, and online gaming. The company also provides lifecycle management services, predictive analytics, and professional services for deploying, maintaining, and optimizing its products and their related systems; and preventative maintenance, acceptance testing, engineering and consulting, performance assessments, remote monitoring, training, spare parts, and digital critical infrastructure software services. It offers its products primarily under the Vertiv, Liebert, NetSure, Geist, E&I, Powerbar, and Avocent brands. The company serves cloud services, financial services, healthcare, transportation, manufacturing, energy, education, government, social media, and retail industries through a network of direct sales professionals, independent sales representatives, channel partners, and original equipment manufacturers. Vertiv Holdings Co is headquartered in Westerville, Ohio.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"Reddit, Inc.","Symbol":"RDDT","Current Price":"196.38","Latest MA":"113.48","Price Target":201.15788,"Difference from MA":"73.05%","Difference from Open":"-2.78%","Change from Yesterday":"-4.18%","Change from Last Report":"0.00","Latest Volume":"8,389,738","Market Cap":"35,525,926,912","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":49.527752,"PB Ratio":17.294584,"Previous Close":204.95,"ROE":-0.31801,"DTE":1.364,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":"N\/A","Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":31.656042,"Quick Ratio":11.834,"Day High":203.95,"Day Low":192.5701,"VS Average Volume":1.370651619,"Company Summary":"Reddit, Inc. operates a website that organizes digital communities. It organizes communities based on specific interests that enable users to engage in conversations by sharing experiences, submitting links, uploading images and videos, and replying to one another. The company was founded in 2005 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"The Trade Desk, Inc.","Symbol":"TTD","Current Price":"80.16","Latest MA":"113.50","Price Target":113.9697,"Difference from MA":"-29.38%","Difference from Open":"-2.90%","Change from Yesterday":"-2.15%","Change from Last Report":"0.00","Latest Volume":"18,983,618","Market Cap":"39,564,894,208","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":36.169373,"PB Ratio":15.064837,"Previous Close":81.92,"ROE":0.12891,"DTE":11.167,"Industry":"Software - Application","Sector":"Technology","Beta":1.47,"Trailing PEG":1.6109,"Trailing PE":102.76924,"Trailing PS":17.130507,"Quick Ratio":1.805,"Day High":83.6,"Day Low":80.1,"VS Average Volume":3.9982742036,"Company Summary":"The Trade Desk, Inc. operates as a technology company in the United States and internationally. The company offers a self-service cloud-based platform that allows buyers to plan, manage, optimize, and measure data-driven digital advertising campaigns across various ad formats and channels, including video, display, audio, digital-out-of-home, native, and social on various devices, such as computers, mobile devices, televisions, and streaming devices. It provides data and other value-added services. The company serves advertising agencies, brands, and other service providers for advertisers. The Trade Desk, Inc. was incorporated in 2009 and is headquartered in Ventura, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-02-2025 00:13:03"},{"Company Name":"GXO Logistics, Inc.","Symbol":"GXO","Current Price":"39.41","Latest MA":"51.28","Price Target":56.80875,"Difference from MA":"-23.14%","Difference from Open":"6.95%","Change from Yesterday":"8.54%","Change from Last Report":"0.00","Latest Volume":"4,467,339","Market Cap":"4,709,337,088","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":12.702742,"PB Ratio":1.5158858,"Previous Close":36.31,"ROE":0.03726,"DTE":175.963,"Industry":"Integrated Freight & Logistics","Sector":"Industrials","Beta":1.639,"Trailing PEG":0.885,"Trailing PE":35.1875,"Trailing PS":0.42622292,"Quick Ratio":0.739,"Day High":40.28,"Day Low":36.85,"VS Average Volume":3.0394444641,"Company Summary":"GXO Logistics, Inc., together with its subsidiaries, provides logistics services worldwide. The company provides warehousing and distribution, order fulfilment, e-commerce, reverse logistics, and other supply chain services. As of December 31, 2023, it operated in approximately 974 facilities. The company serves various customers in the e-commerce, omnichannel retail, technology and consumer electronics, food and beverage, industrial and manufacturing, consumer packaged goods, and others. GXO Logistics, Inc. was incorporated in 2021 and is headquartered in Greenwich, Connecticut.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-02-2025 00:13:03"}]