[{"Company Name":"American Airlines Group, Inc.","Symbol":"AAL","Current Price":"16.87","Latest MA":"13.11","Price Target":20.995,"Difference from MA":"28.70%","Difference from Open":"-0.35%","Change from Yesterday":"-2.82%","Change from Last Report":"-0.14","Latest Volume":"17,217,609","Market Cap":"11,093,072,896","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":5.4936137,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Airlines","Sector":"Industrials","Beta":1.399,"Trailing PEG":0.2392,"Trailing PE":13.604757,"Trailing PS":0.20691013,"Quick Ratio":0.422,"Day High":17.22,"Day Low":16.8,"VS Average Volume":0.632257173,"Company Summary":"American Airlines Group Inc., through its subsidiaries, operates as a network air carrier. The company provides scheduled air transportation services for passengers and cargo through its hubs in Charlotte, Chicago, Dallas\/Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix, and Washington, D.C., as well as through partner gateways in London, Doha, Madrid, Seattle\/Tacoma, Sydney, and Tokyo. It operates a mainline fleet of 965 aircraft. The company was formerly known as AMR Corporation and changed its name to American Airlines Group Inc. in December 2013. American Airlines Group Inc. was founded in 1926 and is headquartered in Fort Worth, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"TAL Education Group","Symbol":"TAL","Current Price":"12.45","Latest MA":"9.93","Price Target":14.73579,"Difference from MA":"25.32%","Difference from Open":"0.40%","Change from Yesterday":"0.36%","Change from Last Report":"-0.04","Latest Volume":"2,784,627","Market Cap":"7,523,323,392","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":26.147223,"PB Ratio":2.0541165,"ROE":0.019609999,"DTE":9.291,"Industry":"Education & Training Services","Sector":"Consumer Defensive","Beta":0.033,"Trailing PEG":0.6622,"Trailing PE":65.52631,"Trailing PS":4.0962944,"Quick Ratio":2.67,"Day High":12.575,"Day Low":12.12,"VS Average Volume":0.4100539253,"Company Summary":"TAL Education Group provides K-12 after-school tutoring services in the People's Republic of China. It provides learning services primarily through small-classes services; personalized premium services; and learning content solutions, such as print books, smart books, mobile apps, and AI-driven learning devices. The company also operates www.xueersi.com, an online education platform; provides investment management and consulting services; develops and sells software and networks, as well as related consulting services; and sells educational materials and products. It offers its services under the Haoweilai and Think Academy brands. TAL Education Group was founded in 2003 and is headquartered in Beijing, the People's Republic of China.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"GE Aerospace","Symbol":"GE","Current Price":"202.55","Latest MA":"174.49","Price Target":225.06589,"Difference from MA":"16.08%","Difference from Open":"1.37%","Change from Yesterday":"1.71%","Change from Last Report":"-0.07","Latest Volume":"1,070,034","Market Cap":"217,471,614,976","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":31.527956,"PB Ratio":11.614543,"ROE":0.22552,"DTE":110.224,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.188,"Trailing PEG":16.4144,"Trailing PE":33.258785,"Trailing PS":3.1088245,"Quick Ratio":0.804,"Day High":202.75,"Day Low":199.48,"VS Average Volume":0.2026840194,"Company Summary":"General Electric Company, doing business as GE Aerospace, designs and produces commercial and defense aircraft engines, integrated engine components, electric power, and mechanical aircraft systems. It also offers aftermarket services to support its products. The company operates in the United States, Europe, China, Asia, the Americas, the Middle East, and Africa. General Electric Company was incorporated in 1892 and is based in Evendale, Ohio.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Valley National Bancorp","Symbol":"VLY","Current Price":"10.34","Latest MA":"8.83","Price Target":11.5,"Difference from MA":"17.11%","Difference from Open":"1.17%","Change from Yesterday":"1.97%","Change from Last Report":"-0.00","Latest Volume":"2,773,628","Market Cap":"5,777,790,976","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":8.940992,"PB Ratio":0.7956217,"ROE":0.049429998,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.086,"Trailing PEG":null,"Trailing PE":14.985362,"Trailing PS":3.6637049,"Quick Ratio":"N\/A","Day High":10.4282,"Day Low":10.215,"VS Average Volume":0.343121738,"Company Summary":"Valley National Bancorp operates as the holding company for Valley National Bank that provides various commercial, private banking, retail, insurance, and wealth management financial services products. It operates through Consumer Banking, Commercial Banking, and Treasury and Corporate other segments. The company offers non-interest bearing, savings, NOW, money market, and time deposit accounts; commercial and industrial, commercial real estate, residential mortgage, and automobile loans; loans secured by the cash surrender value of life insurance; home equity loans and lines of credit; automobile financing; and secured and unsecured other consumer loans. It also invests in various securities and interest-bearing deposits with other banks; and provides international banking services, such as standby and documentary letters of credit, and related products, as well as foreign exchange transactions, documentary collections, and foreign wire transfers services. In addition, the company offers investment services for individuals and small to medium sized businesses; and trusts investment strategies designed for various investment profiles and objectives. Further, it provides trust services, such as living and testamentary trusts, investment management, custodial and escrow services, and estate administration to individuals; tax credit advisory services; brokerage services; property and casualty, life, health, and title insurance agency services; and health care equipment lending and other commercial equipment leasing services, as well as owns real estate related investments. Additionally, the company offers online, mobile, and telephone banking services; receivable, payment, and security solution, merchant, payroll processing, and liquidity services; credit cards; and drive-in and night deposit, automated teller machine, remote deposit capture, and safe deposit facility services. Valley National Bancorp was founded in 1927 and is headquartered in Morristown, New Jersey.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"CSX Corporation","Symbol":"CSX","Current Price":"33.01","Latest MA":"33.79","Price Target":37.08923,"Difference from MA":"-2.33%","Difference from Open":"0.23%","Change from Yesterday":"0.00%","Change from Last Report":"0.14","Latest Volume":"2,905,906","Market Cap":"63,647,502,336","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":15.551085,"PB Ratio":4.9224463,"ROE":0.29458,"DTE":147.913,"Industry":"Railroads","Sector":"Industrials","Beta":1.191,"Trailing PEG":2.1944,"Trailing PE":18.438549,"Trailing PS":4.335366,"Quick Ratio":1.195,"Day High":33.185,"Day Low":32.85,"VS Average Volume":0.2276463233,"Company Summary":"CSX Corporation, together with its subsidiaries, provides rail-based freight transportation services. The company offers rail services; and transportation of intermodal containers and trailers, as well as other transportation services, such as rail-to-truck transfers and bulk commodity operations. It also transports chemicals, agricultural and food products, minerals, automotive, forest products, fertilizers, and metals and equipment; and coal, coke, and iron ore to electricity-generating power plants, steel manufacturers, and industrial plants, as well as exports coal to deep-water port facilities. In addition, the company provides intermodal services through a network of approximately 30 terminals transporting manufactured consumer goods in containers; and drayage services, including the pickup and delivery of intermodal shipments. It serves the automotive industry with distribution centers and storage locations, as well as connects non-rail served customers through transferring products, such as plastics and ethanol from rail to trucks. The company operates approximately 20,000 route mile rail network, which serves various population centers in 26 states east of the Mississippi River, the District of Columbia, and the Canadian provinces of Ontario and Quebec, as well as owns and leases approximately 3,500 locomotives. It serves production and distribution facilities through track connections. CSX Corporation was incorporated in 1978 and is headquartered in Jacksonville, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Freeport-McMoRan, Inc.","Symbol":"FCX","Current Price":"36.77","Latest MA":"43.93","Price Target":47.8981,"Difference from MA":"-16.29%","Difference from Open":"0.29%","Change from Yesterday":"1.32%","Change from Last Report":"-0.03","Latest Volume":"3,054,489","Market Cap":"52,843,106,304","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.578384,"PB Ratio":3.0113823,"ROE":0.16870001,"DTE":33.531,"Industry":"Copper","Sector":"Basic Materials","Beta":1.91,"Trailing PEG":5.1083,"Trailing PE":28.288464,"Trailing PS":2.0609636,"Quick Ratio":1.048,"Day High":36.815,"Day Low":36.28,"VS Average Volume":0.2477915081,"Company Summary":"Freeport-McMoRan Inc. engages in the mining of mineral properties in North America, South America, and Indonesia. It primarily explores for copper, gold, molybdenum, silver, and other metals. The company's assets include the Grasberg minerals district in Indonesia; Morenci, Bagdad, Safford, Sierrita, and Miami in Arizona; Chino and Tyrone in New Mexico; and Henderson and Climax in Colorado, North America, as well as Cerro Verde in Peru and El Abra in Chile. The company was formerly known as Freeport-McMoRan Copper & Gold Inc. and changed its name to Freeport-McMoRan Inc. in July 2014. Freeport-McMoRan Inc. was incorporated in 1987 and is headquartered in Phoenix, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Procter & Gamble Company (The)","Symbol":"PG","Current Price":"166.62","Latest MA":"167.46","Price Target":178.47,"Difference from MA":"-0.50%","Difference from Open":"-0.51%","Change from Yesterday":"0.24%","Change from Last Report":"0.00","Latest Volume":"1,044,493","Market Cap":"390,698,893,312","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":22.629671,"PB Ratio":7.9357967,"ROE":0.28766,"DTE":69.338,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":0.414,"Trailing PEG":3.5224,"Trailing PE":26.531845,"Trailing PS":4.656443,"Quick Ratio":0.507,"Day High":167.48,"Day Low":165.93,"VS Average Volume":0.1464597175,"Company Summary":"The Procter & Gamble Company engages in the provision of branded consumer packaged goods worldwide. The company operates through five segments: Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care. The Beauty segment offers conditioners, shampoos, styling aids, and treatments under the Head & Shoulders, Herbal Essences, Pantene, and Rejoice brands; and antiperspirants and deodorants, personal cleansing, and skin care products under the Olay, Old Spice, Safeguard, Secret, SK-II, and Native brands. The Grooming segment provides blades and razors, shave products, appliances, and other grooming products under the Braun, Gillette, and Venus brand names. The Health Care segment offers toothbrushes, toothpastes, and other oral care products under the Crest and Oral-B brand names; and gastrointestinal, pain relief, rapid diagnostics, respiratory, vitamins\/minerals\/supplements, and other personal health care products under Metamucil, Neurobion, Pepto-Bismol, and Vicks brands. The Fabric & Home Care segment provides fabric enhancers, laundry additives, and laundry detergents under the Ariel, Downy, Gain, and Tide brands; and air care, dish care, P&G professional, and surface care products under the Cascade, Dawn, Fairy, Febreze, Mr. Clean, and Swiffer brands. The Baby, Feminine & Family Care segment offers baby wipes, and taped diapers and pants under the Luvs and Pampers brands; adult incontinence and feminine care products under the Always, Always Discreet, and Tampax brands; and paper towels, tissues, and toilet papers under the Bounty, Charmin, and Puffs brands. It sells its products primarily through mass merchandisers, e-commerce, grocery stores, membership club stores, drug stores, department stores, distributors, wholesalers, specialty beauty stores, high-frequency stores, pharmacies, electronics stores, and professional channels, as well as directly to consumers. The company was founded in 1837 and is headquartered in Cincinnati, Ohio.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Abbott Laboratories","Symbol":"ABT","Current Price":"127.79","Latest MA":"112.28","Price Target":133.07957,"Difference from MA":"13.82%","Difference from Open":"-0.16%","Change from Yesterday":"0.01%","Change from Last Report":"-0.11","Latest Volume":"1,736,402","Market Cap":"221,646,651,392","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":22.527906,"PB Ratio":5.569648,"ROE":0.14840001,"DTE":37.589,"Industry":"Medical Devices","Sector":"Healthcare","Beta":0.722,"Trailing PEG":2.2988,"Trailing PE":16.704575,"Trailing PS":5.3775544,"Quick Ratio":0.996,"Day High":128.905,"Day Low":127.195,"VS Average Volume":0.3037173144,"Company Summary":"Abbott Laboratories, together with its subsidiaries, discovers, develops, manufactures, and sells health care products worldwide. It operates in four segments: Established Pharmaceutical Products, Diagnostic Products, Nutritional Products, and Medical Devices. The company provides generic pharmaceuticals for the treatment of pancreatic exocrine insufficiency, irritable bowel syndrome or biliary spasm, intrahepatic cholestasis or depressive symptoms, gynecological disorder, hormone replacement therapy, dyslipidemia, hypertension, hypothyroidism, Ménière's disease and vestibular vertigo, pain, fever, inflammation, and migraine, as well as provides anti-infective clarithromycin, influenza vaccine, and products to regulate physiological rhythm of the colon. It also offers laboratory and transfusion medicine systems in the areas of immunoassay, clinical chemistry, hematology, and transfusion; molecular diagnostics polymerase chain reaction instrument systems that automate the extraction, purification, and preparation of DNA and RNA from patient samples, and detect and measure infectious agents; point of care systems; cartridges for testing blood gas, chemistry, electrolytes, coagulation, and immunoassay; rapid diagnostics lateral flow testing products; molecular point-of-care testing for HIV, SARS-CoV-2, influenza A and B, RSV, and strep A; cardiometabolic test systems; drug and alcohol test, and remote patient monitoring and consumer self-test systems; and informatics and automation solutions for laboratories. In addition, the company provides pediatric and adult nutritional products; rhythm management, electrophysiology, heart failure, vascular, and structural heart devices for the treatment of cardiovascular diseases; diabetes care products, such as glucose and blood glucose monitoring systems; and neuromodulation devices for the management of chronic pain and movement disorders. Abbott Laboratories was founded in 1888 and is based in North Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Alcoa Corporation","Symbol":"AA","Current Price":"35.58","Latest MA":"37.65","Price Target":48.04231,"Difference from MA":"-5.49%","Difference from Open":"0.14%","Change from Yesterday":"1.17%","Change from Last Report":"0.08","Latest Volume":"1,344,120","Market Cap":"9,192,271,872","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":11.042797,"PB Ratio":1.7508982,"ROE":-0.07142,"DTE":56.095,"Industry":"Aluminum","Sector":"Basic Materials","Beta":2.419,"Trailing PEG":null,"Trailing PE":136.84616,"Trailing PS":0.8353573,"Quick Ratio":0.671,"Day High":35.815,"Day Low":34.97,"VS Average Volume":0.2850575727,"Company Summary":"Alcoa Corporation, together with its subsidiaries, produces and sells bauxite, alumina, and aluminum products in the United States, Spain, Australia, Iceland, Norway, Brazil, Canada, and internationally. The company operates through two segments, Alumina and Aluminum. It engages in bauxite mining operations; and processes bauxite into alumina and sells it to customers who process it into industrial chemical products, as well as aluminum smelting and casting businesses. The company offers primary aluminum in the form of alloy ingot or value-add ingot to customers that produce products for the transportation, building and construction, packaging, wire, and other industrial markets; and flat-rolled aluminum in the form of sheet, which is sold primarily to customers that produce beverage and food cans. In addition, it owns hydro power plants that generates and sells electricity in the wholesale market to traders, large industrial consumers, distribution companies, and other generation companies. The company was formerly known as Alcoa Upstream Corporation and changed its name to Alcoa Corporation in October 2016. The company was founded in 1886 and is headquartered in Pittsburgh, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Lam Research Corporation","Symbol":"LRCX","Current Price":"80.41","Latest MA":"81.08","Price Target":91.08359,"Difference from MA":"-0.83%","Difference from Open":"0.65%","Change from Yesterday":"7.19%","Change from Last Report":"0.01","Latest Volume":"10,929,558","Market Cap":"103,462,748,160","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.22369,"PB Ratio":12.276336,"ROE":0.49116,"DTE":58.827,"Industry":"Semiconductor Equipment & Materials","Sector":"Technology","Beta":1.486,"Trailing PEG":1.4446,"Trailing PE":24.440731,"Trailing PS":6.635928,"Quick Ratio":1.685,"Day High":80.39,"Day Low":77.6,"VS Average Volume":0.951373781,"Company Summary":"Lam Research Corporation designs, manufactures, markets, refurbishes, and services semiconductor processing equipment used in the fabrication of integrated circuits. The company offers ALTUS systems to deposit conformal films for tungsten metallization applications; SABRE electrochemical deposition products for copper interconnect transition that offers copper damascene manufacturing; and VECTOR plasma-enhanced CVD products. It also provides SPEED gapfill high-density plasma chemical vapor deposition products; and Striker single-wafer atomic layer deposition products for dielectric film solutions. In addition, the company offers Flex for dielectric etch applications; Vantex, a dielectric etch system that provides RF technology and repeatable wafer-to-wafer performance enabled by Equipment Intelligence solutions; Kiyo for conductor etch applications; Syndion for through-silicon via etch applications; and Versys metal products for metal etch processes. Further, it provides Coronus bevel clean products to enhance die yield; and Da Vinci, DV-Prime, EOS, and SP series products to address various wafer cleaning applications. The company sells its products in the United States, China, Europe, Japan, Korea, Southeast Asia, and Taiwan. Lam Research Corporation was incorporated in 1980 and is headquartered in Fremont, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Halliburton Company","Symbol":"HAL","Current Price":"26.41","Latest MA":"29.95","Price Target":34.41481,"Difference from MA":"-11.80%","Difference from Open":"-0.51%","Change from Yesterday":"0.23%","Change from Last Report":"-0.04","Latest Volume":"2,466,037","Market Cap":"23,205,632,000","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.571151,"PB Ratio":2.2524943,"ROE":0.26293,"DTE":83.993,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.905,"Trailing PEG":1.7644,"Trailing PE":9.333922,"Trailing PS":1.0057484,"Quick Ratio":1.377,"Day High":26.6227,"Day Low":26.28,"VS Average Volume":0.2409068551,"Company Summary":"Halliburton Company provides products and services to the energy industry worldwide. It operates through two segments, Completion and Production, and Drilling and Evaluation. The Completion and Production segment offers production enhancement services that include stimulation and sand control services; cementing services, such as well bonding and casing, and casing equipment; and completion tools that offer downhole solutions and services, including well completion products and services, intelligent well completions, and service tools, as well as liner hanger, sand control, and multilateral systems. This segment also provides electrical submersible pumps, as well as artificial lift services; production solutions comprising coiled tubing, hydraulic workover units, downhole tools, and pumping and nitrogen services; pipeline and process services, such as pre-commissioning, commissioning, maintenance, and decommissioning; and specialty chemicals and services. The Drilling and Evaluation segment offers drilling fluid systems, performance additives, completion fluids, solids control, specialized testing equipment, and waste management services; drilling systems and services; wireline and perforating services consists of open-hole logging, and cased-hole and slickline; and drill bits and services comprising roller cone rock bits, fixed cutter bits, hole enlargement, and related downhole tools and services, as well as coring equipment and services. This segment also provides cloud based digital services and artificial intelligence solutions on an open architecture for subsurface insights, integrated well construction, and reservoir and production management; testing and subsea services, such as acquisition and analysis of reservoir information and optimization solutions; and project management and integrated asset management services. Halliburton Company was founded in 1919 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Johnson & Johnson","Symbol":"JNJ","Current Price":"152.89","Latest MA":"154.36","Price Target":168.44952,"Difference from MA":"-0.95%","Difference from Open":"0.65%","Change from Yesterday":"1.08%","Change from Last Report":"0.07","Latest Volume":"1,313,528","Market Cap":"368,101,031,936","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.758826,"PB Ratio":5.24602,"ROE":0.20889,"DTE":50.958,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.518,"Trailing PEG":0.9597,"Trailing PE":26.405872,"Trailing PS":4.197467,"Quick Ratio":0.705,"Day High":152.9,"Day Low":151.405,"VS Average Volume":0.1529600961,"Company Summary":"Johnson & Johnson, together with its subsidiaries, researches, develops, manufactures, and sells various products in the healthcare field worldwide. The company's Innovative Medicine segment offers products for various therapeutic areas, such as immunology, including rheumatoid arthritis, psoriatic arthritis, inflammatory bowel disease, and psoriasis; infectious diseases comprising HIV\/AIDS; neuroscience, consisting of mood disorders, neurodegenerative disorders, and schizophrenia; oncology, such as prostate cancer, hematologic malignancies, lung cancer, and bladder cancer; cardiovascular and metabolism, including thrombosis, diabetes, and macular degeneration; and pulmonary hypertension comprising pulmonary arterial hypertension through retailers, wholesalers, distributors, hospitals, and healthcare professionals for prescription use. Its MedTech segment provides Interventional Solutions, including electrophysiology products to treat heart rhythm disorders; the heart recovery portfolio, which includes technologies to treat severe coronary artery disease requiring high-risk PCI or AMI cardiogenic shock; and neurovascular care that treats hemorrhagic and ischemic stroke. this segment also offers an orthopaedics portfolio that includes products and enabling technologies that support hips, knees, trauma, spine, sports, and other; surgery portfolios comprising advanced and general surgery technologies, as well as solutions for breast aesthetics, ear, nose, and throat procedures; contact lenses under the ACUVUE Brand; and TECNIS intraocular lenses for cataract surgery. It distributes its products to wholesalers, hospitals, and retailers, as well as physicians, nurses, hospitals, eye care professionals, and clinics. The company has a collaboration agreement with Stand Up To Cancer for research testing a combination of teclistamab and daratumumab to treat a rare disease AL amyloidosis. Johnson & Johnson was founded in 1886 and is based in New Brunswick, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Kinder Morgan, Inc.","Symbol":"KMI","Current Price":"28.11","Latest MA":"23.97","Price Target":29.585,"Difference from MA":"17.27%","Difference from Open":"1.98%","Change from Yesterday":"3.10%","Change from Last Report":"0.14","Latest Volume":"4,991,439","Market Cap":"62,461,407,232","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.85961,"PB Ratio":2.054289,"ROE":0.083500005,"DTE":101.433,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.907,"Trailing PEG":1.999,"Trailing PE":24.029915,"Trailing PS":4.1225934,"Quick Ratio":0.291,"Day High":28.209,"Day Low":27.5,"VS Average Volume":0.3492510201,"Company Summary":"Kinder Morgan, Inc. operates as an energy infrastructure company primarily in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas gasification, liquefaction, and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and\/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, renewable fuel and feedstocks, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; owns interests in\/or operates oil fields and gasoline processing plants; and operates a crude oil pipeline system in West Texas, as well as owns and operates RNG and LNG facilities. It owns and operates approximately 82,000 miles of pipelines and 139 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1997 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"GE Vernova Inc.","Symbol":"GEV","Current Price":"374.65","Latest MA":"266.73","Price Target":413.59042,"Difference from MA":"40.46%","Difference from Open":"2.64%","Change from Yesterday":"5.95%","Change from Last Report":"-0.09","Latest Volume":"2,120,792","Market Cap":"103,273,775,104","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":36.190968,"PB Ratio":10.856588,"ROE":"N\/A","DTE":9.346,"Industry":"Utilities - Renewable","Sector":"Utilities","Beta":"N\/A","Trailing PEG":3.0616,"Trailing PE":67.14158,"Trailing PS":3.0002258,"Quick Ratio":0.717,"Day High":383.83,"Day Low":364.93,"VS Average Volume":0.6417665472,"Company Summary":"GE Vernova Inc., an energy company, engages in the provision of various products and services that generate, transfer, orchestrate, convert, and store electricity in the United States, Europe, Asia, the Americas, the Middle East, and Africa. The company operates through three segments: Power, Wind, and Electrification. The Power segment designs, manufactures, and services gas, nuclear, hydro, and steam technologies. The Wind segment offers wind generation technologies, including onshore and offshore wind turbines and blades. The Electrification segment provides grid solutions, power conversion, solar, and storage solutions; and electrification software for the transmission, distribution, conversion, storage, and orchestration of electricity from point of generation to point of consumption. The company was incorporated in 2023 and is headquartered in Cambridge, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Amphenol Corporation","Symbol":"APH","Current Price":"70.99","Latest MA":"67.73","Price Target":83.37647,"Difference from MA":"4.82%","Difference from Open":"-0.92%","Change from Yesterday":"2.53%","Change from Last Report":"0.11","Latest Volume":"1,695,641","Market Cap":"85,586,247,680","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":28.211496,"PB Ratio":9.052537,"ROE":0.25293,"DTE":57.565,"Industry":"Electronic Components","Sector":"Technology","Beta":1.238,"Trailing PEG":2.4645,"Trailing PE":36.973957,"Trailing PS":6.0134797,"Quick Ratio":1.208,"Day High":71.6,"Day Low":70.31,"VS Average Volume":0.2495585073,"Company Summary":"Amphenol Corporation, together with its subsidiaries, primarily designs, manufactures, and markets electrical, electronic, and fiber optic connectors in the United States, China, and internationally. It operates through three segments: Harsh Environment Solutions, Communications Solutions, and Interconnect and Sensor Systems. The company offers connectors and connector systems, including harsh environment data, power, high-speed, fiber optic, and radio frequency interconnect products; busbars and power distribution systems; and other connectors. It also provides value-add products, such as backplane interconnect systems, cable assemblies and harnesses, and cable management products; other products comprising flexible and rigid printed circuit boards, hinges, other mechanical, and production related products. In addition, the company offers consumer device, network infrastructure, and other antennas; coaxial, power, and specialty cables; and sensors and sensor-based products. It sells its products through its sales force, independent representatives, and a network of electronics distributors to original equipment manufacturers, electronic manufacturing services companies, original design manufacturers, and service providers in the automotive, broadband communication, commercial aerospace, industrial, information technology and data communication, military, mobile device, and mobile network markets. Amphenol Corporation was founded in 1932 and is headquartered in Wallingford, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Netflix, Inc.","Symbol":"NFLX","Current Price":"974.45","Latest MA":"764.38","Price Target":1063.7195,"Difference from MA":"27.48%","Difference from Open":"-1.23%","Change from Yesterday":"-0.39%","Change from Last Report":"-0.08","Latest Volume":"1,780,695","Market Cap":"416,827,768,832","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":32.131557,"PB Ratio":18.332924,"ROE":0.34714,"DTE":81.461,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.25,"Trailing PEG":2.8552,"Trailing PE":49.065956,"Trailing PS":11.089597,"Quick Ratio":0.975,"Day High":994.57,"Day Low":971.2,"VS Average Volume":0.5154647084,"Company Summary":"Netflix, Inc. provides entertainment services. It offers TV series, documentaries, feature films, and games across various genres and languages. The company also provides members the ability to receive streaming content through a host of internet-connected devices, including TVs, digital video players, TV set-top boxes, and mobile devices. It has operations in approximately 190 countries. The company was incorporated in 1997 and is headquartered in Los Gatos, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"United Airlines Holdings, Inc.","Symbol":"UAL","Current Price":"107.73","Latest MA":"70.04","Price Target":129.49522,"Difference from MA":"53.81%","Difference from Open":"0.65%","Change from Yesterday":"-0.48%","Change from Last Report":"0.14","Latest Volume":"1,144,065","Market Cap":"35,429,814,272","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.2669115,"PB Ratio":3.097559,"ROE":0.27245,"DTE":291.676,"Industry":"Airlines","Sector":"Industrials","Beta":1.393,"Trailing PEG":1.0167,"Trailing PE":11.400001,"Trailing PS":0.63274306,"Quick Ratio":0.694,"Day High":108.4999,"Day Low":106.53,"VS Average Volume":0.1973447598,"Company Summary":"United Airlines Holdings, Inc., through its subsidiaries, provides air transportation services in North America, Asia, Europe, Africa, the Pacific, the Middle East, and Latin America. The company transports people and cargo through its mainline and regional fleets. It also offers catering, ground handling, flight academy, and maintenance services for third parties. The company was formerly known as United Continental Holdings, Inc. and changed its name to United Airlines Holdings, Inc. in June 2019. United Airlines Holdings, Inc. was incorporated in 1968 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"3M Company","Symbol":"MMM","Current Price":"153.49","Latest MA":"127.50","Price Target":154.29611,"Difference from MA":"20.38%","Difference from Open":"0.98%","Change from Yesterday":"1.22%","Change from Last Report":"0.03","Latest Volume":"1,044,855","Market Cap":"82,803,253,248","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":18.147488,"PB Ratio":18.006805,"ROE":1.1329399,"DTE":295.441,"Industry":"Conglomerates","Sector":"Industrials","Beta":1.001,"Trailing PEG":2.7455,"Trailing PE":21.141874,"Trailing PS":2.53702,"Quick Ratio":0.95,"Day High":153.9,"Day Low":151.83,"VS Average Volume":0.2965987186,"Company Summary":"3M Company provides diversified technology services in the United States and internationally. The company's Safety and Industrial segment offers industrial abrasives and finishing for metalworking applications; autobody repair solutions; closure systems for personal hygiene products, masking, and packaging materials; electrical products and materials for construction and maintenance, power distribution, and electrical original equipment manufacturers; structural adhesives and tapes; respiratory, hearing, eye, and fall protection solutions; and natural and color-coated mineral granules for shingles. Its Transportation and Electronics segment provides ceramic solutions; attachment\/bonding products, films, sound, and temperature management for transportation vehicles; premium large format graphic films for advertising and fleet signage; light management films and electronics assembly solutions; packaging and interconnection solutions; semiconductor production materials; data centers solutions; and reflective signage for highway, and vehicle safety. The company's Consumer segment provides consumer bandages, braces, supports, and consumer respirators; home cleaning products; retail abrasives, paint accessories, car care DIY products, picture hanging, and consumer air quality solutions; and stationery products. It offers its products through e-commerce and traditional wholesalers, retailers, jobbers, distributors, and dealers. 3M Company was founded in 1902 and is headquartered in Saint Paul, Minnesota.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"KeyCorp","Symbol":"KEY","Current Price":"17.94","Latest MA":"16.73","Price Target":21.04,"Difference from MA":"7.22%","Difference from Open":"0.62%","Change from Yesterday":"1.53%","Change from Last Report":"0.03","Latest Volume":"2,826,239","Market Cap":"19,855,812,608","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":10.284044,"PB Ratio":1.2390358,"ROE":0.0096700005,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.231,"Trailing PEG":0.7599,"Trailing PE":"N\/A","Trailing PS":4.0922947,"Quick Ratio":"N\/A","Day High":18.0053,"Day Low":17.77,"VS Average Volume":0.2662433824,"Company Summary":"KeyCorp operates as the holding company for KeyBank National Association that provides various retail and commercial banking products and services in the United States. It operates in two segments, Consumer Bank and Commercial Bank. The company offers various deposits, investment products and services; commercial leasing, investment management, consumer finance; and personal finance and financial wellness, student loan refinancing, mortgage and home equity, lending, credit card, treasury, business advisory, wealth management, asset management, cash management, portfolio management, and trust and related services to individuals and small and medium-sized businesses. It also provides a suite of banking and capital market products, such as syndicated finance, debt and equity capital market products, commercial payments, equipment finance, commercial mortgage banking, derivatives, foreign exchange, financial advisory, and public finance, as well as commercial mortgage loans to consumer, energy, healthcare, industrial, public sector, real estate, and technology sectors for middle market clients. In addition, the company offers community development financing, securities underwriting, brokerage, and investment banking services. The company was founded in 1849 and is headquartered in Cleveland, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"D.R. Horton, Inc.","Symbol":"DHI","Current Price":"145.10","Latest MA":"166.84","Price Target":167.265,"Difference from MA":"-13.03%","Difference from Open":"1.40%","Change from Yesterday":"2.30%","Change from Last Report":"0.09","Latest Volume":"1,240,457","Market Cap":"46,552,289,280","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":9.868419,"PB Ratio":1.8574226,"ROE":0.19631,"DTE":22.915,"Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":1.744,"Trailing PEG":0.5414,"Trailing PE":10.261669,"Trailing PS":1.2649597,"Quick Ratio":0.766,"Day High":145.69,"Day Low":142.1,"VS Average Volume":0.4044436547,"Company Summary":"D.R. Horton, Inc. operates as a homebuilding company in East, North, Southeast, South Central, Southwest, and Northwest regions in the United States. It engages in the acquisition and development of land; and construction and sale of residential homes in 125 markets across 36 states under the names of D.R. Horton. The company constructs and sells single-family detached homes; and attached homes, such as townhomes, duplexes, and triplexes. It provides mortgage financing services; and title insurance policies, and examination and closing services, as well as engages in the residential lot development business. In addition, the company develops, constructs, owns, leases, and sells multi-family and single-family rental properties; and owns non-residential real estate, including ranch land and improvements. It primarily serves homebuyers. D.R. Horton, Inc. was founded in 1978 and is headquartered in Arlington, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Charles Schwab Corporation (The","Symbol":"SCHW","Current Price":"82.26","Latest MA":"70.99","Price Target":89.5,"Difference from MA":"15.87%","Difference from Open":"-0.29%","Change from Yesterday":"0.23%","Change from Last Report":"-0.00","Latest Volume":"1,045,261","Market Cap":"150,580,953,088","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":15.8600645,"PB Ratio":3.9580183,"ROE":0.12111,"DTE":144.242,"Industry":"Capital Markets","Sector":"Financial Services","Beta":0.952,"Trailing PEG":0.9731,"Trailing PE":27.511538,"Trailing PS":8.036984,"Quick Ratio":0.481,"Day High":82.51,"Day Low":82.07,"VS Average Volume":0.1270935563,"Company Summary":"The Charles Schwab Corporation, together with its subsidiaries, operates as a savings and loan holding company that provides wealth management, securities brokerage, banking, asset management, custody, and financial advisory services in the United States and internationally. The company operates in two segments, Investor Services and Advisor Services. It offers brokerage accounts with equity and fixed income trading, margin lending, options trading, futures and forex trading, and cash management capabilities, including certificates of deposit; third-party mutual funds through the Mutual Fund Marketplace and Mutual Fund OneSource service, as well as mutual fund trading and clearing services to broker-dealers; exchange-traded funds; advisory solutions for managed portfolios, separately managed accounts, customized personal advice for tailored portfolios, specialized planning, and full-time portfolio management; banking products comprising checking and savings accounts, first lien residential real estate mortgage loans, home equity lines of credit, and pledged asset lines; and trust custody services, personal trust reporting services, and administrative trustee services. It also provides digital retirement calculators; integrated web-, mobile-, and software-based trading platforms, real-time market data, options trading, premium research, and multi-channel access; self-service education and support tools; online research and analysis tools; equity compensation plan sponsors full-service recordkeeping for stock plans, stock options, restricted stock, performance shares, and stock appreciation rights; retirement plan services; mutual fund clearing services; and advisor services, including interactive tools and educational content. The Company operates through branch offices. The Charles Schwab Corporation was founded in 1971 and is headquartered in Westlake, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Truist Financial Corporation","Symbol":"TFC","Current Price":"48.05","Latest MA":"43.19","Price Target":51.28947,"Difference from MA":"11.25%","Difference from Open":"0.09%","Change from Yesterday":"1.26%","Change from Last Report":"-0.01","Latest Volume":"1,300,938","Market Cap":"63,224,332,288","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":10.410572,"PB Ratio":1.0806099,"ROE":-0.09505,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.035,"Trailing PEG":1.9441,"Trailing PE":"N\/A","Trailing PS":4.361201,"Quick Ratio":"N\/A","Day High":48.315,"Day Low":47.75,"VS Average Volume":0.1657712976,"Company Summary":"Truist Financial Corporation, a financial services company, provides banking and trust services in the Southeastern and Mid-Atlantic United States. The company operates through three segments: Consumer Banking and Wealth, Corporate and Commercial Banking, and Insurance Holdings.Its deposit products include noninterest-bearing checking, interest-bearing checking, savings, and money market deposit accounts, as well as certificates of deposit and individual retirement accounts. The company also provides funding; asset management; automobile lending; credit card lending; consumer finance; home equity and mortgage lending; other direct retail lending; insurance; investment brokerage; mobile\/online banking; payment solutions; point-of-sale lending; retail and small business deposit products; small business lending; and wealth management\/private banking services. In addition, it offers asset based lending, investment banking and capital market, institutional trust, insurance premium finance, derivatives, commercial lending, international banking, leasing, merchant, commercial deposit and treasury, floor plan, mortgage warehouse lending, real estate lending, and supply chain financing services. Further, the company provides insurance brokerage, retail and wholesale brokerage, securities underwriting and market making, loan syndication, and investment management and advisory services. The company was formerly known as BB&T Corporation and changed its name to Truist Financial Corporation in December 2019. Truist Financial Corporation was founded in 1872 and is headquartered in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Huntington Bancshares Incorpora","Symbol":"HBAN","Current Price":"17.39","Latest MA":"15.29","Price Target":18.88889,"Difference from MA":"13.74%","Difference from Open":"0.29%","Change from Yesterday":"1.31%","Change from Last Report":"0.09","Latest Volume":"6,709,542","Market Cap":"25,278,945,280","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":11.198541,"PB Ratio":1.3872129,"ROE":0.08545,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.057,"Trailing PEG":2.903,"Trailing PE":14.25418,"Trailing PS":3.7786167,"Quick Ratio":"N\/A","Day High":17.42,"Day Low":17.24,"VS Average Volume":0.4184308483,"Company Summary":"Huntington Bancshares Incorporated operates as the bank holding company for The Huntington National Bank that provides commercial, consumer, and mortgage banking services in the United States. The company offers financial products and services to consumer and business customers, including deposits, lending, payments, mortgage banking, dealer financing, investment management, trust, brokerage, insurance, and other financial products and services. It also provides 24-hour grace, asterisk-free checking, money scout, $50 safety zone, standby cash, early pay, instant access, savings goal getter, and Huntington heads up; digitally powered consumer and business financial solutions to consumer lending, regional banking, branch banking, and wealth management customers; direct and indirect consumer loans, as well as dealer finance loans and deposits; and private banking, wealth management and legacy planning through investment and portfolio management, fiduciary administration and trust, institutional custody, and full-service retail brokerage investment services. The company offers equipment financing, asset-based lending, distribution finance, structured lending, and municipal financing solutions, as well as Huntington ChoicePay. In addition, it offers lending, liquidity, treasury management and other payment services, and capital markets; government and non-profits, healthcare, technology and telecommunications, franchises, financial sponsors, and global services; and corporate risk management, institutional sales and trading, debt and equity issuance, and additional advisory services. The company offers its products through a network of channels, including branches and ATMs, online and mobile banking, and through customer call centers to customers in middle market banking, corporate, specialty, and government banking, asset finance, commercial real estate banking, and capital markets. The company was founded in 1866 and is headquartered in Columbus, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Schlumberger N.V.","Symbol":"SLB","Current Price":"41.13","Latest MA":"42.70","Price Target":53.26903,"Difference from MA":"-3.66%","Difference from Open":"0.28%","Change from Yesterday":"0.48%","Change from Last Report":"0.04","Latest Volume":"2,993,682","Market Cap":"57,623,965,696","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":10.936989,"PB Ratio":2.7003872,"ROE":0.21722999,"DTE":57.141,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.532,"Trailing PEG":1.9154,"Trailing PE":13.226688,"Trailing PS":1.600888,"Quick Ratio":1.003,"Day High":41.38,"Day Low":40.685,"VS Average Volume":0.2315521723,"Company Summary":"Schlumberger Limited engages in the provision of technology for the energy industry worldwide. The company operates through four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company provides field development and hydrocarbon production, carbon management, and integration of adjacent energy systems; reservoir interpretation and data processing services for exploration data; and well construction and production improvement services and products. It also offers subsurface geology and fluids evaluation information; open and cased hole services; exploration and production pressure, and flow-rate measurement services; and pressure pumping, well stimulation, and coiled tubing equipment solutions. In addition, the company offers mud logging, directional drilling, measurement-while-drilling, and logging-while-drilling services, as well as engineering support services; supplies drilling fluid systems; designs, manufactures, and markets roller cone and fixed cutter drill bits; bottom-hole-assembly and borehole enlargement technologies; well cementing products and services; well planning, well drilling, engineering, supervision, logistics, procurement, and contracting of third parties, as well as drilling rig management solutions; and drilling equipment and services, as well as land drilling rigs and related services. Further, it provides artificial lift production equipment and optimization services; supplies packers, safety valves, sand control technology, and various intelligent well completions technology and equipment; designs and manufactures valves, chokes, actuators, and surface trees; and OneSubsea, an integrated solutions, products, systems, and services, including wellheads, subsea trees, manifolds and flowline connectors, control systems, connectors, and services. The company was formerly known as Socie´te´ de Prospection E´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"U.S. Bancorp","Symbol":"USB","Current Price":"48.10","Latest MA":"46.03","Price Target":57.14286,"Difference from MA":"4.51%","Difference from Open":"-0.21%","Change from Yesterday":"0.89%","Change from Last Report":"0.02","Latest Volume":"1,589,303","Market Cap":"75,036,000,256","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":9.9440975,"PB Ratio":1.4422355,"ROE":0.09779,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.04,"Trailing PEG":1.1493,"Trailing PE":12.691293,"Trailing PS":3.0138571,"Quick Ratio":"N\/A","Day High":48.37,"Day Low":47.895,"VS Average Volume":0.1962229408,"Company Summary":"U.S. Bancorp, a financial services holding company, provides various financial services to individuals, businesses, institutional organizations, governmental entities, and other financial institutions in the United States. It operates through Wealth, Corporate, Commercial and Institutional Banking; Consumer and Business Banking; Payment Services; and Treasury and Corporate Support segments. The company offers depository services, including checking accounts, savings accounts, and time certificate contracts; and lending services, such as traditional credit products and credit card services, lease financing and import\/export trade, asset-backed lending, agricultural finance, and other products. It also provides ancillary services comprising capital markets, treasury management, and receivable lock-box collection services to corporate and governmental entity customers. In addition, the company offers asset management and fiduciary services for individuals, estates, foundations, business corporations, and charitable organizations. Further, it provides investment and insurance products to its customers principally within its domestic markets, as well as fund administration services to mutual and other funds. Additionally, the company provides corporate and purchasing card, and corporate trust services. Furthermore, it offers trust and investment management, merchant and ATM processing, mortgage banking, insurance, and brokerage and leasing services. U.S. Bancorp was founded in 1863 and is headquartered in Minneapolis, Minnesota.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"First Horizon Corporation","Symbol":"FHN","Current Price":"21.75","Latest MA":"17.60","Price Target":23.2,"Difference from MA":"23.58%","Difference from Open":"-0.02%","Change from Yesterday":"1.05%","Change from Last Report":"0.09","Latest Volume":"1,067,689","Market Cap":"11,394,380,800","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":11.540156,"PB Ratio":1.3463564,"ROE":0.08979,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.882,"Trailing PEG":null,"Trailing PE":15.988971,"Trailing PS":3.710316,"Quick Ratio":"N\/A","Day High":21.88,"Day Low":21.67,"VS Average Volume":0.1701794466,"Company Summary":"First Horizon Corporation operates as the bank holding company for First Horizon Bank that provides various financial services. The company operates through Regional Banking and Specialty Banking segments. It offers general banking services for consumers, businesses, financial institutions, and governments. The company also accepts deposits; provides underwriting services for bank-eligible securities and other fixed-income securities by financial subsidiaries; sells loans and derivatives; financial planning; and offers investment and financial advisory services. In addition, it offers mortgage banking; loan syndications; brokerage services; commercial and business banking for business enterprises, consumer banking, and private client and wealth management services; capital markets, professional commercial real estate, mortgage warehouse and asset-based lending, franchise and equipment finance, tax credit finance, energy and healthcare finance, asset management, and corporate and correspondent banking services. Further, the company provides transaction processing services including check clearing services and remittance processing, credit cards, investment, and sale of mutual fund and retail insurances, as well as trust, fiduciary, and agency services. First Horizon Corporation was founded in 1864 and is headquartered in Memphis, Tennessee.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Bank of America Corporation","Symbol":"BAC","Current Price":"46.66","Latest MA":"42.24","Price Target":52.16667,"Difference from MA":"10.49%","Difference from Open":"-0.94%","Change from Yesterday":"-0.19%","Change from Last Report":"0.13","Latest Volume":"7,338,086","Market Cap":"355,160,784,896","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.777759,"PB Ratio":1.3193012,"ROE":0.08092,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.325,"Trailing PEG":2.0713,"Trailing PE":14.537383,"Trailing PS":3.753311,"Quick Ratio":"N\/A","Day High":47.16,"Day Low":46.57,"VS Average Volume":0.2062723951,"Company Summary":"Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. It operates in four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, non-interest and interest-bearing checking accounts, and investment accounts and products; credit and debit cards; residential mortgages, and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research, and certain market-based services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Morgan Stanley","Symbol":"MS","Current Price":"139.75","Latest MA":"113.57","Price Target":135.5,"Difference from MA":"23.05%","Difference from Open":"-0.04%","Change from Yesterday":"0.67%","Change from Last Report":"0.13","Latest Volume":"1,336,620","Market Cap":"224,578,256,896","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":14.864777,"PB Ratio":2.3993065,"ROE":0.11079001,"DTE":405.772,"Industry":"Capital Markets","Sector":"Financial Services","Beta":1.336,"Trailing PEG":3.7088,"Trailing PE":17.578617,"Trailing PS":3.853304,"Quick Ratio":1.83,"Day High":140.27,"Day Low":139.33,"VS Average Volume":0.1956121826,"Company Summary":"Morgan Stanley, a financial holding company, provides various financial products and services to corporations, governments, financial institutions, and individuals in the Americas, Europe, the Middle East, Africa, and Asia. It operates through Institutional Securities, Wealth Management, and Investment Management segments. The Institutional Securities segment offers capital raising and financial advisory services, including services related to the underwriting of debt, equity, and other securities, as well as advice on mergers and acquisitions, restructurings, real estate, and project finance. This segment also provides equity and fixed income products comprising sales, financing, prime brokerage, and market-making services; foreign exchange and commodities; corporate and commercial real estate loans, commercial mortgage and secured lending facilities, and financing for sales and trading customers, and asset-backed and mortgage lending; and wealth management services, investment, and research services. The Wealth Management segment offers financial advisor-led brokerage, custody, administrative, and investment advisory services; self-directed brokerage services; financial and wealth planning services; workplace services, including stock plan administration; annuity and insurance products; securities-based lending, residential real estate loans, and other lending products; banking; and retirement plan services to individual investors and small to medium-sized businesses and institutions. The Investment Management segment provides equity, fixed income, alternatives and solutions, and liquidity and overlay services to benefit\/defined contribution plans, foundations, endowments, government entities, sovereign wealth funds, insurance companies, third-party fund sponsors, corporations, and individuals through institutional and intermediary channels. The company was founded in 1924 and is headquartered in New York, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Wells Fargo & Company","Symbol":"WFC","Current Price":"78.77","Latest MA":"63.59","Price Target":83.28571,"Difference from MA":"23.88%","Difference from Open":"-0.47%","Change from Yesterday":"0.56%","Change from Last Report":"0.10","Latest Volume":"2,084,620","Market Cap":"259,069,788,160","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":11.515997,"PB Ratio":1.6004307,"ROE":0.099139996,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.136,"Trailing PEG":3.4646,"Trailing PE":14.668529,"Trailing PS":3.3267386,"Quick Ratio":"N\/A","Day High":79.23,"Day Low":78.58,"VS Average Volume":0.1259151806,"Company Summary":"Wells Fargo & Company, a financial services company, provides diversified banking, investment, mortgage, and consumer and commercial finance products and services in the United States and internationally. The company operates through four segments: Consumer Banking and Lending; Commercial Banking; Corporate and Investment Banking; and Wealth and Investment Management. The Consumer Banking and Lending segment offers diversified financial products and services for consumers and small businesses. Its financial products and services include checking and savings accounts, and credit and debit cards, as well as home, auto, personal, and small business lending services. The Commercial Banking segment provides financial solutions to private, family owned, and certain public companies. Its products and services include banking and credit products across various industry sectors and municipalities, secured lending and lease products, and treasury management services. The Corporate and Investment Banking segment offers a suite of capital markets, banking, and financial products and services, such as corporate banking, investment banking, treasury management, commercial real estate lending and servicing, equity, and fixed income solutions, as well as sales, trading, and research capabilities services to corporate, commercial real estate, government, and institutional clients. The Wealth and Investment Management segment provides personalized wealth management, brokerage, financial planning, lending, private banking, and trust and fiduciary products and services to affluent, high-net worth, and ultra-high-net worth clients. It also operates through financial advisors in brokerage and wealth offices, consumer bank branches, independent offices, and digitally through WellsTrade and Intuitive Investor. The company was founded in 1852 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Citigroup, Inc.","Symbol":"C","Current Price":"81.62","Latest MA":"65.71","Price Target":91.47222,"Difference from MA":"24.21%","Difference from Open":"0.41%","Change from Yesterday":"1.16%","Change from Last Report":"0.11","Latest Volume":"2,185,013","Market Cap":"153,208,913,920","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.825292,"PB Ratio":0.8009264,"ROE":0.03874,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.426,"Trailing PEG":0.874,"Trailing PE":13.717648,"Trailing PS":2.2105517,"Quick Ratio":"N\/A","Day High":81.75,"Day Low":80.99,"VS Average Volume":0.1479066427,"Company Summary":"Citigroup Inc., a diversified financial service holding company, provides various financial product and services to consumers, corporations, governments, and institutions worldwide. It operates through five segments: Services, Markets, Banking, U.S. Personal Banking, and Wealth. The Services segment includes Treasury and Trade Solutions, which provides cash management, trade, and working capital solutions to multinational corporations, financial institutions, and public sector organizations; and Securities Services, such as cross-border support for clients, local market expertise, post-trade technologies, data solutions, and various securities services solutions. The Markets segment offers sales and trading services for equities, foreign exchange, rates, spread products, and commodities to corporate, institutional, and public sector clients; and market-making services, including asset classes, risk management solutions, financing, prime brokerage, research, securities clearing, and settlement. The banking segment includes investment banking; advisory services related to mergers and acquisitions, divestitures, restructurings, and corporate defense activities; and corporate lending, which includes corporate and commercial banking. The U.S. Personal Banking segment provides co-branded cards and retail banking services. The Wealth segment provides financial services to high-net-worth clients through banking, lending, mortgages, investment, custody, and trust product offerings; and to professional industries, including law firms, consulting groups, accounting, and asset management. The company was founded in 1812 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Delta Air Lines, Inc.","Symbol":"DAL","Current Price":"68.59","Latest MA":"52.92","Price Target":79.92864,"Difference from MA":"29.61%","Difference from Open":"0.87%","Change from Yesterday":"0.25%","Change from Last Report":"0.01","Latest Volume":"1,322,811","Market Cap":"44,259,823,616","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.1252365,"PB Ratio":3.222457,"ROE":0.4067,"DTE":186.78,"Industry":"Airlines","Sector":"Industrials","Beta":1.341,"Trailing PEG":null,"Trailing PE":12.868668,"Trailing PS":0.73390853,"Quick Ratio":0.268,"Day High":68.9,"Day Low":67.8,"VS Average Volume":0.1675113077,"Company Summary":"Delta Air Lines, Inc. provides scheduled air transportation for passengers and cargo in the United States and internationally. The company operates through two segments, Airline and Refinery. Its domestic network centered on core hubs in Atlanta, Minneapolis-St. Paul, Detroit, and Salt Lake City, as well as coastal hub positions in Boston, Los Angeles, New York-LaGuardia, New York-JFK, and Seattle; and international network centered on hubs and market presence in Amsterdam, Bogota, Lima, Mexico City, London-Heathrow, Paris-Charles de Gaulle, Sao Paulo, Seoul-Incheon, and Tokyo. The company sells its tickets through various distribution channels, including delta.com and the Fly Delta app; acts as a reservations specialists; and operates online travel and traditional brick and mortar agencies. It also provides aircraft maintenance and engineering support, repair, and overhaul services; and vacation packages to third-party consumers. The company operates through a fleet of approximately 1,273 aircrafts. Delta Air Lines, Inc. was founded in 1924 and is based in Atlanta, Georgia.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"JP Morgan Chase & Co.","Symbol":"JPM","Current Price":"267.62","Latest MA":"223.80","Price Target":265.5481,"Difference from MA":"19.58%","Difference from Open":"-0.38%","Change from Yesterday":"0.44%","Change from Last Report":"0.10","Latest Volume":"1,649,282","Market Cap":"748,693,684,224","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.643919,"PB Ratio":2.3240988,"ROE":0.16216,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.091,"Trailing PEG":7.244,"Trailing PE":13.55038,"Trailing PS":4.6173472,"Quick Ratio":"N\/A","Day High":268.98,"Day Low":266.6201,"VS Average Volume":0.1730540389,"Company Summary":"JPMorgan Chase & Co. operates as a financial services company worldwide. It operates through three segments: Consumer & Community Banking, Commercial & Investment Bank, and Asset & Wealth Management. It offers deposit, investment and lending products, cash management, and payments and services; mortgage origination and servicing activities; residential mortgages and home equity loans; and credit cards, auto loans, leases, and travel services to consumers and small businesses through bank branches, ATMs, and digital and telephone banking. The company also provides investment banking products and services, including corporate strategy and structure advisory, and equity and debt market capital-raising services, as well as loan origination and syndication; payments; and cash and derivative instruments, risk management solutions, prime brokerage, and research, as well as offers securities services, including custody, fund accounting and administration, and securities lending products for asset managers, insurance companies, and public and private investment funds. In addition, it provides financial solutions, including lending, payments, investment banking, and asset management to small and midsized companies, local governments, nonprofit clients, and large corporations, as well as investors, developers, and owners of multifamily, office, retail, industrial, and affordable housing properties. Further, the company offers multi-asset investment management solutions in equities, fixed income, alternatives, and money market funds to institutional clients and retail investors; and retirement products and services, brokerage, custody, estate planning, lending, deposits, and investment management products to high net worth clients. JPMorgan Chase & Co. was founded in 1799 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Walgreens Boots Alliance, Inc.","Symbol":"WBA","Current Price":"11.43","Latest MA":"9.77","Price Target":12.414,"Difference from MA":"16.97%","Difference from Open":"1.29%","Change from Yesterday":"1.42%","Change from Last Report":"-0.12","Latest Volume":"4,600,039","Market Cap":"9,872,948,224","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":7.7195425,"PB Ratio":0.9450741,"ROE":-0.75969005,"DTE":277.898,"Industry":"Pharmaceutical Retailers","Sector":"Healthcare","Beta":0.669,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.06686362,"Quick Ratio":0.332,"Day High":11.6,"Day Low":11.25,"VS Average Volume":0.1888766709,"Company Summary":"Walgreens Boots Alliance, Inc. operates as a healthcare, pharmacy, and retail company in the United States, Germany, the United Kingdom, and internationally. It operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The U.S. Retail Pharmacy segment engages in operation of the retail drugstores, health and wellness services, specialty, and home delivery pharmacy services, which offers health and wellness, beauty, personal care and consumables, and general merchandise. The International segment offers sale of prescription drugs and health and wellness, beauty, personal care, and other consumer products outside the United States; and operates pharmacy-led health and beauty retail businesses under the Boots brand stores in the United Kingdom, the Republic of Ireland, and Thailand, as well as the Benavides brand in Mexico and the Ahumada brand in Chile. The U.S. Healthcare segment provides VillageMD, a national provider of value-based care with primary, multi-specialty, and urgent care providers serving patients in traditional clinic settings, in patients' homes and online appointments; Shields, a specialty pharmacy integrator and accelerator for hospitals; and CareCentrix, a participant in the post-acute and home care management sectors. Walgreens Boots Alliance, Inc. was founded in 1909 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Alphabet Inc.","Symbol":"GOOGL","Current Price":"198.23","Latest MA":"174.34","Price Target":216.14644,"Difference from MA":"13.70%","Difference from Open":"0.12%","Change from Yesterday":"1.51%","Change from Last Report":"0.15","Latest Volume":"8,818,065","Market Cap":"2,436,464,640,000","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":22.034025,"PB Ratio":7.739429,"ROE":0.32101002,"DTE":9.324,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.034,"Trailing PEG":1.2782,"Trailing PE":26.290451,"Trailing PS":7.1690454,"Quick Ratio":1.761,"Day High":201.4,"Day Low":197.67,"VS Average Volume":0.3179115865,"Company Summary":"Alphabet Inc. offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube. It is also involved in the sale of apps and in-app purchases and digital content in the Google Play and YouTube; and devices, as well as in the provision of YouTube consumer subscription services. The Google Cloud segment offers infrastructure, cybersecurity, databases, analytics, AI, and other services; Google Workspace that include cloud-based communication and collaboration tools for enterprises, such as Gmail, Docs, Drive, Calendar, and Meet; and other services for enterprise customers. The Other Bets segment sells healthcare-related and internet services. The company was incorporated in 1998 and is headquartered in Mountain View, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Lumen Technologies, Inc.","Symbol":"LUMN","Current Price":"4.98","Latest MA":"5.48","Price Target":5.37091,"Difference from MA":"-9.04%","Difference from Open":"-1.90%","Change from Yesterday":"-1.02%","Change from Last Report":"0.48","Latest Volume":"2,506,991","Market Cap":"5,057,508,352","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":-7.4450254,"PB Ratio":14.788426,"ROE":-1.6673199,"DTE":5502.924,"Industry":"Telecom Services","Sector":"Communication Services","Beta":1.201,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.3803782,"Quick Ratio":0.988,"Day High":5.0922,"Day Low":4.9,"VS Average Volume":0.1766834017,"Company Summary":"Lumen Technologies, Inc., a facilities-based technology and communications company, provides various integrated products and services to business and residential customers in the United States and internationally. The company operates in two segments, Business and Mass Markets. It offers dark fiber, edge cloud services, internet protocol, managed security, software-defined wide area networks, secure access service edge, unified communications and collaboration, and optical wavelengths services; ethernet and VPN data networks services; and legacy services to manage cash flow, including time division multiplexing voice, private line, and other legacy services, as well as sells communication equipment, and IT solutions. The company also provides high speed and lower speed broadband service to residential and small business customers; local and long-distance voice services, professional services, and other ancillary services; and federal broadband and state support programs. It serves its products and services under the Lumen, Quantum Fiber, and CenturyLink brands. The company was formerly known as CenturyLink, Inc. and changed its name to Lumen Technologies, Inc. in September 2020. Lumen Technologies, Inc. was incorporated in 1968 and is headquartered in Monroe, Louisiana.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Pfizer, Inc.","Symbol":"PFE","Current Price":"26.85","Latest MA":"27.17","Price Target":31.12955,"Difference from MA":"-1.18%","Difference from Open":"0.72%","Change from Yesterday":"0.89%","Change from Last Report":"-0.03","Latest Volume":"7,122,090","Market Cap":"152,173,985,792","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":9.194933,"PB Ratio":1.6486186,"ROE":0.04538,"DTE":73.408,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.615,"Trailing PEG":0.1994,"Trailing PE":35.8036,"Trailing PS":2.56293,"Quick Ratio":0.64,"Day High":26.87,"Day Low":26.58,"VS Average Volume":0.1632186494,"Company Summary":"Pfizer Inc. discovers, develops, manufactures, markets, distributes, and sells biopharmaceutical products in the United States, Europe, and internationally. The company offers medicines and vaccines in various therapeutic areas, including cardiovascular metabolic, migraine, and women's health under the Eliquis, Nurtec ODT\/Vydura, Zavzpret, and the Premarin family brands; infectious diseases with unmet medical needs under the Prevnar family, Abrysvo, Nimenrix, FSME\/IMMUN-TicoVac, and Trumenba brands; and COVID-19 prevention and treatment, and potential future mRNA and antiviral products under the Comirnaty and Paxlovid brands. It also provides medicines and vaccines in various therapeutic areas, such as biosimilars for chronic immune and inflammatory diseases under the Xeljanz, Enbrel, Inflectra, Litfulo, Velsipity, and Cibinqo brands; amyloidosis, hemophilia, endocrine diseases, and sickle cell disease under the Vyndaqel family, Oxbryta, BeneFIX, Somavert, Ngenla, and Genotropin brands; sterile injectable and anti-infective medicines under the Sulperazon, Medrol, Zavicefta, Zithromax, and Panzyga brands; and biologics, small molecules, immunotherapies, and biosimilars under the Ibrance, Xtandi, Inlyta, Bosulif, Mektovi, Padcev, Adcetris, Talzenna, Tukysa, Elrexfio, Tivdak, Lorbrena, and Braftovi brands. In addition, the company involved in the contract manufacturing business. It serves wholesalers, retailers, hospitals, clinics, government agencies, pharmacies, individual provider offices, retail pharmacies, and integrated delivery systems. The company has collaboration agreements with Bristol-Myers Squibb Company; Astellas Pharma US, Inc.; Merck KGaA; and BioNTech SE, as well as has strategic clinical collaboration with Acepodia Inc. for the development of antibody-cell conjugation-based cell therapies in autoimmune diseases. Pfizer Inc. was founded in 1849 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Enterprise Products Partners L.","Symbol":"EPD","Current Price":"34.08","Latest MA":"29.95","Price Target":35.66722,"Difference from MA":"13.81%","Difference from Open":"0.35%","Change from Yesterday":"1.07%","Change from Last Report":"0.09","Latest Volume":"1,220,044","Market Cap":"73,871,130,624","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":11.794878,"PB Ratio":2.6059031,"ROE":0.20665,"DTE":110.757,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":1.014,"Trailing PEG":3.263,"Trailing PE":12.812031,"Trailing PS":1.304222,"Quick Ratio":0.719,"Day High":34.09,"Day Low":33.6798,"VS Average Volume":0.2871501866,"Company Summary":"Enterprise Products Partners L.P. provides midstream energy services to producers and consumers of natural gas, natural gas liquids (NGLs), crude oil, petrochemicals, and refined products. It operates in four segments: NGL Pipelines & Services, Crude Oil Pipelines & Services, Natural Gas Pipelines & Services, and Petrochemical & Refined Products Services. The NGL Pipelines & Services segment offers natural gas processing and related NGL marketing services. It operates natural gas processing facilities located in Colorado, Louisiana, Mississippi, New Mexico, Texas, and Wyoming; NGL pipelines; NGL fractionation facilities; NGL and related product storage facilities; and NGL marine terminals. The Crude Oil Pipelines & Services segment operates crude oil pipelines; and crude oil storage and marine terminals, which include a fleet of approximately 250 tractor-trailer tank trucks that are used to transport crude oil. It also engages in crude oil marketing activities. The Natural Gas Pipelines & Services segment operates natural gas pipeline systems to gather, treat, and transport natural gas. It leases underground salt dome natural gas storage facilities in Napoleonville, Louisiana; owns an underground salt dome storage cavern in Wharton County, Texas; and markets natural gas. The Petrochemical & Refined Products Services segment operates propylene fractionation facilities, including propylene fractionation units and propane dehydrogenation facilities, and related marketing activities; butane isomerization complex and related deisobutanizer operations; and octane enhancement, isobutane dehydrogenation, and high purity isobutylene production facilities. It also operates refined products pipelines and terminals; and ethylene export terminals; and provides refined products marketing and marine transportation services. Enterprise Products Partners L.P. was founded in 1968 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Super Micro Computer, Inc.","Symbol":"SMCI","Current Price":"28.11","Latest MA":"47.17","Price Target":40.79182,"Difference from MA":"-40.40%","Difference from Open":"-1.63%","Change from Yesterday":"0.94%","Change from Last Report":"0.11","Latest Volume":"8,029,854","Market Cap":"16,463,159,296","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.6206245,"PB Ratio":3.016631,"ROE":0.32469,"DTE":39.749,"Industry":"Computer Hardware","Sector":"Technology","Beta":1.279,"Trailing PEG":null,"Trailing PE":13.987562,"Trailing PS":1.1017413,"Quick Ratio":1.805,"Day High":28.63,"Day Low":27.81,"VS Average Volume":0.1084783183,"Company Summary":"Super Micro Computer, Inc., together with its subsidiaries, develops and manufactures high performance server and storage solutions based on modular and open architecture in the United States, Europe, Asia, and internationally. Its solutions range from complete server, storage systems, modular blade servers, blades, workstations, full racks, networking devices, server sub-systems, server management software, and security software. The company provides application-optimized server solutions, rackmount and blade servers, storage, and subsystems and accessories; and server software management solutions, such as Server Management Suite, including Supermicro Server Manager, Supermicro Power Management software, Supermicro Update Manager, SuperCloud Composer, and SuperDoctor 5. In addition, it offers server subsystems and accessories comprising server boards, chassis, power supplies, and other accessories. Further, the company provides server and storage system integration, configuration, and software upgrade and update services; and technical documentation services, as well as identifies service requirements, creates and executes project plans, and conducts verification testing and technical documentation, and training services. Additionally, it offers help desk and on-site product support services for its server and storage systems; and customer support services, including ongoing maintenance and technical support for its products. The company provides its products to enterprise data centers, cloud computing, artificial intelligence, and 5G and edge computing markets. It sells its products through direct and indirect sales force, distributors, value-added resellers, system integrators, and original equipment manufacturers. The company was incorporated in 1993 and is headquartered in San Jose, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"PayPal Holdings, Inc.","Symbol":"PYPL","Current Price":"90.04","Latest MA":"76.77","Price Target":96.24829,"Difference from MA":"17.28%","Difference from Open":"0.31%","Change from Yesterday":"1.48%","Change from Last Report":"0.23","Latest Volume":"3,085,803","Market Cap":"90,268,704,768","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":18.344587,"PB Ratio":4.489877,"ROE":0.22188,"DTE":65.718,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.436,"Trailing PEG":1.4784,"Trailing PE":21.54067,"Trailing PS":2.8695905,"Quick Ratio":0.261,"Day High":90.925,"Day Low":89.57,"VS Average Volume":0.3568378769,"Company Summary":"PayPal Holdings, Inc. operates a technology platform that enables digital payments on behalf of merchants and consumers worldwide. It operates a two-sided network at scale that connects merchants and consumers that enables its customers to connect, transact, and send and receive payments through online and in person, as well as transfer and withdraw funds using various funding sources, such as bank accounts, PayPal or Venmo account balance, PayPal and Venmo branded credit products comprising its installment products, credit and debit cards, and cryptocurrencies, as well as other stored value products, including gift cards and eligible rewards. The company provides payment solutions under the PayPal, PayPal Credit, Braintree, Venmo, Xoom, Zettle, Hyperwallet, Honey, and Paidy names. The company was founded in 1998 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Advanced Micro Devices, Inc.","Symbol":"AMD","Current Price":"117.64","Latest MA":"144.68","Price Target":169.81767,"Difference from MA":"-18.69%","Difference from Open":"-0.71%","Change from Yesterday":"0.12%","Change from Last Report":"-0.03","Latest Volume":"10,858,417","Market Cap":"190,907,367,424","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":23.788242,"PB Ratio":3.3505168,"ROE":0.03262,"DTE":3.927,"Industry":"Semiconductors","Sector":"Technology","Beta":1.706,"Trailing PEG":0.3245,"Trailing PE":104.10619,"Trailing PS":7.8578873,"Quick Ratio":1.575,"Day High":120.44,"Day Low":117.47,"VS Average Volume":0.2989872053,"Company Summary":"Advanced Micro Devices, Inc. operates as a semiconductor company worldwide. It operates through Data Center, Client, Gaming, and Embedded segments. The company offers x86 microprocessors and graphics processing units (GPUs) as an accelerated processing unit, chipsets, data center, and professional GPUs; and embedded processors, and semi-custom system-on-chip (SoC) products, microprocessor and SoC development services and technology, data processing unites, field programmable gate arrays (FPGA), and adaptive SoC products. It provides processors under the AMD Ryzen, AMD Ryzen PRO, Ryzen Threadripper, Ryzen Threadripper PRO, AMD Athlon, AMD Athlon PRO, and AMD PRO A-Series brand names; graphics under the AMD Radeon graphics and AMD Embedded Radeon graphics; and professional graphics under the AMD Radeon Pro graphics brand name. In addition, the company offers data center graphics under the Radeon Instinct and Radeon PRO V-series brands, as well as servers under the AMD Instinct accelerators brand; server microprocessors under the AMD EPYC brands; low power solutions under the AMD Athlon, AMD Geode, AMD Ryzen, AMD EPYC, AMD R-Series, and G-Series brands; FPGA products under the Virtex-6, Virtex-7, Virtex UltraScale+, Kintex-7, Kintex UltraScale, Kintex UltraScale+, Artix-7, Artix UltraScale+, Spartan-6, and Spartan-7 brands; adaptive SOCs under the Zynq-7000, Zynq UltraScale+ MPSoC, Zynq UltraScale+ RFSoCs, Versal HBM, Versal Premium, Versal Prime, Versal AI Core, Versal AI Edge, Vitis, and Vivado brands; and compute and network acceleration board products under the Alveo brand. It serves original equipment and design manufacturers, public cloud service providers, system integrators, independent distributors, and add-in-board manufacturers through its direct sales force, and sales representatives. Advanced Micro Devices, Inc. was incorporated in 1969 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Amcor plc","Symbol":"AMCR","Current Price":"9.71","Latest MA":"10.27","Price Target":11.29556,"Difference from MA":"-5.53%","Difference from Open":"-0.15%","Change from Yesterday":"-0.41%","Change from Last Report":"0.10","Latest Volume":"3,618,354","Market Cap":"14,027,025,408","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":12.2241535,"PB Ratio":3.5772207,"ROE":0.1958,"DTE":196.619,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":0.863,"Trailing PEG":1.9233,"Trailing PE":18.311321,"Trailing PS":1.0352048,"Quick Ratio":0.591,"Day High":9.76,"Day Low":9.68,"VS Average Volume":0.2306972534,"Company Summary":"Amcor plc develops, produces, and sells packaging products in Europe, North America, Latin America, and the Asia Pacific. The company operates in two segments, Flexibles and Rigid Packaging. The Flexibles segment offers flexible and film packaging products in the food and beverage, medical and pharmaceutical, fresh produce, snack food, personal care, and other industries. The Rigid Packaging segment provides rigid containers for various beverage and food products, including carbonated soft drinks, water, juices, sports drinks, milk-based beverages, spirits and beer, sauces, dressings, spreads, and personal care items; and plastic caps for various applications. It sells its products through its direct sales force. The company was incorporated in 1926 and is headquartered in Zurich, Switzerland.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Juniper Networks, Inc.","Symbol":"JNPR","Current Price":"36.06","Latest MA":"37.73","Price Target":39.7,"Difference from MA":"-4.41%","Difference from Open":"1.02%","Change from Yesterday":"2.53%","Change from Last Report":"0.17","Latest Volume":"1,603,493","Market Cap":"11,940,723,712","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":18.060223,"PB Ratio":2.5703797,"ROE":0.055760004,"DTE":39.109,"Industry":"Communication Equipment","Sector":"Technology","Beta":0.921,"Trailing PEG":null,"Trailing PE":47.453945,"Trailing PS":2.3718736,"Quick Ratio":1.069,"Day High":36.47,"Day Low":35.31,"VS Average Volume":0.3958132721,"Company Summary":"Juniper Networks, Inc. designs, develops, and sells network products and services worldwide. The company offers routing products, such as ACX series universal access routers to deploy high-bandwidth services; MX series Ethernet routers that function as a universal edge platform; PTX series packet transport routers; wide-area network SDN controllers; and session smart routers. It also provides switching products, including EX series Ethernet switches to address the access, aggregation, and core layer switching requirements of micro branch, branch office, and campus environments; QFX series of core, spine, and top-of-rack data center switches; and juniper access points, which provide Wi-Fi access and performance. In addition, the company offers security products comprising SRX series services gateways for the data center; Branch SRX family provides an integrated and next-generation firewall; virtual firewall that delivers various features of physical firewalls; and advanced malware protection, a cloud-based service and Juniper ATP. Further, it offers Junos OS, a network operating system; Contrail networking, which provides an open-source and standards-based platform for SDN; Mist AI-driven Wired, Wireless, and WAN assurance solutions to set and measure key metrics; Mist AI-driven Marvis Virtual Network Assistant, which identifies the root cause of issues; Juniper Paragon Automation, a modular portfolio of cloud-native software applications; and Juniper Apstra to automate the network lifecycle in a single system. Additionally, the company provides software-as-a-service, technical support, maintenance, and professional services, as well as education and training programs. It sells its products through direct sales, distributors, value-added resellers, and original equipment manufacturers to end-users in the cloud, service provider, and enterprise markets. The company was incorporated in 1996 and is headquartered in Sunnyvale, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Snap Inc.","Symbol":"SNAP","Current Price":"11.24","Latest MA":"11.46","Price Target":13.17057,"Difference from MA":"-1.88%","Difference from Open":"-3.39%","Change from Yesterday":"-3.48%","Change from Last Report":"0.04","Latest Volume":"6,579,962","Market Cap":"18,860,226,560","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":27.52013,"PB Ratio":8.506051,"ROE":-0.4062,"DTE":191.874,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":0.995,"Trailing PEG":496.0591,"Trailing PE":"N\/A","Trailing PS":3.6512601,"Quick Ratio":3.861,"Day High":11.66,"Day Low":11.22,"VS Average Volume":0.2233972639,"Company Summary":"Snap Inc. operates as a technology company in North America, Europe, and internationally. The company offers Snapchat, a visual messaging application with various tabs, such as camera, visual messaging, snap map, stories, and spotlight that enable people to communicate visually through short videos and images. It also provides Spectacles, an eyewear product that connects with Snapchat and captures photos and video from a human perspective; and advertising products, including AR ads and Snap ads comprises a single image or video ads, collection ads, dynamic ads, story ads, and commercials. The company was formerly known as Snapchat, Inc. and changed its name to Snap Inc. in September 2016. Snap Inc. was founded in 2010 and is headquartered in Santa Monica, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Chipotle Mexican Grill, Inc.","Symbol":"CMG","Current Price":"58.95","Latest MA":"57.91","Price Target":66.30719,"Difference from MA":"1.78%","Difference from Open":"0.55%","Change from Yesterday":"1.12%","Change from Last Report":"-0.05","Latest Volume":"1,811,412","Market Cap":"80,317,865,984","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":44.547985,"PB Ratio":22.243395,"ROE":0.45673,"DTE":124.061,"Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":1.266,"Trailing PEG":2.0257,"Trailing PE":54.5787,"Trailing PS":7.311686,"Quick Ratio":1.486,"Day High":59.57,"Day Low":58.5792,"VS Average Volume":0.2002337703,"Company Summary":"Chipotle Mexican Grill, Inc., together with its subsidiaries, owns and operates Chipotle Mexican Grill restaurants. It sells food and beverages through offering burritos, burrito bowls, quesadillas, tacos, and salads. The company also provides delivery and related services its app and website. It has operations in the United States, Canada, France, Germany, Dubai, and the United Kingdom. Chipotle Mexican Grill, Inc. was founded in 1993 and is headquartered in Newport Beach, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Western Union Company (The)","Symbol":"WU","Current Price":"10.44","Latest MA":"11.13","Price Target":12.46667,"Difference from MA":"-6.22%","Difference from Open":"0.77%","Change from Yesterday":"1.02%","Change from Last Report":"0.05","Latest Volume":"2,445,483","Market Cap":"3,526,642,176","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":5.7743363,"PB Ratio":5.4037266,"ROE":1.06689,"DTE":396.308,"Industry":"Credit Services","Sector":"Financial Services","Beta":0.888,"Trailing PEG":2.1003,"Trailing PE":5.3265305,"Trailing PS":0.8389177,"Quick Ratio":0.221,"Day High":10.48,"Day Low":10.345,"VS Average Volume":0.5330758944,"Company Summary":"The Western Union Company provides money movement and payment services worldwide. The company operates through Consumer Money Transfer and Consumer Services segments. The Consumer Money Transfer segment facilitates money transfers for international cross-border and intra-country transfers, primarily through a network of retail agent locations, as well as through websites and mobile devices. The Consumer Services segments offers bill payment services, which facilitate payments for consumers, businesses, and other organizations, as well as money order services, retail foreign exchange services, prepaid cards, lending partnerships, and digital wallets. The company was founded in 1851 and is headquartered in Denver, Colorado.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Merck & Company, Inc.","Symbol":"MRK","Current Price":"98.44","Latest MA":"108.73","Price Target":123.96542,"Difference from MA":"-9.46%","Difference from Open":"-0.98%","Change from Yesterday":"0.17%","Change from Last Report":"-0.21","Latest Volume":"1,948,934","Market Cap":"249,017,761,792","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":10.583752,"PB Ratio":5.6008196,"ROE":0.28332,"DTE":85.572,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.411,"Trailing PEG":0.0693,"Trailing PE":20.594141,"Trailing PS":3.941776,"Quick Ratio":0.917,"Day High":99.41,"Day Low":98.33,"VS Average Volume":0.1668544163,"Company Summary":"Merck & Co., Inc. operates as a healthcare company worldwide. It operates through two segments, Pharmaceutical and Animal Health. The Pharmaceutical segment offers human health pharmaceutical products in the areas of oncology, hospital acute care, immunology, neuroscience, virology, cardiovascular, and diabetes under the Keytruda, Bridion, Adempas, Lagevrio, Belsomra, Simponi, and Januvia brands, as well as vaccine products consisting of preventive pediatric, adolescent, and adult vaccines under the Gardasil\/Gardasil 9, ProQuad, M-M-R II, Varivax, RotaTeq, Live Oral, Vaxneuvance, Pneumovax 23, and Vaqta names. The Animal Health segment discovers, develops, manufactures, and markets veterinary pharmaceuticals, vaccines, and health management solutions and services, as well as digitally connected identification, traceability, and monitoring products. vIt has development and commercialization agreement for three of Daiichi Sankyo's deruxtecan ADC candidates, which include patritumab deruxtecan, ifinatamab deruxtecan, and raludotatug deruxtecan for the treatment of multiple solid tumors both as monotherapy and\/or in combination with other treatments; and AstraZeneca PLC to co-development and co-commercialize AstraZeneca's Lynparza products for multiple cancer types, and Koselugo for multiple indications. It also has licensed to develop, manufacture and  commercialize LM-299, a novel investigational PD-1\/VEGF bispecific antibody from LaNova. The company also has a collaboration agreement with Eisai Co., Ltd., Bayer AG, and Ridgeback Biotherapeutics LP, as well Moderna, Inc. Merck & Co., Inc. was founded in 1891 and is headquartered in Rahway, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Mondelez International, Inc.","Symbol":"MDLZ","Current Price":"57.82","Latest MA":"66.16","Price Target":72.4844,"Difference from MA":"-12.61%","Difference from Open":"0.56%","Change from Yesterday":"1.30%","Change from Last Report":"-0.02","Latest Volume":"1,869,670","Market Cap":"77,316,325,376","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":17.650434,"PB Ratio":2.775804,"ROE":0.13552,"DTE":73.232,"Industry":"Confectioners","Sector":"Consumer Defensive","Beta":0.561,"Trailing PEG":4.7878,"Trailing PE":20.503546,"Trailing PS":2.138705,"Quick Ratio":0.295,"Day High":57.85,"Day Low":57.24,"VS Average Volume":0.2029862044,"Company Summary":"Mondelez International, Inc., through its subsidiaries, manufactures, markets, and sells snack food and beverage products in the Latin America, North America, Asia, the Middle East, Africa, and Europe. It provides biscuits and baked snacks, including cookies, crackers, salted snacks, snack bars, and cakes and pastries; chocolates; and gums and candies, as well as various cheese and grocery, and powdered beverage products. The company's brand portfolio includes Oreo, Ritz, LU, CLIF Bar, and Tate's Bake Shop biscuits and baked snacks, as well as Cadbury Dairy Milk, Milka, and Toblerone chocolate. It serves supermarket chains, wholesalers, supercenters, club stores, mass merchandisers, distributors, convenience stores, gasoline stations, drug stores, value stores, and other retail food outlets through direct store delivery, company-owned and satellite warehouses, distribution centers, third party distributors, and other facilities, as well as through independent sales offices and agents. The company also sells products directly to businesses and consumers through e-retail platforms, retailer digital platforms, as well as through its direct-to-consumer websites and social media platforms. Mondelez International, Inc. was formerly known as Kraft Foods Inc. and changed its name to Mondelez International, Inc. in October 2012. The company was incorporated in 2000 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"CNH Industrial N.V.","Symbol":"CNH","Current Price":"13.11","Latest MA":"10.94","Price Target":14.19474,"Difference from MA":"19.81%","Difference from Open":"-0.34%","Change from Yesterday":"0.15%","Change from Last Report":"0.31","Latest Volume":"4,668,001","Market Cap":"16,367,882,240","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":15.273892,"PB Ratio":2.1416898,"ROE":0.22186,"DTE":356.262,"Industry":"Farm & Heavy Construction Machinery","Sector":"Industrials","Beta":1.597,"Trailing PEG":null,"Trailing PE":9.636029,"Trailing PS":0.7524771,"Quick Ratio":3.87,"Day High":13.17,"Day Low":12.91,"VS Average Volume":0.3881022734,"Company Summary":"CNH Industrial N.V., an equipment and services company, engages in the design, production, marketing, sale, and financing of agricultural and construction equipment in North America, Europe, the Middle East, Africa, South America, and the Asia Pacific. The company operates through three segments: Agriculture, Construction, and Financial Services. The Agriculture segment designs, manufactures, and distributes farm machinery and implements, including two-wheel and four-wheel drive tractors, crawler tractors, combines, grape and sugar cane harvesters, hay and forage equipment, planting and seeding equipment, soil preparation and cultivation implements, material handling equipment, and precision agriculture technology. This segment sells its agricultural equipment under the New Holland Agriculture and Case IH brands. The Construction segment designs, manufactures, and distributes construction equipment comprising excavators, crawler dozers, graders, wheel loaders, backhoe loaders, skid steer loaders, and compact track loaders under the CASE Construction Equipment, New Holland Construction, and Eurocomach brands. The Financial Services segment offers financing to end-use customers for the purchase of new and used agricultural and construction equipment and components, as well as revolving charge account financing and other financial services. It also provides wholesale financing to CNH Industrial brand dealers and distributors; trade receivables factoring services to CNH companies; and financial services to Iveco Group companies in the North America, South America, and Asia Pacific regions. The company was founded in 1842 and is headquartered in Basildon, the United Kingdom.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:12:09"},{"Company Name":"Palantir Technologies Inc.","Symbol":"PLTR","Current Price":"79.92","Latest MA":"47.78","Price Target":50.36316,"Difference from MA":"67.28%","Difference from Open":"0.02%","Change from Yesterday":"0.27%","Change from Last Report":"0.07","Latest Volume":"20,279,457","Market Cap":"182,054,584,320","Earning Date":"2025-02-03","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":165.99074,"PB Ratio":40.321846,"ROE":0.12409,"DTE":5.552,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":2.697,"Trailing PEG":3.4191,"Trailing PE":399.5895,"Trailing PS":68.79491,"Quick Ratio":5.546,"Day High":81.66,"Day Low":79.39,"VS Average Volume":0.2436117329,"Company Summary":"Palantir Technologies Inc. builds and deploys software platforms for the intelligence community to assist in counterterrorism investigations and operations in the United States, the United Kingdom, and internationally. The company provides Palantir Gotham, a software platform which enables users to identify patterns hidden deep within datasets, ranging from signals intelligence sources to reports from confidential informants, as well as facilitates the handoff between analysts and operational users, helping operators plan and execute real-world responses to threats that have been identified within the platform. It also offers Palantir Foundry, a platform that transforms the ways organizations operate by creating a central operating system for their data; and allows individual users to integrate and analyze the data they need in one place. In addition, it provides Palantir Apollo, a software that delivers software and updates across the business, as well as enables customers to deploy their software virtually in any environment; and Palantir Artificial Intelligence Platform (AIP) that provides unified access to open-source, self-hosted, and commercial large language models (LLM) that can transform structured and unstructured data into LLM-understandable objects and can turn organizations' actions and processes into tools for humans and LLM-driven agents. The company was incorporated in 2003 and is headquartered in Denver, Colorado.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"30-01-2025 18:12:09"}]