[{"Company Name":"Tyson Foods, Inc.","Symbol":"TSN","Current Price":"57.31","Latest MA":"59.61","Price Target":66.42667,"Difference from MA":"-3.86%","Difference from Open":"-0.19%","Change from Yesterday":"1.43%","Change from Last Report":"0.00","Latest Volume":"2,372,081","Market Cap":"20,412,274,688","Earning Date":"2025-02-03","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":13.640918,"PB Ratio":1.1088967,"Previous Close":56.49,"ROE":0.044710003,"DTE":52.863,"Industry":"Farm Products","Sector":"Consumer Defensive","Beta":0.775,"Trailing PEG":0.5014,"Trailing PE":25.471111,"Trailing PS":0.38290483,"Quick Ratio":0.861,"Day High":58.61,"Day Low":56.17,"VS Average Volume":0.9879986422,"Company Summary":"Tyson Foods, Inc., together with its subsidiaries, operates as a food company worldwide. It operates through four segments: Beef, Pork, Chicken, and Prepared Foods. The company processes live fed cattle and hogs; fabricates dressed beef and pork carcasses into primal and sub-primal meat cuts, as well as case ready beef and pork, and fully cooked meats; raises and processes chickens into fresh, frozen, and value-added chicken products, including breaded chicken strips, nuggets, patties, and other ready-to-fix or fully cooked chicken parts; and supplies poultry breeding stock. It also manufactures and markets frozen and refrigerated food products, including ready-to-eat sandwiches, flame-grilled hamburgers, Philly steaks, pepperoni, bacon, breakfast sausage, turkey, lunchmeat, hot dogs, flour and corn tortilla products, appetizers, snacks, prepared meals, ethnic foods, side dishes, meat dishes, breadsticks, and processed meats under the Tyson, Jimmy Dean, Hillshire Farm, Ball Park, Wright, Aidells, Gallo Salame, ibp, and State Fair brands. The company sells its products through its sales staff to grocery retailers, grocery wholesalers, meat distributors, warehouse club stores, military commissaries, industrial food processing companies, chain restaurants or their distributors, live markets, international export companies, and domestic distributors who serve restaurants and food service operations, such as plant and school cafeterias, convenience stores, hospitals, and other vendors, as well as through independent brokers and trading companies. The company was founded in 1935 and is headquartered in Springdale, Arkansas.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"Palantir Technologies Inc.","Symbol":"PLTR","Current Price":"82.81","Latest MA":"48.56","Price Target":53.41579,"Difference from MA":"70.54%","Difference from Open":"3.36%","Change from Yesterday":"0.30%","Change from Last Report":"0.24","Latest Volume":"50,636,706","Market Cap":"188,642,836,480","Earning Date":"2025-02-03","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":169.43915,"PB Ratio":41.78103,"Previous Close":82.49,"ROE":0.12409,"DTE":5.552,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":2.697,"Trailing PEG":3.2996,"Trailing PE":414.05,"Trailing PS":71.284485,"Quick Ratio":5.546,"Day High":83.23,"Day Low":78.47,"VS Average Volume":0.6034163308,"Company Summary":"Palantir Technologies Inc. builds and deploys software platforms for the intelligence community to assist in counterterrorism investigations and operations in the United States, the United Kingdom, and internationally. The company provides Palantir Gotham, a software platform which enables users to identify patterns hidden deep within datasets, ranging from signals intelligence sources to reports from confidential informants, as well as facilitates the handoff between analysts and operational users, helping operators plan and execute real-world responses to threats that have been identified within the platform. It also offers Palantir Foundry, a platform that transforms the ways organizations operate by creating a central operating system for their data; and allows individual users to integrate and analyze the data they need in one place. In addition, it provides Palantir Apollo, a software that delivers software and updates across the business, as well as enables customers to deploy their software virtually in any environment; and Palantir Artificial Intelligence Platform (AIP) that provides unified access to open-source, self-hosted, and commercial large language models (LLM) that can transform structured and unstructured data into LLM-understandable objects and can turn organizations' actions and processes into tools for humans and LLM-driven agents. The company was incorporated in 2003 and is headquartered in Denver, Colorado.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"Franklin Resources, Inc.","Symbol":"BEN","Current Price":"20.98","Latest MA":"20.71","Price Target":21.41071,"Difference from MA":"1.26%","Difference from Open":"-4.66%","Change from Yesterday":"-5.71%","Change from Last Report":"-1.01","Latest Volume":"4,623,515","Market Cap":"11,020,223,488","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.531452,"PB Ratio":0.8780192,"Previous Close":22.24,"ROE":0.04321,"DTE":25.715,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.402,"Trailing PEG":1.5589,"Trailing PE":32.773438,"Trailing PS":1.2998612,"Quick Ratio":1.307,"Day High":22.1075,"Day Low":20.93,"VS Average Volume":1.0933242056,"Company Summary":"Franklin Resources, Inc. is a publicly owned asset management holding company. Through its subsidiaries, the firm provides its services to individuals, institutions, pension plans, trusts, and partnerships. It launches equity, fixed income, balanced, and multi-asset mutual funds through its subsidiaries. The firm invests in the public equity, fixed income, and alternative markets. Franklin Resources, Inc. was founded in 1947 and is based in San Mateo, California with an additional office in Calgary, Canada; Dubai, United Arab Emirates; Edinburgh, United Kingdom; Fort Lauderdale, United States; Hyderabad, India; London, United Kingdom; Rancho Cordova, United states; Shanghai, China; Singapore; Stamford, United States; and Vienna, Austria.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"Exxon Mobil Corporation","Symbol":"XOM","Current Price":"106.14","Latest MA":"114.38","Price Target":129.63231,"Difference from MA":"-7.20%","Difference from Open":"-0.47%","Change from Yesterday":"-0.65%","Change from Last Report":"-0.87","Latest Volume":"7,055,031","Market Cap":"462,027,423,744","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":12.014616,"PB Ratio":1.7368112,"Previous Close":106.83,"ROE":0.14513999,"DTE":15.394,"Industry":"Oil & Gas Integrated","Sector":"Energy","Beta":0.88,"Trailing PEG":4.0957,"Trailing PE":13.538265,"Trailing PS":1.3438139,"Quick Ratio":0.978,"Day High":107.3,"Day Low":105.3225,"VS Average Volume":0.4540132893,"Company Summary":"Exxon Mobil Corporation engages in the exploration and production of crude oil and natural gas in the United States and internationally. It operates through Upstream, Energy Products, Chemical Products, and Specialty Products segments. The Upstream segment explores for and produces crude oil and natural gas. The Energy Products segment offers fuels, aromatics, and catalysts, as well as licensing services. It sells its products under the Exxon, Esso, and Mobil brands. The Chemical Products segment manufactures and markets petrochemicals including olefins, polyolefins, and intermediates. The Specialty Products segment offers performance products, including lubricants, basestocks, waxes, synthetics, elastomers, and resins. The company also involves in the manufacturing, trade, transport, and sale of crude oil, natural gas, petroleum products, petrochemicals, and other specialty products; and pursuit lower-emission business opportunities, including carbon capture and storage, hydrogen, lower-emission fuels, and lithium. Exxon Mobil Corporation was founded in 1870 and is based in Spring, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"Chevron Corporation","Symbol":"CVX","Current Price":"149.32","Latest MA":"150.04","Price Target":176.75652,"Difference from MA":"-0.48%","Difference from Open":"0.22%","Change from Yesterday":"0.09%","Change from Last Report":"-0.81","Latest Volume":"4,086,525","Market Cap":"262,057,476,096","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":11.78096,"PB Ratio":1.717927,"Previous Close":149.19,"ROE":0.103520006,"DTE":16.456,"Industry":"Oil & Gas Integrated","Sector":"Energy","Beta":1.078,"Trailing PEG":3.0857,"Trailing PE":15.346403,"Trailing PS":1.3670971,"Quick Ratio":0.675,"Day High":150.86,"Day Low":147.8,"VS Average Volume":0.4884060301,"Company Summary":"Chevron Corporation, through its subsidiaries, engages in the integrated energy and chemicals operations in the United States and internationally. The company operates in two segments, Upstream and Downstream. The Upstream segment is involved in the exploration, development, production, and transportation of crude oil and natural gas; processing, liquefaction, transportation, and regasification of liquefied natural gas; transportation of crude oil through pipelines; transportation, storage, and marketing of natural gas; and carbon capture and storage, as well as a gas-to-liquids plant. The Downstream segment refines crude oil into petroleum products; markets crude oil, refined products, and lubricants; manufactures and markets renewable fuels, commodity petrochemicals, plastics for industrial uses, and fuel and lubricant additives; and transports crude oil and refined products by pipeline, marine vessel, motor equipment, and rail car. The company was formerly known as ChevronTexaco Corporation and changed its name to Chevron Corporation in 2005. Chevron Corporation was founded in 1879 and is headquartered in San Ramon, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"Colgate-Palmolive Company","Symbol":"CL","Current Price":"86.62","Latest MA":"96.40","Price Target":97.86864,"Difference from MA":"-10.14%","Difference from Open":"-0.51%","Change from Yesterday":"-0.09%","Change from Last Report":"0.45","Latest Volume":"3,190,569","Market Cap":"70,773,579,776","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":21.516981,"PB Ratio":162.82895,"Previous Close":86.7,"ROE":4.87923,"DTE":1009.091,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":0.415,"Trailing PEG":1.9582,"Trailing PE":24.679487,"Trailing PS":3.5200229,"Quick Ratio":0.576,"Day High":87.12,"Day Low":85.7,"VS Average Volume":0.6720916629,"Company Summary":"Colgate-Palmolive Company, together with its subsidiaries, manufactures and sells consumer products in the United States and internationally. It operates through two segments: Oral, Personal and Home Care; and Pet Nutrition. The Oral, Personal and Home Care segment offers toothpaste, toothbrushes, mouthwash, bar and liquid hand soaps, shower gels, shampoos, conditioners, deodorants and antiperspirants, skin health products, dishwashing detergents, fabric conditioners, household cleaners, and other related items. This segment markets and sells its products under various brands, which include Colgate, Darlie, elmex, hello, meridol, Sorriso, Tom's of Maine, Irish Spring, Palmolive, Protex, Sanex, Softsoap, Lady Speed Stick, Speed Stick, EltaMD, Filorga, PCA SKIN, Ajax, Axion, Fabuloso, Murphy, Suavitel, and Soupline to a range of traditional and eCommerce retailers, wholesalers, and distributors. It includes pharmaceutical products for dentists and other oral health professionals. Its Pet Nutrition segment offers pet nutrition products for everyday nutritional needs under the Hill's Science Diet brand; and a range of therapeutic pet products to help nutritionally support dogs and cats in different stages of health under the Hill's Prescription Diet brand. This segment markets and sells its products through pet supply retailers, veterinarians, and eCommerce retailers. Colgate-Palmolive Company was founded in 1806 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"Mobileye Global Inc.","Symbol":"MBLY","Current Price":"15.94","Latest MA":"16.79","Price Target":19.97357,"Difference from MA":"-5.07%","Difference from Open":"1.21%","Change from Yesterday":"-3.51%","Change from Last Report":"-1.18","Latest Volume":"3,446,572","Market Cap":"12,928,104,448","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":31.6823,"PB Ratio":1.0703733,"Previous Close":16.525,"ROE":-0.21936001,"DTE":0.439,"Industry":"Auto Parts","Sector":"Consumer Cyclical","Beta":0.059,"Trailing PEG":0.6885,"Trailing PE":"N\/A","Trailing PS":7.1782928,"Quick Ratio":4.215,"Day High":16.4,"Day Low":15.55,"VS Average Volume":0.4759521779,"Company Summary":"Mobileye Global Inc. develops and deploys advanced driver assistance systems (ADAS) and autonomous driving technologies and solutions worldwide. The company operates through Mobileye and Other segments. It offers Driver Assist comprising ADAS and autonomous vehicle solutions that covers safety features, such as real-time detection of road users, geometry, semantics, and markings to provide safety alerts and emergency interventions; Cloud-Enhanced Driver Assist, a solution for drivers with interpretations of a scene in real-time; Mobileye SuperVision Lite, a navigation and assisted driving solution; and Mobileye SuperVision, an operational point-to-point assisted driving navigation solution on various road types and includes cloud-based enhancements, such as road experience management. The company also provides Mobileye Chauffeur, a first-generation solution for eyes-off\/hands-off driving with a human driver still in the driver's seat; Mobileye Drive, a self-driving system comprising of radar and lidar subsystems, as well as collision avoidance systems, including Mobileye 8 Connect for light and medium-duty vehicles, and Mobileye Shield+ for large vehicles. It serves original equipment manufacturers. The company was founded in 1999 and is headquartered in Jerusalem, Israel. Mobileye Global Inc. operates as a subsidiary of Intel Overseas Funding Corporation.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"Deckers Outdoor Corporation","Symbol":"DECK","Current Price":"170.83","Latest MA":"172.33","Price Target":218.64761,"Difference from MA":"-0.87%","Difference from Open":"-2.10%","Change from Yesterday":"-3.68%","Change from Last Report":"-0.26","Latest Volume":"3,701,229","Market Cap":"25,952,681,984","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":25.919115,"PB Ratio":12.447464,"Previous Close":177.36,"ROE":0.4357,"DTE":11.633,"Industry":"Footwear & Accessories","Sector":"Consumer Cyclical","Beta":1.053,"Trailing PEG":2.0971,"Trailing PE":27.777071,"Trailing PS":5.573153,"Quick Ratio":2.052,"Day High":177.52,"Day Low":170.1,"VS Average Volume":1.8773784066,"Company Summary":"Deckers Outdoor Corporation, together with its subsidiaries, designs, markets, and distributes footwear, apparel, and accessories for casual lifestyle use and high-performance activities in the United States and internationally. The company offers premium footwear, apparel, and accessories under the UGG brand name; footwear, apparel, and accessories for ultra-runners and athletes under the HOKA brand name; and sandals, shoes, and boots under the Teva brand name. It also provides relaxed casual shoes and sandals under the Sanuk brand name; casual footwear fashion line under the Koolaburra brand name; and footwear under the AHNU brand name. The company sells its products through domestic and international retailers; international distributors; and directly to its consumers through its direct-to-consumer business, which includes e-commerce websites and retail stores. Deckers Outdoor Corporation was founded in 1973 and is headquartered in Goleta, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"International Paper Company","Symbol":"IP","Current Price":"55.10","Latest MA":"50.56","Price Target":56.36,"Difference from MA":"8.98%","Difference from Open":"0.97%","Change from Yesterday":"-0.97%","Change from Last Report":"-1.43","Latest Volume":"3,753,676","Market Cap":"19,142,180,864","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":14.165944,"PB Ratio":2.2182856,"Previous Close":55.63,"ROE":0.04797,"DTE":69.707,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":0.988,"Trailing PEG":0.4928,"Trailing PE":35.09554,"Trailing PS":1.0269411,"Quick Ratio":1.021,"Day High":55.94,"Day Low":54.47,"VS Average Volume":0.7537285576,"Company Summary":"International Paper Company produces and sells renewable fiber-based packaging and pulp products in North America, Latin America, Europe, and North Africa. It operates through two segments, Industrial Packaging and Global Cellulose Fibers. The company offers linerboard, medium, whitetop, recycled linerboard, recycled medium and saturating kraft; and pulp for a range of applications, such as diapers, towel and tissue products, feminine care, incontinence, and other personal care products, as well as specialty pulps for use in textiles, construction materials, paints, coatings, and others. It sells its products directly to end users and converters, as well as through agents, resellers, and distributors. The company was founded in 1898 and is headquartered in Memphis, Tennessee.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"AbbVie Inc.","Symbol":"ABBV","Current Price":"189.55","Latest MA":"181.48","Price Target":204.58385,"Difference from MA":"4.44%","Difference from Open":"3.48%","Change from Yesterday":"3.04%","Change from Last Report":"0.50","Latest Volume":"4,410,900","Market Cap":"334,961,377,280","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":13.701531,"PB Ratio":55.53765,"Previous Close":183.9,"ROE":0.56407,"DTE":1174.815,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.613,"Trailing PEG":0.4344,"Trailing PE":79.30962,"Trailing PS":6.031754,"Quick Ratio":0.436,"Day High":190.86,"Day Low":182.15,"VS Average Volume":0.6678704051,"Company Summary":"AbbVie Inc. discovers, develops, manufactures, and sells pharmaceuticals worldwide. The company offers Humira, an injection for autoimmune and intestinal Behçet's diseases, and pyoderma gangrenosum; Skyrizi to treat moderate to severe plaque psoriasis, psoriatic disease, and Crohn's disease; Rinvoq to treat rheumatoid and psoriatic arthritis, ankylosing spondylitis, atopic dermatitis, axial spondyloarthropathy, ulcerative colitis, and Crohn's disease; Imbruvica for the treatment of adult patients with blood cancers; Epkinly to treat lymphoma; Elahere to treat cancer; and Venclexta\/Venclyxto to treat blood cancers. It also provides facial injectables, plastics and regenerative medicine, body contouring, and skincare products; botox therapeutic; Vraylar for depressive disorder; Duopa and Duodopa to treat advanced Parkinson's disease; Ubrelvy for the acute treatment of migraine in adults; and Qulipta for episodic and chronic migraine. In addition, the company offers Ozurdex for eye diseases; Lumigan\/Ganfort and Alphagan\/Combigan for the reduction of elevated intraocular pressure in patients with open angle glaucoma or ocular hypertension; Restasis to increase tear production; and other eye care products. Further, it provides Mavyret\/Maviret to treat chronic hepatitis C virus genotype 1-6 infection; Creon, a pancreatic enzyme therapy; Lupron to treat advanced prostate cancer, endometriosis and central precocious puberty, and patients with anemia caused by uterine fibroids; Linzess\/Constella to treat irritable bowel syndrome with constipation and chronic idiopathic constipation; and Synthroid for hypothyroidism. It has collaborations with Calico Life Sciences LLC; REGENXBIO Inc.; Janssen Biotech, Inc.; Evolveimmune Therapeutics, Inc.; Genentech, Inc.; AbCellera Biologics Inc.; and Tentarix Biotherapeutics, LP. The company was incorporated in 2012 and is headquartered in North Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"Baker Hughes Company","Symbol":"BKR","Current Price":"47.14","Latest MA":"38.53","Price Target":50.33115,"Difference from MA":"22.34%","Difference from Open":"0.68%","Change from Yesterday":"2.01%","Change from Last Report":"-0.36","Latest Volume":"5,795,092","Market Cap":"46,646,059,008","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":15.872201,"PB Ratio":2.8799977,"Previous Close":46.18,"ROE":0.14292,"DTE":36.933,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.363,"Trailing PEG":1.0291,"Trailing PE":15.818725,"Trailing PS":1.7086469,"Quick Ratio":0.749,"Day High":47.585,"Day Low":46.05,"VS Average Volume":0.8544515408,"Company Summary":"Baker Hughes Company provides a portfolio of technologies and services to energy and industrial value chain worldwide. The company operates through Oilfield Services & Equipment (OFSE) and Industrial & Energy Technology (IET) segments. The OFSE segment designs and manufactures products and provides related services, including exploration, appraisal, development, production, rejuvenation, and decommissioning for onshore and offshore oilfield operations. This segment also provides drilling services, drill bits, and drilling and completions fluids; completions, intervention, measurements, pressure pumping, and wireline services; artificial lift systems, and oilfield and industrial chemicals; subsea projects and services, flexible pipe systems, and surface pressure control systems; and integrated well services and solutions. It serves oil and natural gas companies; the United States and international independent oil and natural gas companies; national or state-owned oil companies; engineering, procurement, and construction contractors; geothermal companies; and other oilfield service companies. The IET segment provides gas technology equipment, including drivers, driven equipment, flow control, and turnkey solutions for the mechanical-drive, compression, and power-generation applications; and energy sectors, such as oil and gas, LNG operations, petrochemical, and carbon solutions. This segment also provides rack-based vibration monitoring equipment and sensors; integrated asset performance management products; inspection services; pumps, valves, and gears; precision sensors and instrumentation, and condition monitoring solutions. It serves upstream, midstream, downstream, onshore, offshore, and small and large scale customers. The company was formerly known as Baker Hughes, a GE company and changed its name to Baker Hughes Company in October 2019. Baker Hughes Company was incorporated in 2016 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"Intel Corporation","Symbol":"INTC","Current Price":"19.50","Latest MA":"23.27","Price Target":22.44353,"Difference from MA":"-16.18%","Difference from Open":"2.71%","Change from Yesterday":"0.39%","Change from Last Report":"-0.48","Latest Volume":"47,666,364","Market Cap":"84,456,644,608","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":16.398886,"PB Ratio":0.84440875,"Previous Close":19.43,"ROE":-0.15597,"DTE":47.906,"Industry":"Semiconductors","Sector":"Technology","Beta":1.026,"Trailing PEG":0.5766,"Trailing PE":"N\/A","Trailing PS":1.5568906,"Quick Ratio":0.833,"Day High":19.75,"Day Low":18.78,"VS Average Volume":0.6475979998,"Company Summary":"Intel Corporation designs, develops, manufactures, markets, and sells computing and related products and services worldwide. It operates through Client Computing Group, Data Center and AI, Network and Edge, Mobileye, and Intel Foundry Services segments. The company's products portfolio comprises central processing units and chipsets, system-on-chips (SoCs), and multichip packages; mobile and desktop processors; hardware products comprising graphics processing units (GPUs), domain-specific accelerators, and field programmable gate arrays (FPGAs); and memory and storage, connectivity and networking, and other semiconductor products. It also offers silicon devices and software products; and optimization solutions for workloads, such as AI, cryptography, security, storage, networking, and leverages various features supporting diverse compute environments. In addition, the company develops and deploys advanced driver assistance systems (ADAS), and autonomous driving technologies and solutions; and provides advanced process technologies backed by an ecosystem of IP, EDA, and design services, as well as systems of chips, including advanced packaging technologies, software and accelerate bring-up, and integration of chips and driving standards. Further, it delivers and deploys intelligent edge platforms that allow developers to achieve agility and drive automation using AI for efficient operations with data integrity, as well as provides hardware and software platforms, tools, and ecosystem partnerships for digital transformation from the cloud to edge. The company serves original equipment manufacturers, original design manufacturers, cloud service providers, and other manufacturers and service providers. It has a strategic agreement with Synopsys, Inc. to develop EDA and IP solutions; and ARM that enables chip designers to build optimized compute SoCs on the Intel 18A process. Intel Corporation was incorporated in 1968 and is headquartered in Santa Clara, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"Apple Inc.","Symbol":"AAPL","Current Price":"226.84","Latest MA":"229.83","Price Target":251.78146,"Difference from MA":"-1.30%","Difference from Open":"-1.13%","Change from Yesterday":"-3.88%","Change from Last Report":"0.00","Latest Volume":"41,416,910","Market Cap":"3,407,613,263,872","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":27.442635,"PB Ratio":60.217678,"Previous Close":236.0,"ROE":1.5741299,"DTE":209.059,"Industry":"Consumer Electronics","Sector":"Technology","Beta":1.24,"Trailing PEG":2.1681,"Trailing PE":36.006348,"Trailing PS":8.714343,"Quick Ratio":0.745,"Day High":231.83,"Day Low":225.71,"VS Average Volume":0.8271095618,"Company Summary":"Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod. It also provides AppleCare support and cloud services; and operates various platforms, including the App Store that allow customers to discover and download applications and digital content, such as books, music, video, games, and podcasts, as well as advertising services include third-party licensing arrangements and its own advertising platforms. In addition, the company offers various subscription-based services, such as Apple Arcade, a game subscription service; Apple Fitness+, a personalized fitness service; Apple Music, which offers users a curated listening experience with on-demand radio stations; Apple News+, a subscription news and magazine service; Apple TV+, which offers exclusive original content; Apple Card, a co-branded credit card; and Apple Pay, a cashless payment service, as well as licenses its intellectual property. The company serves consumers, and small and mid-sized businesses; and the education, enterprise, and government markets. It distributes third-party applications for its products through the App Store. The company also sells its products through its retail and online stores, and direct sales force; and third-party cellular network carriers, wholesalers, retailers, and resellers. Apple Inc. was founded in 1976 and is headquartered in Cupertino, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"Comcast Corporation","Symbol":"CMCSA","Current Price":"33.56","Latest MA":"39.50","Price Target":43.22036,"Difference from MA":"-15.05%","Difference from Open":"1.11%","Change from Yesterday":"-0.34%","Change from Last Report":"-0.20","Latest Volume":"19,502,904","Market Cap":"128,096,919,552","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":7.0722256,"PB Ratio":1.5001653,"Previous Close":33.66,"ROE":0.16884,"DTE":117.127,"Industry":"Telecom Services","Sector":"Communication Services","Beta":1.004,"Trailing PEG":1.0444,"Trailing PE":8.105967,"Trailing PS":1.040846,"Quick Ratio":0.605,"Day High":33.78,"Day Low":33.04,"VS Average Volume":0.8904934256,"Company Summary":"Comcast Corporation operates as a media and technology company worldwide. It operates through Residential Connectivity & Platforms, Business Services Connectivity, Media, Studios, and Theme Parks segments. The Residential Connectivity & Platforms segment provides residential broadband and wireless connectivity services, residential and business video services, sky-branded entertainment television networks, and advertising. The Business Services Connectivity segment offers connectivity services for small business locations, which include broadband, wireline voice, and wireless services, as well as solutions for medium-sized customers and larger enterprises; and small business connectivity services in the United Kingdom. The Media segment operates NBCUniversal's television and streaming business, including national and regional cable networks; the NBC and Telemundo broadcast networks and owned local broadcast television stations; and Peacock, a direct-to-consumer streaming services. It also operates international television networks comprising the Sky Sports networks, as well as other digital properties. The Studios segment operates NBCUniversal and Sky film and television studio production and distribution operations. The Theme Parks segment operates Universal theme parks in Orlando, Florida; Hollywood, California; Osaka, Japan; and Beijing, China. The company also offers a consolidated streaming platforms under the Philadelphia Flyers and the Wells Fargo Center arena in Philadelphia, Pennsylvania; and Xumo. Comcast Corporation was founded in 1963 and is headquartered in Philadelphia, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"Tractor Supply Company","Symbol":"TSCO","Current Price":"54.81","Latest MA":"54.66","Price Target":58.30724,"Difference from MA":"0.28%","Difference from Open":"2.46%","Change from Yesterday":"0.83%","Change from Last Report":"0.00","Latest Volume":"2,269,986","Market Cap":"29,281,898,496","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":22.704208,"PB Ratio":2.5607305,"Previous Close":54.36,"ROE":0.5058,"DTE":233.038,"Industry":"Specialty Retail","Sector":"Consumer Cyclical","Beta":0.814,"Trailing PEG":2.5524,"Trailing PE":26.870098,"Trailing PS":1.9825869,"Quick Ratio":0.086,"Day High":55.2,"Day Low":53.39,"VS Average Volume":0.4286170689,"Company Summary":"Tractor Supply Company operates as a rural lifestyle retailer in the United States. The company offers various merchandise, including livestock and equine feed and equipment, poultry, fencing, and sprayers and chemicals; food, treats, and equipment for dogs, cats, and other small animals, as well as dog wellness products; seasonal and recreation products comprising tractors and riders, lawn and garden, bird feeding, power equipment, and other recreational products; truck, tool, and hardware products, such as truck accessories, trailers, generators, lubricants, batteries, and hardware and tools; and clothing, gift, and décor products consist of clothing, footwear, toys, snacks, and decorative merchandise. It provides its products under the 4health, Paws & Claws, American Farmworks, Producer's Pride, Bit & Bridle, Red Shed, Blue Mountain, Redstone, C.E. Schmidt, Retriever, Country Lane, Ridgecut, Countyline, Royal Wing, Country Tuff, Strive, Dumor, Traveller, Farm Table, Treeline, Groundwork, TSC Tractor Supply Co, Huskee, Untamed, and JobSmart brand names. The company operates its retail stores under the Tractor Supply Company, Petsense by Tractor Supply, and Orscheln Farm and Home names; and operates websites under the TractorSupply.com and Petsense.com names. It sells its products to recreational farmers, ranchers, and others. Tractor Supply Company was founded in 1938 and is based in Brentwood, Tennessee.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"Flagstar Financial, Inc.","Symbol":"FLG","Current Price":"11.49","Latest MA":"10.60","Price Target":12.625,"Difference from MA":"8.42%","Difference from Open":"0.83%","Change from Yesterday":"-2.83%","Change from Last Report":"-1.29","Latest Volume":"3,618,438","Market Cap":"4,769,677,824","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":17.340996,"PB Ratio":0.5916413,"Previous Close":11.83,"ROE":-0.37158,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.0,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":3.342451,"Quick Ratio":"N\/A","Day High":11.77,"Day Low":11.33,"VS Average Volume":0.5755363666,"Company Summary":"Flagstar Financial, Inc. operates as the bank holding company for Flagstar Bank, N.A. that provides banking products and services in the United States. The company's deposit products include interest-bearing checking and money market, savings, non-interest-bearing, and retirement accounts, as well as certificates of deposit. Its loan products comprise multi-family loans; commercial real estate loans; acquisition, development, and construction loans; commercial and industrial loans; one-to-four family loans; specialty finance loans and leases; warehouse loans; and other loans, such as home equity lines of credit, boat and recreational vehicle indirect lending, point of sale consumer loans, and other consumer loans, including overdraft loans. The company offers cash management products; non-deposit investment and insurance products; and online banking, mobile banking, and bank-by-phone services. It primarily serves individuals, small and mid-size businesses, and professional associations. The company was formerly known as New York Community Bancorp, Inc. and changed its name to Flagstar Financial, Inc. in October 2024. Flagstar Financial, Inc. was founded in 1859 and is headquartered in Hicksville, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"United Parcel Service, Inc.","Symbol":"UPS","Current Price":"112.04","Latest MA":"129.40","Price Target":133.38448,"Difference from MA":"-13.41%","Difference from Open":"-0.26%","Change from Yesterday":"-1.92%","Change from Last Report":"0.36","Latest Volume":"6,935,349","Market Cap":"95,611,576,320","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":12.575906,"PB Ratio":5.669467,"Previous Close":114.23,"ROE":0.31422,"DTE":155.425,"Industry":"Integrated Freight & Logistics","Sector":"Industrials","Beta":0.982,"Trailing PEG":1.467,"Trailing PE":16.598518,"Trailing PS":1.0543146,"Quick Ratio":1.027,"Day High":112.56,"Day Low":109.4,"VS Average Volume":1.3624112464,"Company Summary":"United Parcel Service, Inc., a package delivery company, provides transportation and delivery, distribution, contract logistics, ocean freight, airfreight, customs brokerage, and insurance services. It operates through two segments, U.S. Domestic Package and International Package. The U.S. Domestic Package segment offers time-definite delivery of express letters, documents, small packages, and palletized freight through air and ground services in the United States. The International Package segment provides guaranteed day and time-definite international shipping services comprising guaranteed time-definite express options in Europe, Asia, the Indian sub-continent, the Middle East, Africa, Canada, and Latin America. The company also offers international air and ocean freight forwarding, post-sales, and mail and consulting services. In addition, it provides truckload and customs brokerage services; supply chain solutions to the healthcare and life sciences industries; fulfillment and transportation management services; and integrated supply chain and shipment insurance solutions. United Parcel Service, Inc. was founded in 1907 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"Southwest Airlines Company","Symbol":"LUV","Current Price":"30.66","Latest MA":"29.97","Price Target":32.927,"Difference from MA":"2.29%","Difference from Open":"1.62%","Change from Yesterday":"-0.20%","Change from Last Report":"0.03","Latest Volume":"4,168,322","Market Cap":"18,387,937,280","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":12.630017,"PB Ratio":1.7662308,"Previous Close":30.71,"ROE":-0.00447,"DTE":87.36,"Industry":"Airlines","Sector":"Industrials","Beta":1.153,"Trailing PEG":0.461,"Trailing PE":40.342106,"Trailing PS":0.6716809,"Quick Ratio":0.783,"Day High":30.895,"Day Low":29.95,"VS Average Volume":0.5863597762,"Company Summary":"Southwest Airlines Co. operates as a passenger airline company that provides scheduled air transportation services in the United States and near-international markets. As of December 31, 2023, the company operated a total fleet of 817 Boeing 737 aircraft; and served 121 destinations in 42 states, the District of Columbia, and the Commonwealth of Puerto Rico, as well as ten near-international countries, including Mexico, Jamaica, the Bahamas, Aruba, the Dominican Republic, Costa Rica, Belize, Cuba, the Cayman Islands, and Turks and Caicos. It also provides inflight entertainment and connectivity services on Wi-Fi enabled aircraft; and Rapid Rewards loyalty program that enables program members to earn points for dollars spent on Southwest base fares. In addition, the company offers a suite of digital platforms to support customers' travel needs, including websites and apps; and SWABIZ, an online booking tool. Further, it provides ancillary services, such as Southwest's EarlyBird Check-In, upgraded boarding, and transportation of pets and unaccompanied minors. Southwest Airlines Co. was incorporated in 1967 and is headquartered in Dallas, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"Aptiv PLC","Symbol":"APTV","Current Price":"60.02","Latest MA":"65.02","Price Target":76.977,"Difference from MA":"-7.70%","Difference from Open":"5.72%","Change from Yesterday":"-3.84%","Change from Last Report":"-0.73","Latest Volume":"3,492,708","Market Cap":"14,106,860,544","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":8.650734,"PB Ratio":1.5879567,"Previous Close":62.42,"ROE":0.24212,"DTE":109.665,"Industry":"Auto Parts","Sector":"Consumer Cyclical","Beta":1.817,"Trailing PEG":0.9168,"Trailing PE":6.683742,"Trailing PS":0.7151767,"Quick Ratio":1.031,"Day High":60.78,"Day Low":56.24,"VS Average Volume":0.9009266675,"Company Summary":"Aptiv PLC engages in design, manufacture, and sale of vehicle components in North America, Europe, Middle East, Africa, the Asia Pacific, South America, and internationally. The company provides electrical, electronic, and safety technology solutions to the automotive and commercial vehicle markets. It operates through two segments, Signal and Power Solutions, and Advanced Safety and User Experience. The Signal and Power Solutions segment designs, manufactures, and assembles vehicle's electrical architecture, including engineered component products, connectors, wiring assemblies and harnesses, cable management products, electrical centers, and hybrid high voltage and safety distribution systems. Its Advanced Safety and User Experience segment provides critical technologies and services for vehicle safety, security, comfort, and convenience, such as sensing and perception systems, electronic control units, multi-domain controllers, vehicle connectivity systems, application software, autonomous driving technologies, and end-to-end DevOps tools. Aptiv PLC was incorporated in 2011 and is based in Schaffhausen, Switzerland.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"Altria Group, Inc.","Symbol":"MO","Current Price":"52.65","Latest MA":"50.69","Price Target":56.20308,"Difference from MA":"3.87%","Difference from Open":"1.24%","Change from Yesterday":"0.76%","Change from Last Report":"-0.41","Latest Volume":"3,887,509","Market Cap":"89,007,144,960","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":9.51803,"PB Ratio":"N\/A","Previous Close":52.23,"ROE":"N\/A","DTE":"N\/A","Industry":"Tobacco","Sector":"Consumer Defensive","Beta":0.67,"Trailing PEG":3.6533,"Trailing PE":8.049954,"Trailing PS":4.3712378,"Quick Ratio":0.274,"Day High":52.93,"Day Low":51.855,"VS Average Volume":0.5003257419,"Company Summary":"Altria Group, Inc., through its subsidiaries, manufactures and sells smokeable and oral tobacco products in the United States. The company offers cigarettes primarily under the Marlboro brand; large cigars and pipe tobacco under the Black & Mild brand; moist smokeless tobacco and snus products under the Copenhagen, Skoal, Red Seal, and Husky brands; oral nicotine pouches under the on! brand; and e-vapor products under the NJOY ACE brand. It sells its products to distributors, as well as large retail organizations, such as chain stores. The company was founded in 1822 and is headquartered in Richmond, Virginia.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"Dow Inc.","Symbol":"DOW","Current Price":"37.23","Latest MA":"47.62","Price Target":46.44444,"Difference from MA":"-21.83%","Difference from Open":"-2.55%","Change from Yesterday":"-4.69%","Change from Last Report":"-1.94","Latest Volume":"7,065,772","Market Cap":"26,191,992,832","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":13.563094,"PB Ratio":1.4232459,"Previous Close":39.05,"ROE":0.05863,"DTE":95.059,"Industry":"Chemicals","Sector":"Basic Materials","Beta":1.222,"Trailing PEG":0.5802,"Trailing PE":23.71019,"Trailing PS":0.606577,"Quick Ratio":0.8,"Day High":38.3,"Day Low":36.66,"VS Average Volume":0.8833921051,"Company Summary":"Dow Inc., through its subsidiaries, engages in the provision of various materials science solutions for packaging, infrastructure, mobility, and consumer applications in the United States, Canada, Europe, the Middle East, Africa, India, the Asia Pacific, and Latin America. The company operates through Packaging & Specialty Plastics, Industrial Intermediates & Infrastructure, and Performance Materials & Coatings segments. The Packaging & Specialty Plastics segment provides ethylene, and propylene and aromatics products; and polyethylene, polyolefin elastomers, ethylene vinyl acetate, and ethylene propylene diene monomer rubbers for mobility and transportation, consumer, wire and cable, and construction end-markets. The Industrial Intermediates & Infrastructure segment offers purified ethylene, ethylene and ethanol amines, propylene glycol and polyether polyols, aromatic isocyanates and coatings, adhesives, sealants, elastomers, and composites. This segment also provides caustic soda, and ethylene dichloride and vinyl chloride monomers; and cellulose ethers, redispersible latex powders, and acrylic emulsions. The Performance Materials and Coatings segment provides architectural paints and coatings, and industrial coatings that are used in maintenance and protective industries, wood, metal packaging, traffic markings, thermal paper, and leather; and silicon metal, siloxanes, and intermediates used as key materials in manufacturing differentiated downstream silicone products. It also engages in property and casualty insurance, as well as reinsurance business. Dow Inc. was incorporated in 2018 and is headquartered in Midland, Michigan.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"Atlassian Corporation","Symbol":"TEAM","Current Price":"312.19","Latest MA":"205.52","Price Target":345.29858,"Difference from MA":"51.90%","Difference from Open":"4.68%","Change from Yesterday":"1.76%","Change from Last Report":"0.00","Latest Volume":"2,032,549","Market Cap":"81,792,466,944","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":72.555435,"PB Ratio":78.75504,"Previous Close":306.78,"ROE":-0.43517,"DTE":121.008,"Industry":"Software - Application","Sector":"Technology","Beta":0.711,"Trailing PEG":4.6063,"Trailing PE":"N\/A","Trailing PS":17.903145,"Quick Ratio":1.109,"Day High":315.67,"Day Low":296.05,"VS Average Volume":0.9623068864,"Company Summary":"Atlassian Corporation, through its subsidiaries, designs, develops, licenses, and maintains various software products worldwide. Its product portfolio includes Jira, a project management system that connects technical and business teams so they can better plan, organize, track, and manage their work and projects; Confluence, a connected workspace that empowers organizations to create, organize, find, and share information; Loom, an asynchronous video communication tool that helps users communicate through instantly shareable videos; and Trello that captures and adds structure to fluid and fast-forming work for individuals and teams. The company also offers Jira Service Management, an intuitive and flexible service desk product for creating and managing service experiences for various service team providers, such as IT, legal, and HR teams; and Jira Align, an Atlassian's enterprise agility solution designed to help businesses to adapt and respond dynamic business conditions with a focus on value-creation. In addition, it provides Bitbucket, an enterprise-ready Git solution that enables professional dev teams to manage, collaborate, and deploy quality code; Atlassian Access, an enterprise-wide product for enhanced security and centralized administration that works across every Atlassian cloud product; Jira Product Discovery, a prioritization and road mapping tool; and Compass, a developer portal that provides a unified real-time representation of engineering teams' output in one place. Further, the company's portfolio includes Bamboo, Crowd, Crucible, Fisheye, Opsgenie, Sourcetree, Statuspage, and Atlassian cloud apps. The company was founded in 2002 and is headquartered in Sydney, Australia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"Visa Inc.","Symbol":"V","Current Price":"343.92","Latest MA":"290.19","Price Target":365.86444,"Difference from MA":"18.52%","Difference from Open":"1.15%","Change from Yesterday":"0.62%","Change from Last Report":"0.04","Latest Volume":"3,919,945","Market Cap":"663,425,187,840","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":27.009983,"PB Ratio":21.73957,"Previous Close":341.8,"ROE":0.50708,"DTE":53.239,"Industry":"Credit Services","Sector":"Financial Services","Beta":0.952,"Trailing PEG":2.267,"Trailing PE":34.70434,"Trailing PS":18.466436,"Quick Ratio":0.837,"Day High":344.96,"Day Low":339.24,"VS Average Volume":0.6511079039,"Company Summary":"Visa Inc. operates as a payment technology company in the United States and internationally. The company operates VisaNet, a transaction processing network that enables authorization, clearing, and settlement of payment transactions. It also offers credit, debit, and prepaid card products; tap to pay, tokenization, and click to pay services; Visa Direct, a solution that facilitates the delivery of funds to eligible cards, bank accounts, and digital wallets; Visa B2B Connect, a multilateral business-to-business cross-border payments network; Visa Cross-Border Solution, a cross-border consumer payments solution; and Visa DPS that provides a range of value-added services, including fraud mitigation, dispute management, data analytics, campaign management, a suite of digital solutions, and contact center services. The company also provides acceptance solutions, which include Cybersource and Authorize.net that provides new and enhanced payment integrations with ecommerce platforms, enabling sellers and acquirers to offer tailored commerce experiences; risk and identity solutions, such as Visa Advanced Authorization, Visa Secure, Visa Consumer Authentication Service, Visa Protect Authentication Intelligence, and Visa Provisioning Intelligence; and Visa Consulting and Analytics, a payment consulting advisory services. It provides its services under the Visa, Visa Electron, Interlink, V PAY, and PLUS brands. The company serves merchants, financial institutions, and government entities. Visa Inc. was founded in 1958 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"Danaher Corporation","Symbol":"DHR","Current Price":"217.32","Latest MA":"252.25","Price Target":269.284,"Difference from MA":"-13.85%","Difference from Open":"-0.31%","Change from Yesterday":"-2.49%","Change from Last Report":"0.00","Latest Volume":"2,304,950","Market Cap":"156,274,819,072","Earning Date":"2025-01-29","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":25.05465,"PB Ratio":3.0594664,"Previous Close":222.74,"ROE":0.07586,"DTE":36.69,"Industry":"Diagnostics & Research","Sector":"Healthcare","Beta":0.881,"Trailing PEG":4.1868,"Trailing PE":41.159092,"Trailing PS":6.5822096,"Quick Ratio":0.916,"Day High":219.9,"Day Low":215.9,"VS Average Volume":0.7006936562,"Company Summary":"Danaher Corporation designs, manufactures, and markets professional, medical, industrial, and commercial products and services worldwide. The Biotechnology segments offers bioprocess technologies, consumables, and services that advance, accelerate, and integrate the development and manufacture of therapeutics; cell line and cell culture media development services; cell culture media, process liquids and buffers for manufacturing, chromatography resins, filtration technologies, aseptic fill finish; single-use hardware and consumables and services, such as the design and installation of full manufacturing suites; lab filtration, separation, and purification; lab-scale protein purification and analytical tools; reagents, membranes, and services; and healthcare filtration solutions. The Life Sciences segment provides mass spectrometers; flow cytometry, genomics, lab automation, centrifugation, liquid handling automation instruments, antibodies and reagents, and particle counting and characterization; microscopes; protein consumables; industrial filtration products; and genomic medicines, such as custom nucleic acid products, plasmid DNA, RNA, and proteins under the ABCAM, ALDEVRON, BECKMAN COULTER, IDT, LEICA MICROSYSTEMS, MOLECULAR DEVICES, PALL, PHENOMENEX and SCIEX brands. The Diagnostics segment offers chemistry, immunoassay, microbiology, and automation systems; and molecular, acute care, and pathology diagnostics products. This segment also provides clinical instruments, reagents, consumables, software, and services for hospitals, physicians' offices, reference laboratories, and other critical care settings. The company has a research  collaboration  with Stanford  University's Department  of  Bioengineering for cancer drug development. The company was formerly known as Diversified Mortgage Investors, Inc. and changed its name to Danaher Corporation in 1984. Danaher Corporation was founded in 1969 and is based in Washington, the District of Columbia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"Weyerhaeuser Company","Symbol":"WY","Current Price":"30.85","Latest MA":"30.55","Price Target":35.5,"Difference from MA":"0.97%","Difference from Open":"0.33%","Change from Yesterday":"0.75%","Change from Last Report":"-0.45","Latest Volume":"3,639,357","Market Cap":"22,392,317,952","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":28.70515,"PB Ratio":2.258584,"Previous Close":30.62,"ROE":0.052989997,"DTE":51.335,"Industry":"REIT - Specialty","Sector":"Real Estate","Beta":1.428,"Trailing PEG":10.9986,"Trailing PE":57.129627,"Trailing PS":3.1143696,"Quick Ratio":1.27,"Day High":31.48,"Day Low":30.72,"VS Average Volume":1.0603939885,"Company Summary":"Weyerhaeuser Company, one of the world's largest private owners of timberlands, began operations in 1900. We own or control approximately 11 million acres of timberlands in the U.S. and manage additional timberlands under long-term licenses in Canada. We manage these timberlands on a sustainable basis in compliance with internationally recognized forestry standards. We are also one of the largest manufacturers of wood products in North America. Our company is a real estate investment trust. In 2022, we generated $10.2 billion in net sales and employed approximately 9,200 people who serve customers worldwide. Our common stock trades on the New York Stock Exchange under the symbol WY.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"Tesla, Inc.","Symbol":"TSLA","Current Price":"379.39","Latest MA":"292.43","Price Target":324.98926,"Difference from MA":"29.74%","Difference from Open":"-1.89%","Change from Yesterday":"-6.26%","Change from Last Report":"-1.68","Latest Volume":"65,043,956","Market Cap":"1,220,302,602,240","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":97.47666,"PB Ratio":17.39824,"Previous Close":404.6,"ROE":0.20389,"DTE":18.078,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":2.295,"Trailing PEG":5.3299,"Trailing PE":187.81485,"Trailing PS":12.561015,"Quick Ratio":1.214,"Day High":389.17,"Day Low":374.39,"VS Average Volume":0.7163290773,"Company Summary":"Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners; and provision of service and repairs to its energy product customers, including under warranty, as well as various financing options to its solar customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was incorporated in 2003 and is headquartered in Austin, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"Western Digital Corporation","Symbol":"WDC","Current Price":"64.66","Latest MA":"66.47","Price Target":82.95,"Difference from MA":"-2.72%","Difference from Open":"0.98%","Change from Yesterday":"-0.73%","Change from Last Report":"-2.10","Latest Volume":"3,057,440","Market Cap":"22,490,300,416","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":9.167548,"PB Ratio":2.0501602,"Previous Close":65.13,"ROE":0.033239998,"DTE":"N\/A","Industry":"Computer Hardware","Sector":"Technology","Beta":1.394,"Trailing PEG":null,"Trailing PE":18.687862,"Trailing PS":1.5674868,"Quick Ratio":0.683,"Day High":66.28,"Day Low":63.54,"VS Average Volume":0.5359449513,"Company Summary":"Western Digital Corporation develops, manufactures, and sells data storage devices and solutions in the United States, China, Hong Kong, Europe, the Middle East, Africa, rest of Asia, and internationally. It offers client devices, including hard disk drives (HDDs) and solid state drives (SSDs) for desktop and notebook personal computers (PCs), gaming consoles, and set top boxes; and flash-based embedded storage products for mobile phones, tablets, notebook PCs, and other portable and wearable devices, as well as automotive, Internet of Things, industrial, and connected home applications. The company also provides enterprise HDDs; enterprise SSDs consisting of flash-based SSDs and software solutions for use in enterprise servers, online transactions, artificial intelligence-related workloads, data analysis, and other enterprise applications; and data storage platforms. In addition, it offers external HDD storage products in mobile and desktop form; client portable SSDs; removable cards that are used in consumer devices comprising mobile phones, tablets, imaging systems, and cameras and smart video systems; universal serial bus flash drives for use in the computing and consumer markets; and wireless drive products used in-field backup of created content, as well as wireless streaming of high-definition movies, photos, music, documents to tablets, smartphones, and PCs. The company sells its products under the Western Digital, SanDisk, and WD brands to original equipment manufacturers, distributors, dealers, resellers, and retailers. Western Digital Corporation was founded in 1970 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"QUALCOMM Incorporated","Symbol":"QCOM","Current Price":"170.46","Latest MA":"168.69","Price Target":202.6071,"Difference from MA":"1.05%","Difference from Open":"1.07%","Change from Yesterday":"-1.45%","Change from Last Report":"-0.59","Latest Volume":"3,672,898","Market Cap":"188,425,437,184","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":13.993101,"PB Ratio":7.221071,"Previous Close":172.93,"ROE":0.42253,"DTE":58.765,"Industry":"Semiconductors","Sector":"Technology","Beta":1.286,"Trailing PEG":1.6993,"Trailing PE":19.067183,"Trailing PS":4.8361335,"Quick Ratio":1.64,"Day High":172.58,"Day Low":168.09,"VS Average Volume":0.4447436393,"Company Summary":"QUALCOMM Incorporated engages in the development and commercialization of foundational technologies for the wireless industry worldwide. It operates through three segments: Qualcomm CDMA Technologies (QCT); Qualcomm Technology Licensing (QTL); and Qualcomm Strategic Initiatives (QSI). The QCT segment develops and supplies integrated circuits and system software with advanced connectivity and high-performance, and low-power computing technologies for use in mobile devices; automotive systems for connectivity, digital cockpit, and ADAS\/AD; and IoT, including consumer electronic devices, industrial devices, and edge networking products. The QTL segment grants licenses or provides rights to use portions of its intellectual property portfolio, which include various patent rights useful in the manufacture and sale of wireless products comprising products implementing CDMA2000, WCDMA, LTE and\/or OFDMA-based 5G products. The QSI segment invests in early-stage companies in various industries, including 5G, artificial intelligence, automotive, consumer, enterprise, cloud, IoT, and extended reality, and investments, including non-marketable equity securities and, to a lesser extent, marketable equity securities, and convertible debt instruments. It also provides development, and other services and sells related products to the United States government agencies and their contractors. The company was incorporated in 1985 and is headquartered in San Diego, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"Microsoft Corporation","Symbol":"MSFT","Current Price":"411.96","Latest MA":"426.22","Price Target":506.62082,"Difference from MA":"-3.35%","Difference from Open":"0.05%","Change from Yesterday":"-0.76%","Change from Last Report":"-0.07","Latest Volume":"13,178,251","Market Cap":"3,062,502,260,736","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":27.373375,"PB Ratio":11.406894,"Previous Close":415.06,"ROE":0.35604,"DTE":33.657,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.904,"Trailing PEG":2.2191,"Trailing PE":33.19581,"Trailing PS":12.048083,"Quick Ratio":1.163,"Day High":414.72,"Day Low":408.67,"VS Average Volume":0.5987871361,"Company Summary":"Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services. This segment also provides LinkedIn; and dynamics business solutions, including Dynamics 365, a set of intelligent, cloud-based applications across ERP, CRM, power apps, and power automate; and on-premises ERP and CRM applications. The Intelligent Cloud segment offers server products and cloud services, such as azure and other cloud services; SQL and windows server, visual studio, system center, and related client access licenses, as well as nuance and GitHub; and enterprise services including enterprise support services, industry solutions, and nuance professional services. The More Personal Computing segment offers Windows, including windows OEM licensing and other non-volume licensing of the Windows operating system; Windows commercial comprising volume licensing of the Windows operating system, windows cloud services, and other Windows commercial offerings; patent licensing; and windows Internet of Things; and devices, such as surface, HoloLens, and PC accessories. Additionally, this segment provides gaming, which includes Xbox hardware and content, and first- and third-party content; Xbox game pass and other subscriptions, cloud gaming, advertising, third-party disc royalties, and other cloud services; and search and news advertising, which includes Bing, Microsoft News and Edge, and third-party affiliates. The company sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online, and retail stores. The company was founded in 1975 and is headquartered in Redmond, Washington.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"Tetra Tech, Inc.","Symbol":"TTEK","Current Price":"33.69","Latest MA":"43.87","Price Target":44.16667,"Difference from MA":"-23.21%","Difference from Open":"-5.29%","Change from Yesterday":"-8.45%","Change from Last Report":"-0.65","Latest Volume":"3,645,470","Market Cap":"9,030,132,736","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":21.210957,"PB Ratio":4.9003634,"Previous Close":36.8,"ROE":0.18655,"DTE":55.515,"Industry":"Engineering & Construction","Sector":"Industrials","Beta":0.939,"Trailing PEG":null,"Trailing PE":35.463158,"Trailing PS":2.1323736,"Quick Ratio":1.111,"Day High":35.725,"Day Low":33.47,"VS Average Volume":1.3260401435,"Company Summary":"Tetra Tech, Inc. provides consulting and engineering services in the United States and internationally. The company operates through two segments, Government Services Group (GSG) and Commercial\/International Services Group (CIG). The GSG segment offers early data collection and monitoring, data analysis and information management, science and engineering applied research, engineering design, project management, and operations and maintenance services; and climate change and energy management consulting, as well as greenhouse gas inventory assessment, certification, reduction, and management services. This segment serves federal, state, and local governments; and development agencies in water resources analysis and water management, environmental monitoring, data analytics, government consulting, waste management, and a range of civil infrastructure master planning and engineering design markets. The CIG segment provides early data collection and monitoring, data analysis and information management, feasibility studies and assessments, science and engineering applied research, engineering design, project management, and operations and maintenance services; and environmental remediation and reconstruction services, and industrial water treatment services. This segment serves natural resources, energy, and utilities markets, as well as sustainable infrastructure master planning and engineering design for facilities, transportation, and local development projects. Tetra Tech, Inc. was founded in 1966 and is headquartered in Pasadena, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"Flex Ltd.","Symbol":"FLEX","Current Price":"40.32","Latest MA":"34.91","Price Target":46.58571,"Difference from MA":"15.50%","Difference from Open":"2.39%","Change from Yesterday":"-3.24%","Change from Last Report":"0.00","Latest Volume":"2,135,985","Market Cap":"15,635,410,944","Earning Date":"2025-01-29","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":14.112014,"PB Ratio":3.0901287,"Previous Close":41.65,"ROE":0.15442,"DTE":83.65,"Industry":"Electronic Components","Sector":"Technology","Beta":1.076,"Trailing PEG":null,"Trailing PE":16.457142,"Trailing PS":0.6143821,"Quick Ratio":0.72,"Day High":40.675,"Day Low":39.1,"VS Average Volume":0.4670107907,"Company Summary":"Flex Ltd. provides manufacturing solutions to various brands in Asia, the Americas, and Europe. It operates through two segments, Flex Agility Solutions (FAS) and Flex Reliability Solutions (FRS). The FAS segment offers flexible supply and manufacturing system comprising communications, enterprise, and cloud solution, which includes data, edge, and communications infrastructure; lifestyle solution, including appliances, consumer packaging, floorcare, micro mobility, and audio; and consumer devices, such as mobile and high velocity consumer devices. Its FRS segment provides complex ramps with specialized production models and critical environments, which comprise automotive including next generation mobility, autonomous, connectivity, electrification, and smart technologies; health solutions, such as medical devices, medical equipment, and drug delivery; and industrial solutions, including capital equipment, industrial devices, embedded and critical power offerings, and renewables and grid edge. In addition, it provides various services, including design and engineering, such as product design and engineering resources that provide design services, product development, systems integration services, and solutions; supply chain comprising manufacturing, customization, procurement, logistics services, and innovative supply chain solutions; manufacturing; logistics and value-added fulfillment, including warehousing and vendor managed inventory, omni-channel fulfillment, kitting, configuration, and postponement; and integrated reverse logistics and circular economy. Further, the company offers embedded and critical power solutions. The company was formerly known as Flextronics International Ltd. and changed its name to Flex Ltd. in September 2016. Flex Ltd. was founded in 1969 and is headquartered in Austin, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"Las Vegas Sands Corp.","Symbol":"LVS","Current Price":"44.61","Latest MA":"46.21","Price Target":58.90105,"Difference from MA":"-3.46%","Difference from Open":"0.29%","Change from Yesterday":"-2.66%","Change from Last Report":"-0.16","Latest Volume":"2,942,122","Market Cap":"32,343,408,640","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":14.922428,"PB Ratio":9.439273,"Previous Close":45.83,"ROE":0.45166,"DTE":384.206,"Industry":"Resorts & Casinos","Sector":"Consumer Cyclical","Beta":1.117,"Trailing PEG":0.8508,"Trailing PE":22.760204,"Trailing PS":2.857949,"Quick Ratio":0.864,"Day High":45.37,"Day Low":44.23,"VS Average Volume":0.5848250358,"Company Summary":"Las Vegas Sands Corp., together with its subsidiaries, develops, owns, and operates integrated resorts in Macao and Singapore. It owns and operates The Venetian Macao Resort Hotel, the Londoner Macao, The Parisian Macao, The Plaza Macao and Four Seasons Hotel Macao, Cotai Strip, and the Sands Macao in Macao, the People's Republic of China; and Marina Bay Sands in Singapore. The company's integrated resorts feature accommodations, gaming, entertainment and retail malls, convention and exhibition facilities, celebrity chef restaurants, and other amenities. Las Vegas Sands Corp. was founded in 1988 and is based in Las Vegas, Nevada.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"V.F. Corporation","Symbol":"VFC","Current Price":"24.93","Latest MA":"19.20","Price Target":26.155,"Difference from MA":"29.85%","Difference from Open":"-1.23%","Change from Yesterday":"-4.00%","Change from Last Report":"-1.07","Latest Volume":"3,722,331","Market Cap":"9,712,055,296","Earning Date":"2025-01-29","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":23.054516,"PB Ratio":5.8452525,"Previous Close":25.97,"ROE":-0.22331,"DTE":524.646,"Industry":"Apparel Manufacturing","Sector":"Consumer Cyclical","Beta":1.545,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.96220994,"Quick Ratio":0.465,"Day High":25.43,"Day Low":24.51,"VS Average Volume":0.6451426224,"Company Summary":"V.F. Corporation, together with its subsidiaries, engages in the design, procurement, marketing, and distribution of branded lifestyle apparel, footwear, and accessories for men, women, and children in the Americas, Europe, and the Asia-Pacific. It operates through three segments: Outdoor, Active, and Work. The company offers High performance outdoor apparel, footwear, equipment, accessories; outdoor, adventure-inspired lifestyle footwear, apparel, and accessories; performance merino wool and other natural fibers-based apparel and accessories; performance-based footwear; and high performance apparel and accessories based on natural fibers under the The North Face, Timberland, Smartwool, Icebreaker, and Altra brands. It also offers youth culture\/action sports-inspired and streetwear apparel, footwear, and accessories; handbags, luggage, backpacks, totes, and accessories; outdoor-inspired apparel, footwear, and accessories; and backpacks and luggage under the Vans, Supreme, Kipling, Napapijri, Eastpak, and JanSport brands. In addition, the company provides work and work-inspired lifestyle apparel and footwear; and protective work footwear under the Dickies, and Timberland PRO brands. The company sells its products primarily to specialty stores, department stores, national chains, independently-operated partnership stores, and mass merchants, as well as sells through direct-to-consumer operations, including retail stores, concession retail stores, and e-commerce sites, and other digital platforms. V.F. Corporation was founded in 1899 and is headquartered in Denver, Colorado.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"03-02-2025 20:01:17"},{"Company Name":"Kinder Morgan, Inc.","Symbol":"KMI","Current Price":"27.49","Latest MA":"24.08","Price Target":29.585,"Difference from MA":"14.16%","Difference from Open":"2.44%","Change from Yesterday":"-0.09%","Change from Last Report":"0.03","Latest Volume":"5,871,026","Market Cap":"61,081,100,288","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.398643,"PB Ratio":2.0088923,"Previous Close":27.1925,"ROE":0.083500005,"DTE":101.433,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.907,"Trailing PEG":2.0121,"Trailing PE":23.49889,"Trailing PS":4.03149,"Quick Ratio":0.291,"Day High":27.56,"Day Low":26.73,"VS Average Volume":0.4050323966,"Company Summary":"Kinder Morgan, Inc. operates as an energy infrastructure company primarily in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas gasification, liquefaction, and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and\/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, renewable fuel and feedstocks, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; owns interests in\/or operates oil fields and gasoline processing plants; and operates a crude oil pipeline system in West Texas, as well as owns and operates RNG and LNG facilities. It owns and operates approximately 82,000 miles of pipelines and 139 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1997 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 20:02:24"},{"Company Name":"GE Vernova Inc.","Symbol":"GEV","Current Price":"361.87","Latest MA":"269.31","Price Target":413.4468,"Difference from MA":"34.37%","Difference from Open":"3.29%","Change from Yesterday":"-3.19%","Change from Last Report":"0.31","Latest Volume":"2,401,087","Market Cap":"99,752,271,872","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":34.956905,"PB Ratio":10.486393,"Previous Close":372.88,"ROE":"N\/A","DTE":9.346,"Industry":"Utilities - Renewable","Sector":"Utilities","Beta":"N\/A","Trailing PEG":3.2318,"Trailing PE":64.736115,"Trailing PS":2.8979218,"Quick Ratio":0.717,"Day High":366.5739,"Day Low":348.95,"VS Average Volume":0.7101914549,"Company Summary":"GE Vernova Inc., an energy company, engages in the provision of various products and services that generate, transfer, orchestrate, convert, and store electricity in the United States, Europe, Asia, the Americas, the Middle East, and Africa. The company operates through three segments: Power, Wind, and Electrification. The Power segment designs, manufactures, and services gas, nuclear, hydro, and steam technologies. The Wind segment offers wind generation technologies, including onshore and offshore wind turbines and blades. The Electrification segment provides grid solutions, power conversion, solar, and storage solutions; and electrification software for the transmission, distribution, conversion, storage, and orchestration of electricity from point of generation to point of consumption. The company was incorporated in 2023 and is headquartered in Cambridge, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 20:02:24"},{"Company Name":"Johnson & Johnson","Symbol":"JNJ","Current Price":"151.76","Latest MA":"154.46","Price Target":168.64,"Difference from MA":"-1.75%","Difference from Open":"-0.16%","Change from Yesterday":"-0.30%","Change from Last Report":"-0.08","Latest Volume":"2,287,050","Market Cap":"365,380,403,200","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.650035,"PB Ratio":5.207247,"Previous Close":152.15,"ROE":0.20889,"DTE":50.958,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.518,"Trailing PEG":0.9647,"Trailing PE":26.165516,"Trailing PS":4.1664433,"Quick Ratio":0.705,"Day High":152.31,"Day Low":150.8,"VS Average Volume":0.2645248985,"Company Summary":"Johnson & Johnson, together with its subsidiaries, researches, develops, manufactures, and sells various products in the healthcare field worldwide. The company's Innovative Medicine segment offers products for various therapeutic areas, such as immunology, including rheumatoid arthritis, psoriatic arthritis, inflammatory bowel disease, and psoriasis; infectious diseases comprising HIV\/AIDS; neuroscience, consisting of mood disorders, neurodegenerative disorders, and schizophrenia; oncology, such as prostate cancer, hematologic malignancies, lung cancer, and bladder cancer; cardiovascular and metabolism, including thrombosis, diabetes, and macular degeneration; and pulmonary hypertension comprising pulmonary arterial hypertension through retailers, wholesalers, distributors, hospitals, and healthcare professionals for prescription use. Its MedTech segment provides Interventional Solutions, including electrophysiology products to treat heart rhythm disorders; the heart recovery portfolio, which includes technologies to treat severe coronary artery disease requiring high-risk PCI or AMI cardiogenic shock; and neurovascular care that treats hemorrhagic and ischemic stroke. this segment also offers an orthopaedics portfolio that includes products and enabling technologies that support hips, knees, trauma, spine, sports, and other; surgery portfolios comprising advanced and general surgery technologies, as well as solutions for breast aesthetics, ear, nose, and throat procedures; contact lenses under the ACUVUE Brand; and TECNIS intraocular lenses for cataract surgery. It distributes its products to wholesalers, hospitals, and retailers, as well as physicians, nurses, hospitals, eye care professionals, and clinics. The company has a collaboration agreement with Stand Up To Cancer for research testing a combination of teclistamab and daratumumab to treat a rare disease AL amyloidosis. Johnson & Johnson was founded in 1886 and is based in New Brunswick, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 20:02:24"},{"Company Name":"Amphenol Corporation","Symbol":"APH","Current Price":"70.23","Latest MA":"67.78","Price Target":84.08235,"Difference from MA":"3.61%","Difference from Open":"1.73%","Change from Yesterday":"-1.09%","Change from Last Report":"0.05","Latest Volume":"3,145,886","Market Cap":"84,666,007,552","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":27.707977,"PB Ratio":8.955203,"Previous Close":70.78,"ROE":0.25293,"DTE":57.565,"Industry":"Electronic Components","Sector":"Technology","Beta":1.238,"Trailing PEG":2.5142,"Trailing PE":36.57641,"Trailing PS":5.9488215,"Quick Ratio":1.208,"Day High":70.32,"Day Low":68.54,"VS Average Volume":0.4613459206,"Company Summary":"Amphenol Corporation, together with its subsidiaries, primarily designs, manufactures, and markets electrical, electronic, and fiber optic connectors in the United States, China, and internationally. It operates through three segments: Harsh Environment Solutions, Communications Solutions, and Interconnect and Sensor Systems. The company offers connectors and connector systems, including harsh environment data, power, high-speed, fiber optic, and radio frequency interconnect products; busbars and power distribution systems; and other connectors. It also provides value-add products, such as backplane interconnect systems, cable assemblies and harnesses, and cable management products; other products comprising flexible and rigid printed circuit boards, hinges, other mechanical, and production related products. In addition, the company offers consumer device, network infrastructure, and other antennas; coaxial, power, and specialty cables; and sensors and sensor-based products. It sells its products through its sales force, independent representatives, and a network of electronics distributors to original equipment manufacturers, electronic manufacturing services companies, original design manufacturers, and service providers in the automotive, broadband communication, commercial aerospace, industrial, information technology and data communication, military, mobile device, and mobile network markets. Amphenol Corporation was founded in 1932 and is headquartered in Wallingford, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 20:02:24"},{"Company Name":"United Airlines Holdings, Inc.","Symbol":"UAL","Current Price":"104.86","Latest MA":"70.82","Price Target":129.49522,"Difference from MA":"48.07%","Difference from Open":"2.84%","Change from Yesterday":"-1.23%","Change from Last Report":"-0.29","Latest Volume":"2,395,830","Market Cap":"34,485,936,128","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.073316,"PB Ratio":3.0150378,"Previous Close":105.84,"ROE":0.27245,"DTE":291.676,"Industry":"Airlines","Sector":"Industrials","Beta":1.393,"Trailing PEG":0.994,"Trailing PE":11.096296,"Trailing PS":0.6158863,"Quick Ratio":0.694,"Day High":106.3,"Day Low":101.32,"VS Average Volume":0.4174697343,"Company Summary":"United Airlines Holdings, Inc., through its subsidiaries, provides air transportation services in North America, Asia, Europe, Africa, the Pacific, the Middle East, and Latin America. The company transports people and cargo through its mainline and regional fleets. It also offers catering, ground handling, flight academy, and maintenance services for third parties. The company was formerly known as United Continental Holdings, Inc. and changed its name to United Airlines Holdings, Inc. in June 2019. United Airlines Holdings, Inc. was incorporated in 1968 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"03-02-2025 20:02:24"},{"Company Name":"Netflix, Inc.","Symbol":"NFLX","Current Price":"981.56","Latest MA":"768.34","Price Target":1063.7195,"Difference from MA":"27.75%","Difference from Open":"0.93%","Change from Yesterday":"0.24%","Change from Last Report":"0.24","Latest Volume":"2,157,463","Market Cap":"419,869,163,520","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":32.36601,"PB Ratio":18.46669,"Previous Close":976.76,"ROE":0.34714,"DTE":81.461,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.25,"Trailing PEG":2.4191,"Trailing PE":49.49874,"Trailing PS":11.170512,"Quick Ratio":0.975,"Day High":984.44,"Day Low":964.375,"VS Average Volume":0.6202235143,"Company Summary":"Netflix, Inc. provides entertainment services. It offers TV series, documentaries, feature films, and games across various genres and languages. The company also provides members the ability to receive streaming content through a host of internet-connected devices, including TVs, digital video players, TV set-top boxes, and mobile devices. It has operations in approximately 190 countries. The company was incorporated in 1997 and is headquartered in Los Gatos, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 20:02:24"},{"Company Name":"KeyCorp","Symbol":"KEY","Current Price":"17.56","Latest MA":"16.79","Price Target":21.04,"Difference from MA":"4.57%","Difference from Open":"0.69%","Change from Yesterday":"-2.59%","Change from Last Report":"0.00","Latest Volume":"4,977,926","Market Cap":"19,435,231,232","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":10.06621,"PB Ratio":1.2127908,"Previous Close":17.98,"ROE":0.0096700005,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.231,"Trailing PEG":0.7732,"Trailing PE":"N\/A","Trailing PS":4.0056124,"Quick Ratio":"N\/A","Day High":17.745,"Day Low":17.295,"VS Average Volume":0.4583991521,"Company Summary":"KeyCorp operates as the holding company for KeyBank National Association that provides various retail and commercial banking products and services in the United States. It operates in two segments, Consumer Bank and Commercial Bank. The company offers various deposits, investment products and services; commercial leasing, investment management, consumer finance; and personal finance and financial wellness, student loan refinancing, mortgage and home equity, lending, credit card, treasury, business advisory, wealth management, asset management, cash management, portfolio management, and trust and related services to individuals and small and medium-sized businesses. It also provides a suite of banking and capital market products, such as syndicated finance, debt and equity capital market products, commercial payments, equipment finance, commercial mortgage banking, derivatives, foreign exchange, financial advisory, and public finance, as well as commercial mortgage loans to consumer, energy, healthcare, industrial, public sector, real estate, and technology sectors for middle market clients. In addition, the company offers community development financing, securities underwriting, brokerage, and investment banking services. The company was founded in 1849 and is headquartered in Cleveland, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 20:02:24"},{"Company Name":"Charles Schwab Corporation (The","Symbol":"SCHW","Current Price":"82.89","Latest MA":"71.13","Price Target":89.5,"Difference from MA":"16.53%","Difference from Open":"1.97%","Change from Yesterday":"0.05%","Change from Last Report":"-0.06","Latest Volume":"2,562,259","Market Cap":"151,735,123,968","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":15.989336,"PB Ratio":3.9883556,"Previous Close":82.72,"ROE":0.12111,"DTE":144.242,"Industry":"Capital Markets","Sector":"Financial Services","Beta":0.952,"Trailing PEG":0.9537,"Trailing PE":27.722408,"Trailing PS":8.098586,"Quick Ratio":0.481,"Day High":83.22,"Day Low":80.79,"VS Average Volume":0.3105431216,"Company Summary":"The Charles Schwab Corporation, together with its subsidiaries, operates as a savings and loan holding company that provides wealth management, securities brokerage, banking, asset management, custody, and financial advisory services in the United States and internationally. The company operates in two segments, Investor Services and Advisor Services. It offers brokerage accounts with equity and fixed income trading, margin lending, options trading, futures and forex trading, and cash management capabilities, including certificates of deposit; third-party mutual funds through the Mutual Fund Marketplace and Mutual Fund OneSource service, as well as mutual fund trading and clearing services to broker-dealers; exchange-traded funds; advisory solutions for managed portfolios, separately managed accounts, customized personal advice for tailored portfolios, specialized planning, and full-time portfolio management; banking products comprising checking and savings accounts, first lien residential real estate mortgage loans, home equity lines of credit, and pledged asset lines; and trust custody services, personal trust reporting services, and administrative trustee services. It also provides digital retirement calculators; integrated web-, mobile-, and software-based trading platforms, real-time market data, options trading, premium research, and multi-channel access; self-service education and support tools; online research and analysis tools; equity compensation plan sponsors full-service recordkeeping for stock plans, stock options, restricted stock, performance shares, and stock appreciation rights; retirement plan services; mutual fund clearing services; and advisor services, including interactive tools and educational content. The Company operates through branch offices. The Charles Schwab Corporation was founded in 1971 and is headquartered in Westlake, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 20:02:24"},{"Company Name":"Uber Technologies, Inc.","Symbol":"UBER","Current Price":"67.87","Latest MA":"70.34","Price Target":88.6338,"Difference from MA":"-3.51%","Difference from Open":"3.94%","Change from Yesterday":"1.37%","Change from Last Report":"0.03","Latest Volume":"13,270,834","Market Cap":"142,914,535,424","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":21.414148,"PB Ratio":9.662585,"Previous Close":66.85,"ROE":0.34326,"DTE":80.343,"Industry":"Software - Application","Sector":"Technology","Beta":1.337,"Trailing PEG":0.7077,"Trailing PE":33.4335,"Trailing PS":3.4063766,"Quick Ratio":1.223,"Day High":68.85,"Day Low":65.1781,"VS Average Volume":0.5291766139,"Company Summary":"Uber Technologies, Inc. develops and operates proprietary technology applications in the United States, Canada, Latin America, Europe, the Middle East, Africa, and Asia excluding China and Southeast Asia. It operates through three segments: Mobility, Delivery, and Freight. The Mobility segment connects consumers with a range of transportation modalities, such as ridesharing, carsharing, micromobility, rentals, public transit, taxis, and other modalities; and offers riders in a variety of vehicle types, as well as financial partnerships products and advertising services. The Delivery segment allows to search for and discover restaurants to grocery, alcohol, convenience, and other retails; order a meal or other items; and Uber direct, a white-label Delivery-as-a-Service for retailers and restaurants, as well as advertising. The Freight segment manages transportation and logistics network, which connects shippers and carriers in digital marketplace including carriers upfronts, pricing, and shipment booking; and provides on-demand platform to automate logistics end-to-end transactions for small-and medium-sized business to global enterprises. The company was formerly known as Ubercab, Inc. and changed its name to Uber Technologies, Inc. in February 2011. Uber Technologies, Inc. was founded in 2009 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 20:02:24"},{"Company Name":"Ford Motor Company","Symbol":"F","Current Price":"9.88","Latest MA":"10.79","Price Target":11.68125,"Difference from MA":"-8.46%","Difference from Open":"1.59%","Change from Yesterday":"-2.23%","Change from Last Report":"-0.45","Latest Volume":"89,150,706","Market Cap":"39,246,114,816","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":5.935708,"PB Ratio":0.8856503,"Previous Close":10.08,"ROE":0.0799,"DTE":359.359,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":1.636,"Trailing PEG":0.8746,"Trailing PE":11.221591,"Trailing PS":0.21476124,"Quick Ratio":0.942,"Day High":10.055,"Day Low":9.6,"VS Average Volume":1.4849901664,"Company Summary":"Ford Motor Company develops, delivers, and services a range of Ford trucks, commercial cars and vans, sport utility vehicles, and Lincoln luxury vehicles worldwide. It operates through Ford Blue, Ford Model e, and Ford Pro; Ford Next; and Ford Credit segments. The company sells Ford and Lincoln vehicles, service parts, and accessories through distributors and dealers, as well as through dealerships to commercial fleet customers, daily rental car companies, and governments. It also engages in vehicle-related financing and leasing activities to and through automotive dealers. In addition, the company provides retail installment sale contracts for new and used vehicles; and direct financing leases for new vehicles to retail and commercial customers, such as leasing companies, government entities, daily rental companies, and fleet customers. Further, it offers wholesale loans to dealers to finance the purchase of vehicle inventory; and loans to dealers to finance working capital and enhance dealership facilities, purchase dealership real estate, and other dealer vehicle programs. The company was incorporated in 1903 and is based in Dearborn, Michigan.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"03-02-2025 20:02:24"},{"Company Name":"Ares Capital Corporation","Symbol":"ARCC","Current Price":"23.55","Latest MA":"20.88","Price Target":22.82143,"Difference from MA":"12.80%","Difference from Open":"1.27%","Change from Yesterday":"-0.51%","Change from Last Report":"-0.02","Latest Volume":"2,834,419","Market Cap":"15,797,772,288","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":10.681668,"PB Ratio":1.1913313,"Previous Close":23.67,"ROE":0.1338,"DTE":106.255,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.054,"Trailing PEG":null,"Trailing PE":9.059616,"Trailing PS":5.37705,"Quick Ratio":1.29,"Day High":23.7,"Day Low":23.18,"VS Average Volume":0.637244516,"Company Summary":"Ares Capital Corporation is a business development company specializing in acquisition, recapitalization, mezzanine debt, restructurings, rescue financing, and leveraged buyout transactions of middle market companies. It also makes growth capital and general refinancing. It prefers to make investments in companies engaged in the basic and growth manufacturing, business services, consumer products, health care products and services, and information technology service sectors. The fund will also consider investments in industries such as restaurants, retail, oil and gas, and technology sectors. It focuses on investments in Northeast, Mid-Atlantic, Southeast and Southwest regions from its New York office, the Midwest region, from the Chicago office, and the Western region from the Los Angeles office. The fund typically invests between $20 million and $200 million and a maximum of $400 million in companies with an EBITDA between $10 million and $250 million. It makes debt investments between $10 million and $100 million The fund invests through revolvers, first lien loans, warrants, unitranche structures, second lien loans, mezzanine debt, private high yield, junior capital, subordinated debt, and non-control preferred and common equity. The fund also selectively considers third-party-led senior and subordinated debt financings and opportunistically considers the purchase of stressed and discounted debt positions. The fund prefers to be an agent and\/or lead the transactions in which it invests. The fund also seeks board representation in its portfolio companies.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 20:02:24"},{"Company Name":"Boston Scientific Corporation","Symbol":"BSX","Current Price":"103.65","Latest MA":"85.44","Price Target":103.49156,"Difference from MA":"21.31%","Difference from Open":"2.20%","Change from Yesterday":"1.09%","Change from Last Report":"0.10","Latest Volume":"2,596,501","Market Cap":"152,755,699,712","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":36.846325,"PB Ratio":7.3747973,"Previous Close":102.36,"ROE":0.08916,"DTE":53.722,"Industry":"Medical Devices","Sector":"Healthcare","Beta":0.797,"Trailing PEG":1.8557,"Trailing PE":85.65736,"Trailing PS":9.600635,"Quick Ratio":0.847,"Day High":103.75,"Day Low":100.7,"VS Average Volume":0.489169234,"Company Summary":"Boston Scientific Corporation develops, manufactures, and markets medical devices for use in various interventional medical specialties worldwide. It operates through two segments, MedSurg and Cardiovascular. The company offers devices to diagnose and treat gastrointestinal and pulmonary conditions, such as resolution clips, biliary stent systems, stents and electrocautery enhanced delivery systems, direct visualization systems, digital catheters, and single-use duodenoscopes; devices to treat urological conditions, including ureteral stents, catheters, baskets, guidewires, sheaths, balloons, single-use digital flexible ureteroscopes, holmium laser systems, artificial urinary sphincter, laser system, fiber, and hydrogel systems; and devices to treat neurological movement disorders and manage chronic pain, such as spinal cord stimulator system, proprietary programming software, radiofrequency generator, indirect decompression systems, practice optimization tools, and deep brain stimulation system. It also provides technologies for diagnosing and treating coronary artery disease and aortic valve conditions; WATCHMAN FLX, a Left Atrial Appendage Closure Device; and implantable devices that monitor the heart and deliver electricity to treat cardiac abnormalities, such as cardioverter and cardiac resynchronization therapy defibrillators, MRI S-ICD systems, cardiac resynchronization therapy pacemakers, quadripolar LV leads, ICD leads, pacing leads, remote patient management systems, insertable cardiac monitor systems, and remote cardiac monitoring systems. In addition, the company offers diagnosis and treatment of rate and rhythm disorders of the heart; peripheral arterial and venous diseases; and products to diagnose, treat and ease forms of cancer. The company was incorporated in 1979 and is headquartered in Marlborough, Massachusetts.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"03-02-2025 20:02:24"},{"Company Name":"Emerson Electric Company","Symbol":"EMR","Current Price":"128.08","Latest MA":"115.51","Price Target":140.15259,"Difference from MA":"10.88%","Difference from Open":"0.95%","Change from Yesterday":"-1.67%","Change from Last Report":"0.00","Latest Volume":"2,003,622","Market Cap":"72,945,532,928","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":19.780146,"PB Ratio":3.3754117,"Previous Close":129.95,"ROE":0.05933,"DTE":30.376,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":1.292,"Trailing PEG":null,"Trailing PE":45.41844,"Trailing PS":4.1702223,"Quick Ratio":1.323,"Day High":129.09,"Day Low":126.24,"VS Average Volume":0.6367061717,"Company Summary":"Emerson Electric Co., a technology and software company, provides various solutions in the Americas, Asia, the Middle East, Africa, and Europe. It operates through seven segments: Final Control, Measurement & Analytical, Discrete Automation, Safety & Productivity, Control Systems & Software, Test & Measurement, and AspenTech. The Final Control segment provides control, isolation, shutoff, pressure relief, and pressure safety valves, actuators, and regulators for process and hybrid industries. The Measurement & Analytical segment offers intelligent instrumentation measuring the physical properties of liquids or gases, such as pressure, temperature, level, flow, acoustics, corrosion, pH, conductivity, water quality, toxic gases, and flame. The Discrete Automation segment offers solenoid and pneumatic valves, valve position indicators, pneumatic cylinders, actuators, air preparation equipment, pressure and temperature switches, electric linear motion solutions, programmable automation control systems, electrical distribution equipment, and materials joining solutions. The Safety & Productivity segment offers tools for professionals and homeowners; pipe-working tools, including pipe wrenches, pipe cutters, pipe threading and roll grooving equipment, battery hydraulic tools; electrical tools; and other professional tools. The Control Systems & Software segment provides control systems, safety instrumented systems, SCADA systems, application software, digital twins, asset performance management, and cybersecurity. The Test & Measurement provides software-connected automated test and measurement systems. The AspenTech segment provides asset optimization software that enables industrial manufacturers to design, operate, and maintain operations for enhancing performance through a combination of decades of modeling, simulation, and optimization capabilities. The company was incorporated in 1890 and is based in Saint Louis, Missouri.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 20:02:24"},{"Company Name":"Walt Disney Company (The)","Symbol":"DIS","Current Price":"113.32","Latest MA":"99.85","Price Target":124.56071,"Difference from MA":"13.49%","Difference from Open":"1.77%","Change from Yesterday":"0.22%","Change from Last Report":"-0.22","Latest Volume":"4,099,539","Market Cap":"204,934,692,864","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":18.58924,"PB Ratio":2.045155,"Previous Close":113.06,"ROE":0.0546,"DTE":45.188,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.398,"Trailing PEG":0.9926,"Trailing PE":41.661766,"Trailing PS":2.276344,"Quick Ratio":0.531,"Day High":113.72,"Day Low":110.86,"VS Average Volume":0.4418778991,"Company Summary":"The Walt Disney Company operates as an entertainment company worldwide. It operates through three segments: Entertainment, Sports, and Experiences. The company produces and distributes film and television video streaming content under the ABC Television Network, Disney, Freeform, FX, Fox, National Geographic, and Star brand television channels, as well as ABC television stations and A+E television networks; and produces original content under the ABC Signature, Disney Branded Television, FX Productions, Lucasfilm, Marvel, National Geographic Studios, Pixar, Searchlight Pictures, Twentieth Century Studios, 20th Television, and Walt Disney Pictures banners. It also offers direct-to-consumer streaming services through Disney+, Disney+ Hotstar, Hulu, and Star+; sports-related entertainment services through ESPN, ESPN on ABC, ESPN+ DTC, and Star; sale\/licensing of film and episodic content to third-party television and VOD services; theatrical, home entertainment, and music distribution services; DVD and Blu-ray discs, electronic home video licenses, and VOD rental services; staging and licensing of live entertainment events; and post-production services. In addition, the company operates theme parks and resorts comprising Walt Disney World Resort, Disneyland Resort, Disneyland Paris, Hong Kong Disneyland Resort, Shanghai Disney Resort, Disney Cruise Line, Disney Vacation Club, National Geographic Expeditions, and Adventures by Disney, as well as Aulani, a Disney resort and spa in Hawaii. It also licenses its intellectual property to a third party for operations of the Tokyo Disney Resort; licenses trade names, characters, visual, literary, and other IP for use on merchandise, published materials, and games; operates a direct-to-home satellite distribution platform; sells branded merchandise through retail, online, and wholesale businesses; and develops and publishes books, comic books, and magazines. The company was founded in 1923 and is based in Burbank, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 20:02:24"},{"Company Name":"Pepsico, Inc.","Symbol":"PEP","Current Price":"150.76","Latest MA":"163.58","Price Target":172.62045,"Difference from MA":"-7.84%","Difference from Open":"0.81%","Change from Yesterday":"-0.04%","Change from Last Report":"-0.22","Latest Volume":"2,994,522","Market Cap":"206,841,200,640","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":17.673967,"PB Ratio":10.640881,"Previous Close":150.69,"ROE":0.48819,"DTE":229.605,"Industry":"Beverages - Non-Alcoholic","Sector":"Consumer Defensive","Beta":0.542,"Trailing PEG":1.8127,"Trailing PE":22.235987,"Trailing PS":2.2502306,"Quick Ratio":0.664,"Day High":151.12,"Day Low":148.83,"VS Average Volume":0.4731887489,"Company Summary":"PepsiCo, Inc. engages in the manufacture, marketing, distribution, and sale of various beverages and convenient foods worldwide. The company operates through seven segments: Frito-Lay North America; Quaker Foods North America; PepsiCo Beverages North America; Latin America; Europe; Africa, Middle East and South Asia; and Asia Pacific, Australia and New Zealand and China Region. It provides dips, cheese-flavored snacks, and spreads, as well as corn, potato, and tortilla chips; cereals, rice, pasta, mixes and syrups, granola bars, grits, oatmeal, rice cakes, and side dishes; beverage concentrates, fountain syrups, and finished goods; ready-to-drink tea, coffee, and juices; dairy products; and sparkling water makers and related products, as well as distributes alcoholic beverages under Hard MTN Dew brand. The company offers its products primarily under the Lay's, Doritos, Fritos, Tostitos, BaiCaoWei, Cheetos, Cap'n Crunch, Life, Pearl Milling Company, Gatorade, Pepsi-Cola, Mountain Dew, Quaker, Rice-A-Roni, Aquafina, Bubly, Emperador, Diet Mountain Dew, Diet Pepsi, Gatorade Zero, Crush, Propel, Dr Pepper, Schweppes, Marias Gamesa, Ruffles, Sabritas, Saladitas, Tostitos, 7UP, Diet 7UP, H2oh!, Manzanita Sol, Mirinda, Pepsi Black, Pepsi Max, San Carlos, Toddy, Walkers, Chipsy, Kurkure, Sasko, Spekko, White Star, Smith's, Sting, SodaStream, Lubimyj Sad, Agusha, Chudo, Domik v Derevne, Lipton, and other brands. It serves wholesale and other distributors, foodservice customers, grocery stores, drug stores, convenience stores, discount\/dollar stores, mass merchandisers, membership stores, hard discounters, e-commerce retailers and authorized independent bottlers, and others through a network of direct-store-delivery, customer warehouse, and distributor networks, as well as directly to consumers through e-commerce platforms and retailers. The company was founded in 1898 and is based in Purchase, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 20:02:24"},{"Company Name":"Alphabet Inc.","Symbol":"GOOGL","Current Price":"202.62","Latest MA":"174.61","Price Target":216.36867,"Difference from MA":"16.04%","Difference from Open":"0.97%","Change from Yesterday":"-0.85%","Change from Last Report":"-0.16","Latest Volume":"13,999,354","Market Cap":"2,489,025,298,432","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":22.525026,"PB Ratio":7.9110217,"Previous Close":204.02,"ROE":0.32101002,"DTE":9.324,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.034,"Trailing PEG":1.3332,"Trailing PE":26.837748,"Trailing PS":7.3236995,"Quick Ratio":1.761,"Day High":203.75,"Day Low":200.11,"VS Average Volume":0.5108821645,"Company Summary":"Alphabet Inc. offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube. It is also involved in the sale of apps and in-app purchases and digital content in the Google Play and YouTube; and devices, as well as in the provision of YouTube consumer subscription services. The Google Cloud segment offers infrastructure, cybersecurity, databases, analytics, AI, and other services; Google Workspace that include cloud-based communication and collaboration tools for enterprises, such as Gmail, Docs, Drive, Calendar, and Meet; and other services for enterprise customers. The Other Bets segment sells healthcare-related and internet services. The company was incorporated in 1998 and is headquartered in Mountain View, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 20:02:24"},{"Company Name":"Lumen Technologies, Inc.","Symbol":"LUMN","Current Price":"4.81","Latest MA":"5.53","Price Target":5.37091,"Difference from MA":"-13.03%","Difference from Open":"1.69%","Change from Yesterday":"-2.73%","Change from Last Report":"-0.51","Latest Volume":"5,188,243","Market Cap":"4,881,337,344","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":-7.185689,"PB Ratio":14.2732935,"Previous Close":4.94,"ROE":-1.6673199,"DTE":5502.924,"Industry":"Telecom Services","Sector":"Communication Services","Beta":1.201,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.36712825,"Quick Ratio":0.988,"Day High":4.95,"Day Low":4.57,"VS Average Volume":0.3657759579,"Company Summary":"Lumen Technologies, Inc., a facilities-based technology and communications company, provides various integrated products and services to business and residential customers in the United States and internationally. The company operates in two segments, Business and Mass Markets. It offers dark fiber, edge cloud services, internet protocol, managed security, software-defined wide area networks, secure access service edge, unified communications and collaboration, and optical wavelengths services; ethernet and VPN data networks services; and legacy services to manage cash flow, including time division multiplexing voice, private line, and other legacy services, as well as sells communication equipment, and IT solutions. The company also provides high speed and lower speed broadband service to residential and small business customers; local and long-distance voice services, professional services, and other ancillary services; and federal broadband and state support programs. It serves its products and services under the Lumen, Quantum Fiber, and CenturyLink brands. The company was formerly known as CenturyLink, Inc. and changed its name to Lumen Technologies, Inc. in September 2020. Lumen Technologies, Inc. was incorporated in 1968 and is headquartered in Monroe, Louisiana.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"03-02-2025 20:02:24"},{"Company Name":"Enterprise Products Partners L.","Symbol":"EPD","Current Price":"33.01","Latest MA":"29.55","Price Target":35.66722,"Difference from MA":"11.71%","Difference from Open":"4.48%","Change from Yesterday":"1.07%","Change from Last Report":"0.00","Latest Volume":"3,642,204","Market Cap":"71,540,973,568","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":11.422827,"PB Ratio":2.523704,"Previous Close":32.65,"ROE":0.20665,"DTE":110.757,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":1.014,"Trailing PEG":3.166,"Trailing PE":12.407895,"Trailing PS":1.2630821,"Quick Ratio":0.719,"Day High":33.125,"Day Low":31.5101,"VS Average Volume":0.8344224663,"Company Summary":"Enterprise Products Partners L.P. provides midstream energy services to producers and consumers of natural gas, natural gas liquids (NGLs), crude oil, petrochemicals, and refined products. It operates in four segments: NGL Pipelines & Services, Crude Oil Pipelines & Services, Natural Gas Pipelines & Services, and Petrochemical & Refined Products Services. The NGL Pipelines & Services segment offers natural gas processing and related NGL marketing services. It operates natural gas processing facilities located in Colorado, Louisiana, Mississippi, New Mexico, Texas, and Wyoming; NGL pipelines; NGL fractionation facilities; NGL and related product storage facilities; and NGL marine terminals. The Crude Oil Pipelines & Services segment operates crude oil pipelines; and crude oil storage and marine terminals, which include a fleet of approximately 250 tractor-trailer tank trucks that are used to transport crude oil. It also engages in crude oil marketing activities. The Natural Gas Pipelines & Services segment operates natural gas pipeline systems to gather, treat, and transport natural gas. It leases underground salt dome natural gas storage facilities in Napoleonville, Louisiana; owns an underground salt dome storage cavern in Wharton County, Texas; and markets natural gas. The Petrochemical & Refined Products Services segment operates propylene fractionation facilities, including propylene fractionation units and propane dehydrogenation facilities, and related marketing activities; butane isomerization complex and related deisobutanizer operations; and octane enhancement, isobutane dehydrogenation, and high purity isobutylene production facilities. It also operates refined products pipelines and terminals; and ethylene export terminals; and provides refined products marketing and marine transportation services. Enterprise Products Partners L.P. was founded in 1968 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 20:02:24"},{"Company Name":"Pfizer, Inc.","Symbol":"PFE","Current Price":"26.20","Latest MA":"27.17","Price Target":31.12955,"Difference from MA":"-3.56%","Difference from Open":"-0.36%","Change from Yesterday":"-1.21%","Change from Last Report":"-0.27","Latest Volume":"21,953,676","Market Cap":"148,503,478,272","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":8.938134,"PB Ratio":1.6088531,"Previous Close":26.52,"ROE":0.04538,"DTE":73.408,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.615,"Trailing PEG":0.1987,"Trailing PE":34.94,"Trailing PS":2.501111,"Quick Ratio":0.64,"Day High":26.465,"Day Low":26.15,"VS Average Volume":0.5060552453,"Company Summary":"Pfizer Inc. discovers, develops, manufactures, markets, distributes, and sells biopharmaceutical products in the United States, Europe, and internationally. The company offers medicines and vaccines in various therapeutic areas, including cardiovascular metabolic, migraine, and women's health under the Eliquis, Nurtec ODT\/Vydura, Zavzpret, and the Premarin family brands; infectious diseases with unmet medical needs under the Prevnar family, Abrysvo, Nimenrix, FSME\/IMMUN-TicoVac, and Trumenba brands; and COVID-19 prevention and treatment, and potential future mRNA and antiviral products under the Comirnaty and Paxlovid brands. It also provides medicines and vaccines in various therapeutic areas, such as biosimilars for chronic immune and inflammatory diseases under the Xeljanz, Enbrel, Inflectra, Litfulo, Velsipity, and Cibinqo brands; amyloidosis, hemophilia, endocrine diseases, and sickle cell disease under the Vyndaqel family, Oxbryta, BeneFIX, Somavert, Ngenla, and Genotropin brands; sterile injectable and anti-infective medicines under the Sulperazon, Medrol, Zavicefta, Zithromax, and Panzyga brands; and biologics, small molecules, immunotherapies, and biosimilars under the Ibrance, Xtandi, Inlyta, Bosulif, Mektovi, Padcev, Adcetris, Talzenna, Tukysa, Elrexfio, Tivdak, Lorbrena, and Braftovi brands. In addition, the company involved in the contract manufacturing business. It serves wholesalers, retailers, hospitals, clinics, government agencies, pharmacies, individual provider offices, retail pharmacies, and integrated delivery systems. The company has collaboration agreements with Bristol-Myers Squibb Company; Astellas Pharma US, Inc.; Merck KGaA; and BioNTech SE, as well as has strategic clinical collaboration with Acepodia Inc. for the development of antibody-cell conjugation-based cell therapies in autoimmune diseases. Pfizer Inc. was founded in 1849 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 20:02:24"},{"Company Name":"Super Micro Computer, Inc.","Symbol":"SMCI","Current Price":"26.86","Latest MA":"46.40","Price Target":40.79182,"Difference from MA":"-42.11%","Difference from Open":"-1.32%","Change from Yesterday":"-5.72%","Change from Last Report":"-0.26","Latest Volume":"31,109,152","Market Cap":"15,728,276,480","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.2804546,"PB Ratio":2.8819745,"Previous Close":28.52,"ROE":0.32469,"DTE":39.749,"Industry":"Computer Hardware","Sector":"Technology","Beta":1.279,"Trailing PEG":null,"Trailing PE":13.363184,"Trailing PS":1.0525618,"Quick Ratio":1.805,"Day High":27.61,"Day Low":25.71,"VS Average Volume":0.4371919784,"Company Summary":"Super Micro Computer, Inc., together with its subsidiaries, develops and manufactures high performance server and storage solutions based on modular and open architecture in the United States, Europe, Asia, and internationally. Its solutions range from complete server, storage systems, modular blade servers, blades, workstations, full racks, networking devices, server sub-systems, server management software, and security software. The company provides application-optimized server solutions, rackmount and blade servers, storage, and subsystems and accessories; and server software management solutions, such as Server Management Suite, including Supermicro Server Manager, Supermicro Power Management software, Supermicro Update Manager, SuperCloud Composer, and SuperDoctor 5. In addition, it offers server subsystems and accessories comprising server boards, chassis, power supplies, and other accessories. Further, the company provides server and storage system integration, configuration, and software upgrade and update services; and technical documentation services, as well as identifies service requirements, creates and executes project plans, and conducts verification testing and technical documentation, and training services. Additionally, it offers help desk and on-site product support services for its server and storage systems; and customer support services, including ongoing maintenance and technical support for its products. The company provides its products to enterprise data centers, cloud computing, artificial intelligence, and 5G and edge computing markets. It sells its products through direct and indirect sales force, distributors, value-added resellers, system integrators, and original equipment manufacturers. The company was incorporated in 1993 and is headquartered in San Jose, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"03-02-2025 20:02:24"},{"Company Name":"PayPal Holdings, Inc.","Symbol":"PYPL","Current Price":"88.77","Latest MA":"77.18","Price Target":96.24829,"Difference from MA":"15.02%","Difference from Open":"2.62%","Change from Yesterday":"0.05%","Change from Last Report":"-0.20","Latest Volume":"5,488,152","Market Cap":"88,995,471,360","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":18.114477,"PB Ratio":4.426548,"Previous Close":88.58,"ROE":0.22188,"DTE":65.718,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.436,"Trailing PEG":1.468,"Trailing PE":21.236843,"Trailing PS":2.8291152,"Quick Ratio":0.261,"Day High":89.02,"Day Low":86.0,"VS Average Volume":0.6526824291,"Company Summary":"PayPal Holdings, Inc. operates a technology platform that enables digital payments on behalf of merchants and consumers worldwide. It operates a two-sided network at scale that connects merchants and consumers that enables its customers to connect, transact, and send and receive payments through online and in person, as well as transfer and withdraw funds using various funding sources, such as bank accounts, PayPal or Venmo account balance, PayPal and Venmo branded credit products comprising its installment products, credit and debit cards, and cryptocurrencies, as well as other stored value products, including gift cards and eligible rewards. The company provides payment solutions under the PayPal, PayPal Credit, Braintree, Venmo, Xoom, Zettle, Hyperwallet, Honey, and Paidy names. The company was founded in 1998 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 20:02:24"},{"Company Name":"Advanced Micro Devices, Inc.","Symbol":"AMD","Current Price":"113.37","Latest MA":"144.11","Price Target":168.42233,"Difference from MA":"-21.33%","Difference from Open":"-0.24%","Change from Yesterday":"-2.35%","Change from Last Report":"-0.08","Latest Volume":"19,471,256","Market Cap":"183,982,522,368","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":22.97647,"PB Ratio":3.2289824,"Previous Close":115.95,"ROE":0.03262,"DTE":3.927,"Industry":"Semiconductors","Sector":"Technology","Beta":1.706,"Trailing PEG":0.3206,"Trailing PE":101.225716,"Trailing PS":7.5728555,"Quick Ratio":1.575,"Day High":115.16,"Day Low":112.98,"VS Average Volume":0.5393655647,"Company Summary":"Advanced Micro Devices, Inc. operates as a semiconductor company worldwide. It operates through Data Center, Client, Gaming, and Embedded segments. The company offers x86 microprocessors and graphics processing units (GPUs) as an accelerated processing unit, chipsets, data center, and professional GPUs; and embedded processors, and semi-custom system-on-chip (SoC) products, microprocessor and SoC development services and technology, data processing unites, field programmable gate arrays (FPGA), and adaptive SoC products. It provides processors under the AMD Ryzen, AMD Ryzen PRO, Ryzen Threadripper, Ryzen Threadripper PRO, AMD Athlon, AMD Athlon PRO, and AMD PRO A-Series brand names; graphics under the AMD Radeon graphics and AMD Embedded Radeon graphics; and professional graphics under the AMD Radeon Pro graphics brand name. In addition, the company offers data center graphics under the Radeon Instinct and Radeon PRO V-series brands, as well as servers under the AMD Instinct accelerators brand; server microprocessors under the AMD EPYC brands; low power solutions under the AMD Athlon, AMD Geode, AMD Ryzen, AMD EPYC, AMD R-Series, and G-Series brands; FPGA products under the Virtex-6, Virtex-7, Virtex UltraScale+, Kintex-7, Kintex UltraScale, Kintex UltraScale+, Artix-7, Artix UltraScale+, Spartan-6, and Spartan-7 brands; adaptive SOCs under the Zynq-7000, Zynq UltraScale+ MPSoC, Zynq UltraScale+ RFSoCs, Versal HBM, Versal Premium, Versal Prime, Versal AI Core, Versal AI Edge, Vitis, and Vivado brands; and compute and network acceleration board products under the Alveo brand. It serves original equipment and design manufacturers, public cloud service providers, system integrators, independent distributors, and add-in-board manufacturers through its direct sales force, and sales representatives. Advanced Micro Devices, Inc. was incorporated in 1969 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 20:02:24"},{"Company Name":"Amcor plc","Symbol":"AMCR","Current Price":"9.49","Latest MA":"10.27","Price Target":11.29556,"Difference from MA":"-7.63%","Difference from Open":"-1.04%","Change from Yesterday":"-2.42%","Change from Last Report":"-0.47","Latest Volume":"13,810,193","Market Cap":"13,716,276,224","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":11.953345,"PB Ratio":3.4979725,"Previous Close":9.72,"ROE":0.1958,"DTE":196.619,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":0.863,"Trailing PEG":1.9257,"Trailing PE":17.90566,"Trailing PS":1.0122713,"Quick Ratio":0.591,"Day High":9.61,"Day Low":9.4,"VS Average Volume":0.8706584084,"Company Summary":"Amcor plc develops, produces, and sells packaging products in Europe, North America, Latin America, and the Asia Pacific. The company operates in two segments, Flexibles and Rigid Packaging. The Flexibles segment offers flexible and film packaging products in the food and beverage, medical and pharmaceutical, fresh produce, snack food, personal care, and other industries. The Rigid Packaging segment provides rigid containers for various beverage and food products, including carbonated soft drinks, water, juices, sports drinks, milk-based beverages, spirits and beer, sauces, dressings, spreads, and personal care items; and plastic caps for various applications. It sells its products through its direct sales force. The company was incorporated in 1926 and is headquartered in Zurich, Switzerland.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 20:02:24"},{"Company Name":"Electronic Arts Inc.","Symbol":"EA","Current Price":"122.67","Latest MA":"147.04","Price Target":148.46455,"Difference from MA":"-16.58%","Difference from Open":"0.52%","Change from Yesterday":"-0.20%","Change from Last Report":"-0.20","Latest Volume":"2,202,841","Market Cap":"32,173,027,328","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":15.36444,"PB Ratio":4.3575716,"Previous Close":122.91,"ROE":0.13962,"DTE":29.954,"Industry":"Electronic Gaming & Multimedia","Sector":"Communication Services","Beta":0.781,"Trailing PEG":1.943,"Trailing PE":31.453844,"Trailing PS":4.342425,"Quick Ratio":1.283,"Day High":123.48,"Day Low":120.5761,"VS Average Volume":0.8204292313,"Company Summary":"Electronic Arts Inc. develops, markets, publishes, and delivers games, content, and services for game consoles, PCs, mobile phones, and tablets worldwide. It develops and publishes games and services across various genres, such as sports, racing, first-person shooter, action, role-playing, and simulation through owned and licensed brands, such as EA SPORTS FC, Battlefield, Apex Legends, The Sims, Madden NFL, Need for Speed, Titanfall, and F1 brands. The company licenses its games to third parties to distribute and host its games and content. It markets and sells its games and services through digital distribution and retail channels, as well as directly to mass market retailers, specialty stores, and distribution arrangements. Electronic Arts Inc. was incorporated in 1982 and is headquartered in Redwood City, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 20:02:24"},{"Company Name":"Snap Inc.","Symbol":"SNAP","Current Price":"11.07","Latest MA":"11.39","Price Target":13.142,"Difference from MA":"-2.75%","Difference from Open":"0.68%","Change from Yesterday":"-2.13%","Change from Last Report":"-0.23","Latest Volume":"13,163,812","Market Cap":"18,575,099,904","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":27.159252,"PB Ratio":8.377458,"Previous Close":11.29,"ROE":-0.4062,"DTE":191.874,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":0.995,"Trailing PEG":496.0591,"Trailing PE":"N\/A","Trailing PS":3.5960608,"Quick Ratio":3.861,"Day High":11.3,"Day Low":10.955,"VS Average Volume":0.4689472778,"Company Summary":"Snap Inc. operates as a technology company in North America, Europe, and internationally. The company offers Snapchat, a visual messaging application with various tabs, such as camera, visual messaging, snap map, stories, and spotlight that enable people to communicate visually through short videos and images. It also provides Spectacles, an eyewear product that connects with Snapchat and captures photos and video from a human perspective; and advertising products, including AR ads and Snap ads comprises a single image or video ads, collection ads, dynamic ads, story ads, and commercials. The company was formerly known as Snapchat, Inc. and changed its name to Snap Inc. in September 2016. Snap Inc. was founded in 2010 and is headquartered in Santa Monica, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"03-02-2025 20:02:24"},{"Company Name":"KKR & Co. Inc.","Symbol":"KKR","Current Price":"163.51","Latest MA":"135.51","Price Target":171.66946,"Difference from MA":"20.66%","Difference from Open":"0.93%","Change from Yesterday":"-2.40%","Change from Last Report":"-0.12","Latest Volume":"2,123,862","Market Cap":"150,886,694,912","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":26.906366,"PB Ratio":6.0251303,"Previous Close":167.07,"ROE":0.08284,"DTE":83.045,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.606,"Trailing PEG":0.7446,"Trailing PE":50.7795,"Trailing PS":5.424394,"Quick Ratio":0.792,"Day High":164.1,"Day Low":159.39,"VS Average Volume":0.6187561727,"Company Summary":"KKR & Co. Inc. is a private equity and real estate investment firm specializing in direct and fund of fund investments. It specializes in acquisitions, leveraged buyouts, management buyouts, credit special situations, growth equity, mature, mezzanine, distressed, turnaround, lower middle market, and middle market investments. The firm considers investments in all industries with a focus on software, security, semiconductors, consumer electronics, internet of things (iot), internet, information services, information technology infrastructure, financial technology, network and cyber security architecture, engineering and operations, content, technology and hardware, energy and infrastructure, real estate, services industry with a focus on business services, intelligence, industry-leading franchises and companies in natural resource, containers and packaging, agriculture, airports, ports, forestry, electric utilities, textiles, apparel and luxury goods, household durables, digital media, insurance, brokerage houses, non-durable goods distribution, supermarket retailing, grocery stores, food, beverage, and tobacco, hospitals, entertainment venues and production companies, publishing, printing services, capital goods, financial services, specialized finance, pipelines, and renewable energy. In energy and infrastructure, it focuses on the upstream oil and gas and equipment, minerals and royalties and services verticals. In real estate, the firm seeks to invest in private and public real estate securities including property-level equity, debt and special situations transactions and businesses with significant real estate holdings, and oil and natural gas properties. The firm also invests in asset services sector that encompasses a broad array of B2B, B2C and B2G services verticals including asset-based, transport, logistics, leisure\/hospitality, resource and utility support, infra-like, mission-critical, and environmental services. Within Americas, the firm prefers to invest in consumer products; chemicals, metals and mining; energy and natural resources; financial services; healthcare; industrials; media and communications; retail; and technology. Within Europe, the firm invests in consumer and retail; energy; financial services; health care; industrials and chemicals; media and digital; and telecom and technologies. Within Asia, it invests in consumer products; energy and resources; financial services; healthcare; industrials; logistics; media and telecom; retail; real estate; and technology. It also seeks to make impact investments focused on identifying and investing behind businesses with positive social or environmental impact. The firm seeks to invest in mid to high-end residential developments but can invest in other projects throughout Mainland China through outright ownership, joint ventures, and merger. It invests globally with a focus on Australia, emerging and developed Asia, Middle East and Africa, Nordic, Southeast Asia, Asia Pacific, Ireland, Hong Kong, Japan, Taiwan, India, Vietnam, Malaysia, Singapore, Indonesia, France, Germany, Netherlands, United Kingdom, Caribbean, Mexico, South America, North America, Brazil, Latin America, Korea with a focus on South Korea, and United States of America. In the United States and Europe, the firm focuses on buyouts of large, publicly traded companies. For middle market it seeks to invest in companies with enterprise values between $200 million to $1000 million. The firm prefers to invest in a range of debt and public equity investing and may co-invest. It seeks a board seat in its portfolio companies and a controlling ownership of a company or a strategic minority position. The firm may acquire majority and minority equity interests, particularly when making private equity investments in Asia or sponsoring investments as part of a large investor consortium. The firm typically holds its investment for a period of five to seven years and more and exits through initial public offerings, secondary offerings, and sales to strategic buyers. KKR & Co. Inc. was founded in 1976 and is based in New York, New York with additional offices across North America, Europe, Australia and Asia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 20:02:24"},{"Company Name":"Chipotle Mexican Grill, Inc.","Symbol":"CMG","Current Price":"58.29","Latest MA":"57.84","Price Target":66.30719,"Difference from MA":"0.78%","Difference from Open":"3.42%","Change from Yesterday":"-0.25%","Change from Last Report":"-0.04","Latest Volume":"5,718,051","Market Cap":"79,425,372,160","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":44.082283,"PB Ratio":21.996225,"Previous Close":58.35,"ROE":0.45673,"DTE":124.061,"Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":1.266,"Trailing PEG":2.0285,"Trailing PE":53.97222,"Trailing PS":7.230438,"Quick Ratio":1.486,"Day High":58.57,"Day Low":56.61,"VS Average Volume":0.6529901956,"Company Summary":"Chipotle Mexican Grill, Inc., together with its subsidiaries, owns and operates Chipotle Mexican Grill restaurants. It sells food and beverages through offering burritos, burrito bowls, quesadillas, tacos, and salads. The company also provides delivery and related services its app and website. It has operations in the United States, Canada, France, Germany, Dubai, and the United Kingdom. Chipotle Mexican Grill, Inc. was founded in 1993 and is headquartered in Newport Beach, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 20:02:24"},{"Company Name":"Fox Corporation","Symbol":"FOXA","Current Price":"51.92","Latest MA":"42.83","Price Target":49.61368,"Difference from MA":"21.23%","Difference from Open":"2.57%","Change from Yesterday":"1.35%","Change from Last Report":"-0.02","Latest Volume":"3,193,158","Market Cap":"23,097,131,008","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":13.415951,"PB Ratio":2.108084,"Previous Close":51.18,"ROE":0.17711,"DTE":70.271,"Industry":"Entertainment","Sector":"Communication Services","Beta":0.77,"Trailing PEG":9.2785,"Trailing PE":12.694376,"Trailing PS":1.6110156,"Quick Ratio":2.243,"Day High":52.135,"Day Low":50.58,"VS Average Volume":0.8377792733,"Company Summary":"Fox Corporation operates as a news, sports, and entertainment company in the United States (U.S.). The company operates through four segments: Cable Network Programming, Television, Credible, and The FOX Studio Lot. The Cable Network Programming segment produces and licenses news and sports content for distribution through traditional cable television systems, direct broadcast satellite operators and telecommunication companies, virtual multi-channel video programming distributors, and other digital platforms primarily in the U.S. Television segment produces, acquires, markets, and distributes programming through the FOX broadcast network, advertising supported video-on-demand service Tubi, and operates power broadcast television stations including duopolies and other digital platform; and produces content for third parties. The Credible segment engages in the consumer finance marketplace. The FOX Studio Lot segment provides television and film production services along with office space, studio operation services and includes all operations of the facility. The company was incorporated in 2018 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 20:02:24"},{"Company Name":"Mondelez International, Inc.","Symbol":"MDLZ","Current Price":"57.55","Latest MA":"66.07","Price Target":71.4844,"Difference from MA":"-12.89%","Difference from Open":"-0.50%","Change from Yesterday":"-0.84%","Change from Last Report":"-0.12","Latest Volume":"3,112,037","Market Cap":"76,955,287,552","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":17.611506,"PB Ratio":2.762842,"Previous Close":57.99,"ROE":0.13552,"DTE":73.232,"Industry":"Confectioners","Sector":"Consumer Defensive","Beta":0.561,"Trailing PEG":4.8598,"Trailing PE":20.407803,"Trailing PS":2.1287181,"Quick Ratio":0.295,"Day High":57.99,"Day Low":56.85,"VS Average Volume":0.3345574853,"Company Summary":"Mondelez International, Inc., through its subsidiaries, manufactures, markets, and sells snack food and beverage products in the Latin America, North America, Asia, the Middle East, Africa, and Europe. It provides biscuits and baked snacks, including cookies, crackers, salted snacks, snack bars, and cakes and pastries; chocolates; and gums and candies, as well as various cheese and grocery, and powdered beverage products. The company's brand portfolio includes Oreo, Ritz, LU, CLIF Bar, and Tate's Bake Shop biscuits and baked snacks, as well as Cadbury Dairy Milk, Milka, and Toblerone chocolate. It serves supermarket chains, wholesalers, supercenters, club stores, mass merchandisers, distributors, convenience stores, gasoline stations, drug stores, value stores, and other retail food outlets through direct store delivery, company-owned and satellite warehouses, distribution centers, third party distributors, and other facilities, as well as through independent sales offices and agents. The company also sells products directly to businesses and consumers through e-retail platforms, retailer digital platforms, as well as through its direct-to-consumer websites and social media platforms. Mondelez International, Inc. was formerly known as Kraft Foods Inc. and changed its name to Mondelez International, Inc. in October 2012. The company was incorporated in 2000 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 20:02:24"},{"Company Name":"Merck & Company, Inc.","Symbol":"MRK","Current Price":"98.92","Latest MA":"108.33","Price Target":123.96542,"Difference from MA":"-8.68%","Difference from Open":"0.81%","Change from Yesterday":"0.08%","Change from Last Report":"-0.08","Latest Volume":"4,650,194","Market Cap":"250,244,644,864","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":10.685192,"PB Ratio":5.6284137,"Previous Close":98.82,"ROE":0.28332,"DTE":85.572,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.411,"Trailing PEG":0.0697,"Trailing PE":20.695606,"Trailing PS":3.9611967,"Quick Ratio":0.917,"Day High":99.5699,"Day Low":98.0,"VS Average Volume":0.4015600605,"Company Summary":"Merck & Co., Inc. operates as a healthcare company worldwide. It operates through two segments, Pharmaceutical and Animal Health. The Pharmaceutical segment offers human health pharmaceutical products in the areas of oncology, hospital acute care, immunology, neuroscience, virology, cardiovascular, and diabetes under the Keytruda, Bridion, Adempas, Lagevrio, Belsomra, Simponi, and Januvia brands, as well as vaccine products consisting of preventive pediatric, adolescent, and adult vaccines under the Gardasil\/Gardasil 9, ProQuad, M-M-R II, Varivax, RotaTeq, Live Oral, Vaxneuvance, Pneumovax 23, and Vaqta names. The Animal Health segment discovers, develops, manufactures, and markets veterinary pharmaceuticals, vaccines, and health management solutions and services, as well as digitally connected identification, traceability, and monitoring products. vIt has development and commercialization agreement for three of Daiichi Sankyo's deruxtecan ADC candidates, which include patritumab deruxtecan, ifinatamab deruxtecan, and raludotatug deruxtecan for the treatment of multiple solid tumors both as monotherapy and\/or in combination with other treatments; and AstraZeneca PLC to co-development and co-commercialize AstraZeneca's Lynparza products for multiple cancer types, and Koselugo for multiple indications. It also has licensed to develop, manufacture and  commercialize LM-299, a novel investigational PD-1\/VEGF bispecific antibody from LaNova. The company also has a collaboration agreement with Eisai Co., Ltd., Bayer AG, and Ridgeback Biotherapeutics LP, as well Moderna, Inc. Merck & Co., Inc. was founded in 1891 and is headquartered in Rahway, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 20:02:24"},{"Company Name":"CNH Industrial N.V.","Symbol":"CNH","Current Price":"12.52","Latest MA":"10.97","Price Target":14.19474,"Difference from MA":"14.05%","Difference from Open":"0.60%","Change from Yesterday":"-2.87%","Change from Last Report":"-0.16","Latest Volume":"12,786,130","Market Cap":"15,630,985,216","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":14.835935,"PB Ratio":2.045269,"Previous Close":12.88,"ROE":0.22186,"DTE":356.262,"Industry":"Farm & Heavy Construction Machinery","Sector":"Industrials","Beta":1.597,"Trailing PEG":null,"Trailing PE":9.202206,"Trailing PS":0.7185999,"Quick Ratio":3.87,"Day High":12.66,"Day Low":12.23,"VS Average Volume":1.0408670059,"Company Summary":"CNH Industrial N.V., an equipment and services company, engages in the design, production, marketing, sale, and financing of agricultural and construction equipment in North America, Europe, the Middle East, Africa, South America, and the Asia Pacific. The company operates through three segments: Agriculture, Construction, and Financial Services. The Agriculture segment designs, manufactures, and distributes farm machinery and implements, including two-wheel and four-wheel drive tractors, crawler tractors, combines, grape and sugar cane harvesters, hay and forage equipment, planting and seeding equipment, soil preparation and cultivation implements, material handling equipment, and precision agriculture technology. This segment sells its agricultural equipment under the New Holland Agriculture and Case IH brands. The Construction segment designs, manufactures, and distributes construction equipment comprising excavators, crawler dozers, graders, wheel loaders, backhoe loaders, skid steer loaders, and compact track loaders under the CASE Construction Equipment, New Holland Construction, and Eurocomach brands. The Financial Services segment offers financing to end-use customers for the purchase of new and used agricultural and construction equipment and components, as well as revolving charge account financing and other financial services. It also provides wholesale financing to CNH Industrial brand dealers and distributors; trade receivables factoring services to CNH companies; and financial services to Iveco Group companies in the North America, South America, and Asia Pacific regions. The company was founded in 1842 and is headquartered in Basildon, the United Kingdom.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 20:02:24"}]