[{"Company Name":"Texas Instruments Incorporated","Symbol":"TXN","Current Price":"185.50","Latest MA":"198.25","Price Target":206.45241,"Difference from MA":"-6.43%","Difference from Open":"-2.37%","Change from Yesterday":"-7.53%","Change from Last Report":"0.15","Latest Volume":"8,985,772","Market Cap":"169,216,720,896","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":25.262293,"PB Ratio":9.797216,"ROE":0.29293,"DTE":84.399,"Industry":"Semiconductors","Sector":"Technology","Beta":0.98,"Trailing PEG":3.2176,"Trailing PE":34.47965,"Trailing PS":10.770589,"Quick Ratio":3.048,"Day High":191.49,"Day Low":185.03,"VS Average Volume":1.5488282832,"Company Summary":"Texas Instruments Incorporated designs, manufactures, and sells semiconductors to electronics designers and manufacturers in the United States and internationally. The company operates through Analog and Embedded Processing segments. The Analog segment offers power products to manage power requirements across various voltage levels, including battery-management solutions, DC\/DC switching regulators, AC\/DC and isolated controllers and converters, power switches, linear regulators, voltage references, and lighting products. This segment provides signal chain products that sense, condition, and measure signals to allow information to be transferred or converted for further processing and control, including amplifiers, data converters, interface products, motor drives, clocks, and logic and sensing products. The Embedded Processing segment offers microcontrollers that are used in electronic equipment; digital signal processors for mathematical computations; and applications processors for specific computing activity. This segment offers products for use in various markets, such as industrial, automotive, personal electronics, communications equipment, enterprise systems, and calculators and other. It provides DLP products primarily for use in project high-definition images; calculators; and application-specific integrated circuits. The company markets and sells its semiconductor products through direct sales and distributors, as well as through its website. Texas Instruments Incorporated was founded in 1930 and is headquartered in Dallas, Texas.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Verizon Communications Inc.","Symbol":"VZ","Current Price":"39.78","Latest MA":"40.54","Price Target":47.1625,"Difference from MA":"-1.88%","Difference from Open":"-0.82%","Change from Yesterday":"1.51%","Change from Last Report":"0.09","Latest Volume":"23,819,892","Market Cap":"167,458,242,560","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.114634,"PB Ratio":1.7384757,"ROE":0.10431,"DTE":182.615,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.418,"Trailing PEG":1.0397,"Trailing PE":17.220694,"Trailing PS":1.247482,"Quick Ratio":0.51,"Day High":40.68,"Day Low":39.37,"VS Average Volume":1.2439432951,"Company Summary":"Verizon Communications Inc., through its subsidiaries, engages in the provision of communications, technology, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide. It operates in two segments, Verizon Consumer Group (Consumer) and Verizon Business Group (Business). The Consumer segment provides wireless services across the wireless networks in the United States under the Verizon and TracFone brands and through wholesale and other arrangements; and fixed wireless access (FWA) broadband through its wireless networks, as well as related equipment and devices, such as smartphones, tablets, smart watches, and other wireless-enabled connected devices. The segment also offers wireline services in the Mid-Atlantic and Northeastern United States, as well as Washington D.C. through its fiber-optic network, Verizon Fios product portfolio, and a copper-based network. The Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and conferencing, corporate networking, security and managed network, local and long-distance voice, and network access services to deliver various IoT services and products to businesses, government customers, and wireless and wireline carriers in the United States and internationally. The company was formerly known as Bell Atlantic Corporation and changed its name to Verizon Communications Inc. in June 2000. Verizon Communications Inc. was incorporated in 1983 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"HCA Healthcare, Inc.","Symbol":"HCA","Current Price":"314.80","Latest MA":"351.10","Price Target":388.52695,"Difference from MA":"-10.34%","Difference from Open":"-2.82%","Change from Yesterday":"-3.19%","Change from Last Report":"-0.05","Latest Volume":"2,003,031","Market Cap":"79,736,627,200","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":11.690844,"PB Ratio":"N\/A","ROE":11.954511,"DTE":5711.069,"Industry":"Medical Care Facilities","Sector":"Healthcare","Beta":1.689,"Trailing PEG":1.0494,"Trailing PE":14.14809,"Trailing PS":1.1452956,"Quick Ratio":0.866,"Day High":325.975,"Day Low":309.0,"VS Average Volume":1.3077346443,"Company Summary":"HCA Healthcare, Inc., through its subsidiaries, owns and operates hospitals and related healthcare entities in the United States. It operates general and acute care hospitals that offers medical and surgical services, including inpatient care, intensive care, cardiac care, diagnostic, and emergency services; and outpatient services, such as outpatient surgery, laboratory, radiology, respiratory therapy, cardiology, and physical therapy. The company also operates outpatient health care facilities consisting of freestanding ambulatory surgery centers, freestanding emergency care facilities, urgent care facilities, walk-in clinics, diagnostic and imaging centers, rehabilitation and physical therapy centers, radiation and oncology therapy centers, physician practices, and various other facilities. In addition, it operates behavioral hospitals, which provide therapeutic programs comprising child, adolescent and adult psychiatric care, adolescent and adult alcohol, drug abuse treatment, and counseling services. The company was formerly known as HCA Holdings, Inc. HCA Healthcare, Inc. was founded in 1968 and is headquartered in Nashville, Tennessee.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"NextEra Energy, Inc.","Symbol":"NEE","Current Price":"72.53","Latest MA":"76.31","Price Target":85.23636,"Difference from MA":"-4.94%","Difference from Open":"6.51%","Change from Yesterday":"4.77%","Change from Last Report":"-0.01","Latest Volume":"12,812,553","Market Cap":"149,160,984,576","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":18.085506,"PB Ratio":2.9801965,"ROE":0.09887999,"DTE":139.015,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.561,"Trailing PEG":2.8193,"Trailing PE":21.52374,"Trailing PS":5.683189,"Quick Ratio":0.258,"Day High":73.25,"Day Low":68.0,"VS Average Volume":1.1913962623,"Company Summary":"NextEra Energy, Inc., through its subsidiaries, generates, transmits, distributes, and sells electric power to retail and wholesale customers in North America. The company generates electricity through wind, solar, nuclear,natural gas, and other clean energy. It also develops, constructs, and operates long-term contracted assets that consists of clean energy solutions, such as renewable generation facilities, battery storage projects, and electric transmission facilities; sells energy commodities; and owns, develops, constructs, manages and operates electric generation facilities in wholesale energy markets. The company had approximately 33,276 megawatts of net generating capacity; approximately 90,000 circuit miles of transmission and distribution lines; and 883 substations. It serves approximately 12 million people through approximately 5.9 million customer accounts in the east and lower west coasts of Florida. The company was formerly known as FPL Group, Inc. and changed its name to NextEra Energy, Inc. in 2010. NextEra Energy, Inc. was founded in 1925 and is headquartered in Juno Beach, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Columbia Banking System, Inc.","Symbol":"COLB","Current Price":"28.13","Latest MA":"25.73","Price Target":33.36364,"Difference from MA":"9.31%","Difference from Open":"1.26%","Change from Yesterday":"-0.07%","Change from Last Report":"0.09","Latest Volume":"1,011,334","Market Cap":"5,894,107,136","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":9.583021,"PB Ratio":1.1176003,"ROE":0.09771,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.849,"Trailing PEG":null,"Trailing PE":12.125,"Trailing PS":3.2229898,"Quick Ratio":"N\/A","Day High":28.53,"Day Low":27.16,"VS Average Volume":0.6675414666,"Company Summary":"Columbia Banking System, Inc. operates as the holding company of Umpqua Bank that provides banking, private banking, mortgage, and other financial services in the United States. The company offers deposit products, including business, non-interest bearing checking, interest-bearing checking and savings, money market, and certificate of deposit accounts; and insured cash sweep and other investment sweep solutions. It also provides commercial lending products, such as commercial lines of credit and term loans, accounts receivable and inventory financing, international trade finance, commercial property loans, multifamily loans, equipment loans, commercial equipment leases, real estate construction loans and permanent financing, and small business administration program financing, as well as capital markets. In addition, the company offers wealth management comprising financial planning, investment, trust, and insurance; treasury management, which includes digital and mobile banking solutions, ACH, wires, positive pay, remote deposit capture, integrated payments, integrated receivables, lockbox, cash vault, real-time payments, commercial card, and foreign exchange and international banking related products, as well as merchant services; and brokerage services, residential real estate loans and consumer loans. It serves its products to corporate, institutional, small business, and individual customers. The company was founded in 1953 and is headquartered in Tacoma, Washington.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"East West Bancorp, Inc.","Symbol":"EWBC","Current Price":"102.39","Latest MA":"88.89","Price Target":116.41667,"Difference from MA":"15.19%","Difference from Open":"1.87%","Change from Yesterday":"-1.07%","Change from Last Report":"0.08","Latest Volume":"1,061,833","Market Cap":"14,194,222,080","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":10.554756,"PB Ratio":1.851671,"ROE":0.15587,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.265,"Trailing PEG":null,"Trailing PE":12.291717,"Trailing PS":5.880425,"Quick Ratio":"N\/A","Day High":103.05,"Day Low":99.25,"VS Average Volume":1.1764706534,"Company Summary":"East West Bancorp, Inc. operates as the bank holding company for East West Bank that provides a range of personal and commercial banking services to businesses and individuals in the United States. The company operates through three segments: Consumer and Business Banking, Commercial Banking, and Other. It accepts various deposit products, such as personal and business checking and savings accounts, money market, and time deposits. The company's loan products include mortgage and home equity, commercial and residential real estate, working capital lines of credit, construction finance, trade finance, letters of credit, commercial business, affordable housing loans, asset-based lending, asset-backed finance, project finance, loan syndication, and equipment financing, as well as financing services for clients to facilitate their business transactions between the United States and Asia. It also provides various wealth management, treasury management, foreign exchange, and interest rate and commodity risk hedging services; and mobile and online banking services. The company was founded in 1973 and is headquartered in Pasadena, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"American Airlines Group, Inc.","Symbol":"AAL","Current Price":"17.12","Latest MA":"12.95","Price Target":20.24273,"Difference from MA":"32.21%","Difference from Open":"1.64%","Change from Yesterday":"0.54%","Change from Last Report":"-0.08","Latest Volume":"25,768,789","Market Cap":"11,258,384,384","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":5.4386826,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Airlines","Sector":"Industrials","Beta":1.399,"Trailing PEG":0.2073,"Trailing PE":13.8075,"Trailing PS":0.20999356,"Quick Ratio":0.422,"Day High":17.335,"Day Low":16.555,"VS Average Volume":0.9464551532,"Company Summary":"American Airlines Group Inc., through its subsidiaries, operates as a network air carrier. The company provides scheduled air transportation services for passengers and cargo through its hubs in Charlotte, Chicago, Dallas\/Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix, and Washington, D.C., as well as through partner gateways in London, Doha, Madrid, Seattle\/Tacoma, Sydney, and Tokyo. It operates a mainline fleet of 965 aircraft. The company was formerly known as AMR Corporation and changed its name to American Airlines Group Inc. in December 2013. American Airlines Group Inc. was founded in 1926 and is headquartered in Fort Worth, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Alaska Air Group, Inc.","Symbol":"ALK","Current Price":"69.97","Latest MA":"47.21","Price Target":86.02929,"Difference from MA":"48.19%","Difference from Open":"0.97%","Change from Yesterday":"1.62%","Change from Last Report":"0.03","Latest Volume":"1,409,743","Market Cap":"8,614,020,096","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":8.899814,"PB Ratio":1.970179,"ROE":0.07513,"DTE":137.129,"Industry":"Airlines","Sector":"Industrials","Beta":1.593,"Trailing PEG":null,"Trailing PE":22.715908,"Trailing PS":0.80100614,"Quick Ratio":0.483,"Day High":70.12,"Day Low":67.45,"VS Average Volume":0.5258286762,"Company Summary":"Alaska Air Group, Inc., through its subsidiaries, operates airlines. It operates through three segments: Mainline, Regional, and Horizon. The company offers scheduled air transportation services on Boeing jet aircraft for passengers and cargo in the United States, and in parts of Canada, Mexico, Costa Rica, Belize, Guatemala, and the Bahamas; and for passengers across a shorter distance network within the United States, Canada, and Mexico. Alaska Air Group, Inc. was founded in 1932 and is based in Seattle, Washington.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Intuitive Surgical, Inc.","Symbol":"ISRG","Current Price":"584.61","Latest MA":"497.78","Price Target":623.8661,"Difference from MA":"17.44%","Difference from Open":"0.71%","Change from Yesterday":"-3.95%","Change from Last Report":"-0.10","Latest Volume":"2,995,678","Market Cap":"208,225,812,480","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":62.019356,"PB Ratio":13.36282,"ROE":0.15973,"DTE":"N\/A","Industry":"Medical Instruments & Supplies","Sector":"Healthcare","Beta":1.389,"Trailing PEG":4.4985,"Trailing PE":91.488266,"Trailing PS":26.468597,"Quick Ratio":3.293,"Day High":591.91,"Day Low":573.32,"VS Average Volume":2.1125810815,"Company Summary":"Intuitive Surgical, Inc. develops, manufactures, and markets products that enable physicians and healthcare providers to enhance the quality of and access to minimally invasive care in the United States and internationally. The company offers the da Vinci Surgical System that enables complex surgery using a minimally invasive approach; and Ion endoluminal system, which extends its commercial offerings beyond surgery into diagnostic procedures enabling minimally invasive biopsies in the lung. It also provides a suite of stapling, energy, and core instrumentation for its multi-port da Vinci surgical systems; progressive learning pathways to support the use of its technology; infrastructure of service and support specialists, a complement of services to its customers, including installation, repair, maintenance, 24\/7 technical support, and proactive system health monitoring; and integrated digital capabilities providing connected offerings, streamlining performance for hospitals with program-enhancing insights. The company sells its products through direct sales organizations, such as capital and clinical sales teams. It has a collaboration agreement with FluoGuide A\/S for head & neck cancer. The company was incorporated in 1995 and is headquartered in Sunnyvale, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"American Express Company","Symbol":"AXP","Current Price":"318.55","Latest MA":"269.45","Price Target":304.3844,"Difference from MA":"18.22%","Difference from Open":"-1.80%","Change from Yesterday":"-2.22%","Change from Last Report":"0.06","Latest Volume":"3,781,051","Market Cap":"224,400,949,248","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":18.335764,"PB Ratio":7.5491147,"ROE":0.3469,"DTE":186.815,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.214,"Trailing PEG":2.0628,"Trailing PE":23.44003,"Trailing PS":3.7880611,"Quick Ratio":1.619,"Day High":324.4,"Day Low":313.74,"VS Average Volume":1.5379997974,"Company Summary":"American Express Company, together with its subsidiaries, operates as integrated payments company in the United States, Europe, the Middle East and Africa, the Asia Pacific, Australia, New Zealand, Latin America, Canada, the Caribbean, and Internationally. It operates through four segments: U.S. Consumer Services, Commercial Services, International Card Services, and Global Merchant and Network Services. The company's products and services include credit card, charge card, banking, and other payment and financing products; network services; expense management products and services; and travel and lifestyle services. It also provides merchant acquisition and processing, servicing and settlement, point-of-sale marketing, and information products and services for merchants; and fraud prevention services, as well as the design and operation of customer loyalty programs. In addition, the company operates lounges at airports under Centurion Lounge brand name. It sells its products and services to consumers, small businesses, mid-sized companies, and large corporations through mobile and online applications, affiliate marketing, customer referral programs, third-party service providers and business partners, direct mail, telephone, in-house sales teams, and direct response advertising. American Express Company was founded in 1850 and is headquartered in New York, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"McCormick & Company, Incorporat","Symbol":"MKC","Current Price":"75.26","Latest MA":"76.74","Price Target":83.78188,"Difference from MA":"-1.93%","Difference from Open":"1.57%","Change from Yesterday":"0.66%","Change from Last Report":"0.00","Latest Volume":"1,176,370","Market Cap":"20,177,207,296","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":22.591307,"PB Ratio":3.7251897,"ROE":0.15067,"DTE":84.828,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.764,"Trailing PEG":2.4699,"Trailing PE":25.773973,"Trailing PS":3.0212185,"Quick Ratio":0.274,"Day High":75.304,"Day Low":74.1,"VS Average Volume":0.657640005,"Company Summary":"McCormick & Company, Incorporated manufactures, markets, and distributes spices, seasoning mixes, condiments, and other flavorful products to the food industry. It operates in two segments, Consumer and Flavor Solutions. The Consumer segment offers spices, herbs, and seasonings, as well as condiments and sauces, and desserts. This segment markets its products under the McCormick, French's, Frank's RedHot, Lawry's, Cholula Hot Sauce, Gourmet Garden, Club House, and OLD BAY brands in the Americas; Ducros, Schwartz, Kamis, LA Drogheria, and Vahiné brands in Europe, the Middle East, and Africa; McCormick and DaQiao brands in the Asia\/Pacific; McCormick, Aeroplane, and Gourmet Garden brands in China; and the McCormick brand and other brands in Australia, as well as markets regional and ethnic brands, such as Zatarain's, Stubb's, Thai Kitchen, and Simply Asia. It also supplies its products under the private labels. This segment serves retailers comprising grocery, mass merchandise, warehouse clubs, discount and drug stores, and e-commerce retailers directly and indirectly through distributors and wholesale foodservice suppliers. The Flavor Solutions segment offers seasoning blends, spices and herbs, condiments, coating systems, and compound flavors to multinational food manufacturers and foodservice customers. It serves foodservice customers directly and indirectly through distributors. The company was founded in 1889 and is headquartered in Hunt Valley, Maryland.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Union Pacific Corporation","Symbol":"UNP","Current Price":"250.13","Latest MA":"236.83","Price Target":261.74854,"Difference from MA":"5.62%","Difference from Open":"1.07%","Change from Yesterday":"0.84%","Change from Last Report":"0.02","Latest Volume":"2,173,573","Market Cap":"151,643,078,656","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":18.513817,"PB Ratio":9.153889,"ROE":0.43396,"DTE":197.154,"Industry":"Railroads","Sector":"Industrials","Beta":1.056,"Trailing PEG":2.5947,"Trailing PE":22.554554,"Trailing PS":6.2435393,"Quick Ratio":0.56,"Day High":250.32,"Day Low":245.76,"VS Average Volume":0.8113858984,"Company Summary":"Union Pacific Corporation, through its subsidiary, Union Pacific Railroad Company, operates in the railroad business in the United States. The company offers transportation services for grain and grain products, fertilizers, food and refrigerated products, and coal and renewables to grain processors, animal feeders, ethanol producers, renewable biofuel producers, and other agricultural users; and construction products, industrial chemicals, plastics, forest products, specialized products, metals and ores, petroleum, liquid petroleum gases, soda ash, and sand, as well as finished automobiles, automotive parts, and merchandise in intermodal containers. Union Pacific Corporation was founded in 1862 and is headquartered in Omaha, Nebraska.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"SLM Corporation","Symbol":"SLM","Current Price":"29.50","Latest MA":"23.40","Price Target":32.5,"Difference from MA":"26.05%","Difference from Open":"-3.74%","Change from Yesterday":"0.67%","Change from Last Report":"0.32","Latest Volume":"3,768,150","Market Cap":"6,262,673,408","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":8.686446,"PB Ratio":3.326379,"ROE":0.33828,"DTE":282.907,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.171,"Trailing PEG":null,"Trailing PE":10.17069,"Trailing PS":3.948371,"Quick Ratio":1.258,"Day High":31.42,"Day Low":29.365,"VS Average Volume":1.4681210669,"Company Summary":"SLM Corporation, through its subsidiaries, originates and services private education loans to students and their families to finance the cost of their education in the United States. It is also involved in the provision of retail deposit accounts, including certificates of deposit, money market accounts, and high-yield savings accounts; and interest-bearing omnibus accounts. The company was formerly known as New BLC Corporation and changed its name to SLM Corporation in December 2013. SLM Corporation was founded in 1972 and is headquartered in Newark, Delaware.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Freeport-McMoRan, Inc.","Symbol":"FCX","Current Price":"37.53","Latest MA":"44.27","Price Target":48.8981,"Difference from MA":"-15.23%","Difference from Open":"-3.10%","Change from Yesterday":"-2.52%","Change from Last Report":"-0.12","Latest Volume":"10,186,681","Market Cap":"53,927,981,056","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.868021,"PB Ratio":3.0732067,"ROE":0.16870001,"DTE":33.531,"Industry":"Copper","Sector":"Basic Materials","Beta":1.91,"Trailing PEG":10.0701,"Trailing PE":28.86923,"Trailing PS":2.1032755,"Quick Ratio":1.048,"Day High":38.88,"Day Low":37.455,"VS Average Volume":0.8669495085,"Company Summary":"Freeport-McMoRan Inc. engages in the mining of mineral properties in North America, South America, and Indonesia. It primarily explores for copper, gold, molybdenum, silver, and other metals. The company's assets include the Grasberg minerals district in Indonesia; Morenci, Bagdad, Safford, Sierrita, and Miami in Arizona; Chino and Tyrone in New Mexico; and Henderson and Climax in Colorado, North America, as well as Cerro Verde in Peru and El Abra in Chile. The company was formerly known as Freeport-McMoRan Copper & Gold Inc. and changed its name to Freeport-McMoRan Inc. in July 2014. Freeport-McMoRan Inc. was incorporated in 1987 and is headquartered in Phoenix, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"CSX Corporation","Symbol":"CSX","Current Price":"32.70","Latest MA":"33.79","Price Target":37.15846,"Difference from MA":"-3.20%","Difference from Open":"1.93%","Change from Yesterday":"-2.87%","Change from Last Report":"0.20","Latest Volume":"15,757,022","Market Cap":"63,068,979,200","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":15.313984,"PB Ratio":4.8777037,"ROE":0.29458,"DTE":147.913,"Industry":"Railroads","Sector":"Industrials","Beta":1.191,"Trailing PEG":2.1553,"Trailing PE":18.27095,"Trailing PS":4.2959595,"Quick Ratio":1.195,"Day High":33.02,"Day Low":32.0,"VS Average Volume":1.2836661068,"Company Summary":"CSX Corporation, together with its subsidiaries, provides rail-based freight transportation services. The company offers rail services; and transportation of intermodal containers and trailers, as well as other transportation services, such as rail-to-truck transfers and bulk commodity operations. It also transports chemicals, agricultural and food products, minerals, automotive, forest products, fertilizers, and metals and equipment; and coal, coke, and iron ore to electricity-generating power plants, steel manufacturers, and industrial plants, as well as exports coal to deep-water port facilities. In addition, the company provides intermodal services through a network of approximately 30 terminals transporting manufactured consumer goods in containers; and drayage services, including the pickup and delivery of intermodal shipments. It serves the automotive industry with distribution centers and storage locations, as well as connects non-rail served customers through transferring products, such as plastics and ethanol from rail to trucks. The company operates approximately 20,000 route mile rail network, which serves various population centers in 26 states east of the Mississippi River, the District of Columbia, and the Canadian provinces of Ontario and Quebec, as well as owns and leases approximately 3,500 locomotives. It serves production and distribution facilities through track connections. CSX Corporation was incorporated in 1978 and is headquartered in Jacksonville, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"TAL Education Group","Symbol":"TAL","Current Price":"11.52","Latest MA":"9.88","Price Target":14.28842,"Difference from MA":"16.51%","Difference from Open":"3.74%","Change from Yesterday":"4.02%","Change from Last Report":"0.13","Latest Volume":"6,493,249","Market Cap":"6,958,319,104","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":24.65686,"PB Ratio":1.8998516,"ROE":0.019609999,"DTE":9.291,"Industry":"Education & Training Services","Sector":"Consumer Defensive","Beta":0.033,"Trailing PEG":0.896,"Trailing PE":95.958336,"Trailing PS":3.788661,"Quick Ratio":2.67,"Day High":11.535,"Day Low":11.01,"VS Average Volume":0.9887004987,"Company Summary":"TAL Education Group provides K-12 after-school tutoring services in the People's Republic of China. It provides learning services primarily through small-classes services; personalized premium services; and learning content solutions, such as print books, smart books, mobile apps, and AI-driven learning devices. The company also operates www.xueersi.com, an online education platform; provides investment management and consulting services; develops and sells software and networks, as well as related consulting services; and sells educational materials and products. It offers its services under the Haoweilai and Think Academy brands. TAL Education Group was founded in 2003 and is headquartered in Beijing, the People's Republic of China.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Associated Banc-Corp","Symbol":"ASB","Current Price":"25.00","Latest MA":"22.91","Price Target":27.77778,"Difference from MA":"9.14%","Difference from Open":"-0.40%","Change from Yesterday":"-1.30%","Change from Last Report":"0.00","Latest Volume":"1,137,876","Market Cap":"4,126,375,168","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":9.157509,"PB Ratio":0.88214535,"ROE":0.04542,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.904,"Trailing PEG":null,"Trailing PE":20.833332,"Trailing PS":4.0948043,"Quick Ratio":"N\/A","Day High":25.62,"Day Low":24.89,"VS Average Volume":0.6053575191,"Company Summary":"Associated Banc-Corp, a bank holding company, provides various banking and nonbanking products to individuals and businesses in Wisconsin, Illinois, and Minnesota. The company offers lending solutions, including commercial loans and lines of credit, commercial real estate financing, construction loans, letters of credit, leasing, asset based lending and equipment finance, loan syndications products, residential mortgages, home equity loans and lines of credit, personal and installment loans, auto finance and business loans, and business lines of credit. It also provides deposit and cash management solutions, such as commercial checking and interest-bearing deposit products, cash vault and night depository services, liquidity solutions, payables and receivables solutions, and information services; specialized financial services, such as interest rate risk management and foreign exchange solutions; fiduciary services, such as administration of pension, profit-sharing and other employee benefit plans, fiduciary and corporate agency services, and institutional asset management services; and investable funds solutions, including savings, money market deposit accounts, IRA accounts, CDs, fixed and variable annuities, full-service, discount, and online investment brokerage; investment advisory services; and trust and investment management accounts. In addition, the company offers deposit and transactional solutions, including checking, credit, debit and pre-paid cards, online banking and bill pay; and money transfer services. Associated Banc-Corp was founded in 1861 and is headquartered in Green Bay, Wisconsin.","Stock Sentiment":"N\/A","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"F.N.B. Corporation","Symbol":"FNB","Current Price":"15.51","Latest MA":"14.64","Price Target":18.75,"Difference from MA":"5.94%","Difference from Open":"0.39%","Change from Yesterday":"0.00%","Change from Last Report":"0.06","Latest Volume":"1,681,422","Market Cap":"5,577,644,032","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":9.195635,"PB Ratio":0.8925078,"ROE":0.06687,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.976,"Trailing PEG":null,"Trailing PE":12.212599,"Trailing PS":3.736364,"Quick Ratio":"N\/A","Day High":15.645,"Day Low":15.3,"VS Average Volume":0.681174486,"Company Summary":"F.N.B. Corporation, a bank and financial holding company, provides a range of financial products and services primarily to consumers, corporations, governments, and small- to medium-sized businesses in the United States. The company operates through three segments: Community Banking, Wealth Management, and Insurance. The Community Banking segment offers commercial and consumer banking services, including corporate and small business banking, investment real estate financing, business credit, capital market, and lease financing services. It also provides consumer banking products and services, such as deposit products, mortgage and consumer lending services, and mobile and online banking services. The Wealth Management segment provides personal and corporate fiduciary services comprising administration of decedent and trust estates; and securities brokerage and investment advisory services, mutual funds, and annuities. The Insurance segment comprises commercial and personal insurance, and reinsurance products, as well as mezzanine financing options for small- to medium-sized businesses. The company operates community banking branches in Pennsylvania, Ohio, Maryland, West Virginia, North Carolina, South Carolina, Washington, D.C., and Virginia. F.N.B. Corporation was founded in 1864 and is headquartered in Pittsburgh, Pennsylvania.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Procter & Gamble Company (The)","Symbol":"PG","Current Price":"164.38","Latest MA":"168.42","Price Target":179.84308,"Difference from MA":"-2.40%","Difference from Open":"-0.92%","Change from Yesterday":"-1.07%","Change from Last Report":"0.04","Latest Volume":"3,082,649","Market Cap":"385,446,445,056","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":22.325474,"PB Ratio":7.8291106,"ROE":0.28766,"DTE":69.338,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":0.414,"Trailing PEG":3.5157,"Trailing PE":26.17516,"Trailing PS":4.5938435,"Quick Ratio":0.507,"Day High":165.14,"Day Low":163.2,"VS Average Volume":0.4374755905,"Company Summary":"The Procter & Gamble Company engages in the provision of branded consumer packaged goods worldwide. The company operates through five segments: Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care. The Beauty segment offers conditioners, shampoos, styling aids, and treatments under the Head & Shoulders, Herbal Essences, Pantene, and Rejoice brands; and antiperspirants and deodorants, personal cleansing, and skin care products under the Olay, Old Spice, Safeguard, Secret, SK-II, and Native brands. The Grooming segment provides blades and razors, shave products, appliances, and other grooming products under the Braun, Gillette, and Venus brand names. The Health Care segment offers toothbrushes, toothpastes, and other oral care products under the Crest and Oral-B brand names; and gastrointestinal, pain relief, rapid diagnostics, respiratory, vitamins\/minerals\/supplements, and other personal health care products under Metamucil, Neurobion, Pepto-Bismol, and Vicks brands. The Fabric & Home Care segment provides fabric enhancers, laundry additives, and laundry detergents under the Ariel, Downy, Gain, and Tide brands; and air care, dish care, P&G professional, and surface care products under the Cascade, Dawn, Fairy, Febreze, Mr. Clean, and Swiffer brands. The Baby, Feminine & Family Care segment offers baby wipes, and taped diapers and pants under the Luvs and Pampers brands; adult incontinence and feminine care products under the Always, Always Discreet, and Tampax brands; and paper towels, tissues, and toilet papers under the Bounty, Charmin, and Puffs brands. It sells its products primarily through mass merchandisers, e-commerce, grocery stores, membership club stores, drug stores, department stores, distributors, wholesalers, specialty beauty stores, high-frequency stores, pharmacies, electronics stores, and professional channels, as well as directly to consumers. The company was founded in 1837 and is headquartered in Cincinnati, Ohio.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Abbott Laboratories","Symbol":"ABT","Current Price":"124.64","Latest MA":"111.64","Price Target":132.28792,"Difference from MA":"11.65%","Difference from Open":"1.68%","Change from Yesterday":"1.19%","Change from Last Report":"0.04","Latest Volume":"5,897,259","Market Cap":"216,191,762,432","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":22.000898,"PB Ratio":5.4325747,"ROE":0.14840001,"DTE":37.589,"Industry":"Medical Devices","Sector":"Healthcare","Beta":0.722,"Trailing PEG":2.388,"Trailing PE":16.31479,"Trailing PS":5.2452087,"Quick Ratio":0.996,"Day High":125.67,"Day Low":122.18,"VS Average Volume":1.1006083968,"Company Summary":"Abbott Laboratories, together with its subsidiaries, discovers, develops, manufactures, and sells health care products worldwide. It operates in four segments: Established Pharmaceutical Products, Diagnostic Products, Nutritional Products, and Medical Devices. The company provides generic pharmaceuticals for the treatment of pancreatic exocrine insufficiency, irritable bowel syndrome or biliary spasm, intrahepatic cholestasis or depressive symptoms, gynecological disorder, hormone replacement therapy, dyslipidemia, hypertension, hypothyroidism, Ménière's disease and vestibular vertigo, pain, fever, inflammation, and migraine, as well as provides anti-infective clarithromycin, influenza vaccine, and products to regulate physiological rhythm of the colon. It also offers laboratory and transfusion medicine systems in the areas of immunoassay, clinical chemistry, hematology, and transfusion; molecular diagnostics polymerase chain reaction instrument systems that automate the extraction, purification, and preparation of DNA and RNA from patient samples, and detect and measure infectious agents; point of care systems; cartridges for testing blood gas, chemistry, electrolytes, coagulation, and immunoassay; rapid diagnostics lateral flow testing products; molecular point-of-care testing for HIV, SARS-CoV-2, influenza A and B, RSV, and strep A; cardiometabolic test systems; drug and alcohol test, and remote patient monitoring and consumer self-test systems; and informatics and automation solutions for laboratories. In addition, the company provides pediatric and adult nutritional products; rhythm management, electrophysiology, heart failure, vascular, and structural heart devices for the treatment of cardiovascular diseases; diabetes care products, such as glucose and blood glucose monitoring systems; and neuromodulation devices for the management of chronic pain and movement disorders. Abbott Laboratories was founded in 1888 and is based in North Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Valley National Bancorp","Symbol":"VLY","Current Price":"10.15","Latest MA":"8.73","Price Target":11.4,"Difference from MA":"16.34%","Difference from Open":"1.65%","Change from Yesterday":"3.83%","Change from Last Report":"0.00","Latest Volume":"5,198,737","Market Cap":"5,672,237,568","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":8.833123,"PB Ratio":0.78139424,"ROE":0.049429998,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.086,"Trailing PEG":null,"Trailing PE":16.379032,"Trailing PS":3.5967734,"Quick Ratio":"N\/A","Day High":10.26,"Day Low":9.79,"VS Average Volume":0.6724198834,"Company Summary":"Valley National Bancorp operates as the holding company for Valley National Bank that provides various commercial, private banking, retail, insurance, and wealth management financial services products. It operates through Consumer Banking, Commercial Banking, and Treasury and Corporate other segments. The company offers non-interest bearing, savings, NOW, money market, and time deposit accounts; commercial and industrial, commercial real estate, residential mortgage, and automobile loans; loans secured by the cash surrender value of life insurance; home equity loans and lines of credit; automobile financing; and secured and unsecured other consumer loans. It also invests in various securities and interest-bearing deposits with other banks; and provides international banking services, such as standby and documentary letters of credit, and related products, as well as foreign exchange transactions, documentary collections, and foreign wire transfers services. In addition, the company offers investment services for individuals and small to medium sized businesses; and trusts investment strategies designed for various investment profiles and objectives. Further, it provides trust services, such as living and testamentary trusts, investment management, custodial and escrow services, and estate administration to individuals; tax credit advisory services; brokerage services; property and casualty, life, health, and title insurance agency services; and health care equipment lending and other commercial equipment leasing services, as well as owns real estate related investments. Additionally, the company offers online, mobile, and telephone banking services; receivable, payment, and security solution, merchant, payroll processing, and liquidity services; credit cards; and drive-in and night deposit, automated teller machine, remote deposit capture, and safe deposit facility services. Valley National Bancorp was founded in 1927 and is headquartered in Morristown, New Jersey.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Knight-Swift Transportation Hol","Symbol":"KNX","Current Price":"57.15","Latest MA":"52.88","Price Target":61.32211,"Difference from MA":"8.08%","Difference from Open":"0.32%","Change from Yesterday":"-0.76%","Change from Last Report":"0.05","Latest Volume":"1,021,159","Market Cap":"9,252,185,088","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":16.284927,"PB Ratio":1.3105695,"ROE":0.0050700004,"DTE":47.652,"Industry":"Trucking","Sector":"Industrials","Beta":0.934,"Trailing PEG":1.097,"Trailing PE":78.287674,"Trailing PS":1.237301,"Quick Ratio":0.741,"Day High":57.86,"Day Low":56.97,"VS Average Volume":0.529947766,"Company Summary":"Knight-Swift Transportation Holdings Inc., together with its subsidiaries, provides freight transportation services in the United States and Mexico. The company operates through four segments: Truckload, Less-than-truckload (LTL), Logistics, and Intermodal. The Truckload segment provides transportation services, which include irregular route and dedicated, refrigerated, expedited, flatbed, and cross-border operations. This segment operated an average of 20,948 tractors, which comprised 18,821 company tractors and 2,127 independent contractor tractors, as well as 87,865 trailers. The LTL segment provides regional LTL transportation services through a network of approximately 120 service centers; and offers national coverage through partner carrier outside the network. This segment operated an average of 3,201 tractors and 8,482 trailers. The Logistic segment offers brokerage and other freight management services through third-party transportation providers and equipment. The Intermodal segment offers transportation services, including freight through third-party intermodal rail services on trailing equipment, such as containers and trailers on flat cars; and drayage services. This segment operated an average of 639 tractors and 12,730 intermodal containers. The company also provides repair and maintenance shop, equipment leasing, warranty, and insurance services; and warehousing and driving academy services, as well as manufactures trailer parts. It serves retail, food and beverage, consumer and paper products, transportation and logistics, housing, and building, automotive, and manufacturing industries. Knight-Swift Transportation Holdings Inc. was incorporated in 1989 and is headquartered in Phoenix, Arizona.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Ally Financial Inc.","Symbol":"ALLY","Current Price":"39.09","Latest MA":"37.84","Price Target":44.3125,"Difference from MA":"3.30%","Difference from Open":"-2.35%","Change from Yesterday":"-2.49%","Change from Last Report":"-0.08","Latest Volume":"1,742,562","Market Cap":"11,937,616,896","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":7.0639644,"PB Ratio":0.9605131,"ROE":0.06425,"DTE":"N\/A","Industry":"Credit Services","Sector":"Financial Services","Beta":1.389,"Trailing PEG":0.6143,"Trailing PE":21.716667,"Trailing PS":1.7648753,"Quick Ratio":"N\/A","Day High":40.015,"Day Low":38.83,"VS Average Volume":0.5423353546,"Company Summary":"Ally Financial Inc., a digital financial-services company, provides various digital financial products and services in the United States, Canada, and Bermuda. The company operates through Automotive Finance Operations, Insurance Operations, Mortgage Finance Operations, and Corporate Finance Operations segments. The Automotive Finance Operations segment offers automotive financing services, including providing retail installment sales contracts, loans and operating leases, term loans to dealers, financing dealer floorplans and other lines of credit to dealers, warehouse lines to automotive retailers, and fleet financing. It also provides financing services to companies and municipalities for the purchase or lease of vehicles, and vehicle-remarketing services. The Insurance Operations segment offers consumer finance protection and insurance products through the automotive dealer channel, and commercial insurance products directly to dealers. This segment provides vehicle service and maintenance contract, and guaranteed asset protection products; and underwrites commercial insurance coverages, which primarily insure dealers' vehicle inventory. The Mortgage Finance Operations segment manages consumer mortgage loan portfolio that includes bulk purchases of jumbo and low-to-moderate income mortgage loans originated by third parties, as well as direct-to-consumer mortgage offerings. The Corporate Finance Operations segment provides senior secured leveraged cash flow and asset-based loans to middle market companies; leveraged loans; and commercial real estate product to serve companies in the nursing facilities, senior housing, and medical office buildings. It also offers commercial banking products and services. In addition, it provides securities brokerage and investment advisory services. The company was formerly known as GMAC Inc. and changed its name to Ally Financial Inc. in May 2010. Ally Financial Inc. was founded in 1919 and is based in Detroit, Michigan.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Alcoa Corporation","Symbol":"AA","Current Price":"36.77","Latest MA":"37.77","Price Target":48.04615,"Difference from MA":"-2.66%","Difference from Open":"-2.86%","Change from Yesterday":"-1.56%","Change from Last Report":"-0.09","Latest Volume":"2,305,223","Market Cap":"9,498,938,368","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":11.396309,"PB Ratio":1.8093106,"ROE":-0.07142,"DTE":56.095,"Industry":"Aluminum","Sector":"Basic Materials","Beta":2.419,"Trailing PEG":null,"Trailing PE":141.41153,"Trailing PS":0.86322594,"Quick Ratio":0.671,"Day High":37.85,"Day Low":36.71,"VS Average Volume":0.5064256006,"Company Summary":"Alcoa Corporation, together with its subsidiaries, produces and sells bauxite, alumina, and aluminum products in the United States, Spain, Australia, Iceland, Norway, Brazil, Canada, and internationally. The company operates through two segments, Alumina and Aluminum. It engages in bauxite mining operations; and processes bauxite into alumina and sells it to customers who process it into industrial chemical products, as well as aluminum smelting and casting businesses. The company offers primary aluminum in the form of alloy ingot or value-add ingot to customers that produce products for the transportation, building and construction, packaging, wire, and other industrial markets; and flat-rolled aluminum in the form of sheet, which is sold primarily to customers that produce beverage and food cans. In addition, it owns hydro power plants that generates and sells electricity in the wholesale market to traders, large industrial consumers, distribution companies, and other generation companies. The company was formerly known as Alcoa Upstream Corporation and changed its name to Alcoa Corporation in October 2016. The company was founded in 1886 and is headquartered in Pittsburgh, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Lam Research Corporation","Symbol":"LRCX","Current Price":"79.38","Latest MA":"80.82","Price Target":90.85239,"Difference from MA":"-1.78%","Difference from Open":"-2.66%","Change from Yesterday":"-2.28%","Change from Last Report":"-0.13","Latest Volume":"3,835,383","Market Cap":"102,137,454,592","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":19.489271,"PB Ratio":12.106146,"ROE":0.49116,"DTE":58.827,"Industry":"Semiconductor Equipment & Materials","Sector":"Technology","Beta":1.486,"Trailing PEG":1.5615,"Trailing PE":25.68932,"Trailing PS":6.550926,"Quick Ratio":1.685,"Day High":81.6418,"Day Low":79.34,"VS Average Volume":0.3381199043,"Company Summary":"Lam Research Corporation designs, manufactures, markets, refurbishes, and services semiconductor processing equipment used in the fabrication of integrated circuits. The company offers ALTUS systems to deposit conformal films for tungsten metallization applications; SABRE electrochemical deposition products for copper interconnect transition that offers copper damascene manufacturing; and VECTOR plasma-enhanced CVD products. It also provides SPEED gapfill high-density plasma chemical vapor deposition products; and Striker single-wafer atomic layer deposition products for dielectric film solutions. In addition, the company offers Flex for dielectric etch applications; Vantex, a dielectric etch system that provides RF technology and repeatable wafer-to-wafer performance enabled by Equipment Intelligence solutions; Kiyo for conductor etch applications; Syndion for through-silicon via etch applications; and Versys metal products for metal etch processes. Further, it provides Coronus bevel clean products to enhance die yield; and Da Vinci, DV-Prime, EOS, and SP series products to address various wafer cleaning applications. The company sells its products in the United States, China, Europe, Japan, Korea, Southeast Asia, and Taiwan. Lam Research Corporation was incorporated in 1980 and is headquartered in Fremont, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Johnson & Johnson","Symbol":"JNJ","Current Price":"146.93","Latest MA":"154.20","Price Target":167.52,"Difference from MA":"-4.72%","Difference from Open":"0.09%","Change from Yesterday":"0.20%","Change from Last Report":"0.07","Latest Volume":"4,863,044","Market Cap":"353,751,597,056","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.204781,"PB Ratio":5.0415177,"ROE":0.20889,"DTE":50.958,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.518,"Trailing PEG":0.9342,"Trailing PE":25.37651,"Trailing PS":4.0338397,"Quick Ratio":0.705,"Day High":147.631,"Day Low":146.383,"VS Average Volume":0.5894435887,"Company Summary":"Johnson & Johnson, together with its subsidiaries, researches, develops, manufactures, and sells various products in the healthcare field worldwide. The company's Innovative Medicine segment offers products for various therapeutic areas, such as immunology, including rheumatoid arthritis, psoriatic arthritis, inflammatory bowel disease, and psoriasis; infectious diseases comprising HIV\/AIDS; neuroscience, consisting of mood disorders, neurodegenerative disorders, and schizophrenia; oncology, such as prostate cancer, hematologic malignancies, lung cancer, and bladder cancer; cardiovascular and metabolism, including thrombosis, diabetes, and macular degeneration; and pulmonary hypertension comprising pulmonary arterial hypertension through retailers, wholesalers, distributors, hospitals, and healthcare professionals for prescription use. Its MedTech segment provides Interventional Solutions, including electrophysiology products to treat heart rhythm disorders; the heart recovery portfolio, which includes technologies to treat severe coronary artery disease requiring high-risk PCI or AMI cardiogenic shock; and neurovascular care that treats hemorrhagic and ischemic stroke. this segment also offers an orthopaedics portfolio that includes products and enabling technologies that support hips, knees, trauma, spine, sports, and other; surgery portfolios comprising advanced and general surgery technologies, as well as solutions for breast aesthetics, ear, nose, and throat procedures; contact lenses under the ACUVUE Brand; and TECNIS intraocular lenses for cataract surgery. It distributes its products to wholesalers, hospitals, and retailers, as well as physicians, nurses, hospitals, eye care professionals, and clinics. The company has a collaboration agreement with Stand Up To Cancer for research testing a combination of teclistamab and daratumumab to treat a rare disease AL amyloidosis. Johnson & Johnson was founded in 1886 and is based in New Brunswick, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Kinder Morgan, Inc.","Symbol":"KMI","Current Price":"30.32","Latest MA":"23.76","Price Target":29.19611,"Difference from MA":"27.62%","Difference from Open":"-0.52%","Change from Yesterday":"-0.52%","Change from Last Report":"-0.18","Latest Volume":"5,315,969","Market Cap":"67,360,120,832","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":22.400188,"PB Ratio":2.2154026,"ROE":0.083500005,"DTE":101.433,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.907,"Trailing PEG":2.2318,"Trailing PE":25.91453,"Trailing PS":4.445919,"Quick Ratio":0.291,"Day High":30.555,"Day Low":30.25,"VS Average Volume":0.389214949,"Company Summary":"Kinder Morgan, Inc. operates as an energy infrastructure company primarily in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas gasification, liquefaction, and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and\/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, renewable fuel and feedstocks, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; owns interests in\/or operates oil fields and gasoline processing plants; and operates a crude oil pipeline system in West Texas, as well as owns and operates RNG and LNG facilities. It owns and operates approximately 82,000 miles of pipelines and 139 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1997 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Las Vegas Sands Corp.","Symbol":"LVS","Current Price":"43.46","Latest MA":"46.19","Price Target":59.43789,"Difference from MA":"-5.90%","Difference from Open":"-0.34%","Change from Yesterday":"0.02%","Change from Last Report":"-0.09","Latest Volume":"2,036,407","Market Cap":"31,509,628,928","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":15.84385,"PB Ratio":9.195937,"ROE":0.45166,"DTE":384.206,"Industry":"Resorts & Casinos","Sector":"Consumer Cyclical","Beta":1.117,"Trailing PEG":0.6452,"Trailing PE":21.51485,"Trailing PS":2.7842739,"Quick Ratio":0.864,"Day High":43.84,"Day Low":43.425,"VS Average Volume":0.422133929,"Company Summary":"Las Vegas Sands Corp., together with its subsidiaries, develops, owns, and operates integrated resorts in Macao and Singapore. It owns and operates The Venetian Macao Resort Hotel, the Londoner Macao, The Parisian Macao, The Plaza Macao and Four Seasons Hotel Macao, Cotai Strip, and the Sands Macao in Macao, the People's Republic of China; and Marina Bay Sands in Singapore. The company's integrated resorts feature accommodations, gaming, entertainment and retail malls, convention and exhibition facilities, celebrity chef restaurants, and other amenities. Las Vegas Sands Corp. was founded in 1988 and is based in Las Vegas, Nevada.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Halliburton Company","Symbol":"HAL","Current Price":"27.93","Latest MA":"30.13","Price Target":34.69259,"Difference from MA":"-7.33%","Difference from Open":"-0.98%","Change from Yesterday":"-0.16%","Change from Last Report":"0.14","Latest Volume":"7,712,100","Market Cap":"24,532,168,704","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.93137,"PB Ratio":2.3812568,"ROE":0.26293,"DTE":83.993,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.905,"Trailing PEG":2.2169,"Trailing PE":9.867491,"Trailing PS":1.0632414,"Quick Ratio":1.377,"Day High":28.38,"Day Low":27.47,"VS Average Volume":0.7845263143,"Company Summary":"Halliburton Company provides products and services to the energy industry worldwide. It operates through two segments, Completion and Production, and Drilling and Evaluation. The Completion and Production segment offers production enhancement services that include stimulation and sand control services; cementing services, such as well bonding and casing, and casing equipment; and completion tools that offer downhole solutions and services, including well completion products and services, intelligent well completions, and service tools, as well as liner hanger, sand control, and multilateral systems. This segment also provides electrical submersible pumps, as well as artificial lift services; production solutions comprising coiled tubing, hydraulic workover units, downhole tools, and pumping and nitrogen services; pipeline and process services, such as pre-commissioning, commissioning, maintenance, and decommissioning; and specialty chemicals and services. The Drilling and Evaluation segment offers drilling fluid systems, performance additives, completion fluids, solids control, specialized testing equipment, and waste management services; drilling systems and services; wireline and perforating services consists of open-hole logging, and cased-hole and slickline; and drill bits and services comprising roller cone rock bits, fixed cutter bits, hole enlargement, and related downhole tools and services, as well as coring equipment and services. This segment also provides cloud based digital services and artificial intelligence solutions on an open architecture for subsurface insights, integrated well construction, and reservoir and production management; testing and subsea services, such as acquisition and analysis of reservoir information and optimization solutions; and project management and integrated asset management services. Halliburton Company was founded in 1919 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"GE Vernova Inc.","Symbol":"GEV","Current Price":"417.29","Latest MA":"262.03","Price Target":412.1326,"Difference from MA":"59.25%","Difference from Open":"-4.49%","Change from Yesterday":"-4.71%","Change from Last Report":"-0.17","Latest Volume":"2,193,004","Market Cap":"115,027,664,896","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":39.271065,"PB Ratio":12.092209,"ROE":"N\/A","DTE":9.346,"Industry":"Utilities - Renewable","Sector":"Utilities","Beta":"N\/A","Trailing PEG":3.7936,"Trailing PE":75.05216,"Trailing PS":3.34169,"Quick Ratio":0.717,"Day High":436.93,"Day Low":416.0001,"VS Average Volume":0.7614787592,"Company Summary":"GE Vernova Inc., an energy company, engages in the provision of various products and services that generate, transfer, orchestrate, convert, and store electricity in the United States, Europe, Asia, the Americas, the Middle East, and Africa. The company operates through three segments: Power, Wind, and Electrification. The Power segment designs, manufactures, and services gas, nuclear, hydro, and steam technologies. The Wind segment offers wind generation technologies, including onshore and offshore wind turbines and blades. The Electrification segment provides grid solutions, power conversion, solar, and storage solutions; and electrification software for the transmission, distribution, conversion, storage, and orchestration of electricity from point of generation to point of consumption. The company was incorporated in 2023 and is headquartered in Cambridge, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Hexcel Corporation","Symbol":"HXL","Current Price":"67.48","Latest MA":"62.62","Price Target":71.00118,"Difference from MA":"7.77%","Difference from Open":"-4.06%","Change from Yesterday":"-4.53%","Change from Last Report":"0.01","Latest Volume":"1,254,980","Market Cap":"5,466,285,056","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":23.216011,"PB Ratio":3.4390767,"ROE":0.06682,"DTE":50.657,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.298,"Trailing PEG":1.1244,"Trailing PE":42.443398,"Trailing PS":2.897273,"Quick Ratio":1.322,"Day High":70.78,"Day Low":67.3475,"VS Average Volume":1.3166312587,"Company Summary":"Hexcel Corporation develops, manufactures, and markets carbon fibers, structural reinforcements, honeycomb structures, resins, and composite materials and parts for use in commercial aerospace, space and defense, and industrial applications. It operates through two segments, Composite Materials and Engineered Products. The Composite Materials segment manufactures and markets fabrics, multi-axials, specialty reinforcements, prepregs and other fiber-reinforced matrix materials, structural adhesives, molding compounds, tooling materials, polyurethane systems, and laminates that are used in military and commercial aircraft, wind turbine blades, recreational products, and other industrial applications, as well as in automotive, marine, and rail transportation. The Engineered Products segment manufactures and markets aircraft structures and finished aircraft components, including wing to body fairings, wing panels, flight deck panels, door liners, rotorcraft blades, spars, and tip caps; and aircraft structural sub-components and semi-finished components used in rotorcraft blades, engine nacelles, and aircraft surfaces, such as flaps, wings, elevators, and fairings; and RF interference control products for military and aerospace applications. This segment also provides interference control materials, structural composites, and services; dielectric absorber foams; magnetic absorbers; and thermoplastics for commercial and defense applications. The company sells its products directly through its managers, product managers, and sales personnel, as well as through independent distributors in the Americas, Europe, the Asia Pacific, India, and Africa. Hexcel Corporation was founded in 1946 and is headquartered in Stamford, Connecticut.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Amphenol Corporation","Symbol":"APH","Current Price":"77.32","Latest MA":"67.69","Price Target":84.535,"Difference from MA":"14.22%","Difference from Open":"-2.13%","Change from Yesterday":"-1.57%","Change from Last Report":"-0.04","Latest Volume":"2,585,233","Market Cap":"93,217,767,424","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":30.849888,"PB Ratio":9.85973,"ROE":0.25293,"DTE":57.565,"Industry":"Electronic Components","Sector":"Technology","Beta":1.238,"Trailing PEG":2.4226,"Trailing PE":40.270836,"Trailing PS":6.5496874,"Quick Ratio":1.208,"Day High":79.39,"Day Low":77.31,"VS Average Volume":0.3998373883,"Company Summary":"Amphenol Corporation, together with its subsidiaries, primarily designs, manufactures, and markets electrical, electronic, and fiber optic connectors in the United States, China, and internationally. It operates through three segments: Harsh Environment Solutions, Communications Solutions, and Interconnect and Sensor Systems. The company offers connectors and connector systems, including harsh environment data, power, high-speed, fiber optic, and radio frequency interconnect products; busbars and power distribution systems; and other connectors. It also provides value-add products, such as backplane interconnect systems, cable assemblies and harnesses, and cable management products; other products comprising flexible and rigid printed circuit boards, hinges, other mechanical, and production related products. In addition, the company offers consumer device, network infrastructure, and other antennas; coaxial, power, and specialty cables; and sensors and sensor-based products. It sells its products through its sales force, independent representatives, and a network of electronics distributors to original equipment manufacturers, electronic manufacturing services companies, original design manufacturers, and service providers in the automotive, broadband communication, commercial aerospace, industrial, information technology and data communication, military, mobile device, and mobile network markets. Amphenol Corporation was founded in 1932 and is headquartered in Wallingford, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"New Oriental Education & Techno","Symbol":"EDU","Current Price":"46.56","Latest MA":"65.56","Price Target":67.36004,"Difference from MA":"-28.98%","Difference from Open":"0.91%","Change from Yesterday":"-0.41%","Change from Last Report":"0.09","Latest Volume":"1,322,445","Market Cap":"7,613,910,016","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":12.007644,"PB Ratio":2.0315022,"ROE":0.09543,"DTE":16.761,"Industry":"Education & Training Services","Sector":"Consumer Defensive","Beta":0.487,"Trailing PEG":0.9047,"Trailing PE":20.243479,"Trailing PS":1.6377589,"Quick Ratio":1.634,"Day High":47.25,"Day Low":46.1,"VS Average Volume":0.7505848846,"Company Summary":"New Oriental Education & Technology Group Inc. provides private educational services under the New Oriental brand in the People's Republic of China. The company operates through four segments: Educational Services and Test Preparation Courses; Online Education and Other Services; Overseas Study Consulting Services; and Educational Materials and Distribution. It offers test preparation courses to students taking language and entrance exams used by educational institutions in the United States, the Commonwealth countries, and the People's Republic of China. The company also provides non-academic tutoring courses; intelligent learning systems and devices to offer a digital learning experience for students; and overseas studies consulting services. In addition, it offers online education services through the Koolearn.com platform. Further, the company develops and edits educational materials for language training and test preparation. In addition, it offers educational programs, services, and products to students through schools; learning centers; and bookstores, as well as through its online learning platforms. The company was founded in 1993 and is headquartered in Beijing, the People's Republic of China.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Fifth Third Bancorp","Symbol":"FITB","Current Price":"44.27","Latest MA":"42.00","Price Target":50.64286,"Difference from MA":"5.41%","Difference from Open":"2.02%","Change from Yesterday":"0.96%","Change from Last Report":"0.01","Latest Volume":"1,907,920","Market Cap":"29,657,788,416","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":10.848365,"PB Ratio":1.6039343,"ROE":0.119160004,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.231,"Trailing PEG":3.5238,"Trailing PE":14.100319,"Trailing PS":3.6782572,"Quick Ratio":"N\/A","Day High":44.455,"Day Low":43.4,"VS Average Volume":0.4150890771,"Company Summary":"Fifth Third Bancorp operates as the bank holding company for Fifth Third Bank, National Association that engages in the provision of a range of financial products and services in the United States. It operates through three segments: Commercial Banking, Consumer and Small Business Banking, and Wealth and Asset Management. The Commercial Banking segment offers credit intermediation, cash management, and financial services; lending and depository products; and cash management, foreign exchange and international trade finance, derivatives and capital markets services, asset-based lending, real estate finance, public finance, commercial leasing, and syndicated finance for business, government, and professional customers. The Consumer and Small Banking segment provides a range of deposit and loan products to individuals and small businesses; home equity loans and lines of credit; credit cards; and cash management services. This segment also engages in the residential mortgage that include origination, retention and servicing of residential mortgage loans, sales and securitizations of loans, and hedging activities; indirect lending, including extending loans to consumers through automobile dealers, motorcycle dealers, powersport dealers, recreational vehicle dealers, and marine dealers; and home improvement and solar energy installation loans through contractors and installers. The Wealth & Asset Management segment provides various wealth management services for individuals, companies, and not-for-profit organizations. It offers retail brokerage services to individual clients; and broker dealer services to the institutional marketplace. This segment also provides wealth planning, investment management, banking, insurance, and trust and estate services; and advisory services for institutional clients comprising middle market businesses, non-profits, states, and municipalities. The company was founded in 1858 and is headquartered in Cincinnati, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Interactive Brokers Group, Inc.","Symbol":"IBKR","Current Price":"219.40","Latest MA":"149.39","Price Target":218.5,"Difference from MA":"46.86%","Difference from Open":"4.97%","Change from Yesterday":"5.20%","Change from Last Report":"0.03","Latest Volume":"1,651,578","Market Cap":"92,699,295,744","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":28.041954,"PB Ratio":5.7623363,"ROE":0.21709,"DTE":107.179,"Industry":"Capital Markets","Sector":"Financial Services","Beta":0.792,"Trailing PEG":14.6412,"Trailing PE":31.704508,"Trailing PS":18.75365,"Quick Ratio":1.113,"Day High":220.66,"Day Low":208.9,"VS Average Volume":1.4382684118,"Company Summary":"Interactive Brokers Group, Inc. operates as an automated electronic broker worldwide. The company engages in the execution, clearance, and settlement of trades in stocks, options, futures, foreign exchange instruments, bonds, mutual funds, exchange traded funds (ETFs), precious metals, and cryptocurrencies. It also custodies and services accounts for hedge and mutual funds, ETFs, registered investment advisors, proprietary trading groups, introducing brokers, and individual investors. In addition, the company offers custody, prime brokerage, securities, and margin lending services. It serves institutional and individual customers through electronic exchanges and market centers. The company was founded in 1977 and is headquartered in Greenwich, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Prologis, Inc.","Symbol":"PLD","Current Price":"119.52","Latest MA":"116.89","Price Target":127.38095,"Difference from MA":"2.25%","Difference from Open":"0.84%","Change from Yesterday":"0.83%","Change from Last Report":"0.01","Latest Volume":"1,991,489","Market Cap":"110,696,431,616","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":38.027843,"PB Ratio":2.0882328,"ROE":0.05662,"DTE":57.079,"Industry":"REIT - Industrial","Sector":"Real Estate","Beta":1.094,"Trailing PEG":0.5803,"Trailing PE":36.10876,"Trailing PS":13.435321,"Quick Ratio":0.417,"Day High":120.06,"Day Low":117.21,"VS Average Volume":0.4687222934,"Company Summary":"Prologis, Inc. is the global leader in logistics real estate with a focus on high-barrier, high-growth markets. At September 30, 2024, the company owned or had investments in, on a wholly owned basis or through co-investment ventures, properties and development projects expected to total approximately 1.2 billion square feet (116 million square meters) in 20 countries. Prologis leases modern logistics facilities to a diverse base of approximately 6,700 customers principally across two major categories: business-to-business and retail\/online fulfilment.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"United Airlines Holdings, Inc.","Symbol":"UAL","Current Price":"106.91","Latest MA":"68.49","Price Target":127.2913,"Difference from MA":"56.09%","Difference from Open":"3.99%","Change from Yesterday":"3.80%","Change from Last Report":"-0.34","Latest Volume":"5,236,548","Market Cap":"35,160,133,632","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.2433577,"PB Ratio":3.0739815,"ROE":0.27245,"DTE":291.676,"Industry":"Airlines","Sector":"Industrials","Beta":1.393,"Trailing PEG":0.8181,"Trailing PE":11.313228,"Trailing PS":0.6279268,"Quick Ratio":0.694,"Day High":107.95,"Day Low":102.27,"VS Average Volume":0.8861457422,"Company Summary":"United Airlines Holdings, Inc., through its subsidiaries, provides air transportation services in North America, Asia, Europe, Africa, the Pacific, the Middle East, and Latin America. The company transports people and cargo through its mainline and regional fleets. It also offers catering, ground handling, flight academy, and maintenance services for third parties. The company was formerly known as United Continental Holdings, Inc. and changed its name to United Airlines Holdings, Inc. in June 2019. United Airlines Holdings, Inc. was incorporated in 1968 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Capital One Financial Corporati","Symbol":"COF","Current Price":"203.98","Latest MA":"159.30","Price Target":209.84,"Difference from MA":"28.05%","Difference from Open":"0.66%","Change from Yesterday":"-0.07%","Change from Last Report":"0.00","Latest Volume":"1,927,299","Market Cap":"77,763,297,280","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":11.140683,"PB Ratio":1.3398845,"ROE":0.07479,"DTE":"N\/A","Industry":"Credit Services","Sector":"Financial Services","Beta":1.432,"Trailing PEG":2.1149,"Trailing PE":17.599655,"Trailing PS":2.9347963,"Quick Ratio":"N\/A","Day High":205.43,"Day Low":202.3397,"VS Average Volume":0.6066749706,"Company Summary":"Capital One Financial Corporation operates as the financial services holding company for the Capital One, National Association, which engages in the provision of various financial products and services in the United States, Canada, and the United Kingdom. It operates through three segments: Credit Card, Consumer Banking, and Commercial Banking. The company accepts checking accounts, money market deposits, negotiable order of withdrawals, savings deposits, and time deposits. Its loan products include credit card loans; auto and retail banking loans; and commercial and multifamily real estate, and commercial and industrial loans. The company also offers credit and debit card products; online direct banking services; and provides advisory, capital markets, treasury management, and depository services. It serves consumers, small businesses, and commercial clients through digital channels, branches, cafés, and other distribution channels located in New York, Louisiana, Texas, Maryland, Virginia, New Jersey, and California. The company was founded in 1988 and is headquartered in McLean, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"3M Company","Symbol":"MMM","Current Price":"149.99","Latest MA":"126.15","Price Target":151.70721,"Difference from MA":"18.90%","Difference from Open":"0.73%","Change from Yesterday":"0.25%","Change from Last Report":"-0.01","Latest Volume":"2,614,545","Market Cap":"80,915,161,088","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":17.575819,"PB Ratio":17.59621,"ROE":1.1329399,"DTE":295.441,"Industry":"Conglomerates","Sector":"Industrials","Beta":1.001,"Trailing PEG":2.7109,"Trailing PE":20.659792,"Trailing PS":2.4791703,"Quick Ratio":0.95,"Day High":150.1,"Day Low":148.4012,"VS Average Volume":0.7546732216,"Company Summary":"3M Company provides diversified technology services in the United States and internationally. The company's Safety and Industrial segment offers industrial abrasives and finishing for metalworking applications; autobody repair solutions; closure systems for personal hygiene products, masking, and packaging materials; electrical products and materials for construction and maintenance, power distribution, and electrical original equipment manufacturers; structural adhesives and tapes; respiratory, hearing, eye, and fall protection solutions; and natural and color-coated mineral granules for shingles. Its Transportation and Electronics segment provides ceramic solutions; attachment\/bonding products, films, sound, and temperature management for transportation vehicles; premium large format graphic films for advertising and fleet signage; light management films and electronics assembly solutions; packaging and interconnection solutions; semiconductor production materials; data centers solutions; and reflective signage for highway, and vehicle safety. The company's Consumer segment provides consumer bandages, braces, supports, and consumer respirators; home cleaning products; retail abrasives, paint accessories, car care DIY products, picture hanging, and consumer air quality solutions; and stationery products. It offers its products through e-commerce and traditional wholesalers, retailers, jobbers, distributors, and dealers. 3M Company was founded in 1902 and is headquartered in Saint Paul, Minnesota.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Seagate Technology Holdings PLC","Symbol":"STX","Current Price":"109.21","Latest MA":"99.99","Price Target":119.98667,"Difference from MA":"9.22%","Difference from Open":"0.28%","Change from Yesterday":"0.78%","Change from Last Report":"-0.03","Latest Volume":"1,647,647","Market Cap":"23,101,190,144","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":11.153313,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Computer Hardware","Sector":"Technology","Beta":1.07,"Trailing PEG":0.3328,"Trailing PE":19.856363,"Trailing PS":3.1797922,"Quick Ratio":0.63,"Day High":110.24,"Day Low":107.6,"VS Average Volume":0.594863939,"Company Summary":"Seagate Technology Holdings plc engages in the provision of data storage technology and infrastructure solutions in Singapore, the United States, the Netherlands, and internationally. The company offers mass capacity storage products, including enterprise nearline hard disk drives (HDDs), enterprise nearline solid state drives (SSDs), enterprise nearline systems, video and image HDDs, and network-attached storage drives. It also offers legacy applications comprising Mission Critical HDDs and SSDs; external storage solutions under the Seagate Ultra Touch, One Touch, Expansion, and Basics product lines, as well as under the LaCie brand name; desktop drives for personal computers and workstation applications; notebook drives traditional notebooks, convertible systems, and external storage applications, DVR HDDs for video streaming applications, and gaming SSDs for gaming rigs. In addition, the company provides Lyve edge-to-cloud mass capacity platform, that includes modular hardware and software to support enterprises' on-premise and cloud storage infrastructure needs. It sells its products primarily to original equipment manufacturers, distributors, and retailers. The company was founded in 1978 and is based in Singapore.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"GE Aerospace","Symbol":"GE","Current Price":"196.38","Latest MA":"173.53","Price Target":218.47765,"Difference from MA":"13.17%","Difference from Open":"-3.02%","Change from Yesterday":"-2.18%","Change from Last Report":"-0.07","Latest Volume":"4,272,970","Market Cap":"210,851,250,176","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":30.821579,"PB Ratio":11.260967,"ROE":0.22552,"DTE":110.224,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.188,"Trailing PEG":null,"Trailing PE":32.299343,"Trailing PS":3.0141845,"Quick Ratio":0.804,"Day High":202.99,"Day Low":195.52,"VS Average Volume":0.8287253386,"Company Summary":"General Electric Company, doing business as GE Aerospace, designs and produces commercial and defense aircraft engines, integrated engine components, electric power, and mechanical aircraft systems. It also offers aftermarket services to support its products. The company operates in the United States, Europe, China, Asia, the Americas, the Middle East, and Africa. General Electric Company was incorporated in 1892 and is based in Evendale, Ohio.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Netflix, Inc.","Symbol":"NFLX","Current Price":"973.96","Latest MA":"756.42","Price Target":1052.3292,"Difference from MA":"28.76%","Difference from Open":"-1.02%","Change from Yesterday":"-1.11%","Change from Last Report":"0.01","Latest Volume":"2,688,508","Market Cap":"416,324,845,568","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":32.326797,"PB Ratio":18.323614,"ROE":0.34714,"DTE":81.461,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.25,"Trailing PEG":2.8748,"Trailing PE":49.189648,"Trailing PS":11.076217,"Quick Ratio":0.975,"Day High":986.28,"Day Low":971.1501,"VS Average Volume":0.7954471622,"Company Summary":"Netflix, Inc. provides entertainment services. It offers TV series, documentaries, feature films, and games across various genres and languages. The company also provides members the ability to receive streaming content through a host of internet-connected devices, including TVs, digital video players, TV set-top boxes, and mobile devices. It has operations in approximately 190 countries. The company was incorporated in 1997 and is headquartered in Los Gatos, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"D.R. Horton, Inc.","Symbol":"DHI","Current Price":"143.93","Latest MA":"166.77","Price Target":170.60126,"Difference from MA":"-13.69%","Difference from Open":"-0.79%","Change from Yesterday":"-0.91%","Change from Last Report":"-0.06","Latest Volume":"1,326,009","Market Cap":"46,176,915,456","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":9.607374,"PB Ratio":1.8424454,"ROE":0.19631,"DTE":22.915,"Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":1.744,"Trailing PEG":0.554,"Trailing PE":10.186129,"Trailing PS":1.2547597,"Quick Ratio":0.766,"Day High":145.25,"Day Low":143.63,"VS Average Volume":0.4198133458,"Company Summary":"D.R. Horton, Inc. operates as a homebuilding company in East, North, Southeast, South Central, Southwest, and Northwest regions in the United States. It engages in the acquisition and development of land; and construction and sale of residential homes in 125 markets across 36 states under the names of D.R. Horton. The company constructs and sells single-family detached homes; and attached homes, such as townhomes, duplexes, and triplexes. It provides mortgage financing services; and title insurance policies, and examination and closing services, as well as engages in the residential lot development business. In addition, the company develops, constructs, owns, leases, and sells multi-family and single-family rental properties; and owns non-residential real estate, including ranch land and improvements. It primarily serves homebuyers. D.R. Horton, Inc. was founded in 1978 and is headquartered in Arlington, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"KeyCorp","Symbol":"KEY","Current Price":"17.88","Latest MA":"16.62","Price Target":21.015,"Difference from MA":"7.59%","Difference from Open":"2.82%","Change from Yesterday":"2.32%","Change from Last Report":"0.03","Latest Volume":"5,100,121","Market Cap":"19,789,404,160","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":10.266008,"PB Ratio":1.2348919,"ROE":0.0096700005,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.231,"Trailing PEG":0.7342,"Trailing PE":"N\/A","Trailing PS":4.078608,"Quick Ratio":"N\/A","Day High":17.96,"Day Low":17.39,"VS Average Volume":0.4872729708,"Company Summary":"KeyCorp operates as the holding company for KeyBank National Association that provides various retail and commercial banking products and services in the United States. It operates in two segments, Consumer Bank and Commercial Bank. The company offers various deposits, investment products and services; commercial leasing, investment management, consumer finance; and personal finance and financial wellness, student loan refinancing, mortgage and home equity, lending, credit card, treasury, business advisory, wealth management, asset management, cash management, portfolio management, and trust and related services to individuals and small and medium-sized businesses. It also provides a suite of banking and capital market products, such as syndicated finance, debt and equity capital market products, commercial payments, equipment finance, commercial mortgage banking, derivatives, foreign exchange, financial advisory, and public finance, as well as commercial mortgage loans to consumer, energy, healthcare, industrial, public sector, real estate, and technology sectors for middle market clients. In addition, the company offers community development financing, securities underwriting, brokerage, and investment banking services. The company was founded in 1849 and is headquartered in Cleveland, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Charles Schwab Corporation (The","Symbol":"SCHW","Current Price":"82.12","Latest MA":"70.75","Price Target":89.05,"Difference from MA":"16.07%","Difference from Open":"0.97%","Change from Yesterday":"0.05%","Change from Last Report":"-0.02","Latest Volume":"2,729,078","Market Cap":"150,326,493,184","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":15.871517,"PB Ratio":3.9513302,"ROE":0.12111,"DTE":144.242,"Industry":"Capital Markets","Sector":"Financial Services","Beta":0.952,"Trailing PEG":0.9733,"Trailing PE":27.46505,"Trailing PS":8.023403,"Quick Ratio":0.481,"Day High":82.47,"Day Low":81.18,"VS Average Volume":0.3378058841,"Company Summary":"The Charles Schwab Corporation, together with its subsidiaries, operates as a savings and loan holding company that provides wealth management, securities brokerage, banking, asset management, custody, and financial advisory services in the United States and internationally. The company operates in two segments, Investor Services and Advisor Services. It offers brokerage accounts with equity and fixed income trading, margin lending, options trading, futures and forex trading, and cash management capabilities, including certificates of deposit; third-party mutual funds through the Mutual Fund Marketplace and Mutual Fund OneSource service, as well as mutual fund trading and clearing services to broker-dealers; exchange-traded funds; advisory solutions for managed portfolios, separately managed accounts, customized personal advice for tailored portfolios, specialized planning, and full-time portfolio management; banking products comprising checking and savings accounts, first lien residential real estate mortgage loans, home equity lines of credit, and pledged asset lines; and trust custody services, personal trust reporting services, and administrative trustee services. It also provides digital retirement calculators; integrated web-, mobile-, and software-based trading platforms, real-time market data, options trading, premium research, and multi-channel access; self-service education and support tools; online research and analysis tools; equity compensation plan sponsors full-service recordkeeping for stock plans, stock options, restricted stock, performance shares, and stock appreciation rights; retirement plan services; mutual fund clearing services; and advisor services, including interactive tools and educational content. The Company operates through branch offices. The Charles Schwab Corporation was founded in 1971 and is headquartered in Westlake, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Regions Financial Corporation","Symbol":"RF","Current Price":"24.48","Latest MA":"22.93","Price Target":27.3681,"Difference from MA":"6.76%","Difference from Open":"1.45%","Change from Yesterday":"0.91%","Change from Last Report":"0.02","Latest Volume":"1,866,137","Market Cap":"22,248,990,720","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":9.888712,"PB Ratio":1.3142213,"ROE":0.10042,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.182,"Trailing PEG":4.6672,"Trailing PE":12.683938,"Trailing PS":3.3936837,"Quick Ratio":"N\/A","Day High":24.61,"Day Low":24.06,"VS Average Volume":0.2306761703,"Company Summary":"Regions Financial Corporation, a financial holding company, provides banking and bank-related services to individual and corporate customers. It operates through three segments: Corporate Bank, Consumer Bank, and Wealth Management. The Corporate Bank segment offers commercial banking services, such as commercial and industrial, commercial real estate, and investor real estate lending; equipment lease financing; deposit products; and securities underwriting and placement, loan syndication and placement, foreign exchange, derivatives, merger and acquisition, and other advisory services. It serves corporate, middle market, and commercial real estate developers and investors. The Consumer Bank segment provides consumer banking products and services related to residential first mortgages, home equity lines and loans, consumer credit cards, and other consumer loans, as well as deposits. The Wealth Management segment offers credit related products, and retirement and savings solutions; and trust and investment management, asset management, and estate planning services to individuals, businesses, governmental institutions, and non-profit entities. It also provides investment and insurance products; low-income housing tax credit corporate fund syndication services; and other specialty financing services. The company was founded in 1971 and is headquartered in Birmingham, Alabama.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Schlumberger N.V.","Symbol":"SLB","Current Price":"42.41","Latest MA":"42.82","Price Target":53.44613,"Difference from MA":"-0.95%","Difference from Open":"0.50%","Change from Yesterday":"0.90%","Change from Last Report":"0.06","Latest Volume":"10,889,707","Market Cap":"59,410,051,072","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":11.157943,"PB Ratio":2.7840872,"ROE":0.21722999,"DTE":57.141,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.532,"Trailing PEG":1.9574,"Trailing PE":13.636657,"Trailing PS":1.6505084,"Quick Ratio":1.003,"Day High":42.42,"Day Low":41.72,"VS Average Volume":0.8526992494,"Company Summary":"Schlumberger Limited engages in the provision of technology for the energy industry worldwide. The company operates through four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company provides field development and hydrocarbon production, carbon management, and integration of adjacent energy systems; reservoir interpretation and data processing services for exploration data; and well construction and production improvement services and products. It also offers subsurface geology and fluids evaluation information; open and cased hole services; exploration and production pressure, and flow-rate measurement services; and pressure pumping, well stimulation, and coiled tubing equipment solutions. In addition, the company offers mud logging, directional drilling, measurement-while-drilling, and logging-while-drilling services, as well as engineering support services; supplies drilling fluid systems; designs, manufactures, and markets roller cone and fixed cutter drill bits; bottom-hole-assembly and borehole enlargement technologies; well cementing products and services; well planning, well drilling, engineering, supervision, logistics, procurement, and contracting of third parties, as well as drilling rig management solutions; and drilling equipment and services, as well as land drilling rigs and related services. Further, it provides artificial lift production equipment and optimization services; supplies packers, safety valves, sand control technology, and various intelligent well completions technology and equipment; designs and manufactures valves, chokes, actuators, and surface trees; and OneSubsea, an integrated solutions, products, systems, and services, including wellheads, subsea trees, manifolds and flowline connectors, control systems, connectors, and services. The company was formerly known as Socie´te´ de Prospection E´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"UnitedHealth Group Incorporated","Symbol":"UNH","Current Price":"533.48","Latest MA":"556.37","Price Target":635.4315,"Difference from MA":"-4.11%","Difference from Open":"1.02%","Change from Yesterday":"0.68%","Change from Last Report":"0.03","Latest Volume":"2,008,286","Market Cap":"490,953,113,600","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":15.915868,"PB Ratio":5.2086973,"ROE":0.15252,"DTE":74.683,"Industry":"Healthcare Plans","Sector":"Healthcare","Beta":0.591,"Trailing PEG":1.4665,"Trailing PE":34.37371,"Trailing PS":1.2463965,"Quick Ratio":0.833,"Day High":534.63,"Day Low":524.51,"VS Average Volume":0.4111956226,"Company Summary":"UnitedHealth Group Incorporated operates as a diversified health care company in the United States. The company operates through four segments: UnitedHealthcare, Optum Health, Optum Insight, and Optum Rx. The UnitedHealthcare segment offers consumer-oriented health benefit plans and services for national employers, public sector employers, mid-sized employers, small businesses, and individuals; health care coverage, and health and well-being services to individuals age 50 and older addressing their needs; Medicaid plans, children's health insurance and health care programs; and health and dental benefits, and hospital and clinical services, as well as health care benefits products and services to state programs caring for the economically disadvantaged, medically underserved, and those without the benefit of employer-funded health care coverage. The Optum Health segment provides care delivery, care management, wellness and consumer engagement, and health financial services patients, consumers, care delivery systems, providers, employers, payers, and public-sector entities. The Optum Insight segment offers software and information products, advisory consulting arrangements, and managed services outsourcing contracts to hospital systems, physicians, health plans, governments, life sciences companies, and other organizations. The Optum Rx segment provides pharmacy care services and programs, including retail network contracting, home delivery, specialty and community health pharmacy services, infusion, and purchasing and clinical capabilities, as well as develops programs in the areas of step therapy, formulary management, drug adherence, and disease\/drug therapy management. UnitedHealth Group Incorporated was founded in 1974 and is based in Minnetonka, Minnesota.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Huntington Bancshares Incorpora","Symbol":"HBAN","Current Price":"17.27","Latest MA":"15.16","Price Target":18.69526,"Difference from MA":"13.86%","Difference from Open":"2.34%","Change from Yesterday":"2.10%","Change from Last Report":"0.03","Latest Volume":"12,368,144","Market Cap":"25,097,093,120","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":11.107037,"PB Ratio":1.3772335,"ROE":0.08545,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.057,"Trailing PEG":2.8573,"Trailing PE":14.151639,"Trailing PS":3.751434,"Quick Ratio":"N\/A","Day High":17.4,"Day Low":16.84,"VS Average Volume":0.8172614066,"Company Summary":"Huntington Bancshares Incorporated operates as the bank holding company for The Huntington National Bank that provides commercial, consumer, and mortgage banking services in the United States. The company offers financial products and services to consumer and business customers, including deposits, lending, payments, mortgage banking, dealer financing, investment management, trust, brokerage, insurance, and other financial products and services. It also provides 24-hour grace, asterisk-free checking, money scout, $50 safety zone, standby cash, early pay, instant access, savings goal getter, and Huntington heads up; digitally powered consumer and business financial solutions to consumer lending, regional banking, branch banking, and wealth management customers; direct and indirect consumer loans, as well as dealer finance loans and deposits; and private banking, wealth management and legacy planning through investment and portfolio management, fiduciary administration and trust, institutional custody, and full-service retail brokerage investment services. The company offers equipment financing, asset-based lending, distribution finance, structured lending, and municipal financing solutions, as well as Huntington ChoicePay. In addition, it offers lending, liquidity, treasury management and other payment services, and capital markets; government and non-profits, healthcare, technology and telecommunications, franchises, financial sponsors, and global services; and corporate risk management, institutional sales and trading, debt and equity issuance, and additional advisory services. The company offers its products through a network of channels, including branches and ATMs, online and mobile banking, and through customer call centers to customers in middle market banking, corporate, specialty, and government banking, asset finance, commercial real estate banking, and capital markets. The company was founded in 1866 and is headquartered in Columbus, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"PNC Financial Services Group, I","Symbol":"PNC","Current Price":"201.02","Latest MA":"183.05","Price Target":217.956,"Difference from MA":"9.82%","Difference from Open":"2.47%","Change from Yesterday":"1.68%","Change from Last Report":"0.03","Latest Volume":"1,129,218","Market Cap":"79,591,251,968","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":11.640619,"PB Ratio":1.6137888,"ROE":0.099020004,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.121,"Trailing PEG":1.9016,"Trailing PE":14.630277,"Trailing PS":3.8855329,"Quick Ratio":"N\/A","Day High":201.39,"Day Low":196.17,"VS Average Volume":0.5509896381,"Company Summary":"The PNC Financial Services Group, Inc. operates as a diversified financial services company in the United States. It operates through three segments: Retail Banking, Corporate & Institutional Banking, and Asset Management Group segments. The company's Retail Banking segment offers checking, savings, and money market accounts, as well as time deposit; residential mortgages, home equity loans and lines of credit, auto loans, credit cards, education loans, and personal and small business loans and lines of credit; and brokerage, insurance, and investment and cash management services. This segment serves consumer and small business customers through a network of branches, digital channels, ATMs, and through phone-based customer contact centers. Its Corporate & Institutional Banking segment provides secured and unsecured loans, letters of credit, and equipment leases; cash and investment management services, receivables and disbursement management services, funds transfer services, international payment services, and access to online\/mobile information management and reporting; securities underwriting, loan syndications, customer-related trading, and mergers and acquisitions and equity capital markets advisory related services; and commercial loan servicing and technology solutions. It serves mid-sized and large corporations, and government and not-for-profit entities. The company's Asset Management Group segment offers investment and retirement planning, customized investment management, credit and cash management solutions, and trust management and administration services for high net worth and ultra high net worth individuals, and their families; and multi-generational family planning services for ultra high net worth individuals and their families. It also provides outsourced chief investment officer, custody, private real estate, cash and fixed income client solutions, and retirement plan fiduciary investment services for institutional clients. The company was founded in 1852 and is headquartered in Pittsburgh, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Truist Financial Corporation","Symbol":"TFC","Current Price":"47.01","Latest MA":"42.88","Price Target":51.058,"Difference from MA":"9.62%","Difference from Open":"1.09%","Change from Yesterday":"0.50%","Change from Last Report":"0.00","Latest Volume":"3,794,200","Market Cap":"61,855,760,384","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":10.185222,"PB Ratio":1.0572188,"ROE":-0.09505,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.035,"Trailing PEG":1.9441,"Trailing PE":"N\/A","Trailing PS":4.266797,"Quick Ratio":"N\/A","Day High":47.185,"Day Low":46.45,"VS Average Volume":0.4816606642,"Company Summary":"Truist Financial Corporation, a financial services company, provides banking and trust services in the Southeastern and Mid-Atlantic United States. The company operates through three segments: Consumer Banking and Wealth, Corporate and Commercial Banking, and Insurance Holdings.Its deposit products include noninterest-bearing checking, interest-bearing checking, savings, and money market deposit accounts, as well as certificates of deposit and individual retirement accounts. The company also provides funding; asset management; automobile lending; credit card lending; consumer finance; home equity and mortgage lending; other direct retail lending; insurance; investment brokerage; mobile\/online banking; payment solutions; point-of-sale lending; retail and small business deposit products; small business lending; and wealth management\/private banking services. In addition, it offers asset based lending, investment banking and capital market, institutional trust, insurance premium finance, derivatives, commercial lending, international banking, leasing, merchant, commercial deposit and treasury, floor plan, mortgage warehouse lending, real estate lending, and supply chain financing services. Further, the company provides insurance brokerage, retail and wholesale brokerage, securities underwriting and market making, loan syndication, and investment management and advisory services. The company was formerly known as BB&T Corporation and changed its name to Truist Financial Corporation in December 2019. Truist Financial Corporation was founded in 1872 and is headquartered in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Bank of America Corporation","Symbol":"BAC","Current Price":"46.67","Latest MA":"42.03","Price Target":51.92857,"Difference from MA":"11.03%","Difference from Open":"0.95%","Change from Yesterday":"0.59%","Change from Last Report":"-0.03","Latest Volume":"12,724,180","Market Cap":"355,198,828,544","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.7749815,"PB Ratio":1.3194425,"ROE":0.08092,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.325,"Trailing PEG":2.0554,"Trailing PE":14.53894,"Trailing PS":3.753713,"Quick Ratio":"N\/A","Day High":46.86,"Day Low":46.165,"VS Average Volume":0.3589115296,"Company Summary":"Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. It operates in four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, non-interest and interest-bearing checking accounts, and investment accounts and products; credit and debit cards; residential mortgages, and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research, and certain market-based services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"U.S. Bancorp","Symbol":"USB","Current Price":"49.24","Latest MA":"45.76","Price Target":57.04762,"Difference from MA":"7.61%","Difference from Open":"2.23%","Change from Yesterday":"1.68%","Change from Last Report":"-0.02","Latest Volume":"2,675,600","Market Cap":"76,822,200,320","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.180813,"PB Ratio":1.4765673,"ROE":0.09779,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.04,"Trailing PEG":1.1773,"Trailing PE":12.993403,"Trailing PS":3.0856009,"Quick Ratio":"N\/A","Day High":49.38,"Day Low":48.17,"VS Average Volume":0.3398326087,"Company Summary":"U.S. Bancorp, a financial services holding company, provides various financial services to individuals, businesses, institutional organizations, governmental entities, and other financial institutions in the United States. It operates through Wealth, Corporate, Commercial and Institutional Banking; Consumer and Business Banking; Payment Services; and Treasury and Corporate Support segments. The company offers depository services, including checking accounts, savings accounts, and time certificate contracts; and lending services, such as traditional credit products and credit card services, lease financing and import\/export trade, asset-backed lending, agricultural finance, and other products. It also provides ancillary services comprising capital markets, treasury management, and receivable lock-box collection services to corporate and governmental entity customers. In addition, the company offers asset management and fiduciary services for individuals, estates, foundations, business corporations, and charitable organizations. Further, it provides investment and insurance products to its customers principally within its domestic markets, as well as fund administration services to mutual and other funds. Additionally, the company provides corporate and purchasing card, and corporate trust services. Furthermore, it offers trust and investment management, merchant and ATM processing, mortgage banking, insurance, and brokerage and leasing services. U.S. Bancorp was founded in 1863 and is headquartered in Minneapolis, Minnesota.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Morgan Stanley","Symbol":"MS","Current Price":"138.13","Latest MA":"112.43","Price Target":135.16667,"Difference from MA":"22.86%","Difference from Open":"1.22%","Change from Yesterday":"0.25%","Change from Last Report":"-0.05","Latest Volume":"3,216,897","Market Cap":"221,982,949,376","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":14.692993,"PB Ratio":2.3715792,"ROE":0.11079001,"DTE":405.772,"Industry":"Capital Markets","Sector":"Financial Services","Beta":1.336,"Trailing PEG":3.6845,"Trailing PE":17.375471,"Trailing PS":3.8087738,"Quick Ratio":1.83,"Day High":139.035,"Day Low":136.47,"VS Average Volume":0.4719158534,"Company Summary":"Morgan Stanley, a financial holding company, provides various financial products and services to corporations, governments, financial institutions, and individuals in the Americas, Europe, the Middle East, Africa, and Asia. It operates through Institutional Securities, Wealth Management, and Investment Management segments. The Institutional Securities segment offers capital raising and financial advisory services, including services related to the underwriting of debt, equity, and other securities, as well as advice on mergers and acquisitions, restructurings, real estate, and project finance. This segment also provides equity and fixed income products comprising sales, financing, prime brokerage, and market-making services; foreign exchange and commodities; corporate and commercial real estate loans, commercial mortgage and secured lending facilities, and financing for sales and trading customers, and asset-backed and mortgage lending; and wealth management services, investment, and research services. The Wealth Management segment offers financial advisor-led brokerage, custody, administrative, and investment advisory services; self-directed brokerage services; financial and wealth planning services; workplace services, including stock plan administration; annuity and insurance products; securities-based lending, residential real estate loans, and other lending products; banking; and retirement plan services to individual investors and small to medium-sized businesses and institutions. The Investment Management segment provides equity, fixed income, alternatives and solutions, and liquidity and overlay services to benefit\/defined contribution plans, foundations, endowments, government entities, sovereign wealth funds, insurance companies, third-party fund sponsors, corporations, and individuals through institutional and intermediary channels. The company was founded in 1924 and is headquartered in New York, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"First Horizon Corporation","Symbol":"FHN","Current Price":"21.02","Latest MA":"17.41","Price Target":23.2,"Difference from MA":"20.72%","Difference from Open":"0.86%","Change from Yesterday":"0.55%","Change from Last Report":"-0.02","Latest Volume":"3,327,441","Market Cap":"11,014,479,872","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":11.1553955,"PB Ratio":1.3014675,"ROE":0.08979,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.882,"Trailing PEG":null,"Trailing PE":15.455882,"Trailing PS":3.58661,"Quick Ratio":"N\/A","Day High":21.305,"Day Low":20.73,"VS Average Volume":0.5411281783,"Company Summary":"First Horizon Corporation operates as the bank holding company for First Horizon Bank that provides various financial services. The company operates through Regional Banking and Specialty Banking segments. It offers general banking services for consumers, businesses, financial institutions, and governments. The company also accepts deposits; provides underwriting services for bank-eligible securities and other fixed-income securities by financial subsidiaries; sells loans and derivatives; financial planning; and offers investment and financial advisory services. In addition, it offers mortgage banking; loan syndications; brokerage services; commercial and business banking for business enterprises, consumer banking, and private client and wealth management services; capital markets, professional commercial real estate, mortgage warehouse and asset-based lending, franchise and equipment finance, tax credit finance, energy and healthcare finance, asset management, and corporate and correspondent banking services. Further, the company provides transaction processing services including check clearing services and remittance processing, credit cards, investment, and sale of mutual fund and retail insurances, as well as trust, fiduciary, and agency services. First Horizon Corporation was founded in 1864 and is headquartered in Memphis, Tennessee.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Citigroup, Inc.","Symbol":"C","Current Price":"81.63","Latest MA":"65.15","Price Target":88.8355,"Difference from MA":"25.30%","Difference from Open":"0.18%","Change from Yesterday":"-0.41%","Change from Last Report":"-0.06","Latest Volume":"7,836,693","Market Cap":"153,234,997,248","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.826795,"PB Ratio":0.80106276,"ROE":0.03874,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.426,"Trailing PEG":0.8887,"Trailing PE":13.719984,"Trailing PS":2.210928,"Quick Ratio":"N\/A","Day High":82.12,"Day Low":81.36,"VS Average Volume":0.5345248218,"Company Summary":"Citigroup Inc., a diversified financial service holding company, provides various financial product and services to consumers, corporations, governments, and institutions worldwide. It operates through five segments: Services, Markets, Banking, U.S. Personal Banking, and Wealth. The Services segment includes Treasury and Trade Solutions, which provides cash management, trade, and working capital solutions to multinational corporations, financial institutions, and public sector organizations; and Securities Services, such as cross-border support for clients, local market expertise, post-trade technologies, data solutions, and various securities services solutions. The Markets segment offers sales and trading services for equities, foreign exchange, rates, spread products, and commodities to corporate, institutional, and public sector clients; and market-making services, including asset classes, risk management solutions, financing, prime brokerage, research, securities clearing, and settlement. The banking segment includes investment banking; advisory services related to mergers and acquisitions, divestitures, restructurings, and corporate defense activities; and corporate lending, which includes corporate and commercial banking. The U.S. Personal Banking segment provides co-branded cards and retail banking services. The Wealth segment provides financial services to high-net-worth clients through banking, lending, mortgages, investment, custody, and trust product offerings; and to professional industries, including law firms, consulting groups, accounting, and asset management. The company was founded in 1812 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Goldman Sachs Group, Inc. (The)","Symbol":"GS","Current Price":"639.22","Latest MA":"524.93","Price Target":635.5238,"Difference from MA":"21.77%","Difference from Open":"1.46%","Change from Yesterday":"-0.04%","Change from Last Report":"-0.01","Latest Volume":"2,083,418","Market Cap":"200,655,994,880","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":12.483025,"PB Ratio":1.9511404,"ROE":0.1017,"DTE":609.793,"Industry":"Capital Markets","Sector":"Financial Services","Beta":1.342,"Trailing PEG":3.9029,"Trailing PE":15.767514,"Trailing PS":4.0629315,"Quick Ratio":1.458,"Day High":640.6,"Day Low":628.9599,"VS Average Volume":0.9268817864,"Company Summary":"The Goldman Sachs Group, Inc., a financial institution, provides a range of financial services for corporations, financial institutions, governments, and individuals worldwide. It operates through Global Banking & Markets, Asset & Wealth Management, and Platform Solutions segments. The Global Banking & Markets segment provides financial advisory services, including strategic advisory assignments related to mergers and acquisitions, divestitures, corporate defense activities, restructurings, and spin-offs; and relationship lending, and acquisition financing, as well as secured lending, through structured credit and asset-backed lending and involved in financing under securities to resale agreements. This segment also offers client execution activities for cash and derivative instruments; credit and interest rate products; and provision of mortgages, currencies, commodities, and equities related products, as well as underwriting services. The Asset & Wealth Management segment manages assets across various classes, including equity, fixed income, hedge funds, credit funds, private equity, real estate, currencies, and commodities; and provides customized investment advisory solutions, wealth advisory services, personalized financial planning, and private banking services, as well as invests in corporate equity, credit, real estate, and infrastructure assets. The Platform Solutions segment offers credit cards and point-of-sale financing for purchase of goods or services. This segment also provides cash management services, such as deposit-taking and payment solutions for corporate and institutional clients. The Goldman Sachs Group, Inc. was founded in 1869 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"The Bank of New York Mellon Cor","Symbol":"BK","Current Price":"86.00","Latest MA":"71.53","Price Target":91.03125,"Difference from MA":"20.23%","Difference from Open":"1.82%","Change from Yesterday":"1.50%","Change from Last Report":"-0.06","Latest Volume":"1,354,579","Market Cap":"61,720,481,792","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":11.107524,"PB Ratio":1.6608409,"ROE":0.08563,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.06,"Trailing PEG":0.7287,"Trailing PE":14.827586,"Trailing PS":3.4672477,"Quick Ratio":"N\/A","Day High":86.34,"Day Low":84.42,"VS Average Volume":0.3541901559,"Company Summary":"The Bank of New York Mellon Corporation provides a range of financial products and services in the United States and internationally. The company operates through Securities Services, Market and Wealth Services, Investment and Wealth Management, and other segments. The Securities Services segment offers custody, trust and depositary, accounting, exchange-traded funds, middle-office solutions, transfer agency, services for private equity and real estate funds, foreign exchange, securities lending, liquidity\/lending services, and data analytics. This segment also provides trustee, paying agency, fiduciary, escrow and other financial, issuer, and support services for brokers and investors. The Market and Wealth Services segment offers clearing and custody, investment, wealth and retirement solutions, technology and enterprise data management, trading, and prime brokerage services. This segment also provides integrated cash management solutions, including payments, foreign exchange, liquidity management, receivables processing and payables management, and trade finance and processing services. The Investment and Wealth Management segment offers investment management strategies and distribution of investment products, investment management, custody, wealth and estate planning, private banking, investment, and information management services. The Other segment engages in the provision of leasing, corporate treasury, derivative and other trading, corporate and bank-owned life insurance, renewable energy investment, and business exit services. It serves central banks and sovereigns, financial institutions, asset managers, insurance companies, corporations, local authorities and high net-worth individuals, and family offices. The Bank of New York Mellon Corporation was founded in 1784 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Wells Fargo & Company","Symbol":"WFC","Current Price":"77.58","Latest MA":"63.04","Price Target":82.52381,"Difference from MA":"23.06%","Difference from Open":"0.75%","Change from Yesterday":"0.19%","Change from Last Report":"0.03","Latest Volume":"4,446,652","Market Cap":"255,139,512,320","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":11.34129,"PB Ratio":1.576151,"ROE":0.099139996,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.136,"Trailing PEG":3.4954,"Trailing PE":14.445996,"Trailing PS":3.2762697,"Quick Ratio":"N\/A","Day High":77.64,"Day Low":77.0,"VS Average Volume":0.2636842809,"Company Summary":"Wells Fargo & Company, a financial services company, provides diversified banking, investment, mortgage, and consumer and commercial finance products and services in the United States and internationally. The company operates through four segments: Consumer Banking and Lending; Commercial Banking; Corporate and Investment Banking; and Wealth and Investment Management. The Consumer Banking and Lending segment offers diversified financial products and services for consumers and small businesses. Its financial products and services include checking and savings accounts, and credit and debit cards, as well as home, auto, personal, and small business lending services. The Commercial Banking segment provides financial solutions to private, family owned, and certain public companies. Its products and services include banking and credit products across various industry sectors and municipalities, secured lending and lease products, and treasury management services. The Corporate and Investment Banking segment offers a suite of capital markets, banking, and financial products and services, such as corporate banking, investment banking, treasury management, commercial real estate lending and servicing, equity, and fixed income solutions, as well as sales, trading, and research capabilities services to corporate, commercial real estate, government, and institutional clients. The Wealth and Investment Management segment provides personalized wealth management, brokerage, financial planning, lending, private banking, and trust and fiduciary products and services to affluent, high-net worth, and ultra-high-net worth clients. It also operates through financial advisors in brokerage and wealth offices, consumer bank branches, independent offices, and digitally through WellsTrade and Intuitive Investor. The company was founded in 1852 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Constellation Brands, Inc.","Symbol":"STZ","Current Price":"182.58","Latest MA":"237.91","Price Target":246.37917,"Difference from MA":"-23.26%","Difference from Open":"0.90%","Change from Yesterday":"1.70%","Change from Last Report":"-0.02","Latest Volume":"1,033,237","Market Cap":"33,002,430,464","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":12.506371,"PB Ratio":3.4272523,"ROE":0.07111,"DTE":149.155,"Industry":"Beverages - Brewers","Sector":"Consumer Defensive","Beta":0.893,"Trailing PEG":0.9667,"Trailing PE":48.688,"Trailing PS":3.2384534,"Quick Ratio":0.321,"Day High":183.36,"Day Low":179.97,"VS Average Volume":0.5598134239,"Company Summary":"Constellation Brands, Inc., together with its subsidiaries, produces, imports, markets, and sells beer, wine, and spirits in the United States, Canada, Mexico, New Zealand, and Italy. The company provides beer primarily under the Corona Extra, Corona Familiar, Corona Hard Seltzer, Corona Light, Corona Non-Alcoholic, Corona Premier, Corona Refresca, Modelo Especial, Modelo Chelada, Modelo Negra, Modelo Oro, Victoria, Vicky Chamoy, and Pacifico brands. It also offers wine under the Cook's California Champagne, Kim Crawford, Meiomi, Mount Veeder, Ruffino, SIMI, My Favorite Neighbor, Robert Mondavi Winery, Schrader, and The Prisoner Wine Company brands; and spirits under the Casa Noble, Copper & Kings, High West, Mi CAMPO, Nelson's Green Brier, and SVEDKA brands. The company provides its products to wholesale distributors, retailers, on-premise locations, and state alcohol beverage control agencies. Constellation Brands, Inc. was founded in 1945 and is headquartered in Victor, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"24-01-2025 20:45:27"},{"Company Name":"Delta Air Lines, Inc.","Symbol":"DAL","Current Price":"67.70","Latest MA":"52.42","Price Target":79.92864,"Difference from MA":"29.16%","Difference from Open":"0.47%","Change from Yesterday":"0.31%","Change from Last Report":"-0.01","Latest Volume":"2,638,440","Market Cap":"43,685,523,456","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.019807,"PB Ratio":3.1806436,"ROE":0.4067,"DTE":186.78,"Industry":"Airlines","Sector":"Industrials","Beta":1.341,"Trailing PEG":null,"Trailing PE":12.701688,"Trailing PS":0.7243856,"Quick Ratio":0.268,"Day High":67.95,"Day Low":66.7016,"VS Average Volume":0.3217990421,"Company Summary":"Delta Air Lines, Inc. provides scheduled air transportation for passengers and cargo in the United States and internationally. The company operates through two segments, Airline and Refinery. Its domestic network centered on core hubs in Atlanta, Minneapolis-St. Paul, Detroit, and Salt Lake City, as well as coastal hub positions in Boston, Los Angeles, New York-LaGuardia, New York-JFK, and Seattle; and international network centered on hubs and market presence in Amsterdam, Bogota, Lima, Mexico City, London-Heathrow, Paris-Charles de Gaulle, Sao Paulo, Seoul-Incheon, and Tokyo. The company sells its tickets through various distribution channels, including delta.com and the Fly Delta app; acts as a reservations specialists; and operates online travel and traditional brick and mortar agencies. It also provides aircraft maintenance and engineering support, repair, and overhaul services; and vacation packages to third-party consumers. The company operates through a fleet of approximately 1,273 aircrafts. Delta Air Lines, Inc. was founded in 1924 and is based in Atlanta, Georgia.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:46:31"},{"Company Name":"Walgreens Boots Alliance, Inc.","Symbol":"WBA","Current Price":"11.81","Latest MA":"9.87","Price Target":12.414,"Difference from MA":"19.67%","Difference from Open":"1.37%","Change from Yesterday":"0.43%","Change from Last Report":"0.25","Latest Volume":"5,969,656","Market Cap":"10,205,647,872","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":7.365001,"PB Ratio":0.9769212,"ROE":-0.75969005,"DTE":277.898,"Industry":"Pharmaceutical Retailers","Sector":"Healthcare","Beta":0.669,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.06911679,"Quick Ratio":0.332,"Day High":11.82,"Day Low":11.555,"VS Average Volume":0.2484790086,"Company Summary":"Walgreens Boots Alliance, Inc. operates as a healthcare, pharmacy, and retail company in the United States, Germany, the United Kingdom, and internationally. It operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The U.S. Retail Pharmacy segment engages in operation of the retail drugstores, health and wellness services, specialty, and home delivery pharmacy services, which offers health and wellness, beauty, personal care and consumables, and general merchandise. The International segment offers sale of prescription drugs and health and wellness, beauty, personal care, and other consumer products outside the United States; and operates pharmacy-led health and beauty retail businesses under the Boots brand stores in the United Kingdom, the Republic of Ireland, and Thailand, as well as the Benavides brand in Mexico and the Ahumada brand in Chile. The U.S. Healthcare segment provides VillageMD, a national provider of value-based care with primary, multi-specialty, and urgent care providers serving patients in traditional clinic settings, in patients' homes and online appointments; Shields, a specialty pharmacy integrator and accelerator for hospitals; and CareCentrix, a participant in the post-acute and home care management sectors. Walgreens Boots Alliance, Inc. was founded in 1909 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"24-01-2025 20:46:31"},{"Company Name":"JP Morgan Chase & Co.","Symbol":"JPM","Current Price":"264.97","Latest MA":"221.88","Price Target":266.29144,"Difference from MA":"19.42%","Difference from Open":"0.49%","Change from Yesterday":"-0.37%","Change from Last Report":"0.03","Latest Volume":"4,117,565","Market Cap":"741,280,055,296","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.646894,"PB Ratio":2.3010855,"ROE":0.16216,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.091,"Trailing PEG":4.8179,"Trailing PE":13.409413,"Trailing PS":4.571626,"Quick Ratio":"N\/A","Day High":267.1,"Day Low":263.01,"VS Average Volume":0.4345882454,"Company Summary":"JPMorgan Chase & Co. operates as a financial services company worldwide. It operates through three segments: Consumer & Community Banking, Commercial & Investment Bank, and Asset & Wealth Management. It offers deposit, investment and lending products, cash management, and payments and services; mortgage origination and servicing activities; residential mortgages and home equity loans; and credit cards, auto loans, leases, and travel services to consumers and small businesses through bank branches, ATMs, and digital and telephone banking. The company also provides investment banking products and services, including corporate strategy and structure advisory, and equity and debt market capital-raising services, as well as loan origination and syndication; payments; and cash and derivative instruments, risk management solutions, prime brokerage, and research, as well as offers securities services, including custody, fund accounting and administration, and securities lending products for asset managers, insurance companies, and public and private investment funds. In addition, it provides financial solutions, including lending, payments, investment banking, and asset management to small and midsized companies, local governments, nonprofit clients, and large corporations, as well as investors, developers, and owners of multifamily, office, retail, industrial, and affordable housing properties. Further, the company offers multi-asset investment management solutions in equities, fixed income, alternatives, and money market funds to institutional clients and retail investors; and retirement products and services, brokerage, custody, estate planning, lending, deposits, and investment management products to high net worth clients. JPMorgan Chase & Co. was founded in 1799 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:46:31"},{"Company Name":"Western Digital Corporation","Symbol":"WDC","Current Price":"68.43","Latest MA":"66.95","Price Target":86.5,"Difference from MA":"2.22%","Difference from Open":"-0.70%","Change from Yesterday":"-0.41%","Change from Last Report":"0.07","Latest Volume":"1,243,466","Market Cap":"23,656,798,208","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":8.220995,"PB Ratio":2.0335808,"ROE":0.033239998,"DTE":"N\/A","Industry":"Computer Hardware","Sector":"Technology","Beta":1.394,"Trailing PEG":null,"Trailing PE":75.1978,"Trailing PS":1.6487871,"Quick Ratio":0.683,"Day High":69.44,"Day Low":68.35,"VS Average Volume":0.225540723,"Company Summary":"Western Digital Corporation develops, manufactures, and sells data storage devices and solutions in the United States, China, Hong Kong, Europe, the Middle East, Africa, rest of Asia, and internationally. It offers client devices, including hard disk drives (HDDs) and solid state drives (SSDs) for desktop and notebook personal computers (PCs), gaming consoles, and set top boxes; and flash-based embedded storage products for mobile phones, tablets, notebook PCs, and other portable and wearable devices, as well as automotive, Internet of Things, industrial, and connected home applications. The company also provides enterprise HDDs; enterprise SSDs consisting of flash-based SSDs and software solutions for use in enterprise servers, online transactions, artificial intelligence-related workloads, data analysis, and other enterprise applications; and data storage platforms. In addition, it offers external HDD storage products in mobile and desktop form; client portable SSDs; removable cards that are used in consumer devices comprising mobile phones, tablets, imaging systems, and cameras and smart video systems; universal serial bus flash drives for use in the computing and consumer markets; and wireless drive products used in-field backup of created content, as well as wireless streaming of high-definition movies, photos, music, documents to tablets, smartphones, and PCs. The company sells its products under the Western Digital, SanDisk, and WD brands to original equipment manufacturers, distributors, dealers, resellers, and retailers. Western Digital Corporation was founded in 1970 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:46:31"},{"Company Name":"Tesla, Inc.","Symbol":"TSLA","Current Price":"409.51","Latest MA":"284.18","Price Target":317.4917,"Difference from MA":"44.10%","Difference from Open":"-1.18%","Change from Yesterday":"-0.89%","Change from Last Report":"-0.09","Latest Volume":"38,786,595","Market Cap":"1,314,551,758,848","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":125.5688,"PB Ratio":18.779694,"ROE":0.20389,"DTE":18.078,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":2.295,"Trailing PEG":4.9332,"Trailing PE":111.58311,"Trailing PS":13.531156,"Quick Ratio":1.214,"Day High":418.01,"Day Low":407.77,"VS Average Volume":0.4183347869,"Company Summary":"Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners; and provision of service and repairs to its energy product customers, including under warranty, as well as various financing options to its solar customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was incorporated in 2003 and is headquartered in Austin, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"24-01-2025 20:46:31"},{"Company Name":"QUALCOMM Incorporated","Symbol":"QCOM","Current Price":"172.65","Latest MA":"169.90","Price Target":202.92969,"Difference from MA":"1.62%","Difference from Open":"-1.40%","Change from Yesterday":"-1.00%","Change from Last Report":"-0.12","Latest Volume":"2,782,369","Market Cap":"191,814,156,288","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":14.136321,"PB Ratio":7.313818,"ROE":0.42253,"DTE":58.765,"Industry":"Semiconductors","Sector":"Technology","Beta":1.286,"Trailing PEG":1.7221,"Trailing PE":19.31208,"Trailing PS":4.9231086,"Quick Ratio":1.64,"Day High":175.2,"Day Low":171.99,"VS Average Volume":0.3414500622,"Company Summary":"QUALCOMM Incorporated engages in the development and commercialization of foundational technologies for the wireless industry worldwide. It operates through three segments: Qualcomm CDMA Technologies (QCT); Qualcomm Technology Licensing (QTL); and Qualcomm Strategic Initiatives (QSI). The QCT segment develops and supplies integrated circuits and system software with advanced connectivity and high-performance, and low-power computing technologies for use in mobile devices; automotive systems for connectivity, digital cockpit, and ADAS\/AD; and IoT, including consumer electronic devices, industrial devices, and edge networking products. The QTL segment grants licenses or provides rights to use portions of its intellectual property portfolio, which include various patent rights useful in the manufacture and sale of wireless products comprising products implementing CDMA2000, WCDMA, LTE and\/or OFDMA-based 5G products. The QSI segment invests in early-stage companies in various industries, including 5G, artificial intelligence, automotive, consumer, enterprise, cloud, IoT, and extended reality, and investments, including non-marketable equity securities and, to a lesser extent, marketable equity securities, and convertible debt instruments. It also provides development, and other services and sells related products to the United States government agencies and their contractors. The company was incorporated in 1985 and is headquartered in San Diego, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:46:31"},{"Company Name":"e.l.f. Beauty, Inc.","Symbol":"ELF","Current Price":"111.00","Latest MA":"140.33","Price Target":159.95294,"Difference from MA":"-20.90%","Difference from Open":"-6.80%","Change from Yesterday":"-6.00%","Change from Last Report":"0.65","Latest Volume":"1,281,806","Market Cap":"6,252,741,120","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":25.618893,"PB Ratio":8.592661,"ROE":0.1736,"DTE":41.4,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":1.436,"Trailing PEG":null,"Trailing PE":60.0,"Trailing PS":5.1351395,"Quick Ratio":0.783,"Day High":120.19,"Day Low":110.21,"VS Average Volume":0.5813139593,"Company Summary":"e.l.f. Beauty, Inc., together with its subsidiaries, provides cosmetic and skin care products under the e.l.f. Cosmetics, e.l.f. Skin, Well People, Naturium, and Keys Soulcare brand names worldwide. The company offers eye, lip, face, paw, and skin care products. It sells its products through national and international retailers and direct-to-consumer channels, which include e-commerce platforms in the United States, and internationally primarily in the United Kingdom and Canada. The company was formerly known as J.A. Cosmetics Holdings, Inc. and changed its name to e.l.f. Beauty, Inc. in April 2016. e.l.f. Beauty, Inc. was founded in 2004 and is headquartered in Oakland, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"24-01-2025 20:46:31"},{"Company Name":"Microsoft Corporation","Symbol":"MSFT","Current Price":"443.02","Latest MA":"427.03","Price Target":508.3098,"Difference from MA":"3.74%","Difference from Open":"-0.48%","Change from Yesterday":"-0.86%","Change from Last Report":"-0.06","Latest Volume":"7,025,457","Market Cap":"3,293,770,678,272","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":29.541351,"PB Ratio":11.4495125,"ROE":0.35604,"DTE":33.657,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.904,"Trailing PEG":2.3441,"Trailing PE":36.58266,"Trailing PS":12.957909,"Quick Ratio":1.163,"Day High":446.65,"Day Low":441.4,"VS Average Volume":0.3265535162,"Company Summary":"Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services. This segment also provides LinkedIn; and dynamics business solutions, including Dynamics 365, a set of intelligent, cloud-based applications across ERP, CRM, power apps, and power automate; and on-premises ERP and CRM applications. The Intelligent Cloud segment offers server products and cloud services, such as azure and other cloud services; SQL and windows server, visual studio, system center, and related client access licenses, as well as nuance and GitHub; and enterprise services including enterprise support services, industry solutions, and nuance professional services. The More Personal Computing segment offers Windows, including windows OEM licensing and other non-volume licensing of the Windows operating system; Windows commercial comprising volume licensing of the Windows operating system, windows cloud services, and other Windows commercial offerings; patent licensing; and windows Internet of Things; and devices, such as surface, HoloLens, and PC accessories. Additionally, this segment provides gaming, which includes Xbox hardware and content, and first- and third-party content; Xbox game pass and other subscriptions, cloud gaming, advertising, third-party disc royalties, and other cloud services; and search and news advertising, which includes Bing, Microsoft News and Edge, and third-party affiliates. The company sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online, and retail stores. The company was founded in 1975 and is headquartered in Redmond, Washington.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:46:31"},{"Company Name":"Tetra Tech, Inc.","Symbol":"TTEK","Current Price":"38.05","Latest MA":"44.13","Price Target":49.83333,"Difference from MA":"-13.79%","Difference from Open":"-3.52%","Change from Yesterday":"-3.28%","Change from Last Report":"0.03","Latest Volume":"5,346,744","Market Cap":"10,198,465,536","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":23.08397,"PB Ratio":5.5345454,"ROE":0.18655,"DTE":55.515,"Industry":"Engineering & Construction","Sector":"Industrials","Beta":0.939,"Trailing PEG":null,"Trailing PE":30.934958,"Trailing PS":2.4082634,"Quick Ratio":1.111,"Day High":39.51,"Day Low":37.51,"VS Average Volume":2.5079795281,"Company Summary":"Tetra Tech, Inc. provides consulting and engineering services in the United States and internationally. The company operates through two segments, Government Services Group (GSG) and Commercial\/International Services Group (CIG). The GSG segment offers early data collection and monitoring, data analysis and information management, science and engineering applied research, engineering design, project management, and operations and maintenance services; and climate change and energy management consulting, as well as greenhouse gas inventory assessment, certification, reduction, and management services. This segment serves federal, state, and local governments; and development agencies in water resources analysis and water management, environmental monitoring, data analytics, government consulting, waste management, and a range of civil infrastructure master planning and engineering design markets. The CIG segment provides early data collection and monitoring, data analysis and information management, feasibility studies and assessments, science and engineering applied research, engineering design, project management, and operations and maintenance services; and environmental remediation and reconstruction services, and industrial water treatment services. This segment serves natural resources, energy, and utilities markets, as well as sustainable infrastructure master planning and engineering design for facilities, transportation, and local development projects. Tetra Tech, Inc. was founded in 1966 and is headquartered in Pasadena, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"24-01-2025 20:46:31"},{"Company Name":"V.F. Corporation","Symbol":"VFC","Current Price":"26.10","Latest MA":"18.72","Price Target":22.605,"Difference from MA":"39.43%","Difference from Open":"1.99%","Change from Yesterday":"1.89%","Change from Last Report":"-0.17","Latest Volume":"2,981,824","Market Cap":"10,161,226,752","Earning Date":"2025-01-29","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":27.579649,"PB Ratio":7.223914,"ROE":-0.22331,"DTE":524.646,"Industry":"Apparel Manufacturing","Sector":"Consumer Cyclical","Beta":1.545,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":1.006711,"Quick Ratio":0.465,"Day High":26.475,"Day Low":25.565,"VS Average Volume":0.4816835559,"Company Summary":"V.F. Corporation, together with its subsidiaries, engages in the design, procurement, marketing, and distribution of branded lifestyle apparel, footwear, and accessories for men, women, and children in the Americas, Europe, and the Asia-Pacific. It operates through three segments: Outdoor, Active, and Work. The company offers High performance outdoor apparel, footwear, equipment, accessories; outdoor, adventure-inspired lifestyle footwear, apparel, and accessories; performance merino wool and other natural fibers-based apparel and accessories; performance-based footwear; and high performance apparel and accessories based on natural fibers under the The North Face, Timberland, Smartwool, Icebreaker, and Altra brands. It also offers youth culture\/action sports-inspired and streetwear apparel, footwear, and accessories; handbags, luggage, backpacks, totes, and accessories; outdoor-inspired apparel, footwear, and accessories; and backpacks and luggage under the Vans, Supreme, Kipling, Napapijri, Eastpak, and JanSport brands. In addition, the company provides work and work-inspired lifestyle apparel and footwear; and protective work footwear under the Dickies, and Timberland PRO brands. The company sells its products primarily to specialty stores, department stores, national chains, independently-operated partnership stores, and mass merchants, as well as sells through direct-to-consumer operations, including retail stores, concession retail stores, and e-commerce sites, and other digital platforms. V.F. Corporation was founded in 1899 and is headquartered in Denver, Colorado.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"24-01-2025 20:46:31"},{"Company Name":"Alibaba Group Holding Limited","Symbol":"BABA","Current Price":"88.53","Latest MA":"87.07","Price Target":121.08062,"Difference from MA":"1.67%","Difference from Open":"2.09%","Change from Yesterday":"2.80%","Change from Last Report":"-0.01","Latest Volume":"12,417,705","Market Cap":"210,355,748,864","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":1.2488543,"PB Ratio":0.21837644,"ROE":0.05668,"DTE":22.796,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":0.349,"Trailing PEG":0.5725,"Trailing PE":18.290289,"Trailing PS":0.22136931,"Quick Ratio":0.97,"Day High":88.93,"Day Low":86.48,"VS Average Volume":0.891518669,"Company Summary":"Alibaba Group Holding Limited, through its subsidiaries, provides technology infrastructure and marketing reach to help merchants, brands, retailers, and other businesses to engage with their users and customers in the People's Republic of China and internationally. The company operates through seven segments: China Commerce, International Commerce, Local Consumer Services, Cainiao, Cloud, Digital Media and Entertainment, and Innovation Initiatives and Others. It operates Taobao and Tmall, which are digital retail platforms; Alimama, a proprietary monetization platform; 1688.com and Alibaba.com, which are online wholesale marketplaces; AliExpress, a retail marketplace; Lazada, Trendyol, and Daraz that are e-commerce platforms; Freshippo, a retail platform for groceries and fresh goods; and Tmall Global, an import e-commerce platform. The company also operates Cainiao Network logistic services platform; Ele.me, an on-demand delivery and local services platform; Koubei, a restaurant and local services guide platform; and Fliggy, an online travel platform. In addition, it offers pay-for-performance, in-feed, and display marketing services; and Taobao Ad Network and Exchange, a real-time online bidding marketing exchange. Further, the company provides elastic computing, storage, network, security, database, big data, and IoT services; and hardware, software license, software installation, and application development and maintenance services. Additionally, it operates Youku, an online video platform; Quark, a platform for information search, storage, and consumption; Alibaba Pictures and other content platforms that provide online videos, films, live events, news feeds, literature, music, and others; Amap, a mobile digital map, navigation, and real-time traffic information app; DingTalk, a business efficiency mobile app; and Tmall Genie smart speaker. The company was incorporated in 1999 and is based in Hangzhou, the People's Republic of China.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:46:31"},{"Company Name":"Meta Platforms, Inc.","Symbol":"META","Current Price":"647.63","Latest MA":"554.69","Price Target":669.3771,"Difference from MA":"16.76%","Difference from Open":"1.75%","Change from Yesterday":"1.60%","Change from Last Report":"0.02","Latest Volume":"12,829,736","Market Cap":"1,634,935,504,896","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":25.454985,"PB Ratio":9.935109,"ROE":0.36134,"DTE":29.811,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.215,"Trailing PEG":1.4153,"Trailing PE":30.563002,"Trailing PS":10.465128,"Quick Ratio":2.568,"Day High":652.0,"Day Low":634.28,"VS Average Volume":1.0003733348,"Company Summary":"Meta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and wearables worldwide. It operates in two segments, Family of Apps and Reality Labs. The Family of Apps segment offers Facebook, which enables people to share, discuss, discover, and connect with interests; Instagram, a community for sharing photos, videos, and private messages, as well as feed, stories, reels, video, live, and shops; Messenger, a messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls; and WhatsApp, a messaging application that is used by people and businesses to communicate and transact privately. The Reality Labs segment provides augmented and virtual reality related products comprising consumer hardware, software, and content that help people feel connected, anytime, and anywhere. The company was formerly known as Facebook, Inc. and changed its name to Meta Platforms, Inc. in October 2021. The company was incorporated in 2004 and is headquartered in Menlo Park, California","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:46:31"},{"Company Name":"Annaly Capital Management Inc.","Symbol":"NLY","Current Price":"19.53","Latest MA":"18.77","Price Target":20.86364,"Difference from MA":"4.05%","Difference from Open":"0.93%","Change from Yesterday":"0.93%","Change from Last Report":"0.00","Latest Volume":"2,165,086","Market Cap":"10,947,502,080","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":7.0841465,"PB Ratio":0.9992837,"ROE":0.0127,"DTE":687.699,"Industry":"REIT - Mortgage","Sector":"Real Estate","Beta":1.579,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":29.63847,"Quick Ratio":0.371,"Day High":19.55,"Day Low":19.32,"VS Average Volume":0.3263990733,"Company Summary":"Annaly Capital Management, Inc., a diversified capital manager, engages in mortgage finance. The company invests in agency mortgage-backed securities collateralized by residential mortgages; non-agency residential whole loans and securitized products within the residential and commercial markets; mortgage servicing rights; agency commercial mortgage-backed securities; to-be-announced forward contracts; residential mortgage loans; and agency or private label credit risk transfer securities. It has elected to be taxed as a real estate investment trust (REIT). As a REIT, it is not subject to federal income tax to the extent that it distributes its taxable income to its shareholders. The company was incorporated in 1996 and is based in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:46:31"},{"Company Name":"International Business Machines","Symbol":"IBM","Current Price":"225.66","Latest MA":"207.54","Price Target":221.14882,"Difference from MA":"8.73%","Difference from Open":"0.17%","Change from Yesterday":"-0.20%","Change from Last Report":"-0.01","Latest Volume":"1,127,529","Market Cap":"208,650,764,288","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":21.099703,"PB Ratio":8.534606,"ROE":0.26729,"DTE":245.112,"Industry":"Information Technology Services","Sector":"Technology","Beta":0.71,"Trailing PEG":7.4853,"Trailing PE":32.942337,"Trailing PS":3.3341446,"Quick Ratio":0.896,"Day High":226.8104,"Day Low":224.82,"VS Average Volume":0.2812224319,"Company Summary":"International Business Machines Corporation, together with its subsidiaries, provides integrated solutions and services worldwide. The company operates through Software, Consulting, Infrastructure, and Financing segments. The Software segment offers a hybrid cloud and AI platforms that allows clients to realize their digital and AI transformations across the applications, data, and environments in which they operate. The Consulting segment focuses on skills integration for strategy, experience, technology, and operations by domain and industry. The Infrastructure segment provides on-premises and cloud based server, and storage solutions, as well as life-cycle services for hybrid cloud infrastructure deployment. The Financing segment offers client and commercial financing, facilitates IBM clients' acquisition of hardware, software, and services. The company has a strategic partnership to various companies including hyperscalers, service providers, global system integrators, and software and hardware vendors that includes Adobe, Amazon Web services, Microsoft, Oracle, Salesforce, Samsung Electronics and SAP, and others. The company was formerly known as Computing-Tabulating-Recording Co. International Business Machines Corporation was incorporated in 1911 and is headquartered in Armonk, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"24-01-2025 20:46:31"},{"Company Name":"Corning Incorporated","Symbol":"GLW","Current Price":"54.16","Latest MA":"44.67","Price Target":53.20857,"Difference from MA":"21.26%","Difference from Open":"0.09%","Change from Yesterday":"0.25%","Change from Last Report":"0.09","Latest Volume":"2,045,903","Market Cap":"46,372,282,368","Earning Date":"2025-01-29","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":23.466,"PB Ratio":3.9706743,"ROE":0.019299999,"DTE":72.739,"Industry":"Electronic Components","Sector":"Technology","Beta":1.029,"Trailing PEG":0.6908,"Trailing PE":285.05264,"Trailing PS":3.6771295,"Quick Ratio":0.776,"Day High":54.265,"Day Low":53.68,"VS Average Volume":0.4492266392,"Company Summary":"Corning Incorporated engages in the display technologies, optical communications, environmental technologies, specialty materials, and life sciences businesses in the United States and internationally. The company's Display Technologies segment offers glass substrates for flat panel displays, including liquid crystal displays and organic light-emitting diodes that are used in televisions, notebook computers, desktop monitors, tablets, and handheld devices. Its Optical Communications segment provides optical fibers and cables; and hardware and equipment products, such as cable assemblies, fiber optic hardware and connectors, optical components and couplers, closures, network interface devices, and other accessories for the telecommunications industry, businesses, governments, and individuals. The company's Specialty Materials segment manufactures products that offer material formulations for glass, glass ceramics, crystals, precision metrology instruments, and software, as well as glass wafers and substrates, tinted sunglasses, and radiation shielding products for various markets comprising mobile consumer electronics, semiconductor equipment optics and consumables, aerospace and defense optics, radiation shielding products, sunglasses, and telecommunications components. Its Environmental Technologies segment provides ceramic substrates and filter products for emissions control in mobile, gasoline, and diesel applications. The company's Life Sciences segment offers laboratory products, including consumables, such as plastic vessels, liquid handling plastics, specialty surfaces, cell culture media, and serum, as well as general labware, and glassware and equipment under the Corning, Pyrex, Falcon, and Axygen brands. The company was formerly known as Corning Glass Works and changed its name to Corning Incorporated in April 1989. Corning Incorporated was founded in 1851 and is headquartered in Corning, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:46:31"},{"Company Name":"T-Mobile US, Inc.","Symbol":"TMUS","Current Price":"217.73","Latest MA":"207.81","Price Target":244.76,"Difference from MA":"4.77%","Difference from Open":"0.41%","Change from Yesterday":"0.81%","Change from Last Report":"0.02","Latest Volume":"1,263,917","Market Cap":"252,673,474,560","Earning Date":"2025-01-29","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":20.352762,"PB Ratio":3.946672,"ROE":0.16087,"DTE":182.272,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.496,"Trailing PEG":0.8648,"Trailing PE":24.82668,"Trailing PS":3.1581817,"Quick Ratio":0.862,"Day High":218.0,"Day Low":215.7357,"VS Average Volume":0.3476068693,"Company Summary":"T-Mobile US, Inc., together with its subsidiaries, provides mobile communications services in the United States, Puerto Rico, and the United States Virgin Islands. The company offers voice, messaging, and data services to customers in the postpaid, prepaid, and wholesale and other services. It also provides wireless devices, including smartphones, wearables, tablets, home broadband routers, and other mobile communication devices, as well as wireless devices and accessories; financing through equipment installment plans; reinsurance for device insurance policies and extended warranty contracts; leasing through JUMP! On Demand; and High Speed Internet services. In addition, the company offers services, devices, and accessories under the T-Mobile and Metro by T-Mobile brands through its owned and operated retail stores, T-Mobile app and customer care channels, and its websites. It also sells its devices to dealers and other third-party distributors for resale through independent third-party retail outlets and various third-party websites. The company was founded in 1994 and is headquartered in Bellevue, Washington. T-Mobile US, Inc. operates as a subsidiary of Deutsche Telekom AG.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:46:31"},{"Company Name":"General Motors Company","Symbol":"GM","Current Price":"53.95","Latest MA":"49.38","Price Target":60.01462,"Difference from MA":"9.26%","Difference from Open":"-0.44%","Change from Yesterday":"-0.53%","Change from Last Report":"0.14","Latest Volume":"2,947,945","Market Cap":"59,323,420,672","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":5.0053444,"PB Ratio":0.8366157,"ROE":0.14167,"DTE":174.581,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":1.414,"Trailing PEG":8.3019,"Trailing PE":5.7577376,"Trailing PS":0.32467023,"Quick Ratio":0.948,"Day High":54.6,"Day Low":53.705,"VS Average Volume":0.2714804136,"Company Summary":"General Motors Company designs, builds, and sells trucks, crossovers, cars, and automobile parts; and provide software-enabled services and subscriptions worldwide. The company operates through GM North America, GM International, Cruise, and GM Financial segments. It markets its vehicles primarily under the Buick, Cadillac, Chevrolet, GMC, Baojun, and Wuling brand names. In addition, the company sells trucks, crossovers, cars, and automobile parts through retail dealers, and distributors and dealers, as well as to fleet customers, including daily rental car companies, commercial fleet customers, leasing companies, and governments. Further, it offers range of after-sale services through dealer network, such as maintenance, light repairs, collision repairs, vehicle accessories, and extended service warranties. Additionally, the company provides automotive financing; and software-enabled services and subscriptions. General Motors Company was founded in 1908 and is headquartered in Detroit, Michigan.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:46:31"},{"Company Name":"Nextracker Inc.","Symbol":"NXT","Current Price":"40.92","Latest MA":"39.98","Price Target":52.04172,"Difference from MA":"2.36%","Difference from Open":"-1.59%","Change from Yesterday":"-2.35%","Change from Last Report":"-0.13","Latest Volume":"1,093,405","Market Cap":"6,033,939,968","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":12.159643,"PB Ratio":4.6420875,"ROE":0.60612,"DTE":11.396,"Industry":"Solar","Sector":"Technology","Beta":"N\/A","Trailing PEG":4.3923,"Trailing PE":10.23,"Trailing PS":2.1531076,"Quick Ratio":1.794,"Day High":41.93,"Day Low":40.852,"VS Average Volume":0.4082472741,"Company Summary":"Nextracker Inc., an energy solutions company, provides solar tracker and software solutions for utility-scale and distributed generation solar projects in the United States and internationally. The company offers tracking solutions, which includes NX Horizon, a solar tracking solution; and NX Horizon-XTR, a terrain-following tracker designed to expand the addressable market for trackers on sites with sloped, uneven, and challenging terrain. It also provides TrueCapture, a self-adjusting tracker control system, which boosts solar power plant production by optimizing the position of individual tracker row in response to site features, such as varying topography and changing weather conditions; and NX Navigator, that assists solar power plant owners and operators in monitoring, controlling, and protecting their solar projects. The company was founded in 2013 and is headquartered in Fremont, California. As of March 31, 2024 Nextracker Inc. was formerly a subsidiary of Flex Ltd.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:46:31"},{"Company Name":"Qorvo, Inc.","Symbol":"QRVO","Current Price":"88.47","Latest MA":"95.14","Price Target":92.74478,"Difference from MA":"-7.00%","Difference from Open":"-2.32%","Change from Yesterday":"-2.25%","Change from Last Report":"-0.29","Latest Volume":"1,411,221","Market Cap":"8,363,250,176","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":14.4651375,"PB Ratio":2.4560015,"ROE":-0.03908,"DTE":57.517,"Industry":"Semiconductors","Sector":"Technology","Beta":1.487,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":2.1183355,"Quick Ratio":1.267,"Day High":91.28,"Day Low":88.475,"VS Average Volume":0.4493965146,"Company Summary":"Qorvo, Inc. engages in development and commercialization of technologies and products for wireless, wired, and power markets worldwide. It operates through three segments: High Performance Analog (HPA), Connectivity and Sensors Group (CSG), and Advanced Cellular Group (ACG). The HPA segment supplies radio frequency and power management solutions for defense and aerospace, and 5G and 6G infrastructure markets. The CSG segment supplies connectivity and sensor solutions featuring various technologies, such as UWB, Matter, Bluetooth Low Energy, Zigbee, Thread, Wi-Fi, cellular IoT, and MEMS-based sensors. It serves smart home, industrial automation, automotive, smartphones, wearables, gaming, and industrial and enterprise access points markets. The ACG segment supplies cellular RF solutions for smartphones, wearables, laptops, tablets, and various other devices. It also offers foundry services for defense primes and other defense and aerospace customers. The company sells its products directly to original equipment manufacturers and original design manufacturers, as well as through a network of sales representative firms and distributors. Qorvo, Inc. was founded in 1957 and is headquartered in Greensboro, North Carolina.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"24-01-2025 20:46:31"},{"Company Name":"SiriusXM Holdings Inc.","Symbol":"SIRI","Current Price":"21.89","Latest MA":"27.36","Price Target":25.0,"Difference from MA":"-20.00%","Difference from Open":"-1.17%","Change from Yesterday":"-1.04%","Change from Last Report":"-0.05","Latest Volume":"1,511,696","Market Cap":"7,425,131,008","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":6.8331723,"PB Ratio":0.68337905,"ROE":-0.46799,"DTE":98.775,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.05,"Trailing PEG":0.1877,"Trailing PE":"N\/A","Trailing PS":0.8438608,"Quick Ratio":0.26,"Day High":22.25,"Day Low":21.8048,"VS Average Volume":0.2678707682,"Company Summary":"Sirius XM Holdings Inc. operates as an audio entertainment company in North America. It operates in two segments, Sirius XM, and Pandora and Off-platform. The company's Sirius XM segment provides music, sports, entertainment, comedy, talk, news, traffic and weather channels, and other content, as well as podcast and infotainment services on subscription fee basis; and live, curated, and exclusive and on demand programming services through satellite radio systems and streamed through applications for mobile and home devices, and other consumer electronic equipment. This segment also distributes satellite radios through automakers and retailers, as well as its website; podcasts, including true crime, news, politics, music, comedy, sports, and entertainment; and offers location-based services through two-way wireless connectivity, including safety, security, convenience, maintenance and data, remote vehicles diagnostic, and stolen or parked vehicle locator services. In addition, this segment provides music channels on the DISH Network satellite television service as a programming package; Travel Link, a suite of data services that include graphical weather, fuel prices, sports schedule and scores, and movie listings; graphic information related to road closings, traffic flow, and incident data for consumers with in-vehicle navigation systems; real-time weather services in vehicles, boats, and planes; and music programming and commercial-free music services for office, restaurants, and other business. Its Pandora and Off-platform segment operates music, comedy, and podcast streaming platform, which offers personalized experience for listener through computers, tablets, mobile devices, vehicle speakers, and connected devices; and provides advertising services. The company was incorporated in 2013 and is headquartered in New York.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"24-01-2025 20:46:31"},{"Company Name":"Invesco Ltd","Symbol":"IVZ","Current Price":"17.75","Latest MA":"16.84","Price Target":18.4375,"Difference from MA":"5.40%","Difference from Open":"1.43%","Change from Yesterday":"1.00%","Change from Last Report":"-0.03","Latest Volume":"1,494,059","Market Cap":"7,977,560,064","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":9.614343,"PB Ratio":0.7425225,"ROE":-0.00944,"DTE":5.597,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.424,"Trailing PEG":1.461,"Trailing PE":"N\/A","Trailing PS":1.3550227,"Quick Ratio":0.75,"Day High":17.87,"Day Low":17.56,"VS Average Volume":0.4581562546,"Company Summary":"Invesco Ltd. is a publicly owned investment manager. The firm provides its services to retail clients, institutional clients, high-net worth clients, public entities, corporations, unions, non-profit organizations, endowments, foundations, pension funds, financial institutions, and sovereign wealth funds. It manages separate client-focused equity and fixed income portfolios. The firm also launches equity, fixed income, commodity, multi-asset, and balanced mutual funds for its clients. It launches equity, fixed income, multi-asset, and balanced exchange-traded funds. The firm also launches and manages private funds. It invests in the public equity and fixed income markets across the globe. The firm also invests in alternative markets, such as commodities and currencies. For the equity portion of its portfolio, it invests in growth and value stocks of large-cap, mid-cap, and small-cap companies. For the fixed income portion of its portfolio, the firm invests in convertibles, government bonds, municipal bonds, treasury securities, and cash. It also invests in short term and intermediate term bonds, investment grade and high yield bonds, taxable and tax-free bonds, senior secured loans, and structured securities such as asset-backed securities, mortgage-backed securities, and commercial mortgage-backed securities. The firm employs absolute return, global macro, and long\/short strategies. It employs quantitative analysis to make its investments. The firm was formerly known as Invesco Plc, AMVESCAP plc, Amvesco plc, Invesco PLC, Invesco MIM, and H. Lotery & Co. Ltd. Invesco Ltd. was founded in 1935 and is based in Atlanta, Georgia with an additional office in Hamilton, Bermuda.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"24-01-2025 20:46:31"},{"Company Name":"Archer-Daniels-Midland Company","Symbol":"ADM","Current Price":"50.67","Latest MA":"56.46","Price Target":54.81818,"Difference from MA":"-10.25%","Difference from Open":"0.08%","Change from Yesterday":"0.06%","Change from Last Report":"-0.05","Latest Volume":"1,289,181","Market Cap":"24,247,318,528","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":9.946177,"PB Ratio":1.0771455,"ROE":0.1075,"DTE":52.874,"Industry":"Farm Products","Sector":"Consumer Defensive","Beta":0.722,"Trailing PEG":null,"Trailing PE":14.233146,"Trailing PS":0.2731538,"Quick Ratio":0.375,"Day High":50.905,"Day Low":50.225,"VS Average Volume":0.4112659566,"Company Summary":"Archer-Daniels-Midland Company engages in the procurement, transportation, storage, processing, and merchandising of agricultural commodities, ingredients, flavors, and solutions in the United States, Switzerland, the Cayman Islands, Brazil, Mexico, Canada, the United Kingdom, and internationally. It operates in three segments: Ag Services and Oilseeds, Carbohydrate Solutions, and Nutrition. The company originates, merchandises, stores, and transports agricultural raw materials, such as oilseeds and soft seeds. It also engages in the agricultural commodity and feed product import, export, and distribution; and various structured trade finance activities. In addition, the company offers soybean meal and oil; vegetable and salad oils and protein meals; ingredients for the food, feed, energy, and industrial customers; margarine, shortening, and other food products; and partially refined oils to produce biodiesel and glycols for use in chemicals, paints, and other industrial products. Further, it provides peanuts, peanut-derived ingredients, and cotton cellulose pulp; sweeteners, corn and wheat starches, syrup, glucose, wheat flour, and dextrose; alcohol, and other food and animal feed ingredients; ethyl alcohol and ethanol; corn gluten feed and meal; distillers' grains; corn germ; and citric acids. Additionally, the company provides proteins, natural flavors, flavor systems, natural colors, emulsifiers, soluble fiber, polyols, hydrocolloids, probiotics, prebiotics, postbiotics, enzymes, and botanical extracts; and other specialty food and feed ingredients; edible beans; formula feeds, and animal health and nutrition products; and contract and private label pet treats and food products. It also offers futures commission merchant; commodity brokerage services; cash margins and securities pledged to commodity exchange clearinghouse; and cash pledged as security under certain insurance arrangements. The company was founded in 1902 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"24-01-2025 20:46:31"},{"Company Name":"Starbucks Corporation","Symbol":"SBUX","Current Price":"98.83","Latest MA":"90.53","Price Target":103.86621,"Difference from MA":"9.17%","Difference from Open":"1.06%","Change from Yesterday":"0.85%","Change from Last Report":"0.17","Latest Volume":"2,534,706","Market Cap":"112,053,452,800","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":26.593369,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":0.962,"Trailing PEG":2.0499,"Trailing PE":29.858007,"Trailing PS":3.0974357,"Quick Ratio":0.524,"Day High":98.85,"Day Low":97.62,"VS Average Volume":0.318185567,"Company Summary":"Starbucks Corporation, together with its subsidiaries, operates as a roaster, marketer, and retailer of coffee worldwide. The company operates through three segments: North America, International, and Channel Development. Its stores offer coffee, tea, and other beverages, roasted whole beans and ground coffees, single serve products, and ready-to-drink beverages; and various food products, such as pastries, breakfast sandwiches, and lunch items. The company also licenses its trademarks through licensed stores, and grocery and foodservice accounts. The company offers its products under the Starbucks Coffee, Teavana, Seattle's Best Coffee, Ethos, and Starbucks Reserve brands. Starbucks Corporation was founded in 1971 and is based in Seattle, Washington.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:46:31"},{"Company Name":"Synchrony Financial","Symbol":"SYF","Current Price":"70.05","Latest MA":"55.42","Price Target":75.80952,"Difference from MA":"26.40%","Difference from Open":"-0.02%","Change from Yesterday":"-0.60%","Change from Last Report":"0.03","Latest Volume":"1,197,709","Market Cap":"27,273,039,872","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":10.242176,"PB Ratio":1.8474706,"ROE":0.21279,"DTE":"N\/A","Industry":"Credit Services","Sector":"Financial Services","Beta":1.593,"Trailing PEG":1.823,"Trailing PE":9.097234,"Trailing PS":3.0279827,"Quick Ratio":"N\/A","Day High":70.655,"Day Low":70.02,"VS Average Volume":0.341674148,"Company Summary":"Synchrony Financial, together with its subsidiaries, operates as a consumer financial services company in the United States. It provides credit products, such as credit cards, commercial credit products, and consumer installment loans. The company also offers private label credit cards, dual co-brand and general purpose credit cards, short- and long-term installment loans, and consumer banking products; and deposit products, including certificates of deposit, individual retirement accounts, money market accounts, and savings accounts, and sweep and affinity deposits, as well as accepts deposits through third-party securities brokerage firms. In addition, it provides debt cancellation products to its credit card customers through online, mobile, and direct mail; and healthcare payments and financing solutions under the CareCredit and Walgreens brands; payments and financing solutions in the apparel, specialty retail, outdoor, music, and luxury industries, such as American Eagle, Dick's Sporting Goods, Guitar Center, Kawasaki, Pandora, Polaris, Suzuki, and Sweetwater. The company offers its credit products through programs established with a group of national and regional retailers, local merchants, manufacturers, buying groups, industry associations, and healthcare service providers; and deposit products through various channels, such as digital and print. It serves digital, health and wellness, retail, home, auto, telecommunications, jewelry, pets, and other industries. The company was founded in 1932 and is headquartered in Stamford, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:46:31"},{"Company Name":"Sysco Corporation","Symbol":"SYY","Current Price":"74.62","Latest MA":"74.82","Price Target":84.82625,"Difference from MA":"-0.25%","Difference from Open":"1.89%","Change from Yesterday":"1.28%","Change from Last Report":"0.01","Latest Volume":"1,927,178","Market Cap":"36,657,737,728","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":15.1081705,"PB Ratio":16.605474,"ROE":0.88346,"DTE":599.732,"Industry":"Food Distribution","Sector":"Consumer Defensive","Beta":1.2,"Trailing PEG":1.3872,"Trailing PE":19.183804,"Trailing PS":0.45990038,"Quick Ratio":0.695,"Day High":74.65,"Day Low":73.24,"VS Average Volume":0.6653521967,"Company Summary":"Sysco Corporation, through its subsidiaries, engages in the marketing and distribution of various food and related products to the foodservice or food-away-from-home industry in the United States, Canada, the United Kingdom, France, and internationally. The company operates through U.S. Foodservice Operations, International Foodservice Operations, SYGMA, and Other segments. It distributes frozen food, such as meat, seafood, fully prepared entrées, fruits, vegetables, and desserts; canned and dry food products; fresh meat and seafood products; dairy products; beverages; imported specialties; and fresh produce products. The company also supplies various non-food items, including paper products comprising disposable napkins, plates, and cups; tableware consisting of glassware and silverware; cookware, such as pots, pans, and utensils; restaurant and kitchen equipment and supplies; and cleaning supplies. It serves restaurants, hospitals and nursing facilities, schools and colleges, hotels and motels, industrial caterers, and other foodservice venues. The company was incorporated in 1969 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"24-01-2025 20:46:31"},{"Company Name":"Boeing Company (The)","Symbol":"BA","Current Price":"176.08","Latest MA":"165.64","Price Target":185.63,"Difference from MA":"6.31%","Difference from Open":"0.05%","Change from Yesterday":"-1.41%","Change from Last Report":"0.01","Latest Volume":"6,382,049","Market Cap":"131,738,828,800","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":252.0181,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.572,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":1.7974273,"Quick Ratio":0.238,"Day High":180.43,"Day Low":174.365,"VS Average Volume":0.4821354402,"Company Summary":"The Boeing Company, together with its subsidiaries, designs, develops, manufactures, sells, services, and supports commercial jetliners, military aircraft, satellites, missile defense, human space flight and launch systems, and services worldwide. The company operates through Commercial Airplanes; Defense, Space & Security; and Global Services segments. The Commercial Airplanes segment develops, produces, and markets commercial jet aircraft for passenger and cargo requirements, as well as provides fleet support services. The Defense, Space & Security segment engages in the research, development, production, and modification of manned and unmanned military aircraft and weapons systems; strategic defense and intelligence systems, which include strategic missile and defense systems, command, control, communications, computers, intelligence, surveillance and reconnaissance, cyber and information solutions, and intelligence systems; and satellite systems, such as government and commercial satellites, and space exploration. The Global Services segment offers products and services, including supply chain and logistics management, engineering, maintenance and modifications, upgrades and conversions, spare parts, pilot and maintenance training systems and services, technical and maintenance documents, and data analytics and digital services to commercial and defense customers. The Boeing Company was incorporated in 1916 and is based in Arlington, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:46:31"},{"Company Name":"SoFi Technologies, Inc.","Symbol":"SOFI","Current Price":"18.07","Latest MA":"10.52","Price Target":12.6,"Difference from MA":"71.81%","Difference from Open":"-0.47%","Change from Yesterday":"0.10%","Change from Last Report":"-0.08","Latest Volume":"33,610,356","Market Cap":"19,614,087,168","Earning Date":"2025-01-27","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":73.77551,"PB Ratio":3.2013817,"ROE":0.037249997,"DTE":54.394,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.613,"Trailing PEG":null,"Trailing PE":150.62502,"Trailing PS":7.7858057,"Quick Ratio":0.47,"Day High":18.42,"Day Low":17.9,"VS Average Volume":0.6568700581,"Company Summary":"SoFi Technologies, Inc. provides various financial services in the United States, Latin America, and Canada. It operates through three segments: Lending, Technology Platform, and Financial Services. The company offers lending and financial services and products that allows its members to borrow, save, spend, invest, and protect money. It offers personal loans, student loans, home loans, and related services. The company also operates Galileo, a technology platform that offers services to financial and non-financial institution; and Technisys, a cloud-native digital and core banking platform with financial services customers. In addition, it provides SoFi Money offers checking and savings accounts, debit cards, and cash management products; and SoFi Invest, a mobile-first investment platform that provides access to trading and advisory solutions, such as investing and robo-advisory. Further, the company offers SoFi Credit Card that provides cash backs on every purchase; Sofi Relay, a personal finance management product that allows to track all of their financial accounts comprising credit score and spending behaviors; SoFi Protect, which offers insurance product; SoFi Travel, an application that manages travel search and booking experience; SoFi At Work provides financial benefits to employees, including student loan payments made on their employees' behalf; Lantern Credit, a financial services marketplace platform for seeking alternative products and provide product comparisons; and other lending as a service that offers pre-qualified borrower referrals and sells loans to third-party partner. The company was founded in 2011 and is based in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"24-01-2025 20:46:31"},{"Company Name":"RTX Corporation","Symbol":"RTX","Current Price":"125.65","Latest MA":"116.35","Price Target":136.59592,"Difference from MA":"7.99%","Difference from Open":"0.10%","Change from Yesterday":"-0.51%","Change from Last Report":"-0.02","Latest Volume":"1,293,984","Market Cap":"167,242,661,888","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":20.677511,"PB Ratio":2.7365785,"ROE":0.073460005,"DTE":69.597,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":0.54,"Trailing PEG":0.9439,"Trailing PE":36.210373,"Trailing PS":2.1158707,"Quick Ratio":0.602,"Day High":126.27,"Day Low":125.435,"VS Average Volume":0.2790721749,"Company Summary":"RTX Corporation, an aerospace and defense company, provides systems and services for the commercial, military, and government customers in the United States and internationally. It operates through three segments: Collins Aerospace, Pratt & Whitney, and Raytheon. The Collins Aerospace Systems segment offers aerospace and defense products, and aftermarket service solutions for civil and military aircraft manufacturers and commercial airlines, as well as regional, business, and general aviation, defense, and commercial space operations. This segment also designs, produces, and supports cabin interior, including oxygen systems, food and beverage preparation, storage and galley systems, and lavatory and wastewater management systems; battlespace, test and training range systems, crew escape systems, and simulation and training solutions; information management services; and aftermarket services that include spare parts, overhaul and repair, engineering and technical support, training and fleet management solutions, and asset and information management services. Its Pratt & Whitney segment supplies aircraft engines for commercial, military, business jet, and general aviation customers; and produces, sells, and services military and commercial auxiliary power units. The Raytheon segment provides defensive and offensive threat detection, tracking, and mitigation capabilities for U.S., foreign government, and commercial customers. The company was formerly known as Raytheon Technologies Corporation and changed its name to RTX Corporation in July 2023. RTX Corporation was incorporated in 1934 and is headquartered in Arlington, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:46:31"},{"Company Name":"AT&T Inc.","Symbol":"T","Current Price":"22.70","Latest MA":"20.79","Price Target":26.14962,"Difference from MA":"9.23%","Difference from Open":"0.69%","Change from Yesterday":"0.77%","Change from Last Report":"-0.09","Latest Volume":"19,125,515","Market Cap":"162,914,959,360","Earning Date":"2025-01-27","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":10.433468,"PB Ratio":1.5915463,"ROE":0.08759,"DTE":125.151,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.73,"Trailing PEG":1.864,"Trailing PE":18.459349,"Trailing PS":1.3347121,"Quick Ratio":0.42,"Day High":22.79,"Day Low":22.54,"VS Average Volume":0.5595077763,"Company Summary":"AT&T Inc. provides telecommunications and technology services worldwide. The company operates through two segments, Communications and Latin America. The Communications segment offers wireless voice and data communications services; and sells handsets, wireless data cards, wireless computing devices, carrying cases\/protective covers, and wireless chargers through its own company-owned stores, agents, and third-party retail stores. It also provides Virtual Private Networks, AT&T Dedicated Internet, Ethernet, data services, cloud solutions, outsourcing, and managed professional services, as well as customer premises equipment for multinational corporations, small and mid-sized businesses, governmental, and wholesale customers. In addition, this segment offers broadband services, including fiber connections, legacy telephony voice communication services, and other VoIP services and equipment to residential customers. This segment markets its communications services and products under the AT&T, AT&T Business, Cricket, AT&T PREPAID, and AT&T Fiber brand names. The Latin America segment provides postpaid and prepaid wireless services in Mexico under the AT&T and Unefon brand names, as well as sells smartphones through its owned stores, agents and third-party retail stores. The company was formerly known as SBC Communications Inc. and changed its name to AT&T Inc. in 2005. AT&T Inc. was incorporated in 1983 and is based in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-01-2025 20:46:31"}]