[{"Company Name":"Otis Worldwide Corporation","Symbol":"OTIS","Current Price":"95.53","Latest MA":"96.89","Price Target":100.74133,"Difference from MA":"-1.41%","Difference from Open":"1.55%","Change from Yesterday":"-0.35%","Change from Last Report":"-0.12","Latest Volume":"2,178,557","Market Cap":"38,160,506,880","Earning Date":"2025-01-29","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":20.9169,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":0.942,"Trailing PEG":2.5638,"Trailing PE":23.763681,"Trailing PS":2.6862247,"Quick Ratio":0.643,"Day High":96.88,"Day Low":91.93,"VS Average Volume":1.1305662128,"Company Summary":"Otis Worldwide Corporation engages in manufacturing, installation, and servicing of elevators and escalators in the United States, China, and internationally. The company operates in two segments, New Equipment and Service. The New Equipment segment designs, manufactures, sells, and installs a range of passenger and freight elevators, as well as escalators and moving walkways for residential and commercial buildings, and infrastructure projects. This segment serves real-estate and building developers, and general contractors. It sells its products directly to customers, as well as through agents and distributors. The Service segment performs maintenance and repair services, as well as modernization services to upgrade elevators and escalators. Otis Worldwide Corporation was founded in 1853 and is headquartered in Farmington, Connecticut.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"QUALCOMM Incorporated","Symbol":"QCOM","Current Price":"171.61","Latest MA":"169.18","Price Target":202.92969,"Difference from MA":"1.44%","Difference from Open":"0.03%","Change from Yesterday":"0.03%","Change from Last Report":"0.05","Latest Volume":"2,343,009","Market Cap":"189,695,967,232","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":14.052456,"PB Ratio":7.2697616,"ROE":0.42253,"DTE":58.765,"Industry":"Semiconductors","Sector":"Technology","Beta":1.286,"Trailing PEG":1.6944,"Trailing PE":19.195751,"Trailing PS":4.868743,"Quick Ratio":1.64,"Day High":173.49,"Day Low":170.304,"VS Average Volume":0.27995461,"Company Summary":"QUALCOMM Incorporated engages in the development and commercialization of foundational technologies for the wireless industry worldwide. It operates through three segments: Qualcomm CDMA Technologies (QCT); Qualcomm Technology Licensing (QTL); and Qualcomm Strategic Initiatives (QSI). The QCT segment develops and supplies integrated circuits and system software with advanced connectivity and high-performance, and low-power computing technologies for use in mobile devices; automotive systems for connectivity, digital cockpit, and ADAS\/AD; and IoT, including consumer electronic devices, industrial devices, and edge networking products. The QTL segment grants licenses or provides rights to use portions of its intellectual property portfolio, which include various patent rights useful in the manufacture and sale of wireless products comprising products implementing CDMA2000, WCDMA, LTE and\/or OFDMA-based 5G products. The QSI segment invests in early-stage companies in various industries, including 5G, artificial intelligence, automotive, consumer, enterprise, cloud, IoT, and extended reality, and investments, including non-marketable equity securities and, to a lesser extent, marketable equity securities, and convertible debt instruments. It also provides development, and other services and sells related products to the United States government agencies and their contractors. The company was incorporated in 1985 and is headquartered in San Diego, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Tesla, Inc.","Symbol":"TSLA","Current Price":"390.49","Latest MA":"288.42","Price Target":319.46732,"Difference from MA":"35.39%","Difference from Open":"-1.19%","Change from Yesterday":"-1.91%","Change from Last Report":"0.05","Latest Volume":"22,672,457","Market Cap":"1,253,496,324,096","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":119.736664,"PB Ratio":17.907457,"ROE":0.20389,"DTE":18.078,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":2.295,"Trailing PEG":4.8786,"Trailing PE":106.69125,"Trailing PS":12.90269,"Quick Ratio":1.214,"Day High":398.5899,"Day Low":387.7349,"VS Average Volume":0.2530110718,"Company Summary":"Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners; and provision of service and repairs to its energy product customers, including under warranty, as well as various financing options to its solar customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was incorporated in 2003 and is headquartered in Austin, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Danaher Corporation","Symbol":"DHR","Current Price":"225.76","Latest MA":"252.89","Price Target":283.31155,"Difference from MA":"-10.73%","Difference from Open":"-3.94%","Change from Yesterday":"-8.91%","Change from Last Report":"-0.51","Latest Volume":"6,564,210","Market Cap":"163,060,809,728","Earning Date":"2025-01-29","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":24.607334,"PB Ratio":3.1782858,"ROE":0.07586,"DTE":36.69,"Industry":"Diagnostics & Research","Sector":"Healthcare","Beta":0.881,"Trailing PEG":3.3095,"Trailing PE":42.596226,"Trailing PS":6.868032,"Quick Ratio":0.916,"Day High":235.53,"Day Low":225.5223,"VS Average Volume":2.1329641599,"Company Summary":"Danaher Corporation designs, manufactures, and markets professional, medical, industrial, and commercial products and services worldwide. The Biotechnology segments offers bioprocess technologies, consumables, and services that advance, accelerate, and integrate the development and manufacture of therapeutics; cell line and cell culture media development services; cell culture media, process liquids and buffers for manufacturing, chromatography resins, filtration technologies, aseptic fill finish; single-use hardware and consumables and services, such as the design and installation of full manufacturing suites; lab filtration, separation, and purification; lab-scale protein purification and analytical tools; reagents, membranes, and services; and healthcare filtration solutions. The Life Sciences segment provides mass spectrometers; flow cytometry, genomics, lab automation, centrifugation, liquid handling automation instruments, antibodies and reagents, and particle counting and characterization; microscopes; protein consumables; industrial filtration products; and genomic medicines, such as custom nucleic acid products, plasmid DNA, RNA, and proteins under the ABCAM, ALDEVRON, BECKMAN COULTER, IDT, LEICA MICROSYSTEMS, MOLECULAR DEVICES, PALL, PHENOMENEX and SCIEX brands. The Diagnostics segment offers chemistry, immunoassay, microbiology, and automation systems; and molecular, acute care, and pathology diagnostics products. This segment also provides clinical instruments, reagents, consumables, software, and services for hospitals, physicians' offices, reference laboratories, and other critical care settings. The company has a research  collaboration  with Stanford  University's Department  of  Bioengineering for cancer drug development. The company was formerly known as Diversified Mortgage Investors, Inc. and changed its name to Danaher Corporation in 1984. Danaher Corporation was founded in 1969 and is based in Washington, the District of Columbia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Automatic Data Processing, Inc.","Symbol":"ADP","Current Price":"307.39","Latest MA":"277.78","Price Target":299.00732,"Difference from MA":"10.66%","Difference from Open":"1.07%","Change from Yesterday":"3.04%","Change from Last Report":"-0.25","Latest Volume":"1,049,149","Market Cap":"125,248,208,896","Earning Date":"2025-01-29","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":28.227749,"PB Ratio":23.430902,"ROE":0.87263,"DTE":176.65,"Industry":"Software - Application","Sector":"Technology","Beta":0.795,"Trailing PEG":4.0646,"Trailing PE":32.805763,"Trailing PS":6.415451,"Quick Ratio":0.256,"Day High":311.6713,"Day Low":302.295,"VS Average Volume":0.6001969099,"Company Summary":"Automatic Data Processing, Inc. engages in the provision of cloud-based human capital management (HCM) solutions worldwide. It operates in two segments, Employer Services and Professional Employer Organization (PEO). The Employer Services segment offers strategic, cloud-based platforms, and human resources (HR) outsourcing solutions. This segment's offerings include RUN Powered by ADP, a software platform for small business payroll, HR management, and tax compliance administration; ADP Workforce Now, a HCM solution used across mid-sized and large businesses to manage employees; and ADP Vantage HCM, a solution for HR management, benefits administration, payroll services, time and attendance management, and talent management. The PEO Services segment provides HR and employment administration outsourcing solutions under ADP TotalSource name to businesses through a co-employment model. The segment also provides employee benefits, protection and compliance, talent engagement, expertise, comprehensive outsourcing, and recruitment process outsourcing services. The company was founded in 1949 and is headquartered in Roseland, New Jersey.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Western Digital Corporation","Symbol":"WDC","Current Price":"63.24","Latest MA":"66.69","Price Target":85.5,"Difference from MA":"-5.18%","Difference from Open":"-0.77%","Change from Yesterday":"0.59%","Change from Last Report":"0.22","Latest Volume":"2,668,452","Market Cap":"21,862,574,080","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":7.6975327,"PB Ratio":1.8793461,"ROE":0.033239998,"DTE":"N\/A","Industry":"Computer Hardware","Sector":"Technology","Beta":1.394,"Trailing PEG":null,"Trailing PE":69.49451,"Trailing PS":1.5237367,"Quick Ratio":0.683,"Day High":64.14,"Day Low":62.53,"VS Average Volume":0.5004412814,"Company Summary":"Western Digital Corporation develops, manufactures, and sells data storage devices and solutions in the United States, China, Hong Kong, Europe, the Middle East, Africa, rest of Asia, and internationally. It offers client devices, including hard disk drives (HDDs) and solid state drives (SSDs) for desktop and notebook personal computers (PCs), gaming consoles, and set top boxes; and flash-based embedded storage products for mobile phones, tablets, notebook PCs, and other portable and wearable devices, as well as automotive, Internet of Things, industrial, and connected home applications. The company also provides enterprise HDDs; enterprise SSDs consisting of flash-based SSDs and software solutions for use in enterprise servers, online transactions, artificial intelligence-related workloads, data analysis, and other enterprise applications; and data storage platforms. In addition, it offers external HDD storage products in mobile and desktop form; client portable SSDs; removable cards that are used in consumer devices comprising mobile phones, tablets, imaging systems, and cameras and smart video systems; universal serial bus flash drives for use in the computing and consumer markets; and wireless drive products used in-field backup of created content, as well as wireless streaming of high-definition movies, photos, music, documents to tablets, smartphones, and PCs. The company sells its products under the Western Digital, SanDisk, and WD brands to original equipment manufacturers, distributors, dealers, resellers, and retailers. Western Digital Corporation was founded in 1970 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Liberty Energy Inc.","Symbol":"LBRT","Current Price":"20.31","Latest MA":"19.74","Price Target":21.92857,"Difference from MA":"2.89%","Difference from Open":"1.55%","Change from Yesterday":"1.40%","Change from Last Report":"-0.20","Latest Volume":"1,699,430","Market Cap":"3,318,978,816","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":16.017603,"PB Ratio":1.6853373,"ROE":0.18975,"DTE":23.924,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.716,"Trailing PEG":null,"Trailing PE":9.764423,"Trailing PS":0.74641746,"Quick Ratio":0.824,"Day High":20.72,"Day Low":19.97,"VS Average Volume":0.6132823777,"Company Summary":"Liberty Energy Inc. provides hydraulic services and related technologies to onshore oil and natural gas exploration, and production companies in North America. The company offers hydraulic fracturing services, including complementary services, such as wireline services, proppant delivery solutions, field gas processing and treating, compressed natural gas (CNG) delivery, data analytics, related goods comprising sand mine operations, and technologies; and well site fueling and logistics. As of as of December 31, 2023, the company owned and operated a fleet of approximately 40 active hydraulic fracturing; and two sand mines in the Permian Basin. In addition, the company provides services primarily in the Permian Basin, the Williston Basin, the Eagle Ford Shale, the Haynesville Shale, the Appalachian Basin (Marcellus Shale and Utica Shale), the Western Canadian Sedimentary Basin, the Denver-Julesburg Basin (the DJ Basin), and the Anadarko Basin. Liberty Energy Inc. was formerly known as Liberty Oilfield Services Inc. and changed its name to Liberty Energy Inc. in April 2022. The company was founded in 2011 and is headquartered in Denver, Colorado.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Microsoft Corporation","Symbol":"MSFT","Current Price":"443.90","Latest MA":"426.96","Price Target":509.0436,"Difference from MA":"3.97%","Difference from Open":"-0.62%","Change from Yesterday":"-0.73%","Change from Last Report":"-0.05","Latest Volume":"6,901,225","Market Cap":"3,300,343,152,640","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":29.61274,"PB Ratio":11.472359,"ROE":0.35604,"DTE":33.657,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.904,"Trailing PEG":2.3466,"Trailing PE":36.625412,"Trailing PS":12.983765,"Quick Ratio":1.163,"Day High":446.88,"Day Low":440.4,"VS Average Volume":0.3146227137,"Company Summary":"Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services. This segment also provides LinkedIn; and dynamics business solutions, including Dynamics 365, a set of intelligent, cloud-based applications across ERP, CRM, power apps, and power automate; and on-premises ERP and CRM applications. The Intelligent Cloud segment offers server products and cloud services, such as azure and other cloud services; SQL and windows server, visual studio, system center, and related client access licenses, as well as nuance and GitHub; and enterprise services including enterprise support services, industry solutions, and nuance professional services. The More Personal Computing segment offers Windows, including windows OEM licensing and other non-volume licensing of the Windows operating system; Windows commercial comprising volume licensing of the Windows operating system, windows cloud services, and other Windows commercial offerings; patent licensing; and windows Internet of Things; and devices, such as surface, HoloLens, and PC accessories. Additionally, this segment provides gaming, which includes Xbox hardware and content, and first- and third-party content; Xbox game pass and other subscriptions, cloud gaming, advertising, third-party disc royalties, and other cloud services; and search and news advertising, which includes Bing, Microsoft News and Edge, and third-party affiliates. The company sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online, and retail stores. The company was founded in 1975 and is headquartered in Redmond, Washington.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Brinker International, Inc.","Symbol":"EAT","Current Price":"176.66","Latest MA":"96.98","Price Target":144.2,"Difference from MA":"82.17%","Difference from Open":"0.05%","Change from Yesterday":"14.26%","Change from Last Report":"-0.01","Latest Volume":"2,554,284","Market Cap":"7,848,668,160","Earning Date":"2025-01-29","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":23.853954,"PB Ratio":617.6923,"ROE":"N\/A","DTE":15818.898,"Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":2.48,"Trailing PEG":null,"Trailing PE":43.299023,"Trailing PS":1.7281725,"Quick Ratio":0.122,"Day High":180.0,"Day Low":171.2,"VS Average Volume":2.1790550743,"Company Summary":"Brinker International, Inc., together with its subsidiaries, engages in the ownership, development, operation, and franchising of casual dining restaurants in the United States and internationally. The company operates and franchises Chili's Grill & Bar and Maggiano's Little Italy restaurant brands. It also operates virtual brands, It's Just Wings. The company was founded in 1975 and is headquartered in Dallas, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Tetra Tech, Inc.","Symbol":"TTEK","Current Price":"38.16","Latest MA":"44.01","Price Target":49.0,"Difference from MA":"-13.29%","Difference from Open":"-0.81%","Change from Yesterday":"-1.62%","Change from Last Report":"-0.05","Latest Volume":"1,397,109","Market Cap":"10,227,948,544","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":23.150703,"PB Ratio":5.550545,"ROE":0.18655,"DTE":55.515,"Industry":"Engineering & Construction","Sector":"Industrials","Beta":0.939,"Trailing PEG":null,"Trailing PE":31.02439,"Trailing PS":2.4152255,"Quick Ratio":1.111,"Day High":38.78,"Day Low":37.83,"VS Average Volume":0.6000538589,"Company Summary":"Tetra Tech, Inc. provides consulting and engineering services in the United States and internationally. The company operates through two segments, Government Services Group (GSG) and Commercial\/International Services Group (CIG). The GSG segment offers early data collection and monitoring, data analysis and information management, science and engineering applied research, engineering design, project management, and operations and maintenance services; and climate change and energy management consulting, as well as greenhouse gas inventory assessment, certification, reduction, and management services. This segment serves federal, state, and local governments; and development agencies in water resources analysis and water management, environmental monitoring, data analytics, government consulting, waste management, and a range of civil infrastructure master planning and engineering design markets. The CIG segment provides early data collection and monitoring, data analysis and information management, feasibility studies and assessments, science and engineering applied research, engineering design, project management, and operations and maintenance services; and environmental remediation and reconstruction services, and industrial water treatment services. This segment serves natural resources, energy, and utilities markets, as well as sustainable infrastructure master planning and engineering design for facilities, transportation, and local development projects. Tetra Tech, Inc. was founded in 1966 and is headquartered in Pasadena, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Flex Ltd.","Symbol":"FLEX","Current Price":"40.89","Latest MA":"34.68","Price Target":44.72857,"Difference from MA":"17.90%","Difference from Open":"-3.29%","Change from Yesterday":"0.74%","Change from Last Report":"0.15","Latest Volume":"3,143,118","Market Cap":"15,856,446,464","Earning Date":"2025-01-29","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":14.65271,"PB Ratio":3.1855717,"ROE":0.15442,"DTE":83.65,"Industry":"Electronic Components","Sector":"Technology","Beta":1.076,"Trailing PEG":null,"Trailing PE":19.658655,"Trailing PS":0.62306756,"Quick Ratio":0.72,"Day High":42.28,"Day Low":39.93,"VS Average Volume":0.6927549763,"Company Summary":"Flex Ltd. provides manufacturing solutions to various brands in Asia, the Americas, and Europe. It operates through two segments, Flex Agility Solutions (FAS) and Flex Reliability Solutions (FRS). The FAS segment offers flexible supply and manufacturing system comprising communications, enterprise, and cloud solution, which includes data, edge, and communications infrastructure; lifestyle solution, including appliances, consumer packaging, floorcare, micro mobility, and audio; and consumer devices, such as mobile and high velocity consumer devices. Its FRS segment provides complex ramps with specialized production models and critical environments, which comprise automotive including next generation mobility, autonomous, connectivity, electrification, and smart technologies; health solutions, such as medical devices, medical equipment, and drug delivery; and industrial solutions, including capital equipment, industrial devices, embedded and critical power offerings, and renewables and grid edge. In addition, it provides various services, including design and engineering, such as product design and engineering resources that provide design services, product development, systems integration services, and solutions; supply chain comprising manufacturing, customization, procurement, logistics services, and innovative supply chain solutions; manufacturing; logistics and value-added fulfillment, including warehousing and vendor managed inventory, omni-channel fulfillment, kitting, configuration, and postponement; and integrated reverse logistics and circular economy. Further, the company offers embedded and critical power solutions. The company was formerly known as Flextronics International Ltd. and changed its name to Flex Ltd. in September 2016. Flex Ltd. was founded in 1969 and is headquartered in Austin, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Nasdaq, Inc.","Symbol":"NDAQ","Current Price":"81.92","Latest MA":"72.92","Price Target":86.55556,"Difference from MA":"12.33%","Difference from Open":"3.30%","Change from Yesterday":"0.99%","Change from Last Report":"0.46","Latest Volume":"3,744,156","Market Cap":"47,081,304,064","Earning Date":"2025-01-29","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":22.966995,"PB Ratio":4.252232,"ROE":0.10888,"DTE":93.096,"Industry":"Financial Data & Stock Exchanges","Sector":"Financial Services","Beta":0.96,"Trailing PEG":4.3614,"Trailing PE":49.346386,"Trailing PS":6.7096057,"Quick Ratio":0.154,"Day High":81.95,"Day Low":76.34,"VS Average Volume":1.466964122,"Company Summary":"Nasdaq, Inc. operates as a technology company that serves capital markets and other industries worldwide. It operates in three segments: Capital Access Platforms, Financial Technology, and Market Services. The Capital Access Platforms segment sells and distributes historical and real-time market data; and develops and licenses Nasdaq-branded indices and financial products. This segment also offers investor relations intelligence, governance solutions, and ESG solutions; and insights and workflow solutions, as well as operates listing platforms. The Financial Technology segment offers Verafin, a cloud-based platform to detect, investigate, and report money laundering and financial frauds; surveillance solutions, including a SaaS platform to assist in complying with market rules, regulations, and internal market surveillance policies; AxiomSL, a risk data management and regulatory reporting solution; and Calypso, a front-to-back trading technology solution for the financial market. This segment also handles assets, comprising cash equities, equity derivatives, currencies, various interest-bearing securities, commodities, energy products, and digital currencies; and trade management and colocation services. The Market Platforms segment offers equity derivative trading and clearing, cash equity trading, fixed income and commodities trading and clearing, and currency trading services. This segment operates various exchanges and other marketplace facilities across various asset classes which includes derivatives, commodities, cash equity, debt, structured products, and exchange traded products; and provides clearing, settlement, and central depository services. The company was formerly known as The NASDAQ OMX Group, Inc. and changed its name to Nasdaq, Inc. in September 2015. Nasdaq, Inc. was founded in 1971 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Las Vegas Sands Corp.","Symbol":"LVS","Current Price":"44.02","Latest MA":"46.16","Price Target":59.33263,"Difference from MA":"-4.65%","Difference from Open":"1.63%","Change from Yesterday":"1.82%","Change from Last Report":"0.08","Latest Volume":"1,893,527","Market Cap":"31,912,017,920","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":16.081358,"PB Ratio":9.313373,"ROE":0.45166,"DTE":384.206,"Industry":"Resorts & Casinos","Sector":"Consumer Cyclical","Beta":1.117,"Trailing PEG":0.6523,"Trailing PE":21.789604,"Trailing PS":2.8198302,"Quick Ratio":0.864,"Day High":44.15,"Day Low":43.26,"VS Average Volume":0.396742837,"Company Summary":"Las Vegas Sands Corp., together with its subsidiaries, develops, owns, and operates integrated resorts in Macao and Singapore. It owns and operates The Venetian Macao Resort Hotel, the Londoner Macao, The Parisian Macao, The Plaza Macao and Four Seasons Hotel Macao, Cotai Strip, and the Sands Macao in Macao, the People's Republic of China; and Marina Bay Sands in Singapore. The company's integrated resorts feature accommodations, gaming, entertainment and retail malls, convention and exhibition facilities, celebrity chef restaurants, and other amenities. Las Vegas Sands Corp. was founded in 1988 and is based in Las Vegas, Nevada.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"V.F. Corporation","Symbol":"VFC","Current Price":"25.56","Latest MA":"18.96","Price Target":22.9,"Difference from MA":"34.83%","Difference from Open":"-7.86%","Change from Yesterday":"-3.85%","Change from Last Report":"0.24","Latest Volume":"14,116,941","Market Cap":"9,950,993,408","Earning Date":"2025-01-29","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":26.711813,"PB Ratio":7.0744534,"ROE":-0.22331,"DTE":524.646,"Industry":"Apparel Manufacturing","Sector":"Consumer Cyclical","Beta":1.545,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.9858824,"Quick Ratio":0.465,"Day High":29.02,"Day Low":25.0101,"VS Average Volume":2.4600402544,"Company Summary":"V.F. Corporation, together with its subsidiaries, engages in the design, procurement, marketing, and distribution of branded lifestyle apparel, footwear, and accessories for men, women, and children in the Americas, Europe, and the Asia-Pacific. It operates through three segments: Outdoor, Active, and Work. The company offers High performance outdoor apparel, footwear, equipment, accessories; outdoor, adventure-inspired lifestyle footwear, apparel, and accessories; performance merino wool and other natural fibers-based apparel and accessories; performance-based footwear; and high performance apparel and accessories based on natural fibers under the The North Face, Timberland, Smartwool, Icebreaker, and Altra brands. It also offers youth culture\/action sports-inspired and streetwear apparel, footwear, and accessories; handbags, luggage, backpacks, totes, and accessories; outdoor-inspired apparel, footwear, and accessories; and backpacks and luggage under the Vans, Supreme, Kipling, Napapijri, Eastpak, and JanSport brands. In addition, the company provides work and work-inspired lifestyle apparel and footwear; and protective work footwear under the Dickies, and Timberland PRO brands. The company sells its products primarily to specialty stores, department stores, national chains, independently-operated partnership stores, and mass merchants, as well as sells through direct-to-consumer operations, including retail stores, concession retail stores, and e-commerce sites, and other digital platforms. V.F. Corporation was founded in 1899 and is headquartered in Denver, Colorado.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Alibaba Group Holding Limited","Symbol":"BABA","Current Price":"97.88","Latest MA":"87.48","Price Target":120.953445,"Difference from MA":"11.88%","Difference from Open":"-1.52%","Change from Yesterday":"1.91%","Change from Last Report":"-0.17","Latest Volume":"55,496,815","Market Cap":"232,546,107,392","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":1.3807582,"PB Ratio":0.24144132,"ROE":0.05668,"DTE":22.796,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":0.349,"Trailing PEG":0.6385,"Trailing PE":20.138887,"Trailing PS":0.24472149,"Quick Ratio":0.97,"Day High":101.27,"Day Low":96.45,"VS Average Volume":3.8501728515,"Company Summary":"Alibaba Group Holding Limited, through its subsidiaries, provides technology infrastructure and marketing reach to help merchants, brands, retailers, and other businesses to engage with their users and customers in the People's Republic of China and internationally. The company operates through seven segments: China Commerce, International Commerce, Local Consumer Services, Cainiao, Cloud, Digital Media and Entertainment, and Innovation Initiatives and Others. It operates Taobao and Tmall, which are digital retail platforms; Alimama, a proprietary monetization platform; 1688.com and Alibaba.com, which are online wholesale marketplaces; AliExpress, a retail marketplace; Lazada, Trendyol, and Daraz that are e-commerce platforms; Freshippo, a retail platform for groceries and fresh goods; and Tmall Global, an import e-commerce platform. The company also operates Cainiao Network logistic services platform; Ele.me, an on-demand delivery and local services platform; Koubei, a restaurant and local services guide platform; and Fliggy, an online travel platform. In addition, it offers pay-for-performance, in-feed, and display marketing services; and Taobao Ad Network and Exchange, a real-time online bidding marketing exchange. Further, the company provides elastic computing, storage, network, security, database, big data, and IoT services; and hardware, software license, software installation, and application development and maintenance services. Additionally, it operates Youku, an online video platform; Quark, a platform for information search, storage, and consumption; Alibaba Pictures and other content platforms that provide online videos, films, live events, news feeds, literature, music, and others; Amap, a mobile digital map, navigation, and real-time traffic information app; DingTalk, a business efficiency mobile app; and Tmall Genie smart speaker. The company was incorporated in 1999 and is based in Hangzhou, the People's Republic of China.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"General Dynamics Corporation","Symbol":"GD","Current Price":"254.04","Latest MA":"285.52","Price Target":304.94843,"Difference from MA":"-11.03%","Difference from Open":"0.09%","Change from Yesterday":"-3.25%","Change from Last Report":"-0.22","Latest Volume":"1,599,701","Market Cap":"69,853,118,464","Earning Date":"2025-01-29","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":14.527072,"PB Ratio":3.0357783,"ROE":0.16952999,"DTE":48.609,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":0.614,"Trailing PEG":1.5234,"Trailing PE":19.348057,"Trailing PS":1.517029,"Quick Ratio":0.722,"Day High":261.31,"Day Low":247.01,"VS Average Volume":1.0359093876,"Company Summary":"General Dynamics Corporation operates as an aerospace and defense company worldwide. It operates through four segments: Aerospace, Marine Systems, Combat Systems, and Technologies. The Aerospace segment produces and sells business jets; and offers aircraft maintenance and repair, management, aircraft-on-ground support and completion, charter, staffing, and fixed-base operator services. The Marine Systems segment designs and builds nuclear-powered submarines, surface combatants, and auxiliary ships for the United States Navy and Jones Act ships for commercial customers, as well as builds crude oil and product tankers, and container and cargo ships; provides maintenance, modernization, and lifecycle support services for navy ships; offers and program management, planning, engineering, and design support services for submarine construction programs. The Combat Systems segment manufactures land combat solutions, such as wheeled and tracked combat vehicles, Stryker wheeled combat vehicles, piranha vehicles, weapons systems, munitions, mobile bridge systems with payloads, tactical vehicles, main battle tanks, armored vehicles, and armaments; and offers modernization programs, engineering, support, and sustainment services. The Technologies segment provides information technology solutions and mission support services; mobile communication, computers, and command-and-control mission systems; intelligence, surveillance, and reconnaissance solutions to military, intelligence, and federal civilian customers; cloud computing, artificial intelligence; machine learning; big data analytics; development, security, and operations; and unmanned undersea vehicle manufacturing and assembly services. The company was founded in 1899 and is headquartered in Reston, Virginia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Meta Platforms, Inc.","Symbol":"META","Current Price":"676.68","Latest MA":"558.14","Price Target":672.0384,"Difference from MA":"21.24%","Difference from Open":"0.28%","Change from Yesterday":"0.34%","Change from Last Report":"0.13","Latest Volume":"7,006,226","Market Cap":"1,708,271,861,760","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":26.578976,"PB Ratio":10.380757,"ROE":0.36134,"DTE":29.811,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.215,"Trailing PEG":1.4322,"Trailing PE":31.9641,"Trailing PS":10.93455,"Quick Ratio":2.568,"Day High":676.68,"Day Low":665.67,"VS Average Volume":0.5237567533,"Company Summary":"Meta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and wearables worldwide. It operates in two segments, Family of Apps and Reality Labs. The Family of Apps segment offers Facebook, which enables people to share, discuss, discover, and connect with interests; Instagram, a community for sharing photos, videos, and private messages, as well as feed, stories, reels, video, live, and shops; Messenger, a messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls; and WhatsApp, a messaging application that is used by people and businesses to communicate and transact privately. The Reality Labs segment provides augmented and virtual reality related products comprising consumer hardware, software, and content that help people feel connected, anytime, and anywhere. The company was formerly known as Facebook, Inc. and changed its name to Meta Platforms, Inc. in October 2021. The company was incorporated in 2004 and is headquartered in Menlo Park, California","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Annaly Capital Management Inc.","Symbol":"NLY","Current Price":"19.82","Latest MA":"18.80","Price Target":20.95455,"Difference from MA":"5.43%","Difference from Open":"-0.23%","Change from Yesterday":"-0.38%","Change from Last Report":"-0.05","Latest Volume":"2,137,251","Market Cap":"11,112,863,744","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":7.189275,"PB Ratio":1.0143778,"ROE":0.0127,"DTE":687.699,"Industry":"REIT - Mortgage","Sector":"Real Estate","Beta":1.579,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":30.086157,"Quick Ratio":0.371,"Day High":20.03,"Day Low":19.82,"VS Average Volume":0.3240694031,"Company Summary":"Annaly Capital Management, Inc., a diversified capital manager, engages in mortgage finance. The company invests in agency mortgage-backed securities collateralized by residential mortgages; non-agency residential whole loans and securitized products within the residential and commercial markets; mortgage servicing rights; agency commercial mortgage-backed securities; to-be-announced forward contracts; residential mortgage loans; and agency or private label credit risk transfer securities. It has elected to be taxed as a real estate investment trust (REIT). As a REIT, it is not subject to federal income tax to the extent that it distributes its taxable income to its shareholders. The company was incorporated in 1996 and is based in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"International Business Machines","Symbol":"IBM","Current Price":"226.61","Latest MA":"208.63","Price Target":220.8547,"Difference from MA":"8.62%","Difference from Open":"0.44%","Change from Yesterday":"0.37%","Change from Last Report":"0.06","Latest Volume":"1,683,786","Market Cap":"209,533,796,352","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":21.186544,"PB Ratio":8.570726,"ROE":0.26729,"DTE":245.112,"Industry":"Information Technology Services","Sector":"Technology","Beta":0.71,"Trailing PEG":7.4727,"Trailing PE":33.033527,"Trailing PS":3.3482552,"Quick Ratio":0.896,"Day High":227.84,"Day Low":223.73,"VS Average Volume":0.4309161767,"Company Summary":"International Business Machines Corporation, together with its subsidiaries, provides integrated solutions and services worldwide. The company operates through Software, Consulting, Infrastructure, and Financing segments. The Software segment offers a hybrid cloud and AI platforms that allows clients to realize their digital and AI transformations across the applications, data, and environments in which they operate. The Consulting segment focuses on skills integration for strategy, experience, technology, and operations by domain and industry. The Infrastructure segment provides on-premises and cloud based server, and storage solutions, as well as life-cycle services for hybrid cloud infrastructure deployment. The Financing segment offers client and commercial financing, facilitates IBM clients' acquisition of hardware, software, and services. The company has a strategic partnership to various companies including hyperscalers, service providers, global system integrators, and software and hardware vendors that includes Adobe, Amazon Web services, Microsoft, Oracle, Salesforce, Samsung Electronics and SAP, and others. The company was formerly known as Computing-Tabulating-Recording Co. International Business Machines Corporation was incorporated in 1911 and is headquartered in Armonk, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"T-Mobile US, Inc.","Symbol":"TMUS","Current Price":"237.94","Latest MA":"208.84","Price Target":244.76,"Difference from MA":"13.94%","Difference from Open":"-0.02%","Change from Yesterday":"7.60%","Change from Last Report":"0.26","Latest Volume":"4,885,576","Market Cap":"276,126,990,336","Earning Date":"2025-01-29","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":22.24857,"PB Ratio":4.313008,"ROE":0.16087,"DTE":182.272,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.496,"Trailing PEG":0.8852,"Trailing PE":27.10023,"Trailing PS":3.4513288,"Quick Ratio":0.862,"Day High":241.4,"Day Low":233.245,"VS Average Volume":1.3505811376,"Company Summary":"T-Mobile US, Inc., together with its subsidiaries, provides mobile communications services in the United States, Puerto Rico, and the United States Virgin Islands. The company offers voice, messaging, and data services to customers in the postpaid, prepaid, and wholesale and other services. It also provides wireless devices, including smartphones, wearables, tablets, home broadband routers, and other mobile communication devices, as well as wireless devices and accessories; financing through equipment installment plans; reinsurance for device insurance policies and extended warranty contracts; leasing through JUMP! On Demand; and High Speed Internet services. In addition, the company offers services, devices, and accessories under the T-Mobile and Metro by T-Mobile brands through its owned and operated retail stores, T-Mobile app and customer care channels, and its websites. It also sells its devices to dealers and other third-party distributors for resale through independent third-party retail outlets and various third-party websites. The company was founded in 1994 and is headquartered in Bellevue, Washington. T-Mobile US, Inc. operates as a subsidiary of Deutsche Telekom AG.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Corning Incorporated","Symbol":"GLW","Current Price":"50.63","Latest MA":"44.89","Price Target":53.35143,"Difference from MA":"12.79%","Difference from Open":"-8.13%","Change from Yesterday":"-1.16%","Change from Last Report":"-0.04","Latest Volume":"8,738,015","Market Cap":"43,349,864,448","Earning Date":"2025-01-29","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":18.921091,"PB Ratio":3.7118769,"ROE":0.019299999,"DTE":72.739,"Industry":"Electronic Components","Sector":"Technology","Beta":1.029,"Trailing PEG":0.6556,"Trailing PE":266.4737,"Trailing PS":3.4374645,"Quick Ratio":0.776,"Day High":55.33,"Day Low":49.61,"VS Average Volume":1.9008494855,"Company Summary":"Corning Incorporated engages in the display technologies, optical communications, environmental technologies, specialty materials, and life sciences businesses in the United States and internationally. The company's Display Technologies segment offers glass substrates for flat panel displays, including liquid crystal displays and organic light-emitting diodes that are used in televisions, notebook computers, desktop monitors, tablets, and handheld devices. Its Optical Communications segment provides optical fibers and cables; and hardware and equipment products, such as cable assemblies, fiber optic hardware and connectors, optical components and couplers, closures, network interface devices, and other accessories for the telecommunications industry, businesses, governments, and individuals. The company's Specialty Materials segment manufactures products that offer material formulations for glass, glass ceramics, crystals, precision metrology instruments, and software, as well as glass wafers and substrates, tinted sunglasses, and radiation shielding products for various markets comprising mobile consumer electronics, semiconductor equipment optics and consumables, aerospace and defense optics, radiation shielding products, sunglasses, and telecommunications components. Its Environmental Technologies segment provides ceramic substrates and filter products for emissions control in mobile, gasoline, and diesel applications. The company's Life Sciences segment offers laboratory products, including consumables, such as plastic vessels, liquid handling plastics, specialty surfaces, cell culture media, and serum, as well as general labware, and glassware and equipment under the Corning, Pyrex, Falcon, and Axygen brands. The company was formerly known as Corning Glass Works and changed its name to Corning Incorporated in April 1989. Corning Incorporated was founded in 1851 and is headquartered in Corning, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"SiriusXM Holdings Inc.","Symbol":"SIRI","Current Price":"22.08","Latest MA":"27.30","Price Target":24.76923,"Difference from MA":"-19.10%","Difference from Open":"0.39%","Change from Yesterday":"0.13%","Change from Last Report":"-0.07","Latest Volume":"1,507,801","Market Cap":"7,491,173,888","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":6.992148,"PB Ratio":0.68945736,"ROE":-0.46799,"DTE":98.775,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.05,"Trailing PEG":0.1871,"Trailing PE":"N\/A","Trailing PS":0.8513665,"Quick Ratio":0.26,"Day High":22.32,"Day Low":21.66,"VS Average Volume":0.2699840531,"Company Summary":"Sirius XM Holdings Inc. operates as an audio entertainment company in North America. It operates in two segments, Sirius XM, and Pandora and Off-platform. The company's Sirius XM segment provides music, sports, entertainment, comedy, talk, news, traffic and weather channels, and other content, as well as podcast and infotainment services on subscription fee basis; and live, curated, and exclusive and on demand programming services through satellite radio systems and streamed through applications for mobile and home devices, and other consumer electronic equipment. This segment also distributes satellite radios through automakers and retailers, as well as its website; podcasts, including true crime, news, politics, music, comedy, sports, and entertainment; and offers location-based services through two-way wireless connectivity, including safety, security, convenience, maintenance and data, remote vehicles diagnostic, and stolen or parked vehicle locator services. In addition, this segment provides music channels on the DISH Network satellite television service as a programming package; Travel Link, a suite of data services that include graphical weather, fuel prices, sports schedule and scores, and movie listings; graphic information related to road closings, traffic flow, and incident data for consumers with in-vehicle navigation systems; real-time weather services in vehicles, boats, and planes; and music programming and commercial-free music services for office, restaurants, and other business. Its Pandora and Off-platform segment operates music, comedy, and podcast streaming platform, which offers personalized experience for listener through computers, tablets, mobile devices, vehicle speakers, and connected devices; and provides advertising services. The company was incorporated in 2013 and is headquartered in New York.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"General Motors Company","Symbol":"GM","Current Price":"49.78","Latest MA":"49.45","Price Target":60.05308,"Difference from MA":"0.66%","Difference from Open":"-0.99%","Change from Yesterday":"-0.52%","Change from Last Report":"0.12","Latest Volume":"6,832,416","Market Cap":"54,738,087,936","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":4.5124545,"PB Ratio":0.7719505,"ROE":0.14167,"DTE":174.581,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":1.414,"Trailing PEG":7.6619,"Trailing PE":7.8147564,"Trailing PS":0.29957524,"Quick Ratio":0.948,"Day High":50.6,"Day Low":49.12,"VS Average Volume":0.6116626363,"Company Summary":"General Motors Company designs, builds, and sells trucks, crossovers, cars, and automobile parts; and provide software-enabled services and subscriptions worldwide. The company operates through GM North America, GM International, Cruise, and GM Financial segments. It markets its vehicles primarily under the Buick, Cadillac, Chevrolet, GMC, Baojun, and Wuling brand names. In addition, the company sells trucks, crossovers, cars, and automobile parts through retail dealers, and distributors and dealers, as well as to fleet customers, including daily rental car companies, commercial fleet customers, leasing companies, and governments. Further, it offers range of after-sale services through dealer network, such as maintenance, light repairs, collision repairs, vehicle accessories, and extended service warranties. Additionally, the company provides automotive financing; and software-enabled services and subscriptions. General Motors Company was founded in 1908 and is headquartered in Detroit, Michigan.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Qorvo, Inc.","Symbol":"QRVO","Current Price":"88.09","Latest MA":"94.62","Price Target":92.59682,"Difference from MA":"-6.90%","Difference from Open":"4.53%","Change from Yesterday":"2.69%","Change from Last Report":"0.23","Latest Volume":"3,061,199","Market Cap":"8,326,857,216","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":15.459647,"PB Ratio":2.3728583,"ROE":-0.03908,"DTE":57.517,"Industry":"Semiconductors","Sector":"Technology","Beta":1.487,"Trailing PEG":null,"Trailing PE":314.60712,"Trailing PS":2.1091175,"Quick Ratio":1.267,"Day High":88.39,"Day Low":82.51,"VS Average Volume":0.9323940959,"Company Summary":"Qorvo, Inc. engages in development and commercialization of technologies and products for wireless, wired, and power markets worldwide. It operates through three segments: High Performance Analog (HPA), Connectivity and Sensors Group (CSG), and Advanced Cellular Group (ACG). The HPA segment supplies radio frequency and power management solutions for defense and aerospace, and 5G and 6G infrastructure markets. The CSG segment supplies connectivity and sensor solutions featuring various technologies, such as UWB, Matter, Bluetooth Low Energy, Zigbee, Thread, Wi-Fi, cellular IoT, and MEMS-based sensors. It serves smart home, industrial automation, automotive, smartphones, wearables, gaming, and industrial and enterprise access points markets. The ACG segment supplies cellular RF solutions for smartphones, wearables, laptops, tablets, and various other devices. It also offers foundry services for defense primes and other defense and aerospace customers. The company sells its products directly to original equipment manufacturers and original design manufacturers, as well as through a network of sales representative firms and distributors. Qorvo, Inc. was founded in 1957 and is headquartered in Greensboro, North Carolina.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Nextracker Inc.","Symbol":"NXT","Current Price":"47.89","Latest MA":"39.74","Price Target":54.2831,"Difference from MA":"20.52%","Difference from Open":"-3.68%","Change from Yesterday":"20.87%","Change from Last Report":"-0.46","Latest Volume":"6,854,404","Market Cap":"7,061,715,456","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":13.354564,"PB Ratio":7.014794,"ROE":0.60612,"DTE":11.396,"Industry":"Solar","Sector":"Technology","Beta":"N\/A","Trailing PEG":4.1543,"Trailing PE":11.9725,"Trailing PS":2.5198517,"Quick Ratio":1.794,"Day High":49.98,"Day Low":46.43,"VS Average Volume":2.4919749974,"Company Summary":"Nextracker Inc., an energy solutions company, provides solar tracker and software solutions for utility-scale and distributed generation solar projects in the United States and internationally. The company offers tracking solutions, which includes NX Horizon, a solar tracking solution; and NX Horizon-XTR, a terrain-following tracker designed to expand the addressable market for trackers on sites with sloped, uneven, and challenging terrain. It also provides TrueCapture, a self-adjusting tracker control system, which boosts solar power plant production by optimizing the position of individual tracker row in response to site features, such as varying topography and changing weather conditions; and NX Navigator, that assists solar power plant owners and operators in monitoring, controlling, and protecting their solar projects. The company was founded in 2013 and is headquartered in Fremont, California. As of March 31, 2024 Nextracker Inc. was formerly a subsidiary of Flex Ltd.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Lockheed Martin Corporation","Symbol":"LMT","Current Price":"453.16","Latest MA":"528.52","Price Target":550.4318,"Difference from MA":"-14.26%","Difference from Open":"-1.49%","Change from Yesterday":"-0.94%","Change from Last Report":"-0.04","Latest Volume":"1,043,983","Market Cap":"106,667,524,096","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":15.2699375,"PB Ratio":14.853809,"ROE":0.81037,"DTE":268.347,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":0.481,"Trailing PEG":3.7698,"Trailing PE":20.302868,"Trailing PS":1.4961431,"Quick Ratio":1.096,"Day High":462.49,"Day Low":449.4,"VS Average Volume":0.8057799444,"Company Summary":"Lockheed Martin Corporation, a security and aerospace company, engages in the research, design, development, manufacture, integration, and sustainment of technology systems, products, and services worldwide. The company operates through Aeronautics, Missiles and Fire Control, Rotary and Mission Systems, and Space segments. The Aeronautics segment offers combat and air mobility aircraft, unmanned air vehicles, and related technologies. The Missiles and Fire Control segment provides air and missile defense systems; tactical missiles and air-to-ground precision strike weapon systems; logistics; fire control systems; mission operations support, readiness, engineering support, and integration services; manned and unmanned ground vehicles; and energy management solutions. The Rotary and Mission Systems segment offers military and commercial helicopters, surface ships, sea and land-based missile defense systems, radar systems, sea and air-based mission and combat systems, command and control mission solutions, cyber solutions, and simulation and training solutions. The Space segment offers satellites; space transportation systems; strategic, advanced strike, and defensive systems; and classified systems and services in support of national security systems. This segment also provides network-enabled situational awareness and integrates space and ground global systems to help its customers gather, analyze, and securely distribute critical intelligence data. It serves primarily serves the U.S. government, as well as foreign military sales contracted through the U.S. government. The company was formerly known as The Lockheed Corporation and changed its name to Lockheed Martin Corporation in March 1995. Lockheed Martin Corporation was founded in 1912 and is based in Bethesda, Maryland.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Royal Caribbean Cruises Ltd.","Symbol":"RCL","Current Price":"267.87","Latest MA":"195.70","Price Target":267.7857,"Difference from MA":"36.88%","Difference from Open":"0.63%","Change from Yesterday":"0.99%","Change from Last Report":"0.22","Latest Volume":"1,098,205","Market Cap":"72,030,240,768","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":15.528182,"PB Ratio":10.223266,"ROE":0.44263,"DTE":298.394,"Industry":"Travel Services","Sector":"Consumer Cyclical","Beta":2.6,"Trailing PEG":0.6988,"Trailing PE":24.329699,"Trailing PS":4.486468,"Quick Ratio":0.087,"Day High":271.2098,"Day Low":265.3201,"VS Average Volume":0.5319703935,"Company Summary":"Royal Caribbean Cruises Ltd. operates as a cruise company worldwide. The company operates cruises under the Royal Caribbean International, Celebrity Cruises, and Silversea Cruises brands, which comprise a range of itineraries. As of February 21, 2024, it operated 65 ships. Royal Caribbean Cruises Ltd. was founded in 1968 and is headquartered in Miami, Florida.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"F5, Inc.","Symbol":"FFIV","Current Price":"299.86","Latest MA":"220.99","Price Target":292.44168,"Difference from MA":"35.69%","Difference from Open":"-2.14%","Change from Yesterday":"11.17%","Change from Last Report":"0.02","Latest Volume":"1,452,082","Market Cap":"17,396,406,272","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":19.302605,"PB Ratio":5.5666733,"ROE":0.19117,"DTE":6.895,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.05,"Trailing PEG":1.5751,"Trailing PE":29.807154,"Trailing PS":6.177438,"Quick Ratio":0.983,"Day High":308.0,"Day Low":277.9,"VS Average Volume":2.7831738657,"Company Summary":"F5, Inc. provides multicloud application security and delivery solutions in the United States, Europe, the Middle East, Africa, and the Asia Pacific region. The company's distributed cloud services enable its customers to deploy, secure, and operate applications in any architecture, from on-premises to the public cloud. It offers unified, security, networking, and application management solutions, such as web app and API protection; multi-cloud networking; application delivery and deployment; domain name system; content delivery network; and application deployment and orchestration. The company also provides application security and delivery products, including NGINX Plus; NGINX Management Suite; NGINX Ingress Controller; NGINX App Protect; BIG-IP Packaged Software; and BIG-IP Systems. In addition, it provides a range of professional services, including maintenance, consulting, training, and other technical support services. F5, Inc. sells its products to large enterprise businesses, public sector institutions, governments, and service providers through distributors, value-added resellers, managed service providers, systems integrators, and other indirect channel partners. It has partnerships with public cloud providers, such as Amazon Web Services, Microsoft Azure, and Google Cloud Platform. The company was formerly known as F5 Networks, Inc. and changed its name to F5, Inc. in November 2021. F5, Inc. was incorporated in 1996 and is headquartered in Seattle, Washington.","Stock Sentiment":"N\/A","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"PACCAR Inc.","Symbol":"PCAR","Current Price":"111.31","Latest MA":"101.59","Price Target":115.34667,"Difference from MA":"9.57%","Difference from Open":"1.20%","Change from Yesterday":"3.79%","Change from Last Report":"0.14","Latest Volume":"1,207,407","Market Cap":"58,373,586,944","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":12.002316,"PB Ratio":3.126826,"ROE":0.27142,"DTE":83.654,"Industry":"Farm & Heavy Construction Machinery","Sector":"Industrials","Beta":0.89,"Trailing PEG":null,"Trailing PE":14.090507,"Trailing PS":1.6758176,"Quick Ratio":4.733,"Day High":111.9,"Day Low":109.75,"VS Average Volume":0.5342454479,"Company Summary":"PACCAR Inc designs, manufactures, and distributes light, medium, and heavy-duty commercial trucks in the United States, Canada, Europe, Mexico, South America, Australia, and internationally. It operates through three segments: Truck, Parts, and Financial Services. The Truck segment designs, manufactures, and distributes trucks for the over-the-road and off-highway hauling of commercial and consumer goods. It sells its trucks through a network of independent dealers under the Kenworth, Peterbilt, and DAF nameplates. The Parts segment distributes aftermarket parts for trucks and related commercial vehicles. The Financial Services segment conducts full-service leasing operations under the PacLease trade name, as well as provides finance and leasing products and services to customers and dealers. This segment also offers equipment financing and administrative support services for its franchisees; retail loan and leasing services for small, medium, and large commercial trucking companies, as well as independent owners\/operators and other businesses; and truck inventory financing services to independent dealers. In addition, this segment offers loans and leases directly to customers for the acquisition of trucks and related equipment. The company also manufactures and markets industrial winches under the Braden, Carco, and Gearmatic nameplates. PACCAR Inc was founded in 1905 and is headquartered in Bellevue, Washington.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Packaging Corporation of Americ","Symbol":"PKG","Current Price":"216.23","Latest MA":"214.93","Price Target":236.32,"Difference from MA":"0.60%","Difference from Open":"-1.76%","Change from Yesterday":"-9.30%","Change from Last Report":"-0.38","Latest Volume":"1,269,374","Market Cap":"19,418,511,360","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":16.916758,"PB Ratio":4.5224104,"ROE":0.18972,"DTE":64.596,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":0.777,"Trailing PEG":3.062,"Trailing PE":25.201632,"Trailing PS":2.375324,"Quick Ratio":1.806,"Day High":232.5,"Day Low":212.3401,"VS Average Volume":1.7264757086,"Company Summary":"Packaging Corporation of America manufactures and sells containerboard and corrugated packaging products in the United States. The company operates through three segments: Packaging, Paper, and Corporate and Other. The Packaging segment offers various containerboard and corrugated packaging products, such as conventional shipping containers used to protect and transport manufactured goods; multi-color boxes and displays that help to merchandise the packaged product in retail locations; and honeycomb protective packaging products, as well as packaging for meat, fresh fruit and vegetables, processed food, beverages, and other industrial and consumer products. This segment sells its corrugated products through a direct sales and marketing organization, independent brokers, and distribution partners. The Paper segment manufactures and sells commodity and specialty papers, as well as communication papers, including cut-size office papers, and printing and converting papers. This segment sells white papers through its sales and marketing organization. The Corporate and Other segment includes corporate support staff services and related assets and liabilities; and transportation assets, such as rail cars and trucks for transportation. Packaging Corporation of America was founded in 1867 and is headquartered in Lake Forest, Illinois.","Stock Sentiment":"N\/A","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Synchrony Financial","Symbol":"SYF","Current Price":"68.69","Latest MA":"55.90","Price Target":76.57143,"Difference from MA":"22.87%","Difference from Open":"2.82%","Change from Yesterday":"3.04%","Change from Last Report":"0.02","Latest Volume":"2,217,347","Market Cap":"26,670,385,152","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":8.11654,"PB Ratio":1.8115042,"ROE":0.21279,"DTE":"N\/A","Industry":"Credit Services","Sector":"Financial Services","Beta":1.593,"Trailing PEG":1.7005,"Trailing PE":8.033333,"Trailing PS":2.9610732,"Quick Ratio":"N\/A","Day High":69.055,"Day Low":66.55,"VS Average Volume":0.6118100314,"Company Summary":"Synchrony Financial, together with its subsidiaries, operates as a consumer financial services company in the United States. It provides credit products, such as credit cards, commercial credit products, and consumer installment loans. The company also offers private label credit cards, dual co-brand and general purpose credit cards, short- and long-term installment loans, and consumer banking products; and deposit products, including certificates of deposit, individual retirement accounts, money market accounts, and savings accounts, and sweep and affinity deposits, as well as accepts deposits through third-party securities brokerage firms. In addition, it provides debt cancellation products to its credit card customers through online, mobile, and direct mail; and healthcare payments and financing solutions under the CareCredit and Walgreens brands; payments and financing solutions in the apparel, specialty retail, outdoor, music, and luxury industries, such as American Eagle, Dick's Sporting Goods, Guitar Center, Kawasaki, Pandora, Polaris, Suzuki, and Sweetwater. The company offers its credit products through programs established with a group of national and regional retailers, local merchants, manufacturers, buying groups, industry associations, and healthcare service providers; and deposit products through various channels, such as digital and print. It serves digital, health and wellness, retail, home, auto, telecommunications, jewelry, pets, and other industries. The company was founded in 1932 and is headquartered in Stamford, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Starbucks Corporation","Symbol":"SBUX","Current Price":"107.04","Latest MA":"91.00","Price Target":105.53733,"Difference from MA":"17.62%","Difference from Open":"4.23%","Change from Yesterday":"6.62%","Change from Last Report":"0.08","Latest Volume":"18,776,114","Market Cap":"121,589,948,416","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":29.143185,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":0.962,"Trailing PEG":2.1005,"Trailing PE":34.529034,"Trailing PS":3.3610482,"Quick Ratio":0.524,"Day High":107.58,"Day Low":102.68,"VS Average Volume":2.3228594157,"Company Summary":"Starbucks Corporation, together with its subsidiaries, operates as a roaster, marketer, and retailer of coffee worldwide. The company operates through three segments: North America, International, and Channel Development. Its stores offer coffee, tea, and other beverages, roasted whole beans and ground coffees, single serve products, and ready-to-drink beverages; and various food products, such as pastries, breakfast sandwiches, and lunch items. The company also licenses its trademarks through licensed stores, and grocery and foodservice accounts. The company offers its products under the Starbucks Coffee, Teavana, Seattle's Best Coffee, Ethos, and Starbucks Reserve brands. Starbucks Corporation was founded in 1971 and is based in Seattle, Washington.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Stryker Corporation","Symbol":"SYK","Current Price":"389.45","Latest MA":"358.58","Price Target":415.88287,"Difference from MA":"8.61%","Difference from Open":"-1.41%","Change from Yesterday":"-1.53%","Change from Last Report":"0.25","Latest Volume":"1,213,316","Market Cap":"148,464,582,656","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":26.196342,"PB Ratio":7.368272,"ROE":0.18868,"DTE":79.443,"Industry":"Medical Devices","Sector":"Healthcare","Beta":0.92,"Trailing PEG":2.7593,"Trailing PE":50.31654,"Trailing PS":6.756375,"Quick Ratio":1.098,"Day High":395.26,"Day Low":386.77,"VS Average Volume":0.8937785495,"Company Summary":"Stryker Corporation operates as a medical technology company. The company operates through two segments, MedSurg and Neurotechnology, and Orthopaedics and Spine. The Orthopaedics and Spine segment provides implants for use in total joint replacements, such as hip, knee and shoulder, and trauma and extremities surgeries. This segment also offers spinal implant products comprising cervical and thoracolumbar systems that include fixation, minimally invasive and interbody systems used in spinal injury, complex spine and degenerative therapies. The MedSurg and Neurotechnology segment offers surgical equipment, and surgical navigation systems, endoscopic and communications systems, patient handling, emergency medical equipment and intensive care disposable products, reprocessed and remanufactured medical devices, clinical communication and workflow solutions, and other medical device products that are used in various medical specialties, as well as patient and caregiver safety technologies. This segment also provides neurosurgical, neurovascular and craniomaxillofacial implant products, which include products used for minimally invasive endovascular procedures; products for brain and open skull based surgical procedures; orthobiologic and biosurgery products, such as synthetic bone grafts and vertebral augmentation products; minimally invasive products for the treatment of acute ischemic and hemorrhagic stroke; and craniomaxillofacial implant products, including cranial, maxillofacial, and chest wall devices, as well as dural substitutes and sealants. The company sells its products to doctors, hospitals, and other healthcare facilities through company-owned subsidiaries and branches, as well as third-party dealers and distributors in approximately 75 countries. Stryker Corporation was founded in 1941 and is headquartered in Portage, Michigan.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Invesco Ltd","Symbol":"IVZ","Current Price":"19.30","Latest MA":"16.92","Price Target":19.45312,"Difference from MA":"14.06%","Difference from Open":"-0.21%","Change from Yesterday":"-0.21%","Change from Last Report":"0.03","Latest Volume":"3,578,287","Market Cap":"8,646,400,000","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":9.303087,"PB Ratio":0.80736244,"ROE":-0.00944,"DTE":5.597,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.424,"Trailing PEG":1.6416,"Trailing PE":16.355932,"Trailing PS":1.4686279,"Quick Ratio":0.75,"Day High":19.35,"Day Low":18.86,"VS Average Volume":1.0167543587,"Company Summary":"Invesco Ltd. is a publicly owned investment manager. The firm provides its services to retail clients, institutional clients, high-net worth clients, public entities, corporations, unions, non-profit organizations, endowments, foundations, pension funds, financial institutions, and sovereign wealth funds. It manages separate client-focused equity and fixed income portfolios. The firm also launches equity, fixed income, commodity, multi-asset, and balanced mutual funds for its clients. It launches equity, fixed income, multi-asset, and balanced exchange-traded funds. The firm also launches and manages private funds. It invests in the public equity and fixed income markets across the globe. The firm also invests in alternative markets, such as commodities and currencies. For the equity portion of its portfolio, it invests in growth and value stocks of large-cap, mid-cap, and small-cap companies. For the fixed income portion of its portfolio, the firm invests in convertibles, government bonds, municipal bonds, treasury securities, and cash. It also invests in short term and intermediate term bonds, investment grade and high yield bonds, taxable and tax-free bonds, senior secured loans, and structured securities such as asset-backed securities, mortgage-backed securities, and commercial mortgage-backed securities. The firm employs absolute return, global macro, and long\/short strategies. It employs quantitative analysis to make its investments. The firm was formerly known as Invesco Plc, AMVESCAP plc, Amvesco plc, Invesco PLC, Invesco MIM, and H. Lotery & Co. Ltd. Invesco Ltd. was founded in 1935 and is based in Atlanta, Georgia with an additional office in Hamilton, Bermuda.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Boeing Company (The)","Symbol":"BA","Current Price":"173.53","Latest MA":"165.60","Price Target":188.505,"Difference from MA":"4.79%","Difference from Open":"-3.12%","Change from Yesterday":"-2.40%","Change from Last Report":"0.18","Latest Volume":"7,379,891","Market Cap":"130,011,455,488","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":41.90736,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.572,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":1.7738591,"Quick Ratio":0.238,"Day High":182.55,"Day Low":170.65,"VS Average Volume":0.600027335,"Company Summary":"The Boeing Company, together with its subsidiaries, designs, develops, manufactures, sells, services, and supports commercial jetliners, military aircraft, satellites, missile defense, human space flight and launch systems, and services worldwide. The company operates through Commercial Airplanes; Defense, Space & Security; and Global Services segments. The Commercial Airplanes segment develops, produces, and markets commercial jet aircraft for passenger and cargo requirements, as well as provides fleet support services. The Defense, Space & Security segment engages in the research, development, production, and modification of manned and unmanned military aircraft and weapons systems; strategic defense and intelligence systems, which include strategic missile and defense systems, command, control, communications, computers, intelligence, surveillance and reconnaissance, cyber and information solutions, and intelligence systems; and satellite systems, such as government and commercial satellites, and space exploration. The Global Services segment offers products and services, including supply chain and logistics management, engineering, maintenance and modifications, upgrades and conversions, spare parts, pilot and maintenance training systems and services, technical and maintenance documents, and data analytics and digital services to commercial and defense customers. The Boeing Company was incorporated in 1916 and is based in Arlington, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Sysco Corporation","Symbol":"SYY","Current Price":"72.25","Latest MA":"74.85","Price Target":83.82625,"Difference from MA":"-3.48%","Difference from Open":"-0.74%","Change from Yesterday":"-0.01%","Change from Last Report":"0.03","Latest Volume":"2,391,796","Market Cap":"35,364,061,184","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":14.608059,"PB Ratio":19.10365,"ROE":0.88346,"DTE":599.732,"Industry":"Food Distribution","Sector":"Consumer Defensive","Beta":1.2,"Trailing PEG":1.362,"Trailing PE":18.52564,"Trailing PS":0.44367018,"Quick Ratio":0.695,"Day High":73.27,"Day Low":71.92,"VS Average Volume":0.7966869386,"Company Summary":"Sysco Corporation, through its subsidiaries, engages in the marketing and distribution of various food and related products to the foodservice or food-away-from-home industry in the United States, Canada, the United Kingdom, France, and internationally. The company operates through U.S. Foodservice Operations, International Foodservice Operations, SYGMA, and Other segments. It distributes frozen food, such as meat, seafood, fully prepared entrées, fruits, vegetables, and desserts; canned and dry food products; fresh meat and seafood products; dairy products; beverages; imported specialties; and fresh produce products. The company also supplies various non-food items, including paper products comprising disposable napkins, plates, and cups; tableware consisting of glassware and silverware; cookware, such as pots, pans, and utensils; restaurant and kitchen equipment and supplies; and cleaning supplies. It serves restaurants, hospitals and nursing facilities, schools and colleges, hotels and motels, industrial caterers, and other foodservice venues. The company was incorporated in 1969 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"BXP, Inc.","Symbol":"BXP","Current Price":"70.63","Latest MA":"74.17","Price Target":82.11111,"Difference from MA":"-4.77%","Difference from Open":"0.30%","Change from Yesterday":"-3.48%","Change from Last Report":"0.10","Latest Volume":"1,715,982","Market Cap":"12,461,815,808","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":32.349667,"PB Ratio":1.937457,"ROE":0.058280002,"DTE":205.408,"Industry":"REIT - Office","Sector":"Real Estate","Beta":1.195,"Trailing PEG":2.0518,"Trailing PE":30.708694,"Trailing PS":3.7266138,"Quick Ratio":0.902,"Day High":72.07,"Day Low":69.53,"VS Average Volume":1.4127692296,"Company Summary":"BXP, Inc. (NYSE: BXP) is the largest publicly traded developer, owner, and manager of premier workplaces in the United States, concentrated in six dynamic gateway markets - Boston, Los Angeles, New York, San Francisco, Seattle, and Washington, DC. BXP has delivered places that power progress for our clients and communities for more than 50 years. BXP is a fully integrated real estate company, organized as a real estate investment trust (REIT). Including properties owned by unconsolidated joint ventures, BXP's portfolio totals 53.0 million square feet and 184 properties, including 9 properties under construction\/redevelopment.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"RTX Corporation","Symbol":"RTX","Current Price":"126.15","Latest MA":"116.81","Price Target":139.55045,"Difference from MA":"7.99%","Difference from Open":"-0.98%","Change from Yesterday":"-1.71%","Change from Last Report":"-0.20","Latest Volume":"2,203,092","Market Cap":"167,908,179,968","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":18.597034,"PB Ratio":2.7474682,"ROE":0.073460005,"DTE":69.597,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":0.54,"Trailing PEG":0.9593,"Trailing PE":35.435394,"Trailing PS":2.1242905,"Quick Ratio":0.602,"Day High":129.75,"Day Low":125.5887,"VS Average Volume":0.4686223334,"Company Summary":"RTX Corporation, an aerospace and defense company, provides systems and services for the commercial, military, and government customers in the United States and internationally. It operates through three segments: Collins Aerospace, Pratt & Whitney, and Raytheon. The Collins Aerospace Systems segment offers aerospace and defense products, and aftermarket service solutions for civil and military aircraft manufacturers and commercial airlines, as well as regional, business, and general aviation, defense, and commercial space operations. This segment also designs, produces, and supports cabin interior, including oxygen systems, food and beverage preparation, storage and galley systems, and lavatory and wastewater management systems; battlespace, test and training range systems, crew escape systems, and simulation and training solutions; information management services; and aftermarket services that include spare parts, overhaul and repair, engineering and technical support, training and fleet management solutions, and asset and information management services. Its Pratt & Whitney segment supplies aircraft engines for commercial, military, business jet, and general aviation customers; and produces, sells, and services military and commercial auxiliary power units. The Raytheon segment provides defensive and offensive threat detection, tracking, and mitigation capabilities for U.S., foreign government, and commercial customers. The company was formerly known as Raytheon Technologies Corporation and changed its name to RTX Corporation in July 2023. RTX Corporation was incorporated in 1934 and is headquartered in Arlington, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Nucor Corporation","Symbol":"NUE","Current Price":"127.20","Latest MA":"143.44","Price Target":156.38083,"Difference from MA":"-11.32%","Difference from Open":"0.36%","Change from Yesterday":"0.50%","Change from Last Report":"-0.36","Latest Volume":"1,249,974","Market Cap":"29,868,800,000","Earning Date":"2025-01-27","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":11.498033,"PB Ratio":1.4589449,"ROE":0.13221,"DTE":32.901,"Industry":"Steel","Sector":"Basic Materials","Beta":1.567,"Trailing PEG":null,"Trailing PE":15.018004,"Trailing PS":0.95235956,"Quick Ratio":1.497,"Day High":128.78,"Day Low":125.77,"VS Average Volume":0.5375561758,"Company Summary":"Nucor Corporation engages in manufacture and sale of steel and steel products. It operates in three segments: steel mills, steel products, and raw materials. The Steel Mills segment produces hot-rolled, cold-rolled, and galvanized sheet steel products; plate steel products; wide-flange beams, beam blanks, and H-piling and sheet piling structural steel products; bar steel products, such as blooms, billets, concrete reinforcing and merchant bars, and engineered special bar quality products; and engages in the steel trading and rebar distribution businesses. This segment sells its products to steel service centers, fabricators, and manufacturers in the United States, Canada, and Mexico. The Steel Products segment offers steel joists and joist girders, steel decks, and galvanized torque tubes for used in solar arrays, hollow structural section steel tubing, electrical conduit, fabricated concrete reinforcing steel, cold finished steel, steel fasteners, steel grating and expanded metal, wire and wire mesh, metal building systems, insulated metal panels, steel racking, overhead doors, and utility towers and structures for communications and energy transmission. This segment is also involved in the piling distribution business. The Raw Materials segment produces direct reduced iron (DRI); brokers ferrous and nonferrous metals, pig iron, hot briquetted iron, and DRI; supplies ferro-alloys; processes ferrous and nonferrous scrap metal; and engages in the natural gas production and industrial gas business. This segment sells its ferrous scrap to electric arc furnace steel mills and foundries for manufacturing process; and nonferrous scrap metal to aluminum can producers, secondary aluminum smelters, steel mills and other processors, and consumers of various nonferrous metals. It markets its products through in-house sales force; and internal distribution and trading companies. Nucor Corporation was founded in 1905 and is headquartered in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"SoFi Technologies, Inc.","Symbol":"SOFI","Current Price":"16.05","Latest MA":"10.71","Price Target":13.23333,"Difference from MA":"49.86%","Difference from Open":"-0.28%","Change from Yesterday":"-0.80%","Change from Last Report":"0.15","Latest Volume":"16,328,069","Market Cap":"17,586,006,016","Earning Date":"2025-01-27","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":34.576702,"PB Ratio":2.8436062,"ROE":0.037249997,"DTE":54.394,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.613,"Trailing PEG":null,"Trailing PE":41.166668,"Trailing PS":6.9807596,"Quick Ratio":0.47,"Day High":16.34,"Day Low":15.86,"VS Average Volume":0.3274768415,"Company Summary":"SoFi Technologies, Inc. provides various financial services in the United States, Latin America, and Canada. It operates through three segments: Lending, Technology Platform, and Financial Services. The company offers lending and financial services and products that allows its members to borrow, save, spend, invest, and protect money. It offers personal loans, student loans, home loans, and related services. The company also operates Galileo, a technology platform that offers services to financial and non-financial institution; and Technisys, a cloud-native digital and core banking platform with financial services customers. In addition, it provides SoFi Money offers checking and savings accounts, debit cards, and cash management products; and SoFi Invest, a mobile-first investment platform that provides access to trading and advisory solutions, such as investing and robo-advisory. Further, the company offers SoFi Credit Card that provides cash backs on every purchase; Sofi Relay, a personal finance management product that allows to track all of their financial accounts comprising credit score and spending behaviors; SoFi Protect, which offers insurance product; SoFi Travel, an application that manages travel search and booking experience; SoFi At Work provides financial benefits to employees, including student loan payments made on their employees' behalf; Lantern Credit, a financial services marketplace platform for seeking alternative products and provide product comparisons; and other lending as a service that offers pre-qualified borrower referrals and sells loans to third-party partner. The company was founded in 2011 and is based in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"AT&T Inc.","Symbol":"T","Current Price":"24.46","Latest MA":"20.92","Price Target":26.515,"Difference from MA":"16.92%","Difference from Open":"-1.01%","Change from Yesterday":"0.27%","Change from Last Report":"0.02","Latest Volume":"14,030,983","Market Cap":"175,524,954,112","Earning Date":"2025-01-27","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":10.921495,"PB Ratio":1.7145661,"ROE":0.08759,"DTE":125.151,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.73,"Trailing PEG":2.0187,"Trailing PE":16.416107,"Trailing PS":1.4380219,"Quick Ratio":0.42,"Day High":24.98,"Day Low":24.44,"VS Average Volume":0.3903145623,"Company Summary":"AT&T Inc. provides telecommunications and technology services worldwide. The company operates through two segments, Communications and Latin America. The Communications segment offers wireless voice and data communications services; and sells handsets, wireless data cards, wireless computing devices, carrying cases\/protective covers, and wireless chargers through its own company-owned stores, agents, and third-party retail stores. It also provides Virtual Private Networks, AT&T Dedicated Internet, Ethernet, data services, cloud solutions, outsourcing, and managed professional services, as well as customer premises equipment for multinational corporations, small and mid-sized businesses, governmental, and wholesale customers. In addition, this segment offers broadband services, including fiber connections, legacy telephony voice communication services, and other VoIP services and equipment to residential customers. This segment markets its communications services and products under the AT&T, AT&T Business, Cricket, AT&T PREPAID, and AT&T Fiber brand names. The Latin America segment provides postpaid and prepaid wireless services in Mexico under the AT&T and Unefon brand names, as well as sells smartphones through its owned stores, agents and third-party retail stores. The company was formerly known as SBC Communications Inc. and changed its name to AT&T Inc. in 2005. AT&T Inc. was incorporated in 1983 and is based in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Verizon Communications Inc.","Symbol":"VZ","Current Price":"40.20","Latest MA":"40.58","Price Target":47.66043,"Difference from MA":"-0.92%","Difference from Open":"-1.51%","Change from Yesterday":"-0.46%","Change from Last Report":"-0.02","Latest Volume":"8,947,114","Market Cap":"169,248,178,176","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.242074,"PB Ratio":1.757058,"ROE":0.10431,"DTE":182.615,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.418,"Trailing PEG":1.0863,"Trailing PE":9.711353,"Trailing PS":1.2608161,"Quick Ratio":0.51,"Day High":40.88,"Day Low":40.05,"VS Average Volume":0.449488523,"Company Summary":"Verizon Communications Inc., through its subsidiaries, engages in the provision of communications, technology, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide. It operates in two segments, Verizon Consumer Group (Consumer) and Verizon Business Group (Business). The Consumer segment provides wireless services across the wireless networks in the United States under the Verizon and TracFone brands and through wholesale and other arrangements; and fixed wireless access (FWA) broadband through its wireless networks, as well as related equipment and devices, such as smartphones, tablets, smart watches, and other wireless-enabled connected devices. The segment also offers wireline services in the Mid-Atlantic and Northeastern United States, as well as Washington D.C. through its fiber-optic network, Verizon Fios product portfolio, and a copper-based network. The Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and conferencing, corporate networking, security and managed network, local and long-distance voice, and network access services to deliver various IoT services and products to businesses, government customers, and wireless and wireline carriers in the United States and internationally. The company was formerly known as Bell Atlantic Corporation and changed its name to Verizon Communications Inc. in June 2000. Verizon Communications Inc. was incorporated in 1983 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Texas Instruments Incorporated","Symbol":"TXN","Current Price":"181.05","Latest MA":"198.07","Price Target":205.69379,"Difference from MA":"-8.59%","Difference from Open":"0.02%","Change from Yesterday":"0.28%","Change from Last Report":"-0.02","Latest Volume":"1,438,740","Market Cap":"165,156,896,768","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":25.04205,"PB Ratio":9.562163,"ROE":0.29293,"DTE":84.399,"Industry":"Semiconductors","Sector":"Technology","Beta":0.98,"Trailing PEG":1.7474,"Trailing PE":34.81731,"Trailing PS":10.512182,"Quick Ratio":3.048,"Day High":181.67,"Day Low":179.85,"VS Average Volume":0.233610041,"Company Summary":"Texas Instruments Incorporated designs, manufactures, and sells semiconductors to electronics designers and manufacturers in the United States and internationally. The company operates through Analog and Embedded Processing segments. The Analog segment offers power products to manage power requirements across various voltage levels, including battery-management solutions, DC\/DC switching regulators, AC\/DC and isolated controllers and converters, power switches, linear regulators, voltage references, and lighting products. This segment provides signal chain products that sense, condition, and measure signals to allow information to be transferred or converted for further processing and control, including amplifiers, data converters, interface products, motor drives, clocks, and logic and sensing products. The Embedded Processing segment offers microcontrollers that are used in electronic equipment; digital signal processors for mathematical computations; and applications processors for specific computing activity. This segment offers products for use in various markets, such as industrial, automotive, personal electronics, communications equipment, enterprise systems, and calculators and other. It provides DLP products primarily for use in project high-definition images; calculators; and application-specific integrated circuits. The company markets and sells its semiconductor products through direct sales and distributors, as well as through its website. Texas Instruments Incorporated was founded in 1930 and is headquartered in Dallas, Texas.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"American Airlines Group, Inc.","Symbol":"AAL","Current Price":"17.11","Latest MA":"13.07","Price Target":20.87,"Difference from MA":"30.89%","Difference from Open":"-0.15%","Change from Yesterday":"-0.26%","Change from Last Report":"0.06","Latest Volume":"10,611,942","Market Cap":"11,247,666,176","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":5.5701733,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Airlines","Sector":"Industrials","Beta":1.399,"Trailing PEG":0.2367,"Trailing PE":13.794354,"Trailing PS":0.20979364,"Quick Ratio":0.422,"Day High":17.23,"Day Low":16.9405,"VS Average Volume":0.3902233872,"Company Summary":"American Airlines Group Inc., through its subsidiaries, operates as a network air carrier. The company provides scheduled air transportation services for passengers and cargo through its hubs in Charlotte, Chicago, Dallas\/Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix, and Washington, D.C., as well as through partner gateways in London, Doha, Madrid, Seattle\/Tacoma, Sydney, and Tokyo. It operates a mainline fleet of 965 aircraft. The company was formerly known as AMR Corporation and changed its name to American Airlines Group Inc. in December 2013. American Airlines Group Inc. was founded in 1926 and is headquartered in Fort Worth, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"NextEra Energy, Inc.","Symbol":"NEE","Current Price":"71.19","Latest MA":"76.30","Price Target":84.81476,"Difference from MA":"-6.70%","Difference from Open":"0.62%","Change from Yesterday":"0.92%","Change from Last Report":"-0.02","Latest Volume":"3,586,351","Market Cap":"146,395,119,616","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":17.8371,"PB Ratio":2.9249353,"ROE":0.09887999,"DTE":139.015,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.561,"Trailing PEG":3.6464,"Trailing PE":21.12463,"Trailing PS":5.577807,"Quick Ratio":0.258,"Day High":71.52,"Day Low":70.755,"VS Average Volume":0.3206287893,"Company Summary":"NextEra Energy, Inc., through its subsidiaries, generates, transmits, distributes, and sells electric power to retail and wholesale customers in North America. The company generates electricity through wind, solar, nuclear,natural gas, and other clean energy. It also develops, constructs, and operates long-term contracted assets that consists of clean energy solutions, such as renewable generation facilities, battery storage projects, and electric transmission facilities; sells energy commodities; and owns, develops, constructs, manages and operates electric generation facilities in wholesale energy markets. The company had approximately 33,276 megawatts of net generating capacity; approximately 90,000 circuit miles of transmission and distribution lines; and 883 substations. It serves approximately 12 million people through approximately 5.9 million customer accounts in the east and lower west coasts of Florida. The company was formerly known as FPL Group, Inc. and changed its name to NextEra Energy, Inc. in 2010. NextEra Energy, Inc. was founded in 1925 and is headquartered in Juno Beach, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Union Pacific Corporation","Symbol":"UNP","Current Price":"252.28","Latest MA":"237.39","Price Target":263.07928,"Difference from MA":"6.27%","Difference from Open":"1.03%","Change from Yesterday":"1.25%","Change from Last Report":"-0.04","Latest Volume":"1,443,572","Market Cap":"152,946,524,160","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":18.726414,"PB Ratio":9.232571,"ROE":0.43396,"DTE":197.154,"Industry":"Railroads","Sector":"Industrials","Beta":1.056,"Trailing PEG":2.5924,"Trailing PE":22.74842,"Trailing PS":6.2972054,"Quick Ratio":0.56,"Day High":252.98,"Day Low":249.055,"VS Average Volume":0.5302170053,"Company Summary":"Union Pacific Corporation, through its subsidiary, Union Pacific Railroad Company, operates in the railroad business in the United States. The company offers transportation services for grain and grain products, fertilizers, food and refrigerated products, and coal and renewables to grain processors, animal feeders, ethanol producers, renewable biofuel producers, and other agricultural users; and construction products, industrial chemicals, plastics, forest products, specialized products, metals and ores, petroleum, liquid petroleum gases, soda ash, and sand, as well as finished automobiles, automotive parts, and merchandise in intermodal containers. Union Pacific Corporation was founded in 1862 and is headquartered in Omaha, Nebraska.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"GE Aerospace","Symbol":"GE","Current Price":"199.49","Latest MA":"174.21","Price Target":225.06589,"Difference from MA":"14.51%","Difference from Open":"2.34%","Change from Yesterday":"2.59%","Change from Last Report":"0.12","Latest Volume":"2,060,273","Market Cap":"214,190,424,064","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":31.052265,"PB Ratio":11.439303,"ROE":0.22552,"DTE":110.224,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.188,"Trailing PEG":16.0294,"Trailing PE":32.756977,"Trailing PS":3.061919,"Quick Ratio":0.804,"Day High":199.94,"Day Low":194.93,"VS Average Volume":0.3926110856,"Company Summary":"General Electric Company, doing business as GE Aerospace, designs and produces commercial and defense aircraft engines, integrated engine components, electric power, and mechanical aircraft systems. It also offers aftermarket services to support its products. The company operates in the United States, Europe, China, Asia, the Americas, the Middle East, and Africa. General Electric Company was incorporated in 1892 and is based in Evendale, Ohio.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"CSX Corporation","Symbol":"CSX","Current Price":"33.15","Latest MA":"33.79","Price Target":37.08923,"Difference from MA":"-1.90%","Difference from Open":"1.21%","Change from Yesterday":"1.42%","Change from Last Report":"-0.08","Latest Volume":"6,837,884","Market Cap":"63,917,481,984","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":15.617049,"PB Ratio":4.943326,"ROE":0.29458,"DTE":147.913,"Industry":"Railroads","Sector":"Industrials","Beta":1.191,"Trailing PEG":2.1745,"Trailing PE":18.51676,"Trailing PS":4.3537555,"Quick Ratio":1.195,"Day High":33.615,"Day Low":32.75,"VS Average Volume":0.5388606018,"Company Summary":"CSX Corporation, together with its subsidiaries, provides rail-based freight transportation services. The company offers rail services; and transportation of intermodal containers and trailers, as well as other transportation services, such as rail-to-truck transfers and bulk commodity operations. It also transports chemicals, agricultural and food products, minerals, automotive, forest products, fertilizers, and metals and equipment; and coal, coke, and iron ore to electricity-generating power plants, steel manufacturers, and industrial plants, as well as exports coal to deep-water port facilities. In addition, the company provides intermodal services through a network of approximately 30 terminals transporting manufactured consumer goods in containers; and drayage services, including the pickup and delivery of intermodal shipments. It serves the automotive industry with distribution centers and storage locations, as well as connects non-rail served customers through transferring products, such as plastics and ethanol from rail to trucks. The company operates approximately 20,000 route mile rail network, which serves various population centers in 26 states east of the Mississippi River, the District of Columbia, and the Canadian provinces of Ontario and Quebec, as well as owns and leases approximately 3,500 locomotives. It serves production and distribution facilities through track connections. CSX Corporation was incorporated in 1978 and is headquartered in Jacksonville, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"TAL Education Group","Symbol":"TAL","Current Price":"12.43","Latest MA":"9.92","Price Target":14.73579,"Difference from MA":"25.21%","Difference from Open":"-3.01%","Change from Yesterday":"-4.05%","Change from Last Report":"0.04","Latest Volume":"4,079,835","Market Cap":"7,508,216,320","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":26.094719,"PB Ratio":2.0499918,"ROE":0.019609999,"DTE":9.291,"Industry":"Education & Training Services","Sector":"Consumer Defensive","Beta":0.033,"Trailing PEG":0.6915,"Trailing PE":65.39474,"Trailing PS":4.0880685,"Quick Ratio":2.67,"Day High":12.9,"Day Low":12.395,"VS Average Volume":0.6031733524,"Company Summary":"TAL Education Group provides K-12 after-school tutoring services in the People's Republic of China. It provides learning services primarily through small-classes services; personalized premium services; and learning content solutions, such as print books, smart books, mobile apps, and AI-driven learning devices. The company also operates www.xueersi.com, an online education platform; provides investment management and consulting services; develops and sells software and networks, as well as related consulting services; and sells educational materials and products. It offers its services under the Haoweilai and Think Academy brands. TAL Education Group was founded in 2003 and is headquartered in Beijing, the People's Republic of China.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Freeport-McMoRan, Inc.","Symbol":"FCX","Current Price":"36.59","Latest MA":"44.02","Price Target":48.4219,"Difference from MA":"-16.89%","Difference from Open":"1.68%","Change from Yesterday":"2.08%","Change from Last Report":"-0.05","Latest Volume":"6,030,774","Market Cap":"52,570,083,328","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.327122,"PB Ratio":2.9958236,"ROE":0.16870001,"DTE":33.531,"Industry":"Copper","Sector":"Basic Materials","Beta":1.91,"Trailing PEG":5.0463,"Trailing PE":28.142307,"Trailing PS":2.0503154,"Quick Ratio":1.048,"Day High":36.835,"Day Low":35.94,"VS Average Volume":0.4916218177,"Company Summary":"Freeport-McMoRan Inc. engages in the mining of mineral properties in North America, South America, and Indonesia. It primarily explores for copper, gold, molybdenum, silver, and other metals. The company's assets include the Grasberg minerals district in Indonesia; Morenci, Bagdad, Safford, Sierrita, and Miami in Arizona; Chino and Tyrone in New Mexico; and Henderson and Climax in Colorado, North America, as well as Cerro Verde in Peru and El Abra in Chile. The company was formerly known as Freeport-McMoRan Copper & Gold Inc. and changed its name to Freeport-McMoRan Inc. in July 2014. Freeport-McMoRan Inc. was incorporated in 1987 and is headquartered in Phoenix, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Procter & Gamble Company (The)","Symbol":"PG","Current Price":"166.35","Latest MA":"167.45","Price Target":178.47,"Difference from MA":"-0.65%","Difference from Open":"-0.22%","Change from Yesterday":"0.11%","Change from Last Report":"-0.01","Latest Volume":"1,952,850","Market Cap":"390,065,782,784","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":22.593002,"PB Ratio":7.922938,"ROE":0.28766,"DTE":69.338,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":0.414,"Trailing PEG":3.5216,"Trailing PE":26.488853,"Trailing PS":4.6488976,"Quick Ratio":0.507,"Day High":167.29,"Day Low":165.8805,"VS Average Volume":0.2734032924,"Company Summary":"The Procter & Gamble Company engages in the provision of branded consumer packaged goods worldwide. The company operates through five segments: Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care. The Beauty segment offers conditioners, shampoos, styling aids, and treatments under the Head & Shoulders, Herbal Essences, Pantene, and Rejoice brands; and antiperspirants and deodorants, personal cleansing, and skin care products under the Olay, Old Spice, Safeguard, Secret, SK-II, and Native brands. The Grooming segment provides blades and razors, shave products, appliances, and other grooming products under the Braun, Gillette, and Venus brand names. The Health Care segment offers toothbrushes, toothpastes, and other oral care products under the Crest and Oral-B brand names; and gastrointestinal, pain relief, rapid diagnostics, respiratory, vitamins\/minerals\/supplements, and other personal health care products under Metamucil, Neurobion, Pepto-Bismol, and Vicks brands. The Fabric & Home Care segment provides fabric enhancers, laundry additives, and laundry detergents under the Ariel, Downy, Gain, and Tide brands; and air care, dish care, P&G professional, and surface care products under the Cascade, Dawn, Fairy, Febreze, Mr. Clean, and Swiffer brands. The Baby, Feminine & Family Care segment offers baby wipes, and taped diapers and pants under the Luvs and Pampers brands; adult incontinence and feminine care products under the Always, Always Discreet, and Tampax brands; and paper towels, tissues, and toilet papers under the Bounty, Charmin, and Puffs brands. It sells its products primarily through mass merchandisers, e-commerce, grocery stores, membership club stores, drug stores, department stores, distributors, wholesalers, specialty beauty stores, high-frequency stores, pharmacies, electronics stores, and professional channels, as well as directly to consumers. The company was founded in 1837 and is headquartered in Cincinnati, Ohio.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"F.N.B. Corporation","Symbol":"FNB","Current Price":"15.74","Latest MA":"14.70","Price Target":18.625,"Difference from MA":"7.14%","Difference from Open":"0.93%","Change from Yesterday":"0.51%","Change from Last Report":"0.06","Latest Volume":"1,170,968","Market Cap":"5,662,153,728","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":9.340279,"PB Ratio":0.9060306,"ROE":0.06687,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.976,"Trailing PEG":null,"Trailing PE":12.397638,"Trailing PS":3.7929754,"Quick Ratio":"N\/A","Day High":15.925,"Day Low":15.59,"VS Average Volume":0.4631746327,"Company Summary":"F.N.B. Corporation, a bank and financial holding company, provides a range of financial products and services primarily to consumers, corporations, governments, and small- to medium-sized businesses in the United States. The company operates through three segments: Community Banking, Wealth Management, and Insurance. The Community Banking segment offers commercial and consumer banking services, including corporate and small business banking, investment real estate financing, business credit, capital market, and lease financing services. It also provides consumer banking products and services, such as deposit products, mortgage and consumer lending services, and mobile and online banking services. The Wealth Management segment provides personal and corporate fiduciary services comprising administration of decedent and trust estates; and securities brokerage and investment advisory services, mutual funds, and annuities. The Insurance segment comprises commercial and personal insurance, and reinsurance products, as well as mezzanine financing options for small- to medium-sized businesses. The company operates community banking branches in Pennsylvania, Ohio, Maryland, West Virginia, North Carolina, South Carolina, Washington, D.C., and Virginia. F.N.B. Corporation was founded in 1864 and is headquartered in Pittsburgh, Pennsylvania.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Valley National Bancorp","Symbol":"VLY","Current Price":"10.26","Latest MA":"8.80","Price Target":11.5,"Difference from MA":"16.48%","Difference from Open":"1.23%","Change from Yesterday":"0.59%","Change from Last Report":"0.00","Latest Volume":"3,014,610","Market Cap":"5,730,350,080","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":8.8675785,"PB Ratio":0.78908896,"ROE":0.049429998,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.086,"Trailing PEG":null,"Trailing PE":14.862319,"Trailing PS":3.6336226,"Quick Ratio":"N\/A","Day High":10.37,"Day Low":10.12,"VS Average Volume":0.374932606,"Company Summary":"Valley National Bancorp operates as the holding company for Valley National Bank that provides various commercial, private banking, retail, insurance, and wealth management financial services products. It operates through Consumer Banking, Commercial Banking, and Treasury and Corporate other segments. The company offers non-interest bearing, savings, NOW, money market, and time deposit accounts; commercial and industrial, commercial real estate, residential mortgage, and automobile loans; loans secured by the cash surrender value of life insurance; home equity loans and lines of credit; automobile financing; and secured and unsecured other consumer loans. It also invests in various securities and interest-bearing deposits with other banks; and provides international banking services, such as standby and documentary letters of credit, and related products, as well as foreign exchange transactions, documentary collections, and foreign wire transfers services. In addition, the company offers investment services for individuals and small to medium sized businesses; and trusts investment strategies designed for various investment profiles and objectives. Further, it provides trust services, such as living and testamentary trusts, investment management, custodial and escrow services, and estate administration to individuals; tax credit advisory services; brokerage services; property and casualty, life, health, and title insurance agency services; and health care equipment lending and other commercial equipment leasing services, as well as owns real estate related investments. Additionally, the company offers online, mobile, and telephone banking services; receivable, payment, and security solution, merchant, payroll processing, and liquidity services; credit cards; and drive-in and night deposit, automated teller machine, remote deposit capture, and safe deposit facility services. Valley National Bancorp was founded in 1927 and is headquartered in Morristown, New Jersey.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Abbott Laboratories","Symbol":"ABT","Current Price":"128.74","Latest MA":"112.12","Price Target":133.07957,"Difference from MA":"14.82%","Difference from Open":"0.45%","Change from Yesterday":"1.05%","Change from Last Report":"0.06","Latest Volume":"2,909,669","Market Cap":"223,294,390,272","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":22.695381,"PB Ratio":5.611053,"ROE":0.14840001,"DTE":37.589,"Industry":"Medical Devices","Sector":"Healthcare","Beta":0.722,"Trailing PEG":2.2904,"Trailing PE":16.850786,"Trailing PS":5.4175315,"Quick Ratio":0.996,"Day High":129.3,"Day Low":127.72,"VS Average Volume":0.5125535292,"Company Summary":"Abbott Laboratories, together with its subsidiaries, discovers, develops, manufactures, and sells health care products worldwide. It operates in four segments: Established Pharmaceutical Products, Diagnostic Products, Nutritional Products, and Medical Devices. The company provides generic pharmaceuticals for the treatment of pancreatic exocrine insufficiency, irritable bowel syndrome or biliary spasm, intrahepatic cholestasis or depressive symptoms, gynecological disorder, hormone replacement therapy, dyslipidemia, hypertension, hypothyroidism, Ménière's disease and vestibular vertigo, pain, fever, inflammation, and migraine, as well as provides anti-infective clarithromycin, influenza vaccine, and products to regulate physiological rhythm of the colon. It also offers laboratory and transfusion medicine systems in the areas of immunoassay, clinical chemistry, hematology, and transfusion; molecular diagnostics polymerase chain reaction instrument systems that automate the extraction, purification, and preparation of DNA and RNA from patient samples, and detect and measure infectious agents; point of care systems; cartridges for testing blood gas, chemistry, electrolytes, coagulation, and immunoassay; rapid diagnostics lateral flow testing products; molecular point-of-care testing for HIV, SARS-CoV-2, influenza A and B, RSV, and strep A; cardiometabolic test systems; drug and alcohol test, and remote patient monitoring and consumer self-test systems; and informatics and automation solutions for laboratories. In addition, the company provides pediatric and adult nutritional products; rhythm management, electrophysiology, heart failure, vascular, and structural heart devices for the treatment of cardiovascular diseases; diabetes care products, such as glucose and blood glucose monitoring systems; and neuromodulation devices for the management of chronic pain and movement disorders. Abbott Laboratories was founded in 1888 and is based in North Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Alcoa Corporation","Symbol":"AA","Current Price":"34.98","Latest MA":"37.67","Price Target":48.04231,"Difference from MA":"-7.15%","Difference from Open":"1.93%","Change from Yesterday":"2.45%","Change from Last Report":"0.06","Latest Volume":"2,131,268","Market Cap":"9,037,774,848","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":10.857198,"PB Ratio":1.7214704,"ROE":-0.07142,"DTE":56.095,"Industry":"Aluminum","Sector":"Basic Materials","Beta":2.419,"Trailing PEG":null,"Trailing PE":134.54616,"Trailing PS":0.8213172,"Quick Ratio":0.671,"Day High":35.16,"Day Low":34.385,"VS Average Volume":0.4544727201,"Company Summary":"Alcoa Corporation, together with its subsidiaries, produces and sells bauxite, alumina, and aluminum products in the United States, Spain, Australia, Iceland, Norway, Brazil, Canada, and internationally. The company operates through two segments, Alumina and Aluminum. It engages in bauxite mining operations; and processes bauxite into alumina and sells it to customers who process it into industrial chemical products, as well as aluminum smelting and casting businesses. The company offers primary aluminum in the form of alloy ingot or value-add ingot to customers that produce products for the transportation, building and construction, packaging, wire, and other industrial markets; and flat-rolled aluminum in the form of sheet, which is sold primarily to customers that produce beverage and food cans. In addition, it owns hydro power plants that generates and sells electricity in the wholesale market to traders, large industrial consumers, distribution companies, and other generation companies. The company was formerly known as Alcoa Upstream Corporation and changed its name to Alcoa Corporation in October 2016. The company was founded in 1886 and is headquartered in Pittsburgh, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Lam Research Corporation","Symbol":"LRCX","Current Price":"75.34","Latest MA":"81.25","Price Target":90.85239,"Difference from MA":"-7.27%","Difference from Open":"-2.72%","Change from Yesterday":"1.11%","Change from Last Report":"0.10","Latest Volume":"6,211,325","Market Cap":"96,939,220,992","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":18.510374,"PB Ratio":11.49001,"ROE":0.49116,"DTE":58.827,"Industry":"Semiconductor Equipment & Materials","Sector":"Technology","Beta":1.486,"Trailing PEG":1.4323,"Trailing PE":24.381876,"Trailing PS":6.21752,"Quick Ratio":1.685,"Day High":77.47,"Day Low":74.47,"VS Average Volume":0.5433697185,"Company Summary":"Lam Research Corporation designs, manufactures, markets, refurbishes, and services semiconductor processing equipment used in the fabrication of integrated circuits. The company offers ALTUS systems to deposit conformal films for tungsten metallization applications; SABRE electrochemical deposition products for copper interconnect transition that offers copper damascene manufacturing; and VECTOR plasma-enhanced CVD products. It also provides SPEED gapfill high-density plasma chemical vapor deposition products; and Striker single-wafer atomic layer deposition products for dielectric film solutions. In addition, the company offers Flex for dielectric etch applications; Vantex, a dielectric etch system that provides RF technology and repeatable wafer-to-wafer performance enabled by Equipment Intelligence solutions; Kiyo for conductor etch applications; Syndion for through-silicon via etch applications; and Versys metal products for metal etch processes. Further, it provides Coronus bevel clean products to enhance die yield; and Da Vinci, DV-Prime, EOS, and SP series products to address various wafer cleaning applications. The company sells its products in the United States, China, Europe, Japan, Korea, Southeast Asia, and Taiwan. Lam Research Corporation was incorporated in 1980 and is headquartered in Fremont, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Halliburton Company","Symbol":"HAL","Current Price":"26.54","Latest MA":"30.00","Price Target":34.41481,"Difference from MA":"-11.54%","Difference from Open":"-0.34%","Change from Yesterday":"-0.39%","Change from Last Report":"-0.04","Latest Volume":"3,866,801","Market Cap":"23,315,443,712","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.611711,"PB Ratio":2.2631536,"ROE":0.26293,"DTE":83.993,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.905,"Trailing PEG":1.7831,"Trailing PE":9.378093,"Trailing PS":1.0105077,"Quick Ratio":1.377,"Day High":26.865,"Day Low":26.495,"VS Average Volume":0.3835949228,"Company Summary":"Halliburton Company provides products and services to the energy industry worldwide. It operates through two segments, Completion and Production, and Drilling and Evaluation. The Completion and Production segment offers production enhancement services that include stimulation and sand control services; cementing services, such as well bonding and casing, and casing equipment; and completion tools that offer downhole solutions and services, including well completion products and services, intelligent well completions, and service tools, as well as liner hanger, sand control, and multilateral systems. This segment also provides electrical submersible pumps, as well as artificial lift services; production solutions comprising coiled tubing, hydraulic workover units, downhole tools, and pumping and nitrogen services; pipeline and process services, such as pre-commissioning, commissioning, maintenance, and decommissioning; and specialty chemicals and services. The Drilling and Evaluation segment offers drilling fluid systems, performance additives, completion fluids, solids control, specialized testing equipment, and waste management services; drilling systems and services; wireline and perforating services consists of open-hole logging, and cased-hole and slickline; and drill bits and services comprising roller cone rock bits, fixed cutter bits, hole enlargement, and related downhole tools and services, as well as coring equipment and services. This segment also provides cloud based digital services and artificial intelligence solutions on an open architecture for subsurface insights, integrated well construction, and reservoir and production management; testing and subsea services, such as acquisition and analysis of reservoir information and optimization solutions; and project management and integrated asset management services. Halliburton Company was founded in 1919 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Johnson & Johnson","Symbol":"JNJ","Current Price":"151.60","Latest MA":"154.31","Price Target":168.44952,"Difference from MA":"-1.75%","Difference from Open":"0.73%","Change from Yesterday":"0.81%","Change from Last Report":"-0.08","Latest Volume":"2,864,185","Market Cap":"365,007,241,216","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.643187,"PB Ratio":5.201928,"ROE":0.20889,"DTE":50.958,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.518,"Trailing PEG":0.9548,"Trailing PE":26.183937,"Trailing PS":4.162188,"Quick Ratio":0.705,"Day High":151.87,"Day Low":150.0,"VS Average Volume":0.3343988885,"Company Summary":"Johnson & Johnson, together with its subsidiaries, researches, develops, manufactures, and sells various products in the healthcare field worldwide. The company's Innovative Medicine segment offers products for various therapeutic areas, such as immunology, including rheumatoid arthritis, psoriatic arthritis, inflammatory bowel disease, and psoriasis; infectious diseases comprising HIV\/AIDS; neuroscience, consisting of mood disorders, neurodegenerative disorders, and schizophrenia; oncology, such as prostate cancer, hematologic malignancies, lung cancer, and bladder cancer; cardiovascular and metabolism, including thrombosis, diabetes, and macular degeneration; and pulmonary hypertension comprising pulmonary arterial hypertension through retailers, wholesalers, distributors, hospitals, and healthcare professionals for prescription use. Its MedTech segment provides Interventional Solutions, including electrophysiology products to treat heart rhythm disorders; the heart recovery portfolio, which includes technologies to treat severe coronary artery disease requiring high-risk PCI or AMI cardiogenic shock; and neurovascular care that treats hemorrhagic and ischemic stroke. this segment also offers an orthopaedics portfolio that includes products and enabling technologies that support hips, knees, trauma, spine, sports, and other; surgery portfolios comprising advanced and general surgery technologies, as well as solutions for breast aesthetics, ear, nose, and throat procedures; contact lenses under the ACUVUE Brand; and TECNIS intraocular lenses for cataract surgery. It distributes its products to wholesalers, hospitals, and retailers, as well as physicians, nurses, hospitals, eye care professionals, and clinics. The company has a collaboration agreement with Stand Up To Cancer for research testing a combination of teclistamab and daratumumab to treat a rare disease AL amyloidosis. Johnson & Johnson was founded in 1886 and is based in New Brunswick, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Kinder Morgan, Inc.","Symbol":"KMI","Current Price":"27.38","Latest MA":"23.92","Price Target":29.585,"Difference from MA":"14.47%","Difference from Open":"-0.58%","Change from Yesterday":"-0.27%","Change from Last Report":"-0.02","Latest Volume":"6,034,460","Market Cap":"60,828,499,968","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.314283,"PB Ratio":2.0005846,"ROE":0.083500005,"DTE":101.433,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.907,"Trailing PEG":2.0107,"Trailing PE":23.401709,"Trailing PS":4.0148177,"Quick Ratio":0.291,"Day High":27.975,"Day Low":27.29,"VS Average Volume":0.4224821799,"Company Summary":"Kinder Morgan, Inc. operates as an energy infrastructure company primarily in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas gasification, liquefaction, and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and\/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, renewable fuel and feedstocks, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; owns interests in\/or operates oil fields and gasoline processing plants; and operates a crude oil pipeline system in West Texas, as well as owns and operates RNG and LNG facilities. It owns and operates approximately 82,000 miles of pipelines and 139 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1997 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"GE Vernova Inc.","Symbol":"GEV","Current Price":"354.17","Latest MA":"265.45","Price Target":413.59042,"Difference from MA":"33.42%","Difference from Open":"-1.15%","Change from Yesterday":"-0.28%","Change from Last Report":"0.23","Latest Volume":"3,171,781","Market Cap":"97,628,389,376","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":34.212616,"PB Ratio":10.263121,"ROE":"N\/A","DTE":9.346,"Industry":"Utilities - Renewable","Sector":"Utilities","Beta":"N\/A","Trailing PEG":3.0778,"Trailing PE":63.47133,"Trailing PS":2.8362205,"Quick Ratio":0.717,"Day High":368.84,"Day Low":351.3175,"VS Average Volume":0.9763643186,"Company Summary":"GE Vernova Inc., an energy company, engages in the provision of various products and services that generate, transfer, orchestrate, convert, and store electricity in the United States, Europe, Asia, the Americas, the Middle East, and Africa. The company operates through three segments: Power, Wind, and Electrification. The Power segment designs, manufactures, and services gas, nuclear, hydro, and steam technologies. The Wind segment offers wind generation technologies, including onshore and offshore wind turbines and blades. The Electrification segment provides grid solutions, power conversion, solar, and storage solutions; and electrification software for the transmission, distribution, conversion, storage, and orchestration of electricity from point of generation to point of consumption. The company was incorporated in 2023 and is headquartered in Cambridge, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:33:32"},{"Company Name":"Comerica Incorporated","Symbol":"CMA","Current Price":"65.79","Latest MA":"59.40","Price Target":68.6,"Difference from MA":"10.75%","Difference from Open":"3.56%","Change from Yesterday":"3.50%","Change from Last Report":"0.17","Latest Volume":"1,119,905","Market Cap":"8,645,398,528","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":11.291125,"PB Ratio":1.2524272,"ROE":0.09094,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.24,"Trailing PEG":null,"Trailing PE":13.105577,"Trailing PS":2.7350202,"Quick Ratio":"N\/A","Day High":65.96,"Day Low":63.52,"VS Average Volume":0.5021184921,"Company Summary":"Comerica Incorporated, through its subsidiaries, provides various financial products and services. The company operates through Commercial Bank, Retail Bank, Wealth Management, and Finance segments. The Commercial Bank segment offers various products and services, including commercial loans and lines of credit, deposits, cash management, payment solutions, card services, capital market products, international trade finance, letters of credit, foreign exchange management services, and loan syndication services for small and middle market businesses, multinational corporations, and governmental entities. The Retail Bank segment provides personal financial services, such as consumer lending, consumer deposit gathering, and mortgage loan origination; and various consumer products that include deposit accounts, installment loans, credit cards, student loans, home equity lines of credit, and residential mortgage loans. The Wealth Management segment offers products and services comprising financial planning, trust and fiduciary services, investment management and advisory, brokerage, private banking, and business transition planning services for affluents, high-net worth and ultra-high-net-worth individuals and families, business owners, and executives, and institutional clients. The Finance segment comprises securities portfolio, and asset and liability management activities. It operates in Texas, California, Michigan, Arizona, and Florida, the United States; and Canada and Mexico. The company was formerly known as DETROITBANK Corporation and changed its name to Comerica Incorporated in July 1982. Comerica Incorporated was founded in 1849 and is headquartered in Dallas, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Amphenol Corporation","Symbol":"APH","Current Price":"69.46","Latest MA":"67.70","Price Target":84.65,"Difference from MA":"2.59%","Difference from Open":"0.54%","Change from Yesterday":"1.28%","Change from Last Report":"0.11","Latest Volume":"3,955,445","Market Cap":"83,741,671,424","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":27.713827,"PB Ratio":8.857434,"ROE":0.25293,"DTE":57.565,"Industry":"Electronic Components","Sector":"Technology","Beta":1.238,"Trailing PEG":2.4242,"Trailing PE":36.177082,"Trailing PS":5.883876,"Quick Ratio":1.208,"Day High":70.08,"Day Low":68.94,"VS Average Volume":0.5861902012,"Company Summary":"Amphenol Corporation, together with its subsidiaries, primarily designs, manufactures, and markets electrical, electronic, and fiber optic connectors in the United States, China, and internationally. It operates through three segments: Harsh Environment Solutions, Communications Solutions, and Interconnect and Sensor Systems. The company offers connectors and connector systems, including harsh environment data, power, high-speed, fiber optic, and radio frequency interconnect products; busbars and power distribution systems; and other connectors. It also provides value-add products, such as backplane interconnect systems, cable assemblies and harnesses, and cable management products; other products comprising flexible and rigid printed circuit boards, hinges, other mechanical, and production related products. In addition, the company offers consumer device, network infrastructure, and other antennas; coaxial, power, and specialty cables; and sensors and sensor-based products. It sells its products through its sales force, independent representatives, and a network of electronics distributors to original equipment manufacturers, electronic manufacturing services companies, original design manufacturers, and service providers in the automotive, broadband communication, commercial aerospace, industrial, information technology and data communication, military, mobile device, and mobile network markets. Amphenol Corporation was founded in 1932 and is headquartered in Wallingford, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"United Airlines Holdings, Inc.","Symbol":"UAL","Current Price":"107.93","Latest MA":"69.65","Price Target":129.49522,"Difference from MA":"54.97%","Difference from Open":"0.77%","Change from Yesterday":"1.44%","Change from Last Report":"-0.06","Latest Volume":"1,273,843","Market Cap":"35,495,587,840","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.2804027,"PB Ratio":3.1033096,"ROE":0.27245,"DTE":291.676,"Industry":"Airlines","Sector":"Industrials","Beta":1.393,"Trailing PEG":0.9987,"Trailing PE":11.4211645,"Trailing PS":0.6339177,"Quick Ratio":0.694,"Day High":108.22,"Day Low":106.52,"VS Average Volume":0.2161912955,"Company Summary":"United Airlines Holdings, Inc., through its subsidiaries, provides air transportation services in North America, Asia, Europe, Africa, the Pacific, the Middle East, and Latin America. The company transports people and cargo through its mainline and regional fleets. It also offers catering, ground handling, flight academy, and maintenance services for third parties. The company was formerly known as United Continental Holdings, Inc. and changed its name to United Airlines Holdings, Inc. in June 2019. United Airlines Holdings, Inc. was incorporated in 1968 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"3M Company","Symbol":"MMM","Current Price":"151.89","Latest MA":"127.15","Price Target":152.92944,"Difference from MA":"19.45%","Difference from Open":"0.26%","Change from Yesterday":"0.30%","Change from Last Report":"-0.01","Latest Volume":"1,320,814","Market Cap":"81,940,103,168","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":17.825666,"PB Ratio":17.8191,"ROE":1.1329399,"DTE":295.441,"Industry":"Conglomerates","Sector":"Industrials","Beta":1.001,"Trailing PEG":2.743,"Trailing PE":20.89271,"Trailing PS":2.5105736,"Quick Ratio":0.95,"Day High":152.78,"Day Low":150.64,"VS Average Volume":0.3771813418,"Company Summary":"3M Company provides diversified technology services in the United States and internationally. The company's Safety and Industrial segment offers industrial abrasives and finishing for metalworking applications; autobody repair solutions; closure systems for personal hygiene products, masking, and packaging materials; electrical products and materials for construction and maintenance, power distribution, and electrical original equipment manufacturers; structural adhesives and tapes; respiratory, hearing, eye, and fall protection solutions; and natural and color-coated mineral granules for shingles. Its Transportation and Electronics segment provides ceramic solutions; attachment\/bonding products, films, sound, and temperature management for transportation vehicles; premium large format graphic films for advertising and fleet signage; light management films and electronics assembly solutions; packaging and interconnection solutions; semiconductor production materials; data centers solutions; and reflective signage for highway, and vehicle safety. The company's Consumer segment provides consumer bandages, braces, supports, and consumer respirators; home cleaning products; retail abrasives, paint accessories, car care DIY products, picture hanging, and consumer air quality solutions; and stationery products. It offers its products through e-commerce and traditional wholesalers, retailers, jobbers, distributors, and dealers. 3M Company was founded in 1902 and is headquartered in Saint Paul, Minnesota.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Netflix, Inc.","Symbol":"NFLX","Current Price":"975.75","Latest MA":"762.35","Price Target":1063.7195,"Difference from MA":"27.99%","Difference from Open":"-0.43%","Change from Yesterday":"0.40%","Change from Last Report":"-0.07","Latest Volume":"1,509,510","Market Cap":"417,385,218,048","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":32.17453,"PB Ratio":18.357443,"ROE":0.34714,"DTE":81.461,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.25,"Trailing PEG":2.8368,"Trailing PE":49.205906,"Trailing PS":11.104427,"Quick Ratio":0.975,"Day High":987.64,"Day Low":968.2345,"VS Average Volume":0.4395155491,"Company Summary":"Netflix, Inc. provides entertainment services. It offers TV series, documentaries, feature films, and games across various genres and languages. The company also provides members the ability to receive streaming content through a host of internet-connected devices, including TVs, digital video players, TV set-top boxes, and mobile devices. It has operations in approximately 190 countries. The company was incorporated in 1997 and is headquartered in Los Gatos, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"KeyCorp","Symbol":"KEY","Current Price":"17.75","Latest MA":"16.70","Price Target":21.04,"Difference from MA":"6.30%","Difference from Open":"0.65%","Change from Yesterday":"0.57%","Change from Last Report":"0.17","Latest Volume":"2,685,898","Market Cap":"19,651,055,616","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":10.177993,"PB Ratio":1.2262586,"ROE":0.0096700005,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.231,"Trailing PEG":0.759,"Trailing PE":"N\/A","Trailing PS":4.050094,"Quick Ratio":"N\/A","Day High":17.96,"Day Low":17.62,"VS Average Volume":0.2522323315,"Company Summary":"KeyCorp operates as the holding company for KeyBank National Association that provides various retail and commercial banking products and services in the United States. It operates in two segments, Consumer Bank and Commercial Bank. The company offers various deposits, investment products and services; commercial leasing, investment management, consumer finance; and personal finance and financial wellness, student loan refinancing, mortgage and home equity, lending, credit card, treasury, business advisory, wealth management, asset management, cash management, portfolio management, and trust and related services to individuals and small and medium-sized businesses. It also provides a suite of banking and capital market products, such as syndicated finance, debt and equity capital market products, commercial payments, equipment finance, commercial mortgage banking, derivatives, foreign exchange, financial advisory, and public finance, as well as commercial mortgage loans to consumer, energy, healthcare, industrial, public sector, real estate, and technology sectors for middle market clients. In addition, the company offers community development financing, securities underwriting, brokerage, and investment banking services. The company was founded in 1849 and is headquartered in Cleveland, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Charles Schwab Corporation (The","Symbol":"SCHW","Current Price":"82.05","Latest MA":"70.93","Price Target":89.5,"Difference from MA":"15.67%","Difference from Open":"-0.31%","Change from Yesterday":"0.42%","Change from Last Report":"-0.11","Latest Volume":"2,804,929","Market Cap":"150,188,294,144","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":15.818708,"PB Ratio":3.9476974,"ROE":0.12111,"DTE":144.242,"Industry":"Capital Markets","Sector":"Financial Services","Beta":0.952,"Trailing PEG":0.9688,"Trailing PE":27.439798,"Trailing PS":8.016027,"Quick Ratio":0.481,"Day High":82.64,"Day Low":81.71,"VS Average Volume":0.342643831,"Company Summary":"The Charles Schwab Corporation, together with its subsidiaries, operates as a savings and loan holding company that provides wealth management, securities brokerage, banking, asset management, custody, and financial advisory services in the United States and internationally. The company operates in two segments, Investor Services and Advisor Services. It offers brokerage accounts with equity and fixed income trading, margin lending, options trading, futures and forex trading, and cash management capabilities, including certificates of deposit; third-party mutual funds through the Mutual Fund Marketplace and Mutual Fund OneSource service, as well as mutual fund trading and clearing services to broker-dealers; exchange-traded funds; advisory solutions for managed portfolios, separately managed accounts, customized personal advice for tailored portfolios, specialized planning, and full-time portfolio management; banking products comprising checking and savings accounts, first lien residential real estate mortgage loans, home equity lines of credit, and pledged asset lines; and trust custody services, personal trust reporting services, and administrative trustee services. It also provides digital retirement calculators; integrated web-, mobile-, and software-based trading platforms, real-time market data, options trading, premium research, and multi-channel access; self-service education and support tools; online research and analysis tools; equity compensation plan sponsors full-service recordkeeping for stock plans, stock options, restricted stock, performance shares, and stock appreciation rights; retirement plan services; mutual fund clearing services; and advisor services, including interactive tools and educational content. The Company operates through branch offices. The Charles Schwab Corporation was founded in 1971 and is headquartered in Westlake, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Citizens Financial Group, Inc.","Symbol":"CFG","Current Price":"47.83","Latest MA":"42.27","Price Target":52.32105,"Difference from MA":"13.13%","Difference from Open":"1.24%","Change from Yesterday":"0.98%","Change from Last Report":"0.01","Latest Volume":"1,149,647","Market Cap":"21,068,969,984","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":9.64451,"PB Ratio":0.9330615,"ROE":0.05426,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.32,"Trailing PEG":null,"Trailing PE":15.783829,"Trailing PS":2.9612045,"Quick Ratio":"N\/A","Day High":48.445,"Day Low":47.24,"VS Average Volume":0.2894115112,"Company Summary":"Citizens Financial Group, Inc. operates as the bank holding company that provides retail and commercial banking products and services to individuals, small businesses, middle-market companies, corporations, and institutions in the United States. The company operates in two segments, Consumer Banking and Commercial Banking. The Consumer Banking segment offers deposit products, mortgage and home equity lending products, credit cards, business loans, wealth management, and investment services; and auto, education, and point-of-sale finance loans, as well as digital deposit products. This segment serves its customers through telephone service centers, as well as through its online and mobile platforms. The Commercial Banking segment provides various financial products and solutions, including lending and leasing, deposit and treasury management services, foreign exchange, and interest rate and commodity risk management solutions, as well as syndicated loans, corporate finance, mergers and acquisitions, and debt and equity capital markets services. This segment serves corporate banking, healthcare, technology, asset finance, franchise finance, leasing, asset-based lending, commercial real estate, mid-corporate, and private equity sponsor industries. The company was formerly known as RBS Citizens Financial Group, Inc. and changed its name to Citizens Financial Group, Inc. in April 2014. Citizens Financial Group, Inc. was founded in 1828 and is headquartered in Providence, Rhode Island.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Regions Financial Corporation","Symbol":"RF","Current Price":"24.88","Latest MA":"23.05","Price Target":27.3681,"Difference from MA":"7.93%","Difference from Open":"0.53%","Change from Yesterday":"0.53%","Change from Last Report":"0.04","Latest Volume":"2,553,040","Market Cap":"22,612,535,296","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":10.050292,"PB Ratio":1.3356954,"ROE":0.10042,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.182,"Trailing PEG":4.7614,"Trailing PE":12.8911915,"Trailing PS":3.4491358,"Quick Ratio":"N\/A","Day High":25.245,"Day Low":24.72,"VS Average Volume":0.3150394879,"Company Summary":"Regions Financial Corporation, a financial holding company, provides banking and bank-related services to individual and corporate customers. It operates through three segments: Corporate Bank, Consumer Bank, and Wealth Management. The Corporate Bank segment offers commercial banking services, such as commercial and industrial, commercial real estate, and investor real estate lending; equipment lease financing; deposit products; and securities underwriting and placement, loan syndication and placement, foreign exchange, derivatives, merger and acquisition, and other advisory services. It serves corporate, middle market, and commercial real estate developers and investors. The Consumer Bank segment provides consumer banking products and services related to residential first mortgages, home equity lines and loans, consumer credit cards, and other consumer loans, as well as deposits. The Wealth Management segment offers credit related products, and retirement and savings solutions; and trust and investment management, asset management, and estate planning services to individuals, businesses, governmental institutions, and non-profit entities. It also provides investment and insurance products; low-income housing tax credit corporate fund syndication services; and other specialty financing services. The company was founded in 1971 and is headquartered in Birmingham, Alabama.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Huntington Bancshares Incorpora","Symbol":"HBAN","Current Price":"17.25","Latest MA":"15.26","Price Target":18.69526,"Difference from MA":"13.03%","Difference from Open":"0.38%","Change from Yesterday":"0.03%","Change from Last Report":"0.00","Latest Volume":"10,236,303","Market Cap":"25,068,021,760","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":11.105102,"PB Ratio":1.3756382,"ROE":0.08545,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.057,"Trailing PEG":2.9131,"Trailing PE":14.135246,"Trailing PS":3.7470884,"Quick Ratio":"N\/A","Day High":17.44,"Day Low":17.165,"VS Average Volume":0.6497747375,"Company Summary":"Huntington Bancshares Incorporated operates as the bank holding company for The Huntington National Bank that provides commercial, consumer, and mortgage banking services in the United States. The company offers financial products and services to consumer and business customers, including deposits, lending, payments, mortgage banking, dealer financing, investment management, trust, brokerage, insurance, and other financial products and services. It also provides 24-hour grace, asterisk-free checking, money scout, $50 safety zone, standby cash, early pay, instant access, savings goal getter, and Huntington heads up; digitally powered consumer and business financial solutions to consumer lending, regional banking, branch banking, and wealth management customers; direct and indirect consumer loans, as well as dealer finance loans and deposits; and private banking, wealth management and legacy planning through investment and portfolio management, fiduciary administration and trust, institutional custody, and full-service retail brokerage investment services. The company offers equipment financing, asset-based lending, distribution finance, structured lending, and municipal financing solutions, as well as Huntington ChoicePay. In addition, it offers lending, liquidity, treasury management and other payment services, and capital markets; government and non-profits, healthcare, technology and telecommunications, franchises, financial sponsors, and global services; and corporate risk management, institutional sales and trading, debt and equity issuance, and additional advisory services. The company offers its products through a network of channels, including branches and ATMs, online and mobile banking, and through customer call centers to customers in middle market banking, corporate, specialty, and government banking, asset finance, commercial real estate banking, and capital markets. The company was founded in 1866 and is headquartered in Columbus, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Truist Financial Corporation","Symbol":"TFC","Current Price":"47.84","Latest MA":"43.11","Price Target":51.058,"Difference from MA":"10.99%","Difference from Open":"1.26%","Change from Yesterday":"1.20%","Change from Last Report":"0.19","Latest Volume":"1,941,784","Market Cap":"62,961,147,904","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":10.367236,"PB Ratio":1.0761117,"ROE":-0.09505,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.035,"Trailing PEG":1.9441,"Trailing PE":"N\/A","Trailing PS":4.3430467,"Quick Ratio":"N\/A","Day High":48.185,"Day Low":47.24,"VS Average Volume":0.2467218053,"Company Summary":"Truist Financial Corporation, a financial services company, provides banking and trust services in the Southeastern and Mid-Atlantic United States. The company operates through three segments: Consumer Banking and Wealth, Corporate and Commercial Banking, and Insurance Holdings.Its deposit products include noninterest-bearing checking, interest-bearing checking, savings, and money market deposit accounts, as well as certificates of deposit and individual retirement accounts. The company also provides funding; asset management; automobile lending; credit card lending; consumer finance; home equity and mortgage lending; other direct retail lending; insurance; investment brokerage; mobile\/online banking; payment solutions; point-of-sale lending; retail and small business deposit products; small business lending; and wealth management\/private banking services. In addition, it offers asset based lending, investment banking and capital market, institutional trust, insurance premium finance, derivatives, commercial lending, international banking, leasing, merchant, commercial deposit and treasury, floor plan, mortgage warehouse lending, real estate lending, and supply chain financing services. Further, the company provides insurance brokerage, retail and wholesale brokerage, securities underwriting and market making, loan syndication, and investment management and advisory services. The company was formerly known as BB&T Corporation and changed its name to Truist Financial Corporation in December 2019. Truist Financial Corporation was founded in 1872 and is headquartered in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Bank of America Corporation","Symbol":"BAC","Current Price":"46.95","Latest MA":"42.19","Price Target":52.02381,"Difference from MA":"11.30%","Difference from Open":"0.43%","Change from Yesterday":"0.21%","Change from Last Report":"0.01","Latest Volume":"8,366,882","Market Cap":"357,329,895,424","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.839627,"PB Ratio":1.3273586,"ROE":0.08092,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.325,"Trailing PEG":2.0753,"Trailing PE":14.626168,"Trailing PS":3.776234,"Quick Ratio":"N\/A","Day High":47.39,"Day Low":46.68,"VS Average Volume":0.2336130177,"Company Summary":"Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. It operates in four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, non-interest and interest-bearing checking accounts, and investment accounts and products; credit and debit cards; residential mortgages, and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research, and certain market-based services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Schlumberger N.V.","Symbol":"SLB","Current Price":"41.27","Latest MA":"42.74","Price Target":53.26903,"Difference from MA":"-3.42%","Difference from Open":"-0.11%","Change from Yesterday":"-0.12%","Change from Last Report":"-0.10","Latest Volume":"3,699,226","Market Cap":"57,820,086,272","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":10.974213,"PB Ratio":2.709578,"ROE":0.21722999,"DTE":57.141,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.532,"Trailing PEG":1.9332,"Trailing PE":13.271705,"Trailing PS":1.6063366,"Quick Ratio":1.003,"Day High":41.795,"Day Low":41.15,"VS Average Volume":0.2863027776,"Company Summary":"Schlumberger Limited engages in the provision of technology for the energy industry worldwide. The company operates through four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company provides field development and hydrocarbon production, carbon management, and integration of adjacent energy systems; reservoir interpretation and data processing services for exploration data; and well construction and production improvement services and products. It also offers subsurface geology and fluids evaluation information; open and cased hole services; exploration and production pressure, and flow-rate measurement services; and pressure pumping, well stimulation, and coiled tubing equipment solutions. In addition, the company offers mud logging, directional drilling, measurement-while-drilling, and logging-while-drilling services, as well as engineering support services; supplies drilling fluid systems; designs, manufactures, and markets roller cone and fixed cutter drill bits; bottom-hole-assembly and borehole enlargement technologies; well cementing products and services; well planning, well drilling, engineering, supervision, logistics, procurement, and contracting of third parties, as well as drilling rig management solutions; and drilling equipment and services, as well as land drilling rigs and related services. Further, it provides artificial lift production equipment and optimization services; supplies packers, safety valves, sand control technology, and various intelligent well completions technology and equipment; designs and manufactures valves, chokes, actuators, and surface trees; and OneSubsea, an integrated solutions, products, systems, and services, including wellheads, subsea trees, manifolds and flowline connectors, control systems, connectors, and services. The company was formerly known as Socie´te´ de Prospection E´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Morgan Stanley","Symbol":"MS","Current Price":"139.12","Latest MA":"113.29","Price Target":135.5,"Difference from MA":"22.80%","Difference from Open":"0.47%","Change from Yesterday":"0.37%","Change from Last Report":"0.03","Latest Volume":"2,539,288","Market Cap":"223,557,828,608","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":14.797234,"PB Ratio":2.3884046,"ROE":0.11079001,"DTE":405.772,"Industry":"Capital Markets","Sector":"Financial Services","Beta":1.336,"Trailing PEG":3.7043,"Trailing PE":17.498743,"Trailing PS":3.8357954,"Quick Ratio":1.83,"Day High":141.48,"Day Low":138.31,"VS Average Volume":0.3716652535,"Company Summary":"Morgan Stanley, a financial holding company, provides various financial products and services to corporations, governments, financial institutions, and individuals in the Americas, Europe, the Middle East, Africa, and Asia. It operates through Institutional Securities, Wealth Management, and Investment Management segments. The Institutional Securities segment offers capital raising and financial advisory services, including services related to the underwriting of debt, equity, and other securities, as well as advice on mergers and acquisitions, restructurings, real estate, and project finance. This segment also provides equity and fixed income products comprising sales, financing, prime brokerage, and market-making services; foreign exchange and commodities; corporate and commercial real estate loans, commercial mortgage and secured lending facilities, and financing for sales and trading customers, and asset-backed and mortgage lending; and wealth management services, investment, and research services. The Wealth Management segment offers financial advisor-led brokerage, custody, administrative, and investment advisory services; self-directed brokerage services; financial and wealth planning services; workplace services, including stock plan administration; annuity and insurance products; securities-based lending, residential real estate loans, and other lending products; banking; and retirement plan services to individual investors and small to medium-sized businesses and institutions. The Investment Management segment provides equity, fixed income, alternatives and solutions, and liquidity and overlay services to benefit\/defined contribution plans, foundations, endowments, government entities, sovereign wealth funds, insurance companies, third-party fund sponsors, corporations, and individuals through institutional and intermediary channels. The company was founded in 1924 and is headquartered in New York, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"First Horizon Corporation","Symbol":"FHN","Current Price":"21.66","Latest MA":"17.55","Price Target":23.2,"Difference from MA":"23.45%","Difference from Open":"1.86%","Change from Yesterday":"1.74%","Change from Last Report":"0.02","Latest Volume":"5,469,606","Market Cap":"11,352,460,288","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":11.4977,"PB Ratio":1.3414031,"ROE":0.08979,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.882,"Trailing PEG":null,"Trailing PE":15.930147,"Trailing PS":3.6966655,"Quick Ratio":"N\/A","Day High":22.025,"Day Low":21.2,"VS Average Volume":0.8837446327,"Company Summary":"First Horizon Corporation operates as the bank holding company for First Horizon Bank that provides various financial services. The company operates through Regional Banking and Specialty Banking segments. It offers general banking services for consumers, businesses, financial institutions, and governments. The company also accepts deposits; provides underwriting services for bank-eligible securities and other fixed-income securities by financial subsidiaries; sells loans and derivatives; financial planning; and offers investment and financial advisory services. In addition, it offers mortgage banking; loan syndications; brokerage services; commercial and business banking for business enterprises, consumer banking, and private client and wealth management services; capital markets, professional commercial real estate, mortgage warehouse and asset-based lending, franchise and equipment finance, tax credit finance, energy and healthcare finance, asset management, and corporate and correspondent banking services. Further, the company provides transaction processing services including check clearing services and remittance processing, credit cards, investment, and sale of mutual fund and retail insurances, as well as trust, fiduciary, and agency services. First Horizon Corporation was founded in 1864 and is headquartered in Memphis, Tennessee.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Citigroup, Inc.","Symbol":"C","Current Price":"81.12","Latest MA":"65.57","Price Target":90.40579,"Difference from MA":"23.71%","Difference from Open":"1.55%","Change from Yesterday":"1.44%","Change from Last Report":"-0.02","Latest Volume":"4,965,122","Market Cap":"152,270,176,256","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.771217,"PB Ratio":0.79601896,"ROE":0.03874,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.426,"Trailing PEG":0.8666,"Trailing PE":13.633597,"Trailing PS":2.1970072,"Quick Ratio":"N\/A","Day High":81.6,"Day Low":79.88,"VS Average Volume":0.3356629732,"Company Summary":"Citigroup Inc., a diversified financial service holding company, provides various financial product and services to consumers, corporations, governments, and institutions worldwide. It operates through five segments: Services, Markets, Banking, U.S. Personal Banking, and Wealth. The Services segment includes Treasury and Trade Solutions, which provides cash management, trade, and working capital solutions to multinational corporations, financial institutions, and public sector organizations; and Securities Services, such as cross-border support for clients, local market expertise, post-trade technologies, data solutions, and various securities services solutions. The Markets segment offers sales and trading services for equities, foreign exchange, rates, spread products, and commodities to corporate, institutional, and public sector clients; and market-making services, including asset classes, risk management solutions, financing, prime brokerage, research, securities clearing, and settlement. The banking segment includes investment banking; advisory services related to mergers and acquisitions, divestitures, restructurings, and corporate defense activities; and corporate lending, which includes corporate and commercial banking. The U.S. Personal Banking segment provides co-branded cards and retail banking services. The Wealth segment provides financial services to high-net-worth clients through banking, lending, mortgages, investment, custody, and trust product offerings; and to professional industries, including law firms, consulting groups, accounting, and asset management. The company was founded in 1812 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"U.S. Bancorp","Symbol":"USB","Current Price":"48.23","Latest MA":"45.97","Price Target":57.14286,"Difference from MA":"4.91%","Difference from Open":"-0.26%","Change from Yesterday":"-0.51%","Change from Last Report":"0.07","Latest Volume":"4,476,555","Market Cap":"75,230,994,432","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":9.96994,"PB Ratio":1.4459835,"ROE":0.09779,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.04,"Trailing PEG":1.1681,"Trailing PE":12.724274,"Trailing PS":3.0216892,"Quick Ratio":"N\/A","Day High":49.1775,"Day Low":48.13,"VS Average Volume":0.5606536792,"Company Summary":"U.S. Bancorp, a financial services holding company, provides various financial services to individuals, businesses, institutional organizations, governmental entities, and other financial institutions in the United States. It operates through Wealth, Corporate, Commercial and Institutional Banking; Consumer and Business Banking; Payment Services; and Treasury and Corporate Support segments. The company offers depository services, including checking accounts, savings accounts, and time certificate contracts; and lending services, such as traditional credit products and credit card services, lease financing and import\/export trade, asset-backed lending, agricultural finance, and other products. It also provides ancillary services comprising capital markets, treasury management, and receivable lock-box collection services to corporate and governmental entity customers. In addition, the company offers asset management and fiduciary services for individuals, estates, foundations, business corporations, and charitable organizations. Further, it provides investment and insurance products to its customers principally within its domestic markets, as well as fund administration services to mutual and other funds. Additionally, the company provides corporate and purchasing card, and corporate trust services. Furthermore, it offers trust and investment management, merchant and ATM processing, mortgage banking, insurance, and brokerage and leasing services. U.S. Bancorp was founded in 1863 and is headquartered in Minneapolis, Minnesota.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"JP Morgan Chase & Co.","Symbol":"JPM","Current Price":"267.78","Latest MA":"223.32","Price Target":264.1195,"Difference from MA":"19.91%","Difference from Open":"0.21%","Change from Yesterday":"0.19%","Change from Last Report":"-0.01","Latest Volume":"3,312,444","Market Cap":"749,141,295,104","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.713923,"PB Ratio":2.3254886,"ROE":0.16216,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.091,"Trailing PEG":7.2592,"Trailing PE":13.56535,"Trailing PS":4.620108,"Quick Ratio":"N\/A","Day High":270.67,"Day Low":267.16,"VS Average Volume":0.3479136017,"Company Summary":"JPMorgan Chase & Co. operates as a financial services company worldwide. It operates through three segments: Consumer & Community Banking, Commercial & Investment Bank, and Asset & Wealth Management. It offers deposit, investment and lending products, cash management, and payments and services; mortgage origination and servicing activities; residential mortgages and home equity loans; and credit cards, auto loans, leases, and travel services to consumers and small businesses through bank branches, ATMs, and digital and telephone banking. The company also provides investment banking products and services, including corporate strategy and structure advisory, and equity and debt market capital-raising services, as well as loan origination and syndication; payments; and cash and derivative instruments, risk management solutions, prime brokerage, and research, as well as offers securities services, including custody, fund accounting and administration, and securities lending products for asset managers, insurance companies, and public and private investment funds. In addition, it provides financial solutions, including lending, payments, investment banking, and asset management to small and midsized companies, local governments, nonprofit clients, and large corporations, as well as investors, developers, and owners of multifamily, office, retail, industrial, and affordable housing properties. Further, the company offers multi-asset investment management solutions in equities, fixed income, alternatives, and money market funds to institutional clients and retail investors; and retirement products and services, brokerage, custody, estate planning, lending, deposits, and investment management products to high net worth clients. JPMorgan Chase & Co. was founded in 1799 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Wells Fargo & Company","Symbol":"WFC","Current Price":"78.48","Latest MA":"63.44","Price Target":82.95238,"Difference from MA":"23.71%","Difference from Open":"0.94%","Change from Yesterday":"0.73%","Change from Last Report":"0.01","Latest Volume":"3,369,956","Market Cap":"258,116,026,368","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":11.4736,"PB Ratio":1.5945387,"ROE":0.099139996,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.136,"Trailing PEG":3.443,"Trailing PE":14.614526,"Trailing PS":3.3144913,"Quick Ratio":"N\/A","Day High":78.98,"Day Low":77.61,"VS Average Volume":0.2021587356,"Company Summary":"Wells Fargo & Company, a financial services company, provides diversified banking, investment, mortgage, and consumer and commercial finance products and services in the United States and internationally. The company operates through four segments: Consumer Banking and Lending; Commercial Banking; Corporate and Investment Banking; and Wealth and Investment Management. The Consumer Banking and Lending segment offers diversified financial products and services for consumers and small businesses. Its financial products and services include checking and savings accounts, and credit and debit cards, as well as home, auto, personal, and small business lending services. The Commercial Banking segment provides financial solutions to private, family owned, and certain public companies. Its products and services include banking and credit products across various industry sectors and municipalities, secured lending and lease products, and treasury management services. The Corporate and Investment Banking segment offers a suite of capital markets, banking, and financial products and services, such as corporate banking, investment banking, treasury management, commercial real estate lending and servicing, equity, and fixed income solutions, as well as sales, trading, and research capabilities services to corporate, commercial real estate, government, and institutional clients. The Wealth and Investment Management segment provides personalized wealth management, brokerage, financial planning, lending, private banking, and trust and fiduciary products and services to affluent, high-net worth, and ultra-high-net worth clients. It also operates through financial advisors in brokerage and wealth offices, consumer bank branches, independent offices, and digitally through WellsTrade and Intuitive Investor. The company was founded in 1852 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Delta Air Lines, Inc.","Symbol":"DAL","Current Price":"68.25","Latest MA":"52.79","Price Target":79.92864,"Difference from MA":"29.29%","Difference from Open":"-0.09%","Change from Yesterday":"0.86%","Change from Last Report":"0.04","Latest Volume":"1,539,441","Market Cap":"44,040,429,568","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.08496,"PB Ratio":3.2064834,"ROE":0.4067,"DTE":186.78,"Industry":"Airlines","Sector":"Industrials","Beta":1.341,"Trailing PEG":null,"Trailing PE":12.804878,"Trailing PS":0.73027056,"Quick Ratio":0.268,"Day High":68.53,"Day Low":67.7304,"VS Average Volume":0.1924082867,"Company Summary":"Delta Air Lines, Inc. provides scheduled air transportation for passengers and cargo in the United States and internationally. The company operates through two segments, Airline and Refinery. Its domestic network centered on core hubs in Atlanta, Minneapolis-St. Paul, Detroit, and Salt Lake City, as well as coastal hub positions in Boston, Los Angeles, New York-LaGuardia, New York-JFK, and Seattle; and international network centered on hubs and market presence in Amsterdam, Bogota, Lima, Mexico City, London-Heathrow, Paris-Charles de Gaulle, Sao Paulo, Seoul-Incheon, and Tokyo. The company sells its tickets through various distribution channels, including delta.com and the Fly Delta app; acts as a reservations specialists; and operates online travel and traditional brick and mortar agencies. It also provides aircraft maintenance and engineering support, repair, and overhaul services; and vacation packages to third-party consumers. The company operates through a fleet of approximately 1,273 aircrafts. Delta Air Lines, Inc. was founded in 1924 and is based in Atlanta, Georgia.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Walgreens Boots Alliance, Inc.","Symbol":"WBA","Current Price":"11.29","Latest MA":"9.79","Price Target":12.414,"Difference from MA":"15.33%","Difference from Open":"3.78%","Change from Yesterday":"3.67%","Change from Last Report":"-0.12","Latest Volume":"5,935,988","Market Cap":"9,757,411,328","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":7.6292048,"PB Ratio":0.9340144,"ROE":-0.75969005,"DTE":277.898,"Industry":"Pharmaceutical Retailers","Sector":"Healthcare","Beta":0.669,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.06608116,"Quick Ratio":0.332,"Day High":11.38,"Day Low":10.87,"VS Average Volume":0.2442961005,"Company Summary":"Walgreens Boots Alliance, Inc. operates as a healthcare, pharmacy, and retail company in the United States, Germany, the United Kingdom, and internationally. It operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The U.S. Retail Pharmacy segment engages in operation of the retail drugstores, health and wellness services, specialty, and home delivery pharmacy services, which offers health and wellness, beauty, personal care and consumables, and general merchandise. The International segment offers sale of prescription drugs and health and wellness, beauty, personal care, and other consumer products outside the United States; and operates pharmacy-led health and beauty retail businesses under the Boots brand stores in the United Kingdom, the Republic of Ireland, and Thailand, as well as the Benavides brand in Mexico and the Ahumada brand in Chile. The U.S. Healthcare segment provides VillageMD, a national provider of value-based care with primary, multi-specialty, and urgent care providers serving patients in traditional clinic settings, in patients' homes and online appointments; Shields, a specialty pharmacy integrator and accelerator for hospitals; and CareCentrix, a participant in the post-acute and home care management sectors. Walgreens Boots Alliance, Inc. was founded in 1909 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Palantir Technologies Inc.","Symbol":"PLTR","Current Price":"79.20","Latest MA":"47.40","Price Target":49.245,"Difference from MA":"67.07%","Difference from Open":"-0.94%","Change from Yesterday":"-1.27%","Change from Last Report":"0.12","Latest Volume":"23,442,821","Market Cap":"180,415,545,344","Earning Date":"2025-02-03","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":164.49632,"PB Ratio":39.95883,"ROE":0.12409,"DTE":5.552,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":2.697,"Trailing PEG":3.4392,"Trailing PE":395.992,"Trailing PS":68.175545,"Quick Ratio":5.546,"Day High":80.8199,"Day Low":77.81,"VS Average Volume":0.282624053,"Company Summary":"Palantir Technologies Inc. builds and deploys software platforms for the intelligence community to assist in counterterrorism investigations and operations in the United States, the United Kingdom, and internationally. The company provides Palantir Gotham, a software platform which enables users to identify patterns hidden deep within datasets, ranging from signals intelligence sources to reports from confidential informants, as well as facilitates the handoff between analysts and operational users, helping operators plan and execute real-world responses to threats that have been identified within the platform. It also offers Palantir Foundry, a platform that transforms the ways organizations operate by creating a central operating system for their data; and allows individual users to integrate and analyze the data they need in one place. In addition, it provides Palantir Apollo, a software that delivers software and updates across the business, as well as enables customers to deploy their software virtually in any environment; and Palantir Artificial Intelligence Platform (AIP) that provides unified access to open-source, self-hosted, and commercial large language models (LLM) that can transform structured and unstructured data into LLM-understandable objects and can turn organizations' actions and processes into tools for humans and LLM-driven agents. The company was incorporated in 2003 and is headquartered in Denver, Colorado.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Exxon Mobil Corporation","Symbol":"XOM","Current Price":"108.25","Latest MA":"114.48","Price Target":129.47845,"Difference from MA":"-5.44%","Difference from Open":"0.50%","Change from Yesterday":"0.15%","Change from Last Report":"-0.01","Latest Volume":"4,662,075","Market Cap":"475,768,487,936","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":13.6913185,"PB Ratio":1.7713379,"ROE":0.14513999,"DTE":15.394,"Industry":"Oil & Gas Integrated","Sector":"Energy","Beta":0.88,"Trailing PEG":4.1421,"Trailing PE":13.480698,"Trailing PS":1.38378,"Quick Ratio":0.978,"Day High":108.66,"Day Low":107.47,"VS Average Volume":0.2978845934,"Company Summary":"Exxon Mobil Corporation engages in the exploration and production of crude oil and natural gas in the United States and internationally. It operates through Upstream, Energy Products, Chemical Products, and Specialty Products segments. The Upstream segment explores for and produces crude oil and natural gas. The Energy Products segment offers fuels, aromatics, and catalysts, as well as licensing services. It sells its products under the Exxon, Esso, and Mobil brands. The Chemical Products segment manufactures and markets petrochemicals including olefins, polyolefins, and intermediates. The Specialty Products segment offers performance products, including lubricants, basestocks, waxes, synthetics, elastomers, and resins. The company also involves in the manufacturing, trade, transport, and sale of crude oil, natural gas, petroleum products, petrochemicals, and other specialty products; and pursuit lower-emission business opportunities, including carbon capture and storage, hydrogen, lower-emission fuels, and lithium. Exxon Mobil Corporation was founded in 1870 and is based in Spring, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Chevron Corporation","Symbol":"CVX","Current Price":"155.69","Latest MA":"150.08","Price Target":177.1913,"Difference from MA":"3.74%","Difference from Open":"-0.02%","Change from Yesterday":"-0.36%","Change from Last Report":"-0.11","Latest Volume":"1,973,092","Market Cap":"277,582,610,432","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":13.8494425,"PB Ratio":1.7912067,"ROE":0.103520006,"DTE":16.456,"Industry":"Oil & Gas Integrated","Sector":"Energy","Beta":1.078,"Trailing PEG":3.2309,"Trailing PE":17.09,"Trailing PS":1.4480884,"Quick Ratio":0.675,"Day High":156.555,"Day Low":154.81,"VS Average Volume":0.2374136904,"Company Summary":"Chevron Corporation, through its subsidiaries, engages in the integrated energy and chemicals operations in the United States and internationally. The company operates in two segments, Upstream and Downstream. The Upstream segment is involved in the exploration, development, production, and transportation of crude oil and natural gas; processing, liquefaction, transportation, and regasification of liquefied natural gas; transportation of crude oil through pipelines; transportation, storage, and marketing of natural gas; and carbon capture and storage, as well as a gas-to-liquids plant. The Downstream segment refines crude oil into petroleum products; markets crude oil, refined products, and lubricants; manufactures and markets renewable fuels, commodity petrochemicals, plastics for industrial uses, and fuel and lubricant additives; and transports crude oil and refined products by pipeline, marine vessel, motor equipment, and rail car. The company was formerly known as ChevronTexaco Corporation and changed its name to Chevron Corporation in 2005. Chevron Corporation was founded in 1879 and is headquartered in San Ramon, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Eaton Corporation, PLC","Symbol":"ETN","Current Price":"318.61","Latest MA":"329.00","Price Target":377.53708,"Difference from MA":"-3.16%","Difference from Open":"1.63%","Change from Yesterday":"1.87%","Change from Last Report":"0.21","Latest Volume":"1,999,886","Market Cap":"125,914,669,056","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":26.557205,"PB Ratio":6.586525,"ROE":0.20079,"DTE":52.594,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":1.01,"Trailing PEG":2.7138,"Trailing PE":33.85866,"Trailing PS":5.1174426,"Quick Ratio":0.911,"Day High":318.63,"Day Low":310.12,"VS Average Volume":0.8402952966,"Company Summary":"Eaton Corporation plc operates as a power management company worldwide. The company's Electrical Americas and Electrical Global segment provides electrical components, industrial components, power distribution and assemblies, residential products, single and three phase power quality and connectivity products, wiring devices, circuit protection products, utility power distribution products, power reliability equipment, and services, as well as hazardous duty electrical equipment, emergency lighting, fire detection, explosion-proof instrumentation, and structural support systems. Its Aerospace segment offers pumps, motors, hydraulic power units, hoses and fittings, and electro-hydraulic pumps; valves, cylinders, electronic controls, electromechanical actuators, sensors, aircraft flap and slat systems, and nose wheel steering systems; hose, thermoplastic tubing products, fittings, adapters, couplings, and sealing and ducting products; air-to-air refueling systems, fuel pumps, fuel inerting products, sensors, and adapters and regulators; oxygen generation system, payload carriages, and thermal management products; and wiring connectors and cables, as well as hydraulic and bag filters, strainers and cartridges, and golf grips for manufacturers of commercial and military aircraft, and related after-market customers, as well as industrial applications. The company's Vehicle segment offers transmissions, clutches, hybrid power systems, superchargers, engine valves and valve actuation systems, locking and limited slip differentials, transmission controls, and fuel vapor components for the vehicle industry. Its eMobility segment provides voltage inverters, converters, fuses, circuit protection units, vehicle controls, power distribution systems, fuel tank isolation valves, and commercial vehicle hybrid systems. Eaton Corporation plc was founded in 1911 and is based in Dublin, Ireland.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"AbbVie Inc.","Symbol":"ABBV","Current Price":"175.93","Latest MA":"181.15","Price Target":199.96964,"Difference from MA":"-2.88%","Difference from Open":"0.82%","Change from Yesterday":"0.61%","Change from Last Report":"-0.01","Latest Volume":"1,287,380","Market Cap":"310,884,106,240","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":14.475052,"PB Ratio":51.54556,"ROE":0.56407,"DTE":1174.815,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.613,"Trailing PEG":0.413,"Trailing PE":61.297913,"Trailing PS":5.598187,"Quick Ratio":0.436,"Day High":176.92,"Day Low":174.3,"VS Average Volume":0.1935419371,"Company Summary":"AbbVie Inc. discovers, develops, manufactures, and sells pharmaceuticals worldwide. The company offers Humira, an injection for autoimmune and intestinal Behçet's diseases, and pyoderma gangrenosum; Skyrizi to treat moderate to severe plaque psoriasis, psoriatic disease, and Crohn's disease; Rinvoq to treat rheumatoid and psoriatic arthritis, ankylosing spondylitis, atopic dermatitis, axial spondyloarthropathy, ulcerative colitis, and Crohn's disease; Imbruvica for the treatment of adult patients with blood cancers; Epkinly to treat lymphoma; Elahere to treat cancer; and Venclexta\/Venclyxto to treat blood cancers. It also provides facial injectables, plastics and regenerative medicine, body contouring, and skincare products; botox therapeutic; Vraylar for depressive disorder; Duopa and Duodopa to treat advanced Parkinson's disease; Ubrelvy for the acute treatment of migraine in adults; and Qulipta for episodic and chronic migraine. In addition, the company offers Ozurdex for eye diseases; Lumigan\/Ganfort and Alphagan\/Combigan for the reduction of elevated intraocular pressure in patients with open angle glaucoma or ocular hypertension; Restasis to increase tear production; and other eye care products. Further, it provides Mavyret\/Maviret to treat chronic hepatitis C virus genotype 1-6 infection; Creon, a pancreatic enzyme therapy; Lupron to treat advanced prostate cancer, endometriosis and central precocious puberty, and patients with anemia caused by uterine fibroids; Linzess\/Constella to treat irritable bowel syndrome with constipation and chronic idiopathic constipation; and Synthroid for hypothyroidism. It has collaborations with Calico Life Sciences LLC; REGENXBIO Inc.; Janssen Biotech, Inc.; Evolveimmune Therapeutics, Inc.; Genentech, Inc.; AbCellera Biologics Inc.; and Tentarix Biotherapeutics, LP. The company was incorporated in 2012 and is headquartered in North Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Mobileye Global Inc.","Symbol":"MBLY","Current Price":"16.23","Latest MA":"17.02","Price Target":20.79179,"Difference from MA":"-4.62%","Difference from Open":"-0.62%","Change from Yesterday":"-2.96%","Change from Last Report":"0.65","Latest Volume":"1,640,042","Market Cap":"13,163,309,056","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":39.36836,"PB Ratio":1.0898468,"ROE":-0.21936001,"DTE":0.439,"Industry":"Auto Parts","Sector":"Consumer Cyclical","Beta":0.059,"Trailing PEG":0.6963,"Trailing PE":"N\/A","Trailing PS":7.3088894,"Quick Ratio":4.215,"Day High":16.58,"Day Low":15.97,"VS Average Volume":0.2227947115,"Company Summary":"Mobileye Global Inc. develops and deploys advanced driver assistance systems (ADAS) and autonomous driving technologies and solutions worldwide. The company operates through Mobileye and Other segments. It offers Driver Assist comprising ADAS and autonomous vehicle solutions that covers safety features, such as real-time detection of road users, geometry, semantics, and markings to provide safety alerts and emergency interventions; Cloud-Enhanced Driver Assist, a solution for drivers with interpretations of a scene in real-time; Mobileye SuperVision Lite, a navigation and assisted driving solution; and Mobileye SuperVision, an operational point-to-point assisted driving navigation solution on various road types and includes cloud-based enhancements, such as road experience management. The company also provides Mobileye Chauffeur, a first-generation solution for eyes-off\/hands-off driving with a human driver still in the driver's seat; Mobileye Drive, a self-driving system comprising of radar and lidar subsystems, as well as collision avoidance systems, including Mobileye 8 Connect for light and medium-duty vehicles, and Mobileye Shield+ for large vehicles. It serves original equipment manufacturers. The company was founded in 1999 and is headquartered in Jerusalem, Israel. Mobileye Global Inc. operates as a subsidiary of Intel Overseas Funding Corporation.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"United States Steel Corporation","Symbol":"X","Current Price":"36.33","Latest MA":"37.16","Price Target":39.5675,"Difference from MA":"-2.24%","Difference from Open":"-0.08%","Change from Yesterday":"0.00%","Change from Last Report":"-0.14","Latest Volume":"1,230,664","Market Cap":"8,180,463,104","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":15.645995,"PB Ratio":0.7065345,"ROE":0.03452,"DTE":37.015,"Industry":"Steel","Sector":"Basic Materials","Beta":1.861,"Trailing PEG":null,"Trailing PE":22.993671,"Trailing PS":0.50263983,"Quick Ratio":0.991,"Day High":36.95,"Day Low":36.05,"VS Average Volume":0.1789426068,"Company Summary":"United States Steel Corporation produces and sells flat-rolled and tubular steel products primarily in North America and Europe. The company operates through North American Flat-Rolled (Flat-Rolled), Mini Mill, U. S. Steel Europe (USSE), and Tubular Products (Tubular) segments. The Flat-Rolled segment offers slabs, strip mill plates, sheets, and tin mill products, as well as iron ore and coke. This segment serves customers in the service center, conversion, transportation, automotive, construction, container, appliance, and electrical markets. The Mini Mill segment provides hot-rolled, cold-rolled, and coated sheets and electrical steel products. This segment serves customers in the automotive, construction, pipe and tube, sheet converter, electrical, solar industrial equipment, and service center markets. The USSE segment provides slabs, strip mill plates, sheets, tin mill products, and spiral welded pipes. This segment serves customers in the construction, container, appliance and electrical, service center, conversion, oil, gas, and petrochemical markets. The Tubular segment offers seamless and electric resistance welded steel casing and tubing products, as well as standard and line pipe and mechanical tubing products primarily to customers in the oil, gas, and petrochemical markets. It also engages in the real estate business. United States Steel Corporation was founded in 1901 and is headquartered in Pittsburgh, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Trane Technologies plc","Symbol":"TT","Current Price":"366.09","Latest MA":"371.96","Price Target":414.62906,"Difference from MA":"-1.58%","Difference from Open":"1.10%","Change from Yesterday":"0.10%","Change from Last Report":"0.18","Latest Volume":"1,181,065","Market Cap":"82,379,038,720","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":28.90391,"PB Ratio":10.8599825,"ROE":0.35146,"DTE":69.203,"Industry":"Building Products & Equipment","Sector":"Industrials","Beta":1.221,"Trailing PEG":2.6189,"Trailing PE":33.58624,"Trailing PS":4.2489047,"Quick Ratio":0.873,"Day High":367.09,"Day Low":359.68,"VS Average Volume":0.9286671882,"Company Summary":"Trane Technologies plc, together with its subsidiaries, designs, manufactures, sells, and services of solutions for heating, ventilation, air conditioning, custom, and custom and transport refrigeration in Ireland and internationally. It offers air conditioners, exchangers, and handlers; airside and terminal devices; air sourced heat pumps, auxiliary power units; chillers; coils and condensers; gensets; dehumidifiers; ductless; furnaces; home automation products; humidifiers; indoor air quality assessments and related products; large and light commercial unitary products; refrigerant reclamation products; thermostats\/controls; transport heater products; variable refrigerant flow products; and water source heat pumps. The company also provides building management, telematic, control, energy efficiency and infrastructure program, geothermal, thermal energy, thermostats, rate chambers, package heating and cooling, temporary heating and cooling, and unitary systems; bus, rail, and multi-pipe heating, ventilation, and air conditioning systems; and container, diesel-powered, truck, industrial, rail, self-powered truck, trailer, and vehicle-powered truck refrigeration and air filtration systems, as well as aftermarket and OEM parts and supplies. In addition, it offers energy and facility management, installation and performance contracting, repair and maintenance, and rental services. It markets and sells its products under the Trane and Thermo King brands through sales offices, distributors, and dealers; and through sales and service companies with a supporting chain of distributors. The company was formerly known as Ingersoll-Rand Plc and changed its name to Trane Technologies plc in March 2020. Trane Technologies plc was founded in 1885 and is headquartered in Swords, Ireland.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"International Paper Company","Symbol":"IP","Current Price":"58.18","Latest MA":"50.34","Price Target":56.46,"Difference from MA":"15.58%","Difference from Open":"-0.03%","Change from Yesterday":"-1.62%","Change from Last Report":"-0.21","Latest Volume":"4,352,725","Market Cap":"20,212,197,376","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":19.068533,"PB Ratio":2.3422842,"ROE":0.04797,"DTE":69.707,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":0.988,"Trailing PEG":0.5253,"Trailing PE":49.726498,"Trailing PS":1.0843455,"Quick Ratio":1.021,"Day High":58.975,"Day Low":57.73,"VS Average Volume":0.962141868,"Company Summary":"International Paper Company produces and sells renewable fiber-based packaging and pulp products in North America, Latin America, Europe, and North Africa. It operates through two segments, Industrial Packaging and Global Cellulose Fibers. The company offers linerboard, medium, whitetop, recycled linerboard, recycled medium and saturating kraft; and pulp for a range of applications, such as diapers, towel and tissue products, feminine care, incontinence, and other personal care products, as well as specialty pulps for use in textiles, construction materials, paints, coatings, and others. It sells its products directly to end users and converters, as well as through agents, resellers, and distributors. The company was founded in 1898 and is headquartered in Memphis, Tennessee.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Baker Hughes Company","Symbol":"BKR","Current Price":"43.40","Latest MA":"38.30","Price Target":47.63885,"Difference from MA":"13.32%","Difference from Open":"0.42%","Change from Yesterday":"0.27%","Change from Last Report":"-0.10","Latest Volume":"2,474,393","Market Cap":"42,945,429,504","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":17.047821,"PB Ratio":2.6515152,"ROE":0.14292,"DTE":36.933,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.363,"Trailing PEG":0.9645,"Trailing PE":19.461884,"Trailing PS":1.5730927,"Quick Ratio":0.749,"Day High":44.11,"Day Low":43.22,"VS Average Volume":0.3795237871,"Company Summary":"Baker Hughes Company provides a portfolio of technologies and services to energy and industrial value chain worldwide. The company operates through Oilfield Services & Equipment (OFSE) and Industrial & Energy Technology (IET) segments. The OFSE segment designs and manufactures products and provides related services, including exploration, appraisal, development, production, rejuvenation, and decommissioning for onshore and offshore oilfield operations. This segment also provides drilling services, drill bits, and drilling and completions fluids; completions, intervention, measurements, pressure pumping, and wireline services; artificial lift systems, and oilfield and industrial chemicals; subsea projects and services, flexible pipe systems, and surface pressure control systems; and integrated well services and solutions. It serves oil and natural gas companies; the United States and international independent oil and natural gas companies; national or state-owned oil companies; engineering, procurement, and construction contractors; geothermal companies; and other oilfield service companies. The IET segment provides gas technology equipment, including drivers, driven equipment, flow control, and turnkey solutions for the mechanical-drive, compression, and power-generation applications; and energy sectors, such as oil and gas, LNG operations, petrochemical, and carbon solutions. This segment also provides rack-based vibration monitoring equipment and sensors; integrated asset performance management products; inspection services; pumps, valves, and gears; precision sensors and instrumentation, and condition monitoring solutions. It serves upstream, midstream, downstream, onshore, offshore, and small and large scale customers. The company was formerly known as Baker Hughes, a GE company and changed its name to Baker Hughes Company in October 2019. Baker Hughes Company was incorporated in 2016 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Intel Corporation","Symbol":"INTC","Current Price":"19.95","Latest MA":"23.49","Price Target":23.82824,"Difference from MA":"-15.08%","Difference from Open":"0.38%","Change from Yesterday":"0.73%","Change from Last Report":"0.08","Latest Volume":"26,227,447","Market Cap":"86,022,782,976","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":21.188782,"PB Ratio":0.86345726,"ROE":-0.15597,"DTE":47.906,"Industry":"Semiconductors","Sector":"Technology","Beta":1.026,"Trailing PEG":0.5876,"Trailing PE":"N\/A","Trailing PS":1.5857612,"Quick Ratio":0.833,"Day High":20.08,"Day Low":19.78,"VS Average Volume":0.3543251355,"Company Summary":"Intel Corporation designs, develops, manufactures, markets, and sells computing and related products and services worldwide. It operates through Client Computing Group, Data Center and AI, Network and Edge, Mobileye, and Intel Foundry Services segments. The company's products portfolio comprises central processing units and chipsets, system-on-chips (SoCs), and multichip packages; mobile and desktop processors; hardware products comprising graphics processing units (GPUs), domain-specific accelerators, and field programmable gate arrays (FPGAs); and memory and storage, connectivity and networking, and other semiconductor products. It also offers silicon devices and software products; and optimization solutions for workloads, such as AI, cryptography, security, storage, networking, and leverages various features supporting diverse compute environments. In addition, the company develops and deploys advanced driver assistance systems (ADAS), and autonomous driving technologies and solutions; and provides advanced process technologies backed by an ecosystem of IP, EDA, and design services, as well as systems of chips, including advanced packaging technologies, software and accelerate bring-up, and integration of chips and driving standards. Further, it delivers and deploys intelligent edge platforms that allow developers to achieve agility and drive automation using AI for efficient operations with data integrity, as well as provides hardware and software platforms, tools, and ecosystem partnerships for digital transformation from the cloud to edge. The company serves original equipment manufacturers, original design manufacturers, cloud service providers, and other manufacturers and service providers. It has a strategic agreement with Synopsys, Inc. to develop EDA and IP solutions; and ARM that enables chip designers to build optimized compute SoCs on the Intel 18A process. Intel Corporation was incorporated in 1968 and is headquartered in Santa Clara, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Apple Inc.","Symbol":"AAPL","Current Price":"236.76","Latest MA":"229.37","Price Target":245.794,"Difference from MA":"3.22%","Difference from Open":"1.11%","Change from Yesterday":"-0.69%","Change from Last Report":"-0.06","Latest Volume":"20,638,575","Market Cap":"3,560,372,961,280","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":28.58609,"PB Ratio":62.851074,"ROE":1.5741299,"DTE":209.059,"Industry":"Consumer Electronics","Sector":"Technology","Beta":1.24,"Trailing PEG":2.1712,"Trailing PE":38.94079,"Trailing PS":9.104999,"Quick Ratio":0.745,"Day High":238.0,"Day Low":234.01,"VS Average Volume":0.4156818884,"Company Summary":"Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod. It also provides AppleCare support and cloud services; and operates various platforms, including the App Store that allow customers to discover and download applications and digital content, such as books, music, video, games, and podcasts, as well as advertising services include third-party licensing arrangements and its own advertising platforms. In addition, the company offers various subscription-based services, such as Apple Arcade, a game subscription service; Apple Fitness+, a personalized fitness service; Apple Music, which offers users a curated listening experience with on-demand radio stations; Apple News+, a subscription news and magazine service; Apple TV+, which offers exclusive original content; Apple Card, a co-branded credit card; and Apple Pay, a cashless payment service, as well as licenses its intellectual property. The company serves consumers, and small and mid-sized businesses; and the education, enterprise, and government markets. It distributes third-party applications for its products through the App Store. The company also sells its products through its retail and online stores, and direct sales force; and third-party cellular network carriers, wholesalers, retailers, and resellers. Apple Inc. was founded in 1976 and is headquartered in Cupertino, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Comcast Corporation","Symbol":"CMCSA","Current Price":"37.72","Latest MA":"39.58","Price Target":47.7025,"Difference from MA":"-4.72%","Difference from Open":"0.39%","Change from Yesterday":"0.38%","Change from Last Report":"-0.02","Latest Volume":"7,386,433","Market Cap":"144,323,313,664","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":8.682153,"PB Ratio":1.6860259,"ROE":0.16884,"DTE":117.127,"Industry":"Telecom Services","Sector":"Communication Services","Beta":1.004,"Trailing PEG":1.1651,"Trailing PE":10.166145,"Trailing PS":1.1726929,"Quick Ratio":0.605,"Day High":37.825,"Day Low":37.52,"VS Average Volume":0.3506729335,"Company Summary":"Comcast Corporation operates as a media and technology company worldwide. It operates through Residential Connectivity & Platforms, Business Services Connectivity, Media, Studios, and Theme Parks segments. The Residential Connectivity & Platforms segment provides residential broadband and wireless connectivity services, residential and business video services, sky-branded entertainment television networks, and advertising. The Business Services Connectivity segment offers connectivity services for small business locations, which include broadband, wireline voice, and wireless services, as well as solutions for medium-sized customers and larger enterprises; and small business connectivity services in the United Kingdom. The Media segment operates NBCUniversal's television and streaming business, including national and regional cable networks; the NBC and Telemundo broadcast networks and owned local broadcast television stations; and Peacock, a direct-to-consumer streaming services. It also operates international television networks comprising the Sky Sports networks, as well as other digital properties. The Studios segment operates NBCUniversal and Sky film and television studio production and distribution operations. The Theme Parks segment operates Universal theme parks in Orlando, Florida; Hollywood, California; Osaka, Japan; and Beijing, China. The company also offers a consolidated streaming platforms under the Philadelphia Flyers and the Wells Fargo Center arena in Philadelphia, Pennsylvania; and Xumo. Comcast Corporation was founded in 1963 and is headquartered in Philadelphia, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Flagstar Financial, Inc.","Symbol":"FLG","Current Price":"9.64","Latest MA":"10.56","Price Target":12.125,"Difference from MA":"-8.67%","Difference from Open":"0.21%","Change from Yesterday":"-0.10%","Change from Last Report":"0.21","Latest Volume":"1,654,872","Market Cap":"4,001,708,800","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":-24.576164,"PB Ratio":0.4961655,"ROE":-0.37158,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.0,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":2.8042808,"Quick Ratio":"N\/A","Day High":9.74,"Day Low":9.5348,"VS Average Volume":0.2805540651,"Company Summary":"Flagstar Financial, Inc. operates as the bank holding company for Flagstar Bank, N.A. that provides banking products and services in the United States. The company's deposit products include interest-bearing checking and money market, savings, non-interest-bearing, and retirement accounts, as well as certificates of deposit. Its loan products comprise multi-family loans; commercial real estate loans; acquisition, development, and construction loans; commercial and industrial loans; one-to-four family loans; specialty finance loans and leases; warehouse loans; and other loans, such as home equity lines of credit, boat and recreational vehicle indirect lending, point of sale consumer loans, and other consumer loans, including overdraft loans. The company offers cash management products; non-deposit investment and insurance products; and online banking, mobile banking, and bank-by-phone services. It primarily serves individuals, small and mid-size businesses, and professional associations. The company was formerly known as New York Community Bancorp, Inc. and changed its name to Flagstar Financial, Inc. in October 2024. Flagstar Financial, Inc. was founded in 1859 and is headquartered in Hicksville, New York.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Tractor Supply Company","Symbol":"TSCO","Current Price":"58.19","Latest MA":"54.87","Price Target":58.577,"Difference from MA":"6.05%","Difference from Open":"1.65%","Change from Yesterday":"1.42%","Change from Last Report":"0.09","Latest Volume":"1,410,079","Market Cap":"31,082,137,600","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":26.389072,"PB Ratio":2.7181633,"ROE":0.5058,"DTE":233.038,"Industry":"Specialty Retail","Sector":"Consumer Cyclical","Beta":0.814,"Trailing PEG":2.6942,"Trailing PE":28.382929,"Trailing PS":2.1044755,"Quick Ratio":0.086,"Day High":58.41,"Day Low":57.24,"VS Average Volume":0.2737129902,"Company Summary":"Tractor Supply Company operates as a rural lifestyle retailer in the United States. The company offers various merchandise, including livestock and equine feed and equipment, poultry, fencing, and sprayers and chemicals; food, treats, and equipment for dogs, cats, and other small animals, as well as dog wellness products; seasonal and recreation products comprising tractors and riders, lawn and garden, bird feeding, power equipment, and other recreational products; truck, tool, and hardware products, such as truck accessories, trailers, generators, lubricants, batteries, and hardware and tools; and clothing, gift, and décor products consist of clothing, footwear, toys, snacks, and decorative merchandise. It provides its products under the 4health, Paws & Claws, American Farmworks, Producer's Pride, Bit & Bridle, Red Shed, Blue Mountain, Redstone, C.E. Schmidt, Retriever, Country Lane, Ridgecut, Countyline, Royal Wing, Country Tuff, Strive, Dumor, Traveller, Farm Table, Treeline, Groundwork, TSC Tractor Supply Co, Huskee, Untamed, and JobSmart brand names. The company operates its retail stores under the Tractor Supply Company, Petsense by Tractor Supply, and Orscheln Farm and Home names; and operates websites under the TractorSupply.com and Petsense.com names. It sells its products to recreational farmers, ranchers, and others. Tractor Supply Company was founded in 1938 and is based in Brentwood, Tennessee.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Southwest Airlines Company","Symbol":"LUV","Current Price":"31.64","Latest MA":"29.92","Price Target":32.82571,"Difference from MA":"5.77%","Difference from Open":"-0.95%","Change from Yesterday":"-0.64%","Change from Last Report":"-0.11","Latest Volume":"2,476,214","Market Cap":"18,978,678,784","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":19.628946,"PB Ratio":1.8229737,"ROE":-0.00447,"DTE":87.36,"Industry":"Airlines","Sector":"Industrials","Beta":1.153,"Trailing PEG":0.4781,"Trailing PE":"N\/A","Trailing PS":0.6932597,"Quick Ratio":0.783,"Day High":32.135,"Day Low":31.625,"VS Average Volume":0.3638360581,"Company Summary":"Southwest Airlines Co. operates as a passenger airline company that provides scheduled air transportation services in the United States and near-international markets. As of December 31, 2023, the company operated a total fleet of 817 Boeing 737 aircraft; and served 121 destinations in 42 states, the District of Columbia, and the Commonwealth of Puerto Rico, as well as ten near-international countries, including Mexico, Jamaica, the Bahamas, Aruba, the Dominican Republic, Costa Rica, Belize, Cuba, the Cayman Islands, and Turks and Caicos. It also provides inflight entertainment and connectivity services on Wi-Fi enabled aircraft; and Rapid Rewards loyalty program that enables program members to earn points for dollars spent on Southwest base fares. In addition, the company offers a suite of digital platforms to support customers' travel needs, including websites and apps; and SWABIZ, an online booking tool. Further, it provides ancillary services, such as Southwest's EarlyBird Check-In, upgraded boarding, and transportation of pets and unaccompanied minors. Southwest Airlines Co. was incorporated in 1967 and is headquartered in Dallas, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Thermo Fisher Scientific Inc","Symbol":"TMO","Current Price":"573.92","Latest MA":"568.45","Price Target":645.4593,"Difference from MA":"0.96%","Difference from Open":"-0.18%","Change from Yesterday":"-1.81%","Change from Last Report":"-0.05","Latest Volume":"1,175,978","Market Cap":"219,524,399,104","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":24.757736,"PB Ratio":4.480809,"ROE":0.12944001,"DTE":72.329,"Industry":"Diagnostics & Research","Sector":"Healthcare","Beta":0.792,"Trailing PEG":2.2679,"Trailing PE":35.982445,"Trailing PS":5.1811285,"Quick Ratio":1.126,"Day High":577.03,"Day Low":568.6,"VS Average Volume":0.6056385177,"Company Summary":"Thermo Fisher Scientific Inc. provides life sciences solutions, analytical instruments, specialty diagnostics, and laboratory products and biopharma services in the North America, Europe, Asia-Pacific, and internationally. The company's Life Sciences Solutions segment offers reagents, instruments, and consumables for biological and medical research, discovery, and production of drugs and vaccines, as well as diagnosis of infections and diseases; and solutions include biosciences, genetic sciences, and bio production to pharmaceutical, biotechnology, agricultural, clinical, healthcare, academic, and government markets. Its Analytical Instruments segment provides instruments, consumables, software, and services for pharmaceutical, biotechnology, academic, government, environmental, and other research and industrial markets, as well as clinical laboratories. The company's Specialty Diagnostics segment offers liquid, ready-to-use, and lyophilized immunodiagnostic reagent kits, as well as calibrators, controls, protein detection assays, and instruments; immunodiagnostics develops, manufactures and markets complete bloodtest systems to support the clinical diagnosis and monitoring of allergy, asthma and autoimmune diseases; dehydrated and prepared culture media, collection and transport systems, instrumentation, and consumables; human leukocyte antigen typing and testing for organ transplant market; and healthcare products. Its Laboratory Products and Biopharma Services segment provides laboratory products, research and safety market channel, and pharma services and clinical research. It offers products and services through a direct sales force, customer-service professionals, electronic commerce, and third-party distributors under Thermo Scientific; Applied Biosystems; Invitrogen; Fisher Scientific; Unity Lab Services; and Patheon and PPD. It has a collaboration agreement with Mainz Biomed N.V. for the development of colorectal cancer screening product. Thermo Fisher Scientific Inc. was founded in 1956 and is headquartered in Waltham, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"United Parcel Service, Inc.","Symbol":"UPS","Current Price":"135.31","Latest MA":"129.79","Price Target":148.61774,"Difference from MA":"4.26%","Difference from Open":"-0.53%","Change from Yesterday":"-0.10%","Change from Last Report":"-0.13","Latest Volume":"1,512,083","Market Cap":"115,469,492,224","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":15.485715,"PB Ratio":6.846979,"ROE":0.31422,"DTE":155.425,"Industry":"Integrated Freight & Logistics","Sector":"Industrials","Beta":0.982,"Trailing PEG":1.7392,"Trailing PE":20.439577,"Trailing PS":1.2732891,"Quick Ratio":1.027,"Day High":136.58,"Day Low":134.93,"VS Average Volume":0.359339498,"Company Summary":"United Parcel Service, Inc., a package delivery company, provides transportation and delivery, distribution, contract logistics, ocean freight, airfreight, customs brokerage, and insurance services. It operates through two segments, U.S. Domestic Package and International Package. The U.S. Domestic Package segment offers time-definite delivery of express letters, documents, small packages, and palletized freight through air and ground services in the United States. The International Package segment provides guaranteed day and time-definite international shipping services comprising guaranteed time-definite express options in Europe, Asia, the Indian sub-continent, the Middle East, Africa, Canada, and Latin America. The company also offers international air and ocean freight forwarding, post-sales, and mail and consulting services. In addition, it provides truckload and customs brokerage services; supply chain solutions to the healthcare and life sciences industries; fulfillment and transportation management services; and integrated supply chain and shipment insurance solutions. United Parcel Service, Inc. was founded in 1907 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Dynatrace, Inc.","Symbol":"DT","Current Price":"57.70","Latest MA":"51.18","Price Target":62.10323,"Difference from MA":"12.75%","Difference from Open":"-0.35%","Change from Yesterday":"-0.43%","Change from Last Report":"0.11","Latest Volume":"1,397,139","Market Cap":"17,222,526,976","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":38.446674,"PB Ratio":8.033974,"ROE":0.08276,"DTE":3.76,"Industry":"Software - Application","Sector":"Technology","Beta":1.053,"Trailing PEG":1.2963,"Trailing PE":106.85185,"Trailing PS":11.016826,"Quick Ratio":1.249,"Day High":58.07,"Day Low":57.05,"VS Average Volume":0.4232521984,"Company Summary":"Dynatrace, Inc. provides a security platform for multicloud environments in North America, Europe, the Middle East, Africa, the Asia Pacific, and Latin America. The company operates Dynatrace, a security platform, which provides application and microservices monitoring, runtime application security, infrastructure monitoring, log management and analytics, digital experience monitoring, digital business analytics, and cloud automation. Its platform allows its customers to modernize and automate IT operations, delivers software, and enhance user experiences. In addition, the company offers implementation, consulting, and training services. It markets its products through a combination of direct sales team and a network of partners, including resellers, system integrators, and managed service providers. It serves customers in various industries comprising banking, financial services, government, insurance, retail and wholesale, transportation, and software. Dynatrace, Inc. was founded in 2005 and is headquartered in Waltham, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Unity Software Inc.","Symbol":"U","Current Price":"22.84","Latest MA":"20.01","Price Target":23.09783,"Difference from MA":"14.12%","Difference from Open":"-1.21%","Change from Yesterday":"-1.55%","Change from Last Report":"-0.15","Latest Volume":"2,146,436","Market Cap":"9,200,865,280","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":29.02197,"PB Ratio":2.8882146,"ROE":-0.23091999,"DTE":68.801,"Industry":"Software - Application","Sector":"Technology","Beta":2.291,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":4.681364,"Quick Ratio":2.26,"Day High":23.18,"Day Low":22.5001,"VS Average Volume":0.1959855592,"Company Summary":"Unity Software Inc. operates a platform that provides real-time 3D content and experiences. Its platform provides artificial intelligence solutions that support creators in building, running, and growing immersive, real-time 2D and 3D content for mobile phones, tablets, PCs, consoles, and augmented and virtual reality devices. The company also offers Create Solutions, a set of tools and services used to build, ship, and run real-time 2D and 3D content; and Grow Solutions, which allows customers to grow and engage their user base and monetize their content. It serves enterprises, mid-market companies, and government and non-profit institutions; mid-sized, small, and independent businesses; and individuals across various industries. The company offers its solutions directly through its online store, field sales operations, independent distributors, and resellers in North America, Denmark, China, Finland, the United Kingdom, Germany, Israel, Japan, Singapore, South Korea, Spain, and internationally. Unity Software Inc. was founded in 2004 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Dow Inc.","Symbol":"DOW","Current Price":"41.28","Latest MA":"47.89","Price Target":48.05882,"Difference from MA":"-13.80%","Difference from Open":"0.12%","Change from Yesterday":"-0.34%","Change from Last Report":"-0.10","Latest Volume":"1,915,910","Market Cap":"28,899,799,040","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":15.9417925,"PB Ratio":1.5782832,"ROE":0.05863,"DTE":95.059,"Industry":"Chemicals","Sector":"Basic Materials","Beta":1.222,"Trailing PEG":0.5944,"Trailing PE":27.519999,"Trailing PS":0.66928667,"Quick Ratio":0.8,"Day High":41.475,"Day Low":41.075,"VS Average Volume":0.2520555132,"Company Summary":"Dow Inc., through its subsidiaries, engages in the provision of various materials science solutions for packaging, infrastructure, mobility, and consumer applications in the United States, Canada, Europe, the Middle East, Africa, India, the Asia Pacific, and Latin America. The company operates through Packaging & Specialty Plastics, Industrial Intermediates & Infrastructure, and Performance Materials & Coatings segments. The Packaging & Specialty Plastics segment provides ethylene, and propylene and aromatics products; and polyethylene, polyolefin elastomers, ethylene vinyl acetate, and ethylene propylene diene monomer rubbers for mobility and transportation, consumer, wire and cable, and construction end-markets. The Industrial Intermediates & Infrastructure segment offers purified ethylene, ethylene and ethanol amines, propylene glycol and polyether polyols, aromatic isocyanates and coatings, adhesives, sealants, elastomers, and composites. This segment also provides caustic soda, and ethylene dichloride and vinyl chloride monomers; and cellulose ethers, redispersible latex powders, and acrylic emulsions. The Performance Materials and Coatings segment provides architectural paints and coatings, and industrial coatings that are used in maintenance and protective industries, wood, metal packaging, traffic markings, thermal paper, and leather; and silicon metal, siloxanes, and intermediates used as key materials in manufacturing differentiated downstream silicone products. It also engages in property and casualty insurance, as well as reinsurance business. Dow Inc. was incorporated in 2018 and is headquartered in Midland, Michigan.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Altria Group, Inc.","Symbol":"MO","Current Price":"52.71","Latest MA":"50.53","Price Target":56.58769,"Difference from MA":"4.31%","Difference from Open":"-0.17%","Change from Yesterday":"0.16%","Change from Last Report":"-0.01","Latest Volume":"2,812,051","Market Cap":"89,333,432,320","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":9.848691,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Tobacco","Sector":"Consumer Defensive","Beta":0.67,"Trailing PEG":3.6792,"Trailing PE":8.903716,"Trailing PS":4.387262,"Quick Ratio":0.274,"Day High":53.11,"Day Low":52.665,"VS Average Volume":0.3520962242,"Company Summary":"Altria Group, Inc., through its subsidiaries, manufactures and sells smokeable and oral tobacco products in the United States. The company offers cigarettes primarily under the Marlboro brand; large cigars and pipe tobacco under the Black & Mild brand; moist smokeless tobacco and snus products under the Copenhagen, Skoal, Red Seal, and Husky brands; oral nicotine pouches under the on! brand; and e-vapor products under the NJOY ACE brand. It sells its products to distributors, as well as large retail organizations, such as chain stores. The company was founded in 1822 and is headquartered in Richmond, Virginia.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Visa Inc.","Symbol":"V","Current Price":"335.89","Latest MA":"288.73","Price Target":342.5589,"Difference from MA":"16.33%","Difference from Open":"0.42%","Change from Yesterday":"0.36%","Change from Last Report":"-0.05","Latest Volume":"1,856,106","Market Cap":"650,440,933,376","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":26.594429,"PB Ratio":16.730091,"ROE":0.50708,"DTE":53.239,"Industry":"Credit Services","Sector":"Financial Services","Beta":0.952,"Trailing PEG":2.2184,"Trailing PE":34.521072,"Trailing PS":18.10502,"Quick Ratio":0.837,"Day High":336.84,"Day Low":334.5,"VS Average Volume":0.3072529234,"Company Summary":"Visa Inc. operates as a payment technology company in the United States and internationally. The company operates VisaNet, a transaction processing network that enables authorization, clearing, and settlement of payment transactions. It also offers credit, debit, and prepaid card products; tap to pay, tokenization, and click to pay services; Visa Direct, a solution that facilitates the delivery of funds to eligible cards, bank accounts, and digital wallets; Visa B2B Connect, a multilateral business-to-business cross-border payments network; Visa Cross-Border Solution, a cross-border consumer payments solution; and Visa DPS that provides a range of value-added services, including fraud mitigation, dispute management, data analytics, campaign management, a suite of digital solutions, and contact center services. The company also provides acceptance solutions, which include Cybersource and Authorize.net that provides new and enhanced payment integrations with ecommerce platforms, enabling sellers and acquirers to offer tailored commerce experiences; risk and identity solutions, such as Visa Advanced Authorization, Visa Secure, Visa Consumer Authentication Service, Visa Protect Authentication Intelligence, and Visa Provisioning Intelligence; and Visa Consulting and Analytics, a payment consulting advisory services. It provides its services under the Visa, Visa Electron, Interlink, V PAY, and PLUS brands. The company serves merchants, financial institutions, and government entities. Visa Inc. was founded in 1958 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"},{"Company Name":"Weyerhaeuser Company","Symbol":"WY","Current Price":"30.83","Latest MA":"30.49","Price Target":35.63636,"Difference from MA":"1.10%","Difference from Open":"0.52%","Change from Yesterday":"0.16%","Change from Last Report":"0.06","Latest Volume":"1,270,299","Market Cap":"22,400,524,288","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":34.341793,"PB Ratio":2.25712,"ROE":0.052989997,"DTE":51.335,"Industry":"REIT - Specialty","Sector":"Real Estate","Beta":1.428,"Trailing PEG":11.0524,"Trailing PE":42.232876,"Trailing PS":3.115511,"Quick Ratio":1.27,"Day High":31.085,"Day Low":30.67,"VS Average Volume":0.3743455652,"Company Summary":"Weyerhaeuser Company, one of the world's largest private owners of timberlands, began operations in 1900. We own or control approximately 11 million acres of timberlands in the U.S. and manage additional timberlands under long-term licenses in Canada. We manage these timberlands on a sustainable basis in compliance with internationally recognized forestry standards. We are also one of the largest manufacturers of wood products in North America. Our company is a real estate investment trust. In 2022, we generated $10.2 billion in net sales and employed approximately 9,200 people who serve customers worldwide. Our common stock trades on the New York Stock Exchange under the symbol WY.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 19:34:40"}]