[{"Company Name":"Bank of America Corporation","Symbol":"BAC","Current Price":"46.92","Latest MA":"41.79","Price Target":50.84682,"Difference from MA":"12.29%","Difference from Open":"-0.41%","Change from Yesterday":"-0.37%","Change from Last Report":"-0.37","Latest Volume":"3,456,073","Market Cap":"360,049,901,568","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":12.657732,"PB Ratio":1.3266518,"ROE":0.08092,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.325,"Trailing PEG":2.0868,"Trailing PE":17.001812,"Trailing PS":3.8049786,"Quick Ratio":"N\/A","Day High":47.24,"Day Low":46.7901,"VS Average Volume":0.1012844359,"Company Summary":"Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. It operates in four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, non-interest and interest-bearing checking accounts, and investment accounts and products; credit and debit cards; residential mortgages, and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research, and certain market-based services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"16-01-2025 16:32:29"}]