[{"Company Name":"Fifth Third Bancorp","Symbol":"FITB","Current Price":"42.66","Latest MA":"41.56","Price Target":50.54762,"Difference from MA":"2.65%","Difference from Open":"1.22%","Change from Yesterday":"2.08%","Change from Last Report":"0.04","Latest Volume":"1,791,679","Market Cap":"28,324,526,080","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":11.791548,"PB Ratio":1.5456094,"ROE":0.119160004,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.231,"Trailing PEG":3.3626,"Trailing PE":14.221667,"Trailing PS":3.5129015,"Quick Ratio":"N\/A","Day High":42.695,"Day Low":42.01,"VS Average Volume":0.3995285521,"Company Summary":"Fifth Third Bancorp operates as the bank holding company for Fifth Third Bank, National Association that engages in the provision of a range of financial products and services in the United States. It operates through three segments: Commercial Banking, Consumer and Small Business Banking, and Wealth and Asset Management. The Commercial Banking segment offers credit intermediation, cash management, and financial services; lending and depository products; and cash management, foreign exchange and international trade finance, derivatives and capital markets services, asset-based lending, real estate finance, public finance, commercial leasing, and syndicated finance for business, government, and professional customers. The Consumer and Small Banking segment provides a range of deposit and loan products to individuals and small businesses; home equity loans and lines of credit; credit cards; and cash management services. This segment also engages in the residential mortgage that include origination, retention and servicing of residential mortgage loans, sales and securitizations of loans, and hedging activities; indirect lending, including extending loans to consumers through automobile dealers, motorcycle dealers, powersport dealers, recreational vehicle dealers, and marine dealers; and home improvement and solar energy installation loans through contractors and installers. The Wealth & Asset Management segment provides various wealth management services for individuals, companies, and not-for-profit organizations. It offers retail brokerage services to individual clients; and broker dealer services to the institutional marketplace. This segment also provides wealth planning, investment management, banking, insurance, and trust and estate services; and advisory services for institutional clients comprising middle market businesses, non-profits, states, and municipalities. The company was founded in 1858 and is headquartered in Cincinnati, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-01-2025 18:02:11"},{"Company Name":"United Airlines Holdings, Inc.","Symbol":"UAL","Current Price":"107.66","Latest MA":"65.91","Price Target":120.61304,"Difference from MA":"63.34%","Difference from Open":"0.32%","Change from Yesterday":"2.69%","Change from Last Report":"-0.21","Latest Volume":"1,570,178","Market Cap":"35,406,790,656","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":8.463258,"PB Ratio":3.0955462,"ROE":0.27245,"DTE":291.676,"Industry":"Airlines","Sector":"Industrials","Beta":1.393,"Trailing PEG":0.8317,"Trailing PE":12.831943,"Trailing PS":0.63233185,"Quick Ratio":0.694,"Day High":108.14,"Day Low":105.6,"VS Average Volume":0.2431538653,"Company Summary":"United Airlines Holdings, Inc., through its subsidiaries, provides air transportation services in North America, Asia, Europe, Africa, the Pacific, the Middle East, and Latin America. The company transports people and cargo through its mainline and regional fleets. It also offers catering, ground handling, flight academy, and maintenance services for third parties. The company was formerly known as United Continental Holdings, Inc. and changed its name to United Airlines Holdings, Inc. in June 2019. United Airlines Holdings, Inc. was incorporated in 1968 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"14-01-2025 18:02:11"},{"Company Name":"GE Aerospace","Symbol":"GE","Current Price":"175.34","Latest MA":"172.21","Price Target":209.18353,"Difference from MA":"1.82%","Difference from Open":"1.29%","Change from Yesterday":"2.08%","Change from Last Report":"-0.38","Latest Volume":"1,538,552","Market Cap":"189,768,728,576","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":33.341953,"PB Ratio":10.054476,"ROE":0.22552,"DTE":110.224,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.188,"Trailing PEG":null,"Trailing PE":34.515747,"Trailing PS":2.7128031,"Quick Ratio":0.804,"Day High":176.15,"Day Low":172.395,"VS Average Volume":0.3117033827,"Company Summary":"General Electric Company, doing business as GE Aerospace, designs and produces commercial and defense aircraft engines, integrated engine components, electric power, and mechanical aircraft systems. It also offers aftermarket services to support its products. The company operates in the United States, Europe, China, Asia, the Americas, the Middle East, and Africa. General Electric Company was incorporated in 1892 and is based in Evendale, Ohio.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"14-01-2025 18:02:11"},{"Company Name":"KeyCorp","Symbol":"KEY","Current Price":"17.21","Latest MA":"16.40","Price Target":21.215,"Difference from MA":"4.94%","Difference from Open":"0.61%","Change from Yesterday":"0.91%","Change from Last Report":"0.00","Latest Volume":"2,026,026","Market Cap":"19,048,914,944","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":11.11958,"PB Ratio":1.1889633,"ROE":0.0096700005,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.231,"Trailing PEG":0.7055,"Trailing PE":"Infinity","Trailing PS":3.9259925,"Quick Ratio":"N\/A","Day High":17.2395,"Day Low":17.11,"VS Average Volume":0.2099435491,"Company Summary":"KeyCorp operates as the holding company for KeyBank National Association that provides various retail and commercial banking products and services in the United States. It operates in two segments, Consumer Bank and Commercial Bank. The company offers various deposits, investment products and services; commercial leasing, investment management, consumer finance; and personal finance and financial wellness, student loan refinancing, mortgage and home equity, lending, credit card, treasury, business advisory, wealth management, asset management, cash management, portfolio management, and trust and related services to individuals and small and medium-sized businesses. It also provides a suite of banking and capital market products, such as syndicated finance, debt and equity capital market products, commercial payments, equipment finance, commercial mortgage banking, derivatives, foreign exchange, financial advisory, and public finance, as well as commercial mortgage loans to consumer, energy, healthcare, industrial, public sector, real estate, and technology sectors for middle market clients. In addition, the company offers community development financing, securities underwriting, brokerage, and investment banking services. The company was founded in 1849 and is headquartered in Cleveland, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-01-2025 18:02:11"},{"Company Name":"D.R. Horton, Inc.","Symbol":"DHI","Current Price":"142.44","Latest MA":"166.57","Price Target":176.91376,"Difference from MA":"-14.49%","Difference from Open":"-0.04%","Change from Yesterday":"2.72%","Change from Last Report":"0.00","Latest Volume":"1,015,980","Market Cap":"45,698,883,584","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":9.049981,"PB Ratio":1.823372,"ROE":0.19631,"DTE":22.915,"Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":1.744,"Trailing PEG":0.5141,"Trailing PE":9.933055,"Trailing PS":1.2417703,"Quick Ratio":0.766,"Day High":143.55,"Day Low":141.31,"VS Average Volume":0.3465809931,"Company Summary":"D.R. Horton, Inc. operates as a homebuilding company in East, North, Southeast, South Central, Southwest, and Northwest regions in the United States. It engages in the acquisition and development of land; and construction and sale of residential homes in 125 markets across 36 states under the names of D.R. Horton. The company constructs and sells single-family detached homes; and attached homes, such as townhomes, duplexes, and triplexes. It provides mortgage financing services; and title insurance policies, and examination and closing services, as well as engages in the residential lot development business. In addition, the company develops, constructs, owns, leases, and sells multi-family and single-family rental properties; and owns non-residential real estate, including ranch land and improvements. It primarily serves homebuyers. D.R. Horton, Inc. was founded in 1978 and is headquartered in Arlington, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"14-01-2025 18:02:11"},{"Company Name":"Charles Schwab Corporation (The","Symbol":"SCHW","Current Price":"71.67","Latest MA":"70.47","Price Target":85.14286,"Difference from MA":"1.70%","Difference from Open":"-1.50%","Change from Yesterday":"-1.58%","Change from Last Report":"-0.04","Latest Volume":"1,448,199","Market Cap":"131,196,231,680","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":18.045532,"PB Ratio":3.4484913,"ROE":0.12111,"DTE":144.242,"Industry":"Capital Markets","Sector":"Financial Services","Beta":0.952,"Trailing PEG":0.9031,"Trailing PE":27.996094,"Trailing PS":7.0023603,"Quick Ratio":0.481,"Day High":72.97,"Day Low":71.61,"VS Average Volume":0.1820057037,"Company Summary":"The Charles Schwab Corporation, together with its subsidiaries, operates as a savings and loan holding company that provides wealth management, securities brokerage, banking, asset management, custody, and financial advisory services in the United States and internationally. The company operates in two segments, Investor Services and Advisor Services. It offers brokerage accounts with equity and fixed income trading, margin lending, options trading, futures and forex trading, and cash management capabilities, including certificates of deposit; third-party mutual funds through the Mutual Fund Marketplace and Mutual Fund OneSource service, as well as mutual fund trading and clearing services to broker-dealers; exchange-traded funds; advisory solutions for managed portfolios, separately managed accounts, customized personal advice for tailored portfolios, specialized planning, and full-time portfolio management; banking products comprising checking and savings accounts, first lien residential real estate mortgage loans, home equity lines of credit, and pledged asset lines; and trust custody services, personal trust reporting services, and administrative trustee services. It also provides digital retirement calculators; integrated web-, mobile-, and software-based trading platforms, real-time market data, options trading, premium research, and multi-channel access; self-service education and support tools; online research and analysis tools; equity compensation plan sponsors full-service recordkeeping for stock plans, stock options, restricted stock, performance shares, and stock appreciation rights; retirement plan services; mutual fund clearing services; and advisor services, including interactive tools and educational content. The Company operates through branch offices. The Charles Schwab Corporation was founded in 1971 and is headquartered in Westlake, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-01-2025 18:02:11"},{"Company Name":"Regions Financial Corporation","Symbol":"RF","Current Price":"24.01","Latest MA":"22.64","Price Target":27.57522,"Difference from MA":"6.05%","Difference from Open":"0.29%","Change from Yesterday":"1.42%","Change from Last Report":"0.04","Latest Volume":"1,522,595","Market Cap":"21,821,825,024","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":10.672486,"PB Ratio":1.2889891,"ROE":0.10042,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.182,"Trailing PEG":4.5441,"Trailing PE":13.564972,"Trailing PS":3.3285272,"Quick Ratio":"N\/A","Day High":24.035,"Day Low":23.83,"VS Average Volume":0.1885319779,"Company Summary":"Regions Financial Corporation, a financial holding company, provides banking and bank-related services to individual and corporate customers. It operates through three segments: Corporate Bank, Consumer Bank, and Wealth Management. The Corporate Bank segment offers commercial banking services, such as commercial and industrial, commercial real estate, and investor real estate lending; equipment lease financing; deposit products; and securities underwriting and placement, loan syndication and placement, foreign exchange, derivatives, merger and acquisition, and other advisory services. It serves corporate, middle market, and commercial real estate developers and investors. The Consumer Bank segment provides consumer banking products and services related to residential first mortgages, home equity lines and loans, consumer credit cards, and other consumer loans, as well as deposits. The Wealth Management segment offers credit related products, and retirement and savings solutions; and trust and investment management, asset management, and estate planning services to individuals, businesses, governmental institutions, and non-profit entities. It also provides investment and insurance products; low-income housing tax credit corporate fund syndication services; and other specialty financing services. The company was founded in 1971 and is headquartered in Birmingham, Alabama.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-01-2025 18:02:11"}]