[{"Company Name":"Abbott Laboratories","Symbol":"ABT","Current Price":"116.43","Latest MA":"111.34","Price Target":130.62125,"Difference from MA":"4.57%","Difference from Open":"2.02%","Change from Yesterday":"-0.31%","Change from Last Report":"-0.43","Latest Volume":"2,743,356","Market Cap":"201,943,187,456","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":22.585226,"PB Ratio":5.074529,"ROE":0.14840001,"DTE":37.589,"Industry":"Medical Devices","Sector":"Healthcare","Beta":0.722,"Trailing PEG":2.2634,"Trailing PE":35.389057,"Trailing PS":4.8995123,"Quick Ratio":0.996,"Day High":118.43,"Day Low":113.5,"VS Average Volume":0.5439283623,"Company Summary":"Abbott Laboratories, together with its subsidiaries, discovers, develops, manufactures, and sells health care products worldwide. It operates in four segments: Established Pharmaceutical Products, Diagnostic Products, Nutritional Products, and Medical Devices. The company provides generic pharmaceuticals for the treatment of pancreatic exocrine insufficiency, irritable bowel syndrome or biliary spasm, intrahepatic cholestasis or depressive symptoms, gynecological disorder, hormone replacement therapy, dyslipidemia, hypertension, hypothyroidism, Ménière's disease and vestibular vertigo, pain, fever, inflammation, and migraine, as well as provides anti-infective clarithromycin, influenza vaccine, and products to regulate physiological rhythm of the colon. It also offers laboratory and transfusion medicine systems in the areas of immunoassay, clinical chemistry, hematology, and transfusion; molecular diagnostics polymerase chain reaction instrument systems that automate the extraction, purification, and preparation of DNA and RNA from patient samples, and detect and measure infectious agents; point of care systems; cartridges for testing blood gas, chemistry, electrolytes, coagulation, and immunoassay; rapid diagnostics lateral flow testing products; molecular point-of-care testing for HIV, SARS-CoV-2, influenza A and B, RSV, and strep A; cardiometabolic test systems; drug and alcohol test, and remote patient monitoring and consumer self-test systems; and informatics and automation solutions for laboratories. In addition, the company provides pediatric and adult nutritional products; rhythm management, electrophysiology, heart failure, vascular, and structural heart devices for the treatment of cardiovascular diseases; diabetes care products, such as glucose and blood glucose monitoring systems; and neuromodulation devices for the management of chronic pain and movement disorders. Abbott Laboratories was founded in 1888 and is based in North Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"22-01-2025 16:53:51"},{"Company Name":"Halliburton Company","Symbol":"HAL","Current Price":"28.82","Latest MA":"30.20","Price Target":36.28519,"Difference from MA":"-4.58%","Difference from Open":"-0.62%","Change from Yesterday":"-2.40%","Change from Last Report":"0.03","Latest Volume":"3,127,795","Market Cap":"25,318,428,672","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.800054,"PB Ratio":2.4575765,"ROE":0.26293,"DTE":83.993,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.905,"Trailing PEG":2.3406,"Trailing PE":10.076923,"Trailing PS":1.0973185,"Quick Ratio":1.377,"Day High":29.17,"Day Low":28.17,"VS Average Volume":0.328534538,"Company Summary":"Halliburton Company provides products and services to the energy industry worldwide. It operates through two segments, Completion and Production, and Drilling and Evaluation. The Completion and Production segment offers production enhancement services that include stimulation and sand control services; cementing services, such as well bonding and casing, and casing equipment; and completion tools that offer downhole solutions and services, including well completion products and services, intelligent well completions, and service tools, as well as liner hanger, sand control, and multilateral systems. This segment also provides electrical submersible pumps, as well as artificial lift services; production solutions comprising coiled tubing, hydraulic workover units, downhole tools, and pumping and nitrogen services; pipeline and process services, such as pre-commissioning, commissioning, maintenance, and decommissioning; and specialty chemicals and services. The Drilling and Evaluation segment offers drilling fluid systems, performance additives, completion fluids, solids control, specialized testing equipment, and waste management services; drilling systems and services; wireline and perforating services consists of open-hole logging, and cased-hole and slickline; and drill bits and services comprising roller cone rock bits, fixed cutter bits, hole enlargement, and related downhole tools and services, as well as coring equipment and services. This segment also provides cloud based digital services and artificial intelligence solutions on an open architecture for subsurface insights, integrated well construction, and reservoir and production management; testing and subsea services, such as acquisition and analysis of reservoir information and optimization solutions; and project management and integrated asset management services. Halliburton Company was founded in 1919 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"22-01-2025 16:53:51"},{"Company Name":"Johnson & Johnson","Symbol":"JNJ","Current Price":"143.00","Latest MA":"154.14","Price Target":171.29272,"Difference from MA":"-7.23%","Difference from Open":"-0.69%","Change from Yesterday":"-3.51%","Change from Last Report":"0.22","Latest Volume":"3,161,030","Market Cap":"344,301,731,840","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":12.78096,"PB Ratio":4.906842,"ROE":0.20889,"DTE":50.958,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.518,"Trailing PEG":0.8647,"Trailing PE":23.676325,"Trailing PS":3.9260826,"Quick Ratio":0.705,"Day High":144.61,"Day Low":142.11,"VS Average Volume":0.394722679,"Company Summary":"Johnson & Johnson, together with its subsidiaries, researches, develops, manufactures, and sells various products in the healthcare field worldwide. The company's Innovative Medicine segment offers products for various therapeutic areas, such as immunology, including rheumatoid arthritis, psoriatic arthritis, inflammatory bowel disease, and psoriasis; infectious diseases comprising HIV\/AIDS; neuroscience, consisting of mood disorders, neurodegenerative disorders, and schizophrenia; oncology, such as prostate cancer, hematologic malignancies, lung cancer, and bladder cancer; cardiovascular and metabolism, including thrombosis, diabetes, and macular degeneration; and pulmonary hypertension comprising pulmonary arterial hypertension through retailers, wholesalers, distributors, hospitals, and healthcare professionals for prescription use. Its MedTech segment provides Interventional Solutions, including electrophysiology products to treat heart rhythm disorders; the heart recovery portfolio, which includes technologies to treat severe coronary artery disease requiring high-risk PCI or AMI cardiogenic shock; and neurovascular care that treats hemorrhagic and ischemic stroke. this segment also offers an orthopaedics portfolio that includes products and enabling technologies that support hips, knees, trauma, spine, sports, and other; surgery portfolios comprising advanced and general surgery technologies, as well as solutions for breast aesthetics, ear, nose, and throat procedures; contact lenses under the ACUVUE Brand; and TECNIS intraocular lenses for cataract surgery. It distributes its products to wholesalers, hospitals, and retailers, as well as physicians, nurses, hospitals, eye care professionals, and clinics. The company has a collaboration agreement with Stand Up To Cancer for research testing a combination of teclistamab and daratumumab to treat a rare disease AL amyloidosis. Johnson & Johnson was founded in 1886 and is based in New Brunswick, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"22-01-2025 16:53:51"},{"Company Name":"Ally Financial Inc.","Symbol":"ALLY","Current Price":"40.97","Latest MA":"37.85","Price Target":42.6875,"Difference from MA":"8.24%","Difference from Open":"-1.00%","Change from Yesterday":"7.14%","Change from Last Report":"-0.40","Latest Volume":"1,805,196","Market Cap":"12,482,650,112","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":7.1526346,"PB Ratio":1.0065852,"ROE":0.06425,"DTE":"N\/A","Industry":"Credit Services","Sector":"Financial Services","Beta":1.389,"Trailing PEG":0.585,"Trailing PE":16.386,"Trailing PS":1.8454539,"Quick Ratio":"N\/A","Day High":41.49,"Day Low":40.3,"VS Average Volume":0.5990599927,"Company Summary":"Ally Financial Inc., a digital financial-services company, provides various digital financial products and services in the United States, Canada, and Bermuda. The company operates through Automotive Finance Operations, Insurance Operations, Mortgage Finance Operations, and Corporate Finance Operations segments. The Automotive Finance Operations segment offers automotive financing services, including providing retail installment sales contracts, loans and operating leases, term loans to dealers, financing dealer floorplans and other lines of credit to dealers, warehouse lines to automotive retailers, and fleet financing. It also provides financing services to companies and municipalities for the purchase or lease of vehicles, and vehicle-remarketing services. The Insurance Operations segment offers consumer finance protection and insurance products through the automotive dealer channel, and commercial insurance products directly to dealers. This segment provides vehicle service and maintenance contract, and guaranteed asset protection products; and underwrites commercial insurance coverages, which primarily insure dealers' vehicle inventory. The Mortgage Finance Operations segment manages consumer mortgage loan portfolio that includes bulk purchases of jumbo and low-to-moderate income mortgage loans originated by third parties, as well as direct-to-consumer mortgage offerings. The Corporate Finance Operations segment provides senior secured leveraged cash flow and asset-based loans to middle market companies; leveraged loans; and commercial real estate product to serve companies in the nursing facilities, senior housing, and medical office buildings. It also offers commercial banking products and services. In addition, it provides securities brokerage and investment advisory services. The company was formerly known as GMAC Inc. and changed its name to Ally Financial Inc. in May 2010. Ally Financial Inc. was founded in 1919 and is based in Detroit, Michigan.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"22-01-2025 16:53:51"},{"Company Name":"Lam Research Corporation","Symbol":"LRCX","Current Price":"84.02","Latest MA":"82.17","Price Target":90.85239,"Difference from MA":"2.25%","Difference from Open":"1.94%","Change from Yesterday":"3.11%","Change from Last Report":"3.09","Latest Volume":"1,098,448","Market Cap":"108,107,694,080","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.583399,"PB Ratio":12.813786,"ROE":0.49116,"DTE":58.827,"Industry":"Semiconductor Equipment & Materials","Sector":"Technology","Beta":1.486,"Trailing PEG":1.5666,"Trailing PE":27.190939,"Trailing PS":6.9338474,"Quick Ratio":1.685,"Day High":84.12,"Day Low":82.42,"VS Average Volume":0.0943861755,"Company Summary":"Lam Research Corporation designs, manufactures, markets, refurbishes, and services semiconductor processing equipment used in the fabrication of integrated circuits. The company offers ALTUS systems to deposit conformal films for tungsten metallization applications; SABRE electrochemical deposition products for copper interconnect transition that offers copper damascene manufacturing; and VECTOR plasma-enhanced CVD products. It also provides SPEED gapfill high-density plasma chemical vapor deposition products; and Striker single-wafer atomic layer deposition products for dielectric film solutions. In addition, the company offers Flex for dielectric etch applications; Vantex, a dielectric etch system that provides RF technology and repeatable wafer-to-wafer performance enabled by Equipment Intelligence solutions; Kiyo for conductor etch applications; Syndion for through-silicon via etch applications; and Versys metal products for metal etch processes. Further, it provides Coronus bevel clean products to enhance die yield; and Da Vinci, DV-Prime, EOS, and SP series products to address various wafer cleaning applications. The company sells its products in the United States, China, Europe, Japan, Korea, Southeast Asia, and Taiwan. Lam Research Corporation was incorporated in 1980 and is headquartered in Fremont, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"22-01-2025 16:53:51"},{"Company Name":"Kinder Morgan, Inc.","Symbol":"KMI","Current Price":"30.99","Latest MA":"23.61","Price Target":28.585,"Difference from MA":"31.26%","Difference from Open":"-1.46%","Change from Yesterday":"-0.74%","Change from Last Report":"-0.05","Latest Volume":"2,800,560","Market Cap":"68,848,623,616","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":24.345215,"PB Ratio":2.2643578,"ROE":0.083500005,"DTE":101.433,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.907,"Trailing PEG":2.286,"Trailing PE":27.424778,"Trailing PS":4.5441637,"Quick Ratio":0.291,"Day High":31.46,"Day Low":30.78,"VS Average Volume":0.209316097,"Company Summary":"Kinder Morgan, Inc. operates as an energy infrastructure company primarily in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas gasification, liquefaction, and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and\/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, renewable fuel and feedstocks, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; owns interests in\/or operates oil fields and gasoline processing plants; and operates a crude oil pipeline system in West Texas, as well as owns and operates RNG and LNG facilities. It owns and operates approximately 82,000 miles of pipelines and 139 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1997 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"22-01-2025 16:53:51"},{"Company Name":"Procter & Gamble Company (The)","Symbol":"PG","Current Price":"165.88","Latest MA":"168.43","Price Target":179.49692,"Difference from MA":"-1.52%","Difference from Open":"-0.73%","Change from Yesterday":"2.57%","Change from Last Report":"0.25","Latest Volume":"2,626,276","Market Cap":"390,642,270,208","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":22.509686,"PB Ratio":7.6524725,"ROE":0.28766,"DTE":69.338,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":0.414,"Trailing PEG":3.4219,"Trailing PE":28.549913,"Trailing PS":4.6557684,"Quick Ratio":0.507,"Day High":168.14,"Day Low":165.39,"VS Average Volume":0.3829230757,"Company Summary":"The Procter & Gamble Company engages in the provision of branded consumer packaged goods worldwide. The company operates through five segments: Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care. The Beauty segment offers conditioners, shampoos, styling aids, and treatments under the Head & Shoulders, Herbal Essences, Pantene, and Rejoice brands; and antiperspirants and deodorants, personal cleansing, and skin care products under the Olay, Old Spice, Safeguard, Secret, SK-II, and Native brands. The Grooming segment provides blades and razors, shave products, appliances, and other grooming products under the Braun, Gillette, and Venus brand names. The Health Care segment offers toothbrushes, toothpastes, and other oral care products under the Crest and Oral-B brand names; and gastrointestinal, pain relief, rapid diagnostics, respiratory, vitamins\/minerals\/supplements, and other personal health care products under Metamucil, Neurobion, Pepto-Bismol, and Vicks brands. The Fabric & Home Care segment provides fabric enhancers, laundry additives, and laundry detergents under the Ariel, Downy, Gain, and Tide brands; and air care, dish care, P&G professional, and surface care products under the Cascade, Dawn, Fairy, Febreze, Mr. Clean, and Swiffer brands. The Baby, Feminine & Family Care segment offers baby wipes, and taped diapers and pants under the Luvs and Pampers brands; adult incontinence and feminine care products under the Always, Always Discreet, and Tampax brands; and paper towels, tissues, and toilet papers under the Bounty, Charmin, and Puffs brands. It sells its products primarily through mass merchandisers, e-commerce, grocery stores, membership club stores, drug stores, department stores, distributors, wholesalers, specialty beauty stores, high-frequency stores, pharmacies, electronics stores, and professional channels, as well as directly to consumers. The company was founded in 1837 and is headquartered in Cincinnati, Ohio.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"22-01-2025 16:53:51"},{"Company Name":"New Oriental Education & Techno","Symbol":"EDU","Current Price":"45.37","Latest MA":"65.90","Price Target":73.57743,"Difference from MA":"-31.16%","Difference from Open":"-1.14%","Change from Yesterday":"-2.88%","Change from Last Report":"-2.88","Latest Volume":"1,062,613","Market Cap":"9,532,502,016","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":11.392775,"PB Ratio":1.9793621,"ROE":0.09543,"DTE":16.761,"Industry":"Education & Training Services","Sector":"Consumer Defensive","Beta":0.487,"Trailing PEG":0.7727,"Trailing PE":19.723915,"Trailing PS":2.0504498,"Quick Ratio":1.634,"Day High":46.015,"Day Low":44.535,"VS Average Volume":0.6235753918,"Company Summary":"New Oriental Education & Technology Group Inc. provides private educational services under the New Oriental brand in the People's Republic of China. The company operates through four segments: Educational Services and Test Preparation Courses; Online Education and Other Services; Overseas Study Consulting Services; and Educational Materials and Distribution. It offers test preparation courses to students taking language and entrance exams used by educational institutions in the United States, the Commonwealth countries, and the People's Republic of China. The company also provides non-academic tutoring courses; intelligent learning systems and devices to offer a digital learning experience for students; and overseas studies consulting services. In addition, it offers online education services through the Koolearn.com platform. Further, the company develops and edits educational materials for language training and test preparation. In addition, it offers educational programs, services, and products to students through schools; learning centers; and bookstores, as well as through its online learning platforms. The company was founded in 1993 and is headquartered in Beijing, the People's Republic of China.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"22-01-2025 16:53:51"},{"Company Name":"GE Vernova Inc.","Symbol":"GEV","Current Price":"425.62","Latest MA":"258.64","Price Target":375.87207,"Difference from MA":"64.56%","Difference from Open":"-1.02%","Change from Yesterday":"2.37%","Change from Last Report":"0.41","Latest Volume":"1,287,805","Market Cap":"117,323,423,744","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":40.169315,"PB Ratio":12.333594,"ROE":"N\/A","DTE":9.346,"Industry":"Utilities - Renewable","Sector":"Utilities","Beta":"N\/A","Trailing PEG":3.6055,"Trailing PE":100.38208,"Trailing PS":3.4083848,"Quick Ratio":0.717,"Day High":434.1,"Day Low":418.1,"VS Average Volume":0.4498911958,"Company Summary":"GE Vernova Inc., an energy company, engages in the provision of various products and services that generate, transfer, orchestrate, convert, and store electricity in the United States, Europe, Asia, the Americas, the Middle East, and Africa. The company operates through three segments: Power, Wind, and Electrification. The Power segment designs, manufactures, and services gas, nuclear, hydro, and steam technologies. The Wind segment offers wind generation technologies, including onshore and offshore wind turbines and blades. The Electrification segment provides grid solutions, power conversion, solar, and storage solutions; and electrification software for the transmission, distribution, conversion, storage, and orchestration of electricity from point of generation to point of consumption. The company was incorporated in 2023 and is headquartered in Cambridge, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"22-01-2025 16:53:51"},{"Company Name":"Amphenol Corporation","Symbol":"APH","Current Price":"76.89","Latest MA":"67.57","Price Target":77.91529,"Difference from MA":"13.80%","Difference from Open":"1.64%","Change from Yesterday":"5.75%","Change from Last Report":"0.73","Latest Volume":"2,790,152","Market Cap":"92,699,353,088","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":32.044178,"PB Ratio":9.804896,"ROE":0.25293,"DTE":57.565,"Industry":"Electronic Components","Sector":"Technology","Beta":1.238,"Trailing PEG":2.2556,"Trailing PE":43.93714,"Trailing PS":6.5132623,"Quick Ratio":1.208,"Day High":76.91,"Day Low":73.2204,"VS Average Volume":0.4332822792,"Company Summary":"Amphenol Corporation, together with its subsidiaries, primarily designs, manufactures, and markets electrical, electronic, and fiber optic connectors in the United States, China, and internationally. It operates through three segments: Harsh Environment Solutions, Communications Solutions, and Interconnect and Sensor Systems. The company offers connectors and connector systems, including harsh environment data, power, high-speed, fiber optic, and radio frequency interconnect products; busbars and power distribution systems; and other connectors. It also provides value-add products, such as backplane interconnect systems, cable assemblies and harnesses, and cable management products; other products comprising flexible and rigid printed circuit boards, hinges, other mechanical, and production related products. In addition, the company offers consumer device, network infrastructure, and other antennas; coaxial, power, and specialty cables; and sensors and sensor-based products. It sells its products through its sales force, independent representatives, and a network of electronics distributors to original equipment manufacturers, electronic manufacturing services companies, original design manufacturers, and service providers in the automotive, broadband communication, commercial aerospace, industrial, information technology and data communication, military, mobile device, and mobile network markets. Amphenol Corporation was founded in 1932 and is headquartered in Wallingford, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"22-01-2025 16:53:51"},{"Company Name":"United Airlines Holdings, Inc.","Symbol":"UAL","Current Price":"113.66","Latest MA":"67.80","Price Target":123.48261,"Difference from MA":"67.65%","Difference from Open":"-1.42%","Change from Yesterday":"2.90%","Change from Last Report":"0.60","Latest Volume":"3,512,704","Market Cap":"37,380,931,584","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.9335775,"PB Ratio":3.2681417,"ROE":0.27245,"DTE":291.676,"Industry":"Airlines","Sector":"Industrials","Beta":1.393,"Trailing PEG":0.8778,"Trailing PE":12.027799,"Trailing PS":0.6675882,"Quick Ratio":0.694,"Day High":115.8,"Day Low":110.9,"VS Average Volume":0.6217188426,"Company Summary":"United Airlines Holdings, Inc., through its subsidiaries, provides air transportation services in North America, Asia, Europe, Africa, the Pacific, the Middle East, and Latin America. The company transports people and cargo through its mainline and regional fleets. It also offers catering, ground handling, flight academy, and maintenance services for third parties. The company was formerly known as United Continental Holdings, Inc. and changed its name to United Airlines Holdings, Inc. in June 2019. United Airlines Holdings, Inc. was incorporated in 1968 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"22-01-2025 16:53:51"},{"Company Name":"Netflix, Inc.","Symbol":"NFLX","Current Price":"984.88","Latest MA":"752.64","Price Target":986.1922,"Difference from MA":"30.86%","Difference from Open":"-1.28%","Change from Yesterday":"13.15%","Change from Last Report":"-0.09","Latest Volume":"4,322,453","Market Cap":"420,994,809,856","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":33.10136,"PB Ratio":18.529152,"ROE":0.34714,"DTE":81.461,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.25,"Trailing PEG":1.7805,"Trailing PE":49.666164,"Trailing PS":11.2004595,"Quick Ratio":0.975,"Day High":999.0,"Day Low":966.51,"VS Average Volume":1.3869873025,"Company Summary":"Netflix, Inc. provides entertainment services. It offers TV series, documentaries, feature films, and games across various genres and languages. The company also provides members the ability to receive streaming content through a host of internet-connected devices, including TVs, digital video players, TV set-top boxes, and mobile devices. It has operations in approximately 190 countries. The company was incorporated in 1997 and is headquartered in Los Gatos, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"22-01-2025 16:53:51"},{"Company Name":"KeyCorp","Symbol":"KEY","Current Price":"17.47","Latest MA":"16.56","Price Target":21.015,"Difference from MA":"5.49%","Difference from Open":"-0.17%","Change from Yesterday":"-0.94%","Change from Last Report":"-0.96","Latest Volume":"1,075,488","Market Cap":"19,335,620,608","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":9.99245,"PB Ratio":1.206575,"ROE":0.0096700005,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.231,"Trailing PEG":0.7312,"Trailing PE":"N\/A","Trailing PS":3.9850829,"Quick Ratio":"N\/A","Day High":17.57,"Day Low":17.225,"VS Average Volume":0.1052663003,"Company Summary":"KeyCorp operates as the holding company for KeyBank National Association that provides various retail and commercial banking products and services in the United States. It operates in two segments, Consumer Bank and Commercial Bank. The company offers various deposits, investment products and services; commercial leasing, investment management, consumer finance; and personal finance and financial wellness, student loan refinancing, mortgage and home equity, lending, credit card, treasury, business advisory, wealth management, asset management, cash management, portfolio management, and trust and related services to individuals and small and medium-sized businesses. It also provides a suite of banking and capital market products, such as syndicated finance, debt and equity capital market products, commercial payments, equipment finance, commercial mortgage banking, derivatives, foreign exchange, financial advisory, and public finance, as well as commercial mortgage loans to consumer, energy, healthcare, industrial, public sector, real estate, and technology sectors for middle market clients. In addition, the company offers community development financing, securities underwriting, brokerage, and investment banking services. The company was founded in 1849 and is headquartered in Cleveland, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"22-01-2025 16:53:51"},{"Company Name":"Seagate Technology Holdings PLC","Symbol":"STX","Current Price":"109.85","Latest MA":"99.94","Price Target":116.75286,"Difference from MA":"9.92%","Difference from Open":"1.31%","Change from Yesterday":"8.42%","Change from Last Report":"-0.49","Latest Volume":"2,638,939","Market Cap":"23,236,571,136","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":11.225976,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Computer Hardware","Sector":"Technology","Beta":1.07,"Trailing PEG":0.3212,"Trailing PE":28.385014,"Trailing PS":3.198427,"Quick Ratio":0.63,"Day High":110.83,"Day Low":105.86,"VS Average Volume":0.9638921103,"Company Summary":"Seagate Technology Holdings plc engages in the provision of data storage technology and infrastructure solutions in Singapore, the United States, the Netherlands, and internationally. The company offers mass capacity storage products, including enterprise nearline hard disk drives (HDDs), enterprise nearline solid state drives (SSDs), enterprise nearline systems, video and image HDDs, and network-attached storage drives. It also offers legacy applications comprising Mission Critical HDDs and SSDs; external storage solutions under the Seagate Ultra Touch, One Touch, Expansion, and Basics product lines, as well as under the LaCie brand name; desktop drives for personal computers and workstation applications; notebook drives traditional notebooks, convertible systems, and external storage applications, DVR HDDs for video streaming applications, and gaming SSDs for gaming rigs. In addition, the company provides Lyve edge-to-cloud mass capacity platform, that includes modular hardware and software to support enterprises' on-premise and cloud storage infrastructure needs. It sells its products primarily to original equipment manufacturers, distributors, and retailers. The company was founded in 1978 and is based in Singapore.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"22-01-2025 16:53:51"},{"Company Name":"3M Company","Symbol":"MMM","Current Price":"150.61","Latest MA":"125.49","Price Target":151.79333,"Difference from MA":"20.02%","Difference from Open":"1.85%","Change from Yesterday":"2.53%","Change from Last Report":"-0.30","Latest Volume":"1,860,237","Market Cap":"81,249,583,104","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":17.677729,"PB Ratio":17.668934,"ROE":1.1329399,"DTE":295.441,"Industry":"Conglomerates","Sector":"Industrials","Beta":1.001,"Trailing PEG":null,"Trailing PE":20.745178,"Trailing PS":2.4894168,"Quick Ratio":0.95,"Day High":152.08,"Day Low":147.44,"VS Average Volume":0.5326402448,"Company Summary":"3M Company provides diversified technology services in the United States and internationally. The company's Safety and Industrial segment offers industrial abrasives and finishing for metalworking applications; autobody repair solutions; closure systems for personal hygiene products, masking, and packaging materials; electrical products and materials for construction and maintenance, power distribution, and electrical original equipment manufacturers; structural adhesives and tapes; respiratory, hearing, eye, and fall protection solutions; and natural and color-coated mineral granules for shingles. Its Transportation and Electronics segment provides ceramic solutions; attachment\/bonding products, films, sound, and temperature management for transportation vehicles; premium large format graphic films for advertising and fleet signage; light management films and electronics assembly solutions; packaging and interconnection solutions; semiconductor production materials; data centers solutions; and reflective signage for highway, and vehicle safety. The company's Consumer segment provides consumer bandages, braces, supports, and consumer respirators; home cleaning products; retail abrasives, paint accessories, car care DIY products, picture hanging, and consumer air quality solutions; and stationery products. It offers its products through e-commerce and traditional wholesalers, retailers, jobbers, distributors, and dealers. 3M Company was founded in 1902 and is headquartered in Saint Paul, Minnesota.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"22-01-2025 16:53:51"},{"Company Name":"Schlumberger N.V.","Symbol":"SLB","Current Price":"42.65","Latest MA":"42.84","Price Target":53.5429,"Difference from MA":"-0.44%","Difference from Open":"-1.68%","Change from Yesterday":"-2.49%","Change from Last Report":"-0.21","Latest Volume":"2,312,326","Market Cap":"59,752,648,704","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":11.26492,"PB Ratio":2.7998426,"ROE":0.21722999,"DTE":57.141,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.532,"Trailing PEG":1.9499,"Trailing PE":13.713827,"Trailing PS":1.6600263,"Quick Ratio":1.003,"Day High":43.45,"Day Low":42.5,"VS Average Volume":0.1853620238,"Company Summary":"Schlumberger Limited engages in the provision of technology for the energy industry worldwide. The company operates through four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company provides field development and hydrocarbon production, carbon management, and integration of adjacent energy systems; reservoir interpretation and data processing services for exploration data; and well construction and production improvement services and products. It also offers subsurface geology and fluids evaluation information; open and cased hole services; exploration and production pressure, and flow-rate measurement services; and pressure pumping, well stimulation, and coiled tubing equipment solutions. In addition, the company offers mud logging, directional drilling, measurement-while-drilling, and logging-while-drilling services, as well as engineering support services; supplies drilling fluid systems; designs, manufactures, and markets roller cone and fixed cutter drill bits; bottom-hole-assembly and borehole enlargement technologies; well cementing products and services; well planning, well drilling, engineering, supervision, logistics, procurement, and contracting of third parties, as well as drilling rig management solutions; and drilling equipment and services, as well as land drilling rigs and related services. Further, it provides artificial lift production equipment and optimization services; supplies packers, safety valves, sand control technology, and various intelligent well completions technology and equipment; designs and manufactures valves, chokes, actuators, and surface trees; and OneSubsea, an integrated solutions, products, systems, and services, including wellheads, subsea trees, manifolds and flowline connectors, control systems, connectors, and services. The company was formerly known as Socie´te´ de Prospection E´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"22-01-2025 16:53:51"},{"Company Name":"Huntington Bancshares Incorpora","Symbol":"HBAN","Current Price":"16.93","Latest MA":"15.10","Price Target":18.69526,"Difference from MA":"12.17%","Difference from Open":"-0.38%","Change from Yesterday":"-0.96%","Change from Last Report":"-0.96","Latest Volume":"1,000,251","Market Cap":"24,617,392,128","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":10.922423,"PB Ratio":1.3509094,"ROE":0.08545,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.057,"Trailing PEG":2.8911,"Trailing PE":13.881146,"Trailing PS":3.67973,"Quick Ratio":"N\/A","Day High":17.1,"Day Low":16.91,"VS Average Volume":0.0669154494,"Company Summary":"Huntington Bancshares Incorporated operates as the bank holding company for The Huntington National Bank that provides commercial, consumer, and mortgage banking services in the United States. The company offers financial products and services to consumer and business customers, including deposits, lending, payments, mortgage banking, dealer financing, investment management, trust, brokerage, insurance, and other financial products and services. It also provides 24-hour grace, asterisk-free checking, money scout, $50 safety zone, standby cash, early pay, instant access, savings goal getter, and Huntington heads up; digitally powered consumer and business financial solutions to consumer lending, regional banking, branch banking, and wealth management customers; direct and indirect consumer loans, as well as dealer finance loans and deposits; and private banking, wealth management and legacy planning through investment and portfolio management, fiduciary administration and trust, institutional custody, and full-service retail brokerage investment services. The company offers equipment financing, asset-based lending, distribution finance, structured lending, and municipal financing solutions, as well as Huntington ChoicePay. In addition, it offers lending, liquidity, treasury management and other payment services, and capital markets; government and non-profits, healthcare, technology and telecommunications, franchises, financial sponsors, and global services; and corporate risk management, institutional sales and trading, debt and equity issuance, and additional advisory services. The company offers its products through a network of channels, including branches and ATMs, online and mobile banking, and through customer call centers to customers in middle market banking, corporate, specialty, and government banking, asset finance, commercial real estate banking, and capital markets. The company was founded in 1866 and is headquartered in Columbus, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"22-01-2025 16:53:51"},{"Company Name":"Morgan Stanley","Symbol":"MS","Current Price":"138.03","Latest MA":"111.88","Price Target":135.16667,"Difference from MA":"23.37%","Difference from Open":"0.56%","Change from Yesterday":"0.53%","Change from Last Report":"-0.22","Latest Volume":"1,174,815","Market Cap":"221,813,407,744","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":14.681771,"PB Ratio":2.369768,"ROE":0.11079001,"DTE":405.772,"Industry":"Capital Markets","Sector":"Financial Services","Beta":1.336,"Trailing PEG":3.8429,"Trailing PE":17.362202,"Trailing PS":3.8058648,"Quick Ratio":1.83,"Day High":138.38,"Day Low":136.51,"VS Average Volume":0.1735387765,"Company Summary":"Morgan Stanley, a financial holding company, provides various financial products and services to corporations, governments, financial institutions, and individuals in the Americas, Europe, the Middle East, Africa, and Asia. It operates through Institutional Securities, Wealth Management, and Investment Management segments. The Institutional Securities segment offers capital raising and financial advisory services, including services related to the underwriting of debt, equity, and other securities, as well as advice on mergers and acquisitions, restructurings, real estate, and project finance. This segment also provides equity and fixed income products comprising sales, financing, prime brokerage, and market-making services; foreign exchange and commodities; corporate and commercial real estate loans, commercial mortgage and secured lending facilities, and financing for sales and trading customers, and asset-backed and mortgage lending; and wealth management services, investment, and research services. The Wealth Management segment offers financial advisor-led brokerage, custody, administrative, and investment advisory services; self-directed brokerage services; financial and wealth planning services; workplace services, including stock plan administration; annuity and insurance products; securities-based lending, residential real estate loans, and other lending products; banking; and retirement plan services to individual investors and small to medium-sized businesses and institutions. The Investment Management segment provides equity, fixed income, alternatives and solutions, and liquidity and overlay services to benefit\/defined contribution plans, foundations, endowments, government entities, sovereign wealth funds, insurance companies, third-party fund sponsors, corporations, and individuals through institutional and intermediary channels. The company was founded in 1924 and is headquartered in New York, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"22-01-2025 16:53:51"},{"Company Name":"Citigroup, Inc.","Symbol":"C","Current Price":"81.54","Latest MA":"64.85","Price Target":88.8355,"Difference from MA":"25.74%","Difference from Open":"0.09%","Change from Yesterday":"-0.17%","Change from Last Report":"0.14","Latest Volume":"1,415,674","Market Cap":"153,058,738,176","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.816642,"PB Ratio":0.80014133,"ROE":0.03874,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.426,"Trailing PEG":0.9009,"Trailing PE":13.704203,"Trailing PS":2.208385,"Quick Ratio":"N\/A","Day High":81.626,"Day Low":81.23,"VS Average Volume":0.0975744814,"Company Summary":"Citigroup Inc., a diversified financial service holding company, provides various financial product and services to consumers, corporations, governments, and institutions worldwide. It operates through five segments: Services, Markets, Banking, U.S. Personal Banking, and Wealth. The Services segment includes Treasury and Trade Solutions, which provides cash management, trade, and working capital solutions to multinational corporations, financial institutions, and public sector organizations; and Securities Services, such as cross-border support for clients, local market expertise, post-trade technologies, data solutions, and various securities services solutions. The Markets segment offers sales and trading services for equities, foreign exchange, rates, spread products, and commodities to corporate, institutional, and public sector clients; and market-making services, including asset classes, risk management solutions, financing, prime brokerage, research, securities clearing, and settlement. The banking segment includes investment banking; advisory services related to mergers and acquisitions, divestitures, restructurings, and corporate defense activities; and corporate lending, which includes corporate and commercial banking. The U.S. Personal Banking segment provides co-branded cards and retail banking services. The Wealth segment provides financial services to high-net-worth clients through banking, lending, mortgages, investment, custody, and trust product offerings; and to professional industries, including law firms, consulting groups, accounting, and asset management. The company was founded in 1812 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"22-01-2025 16:53:51"},{"Company Name":"Wells Fargo & Company","Symbol":"WFC","Current Price":"77.11","Latest MA":"62.77","Price Target":82.52381,"Difference from MA":"22.84%","Difference from Open":"-0.59%","Change from Yesterday":"-0.95%","Change from Last Report":"-0.03","Latest Volume":"1,327,030","Market Cap":"253,610,164,224","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":11.273309,"PB Ratio":1.5667033,"ROE":0.099139996,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.136,"Trailing PEG":3.5144,"Trailing PE":14.359405,"Trailing PS":3.2566311,"Quick Ratio":"N\/A","Day High":77.81,"Day Low":76.88,"VS Average Volume":0.077760114,"Company Summary":"Wells Fargo & Company, a financial services company, provides diversified banking, investment, mortgage, and consumer and commercial finance products and services in the United States and internationally. The company operates through four segments: Consumer Banking and Lending; Commercial Banking; Corporate and Investment Banking; and Wealth and Investment Management. The Consumer Banking and Lending segment offers diversified financial products and services for consumers and small businesses. Its financial products and services include checking and savings accounts, and credit and debit cards, as well as home, auto, personal, and small business lending services. The Commercial Banking segment provides financial solutions to private, family owned, and certain public companies. Its products and services include banking and credit products across various industry sectors and municipalities, secured lending and lease products, and treasury management services. The Corporate and Investment Banking segment offers a suite of capital markets, banking, and financial products and services, such as corporate banking, investment banking, treasury management, commercial real estate lending and servicing, equity, and fixed income solutions, as well as sales, trading, and research capabilities services to corporate, commercial real estate, government, and institutional clients. The Wealth and Investment Management segment provides personalized wealth management, brokerage, financial planning, lending, private banking, and trust and fiduciary products and services to affluent, high-net worth, and ultra-high-net worth clients. It also operates through financial advisors in brokerage and wealth offices, consumer bank branches, independent offices, and digitally through WellsTrade and Intuitive Investor. The company was founded in 1852 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"22-01-2025 16:53:51"},{"Company Name":"Bank of America Corporation","Symbol":"BAC","Current Price":"46.30","Latest MA":"41.94","Price Target":51.92857,"Difference from MA":"10.41%","Difference from Open":"-0.63%","Change from Yesterday":"-0.75%","Change from Last Report":"0.02","Latest Volume":"3,554,625","Market Cap":"352,420,888,576","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.690712,"PB Ratio":1.3091234,"ROE":0.08092,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.325,"Trailing PEG":2.0673,"Trailing PE":14.425234,"Trailing PS":3.724356,"Quick Ratio":"N\/A","Day High":46.73,"Day Low":46.225,"VS Average Volume":0.1011524255,"Company Summary":"Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. It operates in four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, non-interest and interest-bearing checking accounts, and investment accounts and products; credit and debit cards; residential mortgages, and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research, and certain market-based services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"22-01-2025 16:53:51"},{"Company Name":"Walgreens Boots Alliance, Inc.","Symbol":"WBA","Current Price":"11.15","Latest MA":"9.91","Price Target":12.414,"Difference from MA":"12.61%","Difference from Open":"-0.80%","Change from Yesterday":"-1.76%","Change from Last Report":"-1.36","Latest Volume":"2,452,095","Market Cap":"9,639,626,752","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":6.9565268,"PB Ratio":0.9227397,"ROE":-0.75969005,"DTE":277.898,"Industry":"Pharmaceutical Retailers","Sector":"Healthcare","Beta":0.669,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.06528347,"Quick Ratio":0.332,"Day High":11.395,"Day Low":11.15,"VS Average Volume":0.1015076615,"Company Summary":"Walgreens Boots Alliance, Inc. operates as a healthcare, pharmacy, and retail company in the United States, Germany, the United Kingdom, and internationally. It operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The U.S. Retail Pharmacy segment engages in operation of the retail drugstores, health and wellness services, specialty, and home delivery pharmacy services, which offers health and wellness, beauty, personal care and consumables, and general merchandise. The International segment offers sale of prescription drugs and health and wellness, beauty, personal care, and other consumer products outside the United States; and operates pharmacy-led health and beauty retail businesses under the Boots brand stores in the United Kingdom, the Republic of Ireland, and Thailand, as well as the Benavides brand in Mexico and the Ahumada brand in Chile. The U.S. Healthcare segment provides VillageMD, a national provider of value-based care with primary, multi-specialty, and urgent care providers serving patients in traditional clinic settings, in patients' homes and online appointments; Shields, a specialty pharmacy integrator and accelerator for hospitals; and CareCentrix, a participant in the post-acute and home care management sectors. Walgreens Boots Alliance, Inc. was founded in 1909 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"22-01-2025 16:53:51"},{"Company Name":"Delta Air Lines, Inc.","Symbol":"DAL","Current Price":"69.25","Latest MA":"52.18","Price Target":79.92864,"Difference from MA":"32.71%","Difference from Open":"-0.75%","Change from Yesterday":"1.27%","Change from Last Report":"-0.09","Latest Volume":"1,761,509","Market Cap":"44,685,709,312","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.203422,"PB Ratio":3.253465,"ROE":0.4067,"DTE":186.78,"Industry":"Airlines","Sector":"Industrials","Beta":1.341,"Trailing PEG":null,"Trailing PE":12.992496,"Trailing PS":0.7409705,"Quick Ratio":0.268,"Day High":69.98,"Day Low":68.79,"VS Average Volume":0.2181189218,"Company Summary":"Delta Air Lines, Inc. provides scheduled air transportation for passengers and cargo in the United States and internationally. The company operates through two segments, Airline and Refinery. Its domestic network centered on core hubs in Atlanta, Minneapolis-St. Paul, Detroit, and Salt Lake City, as well as coastal hub positions in Boston, Los Angeles, New York-LaGuardia, New York-JFK, and Seattle; and international network centered on hubs and market presence in Amsterdam, Bogota, Lima, Mexico City, London-Heathrow, Paris-Charles de Gaulle, Sao Paulo, Seoul-Incheon, and Tokyo. The company sells its tickets through various distribution channels, including delta.com and the Fly Delta app; acts as a reservations specialists; and operates online travel and traditional brick and mortar agencies. It also provides aircraft maintenance and engineering support, repair, and overhaul services; and vacation packages to third-party consumers. The company operates through a fleet of approximately 1,273 aircrafts. Delta Air Lines, Inc. was founded in 1924 and is based in Atlanta, Georgia.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"22-01-2025 16:53:51"},{"Company Name":"SoFi Technologies, Inc.","Symbol":"SOFI","Current Price":"17.83","Latest MA":"10.37","Price Target":12.6,"Difference from MA":"71.97%","Difference from Open":"-1.23%","Change from Yesterday":"-0.45%","Change from Last Report":"0.05","Latest Volume":"10,034,318","Market Cap":"19,346,704,384","Earning Date":"2025-01-27","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":72.76979,"PB Ratio":3.15774,"ROE":0.037249997,"DTE":54.394,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.613,"Trailing PEG":null,"Trailing PE":148.57167,"Trailing PS":7.679668,"Quick Ratio":0.47,"Day High":18.05,"Day Low":17.59,"VS Average Volume":0.1951468816,"Company Summary":"SoFi Technologies, Inc. provides various financial services in the United States, Latin America, and Canada. It operates through three segments: Lending, Technology Platform, and Financial Services. The company offers lending and financial services and products that allows its members to borrow, save, spend, invest, and protect money. It offers personal loans, student loans, home loans, and related services. The company also operates Galileo, a technology platform that offers services to financial and non-financial institution; and Technisys, a cloud-native digital and core banking platform with financial services customers. In addition, it provides SoFi Money offers checking and savings accounts, debit cards, and cash management products; and SoFi Invest, a mobile-first investment platform that provides access to trading and advisory solutions, such as investing and robo-advisory. Further, the company offers SoFi Credit Card that provides cash backs on every purchase; Sofi Relay, a personal finance management product that allows to track all of their financial accounts comprising credit score and spending behaviors; SoFi Protect, which offers insurance product; SoFi Travel, an application that manages travel search and booking experience; SoFi At Work provides financial benefits to employees, including student loan payments made on their employees' behalf; Lantern Credit, a financial services marketplace platform for seeking alternative products and provide product comparisons; and other lending as a service that offers pre-qualified borrower referrals and sells loans to third-party partner. The company was founded in 2011 and is based in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"22-01-2025 16:53:51"},{"Company Name":"AT&T Inc.","Symbol":"T","Current Price":"22.16","Latest MA":"20.71","Price Target":26.14962,"Difference from MA":"7.01%","Difference from Open":"-0.96%","Change from Yesterday":"-1.40%","Change from Last Report":"-0.03","Latest Volume":"2,379,130","Market Cap":"159,040,307,200","Earning Date":"2025-01-27","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":10.248716,"PB Ratio":1.5536941,"ROE":0.08759,"DTE":125.151,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.73,"Trailing PEG":1.8606,"Trailing PE":18.020327,"Trailing PS":1.3029683,"Quick Ratio":0.42,"Day High":22.42,"Day Low":22.14,"VS Average Volume":0.0680436706,"Company Summary":"AT&T Inc. provides telecommunications and technology services worldwide. The company operates through two segments, Communications and Latin America. The Communications segment offers wireless voice and data communications services; and sells handsets, wireless data cards, wireless computing devices, carrying cases\/protective covers, and wireless chargers through its own company-owned stores, agents, and third-party retail stores. It also provides Virtual Private Networks, AT&T Dedicated Internet, Ethernet, data services, cloud solutions, outsourcing, and managed professional services, as well as customer premises equipment for multinational corporations, small and mid-sized businesses, governmental, and wholesale customers. In addition, this segment offers broadband services, including fiber connections, legacy telephony voice communication services, and other VoIP services and equipment to residential customers. This segment markets its communications services and products under the AT&T, AT&T Business, Cricket, AT&T PREPAID, and AT&T Fiber brand names. The Latin America segment provides postpaid and prepaid wireless services in Mexico under the AT&T and Unefon brand names, as well as sells smartphones through its owned stores, agents and third-party retail stores. The company was formerly known as SBC Communications Inc. and changed its name to AT&T Inc. in 2005. AT&T Inc. was incorporated in 1983 and is based in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"22-01-2025 16:53:51"},{"Company Name":"NextEra Energy, Inc.","Symbol":"NEE","Current Price":"69.58","Latest MA":"76.31","Price Target":85.41818,"Difference from MA":"-8.81%","Difference from Open":"-1.38%","Change from Yesterday":"-1.79%","Change from Last Report":"-0.15","Latest Volume":"1,261,604","Market Cap":"143,094,595,584","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":18.903574,"PB Ratio":2.8589916,"ROE":0.09887999,"DTE":139.015,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.561,"Trailing PEG":2.8853,"Trailing PE":20.648369,"Trailing PS":5.4520535,"Quick Ratio":0.258,"Day High":70.56,"Day Low":69.18,"VS Average Volume":0.118163773,"Company Summary":"NextEra Energy, Inc., through its subsidiaries, generates, transmits, distributes, and sells electric power to retail and wholesale customers in North America. The company generates electricity through wind, solar, nuclear,natural gas, and other clean energy. It also develops, constructs, and operates long-term contracted assets that consists of clean energy solutions, such as renewable generation facilities, battery storage projects, and electric transmission facilities; sells energy commodities; and owns, develops, constructs, manages and operates electric generation facilities in wholesale energy markets. The company had approximately 33,276 megawatts of net generating capacity; approximately 90,000 circuit miles of transmission and distribution lines; and 883 substations. It serves approximately 12 million people through approximately 5.9 million customer accounts in the east and lower west coasts of Florida. The company was formerly known as FPL Group, Inc. and changed its name to NextEra Energy, Inc. in 2010. NextEra Energy, Inc. was founded in 1925 and is headquartered in Juno Beach, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"22-01-2025 16:53:51"},{"Company Name":"Verizon Communications Inc.","Symbol":"VZ","Current Price":"38.71","Latest MA":"40.52","Price Target":47.1625,"Difference from MA":"-4.47%","Difference from Open":"-0.45%","Change from Yesterday":"-0.76%","Change from Last Report":"0.13","Latest Volume":"2,119,136","Market Cap":"162,954,772,480","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.200559,"PB Ratio":1.6917228,"ROE":0.10431,"DTE":182.615,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.418,"Trailing PEG":1.0355,"Trailing PE":16.757576,"Trailing PS":1.2139333,"Quick Ratio":0.51,"Day High":38.95,"Day Low":38.63,"VS Average Volume":0.1112381598,"Company Summary":"Verizon Communications Inc., through its subsidiaries, engages in the provision of communications, technology, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide. It operates in two segments, Verizon Consumer Group (Consumer) and Verizon Business Group (Business). The Consumer segment provides wireless services across the wireless networks in the United States under the Verizon and TracFone brands and through wholesale and other arrangements; and fixed wireless access (FWA) broadband through its wireless networks, as well as related equipment and devices, such as smartphones, tablets, smart watches, and other wireless-enabled connected devices. The segment also offers wireline services in the Mid-Atlantic and Northeastern United States, as well as Washington D.C. through its fiber-optic network, Verizon Fios product portfolio, and a copper-based network. The Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and conferencing, corporate networking, security and managed network, local and long-distance voice, and network access services to deliver various IoT services and products to businesses, government customers, and wireless and wireline carriers in the United States and internationally. The company was formerly known as Bell Atlantic Corporation and changed its name to Verizon Communications Inc. in June 2000. Verizon Communications Inc. was incorporated in 1983 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"22-01-2025 16:53:51"},{"Company Name":"Texas Instruments Incorporated","Symbol":"TXN","Current Price":"198.24","Latest MA":"198.25","Price Target":208.31448,"Difference from MA":"-0.01%","Difference from Open":"1.25%","Change from Yesterday":"1.54%","Change from Last Report":"0.24","Latest Volume":"1,750,585","Market Cap":"180,837,908,480","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":32.757683,"PB Ratio":10.470055,"ROE":0.29293,"DTE":84.399,"Industry":"Semiconductors","Sector":"Technology","Beta":0.98,"Trailing PEG":3.1313,"Trailing PE":36.779224,"Trailing PS":11.510274,"Quick Ratio":3.048,"Day High":198.27,"Day Low":195.3,"VS Average Volume":0.3025661305,"Company Summary":"Texas Instruments Incorporated designs, manufactures, and sells semiconductors to electronics designers and manufacturers in the United States and internationally. The company operates through Analog and Embedded Processing segments. The Analog segment offers power products to manage power requirements across various voltage levels, including battery-management solutions, DC\/DC switching regulators, AC\/DC and isolated controllers and converters, power switches, linear regulators, voltage references, and lighting products. This segment provides signal chain products that sense, condition, and measure signals to allow information to be transferred or converted for further processing and control, including amplifiers, data converters, interface products, motor drives, clocks, and logic and sensing products. The Embedded Processing segment offers microcontrollers that are used in electronic equipment; digital signal processors for mathematical computations; and applications processors for specific computing activity. This segment offers products for use in various markets, such as industrial, automotive, personal electronics, communications equipment, enterprise systems, and calculators and other. It provides DLP products primarily for use in project high-definition images; calculators; and application-specific integrated circuits. The company markets and sells its semiconductor products through direct sales and distributors, as well as through its website. Texas Instruments Incorporated was founded in 1930 and is headquartered in Dallas, Texas.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"22-01-2025 16:53:51"},{"Company Name":"American Airlines Group, Inc.","Symbol":"AAL","Current Price":"19.05","Latest MA":"12.88","Price Target":20.24273,"Difference from MA":"47.91%","Difference from Open":"-0.03%","Change from Yesterday":"2.12%","Change from Last Report":"0.37","Latest Volume":"6,928,923","Market Cap":"12,515,059,712","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":7.778232,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Airlines","Sector":"Industrials","Beta":1.399,"Trailing PEG":0.2269,"Trailing PE":45.34524,"Trailing PS":0.2334333,"Quick Ratio":0.422,"Day High":19.1,"Day Low":18.74,"VS Average Volume":0.2637720199,"Company Summary":"American Airlines Group Inc., through its subsidiaries, operates as a network air carrier. The company provides scheduled air transportation services for passengers and cargo through its hubs in Charlotte, Chicago, Dallas\/Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix, and Washington, D.C., as well as through partner gateways in London, Doha, Madrid, Seattle\/Tacoma, Sydney, and Tokyo. It operates a mainline fleet of 965 aircraft. The company was formerly known as AMR Corporation and changed its name to American Airlines Group Inc. in December 2013. American Airlines Group Inc. was founded in 1926 and is headquartered in Fort Worth, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"22-01-2025 16:53:51"},{"Company Name":"Freeport-McMoRan, Inc.","Symbol":"FCX","Current Price":"39.89","Latest MA":"44.40","Price Target":50.18381,"Difference from MA":"-10.16%","Difference from Open":"-1.36%","Change from Yesterday":"-1.00%","Change from Last Report":"-0.01","Latest Volume":"1,254,581","Market Cap":"57,319,137,280","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":21.28613,"PB Ratio":3.2664592,"ROE":0.16870001,"DTE":33.531,"Industry":"Copper","Sector":"Basic Materials","Beta":1.91,"Trailing PEG":10.5409,"Trailing PE":28.905796,"Trailing PS":2.2355359,"Quick Ratio":1.048,"Day High":40.5,"Day Low":39.66,"VS Average Volume":0.1107523185,"Company Summary":"Freeport-McMoRan Inc. engages in the mining of mineral properties in North America, South America, and Indonesia. It primarily explores for copper, gold, molybdenum, silver, and other metals. The company's assets include the Grasberg minerals district in Indonesia; Morenci, Bagdad, Safford, Sierrita, and Miami in Arizona; Chino and Tyrone in New Mexico; and Henderson and Climax in Colorado, North America, as well as Cerro Verde in Peru and El Abra in Chile. The company was formerly known as Freeport-McMoRan Copper & Gold Inc. and changed its name to Freeport-McMoRan Inc. in July 2014. Freeport-McMoRan Inc. was incorporated in 1987 and is headquartered in Phoenix, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"22-01-2025 16:53:51"},{"Company Name":"TAL Education Group","Symbol":"TAL","Current Price":"8.93","Latest MA":"9.88","Price Target":13.85947,"Difference from MA":"-9.63%","Difference from Open":"-2.99%","Change from Yesterday":"-3.62%","Change from Last Report":"0.17","Latest Volume":"2,705,433","Market Cap":"5,393,225,728","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":19.582247,"PB Ratio":1.437661,"ROE":0.019609999,"DTE":9.291,"Industry":"Education & Training Services","Sector":"Consumer Defensive","Beta":0.033,"Trailing PEG":0.7495,"Trailing PE":74.375,"Trailing PS":2.9365,"Quick Ratio":2.67,"Day High":9.18,"Day Low":8.62,"VS Average Volume":0.4258105001,"Company Summary":"TAL Education Group provides K-12 after-school tutoring services in the People's Republic of China. It provides learning services primarily through small-classes services; personalized premium services; and learning content solutions, such as print books, smart books, mobile apps, and AI-driven learning devices. The company also operates www.xueersi.com, an online education platform; provides investment management and consulting services; develops and sells software and networks, as well as related consulting services; and sells educational materials and products. It offers its services under the Haoweilai and Think Academy brands. TAL Education Group was founded in 2003 and is headquartered in Beijing, the People's Republic of China.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"22-01-2025 16:53:51"},{"Company Name":"CSX Corporation","Symbol":"CSX","Current Price":"33.22","Latest MA":"33.78","Price Target":37.96615,"Difference from MA":"-1.66%","Difference from Open":"0.00%","Change from Yesterday":"-0.15%","Change from Last Report":"-0.15","Latest Volume":"1,057,137","Market Cap":"64,062,111,744","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":16.880854,"PB Ratio":4.9545116,"ROE":0.29458,"DTE":147.913,"Industry":"Railroads","Sector":"Industrials","Beta":1.191,"Trailing PEG":2.1297,"Trailing PE":17.670214,"Trailing PS":4.363607,"Quick Ratio":1.195,"Day High":33.33,"Day Low":33.05,"VS Average Volume":0.0866068799,"Company Summary":"CSX Corporation, together with its subsidiaries, provides rail-based freight transportation services. The company offers rail services; and transportation of intermodal containers and trailers, as well as other transportation services, such as rail-to-truck transfers and bulk commodity operations. It also transports chemicals, agricultural and food products, minerals, automotive, forest products, fertilizers, and metals and equipment; and coal, coke, and iron ore to electricity-generating power plants, steel manufacturers, and industrial plants, as well as exports coal to deep-water port facilities. In addition, the company provides intermodal services through a network of approximately 30 terminals transporting manufactured consumer goods in containers; and drayage services, including the pickup and delivery of intermodal shipments. It serves the automotive industry with distribution centers and storage locations, as well as connects non-rail served customers through transferring products, such as plastics and ethanol from rail to trucks. The company operates approximately 20,000 route mile rail network, which serves various population centers in 26 states east of the Mississippi River, the District of Columbia, and the Canadian provinces of Ontario and Quebec, as well as owns and leases approximately 3,500 locomotives. It serves production and distribution facilities through track connections. CSX Corporation was incorporated in 1978 and is headquartered in Jacksonville, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"22-01-2025 16:53:51"}]