[{"Company Name":"Uber Technologies, Inc.","Symbol":"UBER","Current Price":"65.79","Latest MA":"70.28","Price Target":88.6338,"Difference from MA":"-6.38%","Difference from Open":"-2.81%","Change from Yesterday":"-5.68%","Change from Last Report":"0.00","Latest Volume":"10,135,310","Market Cap":"138,534,666,240","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":16.24966,"PB Ratio":9.366458,"Previous Close":69.75,"ROE":0.34326,"DTE":80.343,"Industry":"Software - Application","Sector":"Technology","Beta":1.337,"Trailing PEG":0.7123,"Trailing PE":32.408867,"Trailing PS":3.3019822,"Quick Ratio":1.223,"Day High":66.75,"Day Low":65.7001,"VS Average Volume":0.3979240894,"Company Summary":"Uber Technologies, Inc. develops and operates proprietary technology applications in the United States, Canada, Latin America, Europe, the Middle East, Africa, and Asia excluding China and Southeast Asia. It operates through three segments: Mobility, Delivery, and Freight. The Mobility segment connects consumers with a range of transportation modalities, such as ridesharing, carsharing, micromobility, rentals, public transit, taxis, and other modalities; and offers riders in a variety of vehicle types, as well as financial partnerships products and advertising services. The Delivery segment allows to search for and discover restaurants to grocery, alcohol, convenience, and other retails; order a meal or other items; and Uber direct, a white-label Delivery-as-a-Service for retailers and restaurants, as well as advertising. The Freight segment manages transportation and logistics network, which connects shippers and carriers in digital marketplace including carriers upfronts, pricing, and shipment booking; and provides on-demand platform to automate logistics end-to-end transactions for small-and medium-sized business to global enterprises. The company was formerly known as Ubercab, Inc. and changed its name to Uber Technologies, Inc. in February 2011. Uber Technologies, Inc. was founded in 2009 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"05-02-2025 16:31:08"},{"Company Name":"Alphabet Inc.","Symbol":"GOOGL","Current Price":"191.37","Latest MA":"174.83","Price Target":216.2737,"Difference from MA":"9.46%","Difference from Open":"0.08%","Change from Yesterday":"-7.71%","Change from Last Report":"0.00","Latest Volume":"5,873,475","Market Cap":"2,349,391,937,536","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":18.625107,"PB Ratio":7.4715962,"Previous Close":206.38,"ROE":0.32101002,"DTE":9.324,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.034,"Trailing PEG":1.3486,"Trailing PE":23.772669,"Trailing PS":6.9128428,"Quick Ratio":1.761,"Day High":191.47,"Day Low":189.52,"VS Average Volume":0.2123141502,"Company Summary":"Alphabet Inc. offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube. It is also involved in the sale of apps and in-app purchases and digital content in the Google Play and YouTube; and devices, as well as in the provision of YouTube consumer subscription services. The Google Cloud segment offers infrastructure, cybersecurity, databases, analytics, AI, and other services; Google Workspace that include cloud-based communication and collaboration tools for enterprises, such as Gmail, Docs, Drive, Calendar, and Meet; and other services for enterprise customers. The Other Bets segment sells healthcare-related and internet services. The company was incorporated in 1998 and is headquartered in Mountain View, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"05-02-2025 16:31:08"},{"Company Name":"Advanced Micro Devices, Inc.","Symbol":"AMD","Current Price":"107.61","Latest MA":"143.49","Price Target":157.00365,"Difference from MA":"-25.01%","Difference from Open":"-0.07%","Change from Yesterday":"-10.01%","Change from Last Report":"0.00","Latest Volume":"9,324,331","Market Cap":"174,630,584,320","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":16.59332,"PB Ratio":3.0648515,"Previous Close":119.5,"ROE":0.03262,"DTE":3.927,"Industry":"Semiconductors","Sector":"Technology","Beta":1.706,"Trailing PEG":0.3305,"Trailing PE":94.39474,"Trailing PS":7.187923,"Quick Ratio":1.575,"Day High":108.5,"Day Low":107.3,"VS Average Volume":0.2565609403,"Company Summary":"Advanced Micro Devices, Inc. operates as a semiconductor company worldwide. It operates through Data Center, Client, Gaming, and Embedded segments. The company offers x86 microprocessors and graphics processing units (GPUs) as an accelerated processing unit, chipsets, data center, and professional GPUs; and embedded processors, and semi-custom system-on-chip (SoC) products, microprocessor and SoC development services and technology, data processing unites, field programmable gate arrays (FPGA), and adaptive SoC products. It provides processors under the AMD Ryzen, AMD Ryzen PRO, Ryzen Threadripper, Ryzen Threadripper PRO, AMD Athlon, AMD Athlon PRO, and AMD PRO A-Series brand names; graphics under the AMD Radeon graphics and AMD Embedded Radeon graphics; and professional graphics under the AMD Radeon Pro graphics brand name. In addition, the company offers data center graphics under the Radeon Instinct and Radeon PRO V-series brands, as well as servers under the AMD Instinct accelerators brand; server microprocessors under the AMD EPYC brands; low power solutions under the AMD Athlon, AMD Geode, AMD Ryzen, AMD EPYC, AMD R-Series, and G-Series brands; FPGA products under the Virtex-6, Virtex-7, Virtex UltraScale+, Kintex-7, Kintex UltraScale, Kintex UltraScale+, Artix-7, Artix UltraScale+, Spartan-6, and Spartan-7 brands; adaptive SOCs under the Zynq-7000, Zynq UltraScale+ MPSoC, Zynq UltraScale+ RFSoCs, Versal HBM, Versal Premium, Versal Prime, Versal AI Core, Versal AI Edge, Vitis, and Vivado brands; and compute and network acceleration board products under the Alveo brand. It serves original equipment and design manufacturers, public cloud service providers, system integrators, independent distributors, and add-in-board manufacturers through its direct sales force, and sales representatives. Advanced Micro Devices, Inc. was incorporated in 1969 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"05-02-2025 16:31:08"},{"Company Name":"Snap Inc.","Symbol":"SNAP","Current Price":"11.34","Latest MA":"11.32","Price Target":13.18486,"Difference from MA":"0.09%","Difference from Open":"1.30%","Change from Yesterday":"-2.07%","Change from Last Report":"0.00","Latest Volume":"7,808,000","Market Cap":"19,011,174,400","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":21.050774,"PB Ratio":8.57413,"Previous Close":11.6,"ROE":-0.4062,"DTE":191.874,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":0.995,"Trailing PEG":496.0591,"Trailing PE":"N\/A","Trailing PS":3.6804829,"Quick Ratio":3.861,"Day High":11.57,"Day Low":11.32,"VS Average Volume":0.272763137,"Company Summary":"Snap Inc. operates as a technology company in North America, Europe, and internationally. The company offers Snapchat, a visual messaging application with various tabs, such as camera, visual messaging, snap map, stories, and spotlight that enable people to communicate visually through short videos and images. It also provides Spectacles, an eyewear product that connects with Snapchat and captures photos and video from a human perspective; and advertising products, including AR ads and Snap ads comprises a single image or video ads, collection ads, dynamic ads, story ads, and commercials. The company was formerly known as Snapchat, Inc. and changed its name to Snap Inc. in September 2016. Snap Inc. was founded in 2010 and is headquartered in Santa Monica, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"05-02-2025 16:31:08"},{"Company Name":"Centene Corporation","Symbol":"CNC","Current Price":"61.29","Latest MA":"67.17","Price Target":78.80118,"Difference from MA":"-8.76%","Difference from Open":"1.73%","Change from Yesterday":"-5.45%","Change from Last Report":"0.00","Latest Volume":"8,469,755","Market Cap":"30,394,140,672","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":7.7140527,"PB Ratio":1.1448585,"Previous Close":64.82,"ROE":0.11559,"DTE":64.231,"Industry":"Healthcare Plans","Sector":"Healthcare","Beta":0.493,"Trailing PEG":0.6559,"Trailing PE":9.713154,"Trailing PS":0.20788857,"Quick Ratio":1.051,"Day High":63.04,"Day Low":59.955,"VS Average Volume":1.5577789953,"Company Summary":"Centene Corporation operates as a healthcare enterprise that provides programs and services to under-insured and uninsured families, commercial organizations, and military families in the United States. The company operates through Medicaid, Medicare, Commercial, and Other segments. The Medicaid segment offers health plan coverage, including medicaid expansion, aged, blind, disabled, children's health insurance program, foster care, medicare-medicaid plans, long-term services and support. This segment also provides healthcare products. The Medicare segment offers special needs and medicare supplement, and prescription drug plans. The Commercial segment provides health insurance marketplace product for individual, small, and large group commercials. It also operates clinical healthcare and pharmacies, as well as offers dental and speech therapy services. In addition, the company engages in the government contracts business under the TRICARE program and other healthcare related government contracts. It provides services through primary and specialty care physicians, hospitals, and ancillary providers. Centene Corporation was founded in 1984 and is headquartered in Saint Louis, Missouri.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"05-02-2025 16:31:08"},{"Company Name":"International Paper Company","Symbol":"IP","Current Price":"53.29","Latest MA":"50.71","Price Target":56.47,"Difference from MA":"5.08%","Difference from Open":"-3.98%","Change from Yesterday":"-1.21%","Change from Last Report":"0.00","Latest Volume":"2,587,431","Market Cap":"28,097,472,512","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":14.431956,"PB Ratio":2.1454165,"Previous Close":53.89,"ROE":0.04797,"DTE":69.707,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":0.988,"Trailing PEG":0.7851,"Trailing PE":33.942673,"Trailing PS":1.5073752,"Quick Ratio":1.021,"Day High":53.29,"Day Low":53.26,"VS Average Volume":0.5197845835,"Company Summary":"International Paper Company produces and sells renewable fiber-based packaging and pulp products in North America, Latin America, Europe, and North Africa. It operates through two segments, Industrial Packaging and Global Cellulose Fibers. The company offers linerboard, medium, whitetop, recycled linerboard, recycled medium and saturating kraft; and pulp for a range of applications, such as diapers, towel and tissue products, feminine care, incontinence, and other personal care products, as well as specialty pulps for use in textiles, construction materials, paints, coatings, and others. It sells its products directly to end users and converters, as well as through agents, resellers, and distributors. The company was founded in 1898 and is headquartered in Memphis, Tennessee.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"05-02-2025 16:31:08"},{"Company Name":"Apple Inc.","Symbol":"AAPL","Current Price":"229.30","Latest MA":"230.07","Price Target":251.8335,"Difference from MA":"-0.34%","Difference from Open":"0.35%","Change from Yesterday":"-1.30%","Change from Last Report":"0.00","Latest Volume":"2,528,866","Market Cap":"3,444,567,703,552","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":27.72612,"PB Ratio":60.87072,"Previous Close":232.8,"ROE":1.5741299,"DTE":209.059,"Industry":"Consumer Electronics","Sector":"Technology","Beta":1.24,"Trailing PEG":2.1315,"Trailing PE":36.339146,"Trailing PS":8.808847,"Quick Ratio":0.745,"Day High":229.49,"Day Low":228.3,"VS Average Volume":0.0496613268,"Company Summary":"Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod. It also provides AppleCare support and cloud services; and operates various platforms, including the App Store that allow customers to discover and download applications and digital content, such as books, music, video, games, and podcasts, as well as advertising services include third-party licensing arrangements and its own advertising platforms. In addition, the company offers various subscription-based services, such as Apple Arcade, a game subscription service; Apple Fitness+, a personalized fitness service; Apple Music, which offers users a curated listening experience with on-demand radio stations; Apple News+, a subscription news and magazine service; Apple TV+, which offers exclusive original content; Apple Card, a co-branded credit card; and Apple Pay, a cashless payment service, as well as licenses its intellectual property. The company serves consumers, and small and mid-sized businesses; and the education, enterprise, and government markets. It distributes third-party applications for its products through the App Store. The company also sells its products through its retail and online stores, and direct sales force; and third-party cellular network carriers, wholesalers, retailers, and resellers. Apple Inc. was founded in 1976 and is headquartered in Cupertino, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"05-02-2025 16:31:08"},{"Company Name":"Tesla, Inc.","Symbol":"TSLA","Current Price":"386.60","Latest MA":"294.93","Price Target":326.08902,"Difference from MA":"31.08%","Difference from Open":"-0.23%","Change from Yesterday":"-1.46%","Change from Last Report":"0.00","Latest Volume":"2,141,851","Market Cap":"1,243,506,671,616","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":99.827515,"PB Ratio":17.729065,"Previous Close":392.21,"ROE":0.20389,"DTE":18.078,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":2.295,"Trailing PEG":5.0543,"Trailing PE":189.50981,"Trailing PS":12.799863,"Quick Ratio":1.214,"Day High":387.8799,"Day Low":386.4,"VS Average Volume":0.0233857162,"Company Summary":"Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners; and provision of service and repairs to its energy product customers, including under warranty, as well as various financing options to its solar customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was incorporated in 2003 and is headquartered in Austin, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"05-02-2025 16:31:08"},{"Company Name":"Verizon Communications Inc.","Symbol":"VZ","Current Price":"40.19","Latest MA":"40.60","Price Target":47.66043,"Difference from MA":"-1.00%","Difference from Open":"1.03%","Change from Yesterday":"1.13%","Change from Last Report":"0.00","Latest Volume":"2,459,036","Market Cap":"169,185,017,856","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.241499,"PB Ratio":1.7564024,"Previous Close":39.81,"ROE":0.10431,"DTE":182.615,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.418,"Trailing PEG":1.0714,"Trailing PE":9.707729,"Trailing PS":1.2603456,"Quick Ratio":0.51,"Day High":40.2,"Day Low":40.0,"VS Average Volume":0.1181095392,"Company Summary":"Verizon Communications Inc., through its subsidiaries, engages in the provision of communications, technology, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide. It operates in two segments, Verizon Consumer Group (Consumer) and Verizon Business Group (Business). The Consumer segment provides wireless services across the wireless networks in the United States under the Verizon and TracFone brands and through wholesale and other arrangements; and fixed wireless access (FWA) broadband through its wireless networks, as well as related equipment and devices, such as smartphones, tablets, smart watches, and other wireless-enabled connected devices. The segment also offers wireline services in the Mid-Atlantic and Northeastern United States, as well as Washington D.C. through its fiber-optic network, Verizon Fios product portfolio, and a copper-based network. The Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and conferencing, corporate networking, security and managed network, local and long-distance voice, and network access services to deliver various IoT services and products to businesses, government customers, and wireless and wireline carriers in the United States and internationally. The company was formerly known as Bell Atlantic Corporation and changed its name to Verizon Communications Inc. in June 2000. Verizon Communications Inc. was incorporated in 1983 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"05-02-2025 16:31:08"},{"Company Name":"Catalent, Inc.","Symbol":"CTLT","Current Price":"63.48","Latest MA":"58.84","Price Target":63.4,"Difference from MA":"7.89%","Difference from Open":"-0.02%","Change from Yesterday":"0.00%","Change from Last Report":"0.00","Latest Volume":"8,083,910","Market Cap":"11,522,381,824","Earning Date":"2025-02-07","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":36.058346,"PB Ratio":3.2527156,"Previous Close":63.48,"ROE":-0.11188,"DTE":139.667,"Industry":"Drug Manufacturers - Specialty & Generic","Sector":"Healthcare","Beta":1.158,"Trailing PEG":529.0,"Trailing PE":"N\/A","Trailing PS":2.6056945,"Quick Ratio":1.69,"Day High":63.5,"Day Low":63.44,"VS Average Volume":3.5636004403,"Company Summary":"Catalent, Inc., together with its subsidiaries, develops and manufactures solutions for drugs, protein-based biologics, cell and gene therapies, and consumer health products worldwide. It operates in two segments, Biologics, and Pharma and Consumer Health. The Biologics segment provides formulation, development, and manufacturing for biologic proteins, cell gene, and other nucleic acid therapies; pDNA, iPSCs, oncolytic viruses, and vaccines; formulation, development, and manufacturing for parenteral dose forms, including vials, prefilled syringes, and cartridges; and analytical development and testing services for large molecules. The Pharma and Consumer Health segment offers formulation, development, and manufacturing services for soft capsules for use in a range of customer products, such as prescription drugs, over-the-counter medications, dietary supplements, unit-dose cosmetics, and animal health medicinal preparations; and oral, nasal, inhaled, and topical dose forms. This segment also provides clinical supply services through manufacturing, packaging, storage, distribution, and inventory management for small-molecule drugs, protein-based biologics, and cell and gene therapies in clinical trials; and pre-clinical screening, formulation, analytical development, and current good manufacturing practices manufacturing at clinical and commercial scale for softgel capsule, Zydis fast-dissolve tablets, oral solid-dose formats, dry powder inhalers, and nasal delivery devices. The company also offers FlexDirect direct-to-patient and FastChain demand-led clinical supply solutions; fill and finish operations for injectable products; and integrated development and product supply chain solutions. It serves biotechnology, pharmaceutical, and consumer health companies; and companies in other healthcare market segments, such as animal health and medical devices, as well as in cosmetics industries. The company was founded in 1933 and is headquartered in Somerset, New Jersey.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"05-02-2025 16:31:08"},{"Company Name":"Amazon.com, Inc.","Symbol":"AMZN","Current Price":"236.41","Latest MA":"199.00","Price Target":249.69365,"Difference from MA":"18.80%","Difference from Open":"-0.09%","Change from Yesterday":"-2.32%","Change from Last Report":"0.00","Latest Volume":"2,658,288","Market Cap":"2,485,851,258,880","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":38.09863,"PB Ratio":9.588724,"Previous Close":242.06,"ROE":0.22558,"DTE":61.175,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":1.146,"Trailing PEG":1.9893,"Trailing PE":50.623127,"Trailing PS":4.0086102,"Quick Ratio":0.827,"Day High":236.8099,"Day Low":235.51,"VS Average Volume":0.0716847301,"Company Summary":"Amazon.com, Inc. engages in the retail sale of consumer products, advertising, and subscriptions service through online and physical stores in North America and internationally. The company operates through three segments: North America, International, and Amazon Web Services (AWS). It also manufactures and sells electronic devices, including Kindle, Fire tablets, Fire TVs, Echo, Ring, Blink, and eero; and develops and produces media content. In addition, the company offers programs that enable sellers to sell their products in its stores; and programs that allow authors, independent publishers, musicians, filmmakers, Twitch streamers, skill and app developers, and others to publish and sell content. Further, it provides compute, storage, database, analytics, machine learning, and other services, as well as advertising services through programs, such as sponsored ads, display, and video advertising. Additionally, the company offers Amazon Prime, a membership program. The company's products offered through its stores include merchandise and content purchased for resale and products offered by third-party sellers. It serves consumers, sellers, developers, enterprises, content creators, advertisers, and employees. Amazon.com, Inc. was incorporated in 1994 and is headquartered in Seattle, Washington.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"05-02-2025 16:31:08"}]