[{"Company Name":"International Paper Company","Symbol":"IP","Current Price":"55.70","Latest MA":"50.40","Price Target":56.46,"Difference from MA":"10.51%","Difference from Open":"-4.30%","Change from Yesterday":"-3.90%","Change from Last Report":"-3.93","Latest Volume":"1,052,851","Market Cap":"19,350,626,304","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":13.822473,"PB Ratio":2.2424412,"ROE":0.04797,"DTE":69.707,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":0.988,"Trailing PEG":0.5152,"Trailing PE":47.60684,"Trailing PS":1.0381237,"Quick Ratio":1.021,"Day High":55.7525,"Day Low":54.5,"VS Average Volume":0.2311758261,"Company Summary":"International Paper Company produces and sells renewable fiber-based packaging and pulp products in North America, Latin America, Europe, and North Africa. It operates through two segments, Industrial Packaging and Global Cellulose Fibers. The company offers linerboard, medium, whitetop, recycled linerboard, recycled medium and saturating kraft; and pulp for a range of applications, such as diapers, towel and tissue products, feminine care, incontinence, and other personal care products, as well as specialty pulps for use in textiles, construction materials, paints, coatings, and others. It sells its products directly to end users and converters, as well as through agents, resellers, and distributors. The company was founded in 1898 and is headquartered in Memphis, Tennessee.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 16:36:21"},{"Company Name":"Mobileye Global Inc.","Symbol":"MBLY","Current Price":"16.07","Latest MA":"16.95","Price Target":20.79179,"Difference from MA":"-5.18%","Difference from Open":"9.92%","Change from Yesterday":"0.74%","Change from Last Report":"0.37","Latest Volume":"3,813,336","Market Cap":"13,033,540,608","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":25.579397,"PB Ratio":1.0791029,"ROE":-0.21936001,"DTE":0.439,"Industry":"Auto Parts","Sector":"Consumer Cyclical","Beta":0.059,"Trailing PEG":0.6671,"Trailing PE":"N\/A","Trailing PS":7.2368355,"Quick Ratio":4.215,"Day High":16.27,"Day Low":14.5,"VS Average Volume":0.5210019188,"Company Summary":"Mobileye Global Inc. develops and deploys advanced driver assistance systems (ADAS) and autonomous driving technologies and solutions worldwide. The company operates through Mobileye and Other segments. It offers Driver Assist comprising ADAS and autonomous vehicle solutions that covers safety features, such as real-time detection of road users, geometry, semantics, and markings to provide safety alerts and emergency interventions; Cloud-Enhanced Driver Assist, a solution for drivers with interpretations of a scene in real-time; Mobileye SuperVision Lite, a navigation and assisted driving solution; and Mobileye SuperVision, an operational point-to-point assisted driving navigation solution on various road types and includes cloud-based enhancements, such as road experience management. The company also provides Mobileye Chauffeur, a first-generation solution for eyes-off\/hands-off driving with a human driver still in the driver's seat; Mobileye Drive, a self-driving system comprising of radar and lidar subsystems, as well as collision avoidance systems, including Mobileye 8 Connect for light and medium-duty vehicles, and Mobileye Shield+ for large vehicles. It serves original equipment manufacturers. The company was founded in 1999 and is headquartered in Jerusalem, Israel. Mobileye Global Inc. operates as a subsidiary of Intel Overseas Funding Corporation.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 16:36:21"},{"Company Name":"Intel Corporation","Symbol":"INTC","Current Price":"19.63","Latest MA":"23.41","Price Target":23.82824,"Difference from MA":"-16.15%","Difference from Open":"-0.48%","Change from Yesterday":"-0.78%","Change from Last Report":"-0.61","Latest Volume":"5,408,946","Market Cap":"84,664,188,928","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":20.854137,"PB Ratio":0.84982026,"ROE":-0.15597,"DTE":47.906,"Industry":"Semiconductors","Sector":"Technology","Beta":1.026,"Trailing PEG":0.5861,"Trailing PE":"N\/A","Trailing PS":1.5607166,"Quick Ratio":0.833,"Day High":19.73,"Day Low":19.525,"VS Average Volume":0.0724959195,"Company Summary":"Intel Corporation designs, develops, manufactures, markets, and sells computing and related products and services worldwide. It operates through Client Computing Group, Data Center and AI, Network and Edge, Mobileye, and Intel Foundry Services segments. The company's products portfolio comprises central processing units and chipsets, system-on-chips (SoCs), and multichip packages; mobile and desktop processors; hardware products comprising graphics processing units (GPUs), domain-specific accelerators, and field programmable gate arrays (FPGAs); and memory and storage, connectivity and networking, and other semiconductor products. It also offers silicon devices and software products; and optimization solutions for workloads, such as AI, cryptography, security, storage, networking, and leverages various features supporting diverse compute environments. In addition, the company develops and deploys advanced driver assistance systems (ADAS), and autonomous driving technologies and solutions; and provides advanced process technologies backed by an ecosystem of IP, EDA, and design services, as well as systems of chips, including advanced packaging technologies, software and accelerate bring-up, and integration of chips and driving standards. Further, it delivers and deploys intelligent edge platforms that allow developers to achieve agility and drive automation using AI for efficient operations with data integrity, as well as provides hardware and software platforms, tools, and ecosystem partnerships for digital transformation from the cloud to edge. The company serves original equipment manufacturers, original design manufacturers, cloud service providers, and other manufacturers and service providers. It has a strategic agreement with Synopsys, Inc. to develop EDA and IP solutions; and ARM that enables chip designers to build optimized compute SoCs on the Intel 18A process. Intel Corporation was incorporated in 1968 and is headquartered in Santa Clara, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"30-01-2025 16:36:21"},{"Company Name":"Comcast Corporation","Symbol":"CMCSA","Current Price":"34.31","Latest MA":"39.56","Price Target":47.7025,"Difference from MA":"-13.27%","Difference from Open":"-0.46%","Change from Yesterday":"-8.00%","Change from Last Report":"-8.16","Latest Volume":"4,616,171","Market Cap":"131,288,596,480","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":7.118642,"PB Ratio":1.5337505,"ROE":0.16884,"DTE":117.127,"Industry":"Telecom Services","Sector":"Communication Services","Beta":1.004,"Trailing PEG":1.1592,"Trailing PE":9.247979,"Trailing PS":1.0667799,"Quick Ratio":0.605,"Day High":34.68,"Day Low":33.81,"VS Average Volume":0.2202014148,"Company Summary":"Comcast Corporation operates as a media and technology company worldwide. It operates through Residential Connectivity & Platforms, Business Services Connectivity, Media, Studios, and Theme Parks segments. The Residential Connectivity & Platforms segment provides residential broadband and wireless connectivity services, residential and business video services, sky-branded entertainment television networks, and advertising. The Business Services Connectivity segment offers connectivity services for small business locations, which include broadband, wireline voice, and wireless services, as well as solutions for medium-sized customers and larger enterprises; and small business connectivity services in the United Kingdom. The Media segment operates NBCUniversal's television and streaming business, including national and regional cable networks; the NBC and Telemundo broadcast networks and owned local broadcast television stations; and Peacock, a direct-to-consumer streaming services. It also operates international television networks comprising the Sky Sports networks, as well as other digital properties. The Studios segment operates NBCUniversal and Sky film and television studio production and distribution operations. The Theme Parks segment operates Universal theme parks in Orlando, Florida; Hollywood, California; Osaka, Japan; and Beijing, China. The company also offers a consolidated streaming platforms under the Philadelphia Flyers and the Wells Fargo Center arena in Philadelphia, Pennsylvania; and Xumo. Comcast Corporation was founded in 1963 and is headquartered in Philadelphia, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 16:36:21"},{"Company Name":"Apple Inc.","Symbol":"AAPL","Current Price":"239.68","Latest MA":"229.60","Price Target":245.794,"Difference from MA":"4.39%","Difference from Open":"0.43%","Change from Yesterday":"0.15%","Change from Last Report":"0.13","Latest Volume":"3,058,964","Market Cap":"3,604,283,654,144","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":28.938646,"PB Ratio":63.62623,"ROE":1.5741299,"DTE":209.059,"Industry":"Consumer Electronics","Sector":"Technology","Beta":1.24,"Trailing PEG":2.1812,"Trailing PE":39.42105,"Trailing PS":9.217292,"Quick Ratio":0.745,"Day High":240.79,"Day Low":238.41,"VS Average Volume":0.0616441906,"Company Summary":"Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod. It also provides AppleCare support and cloud services; and operates various platforms, including the App Store that allow customers to discover and download applications and digital content, such as books, music, video, games, and podcasts, as well as advertising services include third-party licensing arrangements and its own advertising platforms. In addition, the company offers various subscription-based services, such as Apple Arcade, a game subscription service; Apple Fitness+, a personalized fitness service; Apple Music, which offers users a curated listening experience with on-demand radio stations; Apple News+, a subscription news and magazine service; Apple TV+, which offers exclusive original content; Apple Card, a co-branded credit card; and Apple Pay, a cashless payment service, as well as licenses its intellectual property. The company serves consumers, and small and mid-sized businesses; and the education, enterprise, and government markets. It distributes third-party applications for its products through the App Store. The company also sells its products through its retail and online stores, and direct sales force; and third-party cellular network carriers, wholesalers, retailers, and resellers. Apple Inc. was founded in 1976 and is headquartered in Cupertino, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 16:36:21"},{"Company Name":"United Parcel Service, Inc.","Symbol":"UPS","Current Price":"114.02","Latest MA":"129.66","Price Target":148.61774,"Difference from MA":"-12.06%","Difference from Open":"-16.18%","Change from Yesterday":"-14.83%","Change from Last Report":"-14.77","Latest Volume":"4,524,531","Market Cap":"97,303,805,952","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":13.001319,"PB Ratio":5.769811,"ROE":0.31422,"DTE":155.425,"Industry":"Integrated Freight & Logistics","Sector":"Industrials","Beta":0.982,"Trailing PEG":1.7181,"Trailing PE":17.224018,"Trailing PS":1.072975,"Quick Ratio":1.027,"Day High":117.89,"Day Low":113.0,"VS Average Volume":1.0689397004,"Company Summary":"United Parcel Service, Inc., a package delivery company, provides transportation and delivery, distribution, contract logistics, ocean freight, airfreight, customs brokerage, and insurance services. It operates through two segments, U.S. Domestic Package and International Package. The U.S. Domestic Package segment offers time-definite delivery of express letters, documents, small packages, and palletized freight through air and ground services in the United States. The International Package segment provides guaranteed day and time-definite international shipping services comprising guaranteed time-definite express options in Europe, Asia, the Indian sub-continent, the Middle East, Africa, Canada, and Latin America. The company also offers international air and ocean freight forwarding, post-sales, and mail and consulting services. In addition, it provides truckload and customs brokerage services; supply chain solutions to the healthcare and life sciences industries; fulfillment and transportation management services; and integrated supply chain and shipment insurance solutions. United Parcel Service, Inc. was founded in 1907 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 16:36:21"},{"Company Name":"Altria Group, Inc.","Symbol":"MO","Current Price":"50.66","Latest MA":"50.57","Price Target":56.58769,"Difference from MA":"0.18%","Difference from Open":"-4.05%","Change from Yesterday":"-3.68%","Change from Last Report":"-3.80","Latest Volume":"1,459,043","Market Cap":"85,859,074,048","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":9.158903,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Tobacco","Sector":"Consumer Defensive","Beta":0.67,"Trailing PEG":3.6834,"Trailing PE":8.557432,"Trailing PS":4.2166324,"Quick Ratio":0.274,"Day High":51.1,"Day Low":50.11,"VS Average Volume":0.1836621532,"Company Summary":"Altria Group, Inc., through its subsidiaries, manufactures and sells smokeable and oral tobacco products in the United States. The company offers cigarettes primarily under the Marlboro brand; large cigars and pipe tobacco under the Black & Mild brand; moist smokeless tobacco and snus products under the Copenhagen, Skoal, Red Seal, and Husky brands; oral nicotine pouches under the on! brand; and e-vapor products under the NJOY ACE brand. It sells its products to distributors, as well as large retail organizations, such as chain stores. The company was founded in 1822 and is headquartered in Richmond, Virginia.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"30-01-2025 16:36:21"},{"Company Name":"Dow Inc.","Symbol":"DOW","Current Price":"38.43","Latest MA":"47.80","Price Target":48.05882,"Difference from MA":"-19.60%","Difference from Open":"-6.79%","Change from Yesterday":"-6.41%","Change from Last Report":"-6.38","Latest Volume":"1,249,347","Market Cap":"26,904,537,088","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":11.367738,"PB Ratio":1.4693176,"ROE":0.05863,"DTE":95.059,"Industry":"Chemicals","Sector":"Basic Materials","Beta":1.222,"Trailing PEG":0.589,"Trailing PE":25.62,"Trailing PS":0.6230787,"Quick Ratio":0.8,"Day High":39.48,"Day Low":38.21,"VS Average Volume":0.1636478381,"Company Summary":"Dow Inc., through its subsidiaries, engages in the provision of various materials science solutions for packaging, infrastructure, mobility, and consumer applications in the United States, Canada, Europe, the Middle East, Africa, India, the Asia Pacific, and Latin America. The company operates through Packaging & Specialty Plastics, Industrial Intermediates & Infrastructure, and Performance Materials & Coatings segments. The Packaging & Specialty Plastics segment provides ethylene, and propylene and aromatics products; and polyethylene, polyolefin elastomers, ethylene vinyl acetate, and ethylene propylene diene monomer rubbers for mobility and transportation, consumer, wire and cable, and construction end-markets. The Industrial Intermediates & Infrastructure segment offers purified ethylene, ethylene and ethanol amines, propylene glycol and polyether polyols, aromatic isocyanates and coatings, adhesives, sealants, elastomers, and composites. This segment also provides caustic soda, and ethylene dichloride and vinyl chloride monomers; and cellulose ethers, redispersible latex powders, and acrylic emulsions. The Performance Materials and Coatings segment provides architectural paints and coatings, and industrial coatings that are used in maintenance and protective industries, wood, metal packaging, traffic markings, thermal paper, and leather; and silicon metal, siloxanes, and intermediates used as key materials in manufacturing differentiated downstream silicone products. It also engages in property and casualty insurance, as well as reinsurance business. Dow Inc. was incorporated in 2018 and is headquartered in Midland, Michigan.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"30-01-2025 16:36:21"},{"Company Name":"Teradyne, Inc.","Symbol":"TER","Current Price":"107.05","Latest MA":"127.38","Price Target":142.66058,"Difference from MA":"-15.97%","Difference from Open":"4.64%","Change from Yesterday":"-12.06%","Change from Last Report":"-12.29","Latest Volume":"1,163,112","Market Cap":"17,433,454,592","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":17.418407,"PB Ratio":6.01005,"ROE":0.19206,"DTE":2.738,"Industry":"Semiconductor Equipment & Materials","Sector":"Technology","Beta":1.515,"Trailing PEG":1.2544,"Trailing PE":34.090763,"Trailing PS":6.3681645,"Quick Ratio":1.742,"Day High":107.74,"Day Low":100.77,"VS Average Volume":0.4758026709,"Company Summary":"Teradyne, Inc. designs, develops, manufactures, and sells automated test systems and robotics products worldwide. It operates through four segments; Semiconductor Test, System Test, Robotics, and Wireless Test. The Semiconductor Test segment offers products and services for wafer level and device package testing of semiconductor devices in automotive, industrial, communications, consumer, smartphones, cloud, computer and electronic game, and other applications. This segment also provides FLEX test platform systems; J750 test system to address the volume semiconductor devices, including microcontrollers; Magnum platform that tests memory devices, such as flash memory and DRAM; and ETS platform for semiconductor manufacturers, and assembly and test subcontractors in the analog\/mixed signal markets. It serves integrated device manufacturers that integrate the fabrication of silicon wafers into their business; fabless companies that outsource the manufacturing of silicon wafers; foundries; and semiconductor assembly and test providers. The System Test segment offers defense\/aerospace test instrumentation and systems; storage and system level test systems; and circuit-board test and inspection systems. The Wireless Test segment provides wireless test solutions for silicon validation, wireless module manufacturing, and wireless end device manufacturing under the LitePoint brand. This segment also offers IQxel-MX and IQxel-MW7G series products for edge measurement performance in the manufacturing of connectivity products; IQxstream-5G and IQgig-5G family products to support 4G and 5G technologies; and IQgig-UWB+ for certification and manufacturing test support for ultra wideband products. The Robotics segment provides collaborative robotic arms, autonomous mobile robots, and advanced robotic control software for manufacturing, logistics, and industrial customers. The company was incorporated in 1960 and is headquartered in North Reading, Massachusetts.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 16:36:21"},{"Company Name":"Western Digital Corporation","Symbol":"WDC","Current Price":"65.11","Latest MA":"66.61","Price Target":83.75,"Difference from MA":"-2.26%","Difference from Open":"-2.02%","Change from Yesterday":"3.95%","Change from Last Report":"3.68","Latest Volume":"1,627,397","Market Cap":"22,509,047,808","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":8.513771,"PB Ratio":1.9349182,"ROE":0.033239998,"DTE":"N\/A","Industry":"Computer Hardware","Sector":"Technology","Beta":1.394,"Trailing PEG":null,"Trailing PE":18.817919,"Trailing PS":1.5687934,"Quick Ratio":0.683,"Day High":67.59,"Day Low":65.0,"VS Average Volume":0.2996144073,"Company Summary":"Western Digital Corporation develops, manufactures, and sells data storage devices and solutions in the United States, China, Hong Kong, Europe, the Middle East, Africa, rest of Asia, and internationally. It offers client devices, including hard disk drives (HDDs) and solid state drives (SSDs) for desktop and notebook personal computers (PCs), gaming consoles, and set top boxes; and flash-based embedded storage products for mobile phones, tablets, notebook PCs, and other portable and wearable devices, as well as automotive, Internet of Things, industrial, and connected home applications. The company also provides enterprise HDDs; enterprise SSDs consisting of flash-based SSDs and software solutions for use in enterprise servers, online transactions, artificial intelligence-related workloads, data analysis, and other enterprise applications; and data storage platforms. In addition, it offers external HDD storage products in mobile and desktop form; client portable SSDs; removable cards that are used in consumer devices comprising mobile phones, tablets, imaging systems, and cameras and smart video systems; universal serial bus flash drives for use in the computing and consumer markets; and wireless drive products used in-field backup of created content, as well as wireless streaming of high-definition movies, photos, music, documents to tablets, smartphones, and PCs. The company sells its products under the Western Digital, SanDisk, and WD brands to original equipment manufacturers, distributors, dealers, resellers, and retailers. Western Digital Corporation was founded in 1970 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 16:36:21"},{"Company Name":"Tesla, Inc.","Symbol":"TSLA","Current Price":"402.50","Latest MA":"289.84","Price Target":323.97952,"Difference from MA":"38.87%","Difference from Open":"-1.95%","Change from Yesterday":"3.44%","Change from Last Report":"3.44","Latest Volume":"10,950,309","Market Cap":"1,292,049,186,816","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":100.09873,"PB Ratio":18.458223,"ROE":0.20389,"DTE":18.078,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":2.295,"Trailing PEG":4.7684,"Trailing PE":199.25743,"Trailing PS":13.299528,"Quick Ratio":1.214,"Day High":412.5,"Day Low":402.31,"VS Average Volume":0.1219145862,"Company Summary":"Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners; and provision of service and repairs to its energy product customers, including under warranty, as well as various financing options to its solar customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was incorporated in 2003 and is headquartered in Austin, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"30-01-2025 16:36:21"},{"Company Name":"Microsoft Corporation","Symbol":"MSFT","Current Price":"417.98","Latest MA":"426.74","Price Target":508.1818,"Difference from MA":"-2.05%","Difference from Open":"-0.12%","Change from Yesterday":"-5.52%","Change from Last Report":"-5.50","Latest Volume":"6,450,364","Market Cap":"3,107,630,350,336","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":27.789461,"PB Ratio":11.573581,"ROE":0.35604,"DTE":33.657,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.904,"Trailing PEG":2.3451,"Trailing PE":33.6267,"Trailing PS":12.22562,"Quick Ratio":1.163,"Day High":419.51,"Day Low":414.74,"VS Average Volume":0.2956781897,"Company Summary":"Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services. This segment also provides LinkedIn; and dynamics business solutions, including Dynamics 365, a set of intelligent, cloud-based applications across ERP, CRM, power apps, and power automate; and on-premises ERP and CRM applications. The Intelligent Cloud segment offers server products and cloud services, such as azure and other cloud services; SQL and windows server, visual studio, system center, and related client access licenses, as well as nuance and GitHub; and enterprise services including enterprise support services, industry solutions, and nuance professional services. The More Personal Computing segment offers Windows, including windows OEM licensing and other non-volume licensing of the Windows operating system; Windows commercial comprising volume licensing of the Windows operating system, windows cloud services, and other Windows commercial offerings; patent licensing; and windows Internet of Things; and devices, such as surface, HoloLens, and PC accessories. Additionally, this segment provides gaming, which includes Xbox hardware and content, and first- and third-party content; Xbox game pass and other subscriptions, cloud gaming, advertising, third-party disc royalties, and other cloud services; and search and news advertising, which includes Bing, Microsoft News and Edge, and third-party affiliates. The company sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online, and retail stores. The company was founded in 1975 and is headquartered in Redmond, Washington.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"30-01-2025 16:36:21"},{"Company Name":"Las Vegas Sands Corp.","Symbol":"LVS","Current Price":"47.39","Latest MA":"46.18","Price Target":58.62889,"Difference from MA":"2.61%","Difference from Open":"9.42%","Change from Yesterday":"9.10%","Change from Last Report":"9.12","Latest Volume":"1,201,918","Market Cap":"34,358,980,608","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":16.003107,"PB Ratio":10.027508,"ROE":0.45166,"DTE":384.206,"Industry":"Resorts & Casinos","Sector":"Consumer Cyclical","Beta":1.117,"Trailing PEG":0.6553,"Trailing PE":24.17857,"Trailing PS":3.03605,"Quick Ratio":0.864,"Day High":47.82,"Day Low":46.5358,"VS Average Volume":0.248552733,"Company Summary":"Las Vegas Sands Corp., together with its subsidiaries, develops, owns, and operates integrated resorts in Macao and Singapore. It owns and operates The Venetian Macao Resort Hotel, the Londoner Macao, The Parisian Macao, The Plaza Macao and Four Seasons Hotel Macao, Cotai Strip, and the Sands Macao in Macao, the People's Republic of China; and Marina Bay Sands in Singapore. The company's integrated resorts feature accommodations, gaming, entertainment and retail malls, convention and exhibition facilities, celebrity chef restaurants, and other amenities. Las Vegas Sands Corp. was founded in 1988 and is based in Las Vegas, Nevada.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 16:36:21"},{"Company Name":"Alibaba Group Holding Limited","Symbol":"BABA","Current Price":"97.73","Latest MA":"87.63","Price Target":120.953445,"Difference from MA":"11.53%","Difference from Open":"-1.67%","Change from Yesterday":"1.05%","Change from Last Report":"1.05","Latest Volume":"1,341,800","Market Cap":"232,213,479,424","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":1.3787831,"PB Ratio":0.24109598,"ROE":0.05668,"DTE":22.796,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":0.349,"Trailing PEG":0.6431,"Trailing PE":20.110083,"Trailing PS":0.24437144,"Quick Ratio":0.97,"Day High":97.8395,"Day Low":97.14,"VS Average Volume":0.0865768465,"Company Summary":"Alibaba Group Holding Limited, through its subsidiaries, provides technology infrastructure and marketing reach to help merchants, brands, retailers, and other businesses to engage with their users and customers in the People's Republic of China and internationally. The company operates through seven segments: China Commerce, International Commerce, Local Consumer Services, Cainiao, Cloud, Digital Media and Entertainment, and Innovation Initiatives and Others. It operates Taobao and Tmall, which are digital retail platforms; Alimama, a proprietary monetization platform; 1688.com and Alibaba.com, which are online wholesale marketplaces; AliExpress, a retail marketplace; Lazada, Trendyol, and Daraz that are e-commerce platforms; Freshippo, a retail platform for groceries and fresh goods; and Tmall Global, an import e-commerce platform. The company also operates Cainiao Network logistic services platform; Ele.me, an on-demand delivery and local services platform; Koubei, a restaurant and local services guide platform; and Fliggy, an online travel platform. In addition, it offers pay-for-performance, in-feed, and display marketing services; and Taobao Ad Network and Exchange, a real-time online bidding marketing exchange. Further, the company provides elastic computing, storage, network, security, database, big data, and IoT services; and hardware, software license, software installation, and application development and maintenance services. Additionally, it operates Youku, an online video platform; Quark, a platform for information search, storage, and consumption; Alibaba Pictures and other content platforms that provide online videos, films, live events, news feeds, literature, music, and others; Amap, a mobile digital map, navigation, and real-time traffic information app; DingTalk, a business efficiency mobile app; and Tmall Genie smart speaker. The company was incorporated in 1999 and is based in Hangzhou, the People's Republic of China.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 16:36:21"},{"Company Name":"Meta Platforms, Inc.","Symbol":"META","Current Price":"688.24","Latest MA":"559.33","Price Target":717.7861,"Difference from MA":"23.05%","Difference from Open":"-1.23%","Change from Yesterday":"1.85%","Change from Last Report":"1.74","Latest Volume":"3,791,517","Market Cap":"1,737,455,304,704","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":23.678577,"PB Ratio":10.558098,"ROE":0.36134,"DTE":29.811,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.215,"Trailing PEG":1.4368,"Trailing PE":28.820776,"Trailing PS":11.121351,"Quick Ratio":2.568,"Day High":698.25,"Day Low":687.43,"VS Average Volume":0.2855314272,"Company Summary":"Meta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and wearables worldwide. It operates in two segments, Family of Apps and Reality Labs. The Family of Apps segment offers Facebook, which enables people to share, discuss, discover, and connect with interests; Instagram, a community for sharing photos, videos, and private messages, as well as feed, stories, reels, video, live, and shops; Messenger, a messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls; and WhatsApp, a messaging application that is used by people and businesses to communicate and transact privately. The Reality Labs segment provides augmented and virtual reality related products comprising consumer hardware, software, and content that help people feel connected, anytime, and anywhere. The company was formerly known as Facebook, Inc. and changed its name to Meta Platforms, Inc. in October 2021. The company was incorporated in 2004 and is headquartered in Menlo Park, California","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 16:36:21"},{"Company Name":"International Business Machines","Symbol":"IBM","Current Price":"249.65","Latest MA":"209.17","Price Target":231.32529,"Difference from MA":"19.35%","Difference from Open":"10.65%","Change from Yesterday":"9.12%","Change from Last Report":"9.19","Latest Volume":"1,724,028","Market Cap":"230,838,452,224","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":21.924683,"PB Ratio":9.442166,"ROE":0.26729,"DTE":245.112,"Industry":"Information Technology Services","Sector":"Technology","Beta":0.71,"Trailing PEG":7.571,"Trailing PE":38.886433,"Trailing PS":3.6886938,"Quick Ratio":0.896,"Day High":252.54,"Day Low":247.01,"VS Average Volume":0.4410642575,"Company Summary":"International Business Machines Corporation, together with its subsidiaries, provides integrated solutions and services worldwide. The company operates through Software, Consulting, Infrastructure, and Financing segments. The Software segment offers a hybrid cloud and AI platforms that allows clients to realize their digital and AI transformations across the applications, data, and environments in which they operate. The Consulting segment focuses on skills integration for strategy, experience, technology, and operations by domain and industry. The Infrastructure segment provides on-premises and cloud based server, and storage solutions, as well as life-cycle services for hybrid cloud infrastructure deployment. The Financing segment offers client and commercial financing, facilitates IBM clients' acquisition of hardware, software, and services. The company has a strategic partnership to various companies including hyperscalers, service providers, global system integrators, and software and hardware vendors that includes Adobe, Amazon Web services, Microsoft, Oracle, Salesforce, Samsung Electronics and SAP, and others. The company was formerly known as Computing-Tabulating-Recording Co. International Business Machines Corporation was incorporated in 1911 and is headquartered in Armonk, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"30-01-2025 16:36:21"},{"Company Name":"SiriusXM Holdings Inc.","Symbol":"SIRI","Current Price":"23.09","Latest MA":"27.22","Price Target":24.69231,"Difference from MA":"-15.18%","Difference from Open":"5.00%","Change from Yesterday":"5.29%","Change from Last Report":"5.72","Latest Volume":"1,035,261","Market Cap":"7,831,970,304","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.310242,"PB Ratio":0.7208229,"ROE":-0.46799,"DTE":98.775,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.05,"Trailing PEG":0.1852,"Trailing PE":"N\/A","Trailing PS":0.8900978,"Quick Ratio":0.26,"Day High":23.13,"Day Low":21.99,"VS Average Volume":0.1853059866,"Company Summary":"Sirius XM Holdings Inc. operates as an audio entertainment company in North America. It operates in two segments, Sirius XM, and Pandora and Off-platform. The company's Sirius XM segment provides music, sports, entertainment, comedy, talk, news, traffic and weather channels, and other content, as well as podcast and infotainment services on subscription fee basis; and live, curated, and exclusive and on demand programming services through satellite radio systems and streamed through applications for mobile and home devices, and other consumer electronic equipment. This segment also distributes satellite radios through automakers and retailers, as well as its website; podcasts, including true crime, news, politics, music, comedy, sports, and entertainment; and offers location-based services through two-way wireless connectivity, including safety, security, convenience, maintenance and data, remote vehicles diagnostic, and stolen or parked vehicle locator services. In addition, this segment provides music channels on the DISH Network satellite television service as a programming package; Travel Link, a suite of data services that include graphical weather, fuel prices, sports schedule and scores, and movie listings; graphic information related to road closings, traffic flow, and incident data for consumers with in-vehicle navigation systems; real-time weather services in vehicles, boats, and planes; and music programming and commercial-free music services for office, restaurants, and other business. Its Pandora and Off-platform segment operates music, comedy, and podcast streaming platform, which offers personalized experience for listener through computers, tablets, mobile devices, vehicle speakers, and connected devices; and provides advertising services. The company was incorporated in 2013 and is headquartered in New York.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"30-01-2025 16:36:21"},{"Company Name":"SoFi Technologies, Inc.","Symbol":"SOFI","Current Price":"16.37","Latest MA":"10.78","Price Target":13.29375,"Difference from MA":"51.87%","Difference from Open":"0.74%","Change from Yesterday":"2.35%","Change from Last Report":"2.38","Latest Volume":"2,701,475","Market Cap":"17,931,044,864","Earning Date":"2025-01-27","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":35.2551,"PB Ratio":2.899398,"ROE":0.037249997,"DTE":54.394,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.613,"Trailing PEG":null,"Trailing PE":41.97436,"Trailing PS":7.1177225,"Quick Ratio":0.47,"Day High":16.52,"Day Low":16.11,"VS Average Volume":0.0551725134,"Company Summary":"SoFi Technologies, Inc. provides various financial services in the United States, Latin America, and Canada. It operates through three segments: Lending, Technology Platform, and Financial Services. The company offers lending and financial services and products that allows its members to borrow, save, spend, invest, and protect money. It offers personal loans, student loans, home loans, and related services. The company also operates Galileo, a technology platform that offers services to financial and non-financial institution; and Technisys, a cloud-native digital and core banking platform with financial services customers. In addition, it provides SoFi Money offers checking and savings accounts, debit cards, and cash management products; and SoFi Invest, a mobile-first investment platform that provides access to trading and advisory solutions, such as investing and robo-advisory. Further, the company offers SoFi Credit Card that provides cash backs on every purchase; Sofi Relay, a personal finance management product that allows to track all of their financial accounts comprising credit score and spending behaviors; SoFi Protect, which offers insurance product; SoFi Travel, an application that manages travel search and booking experience; SoFi At Work provides financial benefits to employees, including student loan payments made on their employees' behalf; Lantern Credit, a financial services marketplace platform for seeking alternative products and provide product comparisons; and other lending as a service that offers pre-qualified borrower referrals and sells loans to third-party partner. The company was founded in 2011 and is based in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"30-01-2025 16:36:21"},{"Company Name":"AT&T Inc.","Symbol":"T","Current Price":"24.04","Latest MA":"20.96","Price Target":26.61885,"Difference from MA":"14.70%","Difference from Open":"-2.71%","Change from Yesterday":"-0.78%","Change from Last Report":"-0.78","Latest Volume":"2,354,581","Market Cap":"172,511,051,776","Earning Date":"2025-01-27","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":10.733964,"PB Ratio":1.6851256,"ROE":0.08759,"DTE":125.151,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.73,"Trailing PEG":4.1158,"Trailing PE":16.134228,"Trailing PS":1.41333,"Quick Ratio":0.42,"Day High":24.2,"Day Low":23.89,"VS Average Volume":0.0655560288,"Company Summary":"AT&T Inc. provides telecommunications and technology services worldwide. The company operates through two segments, Communications and Latin America. The Communications segment offers wireless voice and data communications services; and sells handsets, wireless data cards, wireless computing devices, carrying cases\/protective covers, and wireless chargers through its own company-owned stores, agents, and third-party retail stores. It also provides Virtual Private Networks, AT&T Dedicated Internet, Ethernet, data services, cloud solutions, outsourcing, and managed professional services, as well as customer premises equipment for multinational corporations, small and mid-sized businesses, governmental, and wholesale customers. In addition, this segment offers broadband services, including fiber connections, legacy telephony voice communication services, and other VoIP services and equipment to residential customers. This segment markets its communications services and products under the AT&T, AT&T Business, Cricket, AT&T PREPAID, and AT&T Fiber brand names. The Latin America segment provides postpaid and prepaid wireless services in Mexico under the AT&T and Unefon brand names, as well as sells smartphones through its owned stores, agents and third-party retail stores. The company was formerly known as SBC Communications Inc. and changed its name to AT&T Inc. in 2005. AT&T Inc. was incorporated in 1983 and is based in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 16:36:21"},{"Company Name":"Verizon Communications Inc.","Symbol":"VZ","Current Price":"39.90","Latest MA":"40.58","Price Target":47.66043,"Difference from MA":"-1.70%","Difference from Open":"-2.27%","Change from Yesterday":"-0.84%","Change from Last Report":"-0.96","Latest Volume":"2,112,764","Market Cap":"167,943,192,576","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.18631,"PB Ratio":1.7435102,"ROE":0.10431,"DTE":182.615,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.418,"Trailing PEG":1.0831,"Trailing PE":9.636474,"Trailing PS":1.2510946,"Quick Ratio":0.51,"Day High":40.29,"Day Low":39.44,"VS Average Volume":0.1054477087,"Company Summary":"Verizon Communications Inc., through its subsidiaries, engages in the provision of communications, technology, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide. It operates in two segments, Verizon Consumer Group (Consumer) and Verizon Business Group (Business). The Consumer segment provides wireless services across the wireless networks in the United States under the Verizon and TracFone brands and through wholesale and other arrangements; and fixed wireless access (FWA) broadband through its wireless networks, as well as related equipment and devices, such as smartphones, tablets, smart watches, and other wireless-enabled connected devices. The segment also offers wireline services in the Mid-Atlantic and Northeastern United States, as well as Washington D.C. through its fiber-optic network, Verizon Fios product portfolio, and a copper-based network. The Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and conferencing, corporate networking, security and managed network, local and long-distance voice, and network access services to deliver various IoT services and products to businesses, government customers, and wireless and wireline carriers in the United States and internationally. The company was formerly known as Bell Atlantic Corporation and changed its name to Verizon Communications Inc. in June 2000. Verizon Communications Inc. was incorporated in 1983 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 16:36:21"},{"Company Name":"American Airlines Group, Inc.","Symbol":"AAL","Current Price":"17.14","Latest MA":"13.11","Price Target":20.995,"Difference from MA":"30.71%","Difference from Open":"1.21%","Change from Yesterday":"-1.21%","Change from Last Report":"-1.12","Latest Volume":"6,846,999","Market Cap":"11,267,525,632","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":5.580008,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Airlines","Sector":"Industrials","Beta":1.399,"Trailing PEG":0.2392,"Trailing PE":13.81871,"Trailing PS":0.21016407,"Quick Ratio":0.422,"Day High":17.22,"Day Low":16.8,"VS Average Volume":0.2514323697,"Company Summary":"American Airlines Group Inc., through its subsidiaries, operates as a network air carrier. The company provides scheduled air transportation services for passengers and cargo through its hubs in Charlotte, Chicago, Dallas\/Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix, and Washington, D.C., as well as through partner gateways in London, Doha, Madrid, Seattle\/Tacoma, Sydney, and Tokyo. It operates a mainline fleet of 965 aircraft. The company was formerly known as AMR Corporation and changed its name to American Airlines Group Inc. in December 2013. American Airlines Group Inc. was founded in 1926 and is headquartered in Fort Worth, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 16:36:21"},{"Company Name":"Lam Research Corporation","Symbol":"LRCX","Current Price":"78.50","Latest MA":"81.07","Price Target":91.08359,"Difference from MA":"-3.17%","Difference from Open":"-1.74%","Change from Yesterday":"4.24%","Change from Last Report":"4.46","Latest Volume":"3,381,406","Market Cap":"101,005,172,736","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":19.74331,"PB Ratio":11.984733,"ROE":0.49116,"DTE":58.827,"Industry":"Semiconductor Equipment & Materials","Sector":"Technology","Beta":1.486,"Trailing PEG":1.4446,"Trailing PE":23.860182,"Trailing PS":6.4783034,"Quick Ratio":1.685,"Day High":80.0,"Day Low":78.4,"VS Average Volume":0.2943377043,"Company Summary":"Lam Research Corporation designs, manufactures, markets, refurbishes, and services semiconductor processing equipment used in the fabrication of integrated circuits. The company offers ALTUS systems to deposit conformal films for tungsten metallization applications; SABRE electrochemical deposition products for copper interconnect transition that offers copper damascene manufacturing; and VECTOR plasma-enhanced CVD products. It also provides SPEED gapfill high-density plasma chemical vapor deposition products; and Striker single-wafer atomic layer deposition products for dielectric film solutions. In addition, the company offers Flex for dielectric etch applications; Vantex, a dielectric etch system that provides RF technology and repeatable wafer-to-wafer performance enabled by Equipment Intelligence solutions; Kiyo for conductor etch applications; Syndion for through-silicon via etch applications; and Versys metal products for metal etch processes. Further, it provides Coronus bevel clean products to enhance die yield; and Da Vinci, DV-Prime, EOS, and SP series products to address various wafer cleaning applications. The company sells its products in the United States, China, Europe, Japan, Korea, Southeast Asia, and Taiwan. Lam Research Corporation was incorporated in 1980 and is headquartered in Fremont, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 16:36:21"},{"Company Name":"Bank of America Corporation","Symbol":"BAC","Current Price":"46.91","Latest MA":"42.24","Price Target":52.16667,"Difference from MA":"11.06%","Difference from Open":"0.34%","Change from Yesterday":"0.35%","Change from Last Report":"0.34","Latest Volume":"1,309,733","Market Cap":"357,025,447,936","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.834344,"PB Ratio":1.3262278,"ROE":0.08092,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.325,"Trailing PEG":2.0713,"Trailing PE":14.613707,"Trailing PS":3.7730165,"Quick Ratio":"N\/A","Day High":47.16,"Day Low":46.91,"VS Average Volume":0.03681638,"Company Summary":"Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. It operates in four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, non-interest and interest-bearing checking accounts, and investment accounts and products; credit and debit cards; residential mortgages, and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research, and certain market-based services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 16:36:21"},{"Company Name":"Alphabet Inc.","Symbol":"GOOGL","Current Price":"198.26","Latest MA":"174.34","Price Target":216.14644,"Difference from MA":"13.72%","Difference from Open":"0.13%","Change from Yesterday":"1.61%","Change from Last Report":"1.46","Latest Volume":"2,021,744","Market Cap":"2,436,894,818,304","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":22.037916,"PB Ratio":7.7407956,"ROE":0.32101002,"DTE":9.324,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.034,"Trailing PEG":1.2782,"Trailing PE":26.295094,"Trailing PS":7.170311,"Quick Ratio":1.761,"Day High":199.71,"Day Low":197.94,"VS Average Volume":0.0728885354,"Company Summary":"Alphabet Inc. offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube. It is also involved in the sale of apps and in-app purchases and digital content in the Google Play and YouTube; and devices, as well as in the provision of YouTube consumer subscription services. The Google Cloud segment offers infrastructure, cybersecurity, databases, analytics, AI, and other services; Google Workspace that include cloud-based communication and collaboration tools for enterprises, such as Gmail, Docs, Drive, Calendar, and Meet; and other services for enterprise customers. The Other Bets segment sells healthcare-related and internet services. The company was incorporated in 1998 and is headquartered in Mountain View, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 16:36:21"},{"Company Name":"Super Micro Computer, Inc.","Symbol":"SMCI","Current Price":"28.29","Latest MA":"47.17","Price Target":40.79182,"Difference from MA":"-40.04%","Difference from Open":"-1.03%","Change from Yesterday":"1.69%","Change from Last Report":"1.74","Latest Volume":"1,906,073","Market Cap":"16,562,705,408","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.666703,"PB Ratio":3.0348713,"ROE":0.32469,"DTE":39.749,"Industry":"Computer Hardware","Sector":"Technology","Beta":1.279,"Trailing PEG":null,"Trailing PE":14.07214,"Trailing PS":1.1084031,"Quick Ratio":1.805,"Day High":28.63,"Day Low":28.11,"VS Average Volume":0.0257498572,"Company Summary":"Super Micro Computer, Inc., together with its subsidiaries, develops and manufactures high performance server and storage solutions based on modular and open architecture in the United States, Europe, Asia, and internationally. Its solutions range from complete server, storage systems, modular blade servers, blades, workstations, full racks, networking devices, server sub-systems, server management software, and security software. The company provides application-optimized server solutions, rackmount and blade servers, storage, and subsystems and accessories; and server software management solutions, such as Server Management Suite, including Supermicro Server Manager, Supermicro Power Management software, Supermicro Update Manager, SuperCloud Composer, and SuperDoctor 5. In addition, it offers server subsystems and accessories comprising server boards, chassis, power supplies, and other accessories. Further, the company provides server and storage system integration, configuration, and software upgrade and update services; and technical documentation services, as well as identifies service requirements, creates and executes project plans, and conducts verification testing and technical documentation, and training services. Additionally, it offers help desk and on-site product support services for its server and storage systems; and customer support services, including ongoing maintenance and technical support for its products. The company provides its products to enterprise data centers, cloud computing, artificial intelligence, and 5G and edge computing markets. It sells its products through direct and indirect sales force, distributors, value-added resellers, system integrators, and original equipment manufacturers. The company was incorporated in 1993 and is headquartered in San Jose, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"30-01-2025 16:36:21"},{"Company Name":"Advanced Micro Devices, Inc.","Symbol":"AMD","Current Price":"119.85","Latest MA":"144.70","Price Target":169.81767,"Difference from MA":"-17.17%","Difference from Open":"1.16%","Change from Yesterday":"2.08%","Change from Last Report":"2.13","Latest Volume":"2,736,993","Market Cap":"194,493,775,872","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":24.235132,"PB Ratio":3.41346,"ROE":0.03262,"DTE":3.927,"Industry":"Semiconductors","Sector":"Technology","Beta":1.706,"Trailing PEG":0.3245,"Trailing PE":106.06194,"Trailing PS":8.0055065,"Quick Ratio":1.575,"Day High":120.44,"Day Low":118.48,"VS Average Volume":0.075363277,"Company Summary":"Advanced Micro Devices, Inc. operates as a semiconductor company worldwide. It operates through Data Center, Client, Gaming, and Embedded segments. The company offers x86 microprocessors and graphics processing units (GPUs) as an accelerated processing unit, chipsets, data center, and professional GPUs; and embedded processors, and semi-custom system-on-chip (SoC) products, microprocessor and SoC development services and technology, data processing unites, field programmable gate arrays (FPGA), and adaptive SoC products. It provides processors under the AMD Ryzen, AMD Ryzen PRO, Ryzen Threadripper, Ryzen Threadripper PRO, AMD Athlon, AMD Athlon PRO, and AMD PRO A-Series brand names; graphics under the AMD Radeon graphics and AMD Embedded Radeon graphics; and professional graphics under the AMD Radeon Pro graphics brand name. In addition, the company offers data center graphics under the Radeon Instinct and Radeon PRO V-series brands, as well as servers under the AMD Instinct accelerators brand; server microprocessors under the AMD EPYC brands; low power solutions under the AMD Athlon, AMD Geode, AMD Ryzen, AMD EPYC, AMD R-Series, and G-Series brands; FPGA products under the Virtex-6, Virtex-7, Virtex UltraScale+, Kintex-7, Kintex UltraScale, Kintex UltraScale+, Artix-7, Artix UltraScale+, Spartan-6, and Spartan-7 brands; adaptive SOCs under the Zynq-7000, Zynq UltraScale+ MPSoC, Zynq UltraScale+ RFSoCs, Versal HBM, Versal Premium, Versal Prime, Versal AI Core, Versal AI Edge, Vitis, and Vivado brands; and compute and network acceleration board products under the Alveo brand. It serves original equipment and design manufacturers, public cloud service providers, system integrators, independent distributors, and add-in-board manufacturers through its direct sales force, and sales representatives. Advanced Micro Devices, Inc. was incorporated in 1969 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 16:36:21"},{"Company Name":"Palantir Technologies Inc.","Symbol":"PLTR","Current Price":"79.92","Latest MA":"47.78","Price Target":50.36316,"Difference from MA":"67.28%","Difference from Open":"0.03%","Change from Yesterday":"0.14%","Change from Last Report":"0.20","Latest Volume":"3,257,731","Market Cap":"182,059,368,448","Earning Date":"2025-02-03","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":165.99509,"PB Ratio":40.322906,"ROE":0.12409,"DTE":5.552,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":2.697,"Trailing PEG":3.4191,"Trailing PE":399.59998,"Trailing PS":68.796715,"Quick Ratio":5.546,"Day High":80.435,"Day Low":79.6,"VS Average Volume":0.0391342576,"Company Summary":"Palantir Technologies Inc. builds and deploys software platforms for the intelligence community to assist in counterterrorism investigations and operations in the United States, the United Kingdom, and internationally. The company provides Palantir Gotham, a software platform which enables users to identify patterns hidden deep within datasets, ranging from signals intelligence sources to reports from confidential informants, as well as facilitates the handoff between analysts and operational users, helping operators plan and execute real-world responses to threats that have been identified within the platform. It also offers Palantir Foundry, a platform that transforms the ways organizations operate by creating a central operating system for their data; and allows individual users to integrate and analyze the data they need in one place. In addition, it provides Palantir Apollo, a software that delivers software and updates across the business, as well as enables customers to deploy their software virtually in any environment; and Palantir Artificial Intelligence Platform (AIP) that provides unified access to open-source, self-hosted, and commercial large language models (LLM) that can transform structured and unstructured data into LLM-understandable objects and can turn organizations' actions and processes into tools for humans and LLM-driven agents. The company was incorporated in 2003 and is headquartered in Denver, Colorado.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"30-01-2025 16:36:21"}]