[{"Company Name":"RPM International Inc.","Symbol":"RPM","Current Price":"121.74","Latest MA":"121.80","Price Target":135.27429,"Difference from MA":"-0.05%","Difference from Open":"3.17%","Change from Yesterday":"0.95%","Change from Last Report":"0.00","Latest Volume":"1,545,866","Market Cap":"15,668,180,992","Earning Date":"2025-01-07","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":19.798405,"ROE":0.24995,"DTE":89.316,"Industry":"Specialty Chemicals","Sector":"Basic Materials","Beta":0.981,"Trailing PEG":2.1755,"Trailing PE":24.059288,"Trailing PS":2.1486192,"Quick Ratio":1.29,"Day High":123.79,"Day Low":116.825,"VS Average Volume":2.6037304282,"Company Summary":"RPM International Inc. manufactures and sells specialty chemicals for the industrial, specialty, and consumer markets worldwide. It offers waterproofing, coating, and traditional roofing systems; sealants, air barriers, tapes, and foams; residential home weatherization systems; roofing and building maintenance services; sealing and bonding, subfloor preparation, flooring, and glazing solutions; resin flooring systems, polyurethane, MMA waterproof, epoxy floor paint and coatings, concrete repair, and protection products; fire stopping and intumescent steel coating, and manufacturing industry solutions; rolled asphalt roofing materials and chemical admixtures; concrete and masonry admixtures, concrete fibers, curing and sealing compounds, structural grouts and mortars, epoxy adhesives, injection resins, polyurethane foams, floor hardeners and toppings, joint fillers, industrial and architectural coatings, decorative color\/stains\/stamps, and restoration materials; insulated building cladding materials; and concrete form wall systems. It also provides flooring systems; fiberglass reinforced plastic gratings and shapes; corrosion-control coating, containment and railcar lining, fire and sound proofing, and heat and cryogenic insulation products; specialty construction products; amine curing agents, reactive diluents, and epoxy resins; fluorescent colorants and pigments; shellac-based-specialty and marine coatings; fire and water damage restoration, carpet cleaning, and disinfecting products; fuel additives; wood treatments, coatings, and touch-up products; and nail enamels, polishes, and coating components. In addition, it offers solutions for the paint contractors and DIYers, concrete restoration and flooring, metallic and faux finish coatings, cleaners, and hobby paints and cements; and caulks, adhesives, insulating foams, and patches, as well as spackling, glazing, and repair products. The company was incorporated in 1947 and is headquartered in Medina, Ohio.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"08-01-2025 16:37:32"},{"Company Name":"Tesla, Inc.","Symbol":"TSLA","Current Price":"396.95","Latest MA":"268.60","Price Target":295.47287,"Difference from MA":"47.79%","Difference from Open":"0.99%","Change from Yesterday":"0.54%","Change from Last Report":"0.22","Latest Volume":"6,706,368","Market Cap":"1,274,233,356,288","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":122.18809,"ROE":0.20389,"DTE":18.078,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":2.295,"Trailing PEG":4.7836,"Trailing PE":108.16077,"Trailing PS":13.116143,"Quick Ratio":1.214,"Day High":399.25,"Day Low":391.73,"VS Average Volume":0.0716997531,"Company Summary":"Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners; and provision of service and repairs to its energy product customers, including under warranty, as well as various financing options to its solar customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was incorporated in 2003 and is headquartered in Austin, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"08-01-2025 16:37:32"},{"Company Name":"Alibaba Group Holding Limited","Symbol":"BABA","Current Price":"82.98","Latest MA":"86.55","Price Target":120.85936,"Difference from MA":"-4.12%","Difference from Open":"-1.57%","Change from Yesterday":"-1.83%","Change from Last Report":"0.16","Latest Volume":"1,351,020","Market Cap":"197,520,408,576","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":1.1724843,"ROE":0.05668,"DTE":22.796,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":0.349,"Trailing PEG":0.5593,"Trailing PE":17.251976,"Trailing PS":0.20786196,"Quick Ratio":0.97,"Day High":83.24,"Day Low":82.73,"VS Average Volume":0.0888946031,"Company Summary":"Alibaba Group Holding Limited, through its subsidiaries, provides technology infrastructure and marketing reach to help merchants, brands, retailers, and other businesses to engage with their users and customers in the People's Republic of China and internationally. The company operates through seven segments: China Commerce, International Commerce, Local Consumer Services, Cainiao, Cloud, Digital Media and Entertainment, and Innovation Initiatives and Others. It operates Taobao and Tmall, which are digital retail platforms; Alimama, a proprietary monetization platform; 1688.com and Alibaba.com, which are online wholesale marketplaces; AliExpress, a retail marketplace; Lazada, Trendyol, and Daraz that are e-commerce platforms; Freshippo, a retail platform for groceries and fresh goods; and Tmall Global, an import e-commerce platform. The company also operates Cainiao Network logistic services platform; Ele.me, an on-demand delivery and local services platform; Koubei, a restaurant and local services guide platform; and Fliggy, an online travel platform. In addition, it offers pay-for-performance, in-feed, and display marketing services; and Taobao Ad Network and Exchange, a real-time online bidding marketing exchange. Further, the company provides elastic computing, storage, network, security, database, big data, and IoT services; and hardware, software license, software installation, and application development and maintenance services. Additionally, it operates Youku, an online video platform; Quark, a platform for information search, storage, and consumption; Alibaba Pictures and other content platforms that provide online videos, films, live events, news feeds, literature, music, and others; Amap, a mobile digital map, navigation, and real-time traffic information app; DingTalk, a business efficiency mobile app; and Tmall Genie smart speaker. The company was incorporated in 1999 and is based in Hangzhou, the People's Republic of China.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"08-01-2025 16:37:32"},{"Company Name":"Meta Platforms, Inc.","Symbol":"META","Current Price":"613.06","Latest MA":"546.83","Price Target":659.4653,"Difference from MA":"12.11%","Difference from Open":"0.07%","Change from Yesterday":"-0.83%","Change from Last Report":"-0.78","Latest Volume":"1,059,162","Market Cap":"1,547,656,626,176","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":24.109938,"ROE":0.36134,"DTE":29.811,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.215,"Trailing PEG":1.3794,"Trailing PE":28.931435,"Trailing PS":9.906461,"Quick Ratio":2.568,"Day High":614.11,"Day Low":602.79,"VS Average Volume":0.087529268,"Company Summary":"Meta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and wearables worldwide. It operates in two segments, Family of Apps and Reality Labs. The Family of Apps segment offers Facebook, which enables people to share, discuss, discover, and connect with interests; Instagram, a community for sharing photos, videos, and private messages, as well as feed, stories, reels, video, live, and shops; Messenger, a messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls; and WhatsApp, a messaging application that is used by people and businesses to communicate and transact privately. The Reality Labs segment provides augmented and virtual reality related products comprising consumer hardware, software, and content that help people feel connected, anytime, and anywhere. The company was formerly known as Facebook, Inc. and changed its name to Meta Platforms, Inc. in October 2021. The company was incorporated in 2004 and is headquartered in Menlo Park, California","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"08-01-2025 16:37:32"},{"Company Name":"SoFi Technologies, Inc.","Symbol":"SOFI","Current Price":"14.82","Latest MA":"9.89","Price Target":12.1,"Difference from MA":"49.81%","Difference from Open":"1.09%","Change from Yesterday":"-0.57%","Change from Last Report":"0.61","Latest Volume":"2,269,041","Market Cap":"16,082,030,592","Earning Date":"2025-01-27","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":61.11381,"ROE":0.037249997,"DTE":54.394,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.613,"Trailing PEG":null,"Trailing PE":123.50083,"Trailing PS":6.3837566,"Quick Ratio":0.47,"Day High":14.84,"Day Low":14.5514,"VS Average Volume":0.0425234141,"Company Summary":"SoFi Technologies, Inc. provides various financial services in the United States, Latin America, and Canada. It operates through three segments: Lending, Technology Platform, and Financial Services. The company offers lending and financial services and products that allows its members to borrow, save, spend, invest, and protect money. It offers personal loans, student loans, home loans, and related services. The company also operates Galileo, a technology platform that offers services to financial and non-financial institution; and Technisys, a cloud-native digital and core banking platform with financial services customers. In addition, it provides SoFi Money offers checking and savings accounts, debit cards, and cash management products; and SoFi Invest, a mobile-first investment platform that provides access to trading and advisory solutions, such as investing and robo-advisory. Further, the company offers SoFi Credit Card that provides cash backs on every purchase; Sofi Relay, a personal finance management product that allows to track all of their financial accounts comprising credit score and spending behaviors; SoFi Protect, which offers insurance product; SoFi Travel, an application that manages travel search and booking experience; SoFi At Work provides financial benefits to employees, including student loan payments made on their employees' behalf; Lantern Credit, a financial services marketplace platform for seeking alternative products and provide product comparisons; and other lending as a service that offers pre-qualified borrower referrals and sells loans to third-party partner. The company was founded in 2011 and is based in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"08-01-2025 16:37:32"},{"Company Name":"AT&T Inc.","Symbol":"T","Current Price":"21.91","Latest MA":"20.72","Price Target":25.91885,"Difference from MA":"5.76%","Difference from Open":"-2.80%","Change from Yesterday":"-1.31%","Change from Last Report":"0.31","Latest Volume":"3,070,663","Market Cap":"157,210,607,616","Earning Date":"2025-01-27","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":10.056363,"ROE":0.08759,"DTE":125.151,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.73,"Trailing PEG":1.8367,"Trailing PE":17.813007,"Trailing PS":1.2879782,"Quick Ratio":0.42,"Day High":22.14,"Day Low":21.665,"VS Average Volume":0.0900869483,"Company Summary":"AT&T Inc. provides telecommunications and technology services worldwide. The company operates through two segments, Communications and Latin America. The Communications segment offers wireless voice and data communications services; and sells handsets, wireless data cards, wireless computing devices, carrying cases\/protective covers, and wireless chargers through its own company-owned stores, agents, and third-party retail stores. It also provides Virtual Private Networks, AT&T Dedicated Internet, Ethernet, data services, cloud solutions, outsourcing, and managed professional services, as well as customer premises equipment for multinational corporations, small and mid-sized businesses, governmental, and wholesale customers. In addition, this segment offers broadband services, including fiber connections, legacy telephony voice communication services, and other VoIP services and equipment to residential customers. This segment markets its communications services and products under the AT&T, AT&T Business, Cricket, AT&T PREPAID, and AT&T Fiber brand names. The Latin America segment provides postpaid and prepaid wireless services in Mexico under the AT&T and Unefon brand names, as well as sells smartphones through its owned stores, agents and third-party retail stores. The company was formerly known as SBC Communications Inc. and changed its name to AT&T Inc. in 2005. AT&T Inc. was incorporated in 1983 and is based in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"08-01-2025 16:37:32"},{"Company Name":"Verizon Communications Inc.","Symbol":"VZ","Current Price":"38.65","Latest MA":"41.24","Price Target":47.49583,"Difference from MA":"-6.29%","Difference from Open":"-2.67%","Change from Yesterday":"-0.70%","Change from Last Report":"-0.31","Latest Volume":"1,216,316","Market Cap":"162,693,775,360","Earning Date":"2025-01-24","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":8.174039,"ROE":0.10431,"DTE":182.615,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.418,"Trailing PEG":1.0328,"Trailing PE":16.730736,"Trailing PS":1.211989,"Quick Ratio":0.51,"Day High":38.99,"Day Low":38.61,"VS Average Volume":0.0679149042,"Company Summary":"Verizon Communications Inc., through its subsidiaries, engages in the provision of communications, technology, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide. It operates in two segments, Verizon Consumer Group (Consumer) and Verizon Business Group (Business). The Consumer segment provides wireless services across the wireless networks in the United States under the Verizon and TracFone brands and through wholesale and other arrangements; and fixed wireless access (FWA) broadband through its wireless networks, as well as related equipment and devices, such as smartphones, tablets, smart watches, and other wireless-enabled connected devices. The segment also offers wireline services in the Mid-Atlantic and Northeastern United States, as well as Washington D.C. through its fiber-optic network, Verizon Fios product portfolio, and a copper-based network. The Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and conferencing, corporate networking, security and managed network, local and long-distance voice, and network access services to deliver various IoT services and products to businesses, government customers, and wireless and wireline carriers in the United States and internationally. The company was formerly known as Bell Atlantic Corporation and changed its name to Verizon Communications Inc. in June 2000. Verizon Communications Inc. was incorporated in 1983 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"08-01-2025 16:37:32"},{"Company Name":"Intel Corporation","Symbol":"INTC","Current Price":"19.86","Latest MA":"24.37","Price Target":24.29882,"Difference from MA":"-18.52%","Difference from Open":"0.15%","Change from Yesterday":"-0.80%","Change from Last Report":"0.01","Latest Volume":"3,828,945","Market Cap":"85,634,613,248","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":20.350327,"ROE":-0.15597,"DTE":47.906,"Industry":"Semiconductors","Sector":"Technology","Beta":1.026,"Trailing PEG":0.5405,"Trailing PE":"N\/A","Trailing PS":1.5786055,"Quick Ratio":0.833,"Day High":20.01,"Day Low":19.72,"VS Average Volume":0.0555585688,"Company Summary":"Intel Corporation designs, develops, manufactures, markets, and sells computing and related products and services worldwide. It operates through Client Computing Group, Data Center and AI, Network and Edge, Mobileye, and Intel Foundry Services segments. The company's products portfolio comprises central processing units and chipsets, system-on-chips (SoCs), and multichip packages; mobile and desktop processors; hardware products comprising graphics processing units (GPUs), domain-specific accelerators, and field programmable gate arrays (FPGAs); and memory and storage, connectivity and networking, and other semiconductor products. It also offers silicon devices and software products; and optimization solutions for workloads, such as AI, cryptography, security, storage, networking, and leverages various features supporting diverse compute environments. In addition, the company develops and deploys advanced driver assistance systems (ADAS), and autonomous driving technologies and solutions; and provides advanced process technologies backed by an ecosystem of IP, EDA, and design services, as well as systems of chips, including advanced packaging technologies, software and accelerate bring-up, and integration of chips and driving standards. Further, it delivers and deploys intelligent edge platforms that allow developers to achieve agility and drive automation using AI for efficient operations with data integrity, as well as provides hardware and software platforms, tools, and ecosystem partnerships for digital transformation from the cloud to edge. The company serves original equipment manufacturers, original design manufacturers, cloud service providers, and other manufacturers and service providers. It has a strategic agreement with Synopsys, Inc. to develop EDA and IP solutions; and ARM that enables chip designers to build optimized compute SoCs on the Intel 18A process. Intel Corporation was incorporated in 1968 and is headquartered in Santa Clara, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"08-01-2025 16:37:32"},{"Company Name":"American Airlines Group, Inc.","Symbol":"AAL","Current Price":"17.27","Latest MA":"12.51","Price Target":19.05591,"Difference from MA":"38.11%","Difference from Open":"-1.62%","Change from Yesterday":"-2.49%","Change from Last Report":"-2.35","Latest Volume":"1,097,266","Market Cap":"11,351,872,512","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":7.2260265,"ROE":"N\/A","DTE":"N\/A","Industry":"Airlines","Sector":"Industrials","Beta":1.399,"Trailing PEG":0.2153,"Trailing PE":41.13072,"Trailing PS":0.21173732,"Quick Ratio":0.422,"Day High":17.56,"Day Low":17.2,"VS Average Volume":0.0407331103,"Company Summary":"American Airlines Group Inc., through its subsidiaries, operates as a network air carrier. The company provides scheduled air transportation services for passengers and cargo through its hubs in Charlotte, Chicago, Dallas\/Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix, and Washington, D.C., as well as through partner gateways in London, Doha, Madrid, Seattle\/Tacoma, Sydney, and Tokyo. It operates a mainline fleet of 965 aircraft. The company was formerly known as AMR Corporation and changed its name to American Airlines Group Inc. in December 2013. American Airlines Group Inc. was founded in 1926 and is headquartered in Fort Worth, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"08-01-2025 16:37:32"},{"Company Name":"Johnson & Johnson","Symbol":"JNJ","Current Price":"141.60","Latest MA":"154.07","Price Target":172.4291,"Difference from MA":"-8.09%","Difference from Open":"-1.50%","Change from Yesterday":"-3.22%","Change from Last Report":"-3.17","Latest Volume":"1,006,055","Market Cap":"340,919,025,664","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":13.310774,"ROE":0.20889,"DTE":50.958,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.518,"Trailing PEG":0.8766,"Trailing PE":23.404959,"Trailing PS":3.8875093,"Quick Ratio":0.705,"Day High":145.59,"Day Low":141.6,"VS Average Volume":0.1343678558,"Company Summary":"Johnson & Johnson, together with its subsidiaries, researches, develops, manufactures, and sells various products in the healthcare field worldwide. The company's Innovative Medicine segment offers products for various therapeutic areas, such as immunology, including rheumatoid arthritis, psoriatic arthritis, inflammatory bowel disease, and psoriasis; infectious diseases comprising HIV\/AIDS; neuroscience, consisting of mood disorders, neurodegenerative disorders, and schizophrenia; oncology, such as prostate cancer, hematologic malignancies, lung cancer, and bladder cancer; cardiovascular and metabolism, including thrombosis, diabetes, and macular degeneration; and pulmonary hypertension comprising pulmonary arterial hypertension through retailers, wholesalers, distributors, hospitals, and healthcare professionals for prescription use. Its MedTech segment provides Interventional Solutions, including electrophysiology products to treat heart rhythm disorders; the heart recovery portfolio, which includes technologies to treat severe coronary artery disease requiring high-risk PCI or AMI cardiogenic shock; and neurovascular care that treats hemorrhagic and ischemic stroke. this segment also offers an orthopaedics portfolio that includes products and enabling technologies that support hips, knees, trauma, spine, sports, and other; surgery portfolios comprising advanced and general surgery technologies, as well as solutions for breast aesthetics, ear, nose, and throat procedures; contact lenses under the ACUVUE Brand; and TECNIS intraocular lenses for cataract surgery. It distributes its products to wholesalers, hospitals, and retailers, as well as physicians, nurses, hospitals, eye care professionals, and clinics. The company has a collaboration agreement with Stand Up To Cancer for research testing a combination of teclistamab and daratumumab to treat a rare disease AL amyloidosis. Johnson & Johnson was founded in 1886 and is based in New Brunswick, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"08-01-2025 16:37:32"},{"Company Name":"Bank of America Corporation","Symbol":"BAC","Current Price":"45.99","Latest MA":"41.56","Price Target":50.84682,"Difference from MA":"10.68%","Difference from Open":"-0.62%","Change from Yesterday":"-0.21%","Change from Last Report":"0.09","Latest Volume":"3,130,568","Market Cap":"352,914,112,512","Earning Date":"2025-01-16","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":12.403524,"ROE":0.08092,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.325,"Trailing PEG":2.0416,"Trailing PE":16.664854,"Trailing PS":3.7295682,"Quick Ratio":"N\/A","Day High":46.07,"Day Low":45.76,"VS Average Volume":0.0920328586,"Company Summary":"Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. It operates in four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, non-interest and interest-bearing checking accounts, and investment accounts and products; credit and debit cards; residential mortgages, and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research, and certain market-based services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"08-01-2025 16:37:32"},{"Company Name":"Walgreens Boots Alliance, Inc.","Symbol":"WBA","Current Price":"9.36","Latest MA":"10.06","Price Target":10.42857,"Difference from MA":"-6.97%","Difference from Open":"-1.47%","Change from Yesterday":"-3.15%","Change from Last Report":"-0.16","Latest Volume":"1,680,206","Market Cap":"8,082,247,168","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":5.8371215,"ROE":-0.75969005,"DTE":277.898,"Industry":"Pharmaceutical Retailers","Sector":"Healthcare","Beta":0.669,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.054736264,"Quick Ratio":0.332,"Day High":9.55,"Day Low":9.31,"VS Average Volume":0.0712465062,"Company Summary":"Walgreens Boots Alliance, Inc. operates as a healthcare, pharmacy, and retail company in the United States, Germany, the United Kingdom, and internationally. It operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The U.S. Retail Pharmacy segment engages in operation of the retail drugstores, health and wellness services, specialty, and home delivery pharmacy services, which offers health and wellness, beauty, personal care and consumables, and general merchandise. The International segment offers sale of prescription drugs and health and wellness, beauty, personal care, and other consumer products outside the United States; and operates pharmacy-led health and beauty retail businesses under the Boots brand stores in the United Kingdom, the Republic of Ireland, and Thailand, as well as the Benavides brand in Mexico and the Ahumada brand in Chile. The U.S. Healthcare segment provides VillageMD, a national provider of value-based care with primary, multi-specialty, and urgent care providers serving patients in traditional clinic settings, in patients' homes and online appointments; Shields, a specialty pharmacy integrator and accelerator for hospitals; and CareCentrix, a participant in the post-acute and home care management sectors. Walgreens Boots Alliance, Inc. was founded in 1909 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"08-01-2025 16:37:32"}]