[{"Company Name":"Walgreens Boots Alliance, Inc.","Symbol":"WBA","Current Price":"11.41","Latest MA":"10.04","Price Target":10.42857,"Difference from MA":"13.70%","Difference from Open":"7.69%","Change from Yesterday":"23.70%","Change from Last Report":"0.13","Latest Volume":"24,675,203","Market Cap":"9,852,397,568","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":7.115551,"ROE":-0.75969005,"DTE":277.898,"Industry":"Pharmaceutical Retailers","Sector":"Healthcare","Beta":0.669,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.06672444,"Quick Ratio":0.332,"Day High":11.49,"Day Low":10.5,"VS Average Volume":1.0379131081,"Company Summary":"Walgreens Boots Alliance, Inc. operates as a healthcare, pharmacy, and retail company in the United States, Germany, the United Kingdom, and internationally. It operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The U.S. Retail Pharmacy segment engages in operation of the retail drugstores, health and wellness services, specialty, and home delivery pharmacy services, which offers health and wellness, beauty, personal care and consumables, and general merchandise. The International segment offers sale of prescription drugs and health and wellness, beauty, personal care, and other consumer products outside the United States; and operates pharmacy-led health and beauty retail businesses under the Boots brand stores in the United Kingdom, the Republic of Ireland, and Thailand, as well as the Benavides brand in Mexico and the Ahumada brand in Chile. The U.S. Healthcare segment provides VillageMD, a national provider of value-based care with primary, multi-specialty, and urgent care providers serving patients in traditional clinic settings, in patients' homes and online appointments; Shields, a specialty pharmacy integrator and accelerator for hospitals; and CareCentrix, a participant in the post-acute and home care management sectors. Walgreens Boots Alliance, Inc. was founded in 1909 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"Delta Air Lines, Inc.","Symbol":"DAL","Current Price":"68.12","Latest MA":"51.40","Price Target":77.06455,"Difference from MA":"32.53%","Difference from Open":"4.82%","Change from Yesterday":"10.90%","Change from Last Report":"-1.05","Latest Volume":"7,531,821","Market Cap":"43,956,543,488","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":9.1537,"ROE":0.4067,"DTE":186.78,"Industry":"Airlines","Sector":"Industrials","Beta":1.341,"Trailing PEG":null,"Trailing PE":9.447989,"Trailing PS":0.72887963,"Quick Ratio":0.268,"Day High":68.99,"Day Low":64.5101,"VS Average Volume":0.9576101236,"Company Summary":"Delta Air Lines, Inc. provides scheduled air transportation for passengers and cargo in the United States and internationally. The company operates through two segments, Airline and Refinery. Its domestic network centered on core hubs in Atlanta, Minneapolis-St. Paul, Detroit, and Salt Lake City, as well as coastal hub positions in Boston, Los Angeles, New York-LaGuardia, New York-JFK, and Seattle; and international network centered on hubs and market presence in Amsterdam, Bogota, Lima, Mexico City, London-Heathrow, Paris-Charles de Gaulle, Sao Paulo, Seoul-Incheon, and Tokyo. The company sells its tickets through various distribution channels, including delta.com and the Fly Delta app; acts as a reservations specialists; and operates online travel and traditional brick and mortar agencies. It also provides aircraft maintenance and engineering support, repair, and overhaul services; and vacation packages to third-party consumers. The company operates through a fleet of approximately 1,273 aircrafts. Delta Air Lines, Inc. was founded in 1924 and is based in Atlanta, Georgia.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"Exxon Mobil Corporation","Symbol":"XOM","Current Price":"108.63","Latest MA":"114.46","Price Target":129.9376,"Difference from MA":"-5.09%","Difference from Open":"-0.06%","Change from Yesterday":"1.52%","Change from Last Report":"0.03","Latest Volume":"2,015,918","Market Cap":"477,438,607,360","Earning Date":"2025-01-31","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":13.236456,"ROE":0.14513999,"DTE":15.394,"Industry":"Oil & Gas Integrated","Sector":"Energy","Beta":0.88,"Trailing PEG":5.4022,"Trailing PE":13.52802,"Trailing PS":1.3886375,"Quick Ratio":0.978,"Day High":110.1,"Day Low":108.44,"VS Average Volume":0.1377515948,"Company Summary":"Exxon Mobil Corporation engages in the exploration and production of crude oil and natural gas in the United States and internationally. It operates through Upstream, Energy Products, Chemical Products, and Specialty Products segments. The Upstream segment explores for and produces crude oil and natural gas. The Energy Products segment offers fuels, aromatics, and catalysts, as well as licensing services. It sells its products under the Exxon, Esso, and Mobil brands. The Chemical Products segment manufactures and markets petrochemicals including olefins, polyolefins, and intermediates. The Specialty Products segment offers performance products, including lubricants, basestocks, waxes, synthetics, elastomers, and resins. The company also involves in the manufacturing, trade, transport, and sale of crude oil, natural gas, petroleum products, petrochemicals, and other specialty products; and pursuit lower-emission business opportunities, including carbon capture and storage, hydrogen, lower-emission fuels, and lithium. Exxon Mobil Corporation was founded in 1870 and is based in Spring, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"Chevron Corporation","Symbol":"CVX","Current Price":"153.55","Latest MA":"149.66","Price Target":175.49565,"Difference from MA":"2.60%","Difference from Open":"0.09%","Change from Yesterday":"2.10%","Change from Last Report":"0.17","Latest Volume":"1,591,093","Market Cap":"273,767,366,656","Earning Date":"2025-01-31","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":13.425841,"ROE":0.103520006,"DTE":16.456,"Industry":"Oil & Gas Integrated","Sector":"Energy","Beta":1.078,"Trailing PEG":3.1944,"Trailing PE":16.892189,"Trailing PS":1.4281851,"Quick Ratio":0.675,"Day High":154.34,"Day Low":152.85,"VS Average Volume":0.2041789432,"Company Summary":"Chevron Corporation, through its subsidiaries, engages in the integrated energy and chemicals operations in the United States and internationally. The company operates in two segments, Upstream and Downstream. The Upstream segment is involved in the exploration, development, production, and transportation of crude oil and natural gas; processing, liquefaction, transportation, and regasification of liquefied natural gas; transportation of crude oil through pipelines; transportation, storage, and marketing of natural gas; and carbon capture and storage, as well as a gas-to-liquids plant. The Downstream segment refines crude oil into petroleum products; markets crude oil, refined products, and lubricants; manufactures and markets renewable fuels, commodity petrochemicals, plastics for industrial uses, and fuel and lubricant additives; and transports crude oil and refined products by pipeline, marine vessel, motor equipment, and rail car. The company was formerly known as ChevronTexaco Corporation and changed its name to Chevron Corporation in 2005. Chevron Corporation was founded in 1879 and is headquartered in San Ramon, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"Intel Corporation","Symbol":"INTC","Current Price":"19.30","Latest MA":"24.29","Price Target":24.26941,"Difference from MA":"-20.55%","Difference from Open":"-1.48%","Change from Yesterday":"-2.97%","Change from Last Report":"-0.31","Latest Volume":"8,370,169","Market Cap":"83,240,894,464","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":19.794668,"ROE":-0.15597,"DTE":47.906,"Industry":"Semiconductors","Sector":"Technology","Beta":1.026,"Trailing PEG":0.5369,"Trailing PE":"N\/A","Trailing PS":1.5344793,"Quick Ratio":0.833,"Day High":19.6,"Day Low":19.26,"VS Average Volume":0.1206680574,"Company Summary":"Intel Corporation designs, develops, manufactures, markets, and sells computing and related products and services worldwide. It operates through Client Computing Group, Data Center and AI, Network and Edge, Mobileye, and Intel Foundry Services segments. The company's products portfolio comprises central processing units and chipsets, system-on-chips (SoCs), and multichip packages; mobile and desktop processors; hardware products comprising graphics processing units (GPUs), domain-specific accelerators, and field programmable gate arrays (FPGAs); and memory and storage, connectivity and networking, and other semiconductor products. It also offers silicon devices and software products; and optimization solutions for workloads, such as AI, cryptography, security, storage, networking, and leverages various features supporting diverse compute environments. In addition, the company develops and deploys advanced driver assistance systems (ADAS), and autonomous driving technologies and solutions; and provides advanced process technologies backed by an ecosystem of IP, EDA, and design services, as well as systems of chips, including advanced packaging technologies, software and accelerate bring-up, and integration of chips and driving standards. Further, it delivers and deploys intelligent edge platforms that allow developers to achieve agility and drive automation using AI for efficient operations with data integrity, as well as provides hardware and software platforms, tools, and ecosystem partnerships for digital transformation from the cloud to edge. The company serves original equipment manufacturers, original design manufacturers, cloud service providers, and other manufacturers and service providers. It has a strategic agreement with Synopsys, Inc. to develop EDA and IP solutions; and ARM that enables chip designers to build optimized compute SoCs on the Intel 18A process. Intel Corporation was incorporated in 1968 and is headquartered in Santa Clara, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"Apple Inc.","Symbol":"AAPL","Current Price":"238.06","Latest MA":"227.52","Price Target":247.925,"Difference from MA":"4.63%","Difference from Open":"-0.82%","Change from Yesterday":"-1.90%","Change from Last Report":"-0.36","Latest Volume":"6,728,831","Market Cap":"3,598,467,203,072","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":28.665903,"ROE":1.5741299,"DTE":209.059,"Industry":"Consumer Electronics","Sector":"Technology","Beta":1.24,"Trailing PEG":2.2117,"Trailing PE":39.09031,"Trailing PS":9.202417,"Quick Ratio":0.745,"Day High":240.15,"Day Low":237.93,"VS Average Volume":0.1509473626,"Company Summary":"Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod. It also provides AppleCare support and cloud services; and operates various platforms, including the App Store that allow customers to discover and download applications and digital content, such as books, music, video, games, and podcasts, as well as advertising services include third-party licensing arrangements and its own advertising platforms. In addition, the company offers various subscription-based services, such as Apple Arcade, a game subscription service; Apple Fitness+, a personalized fitness service; Apple Music, which offers users a curated listening experience with on-demand radio stations; Apple News+, a subscription news and magazine service; Apple TV+, which offers exclusive original content; Apple Card, a co-branded credit card; and Apple Pay, a cashless payment service, as well as licenses its intellectual property. The company serves consumers, and small and mid-sized businesses; and the education, enterprise, and government markets. It distributes third-party applications for its products through the App Store. The company also sells its products through its retail and online stores, and direct sales force; and third-party cellular network carriers, wholesalers, retailers, and resellers. Apple Inc. was founded in 1976 and is headquartered in Cupertino, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"Comcast Corporation","Symbol":"CMCSA","Current Price":"37.03","Latest MA":"39.60","Price Target":47.84536,"Difference from MA":"-6.47%","Difference from Open":"0.66%","Change from Yesterday":"-0.36%","Change from Last Report":"-0.20","Latest Volume":"4,995,023","Market Cap":"141,715,914,752","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":8.467775,"ROE":0.16884,"DTE":117.127,"Industry":"Telecom Services","Sector":"Communication Services","Beta":1.004,"Trailing PEG":1.1533,"Trailing PE":9.98248,"Trailing PS":1.1515067,"Quick Ratio":0.605,"Day High":37.165,"Day Low":36.792,"VS Average Volume":0.2513288164,"Company Summary":"Comcast Corporation operates as a media and technology company worldwide. It operates through Residential Connectivity & Platforms, Business Services Connectivity, Media, Studios, and Theme Parks segments. The Residential Connectivity & Platforms segment provides residential broadband and wireless connectivity services, residential and business video services, sky-branded entertainment television networks, and advertising. The Business Services Connectivity segment offers connectivity services for small business locations, which include broadband, wireline voice, and wireless services, as well as solutions for medium-sized customers and larger enterprises; and small business connectivity services in the United Kingdom. The Media segment operates NBCUniversal's television and streaming business, including national and regional cable networks; the NBC and Telemundo broadcast networks and owned local broadcast television stations; and Peacock, a direct-to-consumer streaming services. It also operates international television networks comprising the Sky Sports networks, as well as other digital properties. The Studios segment operates NBCUniversal and Sky film and television studio production and distribution operations. The Theme Parks segment operates Universal theme parks in Orlando, Florida; Hollywood, California; Osaka, Japan; and Beijing, China. The company also offers a consolidated streaming platforms under the Philadelphia Flyers and the Wells Fargo Center arena in Philadelphia, Pennsylvania; and Xumo. Comcast Corporation was founded in 1963 and is headquartered in Philadelphia, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"Southwest Airlines Company","Symbol":"LUV","Current Price":"33.38","Latest MA":"29.57","Price Target":32.40095,"Difference from MA":"12.89%","Difference from Open":"1.00%","Change from Yesterday":"1.55%","Change from Last Report":"1.52","Latest Volume":"1,050,922","Market Cap":"20,019,222,528","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":19.94944,"ROE":-0.00447,"DTE":87.36,"Industry":"Airlines","Sector":"Industrials","Beta":1.153,"Trailing PEG":0.4936,"Trailing PE":"N\/A","Trailing PS":0.73126906,"Quick Ratio":0.783,"Day High":33.58,"Day Low":32.72,"VS Average Volume":0.1549578774,"Company Summary":"Southwest Airlines Co. operates as a passenger airline company that provides scheduled air transportation services in the United States and near-international markets. As of December 31, 2023, the company operated a total fleet of 817 Boeing 737 aircraft; and served 121 destinations in 42 states, the District of Columbia, and the Commonwealth of Puerto Rico, as well as ten near-international countries, including Mexico, Jamaica, the Bahamas, Aruba, the Dominican Republic, Costa Rica, Belize, Cuba, the Cayman Islands, and Turks and Caicos. It also provides inflight entertainment and connectivity services on Wi-Fi enabled aircraft; and Rapid Rewards loyalty program that enables program members to earn points for dollars spent on Southwest base fares. In addition, the company offers a suite of digital platforms to support customers' travel needs, including websites and apps; and SWABIZ, an online booking tool. Further, it provides ancillary services, such as Southwest's EarlyBird Check-In, upgraded boarding, and transportation of pets and unaccompanied minors. Southwest Airlines Co. was incorporated in 1967 and is headquartered in Dallas, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"Ford Motor Company","Symbol":"F","Current Price":"9.76","Latest MA":"10.95","Price Target":11.89375,"Difference from MA":"-10.91%","Difference from Open":"0.88%","Change from Yesterday":"0.15%","Change from Last Report":"-0.19","Latest Volume":"6,173,896","Market Cap":"38,769,197,056","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":5.4223666,"ROE":0.0799,"DTE":359.359,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":1.636,"Trailing PEG":0.8451,"Trailing PE":11.085227,"Trailing PS":0.21215147,"Quick Ratio":0.942,"Day High":9.78,"Day Low":9.59,"VS Average Volume":0.1084157311,"Company Summary":"Ford Motor Company develops, delivers, and services a range of Ford trucks, commercial cars and vans, sport utility vehicles, and Lincoln luxury vehicles worldwide. It operates through Ford Blue, Ford Model e, and Ford Pro; Ford Next; and Ford Credit segments. The company sells Ford and Lincoln vehicles, service parts, and accessories through distributors and dealers, as well as through dealerships to commercial fleet customers, daily rental car companies, and governments. It also engages in vehicle-related financing and leasing activities to and through automotive dealers. In addition, the company provides retail installment sale contracts for new and used vehicles; and direct financing leases for new vehicles to retail and commercial customers, such as leasing companies, government entities, daily rental companies, and fleet customers. Further, it offers wholesale loans to dealers to finance the purchase of vehicle inventory; and loans to dealers to finance working capital and enhance dealership facilities, purchase dealership real estate, and other dealer vehicle programs. The company was incorporated in 1903 and is based in Dearborn, Michigan.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"Unity Software Inc.","Symbol":"U","Current Price":"21.75","Latest MA":"19.59","Price Target":22.5087,"Difference from MA":"11.06%","Difference from Open":"-2.51%","Change from Yesterday":"-5.45%","Change from Last Report":"-1.58","Latest Volume":"1,200,609","Market Cap":"8,762,091,520","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":27.637962,"ROE":-0.23091999,"DTE":68.801,"Industry":"Software - Application","Sector":"Technology","Beta":2.291,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":4.4581175,"Quick Ratio":2.26,"Day High":22.3376,"Day Low":21.7,"VS Average Volume":0.1098879666,"Company Summary":"Unity Software Inc. operates a platform that provides real-time 3D content and experiences. Its platform provides artificial intelligence solutions that support creators in building, running, and growing immersive, real-time 2D and 3D content for mobile phones, tablets, PCs, consoles, and augmented and virtual reality devices. The company also offers Create Solutions, a set of tools and services used to build, ship, and run real-time 2D and 3D content; and Grow Solutions, which allows customers to grow and engage their user base and monetize their content. It serves enterprises, mid-market companies, and government and non-profit institutions; mid-sized, small, and independent businesses; and individuals across various industries. The company offers its solutions directly through its online store, field sales operations, independent distributors, and resellers in North America, Denmark, China, Finland, the United Kingdom, Germany, Israel, Japan, Singapore, South Korea, Spain, and internationally. Unity Software Inc. was founded in 2004 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"Altria Group, Inc.","Symbol":"MO","Current Price":"51.54","Latest MA":"49.88","Price Target":56.80333,"Difference from MA":"3.32%","Difference from Open":"0.76%","Change from Yesterday":"0.08%","Change from Last Report":"0.01","Latest Volume":"1,738,106","Market Cap":"87,350,509,568","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":9.631107,"ROE":"N\/A","DTE":"N\/A","Industry":"Tobacco","Sector":"Consumer Defensive","Beta":0.67,"Trailing PEG":3.6016,"Trailing PE":8.706081,"Trailing PS":4.2898784,"Quick Ratio":0.274,"Day High":51.7,"Day Low":51.03,"VS Average Volume":0.231131701,"Company Summary":"Altria Group, Inc., through its subsidiaries, manufactures and sells smokeable and oral tobacco products in the United States. The company offers cigarettes primarily under the Marlboro brand; large cigars and pipe tobacco under the Black & Mild brand; moist smokeless tobacco and snus products under the Copenhagen, Skoal, Red Seal, and Husky brands; oral nicotine pouches under the on! brand; and e-vapor products under the NJOY ACE brand. It sells its products to distributors, as well as large retail organizations, such as chain stores. The company was founded in 1822 and is headquartered in Richmond, Virginia.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"Amazon.com, Inc.","Symbol":"AMZN","Current Price":"218.00","Latest MA":"194.01","Price Target":241.71407,"Difference from MA":"12.36%","Difference from Open":"-1.56%","Change from Yesterday":"-1.86%","Change from Last Report":"-0.48","Latest Volume":"4,979,929","Market Cap":"2,292,217,544,704","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":35.317017,"ROE":0.22558,"DTE":61.175,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":1.146,"Trailing PEG":1.8211,"Trailing PE":46.48081,"Trailing PS":3.696362,"Quick Ratio":0.827,"Day High":221.71,"Day Low":217.61,"VS Average Volume":0.1324542096,"Company Summary":"Amazon.com, Inc. engages in the retail sale of consumer products, advertising, and subscriptions service through online and physical stores in North America and internationally. The company operates through three segments: North America, International, and Amazon Web Services (AWS). It also manufactures and sells electronic devices, including Kindle, Fire tablets, Fire TVs, Echo, Ring, Blink, and eero; and develops and produces media content. In addition, the company offers programs that enable sellers to sell their products in its stores; and programs that allow authors, independent publishers, musicians, filmmakers, Twitch streamers, skill and app developers, and others to publish and sell content. Further, it provides compute, storage, database, analytics, machine learning, and other services, as well as advertising services through programs, such as sponsored ads, display, and video advertising. Additionally, the company offers Amazon Prime, a membership program. The company's products offered through its stores include merchandise and content purchased for resale and products offered by third-party sellers. It serves consumers, sellers, developers, enterprises, content creators, advertisers, and employees. Amazon.com, Inc. was incorporated in 1994 and is headquartered in Seattle, Washington.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"Tesla, Inc.","Symbol":"TSLA","Current Price":"390.00","Latest MA":"270.02","Price Target":295.52048,"Difference from MA":"44.43%","Difference from Open":"-0.31%","Change from Yesterday":"-1.23%","Change from Last Report":"-1.70","Latest Volume":"10,378,210","Market Cap":"1,251,923,722,240","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":119.915535,"ROE":0.20389,"DTE":18.078,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":2.295,"Trailing PEG":4.7906,"Trailing PE":107.43804,"Trailing PS":12.886502,"Quick Ratio":1.214,"Day High":399.25,"Day Low":388.9001,"VS Average Volume":0.1106187102,"Company Summary":"Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners; and provision of service and repairs to its energy product customers, including under warranty, as well as various financing options to its solar customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was incorporated in 2003 and is headquartered in Austin, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"Microsoft Corporation","Symbol":"MSFT","Current Price":"419.16","Latest MA":"427.28","Price Target":508.4636,"Difference from MA":"-1.90%","Difference from Open":"-1.28%","Change from Yesterday":"-1.29%","Change from Last Report":"-0.36","Latest Volume":"2,109,066","Market Cap":"3,116,404,310,016","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":27.922815,"ROE":0.35604,"DTE":33.657,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.904,"Trailing PEG":2.2287,"Trailing PE":34.641323,"Trailing PS":12.260138,"Quick Ratio":1.163,"Day High":424.695,"Day Low":418.63,"VS Average Volume":0.1010793247,"Company Summary":"Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services. This segment also provides LinkedIn; and dynamics business solutions, including Dynamics 365, a set of intelligent, cloud-based applications across ERP, CRM, power apps, and power automate; and on-premises ERP and CRM applications. The Intelligent Cloud segment offers server products and cloud services, such as azure and other cloud services; SQL and windows server, visual studio, system center, and related client access licenses, as well as nuance and GitHub; and enterprise services including enterprise support services, industry solutions, and nuance professional services. The More Personal Computing segment offers Windows, including windows OEM licensing and other non-volume licensing of the Windows operating system; Windows commercial comprising volume licensing of the Windows operating system, windows cloud services, and other Windows commercial offerings; patent licensing; and windows Internet of Things; and devices, such as surface, HoloLens, and PC accessories. Additionally, this segment provides gaming, which includes Xbox hardware and content, and first- and third-party content; Xbox game pass and other subscriptions, cloud gaming, advertising, third-party disc royalties, and other cloud services; and search and news advertising, which includes Bing, Microsoft News and Edge, and third-party affiliates. The company sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online, and retail stores. The company was founded in 1975 and is headquartered in Redmond, Washington.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"Meta Platforms, Inc.","Symbol":"META","Current Price":"604.47","Latest MA":"547.56","Price Target":660.73193,"Difference from MA":"10.39%","Difference from Open":"-0.91%","Change from Yesterday":"-1.07%","Change from Last Report":"-0.43","Latest Volume":"1,683,076","Market Cap":"1,525,978,365,952","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":23.7973,"ROE":0.36134,"DTE":29.811,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.215,"Trailing PEG":1.3634,"Trailing PE":28.52619,"Trailing PS":9.767699,"Quick Ratio":2.568,"Day High":615.685,"Day Low":602.64,"VS Average Volume":0.1381662578,"Company Summary":"Meta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and wearables worldwide. It operates in two segments, Family of Apps and Reality Labs. The Family of Apps segment offers Facebook, which enables people to share, discuss, discover, and connect with interests; Instagram, a community for sharing photos, videos, and private messages, as well as feed, stories, reels, video, live, and shops; Messenger, a messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls; and WhatsApp, a messaging application that is used by people and businesses to communicate and transact privately. The Reality Labs segment provides augmented and virtual reality related products comprising consumer hardware, software, and content that help people feel connected, anytime, and anywhere. The company was formerly known as Facebook, Inc. and changed its name to Meta Platforms, Inc. in October 2021. The company was incorporated in 2004 and is headquartered in Menlo Park, California","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"Alibaba Group Holding Limited","Symbol":"BABA","Current Price":"81.53","Latest MA":"86.57","Price Target":121.16899,"Difference from MA":"-5.82%","Difference from Open":"-0.87%","Change from Yesterday":"-2.60%","Change from Last Report":"0.10","Latest Volume":"2,916,824","Market Cap":"193,983,643,648","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":1.1480563,"ROE":0.05668,"DTE":22.796,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":0.349,"Trailing PEG":0.5541,"Trailing PE":16.985998,"Trailing PS":0.20414001,"Quick Ratio":0.97,"Day High":82.18,"Day Low":81.15,"VS Average Volume":0.1969446153,"Company Summary":"Alibaba Group Holding Limited, through its subsidiaries, provides technology infrastructure and marketing reach to help merchants, brands, retailers, and other businesses to engage with their users and customers in the People's Republic of China and internationally. The company operates through seven segments: China Commerce, International Commerce, Local Consumer Services, Cainiao, Cloud, Digital Media and Entertainment, and Innovation Initiatives and Others. It operates Taobao and Tmall, which are digital retail platforms; Alimama, a proprietary monetization platform; 1688.com and Alibaba.com, which are online wholesale marketplaces; AliExpress, a retail marketplace; Lazada, Trendyol, and Daraz that are e-commerce platforms; Freshippo, a retail platform for groceries and fresh goods; and Tmall Global, an import e-commerce platform. The company also operates Cainiao Network logistic services platform; Ele.me, an on-demand delivery and local services platform; Koubei, a restaurant and local services guide platform; and Fliggy, an online travel platform. In addition, it offers pay-for-performance, in-feed, and display marketing services; and Taobao Ad Network and Exchange, a real-time online bidding marketing exchange. Further, the company provides elastic computing, storage, network, security, database, big data, and IoT services; and hardware, software license, software installation, and application development and maintenance services. Additionally, it operates Youku, an online video platform; Quark, a platform for information search, storage, and consumption; Alibaba Pictures and other content platforms that provide online videos, films, live events, news feeds, literature, music, and others; Amap, a mobile digital map, navigation, and real-time traffic information app; DingTalk, a business efficiency mobile app; and Tmall Genie smart speaker. The company was incorporated in 1999 and is based in Hangzhou, the People's Republic of China.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"SoFi Technologies, Inc.","Symbol":"SOFI","Current Price":"14.01","Latest MA":"9.94","Price Target":12.1,"Difference from MA":"40.92%","Difference from Open":"-1.93%","Change from Yesterday":"-3.71%","Change from Last Report":"-0.85","Latest Volume":"6,708,147","Market Cap":"15,197,524,992","Earning Date":"2025-01-27","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":57.752575,"ROE":0.037249997,"DTE":54.394,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.613,"Trailing PEG":null,"Trailing PE":116.708336,"Trailing PS":6.032653,"Quick Ratio":0.47,"Day High":14.2799,"Day Low":13.87,"VS Average Volume":0.1255880257,"Company Summary":"SoFi Technologies, Inc. provides various financial services in the United States, Latin America, and Canada. It operates through three segments: Lending, Technology Platform, and Financial Services. The company offers lending and financial services and products that allows its members to borrow, save, spend, invest, and protect money. It offers personal loans, student loans, home loans, and related services. The company also operates Galileo, a technology platform that offers services to financial and non-financial institution; and Technisys, a cloud-native digital and core banking platform with financial services customers. In addition, it provides SoFi Money offers checking and savings accounts, debit cards, and cash management products; and SoFi Invest, a mobile-first investment platform that provides access to trading and advisory solutions, such as investing and robo-advisory. Further, the company offers SoFi Credit Card that provides cash backs on every purchase; Sofi Relay, a personal finance management product that allows to track all of their financial accounts comprising credit score and spending behaviors; SoFi Protect, which offers insurance product; SoFi Travel, an application that manages travel search and booking experience; SoFi At Work provides financial benefits to employees, including student loan payments made on their employees' behalf; Lantern Credit, a financial services marketplace platform for seeking alternative products and provide product comparisons; and other lending as a service that offers pre-qualified borrower referrals and sells loans to third-party partner. The company was founded in 2011 and is based in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"Verizon Communications Inc.","Symbol":"VZ","Current Price":"38.09","Latest MA":"41.23","Price Target":47.5375,"Difference from MA":"-7.61%","Difference from Open":"-0.22%","Change from Yesterday":"-2.18%","Change from Last Report":"-0.18","Latest Volume":"2,651,247","Market Cap":"160,365,854,720","Earning Date":"2025-01-24","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":8.058631,"ROE":0.10431,"DTE":182.615,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.418,"Trailing PEG":1.0334,"Trailing PE":16.491343,"Trailing PS":1.1946472,"Quick Ratio":0.51,"Day High":38.23,"Day Low":37.945,"VS Average Volume":0.145916392,"Company Summary":"Verizon Communications Inc., through its subsidiaries, engages in the provision of communications, technology, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide. It operates in two segments, Verizon Consumer Group (Consumer) and Verizon Business Group (Business). The Consumer segment provides wireless services across the wireless networks in the United States under the Verizon and TracFone brands and through wholesale and other arrangements; and fixed wireless access (FWA) broadband through its wireless networks, as well as related equipment and devices, such as smartphones, tablets, smart watches, and other wireless-enabled connected devices. The segment also offers wireline services in the Mid-Atlantic and Northeastern United States, as well as Washington D.C. through its fiber-optic network, Verizon Fios product portfolio, and a copper-based network. The Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and conferencing, corporate networking, security and managed network, local and long-distance voice, and network access services to deliver various IoT services and products to businesses, government customers, and wireless and wireline carriers in the United States and internationally. The company was formerly known as Bell Atlantic Corporation and changed its name to Verizon Communications Inc. in June 2000. Verizon Communications Inc. was incorporated in 1983 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"AT&T Inc.","Symbol":"T","Current Price":"21.95","Latest MA":"20.75","Price Target":25.91885,"Difference from MA":"5.81%","Difference from Open":"0.32%","Change from Yesterday":"-1.02%","Change from Last Report":"-0.07","Latest Volume":"3,493,533","Market Cap":"157,497,622,528","Earning Date":"2025-01-27","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":10.074723,"ROE":0.08759,"DTE":125.151,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.73,"Trailing PEG":1.835,"Trailing PE":17.84553,"Trailing PS":1.2903296,"Quick Ratio":0.42,"Day High":22.04,"Day Low":21.789,"VS Average Volume":0.1017338001,"Company Summary":"AT&T Inc. provides telecommunications and technology services worldwide. The company operates through two segments, Communications and Latin America. The Communications segment offers wireless voice and data communications services; and sells handsets, wireless data cards, wireless computing devices, carrying cases\/protective covers, and wireless chargers through its own company-owned stores, agents, and third-party retail stores. It also provides Virtual Private Networks, AT&T Dedicated Internet, Ethernet, data services, cloud solutions, outsourcing, and managed professional services, as well as customer premises equipment for multinational corporations, small and mid-sized businesses, governmental, and wholesale customers. In addition, this segment offers broadband services, including fiber connections, legacy telephony voice communication services, and other VoIP services and equipment to residential customers. This segment markets its communications services and products under the AT&T, AT&T Business, Cricket, AT&T PREPAID, and AT&T Fiber brand names. The Latin America segment provides postpaid and prepaid wireless services in Mexico under the AT&T and Unefon brand names, as well as sells smartphones through its owned stores, agents and third-party retail stores. The company was formerly known as SBC Communications Inc. and changed its name to AT&T Inc. in 2005. AT&T Inc. was incorporated in 1983 and is based in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"NextEra Energy, Inc.","Symbol":"NEE","Current Price":"69.43","Latest MA":"76.50","Price Target":86.64545,"Difference from MA":"-9.24%","Difference from Open":"-0.80%","Change from Yesterday":"-1.80%","Change from Last Report":"0.04","Latest Volume":"1,399,372","Market Cap":"142,775,844,864","Earning Date":"2025-01-24","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":18.874952,"ROE":0.09887999,"DTE":139.015,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.561,"Trailing PEG":2.8776,"Trailing PE":20.602375,"Trailing PS":5.4399085,"Quick Ratio":0.258,"Day High":70.07,"Day Low":69.34,"VS Average Volume":0.1388441219,"Company Summary":"NextEra Energy, Inc., through its subsidiaries, generates, transmits, distributes, and sells electric power to retail and wholesale customers in North America. The company generates electricity through wind, solar, nuclear,natural gas, and other clean energy. It also develops, constructs, and operates long-term contracted assets that consists of clean energy solutions, such as renewable generation facilities, battery storage projects, and electric transmission facilities; sells energy commodities; and owns, develops, constructs, manages and operates electric generation facilities in wholesale energy markets. The company had approximately 33,276 megawatts of net generating capacity; approximately 90,000 circuit miles of transmission and distribution lines; and 883 substations. It serves approximately 12 million people through approximately 5.9 million customer accounts in the east and lower west coasts of Florida. The company was formerly known as FPL Group, Inc. and changed its name to NextEra Energy, Inc. in 2010. NextEra Energy, Inc. was founded in 1925 and is headquartered in Juno Beach, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"Mobileye Global Inc.","Symbol":"MBLY","Current Price":"15.52","Latest MA":"17.98","Price Target":20.22852,"Difference from MA":"-13.68%","Difference from Open":"-2.64%","Change from Yesterday":"-8.39%","Change from Last Report":"-3.25","Latest Volume":"2,046,154","Market Cap":"12,586,572,800","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":36.962963,"ROE":-0.21936001,"DTE":0.439,"Industry":"Auto Parts","Sector":"Consumer Cyclical","Beta":0.059,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":6.988658,"Quick Ratio":4.215,"Day High":16.37,"Day Low":15.51,"VS Average Volume":0.289374736,"Company Summary":"Mobileye Global Inc. develops and deploys advanced driver assistance systems (ADAS) and autonomous driving technologies and solutions worldwide. The company operates through Mobileye and Other segments. It offers Driver Assist comprising ADAS and autonomous vehicle solutions that covers safety features, such as real-time detection of road users, geometry, semantics, and markings to provide safety alerts and emergency interventions; Cloud-Enhanced Driver Assist, a solution for drivers with interpretations of a scene in real-time; Mobileye SuperVision Lite, a navigation and assisted driving solution; and Mobileye SuperVision, an operational point-to-point assisted driving navigation solution on various road types and includes cloud-based enhancements, such as road experience management. The company also provides Mobileye Chauffeur, a first-generation solution for eyes-off\/hands-off driving with a human driver still in the driver's seat; Mobileye Drive, a self-driving system comprising of radar and lidar subsystems, as well as collision avoidance systems, including Mobileye 8 Connect for light and medium-duty vehicles, and Mobileye Shield+ for large vehicles. It serves original equipment manufacturers. The company was founded in 1999 and is headquartered in Jerusalem, Israel. Mobileye Global Inc. operates as a subsidiary of Intel Overseas Funding Corporation.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"American Airlines Group, Inc.","Symbol":"AAL","Current Price":"18.32","Latest MA":"12.55","Price Target":19.73773,"Difference from MA":"45.96%","Difference from Open":"2.20%","Change from Yesterday":"4.09%","Change from Last Report":"-0.24","Latest Volume":"10,904,939","Market Cap":"12,041,926,656","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":7.381375,"ROE":"N\/A","DTE":"N\/A","Industry":"Airlines","Sector":"Industrials","Beta":1.399,"Trailing PEG":0.2142,"Trailing PE":43.630955,"Trailing PS":0.22460835,"Quick Ratio":0.422,"Day High":18.45,"Day Low":17.8,"VS Average Volume":0.4074531272,"Company Summary":"American Airlines Group Inc., through its subsidiaries, operates as a network air carrier. The company provides scheduled air transportation services for passengers and cargo through its hubs in Charlotte, Chicago, Dallas\/Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix, and Washington, D.C., as well as through partner gateways in London, Doha, Madrid, Seattle\/Tacoma, Sydney, and Tokyo. It operates a mainline fleet of 965 aircraft. The company was formerly known as AMR Corporation and changed its name to American Airlines Group Inc. in December 2013. American Airlines Group Inc. was founded in 1926 and is headquartered in Fort Worth, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"Freeport-McMoRan, Inc.","Symbol":"FCX","Current Price":"39.89","Latest MA":"45.00","Price Target":51.48857,"Difference from MA":"-11.35%","Difference from Open":"-1.51%","Change from Yesterday":"0.39%","Change from Last Report":"-0.32","Latest Volume":"1,560,634","Market Cap":"57,319,137,280","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":19.73961,"ROE":0.16870001,"DTE":33.531,"Industry":"Copper","Sector":"Basic Materials","Beta":1.91,"Trailing PEG":10.3944,"Trailing PE":28.905796,"Trailing PS":2.2355359,"Quick Ratio":1.048,"Day High":40.595,"Day Low":39.88,"VS Average Volume":0.1405298995,"Company Summary":"Freeport-McMoRan Inc. engages in the mining of mineral properties in North America, South America, and Indonesia. It primarily explores for copper, gold, molybdenum, silver, and other metals. The company's assets include the Grasberg minerals district in Indonesia; Morenci, Bagdad, Safford, Sierrita, and Miami in Arizona; Chino and Tyrone in New Mexico; and Henderson and Climax in Colorado, North America, as well as Cerro Verde in Peru and El Abra in Chile. The company was formerly known as Freeport-McMoRan Copper & Gold Inc. and changed its name to Freeport-McMoRan Inc. in July 2014. Freeport-McMoRan Inc. was incorporated in 1987 and is headquartered in Phoenix, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"CSX Corporation","Symbol":"CSX","Current Price":"32.06","Latest MA":"33.77","Price Target":38.19692,"Difference from MA":"-5.07%","Difference from Open":"0.63%","Change from Yesterday":"-0.51%","Change from Last Report":"0.11","Latest Volume":"1,103,071","Market Cap":"61,825,146,880","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":16.12676,"ROE":0.29458,"DTE":147.913,"Industry":"Railroads","Sector":"Industrials","Beta":1.191,"Trailing PEG":2.0456,"Trailing PE":17.053192,"Trailing PS":4.2112355,"Quick Ratio":1.195,"Day High":32.09,"Day Low":31.76,"VS Average Volume":0.0905130909,"Company Summary":"CSX Corporation, together with its subsidiaries, provides rail-based freight transportation services. The company offers rail services; and transportation of intermodal containers and trailers, as well as other transportation services, such as rail-to-truck transfers and bulk commodity operations. It also transports chemicals, agricultural and food products, minerals, automotive, forest products, fertilizers, and metals and equipment; and coal, coke, and iron ore to electricity-generating power plants, steel manufacturers, and industrial plants, as well as exports coal to deep-water port facilities. In addition, the company provides intermodal services through a network of approximately 30 terminals transporting manufactured consumer goods in containers; and drayage services, including the pickup and delivery of intermodal shipments. It serves the automotive industry with distribution centers and storage locations, as well as connects non-rail served customers through transferring products, such as plastics and ethanol from rail to trucks. The company operates approximately 20,000 route mile rail network, which serves various population centers in 26 states east of the Mississippi River, the District of Columbia, and the Canadian provinces of Ontario and Quebec, as well as owns and leases approximately 3,500 locomotives. It serves production and distribution facilities through track connections. CSX Corporation was incorporated in 1978 and is headquartered in Jacksonville, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"Robinhood Markets, Inc.","Symbol":"HOOD","Current Price":"39.55","Latest MA":"26.80","Price Target":47.35294,"Difference from MA":"47.56%","Difference from Open":"-1.30%","Change from Yesterday":"-3.06%","Change from Last Report":"-0.85","Latest Volume":"2,286,163","Market Cap":"34,961,248,256","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":28.168312,"ROE":0.07619,"DTE":102.747,"Industry":"Capital Markets","Sector":"Financial Services","Beta":1.839,"Trailing PEG":null,"Trailing PE":68.18966,"Trailing PS":14.518791,"Quick Ratio":0.547,"Day High":40.52,"Day Low":39.17,"VS Average Volume":0.1044875339,"Company Summary":"Robinhood Markets, Inc. operates financial services platform in the United States. Its platform allows users to invest in stocks, exchange-traded funds (ETFs), American depository receipts, options, gold, and cryptocurrencies. The company offers fractional trading, recurring investments, fully-paid securities lending, access to investing on margin, cash sweep, instant withdrawals, retirement program, around-the-clock trading, and initial public offerings participation services. It also provides various learning and education solutions comprise Snacks, an accessible digest of business news stories for a new generation of investors.; Learn, which is an online collection of beginners' guides, feature tutorials, and financial dictionary; Newsfeeds that offer access to free, premium news from sites from various sites, such as Barron's, Reuters, and Dow Jones. In addition, the company offers In-App Education, a resource that covers investing fundamentals, including why people invest, a stock market overview, and tips on how to define investing goals, as well as allows customers to understand the basics of investing before their first trade; and Crypto Learn and Earn, an educational module available to various crypto customers through Robinhood Learn to teach customers the basics related to cryptocurrency. Further, it provides Robinhood credit cards, cash card and spending accounts, and wallets. Robinhood Markets, Inc. was incorporated in 2013 and is headquartered in Menlo Park, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"Procter & Gamble Company (The)","Symbol":"PG","Current Price":"160.54","Latest MA":"168.63","Price Target":180.38155,"Difference from MA":"-4.80%","Difference from Open":"0.25%","Change from Yesterday":"-0.99%","Change from Last Report":"-0.29","Latest Volume":"1,328,770","Market Cap":"378,089,897,984","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":21.684282,"ROE":0.28766,"DTE":69.338,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":0.414,"Trailing PEG":3.4277,"Trailing PE":27.680172,"Trailing PS":4.5061665,"Quick Ratio":0.507,"Day High":161.21,"Day Low":160.053,"VS Average Volume":0.197724804,"Company Summary":"The Procter & Gamble Company engages in the provision of branded consumer packaged goods worldwide. The company operates through five segments: Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care. The Beauty segment offers conditioners, shampoos, styling aids, and treatments under the Head & Shoulders, Herbal Essences, Pantene, and Rejoice brands; and antiperspirants and deodorants, personal cleansing, and skin care products under the Olay, Old Spice, Safeguard, Secret, SK-II, and Native brands. The Grooming segment provides blades and razors, shave products, appliances, and other grooming products under the Braun, Gillette, and Venus brand names. The Health Care segment offers toothbrushes, toothpastes, and other oral care products under the Crest and Oral-B brand names; and gastrointestinal, pain relief, rapid diagnostics, respiratory, vitamins\/minerals\/supplements, and other personal health care products under Metamucil, Neurobion, Pepto-Bismol, and Vicks brands. The Fabric & Home Care segment provides fabric enhancers, laundry additives, and laundry detergents under the Ariel, Downy, Gain, and Tide brands; and air care, dish care, P&G professional, and surface care products under the Cascade, Dawn, Fairy, Febreze, Mr. Clean, and Swiffer brands. The Baby, Feminine & Family Care segment offers baby wipes, and taped diapers and pants under the Luvs and Pampers brands; adult incontinence and feminine care products under the Always, Always Discreet, and Tampax brands; and paper towels, tissues, and toilet papers under the Bounty, Charmin, and Puffs brands. It sells its products primarily through mass merchandisers, e-commerce, grocery stores, membership club stores, drug stores, department stores, distributors, wholesalers, specialty beauty stores, high-frequency stores, pharmacies, electronics stores, and professional channels, as well as directly to consumers. The company was founded in 1837 and is headquartered in Cincinnati, Ohio.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"Halliburton Company","Symbol":"HAL","Current Price":"27.47","Latest MA":"30.43","Price Target":37.06071,"Difference from MA":"-9.72%","Difference from Open":"-0.02%","Change from Yesterday":"1.59%","Change from Last Report":"0.00","Latest Volume":"1,359,545","Market Cap":"24,132,450,304","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":8.919816,"ROE":0.26293,"DTE":83.993,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.905,"Trailing PEG":2.1424,"Trailing PE":9.604896,"Trailing PS":1.0459174,"Quick Ratio":1.377,"Day High":27.81,"Day Low":27.31,"VS Average Volume":0.1479379471,"Company Summary":"Halliburton Company provides products and services to the energy industry worldwide. It operates through two segments, Completion and Production, and Drilling and Evaluation. The Completion and Production segment offers production enhancement services that include stimulation and sand control services; cementing services, such as well bonding and casing, and casing equipment; and completion tools that offer downhole solutions and services, including well completion products and services, intelligent well completions, and service tools, as well as liner hanger, sand control, and multilateral systems. This segment also provides electrical submersible pumps, as well as artificial lift services; production solutions comprising coiled tubing, hydraulic workover units, downhole tools, and pumping and nitrogen services; pipeline and process services, such as pre-commissioning, commissioning, maintenance, and decommissioning; and specialty chemicals and services. The Drilling and Evaluation segment offers drilling fluid systems, performance additives, completion fluids, solids control, specialized testing equipment, and waste management services; drilling systems and services; wireline and perforating services consists of open-hole logging, and cased-hole and slickline; and drill bits and services comprising roller cone rock bits, fixed cutter bits, hole enlargement, and related downhole tools and services, as well as coring equipment and services. This segment also provides cloud based digital services and artificial intelligence solutions on an open architecture for subsurface insights, integrated well construction, and reservoir and production management; testing and subsea services, such as acquisition and analysis of reservoir information and optimization solutions; and project management and integrated asset management services. Halliburton Company was founded in 1919 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"Kinder Morgan, Inc.","Symbol":"KMI","Current Price":"28.42","Latest MA":"23.11","Price Target":26.525,"Difference from MA":"22.96%","Difference from Open":"-0.25%","Change from Yesterday":"0.42%","Change from Last Report":"-0.33","Latest Volume":"1,224,550","Market Cap":"63,138,787,328","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":22.509207,"ROE":0.083500005,"DTE":101.433,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.907,"Trailing PEG":2.0715,"Trailing PE":25.150354,"Trailing PS":4.1673017,"Quick Ratio":0.291,"Day High":28.82,"Day Low":28.36,"VS Average Volume":0.0907594092,"Company Summary":"Kinder Morgan, Inc. operates as an energy infrastructure company primarily in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas gasification, liquefaction, and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and\/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, renewable fuel and feedstocks, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; owns interests in\/or operates oil fields and gasoline processing plants; and operates a crude oil pipeline system in West Texas, as well as owns and operates RNG and LNG facilities. It owns and operates approximately 82,000 miles of pipelines and 139 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1997 and is headquartered in Houston, Texas.","Stock Sentiment":"N\/A","Row Color":"positive-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"United Airlines Holdings, Inc.","Symbol":"UAL","Current Price":"108.95","Latest MA":"65.22","Price Target":119.48261,"Difference from MA":"67.06%","Difference from Open":"-0.47%","Change from Yesterday":"5.09%","Change from Last Report":"-0.67","Latest Volume":"2,696,966","Market Cap":"35,832,684,544","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":8.565059,"ROE":0.27245,"DTE":291.676,"Industry":"Airlines","Sector":"Industrials","Beta":1.393,"Trailing PEG":0.8238,"Trailing PE":12.986293,"Trailing PS":0.63993794,"Quick Ratio":0.694,"Day High":110.32,"Day Low":105.7984,"VS Average Volume":0.4244271695,"Company Summary":"United Airlines Holdings, Inc., through its subsidiaries, provides air transportation services in North America, Asia, Europe, Africa, the Pacific, the Middle East, and Latin America. The company transports people and cargo through its mainline and regional fleets. It also offers catering, ground handling, flight academy, and maintenance services for third parties. The company was formerly known as United Continental Holdings, Inc. and changed its name to United Airlines Holdings, Inc. in June 2019. United Airlines Holdings, Inc. was incorporated in 1968 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"Schlumberger N.V.","Symbol":"SLB","Current Price":"39.34","Latest MA":"42.94","Price Target":55.09433,"Difference from MA":"-8.38%","Difference from Open":"-0.58%","Change from Yesterday":"1.38%","Change from Last Report":"0.00","Latest Volume":"1,433,728","Market Cap":"55,553,982,464","Earning Date":"2025-01-17","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":11.395071,"ROE":0.21722999,"DTE":57.141,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.532,"Trailing PEG":1.7301,"Trailing PE":12.649518,"Trailing PS":1.5433805,"Quick Ratio":1.003,"Day High":39.69,"Day Low":39.075,"VS Average Volume":0.1215867314,"Company Summary":"Schlumberger Limited engages in the provision of technology for the energy industry worldwide. The company operates through four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company provides field development and hydrocarbon production, carbon management, and integration of adjacent energy systems; reservoir interpretation and data processing services for exploration data; and well construction and production improvement services and products. It also offers subsurface geology and fluids evaluation information; open and cased hole services; exploration and production pressure, and flow-rate measurement services; and pressure pumping, well stimulation, and coiled tubing equipment solutions. In addition, the company offers mud logging, directional drilling, measurement-while-drilling, and logging-while-drilling services, as well as engineering support services; supplies drilling fluid systems; designs, manufactures, and markets roller cone and fixed cutter drill bits; bottom-hole-assembly and borehole enlargement technologies; well cementing products and services; well planning, well drilling, engineering, supervision, logistics, procurement, and contracting of third parties, as well as drilling rig management solutions; and drilling equipment and services, as well as land drilling rigs and related services. Further, it provides artificial lift production equipment and optimization services; supplies packers, safety valves, sand control technology, and various intelligent well completions technology and equipment; designs and manufactures valves, chokes, actuators, and surface trees; and OneSubsea, an integrated solutions, products, systems, and services, including wellheads, subsea trees, manifolds and flowline connectors, control systems, connectors, and services. The company was formerly known as Socie´te´ de Prospection E´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"Bank of America Corporation","Symbol":"BAC","Current Price":"45.60","Latest MA":"41.60","Price Target":50.84682,"Difference from MA":"9.62%","Difference from Open":"-0.87%","Change from Yesterday":"-1.31%","Change from Last Report":"-0.14","Latest Volume":"3,518,390","Market Cap":"349,884,121,088","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":12.300349,"ROE":0.08092,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.325,"Trailing PEG":2.0474,"Trailing PE":16.521776,"Trailing PS":3.6975474,"Quick Ratio":"N\/A","Day High":46.04,"Day Low":45.49,"VS Average Volume":0.1024140788,"Company Summary":"Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. It operates in four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, non-interest and interest-bearing checking accounts, and investment accounts and products; credit and debit cards; residential mortgages, and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research, and certain market-based services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"Citigroup, Inc.","Symbol":"C","Current Price":"71.98","Latest MA":"63.98","Price Target":84.4855,"Difference from MA":"12.50%","Difference from Open":"-0.66%","Change from Yesterday":"-1.77%","Change from Last Report":"-1.74","Latest Volume":"1,074,905","Market Cap":"136,142,356,480","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":9.769832,"ROE":0.03874,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.426,"Trailing PEG":0.7067,"Trailing PE":20.508547,"Trailing PS":1.9643095,"Quick Ratio":"N\/A","Day High":72.46,"Day Low":71.84,"VS Average Volume":0.0770541605,"Company Summary":"Citigroup Inc., a diversified financial service holding company, provides various financial product and services to consumers, corporations, governments, and institutions worldwide. It operates through five segments: Services, Markets, Banking, U.S. Personal Banking, and Wealth. The Services segment includes Treasury and Trade Solutions, which provides cash management, trade, and working capital solutions to multinational corporations, financial institutions, and public sector organizations; and Securities Services, such as cross-border support for clients, local market expertise, post-trade technologies, data solutions, and various securities services solutions. The Markets segment offers sales and trading services for equities, foreign exchange, rates, spread products, and commodities to corporate, institutional, and public sector clients; and market-making services, including asset classes, risk management solutions, financing, prime brokerage, research, securities clearing, and settlement. The banking segment includes investment banking; advisory services related to mergers and acquisitions, divestitures, restructurings, and corporate defense activities; and corporate lending, which includes corporate and commercial banking. The U.S. Personal Banking segment provides co-branded cards and retail banking services. The Wealth segment provides financial services to high-net-worth clients through banking, lending, mortgages, investment, custody, and trust product offerings; and to professional industries, including law firms, consulting groups, accounting, and asset management. The company was founded in 1812 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"Wells Fargo & Company","Symbol":"WFC","Current Price":"70.35","Latest MA":"61.92","Price Target":77.30087,"Difference from MA":"13.61%","Difference from Open":"-0.78%","Change from Yesterday":"-1.66%","Change from Last Report":"-1.70","Latest Volume":"1,140,044","Market Cap":"234,229,612,544","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":12.610533,"ROE":0.099139996,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.136,"Trailing PEG":3.3245,"Trailing PE":14.625779,"Trailing PS":3.0077639,"Quick Ratio":"N\/A","Day High":70.91,"Day Low":70.14,"VS Average Volume":0.0652980382,"Company Summary":"Wells Fargo & Company, a financial services company, provides diversified banking, investment, mortgage, and consumer and commercial finance products and services in the United States and internationally. The company operates through four segments: Consumer Banking and Lending; Commercial Banking; Corporate and Investment Banking; and Wealth and Investment Management. The Consumer Banking and Lending segment offers diversified financial products and services for consumers and small businesses. Its financial products and services include checking and savings accounts, and credit and debit cards, as well as home, auto, personal, and small business lending services. The Commercial Banking segment provides financial solutions to private, family owned, and certain public companies. Its products and services include banking and credit products across various industry sectors and municipalities, secured lending and lease products, and treasury management services. The Corporate and Investment Banking segment offers a suite of capital markets, banking, and financial products and services, such as corporate banking, investment banking, treasury management, commercial real estate lending and servicing, equity, and fixed income solutions, as well as sales, trading, and research capabilities services to corporate, commercial real estate, government, and institutional clients. The Wealth and Investment Management segment provides personalized wealth management, brokerage, financial planning, lending, private banking, and trust and fiduciary products and services to affluent, high-net worth, and ultra-high-net worth clients. It also operates through financial advisors in brokerage and wealth offices, consumer bank branches, independent offices, and digitally through WellsTrade and Intuitive Investor. The company was founded in 1852 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"Devon Energy Corporation","Symbol":"DVN","Current Price":"36.43","Latest MA":"40.73","Price Target":50.21517,"Difference from MA":"-10.55%","Difference from Open":"0.50%","Change from Yesterday":"3.66%","Change from Last Report":"-0.38","Latest Volume":"2,296,461","Market Cap":"23,930,865,664","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":7.730324,"ROE":0.26279,"DTE":64.021,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":2.071,"Trailing PEG":14.898,"Trailing PE":6.7462964,"Trailing PS":1.6471102,"Quick Ratio":0.834,"Day High":36.88,"Day Low":36.13,"VS Average Volume":0.2347944136,"Company Summary":"Devon Energy Corporation, an independent energy company, engages in the exploration, development, and production of oil, natural gas, and natural gas liquids in the United States. It operates in Delaware, Eagle Ford, Anadarko, Williston, and Powder River Basins. The company was founded in 1971 and is headquartered in Oklahoma City, Oklahoma.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"10-01-2025 16:49:02"},{"Company Name":"JP Morgan Chase & Co.","Symbol":"JPM","Current Price":"241.64","Latest MA":"218.01","Price Target":254.52953,"Difference from MA":"10.84%","Difference from Open":"-0.60%","Change from Yesterday":"-0.56%","Change from Last Report":"-0.41","Latest Volume":"1,299,262","Market Cap":"680,298,741,760","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.92883,"ROE":0.16216,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.091,"Trailing PEG":4.7813,"Trailing PE":13.431907,"Trailing PS":4.195542,"Quick Ratio":"N\/A","Day High":243.81,"Day Low":241.54,"VS Average Volume":0.1481377177,"Company Summary":"JPMorgan Chase & Co. operates as a financial services company worldwide. It operates through three segments: Consumer & Community Banking, Commercial & Investment Bank, and Asset & Wealth Management. It offers deposit, investment and lending products, cash management, and payments and services; mortgage origination and servicing activities; residential mortgages and home equity loans; and credit cards, auto loans, leases, and travel services to consumers and small businesses through bank branches, ATMs, and digital and telephone banking. The company also provides investment banking products and services, including corporate strategy and structure advisory, and equity and debt market capital-raising services, as well as loan origination and syndication; payments; and cash and derivative instruments, risk management solutions, prime brokerage, and research, as well as offers securities services, including custody, fund accounting and administration, and securities lending products for asset managers, insurance companies, and public and private investment funds. In addition, it provides financial solutions, including lending, payments, investment banking, and asset management to small and midsized companies, local governments, nonprofit clients, and large corporations, as well as investors, developers, and owners of multifamily, office, retail, industrial, and affordable housing properties. Further, the company offers multi-asset investment management solutions in equities, fixed income, alternatives, and money market funds to institutional clients and retail investors; and retirement products and services, brokerage, custody, estate planning, lending, deposits, and investment management products to high net worth clients. JPMorgan Chase & Co. was founded in 1799 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"10-01-2025 16:49:02"}]