[{"Company Name":"DENTSPLY SIRONA Inc.","Symbol":"XRAY","Current Price":"18.81","Latest MA":"19.00","Latest MA 5":18.875999939,"Latest MA 9":18.8099999491,"Latest MA 20":19.0000000267,"Price Target":22.23333,"Difference from MA":"-1.00%","Difference from Open":"-0.05%","Change from Yesterday":"-0.05%","Change from Last Report":"0.00","Latest Volume":"3,179,936","Market Cap":"3,739,051,776","Earning Date":"2025-02-27","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":9.405,"PB Ratio":1.5011971,"Previous Close":18.82,"ROE":-0.13991,"DTE":93.815,"Industry":"Medical Instruments & Supplies","Sector":"Healthcare","Beta":0.973,"Trailing PEG":0.9646,"Trailing PE":"N\/A","Trailing PS":0.95873123,"Quick Ratio":0.627,"Day High":19.165,"Day Low":18.595,"VS Average Volume":1.2615204325,"Company Summary":"DENTSPLY SIRONA Inc. manufactures and sells various dental products and technologies worldwide. It operates in four segments: Connected Technology Solutions, Essential Dental Solutions, Orthodontic and Implant Solutions, and Wellspect Healthcare. The company offers dental equipment comprising imaging equipment, motorized dental handpieces, treatment centers, other instruments, amalgamators, mixing machines, and porcelain furnaces; and dental CAD\/CAM technologies to support dental restorations, such as intraoral scanners, 3-D printers, mills, other software and services, and a full-chairside economical restoration of esthetic ceramic dentistry, as well as DS Core, its cloud-based platform. It also provides endodontic products consisting of motorized endodontic handpieces, files, sealers, irrigation needles, and other tools that support root canal procedures; restorative products, including dental ceramics, crowns, and veneers; and preventative products, such as curing light systems, dental diagnostic systems, and ultrasonic scalers and polishers, as well as dental anesthetics, prophylaxis paste, dental sealants, and impression materials. In addition, the company offers SureSmile and Byte aligner solutions; VPro\/HyperByte, a high-frequency vibration technology device; SureSmile Simulator, which creates a 3D visualization of a patient's outcome; and Byte Plus for treatment planning. Further, it provides dental implants, digital dentures, crown and bridge porcelain products, bone regenerative and restorative solutions, treatment planning software, and educational programs; dental prosthetics; urology catheters; and other health-related consumables. The company serves professional dental and consumable medical device markets through third-party distributors. The company was formerly known as DENTSPLY International Inc. and changed its name to DENTSPLY SIRONA Inc. in February 2016. DENTSPLY SIRONA Inc. was founded in 1877 and is headquartered in Charlotte, North Carolina","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Dell Technologies Inc.","Symbol":"DELL","Current Price":"115.65","Latest MA":"110.55","Latest MA 5":115.5859997559,"Latest MA 9":115.9855548435,"Latest MA 20":110.5544989777,"Price Target":146.48566,"Difference from MA":"4.61%","Difference from Open":"3.44%","Change from Yesterday":"4.52%","Change from Last Report":"0.00","Latest Volume":"8,543,157","Market Cap":"80,689,586,176","Earning Date":"2025-02-27","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":12.303192,"PB Ratio":-35.529953,"Previous Close":110.65,"ROE":"N\/A","DTE":"N\/A","Industry":"Computer Hardware","Sector":"Technology","Beta":0.961,"Trailing PEG":0.6043,"Trailing PE":20.432863,"Trailing PS":0.85882014,"Quick Ratio":0.434,"Day High":117.28,"Day Low":111.8,"VS Average Volume":1.0862643049,"Company Summary":"Dell Technologies Inc. designs, develops, manufactures, markets, sells, and supports various comprehensive and integrated solutions, products, and services in the Americas, Europe, the Middle East, Asia, and internationally. The company operates through two segments, Infrastructure Solutions Group (ISG) and Client Solutions Group (CSG). The ISG segment provides modern and traditional storage solutions, including all-flash arrays, scale-out file, object platforms, hyper-converged infrastructure, and software-defined storage; and general-purpose and AI-optimized servers. This segment also offers networking products and services comprising wide area network infrastructure, data center and edge networking switches, and cables and optics that help its business customers to transform and modernize their infrastructure, mobilize and enrich end-user experiences, and accelerate business applications and processes; software and peripherals; and consulting, support, and deployment services. The CSG segment provides desktops, workstations, and notebooks; displays, docking stations, keyboards, mice, webcam, and audio devices; and third-party software and peripherals, as well as configuration, support and deployment, and extended warranty services. It is involved in cybersecurity technology-driven security solutions to prevent security breaches, detect malicious activity, respond rapidly when a security breach occurs, and identify emerging threats; originating, collecting, and servicing customer financing arrangements; and the resale of VMware products and services. The company serves enterprises, public institutions, and small and medium-sized businesses through its direct sales channel, value-added resellers, system integrators, distributors, and retailers. The company was formerly known as Denali Holding Inc. and changed its name to Dell Technologies Inc. in August 2016. Dell Technologies Inc. was founded in 1984 and is headquartered in Round Rock, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"EOG Resources, Inc.","Symbol":"EOG","Current Price":"129.84","Latest MA":"130.01","Latest MA 5":132.7080024414,"Latest MA 9":131.9266683621,"Latest MA 20":130.011499588,"Price Target":146.42065,"Difference from MA":"-0.13%","Difference from Open":"-0.93%","Change from Yesterday":"-1.13%","Change from Last Report":"0.00","Latest Volume":"2,523,912","Market Cap":"73,028,501,504","Earning Date":"2025-02-27","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":11.739601,"PB Ratio":2.4793293,"Previous Close":131.32,"ROE":0.24908,"DTE":13.911,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":1.282,"Trailing PEG":66.4544,"Trailing PE":10.479419,"Trailing PS":3.0601952,"Quick Ratio":1.968,"Day High":131.71,"Day Low":128.6,"VS Average Volume":0.8435007571,"Company Summary":"EOG Resources, Inc., together with its subsidiaries, explores for, develops, produces, and markets crude oil, natural gas liquids, and natural gas primarily in producing basins in the United States, the Republic of Trinidad and Tobago and internationally. The company was formerly known as Enron Oil & Gas Company. EOG Resources, Inc. was incorporated in 1985 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Warner Bros. Discovery, Inc. - ","Symbol":"WBD","Current Price":"10.50","Latest MA":"10.40","Latest MA 5":10.8199998856,"Latest MA 9":10.6844444275,"Latest MA 20":10.4034999371,"Price Target":12.9832,"Difference from MA":"0.93%","Difference from Open":"-1.41%","Change from Yesterday":"-1.78%","Change from Last Report":"0.00","Latest Volume":"56,141,845","Market Cap":"25,758,283,776","Earning Date":"2025-02-27","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":-80.76923,"PB Ratio":0.73349637,"Previous Close":10.69,"ROE":-0.27295,"DTE":111.154,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.497,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.65082324,"Quick Ratio":0.437,"Day High":10.9,"Day Low":10.43,"VS Average Volume":2.003519605,"Company Summary":"Warner Bros. Discovery, Inc. operates as a media and entertainment company worldwide. It operates through three segments: Studios, Network, and DTC. The Studios segment produces and releases feature films for initial exhibition in theaters; produces and licenses television programs to its networks and third parties and direct-to-consumer services; distributes films and television programs to various third parties and internal television; and offers streaming services and distribution through the home entertainment market, themed experience licensing, and interactive gaming. The Network segment comprises domestic and international television networks. The DTC segment offers premium pay-tv and streaming services. In addition, the company offers portfolio of content, brands, and franchises across television, film, streaming, and gaming under the Warner Bros. Motion Picture Group, Warner Bros. Television Group, DC, HBO, HBO Max, Max, Discovery Channel, discovery+, CNN, HGTV, Food Network, TNT Sports, TBS, TLC, OWN, Warner Bros. Games, Batman, Superman, Wonder Woman, Harry Potter, Looney Tunes, Hanna-Barbera, Game of Thrones, and The Lord of the Rings brands. Further, it provides content through distribution platforms, including linear network, free-to-air, and broadcast television; authenticated GO applications, digital distribution arrangements, content licensing arrangements, and direct-to-consumer subscription products. Warner Bros. Discovery, Inc. was incorporated in 2008 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"HP Inc.","Symbol":"HPQ","Current Price":"33.83","Latest MA":"33.31","Latest MA 5":34.3899997864,"Latest MA 9":34.1966665141,"Latest MA 20":33.3069998779,"Price Target":36.528,"Difference from MA":"1.57%","Difference from Open":"-0.41%","Change from Yesterday":"-0.79%","Change from Last Report":"0.00","Latest Volume":"5,700,762","Market Cap":"31,901,186,048","Earning Date":"2025-02-27","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":9.3972225,"PB Ratio":-24.009937,"Previous Close":34.1,"ROE":"N\/A","DTE":"N\/A","Industry":"Computer Hardware","Sector":"Technology","Beta":1.065,"Trailing PEG":1.2408,"Trailing PE":12.039146,"Trailing PS":0.59562695,"Quick Ratio":0.444,"Day High":34.0706,"Day Low":33.59,"VS Average Volume":0.8905425772,"Company Summary":"HP Inc. provides personal computing, printing, 3D printing, hybrid work, gaming, and other related technologies in the United States and internationally. The company operates through three segments: Personal Systems, Printing, and Corporate Investments. The Personal Systems segment offers commercial and consumer desktops and notebooks, workstations, thin clients, retail point-of-sale systems, displays, software, support, and services, as well as hybrid systems. The Printing segment provides consumer and commercial printer hardware, supplies, solutions, and services, as well as focuses on graphics and 3D printing and personalization solutions in the commercial and industrial markets. The Corporate Investments segment is involved in the business incubation and investment projects. It serves individual consumers, small- and medium-sized businesses, and large enterprises. The company was formerly known as Hewlett-Packard Company and changed its name to HP Inc. in October 2015. HP Inc. was founded in 1939 and is headquartered in Palo Alto, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Monster Beverage Corporation","Symbol":"MNST","Current Price":"51.65","Latest MA":"49.32","Latest MA 5":52.1100003052,"Latest MA 9":51.339999983,"Latest MA 20":49.3204999161,"Price Target":55.21708,"Difference from MA":"4.72%","Difference from Open":"-0.23%","Change from Yesterday":"-0.92%","Change from Last Report":"0.00","Latest Volume":"5,023,596","Market Cap":"50,230,661,120","Earning Date":"2025-02-27","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":27.620321,"PB Ratio":8.690897,"Previous Close":52.13,"ROE":0.23517,"DTE":13.985,"Industry":"Beverages - Non-Alcoholic","Sector":"Consumer Defensive","Beta":0.735,"Trailing PEG":1.6334,"Trailing PE":33.10898,"Trailing PS":6.7780566,"Quick Ratio":2.333,"Day High":51.99,"Day Low":51.1,"VS Average Volume":0.8732940366,"Company Summary":"Monster Beverage Corporation, through its subsidiaries, engages in development, marketing, sale, and distribution of energy drink beverages and concentrates in the United States and internationally. The company operates through three segments: Monster Energy Drinks, Strategic Brands, Alcohol Brands, and Other. It offers carbonated non-carbonated energy drinks, ready-to-drink iced teas, lemonades, juice cocktails, single-serve juices and fruit beverages, ready-to-drink dairy and coffee drinks, energy drinks, sports drinks and single-serve still waters, and sodas that are considered natural, sparkling juices, and flavored sparkling beverages. The company sells its products to full service beverage bottlers\/distributors, retail grocery and specialty chains, wholesalers, club stores, mass merchandisers, convenience chains, food service customers, value stores, e-commerce retailers, and the military; and concentrates and\/or beverage bases to authorized bottling and canning operations. It provides its products under the Monster Energy, Monster Energy Ultra, Monster Rehab, Monster Energy Nitro, Java Monster, Punch Monster, Juice Monster, Muscle Monster, Espresso Monster, Monster Tour Water, Fury, Monster MAXX, Caffe Monster, Monster Hydro, Monster HydroSport Super Fuel, Monster Dragon Tea, Reign Total Body Fuel, and Reign Inferno Thermogenic Fuel, Reign Storm, Bang Energy, NOS, Full Throttle, Burn, Mother, Nalu, Ultra Energy, Play and Power Play (stylized), Relentless, BPM, BU, Gladiator, Samurai, Live+, Predator, and Fury brands. The company was formerly known as Hansen Natural Corporation and changed its name to Monster Beverage Corporation in January 2012. Monster Beverage Corporation was founded in 1985 and is headquartered in Corona, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"PENN Entertainment, Inc.","Symbol":"PENN","Current Price":"20.41","Latest MA":"21.23","Latest MA 5":20.8139999695,"Latest MA 9":21.4511112807,"Latest MA 20":21.2280001717,"Price Target":23.08333,"Difference from MA":"-3.85%","Difference from Open":"-1.40%","Change from Yesterday":"0.20%","Change from Last Report":"0.00","Latest Volume":"4,345,010","Market Cap":"3,115,157,760","Earning Date":"2025-02-27","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":26.166668,"PB Ratio":0.99643606,"Previous Close":20.37,"ROE":-0.16457,"DTE":369.728,"Industry":"Resorts & Casinos","Sector":"Consumer Cyclical","Beta":2.091,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.49411651,"Quick Ratio":0.789,"Day High":21.17,"Day Low":20.195,"VS Average Volume":1.0399438025,"Company Summary":"PENN Entertainment, Inc., together with its subsidiaries, provides integrated entertainment, sports content, and casino gaming experiences. The company operates through five segments: Northeast, South, West, Midwest, and Interactive. It operates online sports betting in various jurisdictions; and iCasino under Hollywood Casino, L'Auberge, ESPN BET, and theScore Bet Sportsbook and Casino brands. The company's portfolio also includes PENN Play, customer loyalty program, which offers a set of rewards and experiences for business channels. In addition, it owns various trademarks and service marks, including Ameristar, Argosy, Boomtown, Hollywood Casino, Hollywood Gaming, L'Auberge, PENN Play, theScore, theScore Bet, theScore esports, and M Resort. The company was formerly known as Penn National Gaming, Inc. and changed its name to PENN Entertainment, Inc. in August 2022. PENN Entertainment, Inc. was founded in 1972 and is based in Wyomissing, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Viatris Inc.","Symbol":"VTRS","Current Price":"11.24","Latest MA":"11.01","Latest MA 5":11.284000061,"Latest MA 9":11.0900000721,"Latest MA 20":11.008999979,"Price Target":13.2,"Difference from MA":"2.10%","Difference from Open":"-2.01%","Change from Yesterday":"-2.09%","Change from Last Report":"0.00","Latest Volume":"11,181,265","Market Cap":"13,415,951,360","Earning Date":"2025-02-27","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":4.209738,"PB Ratio":0.6778434,"Previous Close":11.48,"ROE":-0.043449998,"DTE":80.912,"Industry":"Drug Manufacturers - Specialty & Generic","Sector":"Healthcare","Beta":0.952,"Trailing PEG":0.0707,"Trailing PE":"N\/A","Trailing PS":0.8915142,"Quick Ratio":0.819,"Day High":11.53,"Day Low":11.185,"VS Average Volume":1.2084313677,"Company Summary":"Viatris Inc. operates as a healthcare company worldwide. The company operates in four segments: Developed Markets, Greater China, JANZ, and Emerging Markets. It offers prescription brand drugs, generic drugs, complex generic drugs, biosimilars, and active pharmaceutical ingredients (APIs). The company offers drugs in various therapeutic areas, including noncommunicable and infectious diseases; biosimilars in the areas of oncology, immunology, endocrinology, ophthalmology, and dermatology; and APIs for antibacterial, central nervous system agents, antihistamines\/antiasthmatics, cardiovascular, antivirals, antidiabetics, antifungals, and proton pump inhibitor areas, as well as support services, such as diagnostic clinics, educational seminars, and digital tools to help patients better manage their health. It provides it medicines in the form of oral solid doses, injectables, complex dosage forms, and APIs to retail and pharmacy establishments, wholesalers and distributors, payers, insurers and governments, and institutions. The company distributes its products through pharmaceutical wholesalers\/distributors, pharmaceutical retailers, institutional pharmacies, mail-order and e-commerce pharmacies, and specialty pharmacies. It sells its products under the Lyrica, Lipitor, Creon, Influvac, Wixela Inhub, EpiPen auto-injector, Fraxiparine, and Yupelri; Norvasc and Viagra; AMITIZA, Lipacreon, and Effexor; and Celebrex and ARV names, as well as glargine and SEMGLEE names. The company has collaboration and licensing agreements with Revance Therapeutics, Inc.; and Momenta Pharmaceuticals, Inc. Viatris Inc. was founded in 1961 and is headquartered in Canonsburg, Pennsylvania.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Evergy, Inc.","Symbol":"EVRG","Current Price":"69.10","Latest MA":"66.21","Latest MA 5":68.3219989014,"Latest MA 9":67.7211110433,"Latest MA 20":66.2129999924,"Price Target":67.40667,"Difference from MA":"4.36%","Difference from Open":"0.49%","Change from Yesterday":"0.42%","Change from Last Report":"0.00","Latest Volume":"2,651,089","Market Cap":"15,891,341,312","Earning Date":"2025-02-27","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":17.10396,"PB Ratio":1.5851169,"Previous Close":68.81,"ROE":0.08733,"DTE":137.464,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.639,"Trailing PEG":1.8684,"Trailing PE":18.675674,"Trailing PS":2.750414,"Quick Ratio":0.122,"Day High":69.58,"Day Low":68.69,"VS Average Volume":1.4341839329,"Company Summary":"Evergy, Inc., together with its subsidiaries, engages in the generation, transmission, distribution, and sale of electricity in the United States. The company generates electricity through coal, landfill gas, uranium, and natural gas and oil sources, as well as solar, wind, other renewable sources. It serves residences, commercial firms, industrials, municipalities, and other electric utilities. The company was incorporated in 2017 and is headquartered in Kansas City, Missouri.","Stock Sentiment":"N\/A","Row Color":"positive-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"The AES Corporation","Symbol":"AES","Current Price":"10.92","Latest MA":"10.59","Latest MA 5":10.7520000305,"Latest MA 9":10.5022222646,"Latest MA 20":10.5924936733,"Price Target":15.68417,"Difference from MA":"3.09%","Difference from Open":"-0.27%","Change from Yesterday":"0.55%","Change from Last Report":"0.00","Latest Volume":"10,507,738","Market Cap":"7,764,414,976","Earning Date":"2025-02-27","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":5.3793106,"PB Ratio":2.3600607,"Previous Close":10.86,"ROE":-0.02549,"DTE":352.879,"Industry":"Utilities - Diversified","Sector":"Utilities","Beta":0.983,"Trailing PEG":1.0921,"Trailing PE":7.583333,"Trailing PS":0.6320754,"Quick Ratio":0.311,"Day High":11.03,"Day Low":10.7016,"VS Average Volume":0.7683152294,"Company Summary":"The AES Corporation, together with its subsidiaries, operates as a diversified power generation and utility company in the United States and internationally. The company owns and\/or operates power plants to generate and sell power to customers, such as utilities, industrial users, and other intermediaries; owns and\/or operates utilities to generate or purchase, distribute, transmit, and sell electricity to end-user customers in the residential, commercial, industrial, and governmental sectors; and generates and sells electricity on the wholesale market. It uses various fuels and technologies to generate electricity, such as coal, gas, hydro, wind, solar, and biomass, as well as renewables comprising energy storage and landfill gas. The company owns and\/or operates a generation portfolio of approximately 34,596 megawatts and distributes power to 2.6 million customers. The company was formerly known as Applied Energy Services, Inc. and changed its name to The AES Corporation in April 2000. The AES Corporation was incorporated in 1981 and is headquartered in Arlington, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"STARWOOD PROPERTY TRUST, INC. S","Symbol":"STWD","Current Price":"19.98","Latest MA":"19.67","Latest MA 5":19.9759999237,"Latest MA 9":19.9211112637,"Latest MA 20":19.6744999161,"Price Target":22.25,"Difference from MA":"1.55%","Difference from Open":"-0.25%","Change from Yesterday":"-0.15%","Change from Last Report":"0.00","Latest Volume":"2,210,591","Market Cap":"6,930,243,072","Earning Date":"2025-02-27","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.142132,"PB Ratio":1.0302687,"Previous Close":20.01,"ROE":0.05487,"DTE":247.606,"Industry":"REIT - Mortgage","Sector":"Real Estate","Beta":1.736,"Trailing PEG":null,"Trailing PE":16.932203,"Trailing PS":15.878264,"Quick Ratio":7.016,"Day High":20.225,"Day Low":19.965,"VS Average Volume":1.0720974659,"Company Summary":"Starwood Property Trust, Inc. operates as a real estate investment trust (REIT) in the United States and internationally. The company operates through Commercial and Residential Lending, Infrastructure Lending, Property, and Investing and Servicing segments. The Commercial and Residential Lending segment originates, acquires, finances, and manages commercial first mortgages, non-agency residential mortgages, subordinated mortgages, mezzanine loans, preferred equity, commercial mortgage-backed securities (CMBS), and residential mortgage-backed securities, as well as other real estate and real estate-related debt investments, include distressed or non-performing loans. The Infrastructure lending segment originates, acquires, finances, and manages infrastructure debt investments. The Property segment engages primarily in acquiring and managing equity interests in stabilized commercial real estate properties, such as multifamily properties and commercial properties subject to net leases, that are held for investment. The Investing and Servicing segment manages and works out problem assets; acquires and manages unrated, investment grade, and non-investment grade rated CMBS comprising subordinated interests of securitization and re-securitization transactions; originates conduit loans for the primary purpose of selling these loans into securitization transactions; and acquires commercial real estate assets that include properties acquired from CMBS trusts. The company qualifies as a REIT for federal income tax purposes and would not be subject to federal corporate income taxes if it distributes at least 90% of its taxable income to its stockholders. The company was incorporated in 2009 and is headquartered in Greenwich, Connecticut.","Stock Sentiment":"N\/A","Row Color":"positive-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"TechnipFMC plc","Symbol":"FTI","Current Price":"27.89","Latest MA":"30.28","Latest MA 5":28.791999939,"Latest MA 9":29.6111113909,"Latest MA 20":30.2805001564,"Price Target":33.72,"Difference from MA":"-7.89%","Difference from Open":"0.47%","Change from Yesterday":"0.14%","Change from Last Report":"0.00","Latest Volume":"7,460,836","Market Cap":"11,864,823,808","Earning Date":"2025-02-27","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":14.15736,"PB Ratio":3.640517,"Previous Close":27.85,"ROE":0.19940001,"DTE":58.911,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.535,"Trailing PEG":0.288,"Trailing PE":18.470198,"Trailing PS":1.3487965,"Quick Ratio":0.785,"Day High":28.145,"Day Low":27.51,"VS Average Volume":2.1416573422,"Company Summary":"TechnipFMC plc engages in the energy projects, technologies, and systems and services businesses in Europe, Central Asia, North America, Latin America, the Asia Pacific, Africa, the Middle East, and internationally. It operates through two segments: Subsea and Surface Technologies. The Subsea segment engages in the design, engineering, procurement, manufacturing, fabrication, installation, and life of field services for subsea systems, subsea field infrastructure, and subsea pipe systems used in oil and gas production and transportation. It provides subsea production and processing system; flexible pipe; subsea umbilicals, risers, and flowlines; vessels; robotics; well and asset services; and Subsea Studio for optimizing the development, execution, and operation of current and future subsea fields. The Surface Technologies segment designs, manufactures, and services products and systems used in land and shallow water exploration and production of crude oil and natural gas. This segment offers drilling; surface wellheads and production trees systems; iComplete, a pressure control system; fracturing tree and manifold systems; flexible pipes; safety and integrity systems, multiphase meter modules, in-line separation and processing systems, and standard pumps; well control and integrity systems; separation and processing systems; skid systems; and flow measurement and automation solutions. It also offers planning, testing and installation, commissioning, operations, replacement and upgrade, maintenance, storage, preservation, intervention, integrity, decommissioning, and abandonment; and supplies flowline products and services. TechnipFMC plc was founded in 1884 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Edison International","Symbol":"EIX","Current Price":"52.61","Latest MA":"52.09","Latest MA 5":52.2139998169,"Latest MA 9":51.8188887024,"Latest MA 20":52.0864999466,"Price Target":78.34167,"Difference from MA":"1.01%","Difference from Open":"0.55%","Change from Yesterday":"0.86%","Change from Last Report":"0.00","Latest Volume":"5,605,820","Market Cap":"20,367,962,112","Earning Date":"2025-02-27","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":9.229825,"PB Ratio":1.4529939,"Previous Close":52.16,"ROE":0.07411,"DTE":202.126,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.907,"Trailing PEG":0.6187,"Trailing PE":15.38304,"Trailing PS":1.1759114,"Quick Ratio":0.492,"Day High":52.8,"Day Low":51.78,"VS Average Volume":1.1832952856,"Company Summary":"Edison International, through its subsidiaries, engages in the generation and distribution of electric power. The company supplies and delivers electricity to approximately 50,000 square mile area of southern California to residential, commercial, industrial, public authorities, agricultural, and other sectors. Its transmission facilities consist of lines ranging from 55 kV to 500 kV and approximately 80 transmission substations; distribution system consists of approximately 38,000 circuit-miles of overhead lines; approximately 31,000 circuit-miles of underground lines; and 730 distribution substations. The company was founded in 1886 and is based in Rosemead, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Hormel Foods Corporation","Symbol":"HRL","Current Price":"28.73","Latest MA":"29.17","Latest MA 5":29.1759999237,"Latest MA 9":28.8588888889,"Latest MA 20":29.1680001488,"Price Target":31.732,"Difference from MA":"-1.50%","Difference from Open":"-1.84%","Change from Yesterday":"-2.35%","Change from Last Report":"0.00","Latest Volume":"3,586,947","Market Cap":"15,773,143,040","Earning Date":"2025-02-27","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":17.0,"PB Ratio":1.97186,"Previous Close":29.42,"ROE":0.10222,"DTE":37.633,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.26,"Trailing PEG":2.8822,"Trailing PE":19.544216,"Trailing PS":1.3231618,"Quick Ratio":1.168,"Day High":29.28,"Day Low":28.5556,"VS Average Volume":1.3003855173,"Company Summary":"Hormel Foods Corporation develops, processes, and distributes various meat, nuts, and other food products to foodservice, convenience store, and commercial customers in the United States and internationally. It operates through three segments: Retail, Foodservice, and International segments. The company provides various perishable products that include fresh meats, frozen items, refrigerated meal solutions, bacons, sausages, hams, and guacamoles; and shelf-stable products comprising canned luncheon meats, nut butters, snack nuts, chili, shelf-stable microwaveable meals, hash, stews, tortillas, salsas, tortilla chips, nutritional food supplements, and others. It sells its products under the HORMEL, ALWAYS TENDER, APPLEGATE, AUSTIN BLUES, BACON 1, BLACK LABEL, BREAD READY, BURKE, CAFÉ H, CERATTI, CHI-CHI'S, COLUMBUS, COMPLEATS, CORN NUTS, CURE 81, DAN'S PRIZE, DI LUSSO, DINTY MOORE, DON MIGUEL, DOÑA MARIA, EMBASA, FAST \u0091N EASY, FIRE BRAISED, FONTANINI, HERDEZ, HORMEL GATHERINGS, HOUSE OF TSANG, JENNIE-O, JUSTIN'S, LA VICTORIA, LAYOUT, LLOYD'S, MARY KITCHEN, MR. PEANUT, NATURAL CHOICE, NUT-RITION, OLD SMOKEHOUSE, OVEN READY, PILLOW PACK, PLANTERS, ROSA GRANDE, SADLER'S SMOKEHOUSE, SKIPPY, SPAM, SQUARE TABLE, SPECIAL RECIPE, VALLEY FRESH, and WHOLLY brands through sales personnel, independent brokers, and distributors. The company was formerly known as Geo. A. Hormel & Company and changed its name to Hormel Foods Corporation in January 1995. Hormel Foods Corporation was founded in 1891 and is headquartered in Austin, Minnesota.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Rocket Companies, Inc.","Symbol":"RKT","Current Price":"13.08","Latest MA":"12.84","Latest MA 5":13.1879999313,"Latest MA 9":13.1288888804,"Latest MA 20":12.8439999619,"Price Target":13.15385,"Difference from MA":"1.84%","Difference from Open":"-4.25%","Change from Yesterday":"-5.08%","Change from Last Report":"0.00","Latest Volume":"5,168,322","Market Cap":"25,993,883,648","Earning Date":"2025-02-27","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":19.81818,"PB Ratio":2.9053755,"Previous Close":13.78,"ROE":-0.02912,"DTE":183.097,"Industry":"Mortgage Finance","Sector":"Financial Services","Beta":2.408,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":6.038555,"Quick Ratio":0.616,"Day High":13.71,"Day Low":12.93,"VS Average Volume":1.6303278875,"Company Summary":"Rocket Companies, Inc., a fintech holding company, provides mortgage lending, title and settlement services, and other financial technology services in the United States and Canada. It operates through two segments, Direct to Consumer and Partner Network. The company's solutions include Rocket Mortgage, a mortgage lender; Amrock that provides title insurance, property valuation, and settlement services; Rocket Homes, a home search platform and real estate agent referral network, which offers technology-enabled services to support the home buying and selling experience; and Rocket Loans, an online-based personal loans business. It also offers Core Digital Media, a online marketing platform in the mortgage and personal financial product sectors; Rocket Money, a personal finance app that helps clients manage every aspect of their financial lives; Lendesk, a software services company that provides a point of sale system for mortgage professionals and a loan origination system for private lenders; Rock Connections, a sales and support platform specializing in contact center services; and Rocket Innovation Studio that recruits and mentors top technology talent. In addition, the company originates, closes, sells, and services agency-conforming loans. Rocket Companies, Inc. was founded in 1985 and is headquartered in Detroit, Michigan. The company operates as a subsidiary of Rock Holdings Inc.","Stock Sentiment":"N\/A","Row Color":"positive-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Vistra Corp.","Symbol":"VST","Current Price":"148.19","Latest MA":"163.09","Latest MA 5":148.4979975586,"Latest MA 9":157.1588878038,"Latest MA 20":163.0914999695,"Price Target":175.17188,"Difference from MA":"-9.14%","Difference from Open":"3.63%","Change from Yesterday":"7.45%","Change from Last Report":"0.00","Latest Volume":"9,080,996","Market Cap":"50,418,089,984","Earning Date":"2025-02-27","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":21.476812,"PB Ratio":17.029419,"Previous Close":137.92,"ROE":0.30168,"DTE":183.15,"Industry":"Utilities - Independent Power Producers","Sector":"Utilities","Beta":1.237,"Trailing PEG":0.9111,"Trailing PE":27.907722,"Trailing PS":3.0997903,"Quick Ratio":0.408,"Day High":150.2,"Day Low":142.56,"VS Average Volume":1.2245818909,"Company Summary":"Vistra Corp., together with its subsidiaries, operates as an integrated retail electricity and power generation company. The company operates through six segments: Retail, Texas, East, West, Sunset, and Asset Closure. It retails electricity and natural gas to residential, commercial, and industrial customers across states in the United States and the District of Columbia. In addition, the company is involved in the electricity generation, wholesale energy purchases and sales, commodity risk management, fuel production, and fuel logistics management activities. It serves approximately 5 million customers with a generation capacity of approximately 41,000 megawatts with a portfolio of natural gas, nuclear, coal, solar, and battery energy storage facilities. The company was formerly known as Vistra Energy Corp. and changed its name to Vistra Corp. in July 2020. Vistra Corp. was founded in 1882 and is based in Irving, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"American Healthcare REIT, Inc.","Symbol":"AHR","Current Price":"29.72","Latest MA":"28.42","Latest MA 5":28.3040002289,"Latest MA 9":28.1944445207,"Latest MA 20":28.4190001831,"Price Target":32.125,"Difference from MA":"4.58%","Difference from Open":"2.66%","Change from Yesterday":"2.94%","Change from Last Report":"0.00","Latest Volume":"2,115,420","Market Cap":"4,549,002,752","Earning Date":"2025-02-27","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":156.42105,"PB Ratio":2.0581717,"Previous Close":28.87,"ROE":-0.01801,"DTE":92.834,"Industry":"REIT - Healthcare Facilities","Sector":"Real Estate","Beta":"N\/A","Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":2.268465,"Quick Ratio":1.018,"Day High":29.76,"Day Low":28.815,"VS Average Volume":1.2865186238,"Company Summary":"American Healthcare REIT, Inc. is a self-managed real estate investment trust that acquires, owns and operates a diversified portfolio of clinical healthcare real estate properties, focusing primarily on outpatient medical buildings, senior housing, skilled nursing facilities and other healthcare-related facilities. Its properties are located in 36 states, the United Kingdom and the Isle of Man.","Stock Sentiment":"N\/A","Row Color":"positive-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Norwegian Cruise Line Holdings ","Symbol":"NCLH","Current Price":"25.05","Latest MA":"26.76","Latest MA 5":24.8560002899,"Latest MA 9":25.6877779219,"Latest MA 20":26.7634999657,"Price Target":30.76476,"Difference from MA":"-6.40%","Difference from Open":"0.64%","Change from Yesterday":"1.87%","Change from Last Report":"0.00","Latest Volume":"11,991,020","Market Cap":"11,014,684,672","Earning Date":"2025-02-27","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":11.985646,"PB Ratio":9.701781,"Previous Close":24.59,"ROE":0.69788,"DTE":1240.664,"Industry":"Travel Services","Sector":"Consumer Cyclical","Beta":2.65,"Trailing PEG":0.3098,"Trailing PE":21.973684,"Trailing PS":1.1771924,"Quick Ratio":0.088,"Day High":25.28,"Day Low":24.76,"VS Average Volume":1.3398175433,"Company Summary":"Norwegian Cruise Line Holdings Ltd., together with its subsidiaries, operates as a cruise company in North America, Europe, the Asia-Pacific, and internationally. The company operates through the Norwegian Cruise Line, Oceania Cruises, and Regent Seven Seas Cruises brands. It offers itineraries ranging from three days to a 180-days calling on various ports, including Scandinavia, Northern Europe, the Mediterranean, the Greek Isles, Alaska, Canada and New England, Hawaii, Asia, Tahiti and the South Pacific, Australia and New Zealand, Africa, India, South America, the Panama Canal, and the Caribbean. It distributes its products through retail\/travel advisor and onboard cruise sales channels, as well as meetings, incentives, and charters. Norwegian Cruise Line Holdings Ltd. was founded in 1966 and is based in Miami, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Mosaic Company (The)","Symbol":"MOS","Current Price":"25.22","Latest MA":"26.89","Latest MA 5":25.6900002899,"Latest MA 9":26.1822224426,"Latest MA 20":26.886,"Price Target":32.45368,"Difference from MA":"-6.20%","Difference from Open":"-0.98%","Change from Yesterday":"-1.14%","Change from Last Report":"0.00","Latest Volume":"4,166,661","Market Cap":"8,011,006,464","Earning Date":"2025-02-27","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":10.252032,"PB Ratio":0.6788877,"Previous Close":25.51,"ROE":0.03346,"DTE":35.767,"Industry":"Agricultural Inputs","Sector":"Basic Materials","Beta":1.347,"Trailing PEG":1.9093,"Trailing PE":22.318584,"Trailing PS":0.69926035,"Quick Ratio":0.414,"Day High":25.66,"Day Low":25.01,"VS Average Volume":0.8963682194,"Company Summary":"The Mosaic Company, through its subsidiaries, produces and markets concentrated phosphate and potash crop nutrients in North America and internationally. The company operates through three segments: Phosphates, Potash, and Mosaic Fertilizantes. It owns and operates mines, which produce concentrated phosphate crop nutrients, such as diammonium phosphate, monoammonium phosphate, and ammoniated phosphate products; and phosphate-based animal feed ingredients primarily under the Biofos and Nexfos brand names, as well as produces a double sulfate of potash magnesia product under K-Mag brand name. The company also produces and sells potash for use in the manufacturing of mixed crop nutrients and animal feed ingredients, and for industrial use; and for use in the de-icing and as a water softener regenerant. In addition, it provides nitrogen-based crop nutrients, animal feed ingredients, and other ancillary services; and purchases and sells phosphates, potash, and nitrogen products. The company sells its products to wholesale distributors, retail chains, farmers, cooperatives, independent retailers, and national accounts. The company was incorporated in 2004 and is headquartered in Tampa, Florida.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Bloom Energy Corporation","Symbol":"BE","Current Price":"23.40","Latest MA":"24.19","Latest MA 5":23.6459999847,"Latest MA 9":24.5411110348,"Latest MA 20":24.1894999695,"Price Target":24.43478,"Difference from MA":"-3.26%","Difference from Open":"2.14%","Change from Yesterday":"6.51%","Change from Last Report":"0.00","Latest Volume":"5,145,724","Market Cap":"5,348,678,144","Earning Date":"2025-02-27","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":63.24324,"PB Ratio":12.40721,"Previous Close":21.97,"ROE":-0.26712,"DTE":372.925,"Industry":"Electrical Equipment & Parts","Sector":"Industrials","Beta":3.063,"Trailing PEG":2.4632,"Trailing PE":"N\/A","Trailing PS":4.250451,"Quick Ratio":2.15,"Day High":23.945,"Day Low":22.6998,"VS Average Volume":0.8145702231,"Company Summary":"Bloom Energy Corporation designs, manufactures, sells, and installs solid-oxide fuel cell systems for on-site power generation in the United States and internationally. The company offers Bloom Energy Server, a solid oxide technology that converts fuel, such as natural gas, biogas, hydrogen, or a blend of these fuels into electricity through an electrochemical process without combustion. It sells its products through direct and indirect sales channels to utilities, data centers, agriculture, retail, hospitals, higher education, biotech, and manufacturing industries. The company was formerly known as Ion America Corp. and changed its name to Bloom Energy Corporation in 2006. Bloom Energy Corporation was incorporated in 2001 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"ADT Inc.","Symbol":"ADT","Current Price":"7.53","Latest MA":"7.53","Latest MA 5":7.4619999466,"Latest MA 9":7.4777777757,"Latest MA 20":7.5270000114,"Price Target":8.64,"Difference from MA":"0.04%","Difference from Open":"-1.05%","Change from Yesterday":"-0.66%","Change from Last Report":"0.00","Latest Volume":"13,410,760","Market Cap":"6,709,327,872","Earning Date":"2025-02-27","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":9.4125,"PB Ratio":1.744267,"Previous Close":7.58,"ROE":0.00401,"DTE":200.656,"Industry":"Security & Protection Services","Sector":"Industrials","Beta":1.509,"Trailing PEG":null,"Trailing PE":753.00006,"Trailing PS":1.3052406,"Quick Ratio":0.451,"Day High":7.64,"Day Low":7.49,"VS Average Volume":2.3099919663,"Company Summary":"ADT Inc. provides security, interactive, and smart home solutions to residential and small business customers in the United States. It operates through two segments, Consumer and Small Business, and Solar. The company provides burglar and life safety alarms, smart security cameras, smart home automation systems, and video surveillance systems. It primarily offers security designed to detect intrusion, control access, sense movement, smoke, fire, carbon monoxide, flooding, temperature, and other environmental conditions and hazards; and address personal medical emergencies, such as injuries or unanticipated falls. The company also provides automation and smart home solutions that allow customers to use their smart phones, smart phone application, or touchscreen panels in their homes to arm and disarm their security systems; record and view real-time video; and creates customized and automated schedules for connected devices; programs systems to react to defined events; integrates system with third-party connected devices, such as cameras, lights, thermostats, appliances, and garage doors, as well as offers monitoring and maintenance services. In addition, the company offers energy storage solutions, energy efficiency upgrades, and roofing services. It offers its products under the ADT, ADT Pulse, ADT+, and ADT Commercial brand names. The company was formerly known as Prime Security Services Parent, Inc. and changed its name to ADT Inc. in September 2017. ADT Inc. was founded in 1874 and is headquartered in Boca Raton, Florida.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Perrigo Company plc","Symbol":"PRGO","Current Price":"24.90","Latest MA":"24.83","Latest MA 5":25.1879998016,"Latest MA 9":24.9077774048,"Latest MA 20":24.8264998627,"Price Target":34.2,"Difference from MA":"0.30%","Difference from Open":"-0.84%","Change from Yesterday":"-1.27%","Change from Last Report":"0.00","Latest Volume":"2,005,425","Market Cap":"3,397,057,024","Earning Date":"2025-02-27","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":7.9807696,"PB Ratio":0.74437237,"Previous Close":25.22,"ROE":-0.03158,"DTE":109.255,"Industry":"Drug Manufacturers - Specialty & Generic","Sector":"Healthcare","Beta":0.539,"Trailing PEG":0.9804,"Trailing PE":"N\/A","Trailing PS":0.77346474,"Quick Ratio":1.569,"Day High":25.4,"Day Low":24.7632,"VS Average Volume":1.5496844877,"Company Summary":"Perrigo Company plc provides over-the-counter health and wellness solutions to enhance individual well-being in the United States, Europe, and internationally. It operates through Consumer Self-Care Americas and Consumer Self-Care International segments. The company develops, manufactures, markets, and distributes self-care consumer products, such as upper respiratory products, including cough suppressants, expectorants, and sinus and allergy relief; nutrition products consisting of infant formulas and nutritional beverages; digestive health products, including antacids, anti-diarrheal, and anti-heartburn; pain and sleep-aids products comprising pain relievers and fever reducers; and oral care products, which include toothbrushes, toothbrush replacement heads, floss, flossers, whitening products, and toothbrush covers. It also offers healthy lifestyle products, such as smoking cessation, well-being, and weight management products; skin care products consisting of dermatological care, scar management, lice treatment, and other products for various skin conditions; women's health products comprising feminine hygiene and contraceptives; vitamins, minerals, and supplements; rare diseases business; and other miscellaneous self-care products. The company sells its products under the Compeed, Dr. Fresh, Firefly, Good Sense, Good Start, Mederma, Nasonex, Plackers, Prevacid24HR, REACH, Rembrandt, Steripod, Opill, Solpadeine, Coldrex, Physiomer, NiQuitin, ACO, ellaOne, Compeed Stops, XLS, Arterin, Davitamon, Apiserum, Abtei, and Nicorette brands. It also offers contract manufacturing services. The company sells its products through retail drug, supermarket, and mass merchandise chains; e-commerce stores; wholesalers; pharmacies; drug and grocery retailers; and para-pharmacies. The company was formerly known as Perrigo Company and changed its name to Perrigo Company plc in December 2013. Perrigo Company plc was founded in 1887 and is headquartered in Dublin, Ireland.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Nutanix, Inc.","Symbol":"NTNX","Current Price":"69.35","Latest MA":"70.15","Latest MA 5":69.3059985352,"Latest MA 9":70.2311097887,"Latest MA 20":70.1457489777,"Price Target":84.84067,"Difference from MA":"-1.13%","Difference from Open":"2.18%","Change from Yesterday":"3.63%","Change from Last Report":"0.00","Latest Volume":"3,244,700","Market Cap":"18,580,805,632","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":36.888298,"PB Ratio":-22.940786,"Previous Close":66.92,"ROE":"N\/A","DTE":"N\/A","Industry":"Software - Infrastructure","Sector":"Technology","Beta":"N\/A","Trailing PEG":2.3421,"Trailing PE":"N\/A","Trailing PS":8.015166,"Quick Ratio":1.571,"Day High":69.85,"Day Low":67.39,"VS Average Volume":1.4845306299,"Company Summary":"Nutanix, Inc. provides an enterprise cloud platform in North America, Europe, the Asia Pacific, the Middle East, Latin America, and Africa. The company offers hyperconverged infrastructure software stack that converges virtualization, storage, and networking services into a turnkey solution; Acropolis Hypervisor, an enterprise-grade virtualization solution; flow virtual networking and flow network security, which offers services to visualize the network, automate common network operations, and build virtual private networks; Nutanix Kubernetes Engine for automated deployment and management of Kubernetes clusters to simplify the provisioning, operations, and lifecycle management of cloud-native environments, applications, and microservices; and Nutanix Cloud Clusters. It also provides Nutanix Cloud Management that provides management, capacity planning, operational analytics, automated remediation, self-service, and one-click administration; cloud governance; and automation services that streamline application lifecycle management, provide self-service for infrastructure and applications, and deliver multicloud orchestration. In addition, the company offers Nutanix Files, an enterprise-grade network file system and server message block files services; Nutanix Objects, a S3-compatible object services; Nutanix Data Lens, a data security governance solution; and Nutanix database service that provides automated database management to simplify database administration and to manage database copies. Further, it provides product support, and consulting and implementation services. The company serves customers in a range of industries, including automotive, consumer goods, education, energy, financial services, healthcare, manufacturing, media, public sector, retail, technology, and telecommunications, as well as service providers. Nutanix, Inc. was incorporated in 2009 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"FirstEnergy Corp.","Symbol":"FE","Current Price":"43.05","Latest MA":"40.58","Latest MA 5":42.6200006104,"Latest MA 9":41.6277780321,"Latest MA 20":40.5820022964,"Price Target":46.148,"Difference from MA":"6.08%","Difference from Open":"-0.51%","Change from Yesterday":"-1.03%","Change from Last Report":"0.00","Latest Volume":"5,438,582","Market Cap":"24,810,446,848","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":14.896193,"PB Ratio":1.9964755,"Previous Close":43.5,"ROE":0.083050005,"DTE":173.13,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.51,"Trailing PEG":1.2993,"Trailing PE":27.774195,"Trailing PS":1.8714979,"Quick Ratio":0.406,"Day High":43.58,"Day Low":42.965,"VS Average Volume":1.610782618,"Company Summary":"FirstEnergy Corp., through its subsidiaries, generates, transmits, and distributes electricity in the United States. It operates through Regulated Distribution and Regulated Transmission segments. The company owns and operates coal-fired, nuclear, hydroelectric, wind, and solar power generating facilities. It operates 24,080 circuit miles of overhead and underground transmission lines; and electric distribution systems, including 274,518 miles of overhead pole line and underground conduit carrying primary, secondary, and street lighting circuits. The company serves approximately 6 million customers in Ohio, Pennsylvania, West Virginia, Maryland, New Jersey, and New York. FirstEnergy Corp. was incorporated in 1996 and is headquartered in Akron, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"NRG Energy, Inc.","Symbol":"NRG","Current Price":"113.33","Latest MA":"105.36","Latest MA 5":107.2460003052,"Latest MA 9":108.2666674805,"Latest MA 20":105.3563529053,"Price Target":117.82556,"Difference from MA":"7.57%","Difference from Open":"7.40%","Change from Yesterday":"10.63%","Change from Last Report":"0.00","Latest Volume":"4,541,939","Market Cap":"22,507,792,384","Earning Date":"2025-02-26","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":16.424637,"PB Ratio":12.313125,"Previous Close":102.44,"ROE":0.4179,"DTE":443.543,"Industry":"Utilities - Independent Power Producers","Sector":"Utilities","Beta":"N\/A","Trailing PEG":null,"Trailing PE":22.711424,"Trailing PS":0.8001348,"Quick Ratio":0.505,"Day High":115.35,"Day Low":105.31,"VS Average Volume":1.6399976313,"Company Summary":"NRG Energy, Inc., together with its subsidiaries, operates as an energy and home services company in the United States and Canada. It operates through Texas; East; West\/Services\/Other; Vivint Smart Home; and Corporate Activities segments. The company produces and sells electricity generated using coal, oil, solar, and battery storage; natural gas; and a cloud-based home platform, including hardware, software, sales, installation, customer service, technical support, and professional monitoring solutions. It offers retail electricity and energy management, line and surge protection products, HVAC installation, repair and maintenance, home protection products, carbon offsets, back-up power stations, portable power, portable solar, and portable lighting; retail services comprising demand response, commodity sales, energy efficiency, and energy management solutions; and system power, distributed generation, renewable and low-carbon products, carbon management and specialty services, backup generation, storage and distributed solar, and energy advisory services. In addition, the company trades in power, natural gas, and related commodities; environmental products; weather products; and financial products, including forwards, futures, options, and swaps. It offers its products and services under the NRG, Reliant, Direct Energy, Green Mountain Energy, and Vivint. It serves residential, commercial, government, industrial, and wholesale customers. NRG Energy, Inc. was founded in 1989 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"APi Group Corporation","Symbol":"APG","Current Price":"40.00","Latest MA":"38.59","Latest MA 5":40.0,"Latest MA 9":39.1999999152,"Latest MA 20":38.5945001602,"Price Target":45.1,"Difference from MA":"3.64%","Difference from Open":"-0.57%","Change from Yesterday":"-0.30%","Change from Last Report":"0.00","Latest Volume":"3,066,680","Market Cap":"11,092,879,360","Earning Date":"2025-02-26","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":18.779343,"PB Ratio":3.7397158,"Previous Close":40.12,"ROE":0.0859,"DTE":102.777,"Industry":"Engineering & Construction","Sector":"Industrials","Beta":"N\/A","Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":1.5806326,"Quick Ratio":1.271,"Day High":40.79,"Day Low":38.08,"VS Average Volume":2.3606643188,"Company Summary":"APi Group Corporation provides safety and specialty services worldwide. It operates through Safety Services and Specialty Services segments. The Safety Services segment offers solutions focusing on end-to-end integrated occupancy systems, such as fire protection services; heating, ventilation, and air conditioning solutions; and entry systems, which include the design, installation, inspection, and service of these integrated systems. The Specialty Services segment provides various infrastructure and specialized industrial plant services, including maintenance and repair of underground electric, gas, water, sewer, and telecommunications infrastructure. This segment also offers engineering and design, fabrication, installation, maintenance service and repair, retrofitting and upgrading services, pipeline infrastructure, access and road construction, supporting facilities, and integrity management and maintenance to the energy industry. It serves customers in the public and private sectors, including commercial, industrial, distribution and fulfillment centers, manufacturing, education, healthcare, telecom, utilities, transmission and integrity, high tech, entertainment, government, and infrastructure markets. The company was formerly known as J2 Acquisition Limited and changed its name to APi Group Corporation in October 2019. APi Group Corporation was founded in 1926 and is headquartered in New Brighton, Minnesota.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Option Care Health, Inc.","Symbol":"OPCH","Current Price":"33.15","Latest MA":"31.63","Latest MA 5":32.4500004578,"Latest MA 9":32.2166665819,"Latest MA 20":31.6344999504,"Price Target":32.44444,"Difference from MA":"4.79%","Difference from Open":"5.44%","Change from Yesterday":"1.59%","Change from Last Report":"0.00","Latest Volume":"3,175,588","Market Cap":"5,641,500,160","Earning Date":"2025-02-26","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":26.309525,"PB Ratio":3.9853332,"Previous Close":32.63,"ROE":0.14991,"DTE":78.665,"Industry":"Medical Care Facilities","Sector":"Healthcare","Beta":1.353,"Trailing PEG":2.7194,"Trailing PE":26.95122,"Trailing PS":1.128706,"Quick Ratio":1.054,"Day High":34.16,"Day Low":31.05,"VS Average Volume":1.7955204547,"Company Summary":"Option Care Health, Inc. offers home and alternate site infusion services in the United States. The company provides anti-infective therapies; home infusion services to treat heart failures; home parenteral nutrition and enteral nutrition support services for numerous acute and chronic conditions, such as stroke, cancer, and gastrointestinal diseases; immunoglobulin infusion therapies for the treatment of immune deficiencies; and treatments for chronic inflammatory disorders, including crohn's disease, plaque psoriasis, psoriatic arthritis, rheumatoid arthritis, ulcerative colitis, and other chronic inflammatory disorders. It also offers treatments to manage the progression of neurological disorders, such as multiple sclerosis, duchenne muscular dystrophy, and other neurological disorder; infusion therapies for bleeding disorders, such as hemophilia and von Willebrand diseases; therapies for women with high-risk pregnancies; and other infusion therapies to treat various conditions, including pain management, chemotherapy, and respiratory medications, as well as nursing services. The company markets its services through patient referrals, including physicians, hospital discharge planners, hospital personnel, health maintenance organizations, and preferred provider organizations. Option Care Health, Inc. is headquartered in Bannockburn, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"FS KKR Capital Corp.","Symbol":"FSK","Current Price":"22.90","Latest MA":"23.35","Latest MA 5":23.4499996948,"Latest MA 9":23.5944443173,"Latest MA 20":23.3534999084,"Price Target":21.52778,"Difference from MA":"-1.94%","Difference from Open":"-2.39%","Change from Yesterday":"-2.18%","Change from Last Report":"0.00","Latest Volume":"2,453,820","Market Cap":"6,413,511,168","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":8.875969,"PB Ratio":0.9614173,"Previous Close":23.41,"ROE":0.077410005,"DTE":120.821,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.316,"Trailing PEG":null,"Trailing PE":12.180851,"Trailing PS":3.6419713,"Quick Ratio":2.756,"Day High":23.505,"Day Low":22.815,"VS Average Volume":1.8235812144,"Company Summary":"FS KKR Capital Corp. is a business development company specializing in investments in debt securities. It provides customized credit solutions to private middle market U.S. companies. It invest primarily in the senior secured debt and, to a lesser extent, the subordinated debt of private middle market U.S. companies. It seeks to purchase interests in loans through secondary market transactions or directly from the target companies as primary market investments. It also seeks to invest in first lien senior secured loans, second lien secured loans and, to a lesser extent, subordinated loans, or mezzanine loans. In connection with the debt investments, the firm also receives equity interests such as warrants or options as additional consideration. It also seek to purchase minority interests in the form of common or preferred equity in our target companies, either in conjunction with one of the debt investments or through a co-investment with a financial sponsor. Additionally, on an opportunistic basis, the fund may also invest in corporate bonds and similar debt securities. The fund does not seek to invest in start-up companies, turnaround situations, or companies with speculative business plans. It seeks to invest in small and middle-market companies based in United States. The fund seeks to invest in firms with annual revenue between $10 million to $2.5 billion. It focus on providing customized one-stop credit solutions to private upper middle market companies with annual EBITDA of $50 million to $100 million at the time of investment. It seeks to exit from securities by selling them in a privately negotiated over- the- counter market. For any investments that are not able to be sold within the secondary market, the firm seeks to exit such investments through repayment, an initial public offering of equity securities, merger, sale or recapitalization.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Paramount Global","Symbol":"PARA","Current Price":"11.22","Latest MA":"11.04","Latest MA 5":11.4700000229,"Latest MA 9":11.3566667472,"Latest MA 20":11.0440000401,"Price Target":12.892,"Difference from MA":"1.59%","Difference from Open":"-2.43%","Change from Yesterday":"-2.43%","Change from Last Report":"0.00","Latest Volume":"10,451,453","Market Cap":"7,940,147,712","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":6.8834357,"PB Ratio":0.46131074,"Previous Close":11.5,"ROE":-0.30945,"DTE":92.653,"Industry":"Entertainment","Sector":"Communication Services","Beta":"N\/A","Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.27180186,"Quick Ratio":0.995,"Day High":11.595,"Day Low":11.12,"VS Average Volume":1.1869645348,"Company Summary":"Paramount Global operates as a media, streaming, and entertainment company worldwide. It operates through TV Media, Direct-to-Consumer, and Filmed Entertainment segments. The TV Media segment operates CBS Television Network, a domestic broadcast television network; CBS Stations, a television station; and international free-to-air networks comprising Network 10, Channel 5, Telefe, and Chilevisión; domestic premium and basic cable networks, such as Paramount+ with Showtime, MTV, Comedy Central, Paramount Network, The Smithsonian Channel, Nickelodeon, BET Media Group, and CBS Sports Network; and international extensions of these brands. This segment also offers domestic and international television studio operations, including CBS Studios, Paramount Television Studios, and Showtime\/MTV Entertainment Studios; CBS Media Ventures, which produces and distributes first-run syndicated programming; and digital properties consisting of CBS News Streaming and CBS Sports HQ. The Direct-to-Consumer segment provides a portfolio of domestic and international pay and free streaming services, including Paramount+, Pluto TV, BET+, and Noggin. The Filmed Entertainment segment produces and acquires films, series, and short-form content for release and licensing around the world, including in theaters, on streaming services, on television, through digital home entertainment, and DVDs\/Blu-rays; and operates a portfolio consisting of Paramount Pictures, Paramount Players, Paramount Animation, Nickelodeon Studio, Awesomeness, and Miramax. It also offers production, distribution, and advertising solutions. The company was formerly known as ViacomCBS Inc. and changed its name to Paramount Global in February 2022. The company was founded in 1914 and is headquartered in New York, New York. Paramount Global is a subsidiary of National Amusements, Inc.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"NVIDIA Corporation","Symbol":"NVDA","Current Price":"131.28","Latest MA":"130.00","Latest MA 5":132.5459978638,"Latest MA 9":135.0555531481,"Latest MA 20":130.004499115,"Price Target":173.07855,"Difference from MA":"0.98%","Difference from Open":"1.00%","Change from Yesterday":"3.67%","Change from Last Report":"0.00","Latest Volume":"301,276,792","Market Cap":"3,215,047,262,208","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":31.864079,"PB Ratio":40.506016,"Previous Close":126.63,"ROE":1.1917701,"DTE":12.583,"Industry":"Semiconductors","Sector":"Technology","Beta":"N\/A","Trailing PEG":0.9409,"Trailing PE":44.65306,"Trailing PS":24.636944,"Quick Ratio":3.672,"Day High":133.73,"Day Low":128.49,"VS Average Volume":1.2681894795,"Company Summary":"NVIDIA Corporation provides graphics and compute and networking solutions in the United States, Taiwan, China, Hong Kong, and internationally. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro\/NVIDIA RTX GPUs for enterprise workstation graphics; virtual GPU or vGPU software for cloud-based visual and virtual computing; automotive platforms for infotainment systems; and Omniverse software for building and operating metaverse and 3D internet applications. The Compute & Networking segment comprises Data Center computing platforms and end-to-end networking platforms, including Quantum for InfiniBand and Spectrum for Ethernet; NVIDIA DRIVE automated-driving platform and automotive development agreements; Jetson robotics and other embedded platforms; NVIDIA AI Enterprise and other software; and DGX Cloud software and services. The company's products are used in gaming, professional visualization, data center, and automotive markets. It sells its products to original equipment manufacturers, original device manufacturers, system integrators and distributors, independent software vendors, cloud service providers, consumer internet companies, add-in board manufacturers, distributors, automotive manufacturers and tier-1 automotive suppliers, and other ecosystem participants. It has a strategic collaboration with IQVIA to help realize the potential of AI in healthcare and life sciences. NVIDIA Corporation was incorporated in 1993 and is headquartered in Santa Clara, California.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Ovintiv Inc. (DE)","Symbol":"OVV","Current Price":"41.90","Latest MA":"43.53","Latest MA 5":43.3100003052,"Latest MA 9":43.7555557251,"Latest MA 20":43.527500267,"Price Target":58.5395,"Difference from MA":"-3.74%","Difference from Open":"-1.41%","Change from Yesterday":"-0.95%","Change from Last Report":"0.00","Latest Volume":"3,297,132","Market Cap":"10,907,576,320","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":6.6932907,"PB Ratio":1.0561073,"Previous Close":42.3,"ROE":0.10869,"DTE":60.71,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":"N\/A","Trailing PEG":null,"Trailing PE":5.5277047,"Trailing PS":1.2015396,"Quick Ratio":0.47,"Day High":42.57,"Day Low":41.53,"VS Average Volume":1.2600165779,"Company Summary":"Ovintiv Inc., together with its subsidiaries, explores, develops, produces, and markets natural gas, oil, and natural gas liquids in the United States and Canada. The company operates through USA Operations, Canadian Operations, and Market Optimization segments. Its principal assets include Permian in west Texas and Anadarko in west-central Oklahoma; and Montney in northeast British Columbia and northwest Alberta. In addition, the company's upstream assets comprise Bakken in northwest North Dakota, and Uinta in central Utah; and Horn River in northeast British Columbia. The company was formerly known as Encana Corporation and changed its name to Ovintiv Inc. in January 2020. Ovintiv Inc. was incorporated in 2020 and is based in Denver, Colorado.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Lineage, Inc.","Symbol":"LINE","Current Price":"57.13","Latest MA":"57.05","Latest MA 5":55.1180005798,"Latest MA 9":55.3733337063,"Latest MA 20":57.0524999084,"Price Target":73.82353,"Difference from MA":"0.14%","Difference from Open":"2.94%","Change from Yesterday":"2.27%","Change from Last Report":"0.00","Latest Volume":"2,688,367","Market Cap":"14,390,533,120","Earning Date":"2025-02-26","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":78.26028,"PB Ratio":1.5079448,"Previous Close":55.86,"ROE":-0.09558,"DTE":70.312,"Industry":"REIT - Industrial","Sector":"Real Estate","Beta":"N\/A","Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":2.6948562,"Quick Ratio":0.669,"Day High":57.85,"Day Low":54.75,"VS Average Volume":2.8509721994,"Company Summary":"Lineage, Inc. is the world's largest global temperature-controlled warehouse REIT with a network of over 480 strategically located facilities totaling over 84.1 million square feet and 3.0 billion cubic feet of capacity across countries in North America, Europe, and Asia-Pacific. Coupling end-to-end supply chain solutions and technology, Lineage partners with some of the world's largest food and beverage producers, retailers, and distributors to help increase distribution efficiency, advance sustainability, minimize supply chain waste, and, most importantly, feed the world.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Expand Energy Corporation","Symbol":"EXE","Current Price":"102.43","Latest MA":"104.21","Latest MA 5":103.9020003662,"Latest MA 9":104.856666531,"Latest MA 20":104.2147502747,"Price Target":117.92308,"Difference from MA":"-1.71%","Difference from Open":"-0.31%","Change from Yesterday":"-0.45%","Change from Last Report":"0.00","Latest Volume":"2,962,106","Market Cap":"23,740,200,960","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":24.15802,"PB Ratio":1.358362,"Previous Close":102.89,"ROE":0.02483,"DTE":20.092,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":0.508,"Trailing PEG":17.1359,"Trailing PE":"N\/A","Trailing PS":7.2136736,"Quick Ratio":1.452,"Day High":104.15,"Day Low":102.21,"VS Average Volume":1.1443263802,"Company Summary":"Expand Energy Corporation operates as an independent exploration and production company in the United States. It engages in acquisition, exploration, and development of properties to produce oil, natural gas, and natural gas liquids from underground reservoirs. The company holds interests in natural gas resource plays in the Marcellus Shale in the northern Appalachian Basin in Pennsylvania and the Haynesville\/Bossier Shales in northwestern Louisiana. As of December 31, 2023, the company owns a portfolio of onshore U.S. unconventional natural gas assets, including interests in approximately 5,000 natural gas wells. The company was formerly known as Chesapeake Energy Corporation and changed its name to Expand Energy Corporation in October 2024. Expand Energy Corporation was founded in 1989 and is based in Oklahoma City, Oklahoma.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Urban Outfitters, Inc.","Symbol":"URBN","Current Price":"52.92","Latest MA":"55.35","Latest MA 5":53.4159999695,"Latest MA 9":54.7411111111,"Latest MA 20":55.3479996643,"Price Target":57.92308,"Difference from MA":"-4.39%","Difference from Open":"-0.47%","Change from Yesterday":"0.55%","Change from Last Report":"0.00","Latest Volume":"2,682,172","Market Cap":"4,883,303,936","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":13.745455,"PB Ratio":1.9759539,"Previous Close":52.63,"ROE":0.17559,"DTE":44.441,"Industry":"Apparel Retail","Sector":"Consumer Cyclical","Beta":"N\/A","Trailing PEG":1.1728,"Trailing PE":15.163323,"Trailing PS":0.87976897,"Quick Ratio":0.636,"Day High":54.25,"Day Low":52.64,"VS Average Volume":1.4765189637,"Company Summary":"Urban Outfitters, Inc. engages in the retail and wholesale of general consumer products. The company operates through three segments: Retail, Wholesale, and Nuuly. It operates Urban Outfitters stores, which offer women's and men's fashion apparel, activewear, intimates, footwear, accessories, home goods, electronics, and beauty products for young adults aged 18 to 28; and Anthropologie stores that provide women's apparel, accessories, intimates, shoes, and home furnishings, as well as gifts, decorative items, and beauty and wellness products for women aged 28 to 45. The company also operates Terrain stores that provide lifestyle home products, garden and outdoor living products, antiques, live plants, flowers, wellness products, and accessories. In addition, it operates Free People retail stores, which offer casual women's apparel, intimates, activewear, shoes, accessories, home products, gifts, and beauty and wellness products for young women aged 25 to 30; and restaurants, as well as women's apparel subscription rental service under the Nuuly brand. Further, the company is involved in the wholesale of young women's contemporary casual apparel, intimates, activewear, and shoes under the Free People brand; and apparel collections under the Urban Outfitters brand. The company serves its customers directly through retail stores, websites, mobile applications, catalogs and customer contact centers, franchisee-owned stores, and department and specialty stores, as well as social media and third-party digital platforms. Urban Outfitters, Inc. was founded in 1970 and is based in Philadelphia, Pennsylvania.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"FTAI Aviation Ltd.","Symbol":"FTAI","Current Price":"140.32","Latest MA":"118.06","Latest MA 5":135.3000015869,"Latest MA 9":126.9933336385,"Latest MA 20":118.0559993896,"Price Target":185.50539,"Difference from MA":"18.86%","Difference from Open":"2.69%","Change from Yesterday":"5.54%","Change from Last Report":"0.00","Latest Volume":"2,092,905","Market Cap":"14,389,816,320","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":28.578413,"PB Ratio":177.17172,"Previous Close":132.95,"ROE":0.0675,"DTE":4228.294,"Industry":"Rental & Leasing Services","Sector":"Industrials","Beta":"N\/A","Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":8.294315,"Quick Ratio":0.766,"Day High":143.84,"Day Low":135.46,"VS Average Volume":0.6826071755,"Company Summary":"FTAI Aviation Ltd. owns and acquires aviation and offshore energy equipment for the transportation of goods and people worldwide. It operates through two segments, Aviation Leasing and Aerospace Products. The Aviation Leasing segment owns and manages aviation assets, including aircraft and aircraft engines, which it leases and sells to customers. As of December 31, 2023, this segment owned and managed 363 aviation assets consisting of 96 commercial aircraft and 267 engines, including eight aircraft and seventeen engines that were located in Russia. The Aerospace Products segment develops, manufactures, repairs, and sells aircraft engines and aftermarket components for aircraft engines. The company was founded in 2011 and is headquartered in New York, New York.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"UWM Holdings Corporation","Symbol":"UWMC","Current Price":"6.20","Latest MA":"6.29","Latest MA 5":6.4599999809,"Latest MA 9":6.453333346,"Latest MA 20":6.285999999,"Price Target":6.725,"Difference from MA":"-1.37%","Difference from Open":"4.73%","Change from Yesterday":"-5.78%","Change from Last Report":"0.00","Latest Volume":"7,018,139","Market Cap":"9,909,273,600","Earning Date":"2025-02-26","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.47826,"PB Ratio":5.876777,"Previous Close":6.58,"ROE":-0.06532,"DTE":559.527,"Industry":"Mortgage Finance","Sector":"Financial Services","Beta":1.707,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":3.6331415,"Quick Ratio":0.134,"Day High":6.215,"Day Low":5.81,"VS Average Volume":2.2553686867,"Company Summary":"UWM Holdings Corporation engages in the residential mortgage lending business in the United States. The company offers mortgage loans through wholesale channel. It originates primarily conforming and government loans. UWM Holdings Corporation was founded in 1986 and is headquartered in Pontiac, Michigan.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"AerCap Holdings N.V.","Symbol":"AER","Current Price":"102.34","Latest MA":"99.15","Latest MA 5":102.5739997559,"Latest MA 9":102.3455551826,"Latest MA 20":99.1479997559,"Price Target":116.33333,"Difference from MA":"3.22%","Difference from Open":"-2.53%","Change from Yesterday":"0.83%","Change from Last Report":"0.00","Latest Volume":"3,550,990","Market Cap":"19,417,071,616","Earning Date":"2025-02-26","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.361111,"PB Ratio":1.0828826,"Previous Close":101.5,"ROE":0.124280006,"DTE":263.573,"Industry":"Rental & Leasing Services","Sector":"Industrials","Beta":1.808,"Trailing PEG":null,"Trailing PE":9.484708,"Trailing PS":2.4281526,"Quick Ratio":0.487,"Day High":105.255,"Day Low":100.05,"VS Average Volume":3.3297700661,"Company Summary":"AerCap Holdings N.V. engages in the lease, financing, sale, and management of commercial flight equipment in China, Hong Kong, Macau, the United States, Ireland, and internationally. The company offers aircraft asset management services, such as remarketing aircraft and engines; collecting rental and maintenance rent payments, monitoring aircraft maintenance, monitoring and enforcing contract compliance, and accepting delivery and redelivery of aircraft and engines; and conducting ongoing lessee financial performance reviews. Its aircraft asset management services also include periodically inspecting the leased aircraft and engines; coordinating technical modifications to aircraft to meet new lessee requirements; conducting restructuring negotiations in connection with lease defaults; repossessing aircraft and engines; arranging and monitoring insurance coverage; registering and de-registering aircraft; arranging for aircraft and engine valuations; and providing market research services. In addition, the company provides cash management services, including treasury services, such as the financing, refinancing, hedging, and ongoing cash management of vehicles; and administrative services comprising accounting and corporate secretarial services consisting of the preparation of budgets and financial statements. Further, it offers airframe and engine parts and supply chain solutions to airlines; maintenance, repair, and overhaul service providers; and aircraft parts distributors. The company had a portfolio of owned, managed, or on order aircraft. AerCap Holdings N.V. was founded in 1995 and is headquartered in Dublin, Ireland.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"APA Corporation","Symbol":"APA","Current Price":"22.01","Latest MA":"22.63","Latest MA 5":22.734000351,"Latest MA 9":22.9400000848,"Latest MA 20":22.6294999962,"Price Target":30.53517,"Difference from MA":"-2.74%","Difference from Open":"-2.09%","Change from Yesterday":"-1.65%","Change from Last Report":"0.00","Latest Volume":"8,659,649","Market Cap":"8,142,533,632","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":8.003636,"PB Ratio":1.5920434,"Previous Close":22.38,"ROE":0.6186,"DTE":105.032,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":3.158,"Trailing PEG":null,"Trailing PE":3.1264205,"Trailing PS":0.9092723,"Quick Ratio":0.587,"Day High":22.5,"Day Low":21.74,"VS Average Volume":1.3261192686,"Company Summary":"APA Corporation, an independent energy company, explores for, develops, and produces natural gas, crude oil, and natural gas liquids. It has oil and gas operations in the United States, Egypt, and North Sea. The company also has exploration and appraisal activities in Suriname, as well as holds interests in projects located in Uruguay and internationally. APA Corporation was incorporated in 1954 and is headquartered in Houston, Texas.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"eBay Inc.","Symbol":"EBAY","Current Price":"69.14","Latest MA":"68.48","Latest MA 5":69.7819993286,"Latest MA 9":69.6866667684,"Latest MA 20":68.4845001526,"Price Target":64.18276,"Difference from MA":"0.96%","Difference from Open":"-2.62%","Change from Yesterday":"-2.52%","Change from Last Report":"0.00","Latest Volume":"8,791,461","Market Cap":"33,118,060,544","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":13.245212,"PB Ratio":6.3941555,"Previous Close":70.93,"ROE":0.34291,"DTE":150.155,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":"N\/A","Trailing PEG":null,"Trailing PE":17.503798,"Trailing PS":3.2206614,"Quick Ratio":1.124,"Day High":71.61,"Day Low":68.84,"VS Average Volume":2.0279190434,"Company Summary":"eBay Inc., together with its subsidiaries, operates marketplace platforms that connect buyers and sellers in the United States, the United Kingdom, China, Germany, and internationally. The company's marketplace platform includes its online marketplace at ebay.com, off-platform businesses, and the eBay suite of mobile apps. Its platforms enable users to list, sell, and buy various products. The company was founded in 1995 and is headquartered in San Jose, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Essential Utilities, Inc.","Symbol":"WTRG","Current Price":"37.51","Latest MA":"35.70","Latest MA 5":37.0119990845,"Latest MA 9":36.3633331468,"Latest MA 20":35.7026446228,"Price Target":44.66667,"Difference from MA":"5.06%","Difference from Open":"-0.69%","Change from Yesterday":"-1.32%","Change from Last Report":"0.00","Latest Volume":"2,420,453","Market Cap":"10,300,658,688","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":17.610327,"PB Ratio":1.6665186,"Previous Close":38.01,"ROE":0.090220004,"DTE":120.505,"Industry":"Utilities - Regulated Water","Sector":"Utilities","Beta":0.857,"Trailing PEG":2.6939,"Trailing PE":18.849245,"Trailing PS":5.252359,"Quick Ratio":0.311,"Day High":37.845,"Day Low":37.335,"VS Average Volume":1.7161136308,"Company Summary":"Essential Utilities, Inc., through its subsidiaries, operates regulated utilities that provide water, wastewater, or natural gas services in the United States. The company operates through Regulated Water and Regulated Natural Gas segments. It offers water services through operating and maintenance contract with municipal authorities and other parties. In addition, the company provides utility service line protection solutions and repair services to households. It serves approximately 5.5 million residential water, commercial water, fire protection, industrial water, wastewater, and other water and utility customers in Pennsylvania, Ohio, Texas, Illinois, North Carolina, New Jersey, Indiana, Virginia, and Kentucky under the Aqua and Peoples brands. The company was formerly known as Aqua America, Inc. and changed its name to Essential Utilities, Inc. in February 2020. Essential Utilities, Inc. was founded in 1886 and is headquartered in Bryn Mawr, Pennsylvania.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Snowflake Inc.","Symbol":"SNOW","Current Price":"166.19","Latest MA":"182.77","Latest MA 5":172.8320002441,"Latest MA 9":180.4177785916,"Latest MA 20":182.7659987183,"Price Target":201.83238,"Difference from MA":"-9.07%","Difference from Open":"0.11%","Change from Yesterday":"1.21%","Change from Last Report":"0.00","Latest Volume":"9,325,087","Market Cap":"54,854,500,352","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":178.69893,"PB Ratio":18.361507,"Previous Close":164.2,"ROE":-0.31455,"DTE":89.311,"Industry":"Software - Application","Sector":"Technology","Beta":"N\/A","Trailing PEG":7.2401,"Trailing PE":"N\/A","Trailing PS":15.1264515,"Quick Ratio":1.684,"Day High":170.005,"Day Low":164.8,"VS Average Volume":1.746289614,"Company Summary":"Snowflake Inc. provides a cloud-based data platform for various organizations in the United States and internationally. Its platform offers Data Cloud, which enables customers to consolidate data into a single source of truth to drive meaningful business insights, build data-driven applications, and share data and data products, as well as applies artificial intelligence (AI) for solving business problems. The company was formerly known as Snowflake Computing, Inc. and changed its name to Snowflake Inc. in April 2019. Snowflake Inc. was incorporated in 2012 and is based in Bozeman, Montana.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Salesforce, Inc.","Symbol":"CRM","Current Price":"307.33","Latest MA":"328.23","Latest MA 5":309.9519985352,"Latest MA 9":317.7377775065,"Latest MA 20":328.229,"Price Target":388.47104,"Difference from MA":"-6.37%","Difference from Open":"-1.70%","Change from Yesterday":"0.47%","Change from Last Report":"0.00","Latest Volume":"11,331,085","Market Cap":"294,114,787,328","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":27.612757,"PB Ratio":4.817991,"Previous Close":305.88,"ROE":0.10258,"DTE":18.623,"Industry":"Software - Application","Sector":"Technology","Beta":"N\/A","Trailing PEG":1.3791,"Trailing PE":48.322323,"Trailing PS":7.7613087,"Quick Ratio":0.928,"Day High":313.7,"Day Low":306.5,"VS Average Volume":1.7089267565,"Company Summary":"Salesforce, Inc. provides Customer Relationship Management (CRM) technology that brings companies and customers together worldwide. The company's service includes sales to store data, monitor leads and progress, forecast opportunities, gain insights through analytics and artificial intelligence, and deliver quotes, contracts, and invoices; and service that enables companies to deliver trusted and highly personalized customer support at scale. In addition, its platform offering comprise a flexible platform that enables companies of various sizes, locations, and industries to build business workflow and apps with customer; online learning platform that allows anyone to learn in-demand Salesforce skills; and Slack, an intelligent productivity platform. The company's marketing services enables companies to plan, personalize, automate, and optimize customer marketing journey, connecting interaction, and connected products; and commerce services, which empowers shopping experience across various customer touchpoint, such as mobile, web, social, and stores and provides click-to-code tools that offers customers to build and deploy solutions. Further, its analytics offering includes Tableau, an end-to-end analytics solution for range of enterprise use cases and intelligent analytics with AI models, spot trends, predict outcomes, creates summaries, timely recommendations, and take action from any device; and integration service including MuleSoft, which provides building blocks to deliver end-to-end and connected experiences. Additionally, the company provides data cloud, a hyperscale data engine native to Salesforce; vertical services to meet the needs of customers in industries, such as financial services, healthcare and life sciences, manufacturing and automotive and government; and offers salesforce starter for small and medium-sized businesses. Salesforce, Inc. was incorporated in 1999 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"CRH PLC","Symbol":"CRH","Current Price":"102.33","Latest MA":"102.51","Latest MA 5":101.179999939,"Latest MA 9":104.1455559285,"Latest MA 20":102.5065001526,"Price Target":113.90909,"Difference from MA":"-0.17%","Difference from Open":"0.69%","Change from Yesterday":"2.03%","Change from Last Report":"0.00","Latest Volume":"4,688,562","Market Cap":"69,189,615,616","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":16.85832,"PB Ratio":3.180321,"Previous Close":100.29,"ROE":"N\/A","DTE":66.934,"Industry":"Building Materials","Sector":"Basic Materials","Beta":1.384,"Trailing PEG":1.722,"Trailing PE":20.384462,"Trailing PS":1.955227,"Quick Ratio":0.881,"Day High":103.6,"Day Low":101.5,"VS Average Volume":1.2219744511,"Company Summary":"CRH plc, together with its subsidiaries, provides building materials solutions in Ireland and internationally. It operates through four segments: Americas Materials Solutions, Americas Building Solutions, Europe Materials Solutions, and Europe Building Solutions. The company provides solutions for the construction and maintenance of public infrastructure and commercial and residential buildings; and produces and sells aggregates, cement, readymixed concrete, and asphalt, as well as provides paving and construction services. It also manufactures, supplies, and delivers solutions for the built environment in communities across North America; and offers building and infrastructure solutions serving complex critical utility infrastructure, such as water, energy, transportation, and telecommunications projects, and outdoor living solutions for enhancing private and public spaces. In addition, the company combines materials, products, and services to produce a wide range of architectural and infrastructural solutions for use in the building and renovation of critical utility infrastructure, commercial and residential buildings, and outdoor living spaces for the built environment. Further, it produces and supplies precast and pre-stressed concrete products comprising floor and wall elements, beams, vaults, pipes, and manholes; granite, limestone, and sandstone; concrete and polymer-based products, such as underground vaults, drainage systems, utility enclosures, and modular precast structures; engineered steel, polymer-based anchoring, fixing, and connecting solutions; concrete masonry, hardscape and related products, including pavers, blocks and curbs, retaining walls, and slabs; and fencing and railing systems, composite decking, lawn and garden products, and packaged concrete mixes. The company was founded in 1936 and is headquartered in Dublin, Ireland.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Pure Storage, Inc.","Symbol":"PSTG","Current Price":"62.44","Latest MA":"67.29","Latest MA 5":64.0960001831,"Latest MA 9":65.8466675483,"Latest MA 20":67.2894999237,"Price Target":72.0225,"Difference from MA":"-7.21%","Difference from Open":"-0.89%","Change from Yesterday":"1.86%","Change from Last Report":"0.00","Latest Volume":"2,719,462","Market Cap":"20,370,237,440","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":33.75135,"PB Ratio":15.606098,"Previous Close":61.3,"ROE":0.08285,"DTE":21.49,"Industry":"Computer Hardware","Sector":"Technology","Beta":"N\/A","Trailing PEG":1.801,"Trailing PE":201.41934,"Trailing PS":6.429666,"Quick Ratio":1.38,"Day High":64.095,"Day Low":62.35,"VS Average Volume":0.9562694456,"Company Summary":"Pure Storage, Inc. engages in the provision of data storage and management technologies, products, and services in the United States and internationally. Its Purity software is shared across its products and provides enterprise-class data services, such as always-on data reduction, data protection, and encryption, as well as storage protocols, including block, file, and object. The company also provides FlashArray integrated hardware systems, including FlashArray\/\/X, FlashArray\/\/C, FlashArray\/\/XL, FlashArray\/\/E, and FlashArray File Services for block-oriented storage, addressing databases, applications, virtual machines, and other traditional workloads; and FlashBlade integrated hardware systems comprising FlashBlade\/\/S and FlashBlade\/\/E for managing and processing unstructured data workloads of various types from real-time log analytics and commercial high-performance computing (HPC) to data protection and recovery. In addition, it offers cloud-native storage solutions, such as Portworx by Pure Storage, a cloud-native Kubernetes data management solution; and Portworx Data Services, a Database-as-a-Service platform for Kubernetes. Further, the company provides Pure Fusion, a Software-as-a-Service (SaaS) management plane, which enables storage administrators to unify storage arrays and optimize storage pools; Evergreen Architecture comprising Pure1, an AI-driven cloud-based management platform, as well as Evergreen\/\/One and Evergreen\/\/Flex data storage solutions; and Cloud Block Store, a virtual block storage array, that provides customers the flexibility to operate a hybrid cloud model with seamless data mobility across on-premises and public cloud environments. It sells its products and subscription services through direct sales force and channel partners. The company was formerly known as OS76, Inc. and changed its name to Pure Storage, Inc. in January 2010. Pure Storage, Inc. was incorporated in 2009 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Crescent Energy Company","Symbol":"CRGY","Current Price":"13.47","Latest MA":"14.78","Latest MA 5":14.1259999695,"Latest MA 9":14.483333346,"Latest MA 20":14.7835000381,"Price Target":18.91667,"Difference from MA":"-8.88%","Difference from Open":"-2.11%","Change from Yesterday":"-1.61%","Change from Last Report":"0.00","Latest Volume":"3,982,187","Market Cap":"3,481,631,232","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":7.4419894,"PB Ratio":0.80499613,"Previous Close":13.69,"ROE":-0.0344,"DTE":69.973,"Industry":"Oil & Gas Integrated","Sector":"Energy","Beta":"N\/A","Trailing PEG":null,"Trailing PE":61.227276,"Trailing PS":1.1878974,"Quick Ratio":0.816,"Day High":13.775,"Day Low":13.26,"VS Average Volume":1.2337499342,"Company Summary":"Crescent Energy Company operates as an energy company in the United States. Its operations focus on Texas and the Rockies with active development in the Eagle Ford and Uinta basins. The company also operates conventional assets in Wyoming. Crescent Energy Company is headquartered in Houston, Texas.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Invitation Homes Inc.","Symbol":"INVH","Current Price":"31.57","Latest MA":"31.56","Latest MA 5":31.9160000458,"Latest MA 9":31.8322222307,"Latest MA 20":31.5569999847,"Price Target":36.27273,"Difference from MA":"0.04%","Difference from Open":"-1.39%","Change from Yesterday":"-1.65%","Change from Last Report":"0.00","Latest Volume":"2,840,507","Market Cap":"19,339,972,608","Earning Date":"2025-02-26","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":42.662163,"PB Ratio":1.9821687,"Previous Close":32.1,"ROE":0.04558,"DTE":83.761,"Industry":"REIT - Residential","Sector":"Real Estate","Beta":"N\/A","Trailing PEG":14.6157,"Trailing PE":42.662163,"Trailing PS":7.384651,"Quick Ratio":0.704,"Day High":32.17,"Day Low":31.535,"VS Average Volume":0.9934882175,"Company Summary":"Invitation Homes, an S&P 500 company, is the nation's premier single-family home leasing and management company, meeting changing lifestyle demands by providing access to high-quality, updated homes with valued features such as close proximity to jobs and access to good schools. The company's mission, \u0093Together with you, we make a house a home,\u0094 reflects its commitment to providing homes where individuals and families can thrive and high-touch service that continuously enhances residents' living experiences.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"TJX Companies, Inc. (The)","Symbol":"TJX","Current Price":"124.89","Latest MA":"124.07","Latest MA 5":122.6300004272,"Latest MA 9":123.3988885498,"Latest MA 20":124.0702797241,"Price Target":132.7681,"Difference from MA":"0.66%","Difference from Open":"-0.79%","Change from Yesterday":"1.78%","Change from Last Report":"0.00","Latest Volume":"7,543,929","Market Cap":"140,396,347,392","Earning Date":"2025-02-26","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":27.15,"PB Ratio":16.934237,"Previous Close":122.7,"ROE":0.61982,"DTE":152.246,"Industry":"Apparel Retail","Sector":"Consumer Cyclical","Beta":"N\/A","Trailing PEG":2.5442,"Trailing PE":29.3169,"Trailing PS":2.4910636,"Quick Ratio":0.597,"Day High":127.58,"Day Low":123.0,"VS Average Volume":1.6134137453,"Company Summary":"The TJX Companies, Inc., together with its subsidiaries, operates as an off-price apparel and home fashions retailer in the United States, Canada, Europe, and Australia. It operates through four segments: Marmaxx, HomeGoods, TJX Canada, and TJX International. The company sells family apparel, including footwear and accessories; home fashions, such as home basics, furniture, rugs, lighting products, giftware, soft home products, decorative accessories, tabletop, and cookware, as well as expanded pet, and gourmet food departments; jewelry and accessories; and other merchandise. It offers its products through stores and e-commerce sites. The TJX Companies, Inc. was incorporated in 1962 and is headquartered in Framingham, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Workday, Inc.","Symbol":"WDAY","Current Price":"271.09","Latest MA":"263.74","Latest MA 5":261.2280036621,"Latest MA 9":261.2377798123,"Latest MA 20":263.74250354,"Price Target":312.98242,"Difference from MA":"2.79%","Difference from Open":"-3.18%","Change from Yesterday":"6.22%","Change from Last Report":"0.00","Latest Volume":"6,212,514","Market Cap":"72,109,940,736","Earning Date":"2025-02-25","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":32.661446,"PB Ratio":7.9772234,"Previous Close":255.22,"ROE":0.06146,"DTE":37.215,"Industry":"Software - Application","Sector":"Technology","Beta":1.347,"Trailing PEG":2.2702,"Trailing PE":139.02051,"Trailing PS":8.537763,"Quick Ratio":1.797,"Day High":281.0,"Day Low":269.11,"VS Average Volume":1.8192294684,"Company Summary":"Workday, Inc. provides enterprise cloud applications in the United States and internationally. Its applications help its customers to plan, execute, analyze, and extend to other applications and environments to manage their business and operations. The company offers a suite of financial management applications to maintain accounting information in the general ledger; manage financial processes, such as payables and receivables; identify real-time financial, operational, and management insights; enhance financial consolidation; reduce time-to-close; promote internal control and auditability; and achieve consistency across finance operations. It also provides spend management solutions that help organizations to streamline supplier selection and contracts, manage indirect spend, and build and execute sourcing events, such as requests for proposals; expense management solutions to submit and approve expenses; and a suite of human capital management applications that enables HR teams to hire, onboard, pay, develop, reskill, and provide employee experiences. In addition, the company offers planning applications; and applications for analytics and reporting comprising augmented analytics to surface insights to the line of business in simple-to-understand stories, machine learning to drive efficiency and automation, and benchmarks to compare performance against other companies. Further, it provides supply chain and inventory solutions to healthcare organizations; solutions to manage the end-to-end student and faculty lifecycle; and Workday Extend for customers and their developers to build custom applications. It serves professional and business services, financial services, healthcare, education, government, technology, media, retail, and hospitality industries. The company was formerly known as North Tahoe Power Tools, Inc. and changed its name to Workday, Inc. in July 2005. Workday, Inc. was incorporated in 2005 and is headquartered in Pleasanton, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Public Service Enterprise Group","Symbol":"PEG","Current Price":"82.93","Latest MA":"83.83","Latest MA 5":83.8300002441,"Latest MA 9":84.1633334351,"Latest MA 20":83.8270000305,"Price Target":88.36,"Difference from MA":"-1.07%","Difference from Open":"0.21%","Change from Yesterday":"-0.36%","Change from Last Report":"0.00","Latest Volume":"3,581,702","Market Cap":"41,345,662,976","Earning Date":"2025-02-25","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":20.375921,"PB Ratio":2.5659828,"Previous Close":83.23,"ROE":0.11225,"DTE":137.098,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.662,"Trailing PEG":8.344,"Trailing PE":23.426554,"Trailing PS":4.018043,"Quick Ratio":"N\/A","Day High":84.89,"Day Low":82.585,"VS Average Volume":1.5802356168,"Company Summary":"Public Service Enterprise Group Incorporated, through its subsidiaries, operates in electric and gas utility business in the United States. It operates through PSE&G and PSEG Power segments. The PSE&G segment transmits electricity; distributes electricity and natural gas to residential, commercial, and industrial customers; and appliance services and repairs to customers through its service territory, as well as invests in solar generation projects, and energy efficiency and related programs. The PSEG Power segment engages in nuclear generation businesses; and supplies power and natural gas to nuclear power plants and gas storage facilities activities. As of December 31, 2023, it had electric transmission and distribution system of 25,000 circuit miles and 866,600 poles; 56 switching stations with an installed capacity of 39,953 megavolt-amperes (MVA), and 235 substations with an installed capacity of 10,382 MVA; 109 MVA aggregate installed capacity for substations; four electric distribution headquarters and five electric sub-headquarters; 18,000 miles of gas mains, 12 gas distribution headquarters, two sub-headquarters, and one meter shop, as well as 56 natural gas metering and regulating stations; and 158 MegaWatts defined conditions of installed PV solar capacity. Public Service Enterprise Group Incorporated was founded in 1903 and is based in Newark, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Jazz Pharmaceuticals plc","Symbol":"JAZZ","Current Price":"144.17","Latest MA":"130.12","Latest MA 5":138.6379978027,"Latest MA 9":137.1466676839,"Latest MA 20":130.1215004883,"Price Target":187.10526,"Difference from MA":"10.80%","Difference from Open":"2.61%","Change from Yesterday":"3.22%","Change from Last Report":"0.00","Latest Volume":"2,613,682","Market Cap":"8,755,804,160","Earning Date":"2025-02-25","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":6.68692,"PB Ratio":2.1319668,"Previous Close":139.67,"ROE":0.14306,"DTE":150.17,"Industry":"Biotechnology","Sector":"Healthcare","Beta":0.561,"Trailing PEG":0.9743,"Trailing PE":16.667053,"Trailing PS":2.1518583,"Quick Ratio":3.572,"Day High":148.0568,"Day Low":134.57,"VS Average Volume":4.2302308945,"Company Summary":"Jazz Pharmaceuticals plc identifies, develops, and commercializes pharmaceutical products for unmet medical needs in the United States, Europe, and internationally. The company offers Xywav for cataplexy or excessive daytime sleepiness (EDS) with narcolepsy and idiopathic hypersomnia; Xyrem to treat cataplexy or EDS with narcolepsy; Epidiolex for seizures associated with Lennox-Gastaut and Dravet syndromes, or tuberous sclerosis complex; Zepzelca to treat metastatic small cell lung cancer, or with disease progression on or after platinum-based chemotherapy; Rylaze for acute lymphoblastic leukemia or lymphoblastic lymphoma; Enrylaze to treat acute lymphoblastic leukemia and lymphoblastic lymphoma; Defitelio to treat severe hepatic veno-occlusive disease; and Vyxeos for newly-diagnosed therapy-related acute myeloid leukemia. It also develops Zanidatamab to treat HER2-expressing gastroesophageal adenocarcinoma (GEA), and patients with HER2-expressing metastatic GEA; Zepzelca for the treatment of patients with select relapsed\/refractory solid tumors based on limited response in three solid tumor cohorts; JZP815, a pan-RAF kinase inhibitor that targets components of the mitogen-activated protein kinase; JZP898, a conditionally-activated interferon alpha molecule; Epidiolex to treat LGS, DS, and TSC; Suvecaltamide to treat parkinson's disease tremor; JZP150, a fatty acid amide hydrolase inhibitor program to treat post-traumatic stress disorder; and JZP441 to treat narcolepsy, IH, and other sleep disorders. The company has licensing and collaboration agreements with XL-protein GmbH to extend the plasma half-life of selected asparaginase product candidates; Redx Pharma plc for preclinical activities Ras\/Raf\/MAP kinase pathway program; and Autifony Therapeutics Limited on discovering and developing drug candidates targeting two different ion channel targets associated with neurological disorders. The company was incorporated in 2003 and is headquartered in Dublin, Ireland.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Keysight Technologies Inc.","Symbol":"KEYS","Current Price":"160.36","Latest MA":"176.47","Latest MA 5":173.2699980469,"Latest MA 9":177.6566670058,"Latest MA 20":176.4705016785,"Price Target":184.08615,"Difference from MA":"-9.13%","Difference from Open":"-0.84%","Change from Yesterday":"-6.86%","Change from Last Report":"0.00","Latest Volume":"3,025,722","Market Cap":"27,758,315,520","Earning Date":"2025-02-25","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":23.007174,"PB Ratio":5.351577,"Previous Close":172.17,"ROE":0.122150004,"DTE":38.944,"Industry":"Scientific & Technical Instruments","Sector":"Technology","Beta":1.017,"Trailing PEG":1.101,"Trailing PE":45.817142,"Trailing PS":5.531749,"Quick Ratio":1.893,"Day High":165.89,"Day Low":158.02,"VS Average Volume":3.0237263406,"Company Summary":"Keysight Technologies, Inc. offers electronic design and test solutions worldwide. It operates in two segments, Communications Solutions Group and Electronic Industrial Solutions Group. It offers oscilloscopes; electronic design automation software; instrument measurement software, instrument workflow software, application software testing, keysight instrument control software and connectivity, and software testing; modular instruments; digital multimeter, phase noise measurement, power meters and power sensors, counters, LCR meters and impedance measurement products, and electrometers; spectrum, logic, noise figure, and network analyzers; and protocol analyzers and exercisers, bit error ratio testers, AC and DC power analyzers, materials test equipment, device current waveform analyzers, and curve tracers. It also provides signal, waveform, and function generators; arbitrary waveform generators, DC power supplies, and DC electronic loads; wireless drive test, radio access and core network test, wireless analyzers, wireless network emulators, channel emulation, and over-the-air test; application and threat intelligence, cloud test, 5G NR base station test, cyber training simulator, network test hardware, protocol and load test, network security test, and network modeling; bypass switches, cloud visibility and synchronization, network and application monitoring, network packet brokers and taps; and application-specific test systems, in-circuit test systems, parametric test, laser interferometers and calibration systems, monolithic laser combiners and precision optics, photonic test and measurement products, MMIC millimeter-wave and microwave devices, and accessories. In addition, it offers product support, technical and application support, installation, training, engineering, and integration services. The company was founded in 1939 and is headquartered in Santa Rosa, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Caesars Entertainment, Inc.","Symbol":"CZR","Current Price":"34.56","Latest MA":"36.42","Latest MA 5":35.5139996643,"Latest MA 9":37.0777772861,"Latest MA 20":36.4155,"Price Target":50.05882,"Difference from MA":"-5.10%","Difference from Open":"-3.46%","Change from Yesterday":"-0.89%","Change from Last Report":"0.00","Latest Volume":"6,313,825","Market Cap":"7,327,169,536","Earning Date":"2025-02-25","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":25.791044,"PB Ratio":1.7569011,"Previous Close":34.87,"ROE":-0.04639,"DTE":589.077,"Industry":"Resorts & Casinos","Sector":"Consumer Cyclical","Beta":2.9,"Trailing PEG":4.7186,"Trailing PE":"N\/A","Trailing PS":0.65159357,"Quick Ratio":0.588,"Day High":36.2599,"Day Low":34.21,"VS Average Volume":1.4104558016,"Company Summary":"Caesars Entertainment, Inc. operates as a gaming and hospitality company. The company owns, leases, or manages domestic properties in 18 states with slot machines, video lottery terminals and e-tables, and hotel rooms, as well as table games, including poker. It also operates and conducts retail and online sports wagering across 31 jurisdictions in North America and operates iGaming in five jurisdictions in North America; sports betting from our retail and online sportsbooks; and other games, such as keno. In addition, the company operates dining venues, bars, nightclubs, lounges, hotels, and entertainment venues; and provides staffing and management services. Caesars Entertainment, Inc. was founded in 1937 and is based in Reno, Nevada.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Henry Schein, Inc.","Symbol":"HSIC","Current Price":"72.55","Latest MA":"78.24","Latest MA 5":76.259,"Latest MA 9":76.7083335368,"Latest MA 20":78.2382504425,"Price Target":80.23077,"Difference from MA":"-7.28%","Difference from Open":"-4.40%","Change from Yesterday":"-4.31%","Change from Last Report":"0.00","Latest Volume":"3,838,104","Market Cap":"9,008,419,840","Earning Date":"2025-02-25","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":13.950962,"PB Ratio":2.6545062,"Previous Close":75.82,"ROE":0.079679996,"DTE":59.334,"Industry":"Medical Distribution","Sector":"Healthcare","Beta":0.909,"Trailing PEG":1.7453,"Trailing PE":23.785246,"Trailing PS":0.7108356,"Quick Ratio":0.572,"Day High":76.43,"Day Low":72.23,"VS Average Volume":2.5227033866,"Company Summary":"Henry Schein, Inc. provides health care products and services to dental practitioners, laboratories, physician practices, and ambulatory surgery centers, government, institutional health care clinics, and other alternate care clinics worldwide. It operates through two segments, Health Care Distribution, and Technology and Value-Added Services. The Health Care Distribution segment offers dental products, including infection-control products, handpieces, preventatives, impression materials, composites, anesthetics, teeth, dental implants, gypsum, acrylics, articulators, abrasives, dental chairs, delivery units and lights, X-ray supplies and equipment, personal protective equipment, and high-tech and digital restoration equipment, as well as equipment repair services. This segment also provides medical products, such as branded and generic pharmaceuticals, vaccines, surgical products, diagnostic tests, infection-control products, X-ray products, equipment, and vitamins. The Technology and Value-Added Services segment offers software, technology, and other value-added services that include practice management software systems for dental and medical practitioners; and value-added practice solutions comprising practice consultancy, education, revenue cycle management and financial services, e-services, practice technology, and network and hardware services, as well as consulting, and continuing education services. Henry Schein, Inc. was founded in 1932 and is headquartered in Melville, New York.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"ExlService Holdings, Inc.","Symbol":"EXLS","Current Price":"48.63","Latest MA":"50.49","Latest MA 5":48.7940000305,"Latest MA 9":49.9022224087,"Latest MA 20":50.490500206,"Price Target":52.85714,"Difference from MA":"-3.68%","Difference from Open":"0.79%","Change from Yesterday":"-0.14%","Change from Last Report":"0.00","Latest Volume":"2,630,397","Market Cap":"7,892,892,160","Earning Date":"2025-02-25","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":25.73016,"PB Ratio":8.461806,"Previous Close":48.7,"ROE":0.21799,"DTE":39.426,"Industry":"Information Technology Services","Sector":"Technology","Beta":1.034,"Trailing PEG":1.762,"Trailing PE":40.190083,"Trailing PS":4.293414,"Quick Ratio":2.414,"Day High":51.31,"Day Low":48.22,"VS Average Volume":2.9038912894,"Company Summary":"ExlService Holdings, Inc. operates as a data analytics, and digital operations and solutions company in the United States and internationally. The company operates through Insurance, Healthcare, Analytics, and Emerging Business segments. It also provides digital operations and solutions and analytics-driven services, such as claims processing, premium and benefit administration, agency management, account reconciliation, policy research, underwriting support, new business acquisition, policy servicing, premium audit, surveys, billing and collection, commercial and residential survey, and customer service using digital technology, artificial intelligence, machine learning, and advanced automation; digital customer acquisition services using a software-as-a-service delivery model through LifePRO and LISS platforms; subrogation services; and Subrosource software platform, an end-to-end subrogation platform. In addition, the company offers health care services related to care management, utilization management, disease management, payment integrity, revenue optimization, and customer engagement. Further, it provides financial planning and analysis, management reporting, forecasting and decision support, data management, regulatory reporting and risk, and compliance services; reservations, customer, and fulfilment services; freight billing, collections, claims management, freight audit, freight scheduling, supply chain management, and revenue assurance services; residential mortgage lending, title verification and validation, retail banking and credit cards, trust verification, commercial banking, and investment management; merchandising, pricing, and demand forecasting; and digital operations and solutions. The company offers predictive and prescriptive analytics in the areas of customer acquisition and lifecycle management. ExlService Holdings, Inc. was founded in 1999 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Sealed Air Corporation","Symbol":"SEE","Current Price":"33.61","Latest MA":"33.94","Latest MA 5":33.0279997559,"Latest MA 9":33.3366668871,"Latest MA 20":33.9390000992,"Price Target":41.21467,"Difference from MA":"-0.97%","Difference from Open":"-1.70%","Change from Yesterday":"-1.15%","Change from Last Report":"0.00","Latest Volume":"2,188,055","Market Cap":"4,896,708,096","Earning Date":"2025-02-25","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":10.669841,"PB Ratio":7.8473034,"Previous Close":34.0,"ROE":0.45911,"DTE":721.922,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":1.346,"Trailing PEG":0.9454,"Trailing PE":18.266304,"Trailing PS":0.90804213,"Quick Ratio":0.575,"Day High":35.46,"Day Low":33.6,"VS Average Volume":1.7385080988,"Company Summary":"Sealed Air Corporation provides packaging solutions in the Americas, Europe, the Middle East, Africa, Asia, Australia, and New Zealand. It operates through two segments, Food and Protective. The Food segment offers integrated packaging materials and automation equipment solutions to provide food safety, shelf life extension, reduce food waste, automate processes, and optimize total cost for food processors in the fresh red meat, smoked and processed meats, poultry, seafood, plant-based, fluids and liquids and cheese markets under the CRYOVAC, CRYOVAC Grip & Tear, CRYOVAC Darfresh, LIQUIBOX, Simple Steps, and Optidure brands. This segment sells its solutions directly to customers through its sales, marketing, and customer service personnel. The Protective segment provides shrink films, bagging systems, foam, inflatable, and suspension and retention packaging solutions to protect goods to e-commerce, consumer goods, pharmaceutical and medical devices, and industrial manufacturing markets under the SEALED AIR, BUBBLE WRAP, AUTOBAG, Instapak, and Korrvu brands. This segment sells its solutions through supply distributors, as well as directly to fabricators, original equipment manufacturers, contract manufacturers, logistics partners, and e-commerce\/fulfillment operations. The company was incorporated in 1960 and is headquartered in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Keurig Dr Pepper Inc.","Symbol":"KDP","Current Price":"33.74","Latest MA":"32.30","Latest MA 5":33.9959995728,"Latest MA 9":33.1922219849,"Latest MA 20":32.3024999733,"Price Target":37.455,"Difference from MA":"4.45%","Difference from Open":"-2.88%","Change from Yesterday":"-3.43%","Change from Last Report":"0.00","Latest Volume":"14,295,431","Market Cap":"45,776,744,448","Earning Date":"2025-02-25","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":16.458538,"PB Ratio":1.8880806,"Previous Close":34.94,"ROE":0.057729997,"DTE":75.609,"Industry":"Beverages - Non-Alcoholic","Sector":"Consumer Defensive","Beta":0.616,"Trailing PEG":2.3958,"Trailing PE":32.133335,"Trailing PS":2.9820042,"Quick Ratio":0.276,"Day High":34.84,"Day Low":33.67,"VS Average Volume":1.5255272942,"Company Summary":"Keurig Dr Pepper Inc. owns, manufactures, and distributors beverages and single serve brewing systems in the United States and internationally. It operates through three segments: U.S. Refreshment Beverages, U.S. Coffee, and International. The U.S. Refreshment Beverages segment manufactures and distributes branded concentrates, syrup, and finished beverages. Its U.S. Coffee segment offers finished goods relating to K-Cup pods, single serve brewers, specialty coffee, and ready to drink coffee products through Keurig.com website. The International segment provides sales in Canada, Mexico, the Caribbean, and other international markets from the manufacture and distribution of branded concentrates, syrup, and finished beverages; and sales in Canada from the manufacture and distribution of finished goods relating to the Company's single serve brewers, KCup pods, and other coffee products. It serves retailers, third-party bottlers and distributors, retail partners, hotel chains, office coffee distributors, and end-use consumers. The company offers its products under the Dr Pepper, Canada Dry, Green Mountain Coffee Roasters, Snapple, Mott's, The Original Donut Shop, Clamato, and Core Hydration brand name. Keurig Dr Pepper Inc. was founded in 1981 and is headquartered in Burlington, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Elanco Animal Health Incorporat","Symbol":"ELAN","Current Price":"11.13","Latest MA":"11.52","Latest MA 5":11.0180000076,"Latest MA 9":11.1733332613,"Latest MA 20":11.5184999886,"Price Target":15.75,"Difference from MA":"-3.37%","Difference from Open":"2.49%","Change from Yesterday":"4.02%","Change from Last Report":"0.00","Latest Volume":"6,067,942","Market Cap":"5,505,054,208","Earning Date":"2025-02-25","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":11.8404255,"PB Ratio":0.9027496,"Previous Close":10.7,"ROE":0.05487,"DTE":72.9,"Industry":"Drug Manufacturers - Specialty & Generic","Sector":"Healthcare","Beta":1.418,"Trailing PEG":null,"Trailing PE":16.367647,"Trailing PS":1.2401564,"Quick Ratio":1.122,"Day High":11.465,"Day Low":10.76,"VS Average Volume":1.2608053066,"Company Summary":"Elanco Animal Health Incorporated, an animal health company, innovates, develops, manufactures, and markets products for pets and farm animals. It offers pet health disease prevention products, such as parasiticide and vaccine products that protect pets from worms, fleas, and ticks under the Seresto, Advantage, Advantix, and Advocate brands; pet health therapeutics for pain, osteoarthritis, ear infections, cardiovascular, and dermatology indications in canines and felines under the Galliprant and Claro brands; vaccines, antibiotics, parasiticides, and other products for use in poultry and aquaculture production, as well as nutritional health products, including enzymes, probiotics, and prebiotics; and a range of vaccines, antibiotics, implants, parasiticides, and other products used in ruminant and swine production under the Rumensin and Baytril brands. The company sells its products to third-party distributors; veterinarians; and farm animal producers, including beef and dairy farmers, as well as pork, poultry, and aquaculture operations. Elanco Animal Health Incorporated was founded in 1954 and is headquartered in Greenfield, Indiana.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Intuit Inc.","Symbol":"INTU","Current Price":"625.51","Latest MA":"586.22","Latest MA 5":578.585996582,"Latest MA 9":580.7044463433,"Latest MA 20":586.2244990234,"Price Target":710.1747,"Difference from MA":"6.70%","Difference from Open":"-1.57%","Change from Yesterday":"12.58%","Change from Last Report":"0.00","Latest Volume":"4,673,106","Market Cap":"174,868,824,064","Earning Date":"2025-02-25","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":28.138103,"PB Ratio":9.748765,"Previous Close":555.63,"ROE":0.17424999,"DTE":"N\/A","Industry":"Software - Application","Sector":"Technology","Beta":1.244,"Trailing PEG":1.8777,"Trailing PE":58.45888,"Trailing PS":10.186336,"Quick Ratio":0.497,"Day High":638.85,"Day Low":615.4361,"VS Average Volume":2.759824528,"Company Summary":"Intuit Inc. provides financial management, compliance, and marketing products and services in the United States. The company operates in four segments: Small Business & Self-Employed, Consumer, Credit Karma, and ProTax. The Small Business & Self-Employed segment provides QuickBooks services, that includes financial and business management online services, desktop software, payroll solutions, time tracking, merchant payment processing and bill pay solutions, checking accounts, and financing services for small and mid-market businesses; and Mailchimp, a marketing automation and customer relationship management. This segment also offers QuickBooks online services and desktop software solutions comprising QuickBooks Online, QuickBooks Live, QuickBooks Online Advanced, QuickBooks Self-Employed, QuickBooks Solopreneur financial and business management offerings, QuickBooks Online Payroll QuickBooks Checking, QuickBooks Desktop software subscriptions, QuickBooks Basic Payroll, QuickBooks Assisted Payroll, and QuickBooks Enhanced Payroll. The Consumer segment provides do-it-yourself and assisted TurboTax income tax preparation products and services. The Credit Karma segment offers consumers with a personal finance platform that provides personalized recommendations of credit card, home, auto, and personal loan, and insurance product; online savings and checking accounts; and access to its credit scores and reports, credit and identity monitoring, credit report dispute, credit building tools, and tools. The ProTax segment provides Lacerte, ProSeries, and ProFile desktop tax-preparation software products; and ProConnect Tax Online bill pay tax products, electronic tax filing service, and bank products and related services. It sells products and services through direct sales channels, multi-channel shop-and-buy experiences, mobile application stores, and partner and other channels. The company was incorporated in 1984 and is headquartered in Mountain View, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"International Game Technology","Symbol":"IGT","Current Price":"18.35","Latest MA":"17.31","Latest MA 5":18.0580004883,"Latest MA 9":17.8500001272,"Latest MA 20":17.3139999199,"Price Target":23.83333,"Difference from MA":"5.98%","Difference from Open":"2.63%","Change from Yesterday":"1.83%","Change from Last Report":"0.00","Latest Volume":"2,055,338","Market Cap":"3,707,287,296","Earning Date":"2025-02-25","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":18.35,"PB Ratio":2.2421799,"Previous Close":18.02,"ROE":0.13453001,"DTE":266.327,"Industry":"Gambling","Sector":"Consumer Cyclical","Beta":1.915,"Trailing PEG":null,"Trailing PE":32.19298,"Trailing PS":1.4758309,"Quick Ratio":0.399,"Day High":18.5,"Day Low":17.77,"VS Average Volume":1.6355939015,"Company Summary":"International Game Technology PLC operates and provides gaming technology products and services in the United States, Canada, Italy, The United Kingdom, rest of Europe, and internationally. It operates through three segments: Global Lottery, Global Gaming, and PlayDigital. The company designs, sells, operates, and leases a suite of point-of-sale machines that reconciles lottery funds between the retailer and lottery authority; provides online lottery transaction processing systems; produces instant ticket games; and offers printing services, such as instant ticket marketing plans and graphic design, programming, packaging, shipping, and delivery services, as well as iLottery solutions and services. It also designs, develops, assembles, and provides cabinets, games, systems, and software for the gaming market, as well as offers gaming management systems for casino management, such as infrastructure and applications, customer relationship management, patron management, and server-based gaming. In addition, the company provides video lottery terminals (VLT), VLT central systems, and VLT games. Further, it offers digital products, such as slot games, blackjack, roulette, poker, bingo, and other casino card games; iGaming systems and digital platforms that offer remote game server solution; and sports betting technology and management services to licensed sports betting operators. It processes commercial transactions, such as prepaid cellular telephone recharges, bill payments, e-vouchers and retail-based programs, electronic tax payments, prepaid card recharges, and stamp duty and money transfer services. The company was formerly known as GTECH S.p.A. and changed its name to International Game Technology PLC in April 2015. The company was incorporated in 2014 and is headquartered in London, the United Kingdom.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"27-02-2025 11:12:17"},{"Company Name":"Coupang, Inc.","Symbol":"CPNG","Current Price":"25.01","Latest MA":"24.26","Latest MA 5":24.7519996185,"Latest MA 9":25.0144443258,"Latest MA 20":24.2634999161,"Price Target":29.42941,"Difference from MA":"3.08%","Difference from Open":"-1.84%","Change from Yesterday":"3.48%","Change from Last Report":"0.00","Latest Volume":"16,084,022","Market Cap":"45,155,307,520","Earning Date":"2025-02-25","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":53.212765,"PB Ratio":10.978929,"Previous Close":24.17,"ROE":0.01594,"DTE":89.179,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":1.108,"Trailing PEG":45.6887,"Trailing PE":312.625,"Trailing PS":1.4918497,"Quick Ratio":0.815,"Day High":25.8,"Day Low":23.48,"VS Average Volume":2.0821160919,"Company Summary":"Coupang, Inc., together with its subsidiaries owns and operates retail business through its mobile applications and Internet websites primarily in South Korea. The company operates through Product Commerce and Developing Offerings segments. It sells various products and services in the categories of home goods and décor products, apparel, beauty products, fresh food and groceries, sporting goods, electronics, and everyday consumables, as well as travel, and restaurant order and delivery services. In addition, the company offers Rocket Fresh, which offers fresh groceries; Coupang Eats, a restaurant ordering and delivery services; and Coupang Play, an online content streaming services, as well as advertising products. It also performs operations and support services in the United States, South Korea, Taiwan, Singapore, China, Japan, and India. Coupang, Inc. was incorporated in 2010 and is headquartered in Seattle, Washington.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"27-02-2025 11:13:20"},{"Company Name":"American Tower Corporation (REI","Symbol":"AMT","Current Price":"200.73","Latest MA":"190.03","Latest MA 5":196.0820015869,"Latest MA 9":193.0988909912,"Latest MA 20":190.0330019226,"Price Target":227.45,"Difference from MA":"5.63%","Difference from Open":"-1.89%","Change from Yesterday":"-1.48%","Change from Last Report":"0.00","Latest Volume":"2,148,772","Market Cap":"93,832,642,560","Earning Date":"2025-02-25","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":29.562592,"PB Ratio":27.736631,"Previous Close":203.75,"ROE":0.31768,"DTE":455.544,"Industry":"REIT - Specialty","Sector":"Real Estate","Beta":0.846,"Trailing PEG":1.25,"Trailing PE":29.049204,"Trailing PS":9.265408,"Quick Ratio":0.359,"Day High":205.4,"Day Low":199.59,"VS Average Volume":0.9065798778,"Company Summary":"American Tower, one of the largest global REITs, is a leading independent owner, operator and developer of multitenant communications real estate with a portfolio of over 148,000 communications sites and a highly interconnected footprint of U.S. data center facilities.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"27-02-2025 11:13:20"},{"Company Name":"Extra Space Storage Inc","Symbol":"EXR","Current Price":"153.91","Latest MA":"155.40","Latest MA 5":157.223998291,"Latest MA 9":156.1888881429,"Latest MA 20":155.4040006714,"Price Target":167.61111,"Difference from MA":"-0.96%","Difference from Open":"-4.32%","Change from Yesterday":"-4.57%","Change from Last Report":"0.00","Latest Volume":"2,297,257","Market Cap":"33,948,389,376","Earning Date":"2025-02-25","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":32.198746,"PB Ratio":2.339342,"Previous Close":161.28,"ROE":0.05947,"DTE":87.674,"Industry":"REIT - Industrial","Sector":"Real Estate","Beta":0.927,"Trailing PEG":4.7989,"Trailing PE":38.191067,"Trailing PS":10.17057,"Quick Ratio":0.328,"Day High":161.5,"Day Low":153.0,"VS Average Volume":1.9858722337,"Company Summary":"Extra Space Storage Inc., headquartered in Salt Lake City, Utah, is a self-administered and self-managed REIT and a member of the S&P 500. As of September 30, 2024, the Company owned and\/or operated 3,862 self-storage stores in 42 states and Washington, D.C. The Company's stores comprise approximately 2.7 million units and approximately 296.7 million square feet of rentable space operating under the Extra Space, Life Storage and Storage Express brands. The Company offers customers a wide selection of conveniently located and secure storage units across the country, including boat storage, RV storage and business storage. It is the largest operator of self-storage properties in the United States.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"27-02-2025 11:13:20"},{"Company Name":"Maplebear Inc.","Symbol":"CART","Current Price":"42.80","Latest MA":"49.46","Latest MA 5":49.171000061,"Latest MA 9":50.035000356,"Latest MA 20":49.4577501678,"Price Target":52.14815,"Difference from MA":"-13.46%","Difference from Open":"-1.18%","Change from Yesterday":"-12.26%","Change from Last Report":"0.00","Latest Volume":"11,594,649","Market Cap":"10,995,105,792","Earning Date":"2025-02-25","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":31.940298,"PB Ratio":3.5827892,"Previous Close":48.78,"ROE":0.12684,"DTE":0.793,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":"N\/A","Trailing PEG":null,"Trailing PE":4.056872,"Trailing PS":3.254916,"Quick Ratio":2.986,"Day High":44.78,"Day Low":42.5,"VS Average Volume":2.931914559,"Company Summary":"Maplebear Inc., doing business as Instacart, engages in the provision of online grocery shopping services to households in North America. It sells and delivers grocery products, as well as pickup services through a mobile application and website. It also operates virtual convenience stores; and provides software-as-a-service solutions to retailers. The company was incorporated in 2012 and is based in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 11:13:20"},{"Company Name":"Amer Sports, Inc.","Symbol":"AS","Current Price":"30.31","Latest MA":"30.80","Latest MA 5":29.1360001678,"Latest MA 9":29.9288888041,"Latest MA 20":30.8019998817,"Price Target":32.80526,"Difference from MA":"-1.60%","Difference from Open":"2.75%","Change from Yesterday":"5.13%","Change from Last Report":"0.00","Latest Volume":"5,515,742","Market Cap":"16,560,171,008","Earning Date":"2025-02-25","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":43.3,"PB Ratio":3.0462313,"Previous Close":28.83,"ROE":0.03126,"DTE":28.669,"Industry":"Leisure","Sector":"Consumer Cyclical","Beta":"N\/A","Trailing PEG":null,"Trailing PE":216.5,"Trailing PS":3.1949089,"Quick Ratio":0.626,"Day High":31.4395,"Day Low":29.19,"VS Average Volume":1.7428929395,"Company Summary":"Amer Sports, Inc. designs, manufactures, markets, distributes, and sells sports equipment, apparel, footwear, and accessories in Europe, the Middle East, Africa, the Americas, China, and the Asia Pacific. It operates through three segments: Technical Apparel, Outdoor Performance, and Ball & Racquet Sports. The Technical Apparel segment offers outdoor apparel, footwear, and accessories which includes climbing gear. The Outdoor Performance segment provides hiking and running footwear, functional apparel, skiing and snowboarding gear, and lifestyle footwear. The Ball & Racquet Sports segment offers sports equipment for tennis, baseball, american football, basketball, golf, and various other professional and recreational sports. This segment provides custom-fitting protective gear and apparel for baseball, softball, football, and lacrosse. It sells its products under the Arc'teryx, PeakPerformance, Salomon, Atomic, Armada, ENVE, Wilson, Louisville Slugger, DeMarini, EvoShield, and ATEC brands. The company distributes its products through retail stores, general sporting goods retailers, specialty stores, independently operated partner stores, and distributors, as well as its e-commerce websites, and retailer-owned and third-party e-commerce websites. The company was formerly known as Amer Sports Management Holding (Cayman) Limited and changed its name to Amer Sports, Inc. in August 2023. Amer Sports, Inc. was founded in 1950 and is based in Helsinki, Finland.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 11:13:20"},{"Company Name":"Permian Resources Corporation","Symbol":"PR","Current Price":"14.02","Latest MA":"14.46","Latest MA 5":14.0820000687,"Latest MA 9":14.1900000593,"Latest MA 20":14.4630000362,"Price Target":19.5,"Difference from MA":"-3.06%","Difference from Open":"-1.68%","Change from Yesterday":"2.56%","Change from Last Report":"0.00","Latest Volume":"15,039,979","Market Cap":"11,263,303,680","Earning Date":"2025-02-25","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":9.223684,"PB Ratio":1.0797074,"Previous Close":13.67,"ROE":0.12663999,"DTE":40.935,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":4.277,"Trailing PEG":1.8447,"Trailing PE":9.668965,"Trailing PS":2.25233,"Quick Ratio":0.761,"Day High":14.6599,"Day Low":13.88,"VS Average Volume":2.0524661015,"Company Summary":"Permian Resources Corporation, an independent oil and natural gas company, focuses on the development of crude oil and related liquids-rich natural gas reserves in the United States. The company's assets primarily focus on the Delaware Basin, a sub-basin of the Permian Basin. Its properties consist of acreage blocks in West Texas, Eddy County, Lea County, and New Mexico. The company was formerly known as Centennial Resource Development, Inc. and changed its name to Permian Resources Corporation in September 2022. Permian Resources Corporation was incorporated in 2015 and is headquartered in Midland, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 11:13:20"},{"Company Name":"DBA Sempra","Symbol":"SRE","Current Price":"72.85","Latest MA":"82.44","Latest MA 5":80.756000061,"Latest MA 9":82.4111109416,"Latest MA 20":82.4425003815,"Price Target":86.19375,"Difference from MA":"-11.64%","Difference from Open":"4.03%","Change from Yesterday":"3.13%","Change from Last Report":"0.00","Latest Volume":"14,260,876","Market Cap":"47,458,643,968","Earning Date":"2025-02-25","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":14.173152,"PB Ratio":1.5626006,"Previous Close":70.64,"ROE":0.097950004,"DTE":98.735,"Industry":"Utilities - Diversified","Sector":"Utilities","Beta":0.79,"Trailing PEG":1.7373,"Trailing PE":16.4819,"Trailing PS":3.599442,"Quick Ratio":0.422,"Day High":74.25,"Day Low":68.195,"VS Average Volume":3.2776404645,"Company Summary":"Sempra operates as an energy infrastructure company in the United States and internationally. It operates through three segments: Sempra California, Sempra Texas Utilities, and Sempra Infrastructure. The Sempra California segment provides electric services; and natural gas services to San Diego County. As of December 31, 2023, it offered electric services to approximately 3.6 million population and natural gas services to approximately 3.3 million population that covers 4,100 square miles. This segment owns and operates a natural gas distribution, transmission, and storage system that supplies natural gas. As of December 31, 2023, it serves a population of 21 million covering an area of 24,000 square miles. The Sempra Texas Utilities segment engages in the regulated electricity transmission and distribution. As of December 31, 2023, its transmission system included 18,298 circuit miles of transmission lines; 1,257 transmission and distribution substations; interconnection to 173 third-party generation facilities totaling 54,277 MW; and distribution system included approximately 4.0 million points of delivery and consisted of 125,116 miles of overhead and underground lines. The Sempra Infrastructure segment develops, builds, operates, and invests in energy infrastructure to help enable the energy transition in North American markets and worldwide. The company was formerly known as Sempra Energy and changed its name to Sempra in May 2023. Sempra was incorporated in 1996 and is based in San Diego, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 11:13:20"},{"Company Name":"Axon Enterprise, Inc.","Symbol":"AXON","Current Price":"572.40","Latest MA":"629.56","Latest MA 5":524.7619946289,"Latest MA 9":586.1499945747,"Latest MA 20":629.5649951172,"Price Target":665.0299,"Difference from MA":"-9.08%","Difference from Open":"-2.05%","Change from Yesterday":"15.25%","Change from Last Report":"0.00","Latest Volume":"2,822,472","Market Cap":"43,648,249,856","Earning Date":"2025-02-25","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":92.322586,"PB Ratio":18.77768,"Previous Close":496.65,"ROE":0.19139999,"DTE":31.556,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.046,"Trailing PEG":null,"Trailing PE":119.00208,"Trailing PS":20.959282,"Quick Ratio":1.906,"Day High":600.99,"Day Low":558.21,"VS Average Volume":3.1173550871,"Company Summary":"Axon Enterprise, Inc. develops, manufactures, and sells conducted energy devices (CEDs) under the TASER brand in the United States and internationally. It operates through two segments, Software and Sensors, and TASER. The company also offers hardware and cloud-based software solutions that enable law enforcement to capture, securely store, manage, share, and analyze video and other digital evidence. Its products include axon officer safety plan; taser 10, taser7, taser X26P, taser X2, taser 7 CQ, and civilian series; cameras, such as axon body, axon flex, axon fleet, axon air, axon signal sidearm, axon signal vehicle, axon interview, and axon interview portable kit; software, including axon records, evidence, standards, commander, performance, auto-transcribe, justice, investigate, respond, and justice, my90, and redaction assistant; mobile applications, and training services, as well as hardware extended warranties; and Axon docks, cartridges, and batteries. The company sells its products through its direct sales, distribution partners, online store, and third-party resellers. Axon Enterprise, Inc. has a strategic partnership with Fusus, Inc. to expand bility to aggregate live video, data, and sensor feeds. It serves law enforcement, federal, correction, fire, EMS, campus, justice healthcare, retail, private security, and personal safety industries. The company was formerly known as TASER International, Inc. and changed its name to Axon Enterprise, Inc. in April 2017. Axon Enterprise, Inc. was incorporated in 1993 and is headquartered in Scottsdale, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 11:13:20"},{"Company Name":"Range Resources Corporation","Symbol":"RRC","Current Price":"38.55","Latest MA":"38.37","Latest MA 5":38.4379998779,"Latest MA 9":38.7199996101,"Latest MA 20":38.3719997787,"Price Target":40.425,"Difference from MA":"0.46%","Difference from Open":"0.81%","Change from Yesterday":"2.80%","Change from Last Report":"0.00","Latest Volume":"5,955,804","Market Cap":"9,303,310,336","Earning Date":"2025-02-25","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":12.979797,"PB Ratio":2.356645,"Previous Close":37.5,"ROE":0.06916,"DTE":46.251,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":1.782,"Trailing PEG":null,"Trailing PE":35.36697,"Trailing PS":3.941483,"Quick Ratio":0.476,"Day High":39.0,"Day Low":37.18,"VS Average Volume":2.5280366195,"Company Summary":"Range Resources Corporation operates as an independent natural gas, natural gas liquids (NGLs), crude oil, and condensate company in the United States. The company engages in the exploration, development, and acquisition of natural gas and crude oil properties located in the Appalachian region. It sells natural gas to utilities, marketing and midstream companies, and industrial users; NGLs to petrochemical end users, marketers\/traders, and natural gas processors; and oil and condensate to crude oil processors, transporters, and refining and marketing companies. The company was formerly known as Lomak Petroleum Inc. and changed its name to Range Resources Corporation in August 1998. Range Resources Corporation was founded in 1976 and is headquartered in Fort Worth, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"27-02-2025 11:13:20"},{"Company Name":"First Solar, Inc.","Symbol":"FSLR","Current Price":"156.84","Latest MA":"161.90","Latest MA 5":155.3480018311,"Latest MA 9":158.0233327908,"Latest MA 20":161.9014993591,"Price Target":256.9343,"Difference from MA":"-3.13%","Difference from Open":"1.41%","Change from Yesterday":"6.36%","Change from Last Report":"0.00","Latest Volume":"6,961,973","Market Cap":"16,791,603,200","Earning Date":"2025-02-25","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.518696,"PB Ratio":2.1048112,"Previous Close":147.46,"ROE":0.17621,"DTE":9.01,"Industry":"Solar","Sector":"Technology","Beta":1.465,"Trailing PEG":0.2315,"Trailing PE":13.059117,"Trailing PS":3.9920232,"Quick Ratio":1.723,"Day High":167.96,"Day Low":154.655,"VS Average Volume":3.1684966831,"Company Summary":"First Solar, Inc., a solar technology company, provides photovoltaic (PV) solar energy solutions in the United States, France, Japan, Chile, and internationally. The company manufactures and sells PV solar modules with a thin film semiconductor technology that provides a lower-carbon alternative to conventional crystalline silicon PV solar modules. It designs, manufactures, and sells cadmium telluride solar modules that converts sunlight into electricity. The company's residual business operations include project development activities, operations and maintenance services, and the sale of PV solar power systems to third-party customers. It serves developers and operators of systems, utilities, independent power producers, commercial and industrial companies, and other system owners. The company was formerly known as First Solar Holdings, Inc. and changed its name to First Solar, Inc. in 2006. First Solar, Inc. was founded in 1999 and is headquartered in Tempe, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 11:13:20"},{"Company Name":"Zoom Communications, Inc.","Symbol":"ZM","Current Price":"74.15","Latest MA":"84.13","Latest MA 5":79.0839993286,"Latest MA 9":81.7833326552,"Latest MA 20":84.1275000763,"Price Target":91.4869,"Difference from MA":"-11.86%","Difference from Open":"-0.05%","Change from Yesterday":"-0.09%","Change from Last Report":"0.00","Latest Volume":"3,789,420","Market Cap":"22,726,604,800","Earning Date":"2025-02-24","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":14.017014,"PB Ratio":2.544001,"Previous Close":74.22,"ROE":0.119169995,"DTE":0.419,"Industry":"Software - Application","Sector":"Technology","Beta":-0.005,"Trailing PEG":2.7146,"Trailing PE":23.09969,"Trailing PS":4.8712745,"Quick Ratio":4.354,"Day High":75.415,"Day Low":73.5101,"VS Average Volume":1.4109638619,"Company Summary":"Zoom Communications Inc. provides unified communications platform in the Americas, the Asia Pacific, Europe, the Middle East, and Africa. The company offers Zoom Meetings that offers HD video, voice, chat, and content sharing through mobile devices, desktops, laptops, telephones, and conference room systems; Zoom Phone, an enterprise cloud phone system; and Zoom Chat enables users to share messages, images, audio files, and content in desktop, laptop, tablet, and mobile devices. It also provides Zoom Rooms, a software-based conference room system; Zoom Conference Room Connector, a gateway for SIP\/H.323 endpoints to join Zoom meetings; Zoom Events, which enables users to manage and host internal and external virtual events; OnZoom, a prosumer-focused virtual event platform and marketplace for Zoom users to create, host, and monetize online events; and Zoom Webinars to provide video presentations to large audiences from many devices. In addition, the company offers Zoom Developer Platform that enables developers, platform integrators, service providers, and customers to build apps and integrations using Zoom's video-based communications solutions, as well as integrate Zoom's technology into their products and services; Zoom App Marketplace, which helps developers to publish their apps, as well as third-party integrations of Zoom; and Zoom Contact Center, an omnichannel contact center solution. It serves individuals; and education, entertainment\/media, enterprise infrastructure, finance, government, healthcare, manufacturing, non-profit\/not for profit and social impact, retail\/consumer products, and software\/Internet industries. The company was formerly known as Zoom Video Communications, Inc. and changed its name to Zoom Communications, Inc. in November 2024. The company was incorporated in 2011 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 11:13:20"},{"Company Name":"Coterra Energy Inc.","Symbol":"CTRA","Current Price":"26.87","Latest MA":"27.94","Latest MA 5":27.8299997559,"Latest MA 9":27.8711110348,"Latest MA 20":27.9359999237,"Price Target":34.5063,"Difference from MA":"-3.82%","Difference from Open":"-3.10%","Change from Yesterday":"-1.86%","Change from Last Report":"0.00","Latest Volume":"7,537,782","Market Cap":"20,532,738,048","Earning Date":"2025-02-24","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":11.532189,"PB Ratio":1.5050691,"Previous Close":27.38,"ROE":0.08565,"DTE":28.957,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":0.239,"Trailing PEG":null,"Trailing PE":17.913334,"Trailing PS":3.9154723,"Quick Ratio":2.649,"Day High":27.73,"Day Low":26.735,"VS Average Volume":1.2378403872,"Company Summary":"Coterra Energy Inc., an independent oil and gas company, engages in the development, exploration, and production of oil, natural gas, and natural gas liquids in the United States. The company's properties include the Marcellus Shale with approximately 186,000 net acres in the dry gas window of the play located in Susquehanna County, Pennsylvania; Permian Basin properties with approximately 296,000 net acres located in west Texas and southeast New Mexico; and Anadarko Basin properties with approximately 182,000 net acres located in Oklahoma. It also operates natural gas and saltwater gathering and disposal systems in Texas. The company sells its natural gas to industrial customers, local distribution companies, oil and gas marketers, major energy companies, pipeline companies, and power generation facilities. Coterra Energy Inc. was incorporated in 1989 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 11:13:20"},{"Company Name":"Civitas Resources, Inc.","Symbol":"CIVI","Current Price":"39.79","Latest MA":"49.06","Latest MA 5":45.8980001526,"Latest MA 9":47.8588887363,"Latest MA 20":49.061000206,"Price Target":68.4,"Difference from MA":"-18.90%","Difference from Open":"-1.07%","Change from Yesterday":"-1.39%","Change from Last Report":"0.00","Latest Volume":"5,170,505","Market Cap":"3,701,158,400","Earning Date":"2025-02-24","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":4.396685,"PB Ratio":0.5638533,"Previous Close":40.35,"ROE":0.13095,"DTE":69.22,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":1.483,"Trailing PEG":0.3224,"Trailing PE":4.70331,"Trailing PS":0.71083057,"Quick Ratio":0.384,"Day High":40.755,"Day Low":38.6,"VS Average Volume":3.6456010988,"Company Summary":"Civitas Resources, Inc., an exploration and production company, focuses on the acquisition, development, and production of oil and natural gas in the Rocky Mountain region, primarily in the Field of the Denver-Julesburg Basin of Colorado. It also holds interest in production wells. The company was formerly known as Bonanza Creek Energy, Inc. Civitas Resources, Inc. was founded in 1999 and is based in Denver, Colorado.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 11:13:20"},{"Company Name":"Realty Income Corporation","Symbol":"O","Current Price":"56.10","Latest MA":"54.98","Latest MA 5":56.6520007324,"Latest MA 9":55.9522223579,"Latest MA 20":54.9786175537,"Price Target":61.65,"Difference from MA":"2.04%","Difference from Open":"-0.10%","Change from Yesterday":"-0.25%","Change from Last Report":"0.00","Latest Volume":"5,163,418","Market Cap":"50,014,048,256","Earning Date":"2025-02-24","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":35.283016,"PB Ratio":1.2876718,"Previous Close":56.24,"ROE":0.02404,"DTE":67.16,"Industry":"REIT - Retail","Sector":"Real Estate","Beta":1.01,"Trailing PEG":5.86,"Trailing PE":57.244896,"Trailing PS":9.474269,"Quick Ratio":0.622,"Day High":56.91,"Day Low":55.91,"VS Average Volume":1.0138467332,"Company Summary":"Realty Income (NYSE: O), an S&P 500 company, is real estate partner to the world's leading companies. Founded in 1969, we invest in diversified commercial real estate and have a portfolio of 15,450 properties in all 50 U.S. states, the U.K., and six other countries in Europe. We are known as \"The Monthly Dividend Company\" and have a mission to deliver stockholders dependable monthly dividends that grow over time. Since our founding, we have declared 649 consecutive monthly dividends and are a member of the S&P 500 Dividend Aristocrats index for having increased our dividend for the last 29 consecutive years.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"27-02-2025 11:13:20"},{"Company Name":"ONEOK, Inc.","Symbol":"OKE","Current Price":"95.76","Latest MA":"97.74","Latest MA 5":97.2759990234,"Latest MA 9":97.89333235,"Latest MA 20":97.7368674164,"Price Target":110.91684,"Difference from MA":"-2.02%","Difference from Open":"0.58%","Change from Yesterday":"-0.01%","Change from Last Report":"0.00","Latest Volume":"3,242,210","Market Cap":"59,786,797,056","Earning Date":"2025-02-24","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":16.040201,"PB Ratio":3.277656,"Previous Close":95.77,"ROE":0.16117,"DTE":144.928,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":1.659,"Trailing PEG":2.4558,"Trailing PE":18.522243,"Trailing PS":2.7554057,"Quick Ratio":0.648,"Day High":96.32,"Day Low":94.41,"VS Average Volume":0.9085592394,"Company Summary":"ONEOK, Inc. engages in gathering, processing, fractionation, storage, transportation, and marketing of natural gas and natural gas liquids (NGL) in the United States. It operates through four segments: Natural Gas Gathering and Processing, Natural Gas Liquids, Natural Gas Pipelines, and Refined Products and Crude. The company owns natural gas gathering pipelines and processing plants in the Mid-Continent and Rocky Mountain regions; and provides midstream services to producers of NGLs. It also owns NGL gathering and distribution pipelines in Oklahoma, Kansas, Texas, New Mexico, Montana, North Dakota, Wyoming, and Colorado; terminal and storage facilities in Kansas, Nebraska, Iowa, and Illinois; NGL distribution pipelines in Kansas, Nebraska, Iowa, Illinois, and Indiana; transports refined petroleum products, including unleaded gasoline and diesel; and owns and operates truck- and rail-loading, and -unloading facilities connected to NGL fractionation, storage, and pipeline assets. In addition, the company transports and stores natural gas through regulated interstate and intrastate natural gas transmission pipelines, and natural gas storage facilities. Further, it owns and operates a parking garage in downtown Tulsa, Oklahoma; and leases excess office space and rail cars. Additionally, the company transports, stores, and distributes refined products, NGLs, and crude oil, as well as conducts commodity-related activities, including liquids blending and marketing activities. It serves integrated and independent exploration and production companies; other NGL and natural gas gathering and processing companies; crude oil and natural gas production companies; utilities; industrial companies; natural gasoline distributors; propane distributors; municipalities; ethanol producers; petrochemical, refining, and marketing companies; and heating fuel users, refineries, and exporters. ONEOK, Inc. was founded in 1906 and is headquartered in Tulsa, Oklahoma.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 11:13:20"},{"Company Name":"Hims & Hers Health, Inc.","Symbol":"HIMS","Current Price":"41.89","Latest MA":"46.97","Latest MA 5":49.750000885,"Latest MA 9":55.071111535,"Latest MA 20":46.9715002365,"Price Target":42.45,"Difference from MA":"-10.82%","Difference from Open":"4.10%","Change from Yesterday":"5.09%","Change from Last Report":"0.00","Latest Volume":"44,874,841","Market Cap":"9,306,533,888","Earning Date":"2025-02-24","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":91.065216,"PB Ratio":19.402502,"Previous Close":39.86,"ROE":0.30712998,"DTE":2.38,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":1.35,"Trailing PEG":3.9552,"Trailing PE":79.03774,"Trailing PS":6.303045,"Quick Ratio":1.384,"Day High":44.62,"Day Low":39.92,"VS Average Volume":2.5191211658,"Company Summary":"Hims & Hers Health, Inc. operates a telehealth platform that connects consumers to licensed healthcare professionals in the United States, the United Kingdom, and internationally. The company offers a range of curated prescription and non-prescription health and wellness products and services available to purchase on its websites and mobile application directly by customers. It also provides prescription medication on a recurring basis and ongoing care from healthcare providers; and over-the-counter drug and device products, cosmetics, and supplement products primarily focusing on general wellness, sexual health and wellness, skincare, and hair care. In addition, the company's curated non-prescription products include melatonin and biotin in the wellness specialty category; moisturizers, creams, sunscreen, serum, face oil, and face wash in the skincare specialty; condoms, climax delay spray and wipes, vibrators, and lubricants in the sexual health and wellness specialty; and shampoos, conditioners, scalp scrubs, and topical treatments, such as minoxidil in the hair care specialty category. Further, it offers medical consultation and post-consultation support services, as well as health and wellness products through wholesale partners. Hims & Hers Health, Inc. is based in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"27-02-2025 11:13:20"},{"Company Name":"Cleveland-Cliffs Inc.","Symbol":"CLF","Current Price":"10.57","Latest MA":"10.93","Latest MA 5":11.1679999008,"Latest MA 9":11.3977778032,"Latest MA 20":10.9340000305,"Price Target":12.38889,"Difference from MA":"-3.33%","Difference from Open":"-4.95%","Change from Yesterday":"-2.04%","Change from Last Report":"0.00","Latest Volume":"17,529,475","Market Cap":"5,226,663,936","Earning Date":"2025-02-24","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":27.102564,"PB Ratio":0.78348523,"Previous Close":10.79,"ROE":-0.094280005,"DTE":113.107,"Industry":"Steel","Sector":"Basic Materials","Beta":1.951,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.27243492,"Quick Ratio":0.491,"Day High":11.33,"Day Low":10.48,"VS Average Volume":1.0722002624,"Company Summary":"Cleveland-Cliffs Inc. operates as a flat-rolled steel producer in North America. The company offers hot-rolled, cold-rolled, electrogalvanized, hot-dip galvanized, hot-dip galvannealed, aluminized, galvalume, enameling, and advanced high-strength steel products; austenitic, martensitic, duplex, precipitation hardening, and ferritic stainless steel products; plates; and grain oriented and non-oriented electrical steel products, as well as slab, scrap, iron ore, coal, and coke. It also provides tubular components, including carbon steel, stainless steel, and electric resistance welded tubing. In addition, the company offers tinplate products, such as electrolytic tin coated and chrome coated sheet, and tin mill products; tooling and sampling; ingots, rolled blooms, and cast blooms; and hot-briquetted iron products. Further, it owns five iron ore mines in Minnesota and Michigan. The company serves automotive, infrastructure and manufacturing, distributors and converters, and steel producers. The company was formerly known as Cliffs Natural Resources Inc. and changed its name to Cleveland-Cliffs Inc. in August 2017. Cleveland-Cliffs Inc. was founded in 1847 and is headquartered in Cleveland, Ohio.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"27-02-2025 11:13:20"},{"Company Name":"Diamondback Energy, Inc.","Symbol":"FANG","Current Price":"152.43","Latest MA":"160.32","Latest MA 5":155.5579970703,"Latest MA 9":156.4411086697,"Latest MA 20":160.3214992371,"Price Target":212.13733,"Difference from MA":"-4.92%","Difference from Open":"0.40%","Change from Yesterday":"0.34%","Change from Last Report":"0.00","Latest Volume":"3,300,886","Market Cap":"44,354,686,976","Earning Date":"2025-02-24","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":10.411884,"PB Ratio":1.1753955,"Previous Close":151.92,"ROE":0.1292,"DTE":32.816,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":1.839,"Trailing PEG":null,"Trailing PE":9.815196,"Trailing PS":4.023831,"Quick Ratio":0.363,"Day High":153.95,"Day Low":151.0,"VS Average Volume":1.4667058276,"Company Summary":"Diamondback Energy, Inc., an independent oil and natural gas company, acquires, develops, explores, and exploits unconventional, onshore oil and natural gas reserves in the Permian Basin in West Texas. It focuses on the development of the Spraberry and Wolfcamp formations of the Midland basin; and the Wolfcamp and Bone Spring formations of the Delaware basin, which are part of the Permian Basin in West Texas and New Mexico. The company also owns and operates midstream infrastructure assets, in the Midland and Delaware Basins of the Permian Basin. Diamondback Energy, Inc. was founded in 2007 and is headquartered in Midland, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"27-02-2025 11:13:20"},{"Company Name":"KBR, Inc.","Symbol":"KBR","Current Price":"47.88","Latest MA":"52.59","Latest MA 5":49.2340001831,"Latest MA 9":50.4866666667,"Latest MA 20":52.5935000839,"Price Target":72.88889,"Difference from MA":"-8.96%","Difference from Open":"0.59%","Change from Yesterday":"-0.75%","Change from Last Report":"0.00","Latest Volume":"2,564,787","Market Cap":"6,341,323,264","Earning Date":"2025-02-24","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":12.340206,"PB Ratio":4.364233,"Previous Close":48.24,"ROE":0.26634002,"DTE":195.706,"Industry":"Engineering & Construction","Sector":"Industrials","Beta":0.837,"Trailing PEG":0.5841,"Trailing PE":17.161291,"Trailing PS":0.81908077,"Quick Ratio":0.971,"Day High":48.285,"Day Low":47.16,"VS Average Volume":1.6868072171,"Company Summary":"KBR, Inc. provides scientific, technology, and engineering solutions to governments and commercial customers worldwide. It operates through Government Solutions and Sustainable Technology Solutions segments. The Government Solutions segment offers life-cycle support solutions to defense, intelligence, space, aviation, and other programs and missions for military and other government agencies in the United States, the United Kingdom, and Australia. Its services cover research and development, advanced prototyping, acquisition support, systems engineering, cyber analytics, space domain awareness, test and evaluation, systems integration and program management, global supply chain management, and operations readiness and support, as well as command, control, communications, computers, intelligence, surveillance, and reconnaissance services. This segment also provides various professional advisory services to the defense, renewable energy, and critical infrastructure sectors. The Sustainable Technology Solutions segment operates portfolio of various proprietary process technologies for ammonia\/syngas, chemical\/petrochemicals, clean refining, and circular process\/circular economy solutions. This segment also provides synergistic services, including advisory and consulting focused on broad-based energy transition and net-zero carbon emission solutions; high-end engineering, design and program management centered around decarbonization, energy efficiency, environmental impact and asset optimization; and digitally-enabled operating and monitoring solutions. KBR, Inc. was founded in 1901 and is headquartered in Houston, Texas.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"27-02-2025 11:13:20"}]