[{"Company Name":"United Airlines Holdings, Inc.","Symbol":"UAL","Current Price":"104.46","Latest MA":"65.55","Price Target":119.48261,"Difference from MA":"59.37%","Difference from Open":"0.03%","Change from Yesterday":"-2.61%","Change from Last Report":"0.00","Latest Volume":"1,787,222","Market Cap":"34,354,651,136","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":8.211765,"PB Ratio":3.0035596,"ROE":0.27245,"DTE":291.676,"Industry":"Airlines","Sector":"Industrials","Beta":1.393,"Trailing PEG":0.8508,"Trailing PE":12.450631,"Trailing PS":0.61354166,"Quick Ratio":0.694,"Day High":105.13,"Day Low":103.0,"VS Average Volume":0.2751070583,"Company Summary":"United Airlines Holdings, Inc., through its subsidiaries, provides air transportation services in North America, Asia, Europe, Africa, the Pacific, the Middle East, and Latin America. The company transports people and cargo through its mainline and regional fleets. It also offers catering, ground handling, flight academy, and maintenance services for third parties. The company was formerly known as United Continental Holdings, Inc. and changed its name to United Airlines Holdings, Inc. in June 2019. United Airlines Holdings, Inc. was incorporated in 1968 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"13-01-2025 18:03:25"},{"Company Name":"GE Aerospace","Symbol":"GE","Current Price":"170.19","Latest MA":"172.10","Price Target":209.18353,"Difference from MA":"-1.11%","Difference from Open":"0.40%","Change from Yesterday":"-0.76%","Change from Last Report":"0.00","Latest Volume":"1,273,164","Market Cap":"184,194,940,928","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":32.36265,"PB Ratio":9.759161,"ROE":0.22552,"DTE":110.224,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.188,"Trailing PEG":null,"Trailing PE":33.634388,"Trailing PS":2.633124,"Quick Ratio":0.804,"Day High":172.52,"Day Low":169.0,"VS Average Volume":0.2600764604,"Company Summary":"General Electric Company, doing business as GE Aerospace, designs and produces commercial and defense aircraft engines, integrated engine components, electric power, and mechanical aircraft systems. It also offers aftermarket services to support its products. The company operates in the United States, Europe, China, Asia, the Americas, the Middle East, and Africa. General Electric Company was incorporated in 1892 and is based in Evendale, Ohio.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"13-01-2025 18:03:25"},{"Company Name":"KeyCorp","Symbol":"KEY","Current Price":"16.67","Latest MA":"16.38","Price Target":21.215,"Difference from MA":"1.78%","Difference from Open":"0.42%","Change from Yesterday":"-0.48%","Change from Last Report":"0.00","Latest Volume":"3,132,105","Market Cap":"18,445,856,768","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":10.767551,"PB Ratio":1.1513226,"ROE":0.0096700005,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.231,"Trailing PEG":0.6931,"Trailing PE":"Infinity","Trailing PS":3.801702,"Quick Ratio":"N\/A","Day High":16.7788,"Day Low":16.58,"VS Average Volume":0.3258322305,"Company Summary":"KeyCorp operates as the holding company for KeyBank National Association that provides various retail and commercial banking products and services in the United States. It operates in two segments, Consumer Bank and Commercial Bank. The company offers various deposits, investment products and services; commercial leasing, investment management, consumer finance; and personal finance and financial wellness, student loan refinancing, mortgage and home equity, lending, credit card, treasury, business advisory, wealth management, asset management, cash management, portfolio management, and trust and related services to individuals and small and medium-sized businesses. It also provides a suite of banking and capital market products, such as syndicated finance, debt and equity capital market products, commercial payments, equipment finance, commercial mortgage banking, derivatives, foreign exchange, financial advisory, and public finance, as well as commercial mortgage loans to consumer, energy, healthcare, industrial, public sector, real estate, and technology sectors for middle market clients. In addition, the company offers community development financing, securities underwriting, brokerage, and investment banking services. The company was founded in 1849 and is headquartered in Cleveland, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-01-2025 18:03:25"},{"Company Name":"Citizens Financial Group, Inc.","Symbol":"CFG","Current Price":"43.74","Latest MA":"41.29","Price Target":51.505,"Difference from MA":"5.93%","Difference from Open":"1.60%","Change from Yesterday":"0.79%","Change from Last Report":"0.00","Latest Volume":"1,052,432","Market Cap":"19,276,261,376","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":11.397184,"PB Ratio":0.8533635,"ROE":0.05426,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.32,"Trailing PEG":null,"Trailing PE":17.152943,"Trailing PS":2.7092428,"Quick Ratio":"N\/A","Day High":43.835,"Day Low":42.9622,"VS Average Volume":0.2515496099,"Company Summary":"Citizens Financial Group, Inc. operates as the bank holding company that provides retail and commercial banking products and services to individuals, small businesses, middle-market companies, corporations, and institutions in the United States. The company operates in two segments, Consumer Banking and Commercial Banking. The Consumer Banking segment offers deposit products, mortgage and home equity lending products, credit cards, business loans, wealth management, and investment services; and auto, education, and point-of-sale finance loans, as well as digital deposit products. This segment serves its customers through telephone service centers, as well as through its online and mobile platforms. The Commercial Banking segment provides various financial products and solutions, including lending and leasing, deposit and treasury management services, foreign exchange, and interest rate and commodity risk management solutions, as well as syndicated loans, corporate finance, mergers and acquisitions, and debt and equity capital markets services. This segment serves corporate banking, healthcare, technology, asset finance, franchise finance, leasing, asset-based lending, commercial real estate, mid-corporate, and private equity sponsor industries. The company was formerly known as RBS Citizens Financial Group, Inc. and changed its name to Citizens Financial Group, Inc. in April 2014. Citizens Financial Group, Inc. was founded in 1828 and is headquartered in Providence, Rhode Island.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-01-2025 18:03:25"},{"Company Name":"Regions Financial Corporation","Symbol":"RF","Current Price":"23.25","Latest MA":"22.60","Price Target":27.57522,"Difference from MA":"2.86%","Difference from Open":"0.93%","Change from Yesterday":"0.69%","Change from Last Report":"0.00","Latest Volume":"1,187,276","Market Cap":"21,126,545,408","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":10.332443,"PB Ratio":1.2479197,"ROE":0.10042,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.182,"Trailing PEG":4.4363,"Trailing PE":13.132769,"Trailing PS":3.2224748,"Quick Ratio":"N\/A","Day High":23.29,"Day Low":22.97,"VS Average Volume":0.1482013327,"Company Summary":"Regions Financial Corporation, a financial holding company, provides banking and bank-related services to individual and corporate customers. It operates through three segments: Corporate Bank, Consumer Bank, and Wealth Management. The Corporate Bank segment offers commercial banking services, such as commercial and industrial, commercial real estate, and investor real estate lending; equipment lease financing; deposit products; and securities underwriting and placement, loan syndication and placement, foreign exchange, derivatives, merger and acquisition, and other advisory services. It serves corporate, middle market, and commercial real estate developers and investors. The Consumer Bank segment provides consumer banking products and services related to residential first mortgages, home equity lines and loans, consumer credit cards, and other consumer loans, as well as deposits. The Wealth Management segment offers credit related products, and retirement and savings solutions; and trust and investment management, asset management, and estate planning services to individuals, businesses, governmental institutions, and non-profit entities. It also provides investment and insurance products; low-income housing tax credit corporate fund syndication services; and other specialty financing services. The company was founded in 1971 and is headquartered in Birmingham, Alabama.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-01-2025 18:03:25"},{"Company Name":"Truist Financial Corporation","Symbol":"TFC","Current Price":"42.96","Latest MA":"42.29","Price Target":50.29333,"Difference from MA":"1.59%","Difference from Open":"0.63%","Change from Yesterday":"0.27%","Change from Last Report":"0.00","Latest Volume":"1,327,000","Market Cap":"57,030,258,688","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":10.905767,"PB Ratio":0.9662401,"ROE":-0.09505,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.035,"Trailing PEG":1.9441,"Trailing PE":"N\/A","Trailing PS":3.9339352,"Quick Ratio":"N\/A","Day High":43.1277,"Day Low":42.6567,"VS Average Volume":0.1682955315,"Company Summary":"Truist Financial Corporation, a financial services company, provides banking and trust services in the Southeastern and Mid-Atlantic United States. The company operates through three segments: Consumer Banking and Wealth, Corporate and Commercial Banking, and Insurance Holdings.Its deposit products include noninterest-bearing checking, interest-bearing checking, savings, and money market deposit accounts, as well as certificates of deposit and individual retirement accounts. The company also provides funding; asset management; automobile lending; credit card lending; consumer finance; home equity and mortgage lending; other direct retail lending; insurance; investment brokerage; mobile\/online banking; payment solutions; point-of-sale lending; retail and small business deposit products; small business lending; and wealth management\/private banking services. In addition, it offers asset based lending, investment banking and capital market, institutional trust, insurance premium finance, derivatives, commercial lending, international banking, leasing, merchant, commercial deposit and treasury, floor plan, mortgage warehouse lending, real estate lending, and supply chain financing services. Further, the company provides insurance brokerage, retail and wholesale brokerage, securities underwriting and market making, loan syndication, and investment management and advisory services. The company was formerly known as BB&T Corporation and changed its name to Truist Financial Corporation in December 2019. Truist Financial Corporation was founded in 1872 and is headquartered in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-01-2025 18:03:25"},{"Company Name":"Schlumberger N.V.","Symbol":"SLB","Current Price":"39.94","Latest MA":"42.91","Price Target":54.961,"Difference from MA":"-6.93%","Difference from Open":"2.91%","Change from Yesterday":"3.55%","Change from Last Report":"0.00","Latest Volume":"4,074,517","Market Cap":"56,401,268,736","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":11.568864,"PB Ratio":2.6219392,"ROE":0.21722999,"DTE":57.141,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.532,"Trailing PEG":1.7217,"Trailing PE":12.842443,"Trailing PS":1.5669194,"Quick Ratio":1.003,"Day High":40.015,"Day Low":38.79,"VS Average Volume":0.3424997697,"Company Summary":"Schlumberger Limited engages in the provision of technology for the energy industry worldwide. The company operates through four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company provides field development and hydrocarbon production, carbon management, and integration of adjacent energy systems; reservoir interpretation and data processing services for exploration data; and well construction and production improvement services and products. It also offers subsurface geology and fluids evaluation information; open and cased hole services; exploration and production pressure, and flow-rate measurement services; and pressure pumping, well stimulation, and coiled tubing equipment solutions. In addition, the company offers mud logging, directional drilling, measurement-while-drilling, and logging-while-drilling services, as well as engineering support services; supplies drilling fluid systems; designs, manufactures, and markets roller cone and fixed cutter drill bits; bottom-hole-assembly and borehole enlargement technologies; well cementing products and services; well planning, well drilling, engineering, supervision, logistics, procurement, and contracting of third parties, as well as drilling rig management solutions; and drilling equipment and services, as well as land drilling rigs and related services. Further, it provides artificial lift production equipment and optimization services; supplies packers, safety valves, sand control technology, and various intelligent well completions technology and equipment; designs and manufactures valves, chokes, actuators, and surface trees; and OneSubsea, an integrated solutions, products, systems, and services, including wellheads, subsea trees, manifolds and flowline connectors, control systems, connectors, and services. The company was formerly known as Socie´te´ de Prospection E´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"13-01-2025 18:03:25"},{"Company Name":"Huntington Bancshares Incorpora","Symbol":"HBAN","Current Price":"16.07","Latest MA":"14.91","Price Target":18.6605,"Difference from MA":"7.83%","Difference from Open":"0.59%","Change from Yesterday":"0.22%","Change from Last Report":"0.00","Latest Volume":"2,372,690","Market Cap":"23,353,921,536","Earning Date":"2025-01-17","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":11.801977,"PB Ratio":1.282307,"ROE":0.08545,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.057,"Trailing PEG":2.7085,"Trailing PE":15.606797,"Trailing PS":3.4908702,"Quick Ratio":"N\/A","Day High":16.135,"Day Low":15.93,"VS Average Volume":0.1632888707,"Company Summary":"Huntington Bancshares Incorporated operates as the bank holding company for The Huntington National Bank that provides commercial, consumer, and mortgage banking services in the United States. The company offers financial products and services to consumer and business customers, including deposits, lending, payments, mortgage banking, dealer financing, investment management, trust, brokerage, insurance, and other financial products and services. It also provides 24-hour grace, asterisk-free checking, money scout, $50 safety zone, standby cash, early pay, instant access, savings goal getter, and Huntington heads up; digitally powered consumer and business financial solutions to consumer lending, regional banking, branch banking, and wealth management customers; direct and indirect consumer loans, as well as dealer finance loans and deposits; and private banking, wealth management and legacy planning through investment and portfolio management, fiduciary administration and trust, institutional custody, and full-service retail brokerage investment services. The company offers equipment financing, asset-based lending, distribution finance, structured lending, and municipal financing solutions, as well as Huntington ChoicePay. In addition, it offers lending, liquidity, treasury management and other payment services, and capital markets; government and non-profits, healthcare, technology and telecommunications, franchises, financial sponsors, and global services; and corporate risk management, institutional sales and trading, debt and equity issuance, and additional advisory services. The company offers its products through a network of channels, including branches and ATMs, online and mobile banking, and through customer call centers to customers in middle market banking, corporate, specialty, and government banking, asset finance, commercial real estate banking, and capital markets. The company was founded in 1866 and is headquartered in Columbus, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"13-01-2025 18:03:25"}]