[{"Company Name":"Edwards Lifesciences Corporatio","Symbol":"EW","Current Price":"70.84","Latest MA":"72.98","Price Target":79.57483,"Difference from MA":"-2.93%","Difference from Open":"-0.83%","Change from Yesterday":"-0.38%","Change from Last Report":"0.00","Latest Volume":"1,096,651","Market Cap":"41,781,428,224","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":28.956478,"PB Ratio":4.3771625,"ROE":0.19139,"DTE":7.353,"Industry":"Medical Devices","Sector":"Healthcare","Beta":1.12,"Trailing PEG":6.5234,"Trailing PE":27.35135,"Trailing PS":6.6163244,"Quick Ratio":2.704,"Day High":72.095,"Day Low":70.71,"VS Average Volume":0.2202713313,"Company Summary":"Edwards Lifesciences Corporation provides products and technologies for structural heart disease and critical care monitoring in the United States, Europe, Japan, and internationally. It offers transcatheter heart valve replacement products for the minimally invasive replacement of aortic heart valves under the Edwards SAPIEN family of valves system; and transcatheter heart valve repair and replacement products to treat mitral and tricuspid valve diseases under the PASCAL PRECISION and Cardioband names. The company also provides surgical structural heart solutions, such as aortic surgical valve under the INSPIRIS name; INSPIRIS RESILLA aortic valve, which offers RESILIA tissue and VFit technology; KONECT RESILIA, a pre-assembled tissue valves conduit for complex combined procedures; and MITRIS RESILIA valve. In addition, it offers critical care solutions, including hemodynamic monitoring systems to measure a patient's heart function and fluid status in surgical and intensive care settings under the FloTrac, Acumen IQ sensors, ClearSight, Acumen IQ cuffs, and ForeSight names; HemoSphere, a monitoring platform that displays physiological information; and Acumen Hypotension Prediction Index software that alerts clinicians in advance of a patient developing dangerously low blood pressure. The company distributes its products through a direct sales force and independent distributors. Edwards Lifesciences Corporation was founded in 1958 and is headquartered in Irvine, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-01-2025 19:24:21"},{"Company Name":"Southwest Airlines Company","Symbol":"LUV","Current Price":"32.91","Latest MA":"29.67","Price Target":32.2581,"Difference from MA":"10.95%","Difference from Open":"-2.24%","Change from Yesterday":"-0.54%","Change from Last Report":"-0.11","Latest Volume":"1,413,510","Market Cap":"19,740,344,320","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":20.013256,"PB Ratio":1.8961347,"ROE":-0.00447,"DTE":87.36,"Industry":"Airlines","Sector":"Industrials","Beta":1.153,"Trailing PEG":0.4974,"Trailing PE":"N\/A","Trailing PS":0.7210821,"Quick Ratio":0.783,"Day High":33.635,"Day Low":32.78,"VS Average Volume":0.2043512706,"Company Summary":"Southwest Airlines Co. operates as a passenger airline company that provides scheduled air transportation services in the United States and near-international markets. As of December 31, 2023, the company operated a total fleet of 817 Boeing 737 aircraft; and served 121 destinations in 42 states, the District of Columbia, and the Commonwealth of Puerto Rico, as well as ten near-international countries, including Mexico, Jamaica, the Bahamas, Aruba, the Dominican Republic, Costa Rica, Belize, Cuba, the Cayman Islands, and Turks and Caicos. It also provides inflight entertainment and connectivity services on Wi-Fi enabled aircraft; and Rapid Rewards loyalty program that enables program members to earn points for dollars spent on Southwest base fares. In addition, the company offers a suite of digital platforms to support customers' travel needs, including websites and apps; and SWABIZ, an online booking tool. Further, it provides ancillary services, such as Southwest's EarlyBird Check-In, upgraded boarding, and transportation of pets and unaccompanied minors. Southwest Airlines Co. was incorporated in 1967 and is headquartered in Dallas, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"15-01-2025 19:24:21"},{"Company Name":"United Parcel Service, Inc.","Symbol":"UPS","Current Price":"126.94","Latest MA":"129.77","Price Target":148.52097,"Difference from MA":"-2.18%","Difference from Open":"-0.44%","Change from Yesterday":"0.87%","Change from Last Report":"-0.13","Latest Volume":"1,302,393","Market Cap":"108,322,512,896","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":14.473592,"PB Ratio":6.4231863,"ROE":0.31422,"DTE":155.425,"Industry":"Integrated Freight & Logistics","Sector":"Industrials","Beta":0.982,"Trailing PEG":1.6161,"Trailing PE":19.17447,"Trailing PS":1.194479,"Quick Ratio":1.027,"Day High":127.76,"Day Low":126.58,"VS Average Volume":0.3050426462,"Company Summary":"United Parcel Service, Inc., a package delivery company, provides transportation and delivery, distribution, contract logistics, ocean freight, airfreight, customs brokerage, and insurance services. It operates through two segments, U.S. Domestic Package and International Package. The U.S. Domestic Package segment offers time-definite delivery of express letters, documents, small packages, and palletized freight through air and ground services in the United States. The International Package segment provides guaranteed day and time-definite international shipping services comprising guaranteed time-definite express options in Europe, Asia, the Indian sub-continent, the Middle East, Africa, Canada, and Latin America. The company also offers international air and ocean freight forwarding, post-sales, and mail and consulting services. In addition, it provides truckload and customs brokerage services; supply chain solutions to the healthcare and life sciences industries; fulfillment and transportation management services; and integrated supply chain and shipment insurance solutions. United Parcel Service, Inc. was founded in 1907 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-01-2025 19:24:21"},{"Company Name":"Thermo Fisher Scientific Inc","Symbol":"TMO","Current Price":"553.52","Latest MA":"568.15","Price Target":646.08,"Difference from MA":"-2.57%","Difference from Open":"-0.78%","Change from Yesterday":"-0.67%","Change from Last Report":"-0.02","Latest Volume":"1,558,829","Market Cap":"211,723,321,344","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":23.760374,"PB Ratio":4.321578,"ROE":0.12944001,"DTE":72.329,"Industry":"Diagnostics & Research","Sector":"Healthcare","Beta":0.792,"Trailing PEG":2.1472,"Trailing PE":34.747334,"Trailing PS":4.99701,"Quick Ratio":1.126,"Day High":563.81,"Day Low":544.06,"VS Average Volume":0.8372900838,"Company Summary":"Thermo Fisher Scientific Inc. provides life sciences solutions, analytical instruments, specialty diagnostics, and laboratory products and biopharma services in the North America, Europe, Asia-Pacific, and internationally. The company's Life Sciences Solutions segment offers reagents, instruments, and consumables for biological and medical research, discovery, and production of drugs and vaccines, as well as diagnosis of infections and diseases; and solutions include biosciences, genetic sciences, and bio production to pharmaceutical, biotechnology, agricultural, clinical, healthcare, academic, and government markets. Its Analytical Instruments segment provides instruments, consumables, software, and services for pharmaceutical, biotechnology, academic, government, environmental, and other research and industrial markets, as well as clinical laboratories. The company's Specialty Diagnostics segment offers liquid, ready-to-use, and lyophilized immunodiagnostic reagent kits, as well as calibrators, controls, protein detection assays, and instruments; immunodiagnostics develops, manufactures and markets complete bloodtest systems to support the clinical diagnosis and monitoring of allergy, asthma and autoimmune diseases; dehydrated and prepared culture media, collection and transport systems, instrumentation, and consumables; human leukocyte antigen typing and testing for organ transplant market; and healthcare products. Its Laboratory Products and Biopharma Services segment provides laboratory products, research and safety market channel, and pharma services and clinical research. It offers products and services through a direct sales force, customer-service professionals, electronic commerce, and third-party distributors under Thermo Scientific; Applied Biosystems; Invitrogen; Fisher Scientific; Unity Lab Services; and Patheon and PPD. It has a collaboration agreement with Mainz Biomed N.V. for the development of colorectal cancer screening product. Thermo Fisher Scientific Inc. was founded in 1956 and is headquartered in Waltham, Massachusetts.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-01-2025 19:24:21"},{"Company Name":"Mastercard Incorporated","Symbol":"MA","Current Price":"518.76","Latest MA":"487.89","Price Target":569.3597,"Difference from MA":"6.33%","Difference from Open":"0.62%","Change from Yesterday":"1.79%","Change from Last Report":"-0.06","Latest Volume":"1,128,641","Market Cap":"476,134,014,976","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":31.680426,"PB Ratio":64.1474,"ROE":1.7757801,"DTE":244.839,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.101,"Trailing PEG":1.9469,"Trailing PE":39.210888,"Trailing PS":17.48821,"Quick Ratio":0.891,"Day High":519.42,"Day Low":513.73,"VS Average Volume":0.4394658383,"Company Summary":"Mastercard Incorporated, a technology company, provides transaction processing and other payment-related products and services in the United States and internationally. The company offers integrated products and value-added services for account holders, merchants, financial institutions, digital partners, businesses, governments, and other organizations, such as programs that enable issuers to provide consumers with credits to defer payments; payment products and solutions that allow its customers to access funds in deposit and other accounts; prepaid programs services; and commercial credit, debit, and prepaid payment products and solutions. It also provides solutions that enable businesses or governments to make payments to businesses, including Virtual Card Number, which is generated dynamically from a physical card and leverages the credit limit of the funding account; a platform to optimize supplier payment enablement campaigns for financial institutions; and treasury intelligence platform that offers corporations with recommendations to enhance working capital performance and accelerate spend on cards. In addition, the company offers Mastercard Send, which partners with digital messaging and payment platforms to enable consumers to send money directly within applications to other consumers; and Mastercard Cross-Border Services enables a range of payment flows through a distribution network with a single point of access to send and receive money globally through various channels, including bank accounts, mobile wallets, cards, and cash payouts. Further, it provides cyber and intelligence solutions; insights and analytics, consulting, marketing, loyalty, processing, and payment gateway solutions for e-commerce merchants; and open banking and digital identity services. The company offers payment solutions and services under the MasterCard, Maestro, and Cirrus name. Mastercard Incorporated was founded in 1966 and is headquartered in Purchase, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 19:24:21"},{"Company Name":"Unity Software Inc.","Symbol":"U","Current Price":"22.49","Latest MA":"19.67","Price Target":22.59565,"Difference from MA":"14.36%","Difference from Open":"-1.45%","Change from Yesterday":"2.41%","Change from Last Report":"-0.49","Latest Volume":"4,447,173","Market Cap":"9,059,871,744","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":28.577238,"PB Ratio":2.8439555,"ROE":-0.23091999,"DTE":68.801,"Industry":"Software - Application","Sector":"Technology","Beta":2.291,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":4.6096272,"Quick Ratio":2.26,"Day High":23.54,"Day Low":22.33,"VS Average Volume":0.40708621,"Company Summary":"Unity Software Inc. operates a platform that provides real-time 3D content and experiences. Its platform provides artificial intelligence solutions that support creators in building, running, and growing immersive, real-time 2D and 3D content for mobile phones, tablets, PCs, consoles, and augmented and virtual reality devices. The company also offers Create Solutions, a set of tools and services used to build, ship, and run real-time 2D and 3D content; and Grow Solutions, which allows customers to grow and engage their user base and monetize their content. It serves enterprises, mid-market companies, and government and non-profit institutions; mid-sized, small, and independent businesses; and individuals across various industries. The company offers its solutions directly through its online store, field sales operations, independent distributors, and resellers in North America, Denmark, China, Finland, the United Kingdom, Germany, Israel, Japan, Singapore, South Korea, Spain, and internationally. Unity Software Inc. was founded in 2004 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 19:24:21"},{"Company Name":"Altria Group, Inc.","Symbol":"MO","Current Price":"50.97","Latest MA":"50.02","Price Target":56.80333,"Difference from MA":"1.89%","Difference from Open":"0.24%","Change from Yesterday":"-0.85%","Change from Last Report":"0.06","Latest Volume":"2,476,031","Market Cap":"86,384,467,968","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":9.523115,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Tobacco","Sector":"Consumer Defensive","Beta":0.67,"Trailing PEG":3.5925,"Trailing PE":8.6097975,"Trailing PS":4.2424355,"Quick Ratio":0.274,"Day High":51.54,"Day Low":50.815,"VS Average Volume":0.3230425478,"Company Summary":"Altria Group, Inc., through its subsidiaries, manufactures and sells smokeable and oral tobacco products in the United States. The company offers cigarettes primarily under the Marlboro brand; large cigars and pipe tobacco under the Black & Mild brand; moist smokeless tobacco and snus products under the Copenhagen, Skoal, Red Seal, and Husky brands; oral nicotine pouches under the on! brand; and e-vapor products under the NJOY ACE brand. It sells its products to distributors, as well as large retail organizations, such as chain stores. The company was founded in 1822 and is headquartered in Richmond, Virginia.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"15-01-2025 19:24:21"},{"Company Name":"Microchip Technology Incorporat","Symbol":"MCHP","Current Price":"57.33","Latest MA":"75.29","Price Target":81.39167,"Difference from MA":"-23.86%","Difference from Open":"-1.24%","Change from Yesterday":"0.79%","Change from Last Report":"-0.20","Latest Volume":"1,853,177","Market Cap":"30,786,783,232","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":23.46657,"PB Ratio":4.9054503,"ROE":0.118030004,"DTE":102.895,"Industry":"Semiconductors","Sector":"Technology","Beta":1.526,"Trailing PEG":7.0285,"Trailing PE":39.8125,"Trailing PS":5.6010594,"Quick Ratio":0.405,"Day High":58.43,"Day Low":57.301,"VS Average Volume":0.2433892891,"Company Summary":"Microchip Technology Incorporated engages in the development, manufacture, and sale of smart, connected, and secure embedded control solutions in the Americas, Europe, and Asia. The company offers general purpose 8-bit, 16-bit, and 32-bit mixed-signal microcontrollers; 32-bit embedded mixed-signal microprocessors; and specialized microcontrollers for automotive, industrial, computing, communications, lighting, power supplies, motor control, human machine interface, security, wired connectivity, and wireless connectivity applications. It also provides analog, interface, mixed signal, and timing products comprising power management, linear, mixed-signal, high-voltage, thermal management, discrete diodes, and metal oxide semiconductor field effect transistors (MOSFETS), radio frequency (RF), drivers, safety, security, timing, USB, Ethernet, wireless, and other interface products; field-programmable gate array (FPGA) products; and application development tools that enable system designers to program microcontroller, FPGA, and microprocessor products for specific applications. In addition, the company offers serial electrically erasable programmable read-only memory, serial flash memories, parallel flash memories, serial static random access memories, and serial electrically erasable random access memories for the production of very small footprint devices; and licenses its SuperFlash embedded flash and non-volatile memory technologies to foundries, integrated device manufacturers, and design partners for use in the manufacture of microcontroller products, gate array, RF, analog, and neuromorphic compute products that require embedded non-volatile memory, as well as provides engineering services. Further, it offers wafer foundry and assembly, and test subcontracting manufacturing services; and timing systems products, application specific integrated circuits, and aerospace products. The company was incorporated in 1989 and is headquartered in Chandler, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-01-2025 19:24:21"},{"Company Name":"Dow Inc.","Symbol":"DOW","Current Price":"40.23","Latest MA":"48.63","Price Target":48.61111,"Difference from MA":"-17.27%","Difference from Open":"-0.62%","Change from Yesterday":"0.31%","Change from Last Report":"-0.09","Latest Volume":"1,818,697","Market Cap":"28,163,510,272","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":12.544217,"PB Ratio":1.538073,"ROE":0.05863,"DTE":95.059,"Industry":"Chemicals","Sector":"Basic Materials","Beta":1.222,"Trailing PEG":0.5751,"Trailing PE":26.818865,"Trailing PS":0.6522351,"Quick Ratio":0.8,"Day High":40.77,"Day Low":40.14,"VS Average Volume":0.2459909575,"Company Summary":"Dow Inc., through its subsidiaries, engages in the provision of various materials science solutions for packaging, infrastructure, mobility, and consumer applications in the United States, Canada, Europe, the Middle East, Africa, India, the Asia Pacific, and Latin America. The company operates through Packaging & Specialty Plastics, Industrial Intermediates & Infrastructure, and Performance Materials & Coatings segments. The Packaging & Specialty Plastics segment provides ethylene, and propylene and aromatics products; and polyethylene, polyolefin elastomers, ethylene vinyl acetate, and ethylene propylene diene monomer rubbers for mobility and transportation, consumer, wire and cable, and construction end-markets. The Industrial Intermediates & Infrastructure segment offers purified ethylene, ethylene and ethanol amines, propylene glycol and polyether polyols, aromatic isocyanates and coatings, adhesives, sealants, elastomers, and composites. This segment also provides caustic soda, and ethylene dichloride and vinyl chloride monomers; and cellulose ethers, redispersible latex powders, and acrylic emulsions. The Performance Materials and Coatings segment provides architectural paints and coatings, and industrial coatings that are used in maintenance and protective industries, wood, metal packaging, traffic markings, thermal paper, and leather; and silicon metal, siloxanes, and intermediates used as key materials in manufacturing differentiated downstream silicone products. It also engages in property and casualty insurance, as well as reinsurance business. Dow Inc. was incorporated in 2018 and is headquartered in Midland, Michigan.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"15-01-2025 19:24:21"},{"Company Name":"Visa Inc.","Symbol":"V","Current Price":"315.50","Latest MA":"285.41","Price Target":336.97623,"Difference from MA":"10.54%","Difference from Open":"0.58%","Change from Yesterday":"2.02%","Change from Last Report":"-0.01","Latest Volume":"2,136,363","Market Cap":"610,950,643,712","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":24.94561,"PB Ratio":15.714355,"ROE":0.50708,"DTE":53.239,"Industry":"Credit Services","Sector":"Financial Services","Beta":0.952,"Trailing PEG":2.05,"Trailing PE":32.3919,"Trailing PS":17.005808,"Quick Ratio":0.837,"Day High":316.42,"Day Low":313.17,"VS Average Volume":0.3467942163,"Company Summary":"Visa Inc. operates as a payment technology company in the United States and internationally. The company operates VisaNet, a transaction processing network that enables authorization, clearing, and settlement of payment transactions. It also offers credit, debit, and prepaid card products; tap to pay, tokenization, and click to pay services; Visa Direct, a solution that facilitates the delivery of funds to eligible cards, bank accounts, and digital wallets; Visa B2B Connect, a multilateral business-to-business cross-border payments network; Visa Cross-Border Solution, a cross-border consumer payments solution; and Visa DPS that provides a range of value-added services, including fraud mitigation, dispute management, data analytics, campaign management, a suite of digital solutions, and contact center services. The company also provides acceptance solutions, which include Cybersource and Authorize.net that provides new and enhanced payment integrations with ecommerce platforms, enabling sellers and acquirers to offer tailored commerce experiences; risk and identity solutions, such as Visa Advanced Authorization, Visa Secure, Visa Consumer Authentication Service, Visa Protect Authentication Intelligence, and Visa Provisioning Intelligence; and Visa Consulting and Analytics, a payment consulting advisory services. It provides its services under the Visa, Visa Electron, Interlink, V PAY, and PLUS brands. The company serves merchants, financial institutions, and government entities. Visa Inc. was founded in 1958 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 19:24:21"},{"Company Name":"Valero Energy Corporation","Symbol":"VLO","Current Price":"136.59","Latest MA":"138.82","Price Target":146.7021,"Difference from MA":"-1.60%","Difference from Open":"1.01%","Change from Yesterday":"1.79%","Change from Last Report":"-0.33","Latest Volume":"1,265,329","Market Cap":"43,242,344,448","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":16.776491,"PB Ratio":1.7123623,"ROE":0.13797,"DTE":38.593,"Industry":"Oil & Gas Refining & Marketing","Sector":"Energy","Beta":1.374,"Trailing PEG":null,"Trailing PE":12.013192,"Trailing PS":0.33591244,"Quick Ratio":1.001,"Day High":137.89,"Day Low":134.7,"VS Average Volume":0.4782019294,"Company Summary":"Valero Energy Corporation manufactures, markets, and sells petroleum-based and low-carbon liquid transportation fuels and petrochemical products in the United States, Canada, the United Kingdom, Ireland, Latin America, Mexico, Peru, and internationally. It operates through three segments: Refining, Renewable Diesel, and Ethanol. The company produces California Reformulated Gasoline Blendstock for Oxygenate Blending and Conventional Blendstock for Oxygenate Blending gasolines, CARB diesel, diesel, jet fuel, heating oil, and asphalt; feedstocks; aromatics; sulfur and residual fuel oil; intermediate oils; and sulfur, sweet, and sour crude oils. It sells its refined products through wholesale rack and bulk markets; and through outlets under the Valero, Beacon, Diamond Shamrock, Shamrock, Ultramar, and Texaco brands. The company owns and operates renewable diesel and ethanol plants, as well as produces renewable diesel and naphtha under the Diamond Green Diesel brand name. In addition, it offers ethanol and various co-products, including dry distiller grains, syrup, and inedible distillers corn oil to animal feed customers. The company was formerly known as Valero Refining and Marketing Company and changed its name to Valero Energy Corporation in August 1997. Valero Energy Corporation was founded in 1980 and is headquartered in San Antonio, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-01-2025 19:24:21"},{"Company Name":"Amazon.com, Inc.","Symbol":"AMZN","Current Price":"221.59","Latest MA":"194.69","Price Target":244.65157,"Difference from MA":"13.81%","Difference from Open":"-0.56%","Change from Yesterday":"1.78%","Change from Last Report":"0.09","Latest Volume":"12,832,966","Market Cap":"2,330,020,020,224","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":35.83971,"PB Ratio":8.987633,"ROE":0.22558,"DTE":61.175,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":1.146,"Trailing PEG":1.7853,"Trailing PE":47.348316,"Trailing PS":3.7573211,"Quick Ratio":0.827,"Day High":223.4734,"Day Low":220.75,"VS Average Volume":0.3401098314,"Company Summary":"Amazon.com, Inc. engages in the retail sale of consumer products, advertising, and subscriptions service through online and physical stores in North America and internationally. The company operates through three segments: North America, International, and Amazon Web Services (AWS). It also manufactures and sells electronic devices, including Kindle, Fire tablets, Fire TVs, Echo, Ring, Blink, and eero; and develops and produces media content. In addition, the company offers programs that enable sellers to sell their products in its stores; and programs that allow authors, independent publishers, musicians, filmmakers, Twitch streamers, skill and app developers, and others to publish and sell content. Further, it provides compute, storage, database, analytics, machine learning, and other services, as well as advertising services through programs, such as sponsored ads, display, and video advertising. Additionally, the company offers Amazon Prime, a membership program. The company's products offered through its stores include merchandise and content purchased for resale and products offered by third-party sellers. It serves consumers, sellers, developers, enterprises, content creators, advertisers, and employees. Amazon.com, Inc. was incorporated in 1994 and is headquartered in Seattle, Washington.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"15-01-2025 19:24:21"},{"Company Name":"Blackstone Inc.","Symbol":"BX","Current Price":"175.65","Latest MA":"153.89","Price Target":178.9,"Difference from MA":"14.14%","Difference from Open":"-0.61%","Change from Yesterday":"3.71%","Change from Last Report":"-0.07","Latest Volume":"1,375,496","Market Cap":"213,042,364,416","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":30.245373,"PB Ratio":19.247204,"ROE":0.22041,"DTE":65.956,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.486,"Trailing PEG":2.0909,"Trailing PE":60.36082,"Trailing PS":19.12705,"Quick Ratio":0.886,"Day High":177.47,"Day Low":174.37,"VS Average Volume":0.4058792616,"Company Summary":"Blackstone Inc. is an alternative asset management firm specializing in private equity, real estate, hedge fund solutions, credit, secondary funds of funds, public debt and equity and multi-asset class strategies. The firm typically invests in early-stage, seed, middle market, mature, late venture and later stage companies. It also provide capital markets services. The real estate segment specializes in opportunistic, core+ investments as well as debt investment opportunities collateralized by commercial real estate, and stabilized income-oriented commercial real estate across North America, Europe and Asia. The firm's corporate private equity business pursues transactions throughout the world across a variety of transaction types, including large buyouts, recapitalization, special situations, distressed mortgage loans, mid-cap buyouts, buy and build platforms, which involves multiple acquisitions behind a single management team and platform, and growth equity\/development projects involving significant majority stakes in portfolio companies and minority investments in operating companies, shipping, real estate, corporate or consumer loans, and alternative energy greenfield development projects in energy and power, property, dislocated markets, shipping opportunities, financial institution breakups, re-insurance, and improving freight mobility, financial services, healthcare, life sciences, infrastructure, enterprise tech and consumer, as well as consumer technologies. The firm considers investment in Asia and Latin America. It seeks to invest between $0.25 million and $900 million per transaction. It invests in companies with enterprise value between $500 million and $5000 million. It has a three year investment period. The firm prefers to take majority and minority stakes. Its hedge fund business manages a broad range of commingled and customized fund solutions and its credit business focuses on loans, and securities of non-investment grade companies spread across the capital structure including senior debt, subordinated debt, preferred stock and common equity. Blackstone Inc. was founded in 1985 and is headquartered in New York, New York with additional offices across Asia, Europe, North America and Central America.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 19:24:21"},{"Company Name":"Weyerhaeuser Company","Symbol":"WY","Current Price":"29.49","Latest MA":"30.39","Price Target":36.0,"Difference from MA":"-2.97%","Difference from Open":"-1.44%","Change from Yesterday":"1.71%","Change from Last Report":"-0.17","Latest Volume":"1,792,684","Market Cap":"21,426,903,040","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":32.76266,"PB Ratio":2.159016,"ROE":0.052989997,"DTE":51.335,"Industry":"REIT - Specialty","Sector":"Real Estate","Beta":1.428,"Trailing PEG":10.4023,"Trailing PE":40.39726,"Trailing PS":2.9800978,"Quick Ratio":1.27,"Day High":30.17,"Day Low":29.37,"VS Average Volume":0.524672439,"Company Summary":"Weyerhaeuser Company, one of the world's largest private owners of timberlands, began operations in 1900. We own or control approximately 11 million acres of timberlands in the U.S. and manage additional timberlands under long-term licenses in Canada. We manage these timberlands on a sustainable basis in compliance with internationally recognized forestry standards. We are also one of the largest manufacturers of wood products in North America. Our company is a real estate investment trust. In 2022, we generated $10.2 billion in net sales and employed approximately 9,200 people who serve customers worldwide. Our common stock trades on the New York Stock Exchange under the symbol WY.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-01-2025 19:24:21"},{"Company Name":"Danaher Corporation","Symbol":"DHR","Current Price":"236.96","Latest MA":"253.66","Price Target":284.4269,"Difference from MA":"-6.58%","Difference from Open":"-0.85%","Change from Yesterday":"-0.32%","Change from Last Report":"-0.17","Latest Volume":"2,123,738","Market Cap":"171,146,674,176","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":28.560152,"PB Ratio":3.335891,"ROE":0.07586,"DTE":36.69,"Industry":"Diagnostics & Research","Sector":"Healthcare","Beta":0.881,"Trailing PEG":3.173,"Trailing PE":44.70849,"Trailing PS":7.2086043,"Quick Ratio":0.916,"Day High":241.69,"Day Low":232.96,"VS Average Volume":0.6788857739,"Company Summary":"Danaher Corporation designs, manufactures, and markets professional, medical, industrial, and commercial products and services worldwide. The Biotechnology segments offers bioprocess technologies, consumables, and services that advance, accelerate, and integrate the development and manufacture of therapeutics; cell line and cell culture media development services; cell culture media, process liquids and buffers for manufacturing, chromatography resins, filtration technologies, aseptic fill finish; single-use hardware and consumables and services, such as the design and installation of full manufacturing suites; lab filtration, separation, and purification; lab-scale protein purification and analytical tools; reagents, membranes, and services; and healthcare filtration solutions. The Life Sciences segment provides mass spectrometers; flow cytometry, genomics, lab automation, centrifugation, liquid handling automation instruments, antibodies and reagents, and particle counting and characterization; microscopes; protein consumables; industrial filtration products; and genomic medicines, such as custom nucleic acid products, plasmid DNA, RNA, and proteins under the ABCAM, ALDEVRON, BECKMAN COULTER, IDT, LEICA MICROSYSTEMS, MOLECULAR DEVICES, PALL, PHENOMENEX and SCIEX brands. The Diagnostics segment offers chemistry, immunoassay, microbiology, and automation systems; and molecular, acute care, and pathology diagnostics products. This segment also provides clinical instruments, reagents, consumables, software, and services for hospitals, physicians' offices, reference laboratories, and other critical care settings. The company has a research  collaboration  with Stanford  University's Department  of  Bioengineering for cancer drug development. The company was formerly known as Diversified Mortgage Investors, Inc. and changed its name to Danaher Corporation in 1984. Danaher Corporation was founded in 1969 and is based in Washington, the District of Columbia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-01-2025 19:24:21"},{"Company Name":"Tesla, Inc.","Symbol":"TSLA","Current Price":"419.58","Latest MA":"274.65","Price Target":304.52762,"Difference from MA":"52.77%","Difference from Open":"2.37%","Change from Yesterday":"5.78%","Change from Last Report":"0.13","Latest Volume":"41,383,055","Market Cap":"1,346,876,997,632","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":128.69644,"PB Ratio":19.241493,"ROE":0.20389,"DTE":18.078,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":2.295,"Trailing PEG":4.8079,"Trailing PE":114.953415,"Trailing PS":13.863891,"Quick Ratio":1.214,"Day High":419.91,"Day Low":405.661,"VS Average Volume":0.4471829527,"Company Summary":"Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners; and provision of service and repairs to its energy product customers, including under warranty, as well as various financing options to its solar customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was incorporated in 2003 and is headquartered in Austin, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"15-01-2025 19:24:21"},{"Company Name":"QUALCOMM Incorporated","Symbol":"QCOM","Current Price":"164.06","Latest MA":"171.78","Price Target":204.05872,"Difference from MA":"-4.49%","Difference from Open":"1.21%","Change from Yesterday":"2.81%","Change from Last Report":"-0.16","Latest Volume":"2,890,498","Market Cap":"182,270,672,896","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":13.431566,"PB Ratio":6.949928,"ROE":0.42253,"DTE":58.765,"Industry":"Semiconductors","Sector":"Technology","Beta":1.286,"Trailing PEG":1.5757,"Trailing PE":18.37178,"Trailing PS":4.6781654,"Quick Ratio":1.64,"Day High":164.75,"Day Low":162.09,"VS Average Volume":0.3591970731,"Company Summary":"QUALCOMM Incorporated engages in the development and commercialization of foundational technologies for the wireless industry worldwide. It operates through three segments: Qualcomm CDMA Technologies (QCT); Qualcomm Technology Licensing (QTL); and Qualcomm Strategic Initiatives (QSI). The QCT segment develops and supplies integrated circuits and system software with advanced connectivity and high-performance, and low-power computing technologies for use in mobile devices; automotive systems for connectivity, digital cockpit, and ADAS\/AD; and IoT, including consumer electronic devices, industrial devices, and edge networking products. The QTL segment grants licenses or provides rights to use portions of its intellectual property portfolio, which include various patent rights useful in the manufacture and sale of wireless products comprising products implementing CDMA2000, WCDMA, LTE and\/or OFDMA-based 5G products. The QSI segment invests in early-stage companies in various industries, including 5G, artificial intelligence, automotive, consumer, enterprise, cloud, IoT, and extended reality, and investments, including non-marketable equity securities and, to a lesser extent, marketable equity securities, and convertible debt instruments. It also provides development, and other services and sells related products to the United States government agencies and their contractors. The company was incorporated in 1985 and is headquartered in San Diego, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-01-2025 19:24:21"},{"Company Name":"Microsoft Corporation","Symbol":"MSFT","Current Price":"425.08","Latest MA":"427.19","Price Target":508.4636,"Difference from MA":"-0.49%","Difference from Open":"1.42%","Change from Yesterday":"2.34%","Change from Last Report":"-0.08","Latest Volume":"6,979,593","Market Cap":"3,160,418,811,904","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":28.314768,"PB Ratio":10.985966,"ROE":0.35604,"DTE":33.657,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.904,"Trailing PEG":2.182,"Trailing PE":35.130577,"Trailing PS":12.433293,"Quick Ratio":1.163,"Day High":427.42,"Day Low":418.265,"VS Average Volume":0.333191313,"Company Summary":"Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services. This segment also provides LinkedIn; and dynamics business solutions, including Dynamics 365, a set of intelligent, cloud-based applications across ERP, CRM, power apps, and power automate; and on-premises ERP and CRM applications. The Intelligent Cloud segment offers server products and cloud services, such as azure and other cloud services; SQL and windows server, visual studio, system center, and related client access licenses, as well as nuance and GitHub; and enterprise services including enterprise support services, industry solutions, and nuance professional services. The More Personal Computing segment offers Windows, including windows OEM licensing and other non-volume licensing of the Windows operating system; Windows commercial comprising volume licensing of the Windows operating system, windows cloud services, and other Windows commercial offerings; patent licensing; and windows Internet of Things; and devices, such as surface, HoloLens, and PC accessories. Additionally, this segment provides gaming, which includes Xbox hardware and content, and first- and third-party content; Xbox game pass and other subscriptions, cloud gaming, advertising, third-party disc royalties, and other cloud services; and search and news advertising, which includes Bing, Microsoft News and Edge, and third-party affiliates. The company sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online, and retail stores. The company was founded in 1975 and is headquartered in Redmond, Washington.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"15-01-2025 19:24:21"},{"Company Name":"Howmet Aerospace Inc.","Symbol":"HWM","Current Price":"121.37","Latest MA":"98.99","Price Target":124.86909,"Difference from MA":"22.60%","Difference from Open":"-1.17%","Change from Yesterday":"1.86%","Change from Last Report":"0.19","Latest Volume":"1,806,695","Market Cap":"49,307,897,856","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":37.91355,"PB Ratio":11.109383,"ROE":0.25719,"DTE":78.925,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.293,"Trailing PEG":null,"Trailing PE":46.68077,"Trailing PS":6.782379,"Quick Ratio":0.824,"Day High":124.15,"Day Low":120.49,"VS Average Volume":0.7753310411,"Company Summary":"Howmet Aerospace Inc. provides advanced engineered solutions for the aerospace and transportation industries in the United States, Japan, France, Germany, the United Kingdom, Mexico, Italy, Canada, Poland, China, and internationally. It operates through four segments: Engine Products, Fastening Systems, Engineered Structures, and Forged Wheels. The Engine Products segment offers airfoils and seamless rolled rings primarily for aircraft engines and industrial gas turbines; and rotating and structural parts. The Fastening Systems segment produces aerospace fastening systems, as well as commercial transportation, industrial, and other fasteners; and latches, bearings, fluid fittings, and installation tools. The Engineered Structures segment provides titanium ingots and mill products, aluminum and nickel forgings, and machined components and assemblies for aerospace and defense applications; and titanium forgings, extrusions, and forming and machining services for airframe, wing, aero-engine, and landing gear components. The Forged Wheels segment offers forged aluminum wheels and related products for heavy-duty trucks and commercial transportation markets. The company was formerly known as Arconic Inc. Howmet Aerospace Inc. was founded in 1888 and is based in Pittsburgh, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 19:24:21"},{"Company Name":"Flagstar Financial, Inc.","Symbol":"FLG","Current Price":"9.28","Latest MA":"10.55","Price Target":12.11667,"Difference from MA":"-12.03%","Difference from Open":"-3.25%","Change from Yesterday":"0.22%","Change from Last Report":"-0.13","Latest Volume":"2,649,139","Market Cap":"3,851,561,728","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":-24.580883,"PB Ratio":0.47754902,"ROE":-0.37158,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.0,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":2.699062,"Quick Ratio":"N\/A","Day High":9.72,"Day Low":9.2145,"VS Average Volume":0.4204540062,"Company Summary":"Flagstar Financial, Inc. operates as the bank holding company for Flagstar Bank, N.A. that provides banking products and services in the United States. The company's deposit products include interest-bearing checking and money market, savings, non-interest-bearing, and retirement accounts, as well as certificates of deposit. Its loan products comprise multi-family loans; commercial real estate loans; acquisition, development, and construction loans; commercial and industrial loans; one-to-four family loans; specialty finance loans and leases; warehouse loans; and other loans, such as home equity lines of credit, boat and recreational vehicle indirect lending, point of sale consumer loans, and other consumer loans, including overdraft loans. The company offers cash management products; non-deposit investment and insurance products; and online banking, mobile banking, and bank-by-phone services. It primarily serves individuals, small and mid-size businesses, and professional associations. The company was formerly known as New York Community Bancorp, Inc. and changed its name to Flagstar Financial, Inc. in October 2024. Flagstar Financial, Inc. was founded in 1859 and is headquartered in Hicksville, New York.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"15-01-2025 19:24:21"},{"Company Name":"Flex Ltd.","Symbol":"FLEX","Current Price":"41.36","Latest MA":"34.01","Price Target":42.8875,"Difference from MA":"21.60%","Difference from Open":"0.46%","Change from Yesterday":"3.14%","Change from Last Report":"0.07","Latest Volume":"1,457,452","Market Cap":"16,038,705,152","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":14.864277,"PB Ratio":3.2221875,"ROE":0.15442,"DTE":83.65,"Industry":"Electronic Components","Sector":"Technology","Beta":1.076,"Trailing PEG":null,"Trailing PE":19.884617,"Trailing PS":0.63022923,"Quick Ratio":0.72,"Day High":41.41,"Day Low":40.7,"VS Average Volume":0.3420476409,"Company Summary":"Flex Ltd. provides manufacturing solutions to various brands in Asia, the Americas, and Europe. It operates through two segments, Flex Agility Solutions (FAS) and Flex Reliability Solutions (FRS). The FAS segment offers flexible supply and manufacturing system comprising communications, enterprise, and cloud solution, which includes data, edge, and communications infrastructure; lifestyle solution, including appliances, consumer packaging, floorcare, micro mobility, and audio; and consumer devices, such as mobile and high velocity consumer devices. Its FRS segment provides complex ramps with specialized production models and critical environments, which comprise automotive including next generation mobility, autonomous, connectivity, electrification, and smart technologies; health solutions, such as medical devices, medical equipment, and drug delivery; and industrial solutions, including capital equipment, industrial devices, embedded and critical power offerings, and renewables and grid edge. In addition, it provides various services, including design and engineering, such as product design and engineering resources that provide design services, product development, systems integration services, and solutions; supply chain comprising manufacturing, customization, procurement, logistics services, and innovative supply chain solutions; manufacturing; logistics and value-added fulfillment, including warehousing and vendor managed inventory, omni-channel fulfillment, kitting, configuration, and postponement; and integrated reverse logistics and circular economy. Further, the company offers embedded and critical power solutions. The company was formerly known as Flextronics International Ltd. and changed its name to Flex Ltd. in September 2016. Flex Ltd. was founded in 1969 and is headquartered in Austin, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 19:24:21"},{"Company Name":"V.F. Corporation","Symbol":"VFC","Current Price":"23.20","Latest MA":"18.27","Price Target":22.155,"Difference from MA":"27.01%","Difference from Open":"-2.13%","Change from Yesterday":"0.13%","Change from Last Report":"-0.56","Latest Volume":"1,767,395","Market Cap":"9,034,147,840","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":24.520527,"PB Ratio":6.422641,"ROE":-0.22331,"DTE":524.646,"Industry":"Apparel Manufacturing","Sector":"Consumer Cyclical","Beta":1.545,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.89504707,"Quick Ratio":0.465,"Day High":23.85,"Day Low":23.18,"VS Average Volume":0.2749821115,"Company Summary":"V.F. Corporation, together with its subsidiaries, engages in the design, procurement, marketing, and distribution of branded lifestyle apparel, footwear, and accessories for men, women, and children in the Americas, Europe, and the Asia-Pacific. It operates through three segments: Outdoor, Active, and Work. The company offers High performance outdoor apparel, footwear, equipment, accessories; outdoor, adventure-inspired lifestyle footwear, apparel, and accessories; performance merino wool and other natural fibers-based apparel and accessories; performance-based footwear; and high performance apparel and accessories based on natural fibers under the The North Face, Timberland, Smartwool, Icebreaker, and Altra brands. It also offers youth culture\/action sports-inspired and streetwear apparel, footwear, and accessories; handbags, luggage, backpacks, totes, and accessories; outdoor-inspired apparel, footwear, and accessories; and backpacks and luggage under the Vans, Supreme, Kipling, Napapijri, Eastpak, and JanSport brands. In addition, the company provides work and work-inspired lifestyle apparel and footwear; and protective work footwear under the Dickies, and Timberland PRO brands. The company sells its products primarily to specialty stores, department stores, national chains, independently-operated partnership stores, and mass merchants, as well as sells through direct-to-consumer operations, including retail stores, concession retail stores, and e-commerce sites, and other digital platforms. V.F. Corporation was founded in 1899 and is headquartered in Denver, Colorado.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"15-01-2025 19:24:21"},{"Company Name":"Alibaba Group Holding Limited","Symbol":"BABA","Current Price":"82.44","Latest MA":"86.65","Price Target":119.848625,"Difference from MA":"-4.86%","Difference from Open":"-0.23%","Change from Yesterday":"0.89%","Change from Last Report":"-0.02","Latest Volume":"3,680,903","Market Cap":"197,179,179,008","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":1.1621082,"PB Ratio":0.20336576,"ROE":0.05668,"DTE":22.796,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":0.349,"Trailing PEG":0.5408,"Trailing PE":17.175,"Trailing PS":0.20750286,"Quick Ratio":0.97,"Day High":82.79,"Day Low":82.155,"VS Average Volume":0.2580924565,"Company Summary":"Alibaba Group Holding Limited, through its subsidiaries, provides technology infrastructure and marketing reach to help merchants, brands, retailers, and other businesses to engage with their users and customers in the People's Republic of China and internationally. The company operates through seven segments: China Commerce, International Commerce, Local Consumer Services, Cainiao, Cloud, Digital Media and Entertainment, and Innovation Initiatives and Others. It operates Taobao and Tmall, which are digital retail platforms; Alimama, a proprietary monetization platform; 1688.com and Alibaba.com, which are online wholesale marketplaces; AliExpress, a retail marketplace; Lazada, Trendyol, and Daraz that are e-commerce platforms; Freshippo, a retail platform for groceries and fresh goods; and Tmall Global, an import e-commerce platform. The company also operates Cainiao Network logistic services platform; Ele.me, an on-demand delivery and local services platform; Koubei, a restaurant and local services guide platform; and Fliggy, an online travel platform. In addition, it offers pay-for-performance, in-feed, and display marketing services; and Taobao Ad Network and Exchange, a real-time online bidding marketing exchange. Further, the company provides elastic computing, storage, network, security, database, big data, and IoT services; and hardware, software license, software installation, and application development and maintenance services. Additionally, it operates Youku, an online video platform; Quark, a platform for information search, storage, and consumption; Alibaba Pictures and other content platforms that provide online videos, films, live events, news feeds, literature, music, and others; Amap, a mobile digital map, navigation, and real-time traffic information app; DingTalk, a business efficiency mobile app; and Tmall Genie smart speaker. The company was incorporated in 1999 and is based in Hangzhou, the People's Republic of China.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-01-2025 19:24:21"},{"Company Name":"Meta Platforms, Inc.","Symbol":"META","Current Price":"613.53","Latest MA":"549.84","Price Target":664.31256,"Difference from MA":"11.58%","Difference from Open":"0.50%","Change from Yesterday":"3.36%","Change from Last Report":"-0.11","Latest Volume":"6,894,535","Market Cap":"1,548,858,425,344","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":24.136625,"PB Ratio":9.41204,"ROE":0.36134,"DTE":29.811,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.215,"Trailing PEG":1.3266,"Trailing PE":28.926601,"Trailing PS":9.914154,"Quick Ratio":2.568,"Day High":618.22,"Day Low":606.5,"VS Average Volume":0.5531650758,"Company Summary":"Meta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and wearables worldwide. It operates in two segments, Family of Apps and Reality Labs. The Family of Apps segment offers Facebook, which enables people to share, discuss, discover, and connect with interests; Instagram, a community for sharing photos, videos, and private messages, as well as feed, stories, reels, video, live, and shops; Messenger, a messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls; and WhatsApp, a messaging application that is used by people and businesses to communicate and transact privately. The Reality Labs segment provides augmented and virtual reality related products comprising consumer hardware, software, and content that help people feel connected, anytime, and anywhere. The company was formerly known as Facebook, Inc. and changed its name to Meta Platforms, Inc. in October 2021. The company was incorporated in 2004 and is headquartered in Menlo Park, California","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 19:24:21"},{"Company Name":"Mondelez International, Inc.","Symbol":"MDLZ","Current Price":"56.73","Latest MA":"66.69","Price Target":75.9244,"Difference from MA":"-14.93%","Difference from Open":"-1.08%","Change from Yesterday":"-0.66%","Change from Last Report":"0.17","Latest Volume":"3,078,333","Market Cap":"75,858,788,352","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":16.933924,"PB Ratio":2.7234757,"ROE":0.13552,"DTE":73.232,"Industry":"Confectioners","Sector":"Consumer Defensive","Beta":0.561,"Trailing PEG":4.5111,"Trailing PE":20.117022,"Trailing PS":2.098387,"Quick Ratio":0.295,"Day High":57.81,"Day Low":56.565,"VS Average Volume":0.3644426076,"Company Summary":"Mondelez International, Inc., through its subsidiaries, manufactures, markets, and sells snack food and beverage products in the Latin America, North America, Asia, the Middle East, Africa, and Europe. It provides biscuits and baked snacks, including cookies, crackers, salted snacks, snack bars, and cakes and pastries; chocolates; and gums and candies, as well as various cheese and grocery, and powdered beverage products. The company's brand portfolio includes Oreo, Ritz, LU, CLIF Bar, and Tate's Bake Shop biscuits and baked snacks, as well as Cadbury Dairy Milk, Milka, and Toblerone chocolate. It serves supermarket chains, wholesalers, supercenters, club stores, mass merchandisers, distributors, convenience stores, gasoline stations, drug stores, value stores, and other retail food outlets through direct store delivery, company-owned and satellite warehouses, distribution centers, third party distributors, and other facilities, as well as through independent sales offices and agents. The company also sells products directly to businesses and consumers through e-retail platforms, retailer digital platforms, as well as through its direct-to-consumer websites and social media platforms. Mondelez International, Inc. was formerly known as Kraft Foods Inc. and changed its name to Mondelez International, Inc. in October 2012. The company was incorporated in 2000 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"15-01-2025 19:24:21"},{"Company Name":"Hess Corporation","Symbol":"HES","Current Price":"147.68","Latest MA":"139.39","Price Target":167.64285,"Difference from MA":"5.94%","Difference from Open":"0.46%","Change from Yesterday":"0.53%","Change from Last Report":"-0.26","Latest Volume":"1,031,017","Market Cap":"45,501,329,408","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":18.720455,"PB Ratio":4.191026,"ROE":0.2885,"DTE":81.969,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":1.16,"Trailing PEG":0.7959,"Trailing PE":17.211538,"Trailing PS":3.6509132,"Quick Ratio":1.089,"Day High":148.71,"Day Low":146.3,"VS Average Volume":0.6247709413,"Company Summary":"Hess Corporation, an exploration and production company, explores, develops, produces, purchases, transports, and sells crude oil, natural gas liquids (NGLs), and natural gas. The company operates in two segments, Exploration and Production, and Midstream. It conducts production operations primarily in the United States, Guyana, the Malaysia\/Thailand Joint Development Area, and Malaysia; and exploration activities principally offshore Guyana, the U.S. Gulf of Mexico, and offshore Suriname and Canada. The company is also involved in gathering, compressing, and processing natural gas; fractionating NGLs; gathering, terminaling, loading, and transporting crude oil and NGL through rail car; and storing and terminaling propane, as well as providing water handling services primarily in the Bakken Shale plays in the Williston Basin area of North Dakota. The company was incorporated in 1920 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 19:24:21"},{"Company Name":"Corning Incorporated","Symbol":"GLW","Current Price":"48.58","Latest MA":"44.09","Price Target":52.99429,"Difference from MA":"10.18%","Difference from Open":"0.83%","Change from Yesterday":"2.37%","Change from Last Report":"-0.10","Latest Volume":"1,336,639","Market Cap":"41,594,634,240","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":21.022478,"PB Ratio":3.5615835,"ROE":0.019299999,"DTE":72.739,"Industry":"Electronic Components","Sector":"Technology","Beta":1.029,"Trailing PEG":0.607,"Trailing PE":255.68422,"Trailing PS":3.298282,"Quick Ratio":0.776,"Day High":48.83,"Day Low":48.16,"VS Average Volume":0.311681513,"Company Summary":"Corning Incorporated engages in the display technologies, optical communications, environmental technologies, specialty materials, and life sciences businesses in the United States and internationally. The company's Display Technologies segment offers glass substrates for flat panel displays, including liquid crystal displays and organic light-emitting diodes that are used in televisions, notebook computers, desktop monitors, tablets, and handheld devices. Its Optical Communications segment provides optical fibers and cables; and hardware and equipment products, such as cable assemblies, fiber optic hardware and connectors, optical components and couplers, closures, network interface devices, and other accessories for the telecommunications industry, businesses, governments, and individuals. The company's Specialty Materials segment manufactures products that offer material formulations for glass, glass ceramics, crystals, precision metrology instruments, and software, as well as glass wafers and substrates, tinted sunglasses, and radiation shielding products for various markets comprising mobile consumer electronics, semiconductor equipment optics and consumables, aerospace and defense optics, radiation shielding products, sunglasses, and telecommunications components. Its Environmental Technologies segment provides ceramic substrates and filter products for emissions control in mobile, gasoline, and diesel applications. The company's Life Sciences segment offers laboratory products, including consumables, such as plastic vessels, liquid handling plastics, specialty surfaces, cell culture media, and serum, as well as general labware, and glassware and equipment under the Corning, Pyrex, Falcon, and Axygen brands. The company was formerly known as Corning Glass Works and changed its name to Corning Incorporated in April 1989. Corning Incorporated was founded in 1851 and is headquartered in Corning, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 19:24:21"},{"Company Name":"T-Mobile US, Inc.","Symbol":"TMUS","Current Price":"215.60","Latest MA":"206.12","Price Target":243.72154,"Difference from MA":"4.60%","Difference from Open":"-0.25%","Change from Yesterday":"0.71%","Change from Last Report":"0.02","Latest Volume":"1,183,619","Market Cap":"250,201,653,248","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":19.920797,"PB Ratio":3.9080627,"ROE":0.16087,"DTE":182.272,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.496,"Trailing PEG":0.8574,"Trailing PE":24.611872,"Trailing PS":3.1272862,"Quick Ratio":0.862,"Day High":217.56,"Day Low":214.1502,"VS Average Volume":0.3152690478,"Company Summary":"T-Mobile US, Inc., together with its subsidiaries, provides mobile communications services in the United States, Puerto Rico, and the United States Virgin Islands. The company offers voice, messaging, and data services to customers in the postpaid, prepaid, and wholesale and other services. It also provides wireless devices, including smartphones, wearables, tablets, home broadband routers, and other mobile communication devices, as well as wireless devices and accessories; financing through equipment installment plans; reinsurance for device insurance policies and extended warranty contracts; leasing through JUMP! On Demand; and High Speed Internet services. In addition, the company offers services, devices, and accessories under the T-Mobile and Metro by T-Mobile brands through its owned and operated retail stores, T-Mobile app and customer care channels, and its websites. It also sells its devices to dealers and other third-party distributors for resale through independent third-party retail outlets and various third-party websites. The company was founded in 1994 and is headquartered in Bellevue, Washington. T-Mobile US, Inc. operates as a subsidiary of Deutsche Telekom AG.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 19:24:21"},{"Company Name":"SiriusXM Holdings Inc.","Symbol":"SIRI","Current Price":"21.75","Latest MA":"27.51","Price Target":25.53846,"Difference from MA":"-20.96%","Difference from Open":"-0.02%","Change from Yesterday":"2.04%","Change from Last Report":"0.00","Latest Volume":"1,323,584","Market Cap":"7,375,947,264","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":6.718076,"PB Ratio":0.6788524,"ROE":-0.46799,"DTE":98.775,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.05,"Trailing PEG":0.1807,"Trailing PE":"N\/A","Trailing PS":0.83827114,"Quick Ratio":0.26,"Day High":22.09,"Day Low":21.56,"VS Average Volume":0.2254644341,"Company Summary":"Sirius XM Holdings Inc. operates as an audio entertainment company in North America. It operates in two segments, Sirius XM, and Pandora and Off-platform. The company's Sirius XM segment provides music, sports, entertainment, comedy, talk, news, traffic and weather channels, and other content, as well as podcast and infotainment services on subscription fee basis; and live, curated, and exclusive and on demand programming services through satellite radio systems and streamed through applications for mobile and home devices, and other consumer electronic equipment. This segment also distributes satellite radios through automakers and retailers, as well as its website; podcasts, including true crime, news, politics, music, comedy, sports, and entertainment; and offers location-based services through two-way wireless connectivity, including safety, security, convenience, maintenance and data, remote vehicles diagnostic, and stolen or parked vehicle locator services. In addition, this segment provides music channels on the DISH Network satellite television service as a programming package; Travel Link, a suite of data services that include graphical weather, fuel prices, sports schedule and scores, and movie listings; graphic information related to road closings, traffic flow, and incident data for consumers with in-vehicle navigation systems; real-time weather services in vehicles, boats, and planes; and music programming and commercial-free music services for office, restaurants, and other business. Its Pandora and Off-platform segment operates music, comedy, and podcast streaming platform, which offers personalized experience for listener through computers, tablets, mobile devices, vehicle speakers, and connected devices; and provides advertising services. The company was incorporated in 2013 and is headquartered in New York.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"15-01-2025 19:24:21"},{"Company Name":"General Motors Company","Symbol":"GM","Current Price":"52.05","Latest MA":"49.16","Price Target":59.20692,"Difference from MA":"5.88%","Difference from Open":"-0.29%","Change from Yesterday":"2.24%","Change from Last Report":"-0.10","Latest Volume":"3,227,562","Market Cap":"57,234,178,048","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":4.91623,"PB Ratio":0.8071519,"ROE":0.14167,"DTE":174.581,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":1.414,"Trailing PEG":7.9309,"Trailing PE":5.5549626,"Trailing PS":0.31323606,"Quick Ratio":0.948,"Day High":52.945,"Day Low":51.7432,"VS Average Volume":0.2773647393,"Company Summary":"General Motors Company designs, builds, and sells trucks, crossovers, cars, and automobile parts; and provide software-enabled services and subscriptions worldwide. The company operates through GM North America, GM International, Cruise, and GM Financial segments. It markets its vehicles primarily under the Buick, Cadillac, Chevrolet, GMC, Baojun, and Wuling brand names. In addition, the company sells trucks, crossovers, cars, and automobile parts through retail dealers, and distributors and dealers, as well as to fleet customers, including daily rental car companies, commercial fleet customers, leasing companies, and governments. Further, it offers range of after-sale services through dealer network, such as maintenance, light repairs, collision repairs, vehicle accessories, and extended service warranties. Additionally, the company provides automotive financing; and software-enabled services and subscriptions. General Motors Company was founded in 1908 and is headquartered in Detroit, Michigan.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 19:24:21"},{"Company Name":"Nextracker Inc.","Symbol":"NXT","Current Price":"42.86","Latest MA":"40.64","Price Target":52.24862,"Difference from MA":"5.47%","Difference from Open":"-2.59%","Change from Yesterday":"1.17%","Change from Last Report":"-0.70","Latest Volume":"1,205,764","Market Cap":"6,320,006,656","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":12.766933,"PB Ratio":4.862167,"ROE":0.60612,"DTE":11.396,"Industry":"Solar","Sector":"Technology","Beta":"N\/A","Trailing PEG":2.5078,"Trailing PE":10.715,"Trailing PS":2.2551856,"Quick Ratio":1.794,"Day High":44.57,"Day Low":42.82,"VS Average Volume":0.456638498,"Company Summary":"Nextracker Inc., an energy solutions company, provides solar tracker and software solutions for utility-scale and distributed generation solar projects in the United States and internationally. The company offers tracking solutions, which includes NX Horizon, a solar tracking solution; and NX Horizon-XTR, a terrain-following tracker designed to expand the addressable market for trackers on sites with sloped, uneven, and challenging terrain. It also provides TrueCapture, a self-adjusting tracker control system, which boosts solar power plant production by optimizing the position of individual tracker row in response to site features, such as varying topography and changing weather conditions; and NX Navigator, that assists solar power plant owners and operators in monitoring, controlling, and protecting their solar projects. The company was founded in 2013 and is headquartered in Fremont, California. As of March 31, 2024 Nextracker Inc. was formerly a subsidiary of Flex Ltd.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"15-01-2025 19:24:21"},{"Company Name":"Invesco Ltd","Symbol":"IVZ","Current Price":"16.82","Latest MA":"16.72","Price Target":18.75,"Difference from MA":"0.58%","Difference from Open":"-1.87%","Change from Yesterday":"1.42%","Change from Last Report":"-0.18","Latest Volume":"1,333,103","Market Cap":"7,559,580,672","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":8.922556,"PB Ratio":0.70361847,"ROE":-0.00944,"DTE":5.597,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.424,"Trailing PEG":1.4021,"Trailing PE":"N\/A","Trailing PS":1.284027,"Quick Ratio":0.75,"Day High":17.2,"Day Low":16.82,"VS Average Volume":0.3979291968,"Company Summary":"Invesco Ltd. is a publicly owned investment manager. The firm provides its services to retail clients, institutional clients, high-net worth clients, public entities, corporations, unions, non-profit organizations, endowments, foundations, pension funds, financial institutions, and sovereign wealth funds. It manages separate client-focused equity and fixed income portfolios. The firm also launches equity, fixed income, commodity, multi-asset, and balanced mutual funds for its clients. It launches equity, fixed income, multi-asset, and balanced exchange-traded funds. The firm also launches and manages private funds. It invests in the public equity and fixed income markets across the globe. The firm also invests in alternative markets, such as commodities and currencies. For the equity portion of its portfolio, it invests in growth and value stocks of large-cap, mid-cap, and small-cap companies. For the fixed income portion of its portfolio, the firm invests in convertibles, government bonds, municipal bonds, treasury securities, and cash. It also invests in short term and intermediate term bonds, investment grade and high yield bonds, taxable and tax-free bonds, senior secured loans, and structured securities such as asset-backed securities, mortgage-backed securities, and commercial mortgage-backed securities. The firm employs absolute return, global macro, and long\/short strategies. It employs quantitative analysis to make its investments. The firm was formerly known as Invesco Plc, AMVESCAP plc, Amvesco plc, Invesco PLC, Invesco MIM, and H. Lotery & Co. Ltd. Invesco Ltd. was founded in 1935 and is based in Atlanta, Georgia with an additional office in Hamilton, Bermuda.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"15-01-2025 19:24:21"}]