[{"Company Name":"Nike, Inc.","Symbol":"NKE","Current Price":"74.84","Latest MA":"80.87","Price Target":86.47971,"Difference from MA":"-7.46%","Difference from Open":"-1.01%","Change from Yesterday":"-2.04%","Change from Last Report":"0.06","Latest Volume":"2,816,740","Market Cap":"111,396,356,096","Earning Date":"2024-12-19","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":28.602985,"ROE":0.3798,"DTE":86.962,"Industry":"Footwear & Accessories","Sector":"Consumer Cyclical","Beta":1.035,"Trailing PEG":3.9808,"Trailing PE":23.098146,"Trailing PS":2.2273924,"Quick Ratio":1.417,"Day High":75.77,"Day Low":74.55,"VS Average Volume":0.2379812595,"Company Summary":"NIKE, Inc., together with its subsidiaries, engages in the design, development, marketing, and sale of athletic footwear, apparel, equipment, accessories, and services worldwide. The company provides athletic and casual footwear, apparel, and accessories under the NIKE, Jumpman, Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks. It also sells a line of performance equipment and accessories comprising bags, sport balls, socks, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities under the NIKE brand; and various plastic products to other manufacturers. In addition, the company markets apparel with licensed college and professional team, and league logos, as well as sells sports apparel; licenses unaffiliated parties to manufacture and sell apparel, digital devices, and applications and other equipment for sports activities under NIKE-owned trademarks; and operates digital platforms, including fitness and activity apps; sport, fitness, and wellness content; and digital services and features in retail stores. It sells its products to footwear stores; sporting goods stores; athletic specialty stores; department stores; skate, tennis, and golf shops; and other retail accounts through NIKE-owned retail stores, digital platforms, independent distributors, licensees, and sales representatives. The company was founded in 1964 and is headquartered in Beaverton, Oregon.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-12-2024 18:20:19"},{"Company Name":"Carnival Corporation","Symbol":"CCL","Current Price":"24.97","Latest MA":"19.57","Price Target":29.23682,"Difference from MA":"27.57%","Difference from Open":"1.75%","Change from Yesterday":"-0.41%","Change from Last Report":"0.04","Latest Volume":"5,858,919","Market Cap":"32,660,758,528","Earning Date":"2024-12-20","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":12.807426,"ROE":0.20120001,"DTE":352.355,"Industry":"Travel Services","Sector":"Consumer Cyclical","Beta":2.668,"Trailing PEG":null,"Trailing PE":17.340277,"Trailing PS":1.3342358,"Quick Ratio":0.202,"Day High":25.04,"Day Low":24.32,"VS Average Volume":0.2423322838,"Company Summary":"Carnival Corporation & plc engages in the provision of leisure travel services in North America, Australia, Europe, Asia, and internationally. The company operates through four segments: NAA Cruise Operations, Europe Cruise Operations, Cruise Support, and Tour and Other. It operates port destinations, private islands, and a solar park, as well as owns and operates hotels, lodges, glass-domed railcars, and motor coaches. The company offers its services under the Carnival Cruise Line, Princess Cruises, Holland America Line, Seabourn, Costa Cruises, AIDA Cruises, P&O Cruises, and Cunard brand. Additionally, it sells its cruises primarily through travel agents, tour operators, vacation planners, and websites. Carnival Corporation & plc was founded in 1972 and is headquartered in Miami, Florida.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-12-2024 18:20:19"},{"Company Name":"Micron Technology, Inc.","Symbol":"MU","Current Price":"85.93","Latest MA":"108.34","Price Target":131.7403,"Difference from MA":"-20.69%","Difference from Open":"-1.14%","Change from Yesterday":"-3.05%","Change from Last Report":"0.36","Latest Volume":"9,935,364","Market Cap":"95,740,624,896","Earning Date":"2024-12-18","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":9.026839,"ROE":0.01743,"DTE":31.194,"Industry":"Semiconductors","Sector":"Technology","Beta":1.179,"Trailing PEG":0.2252,"Trailing PE":24.621777,"Trailing PS":3.8126967,"Quick Ratio":1.592,"Day High":87.05,"Day Low":84.58,"VS Average Volume":0.4737145498,"Company Summary":"Micron Technology, Inc. designs, develops, manufactures, and sells memory and storage products in the United States, Taiwan, Mainland China, rest of the Asia Pacific, Hong Kong, Japan, Europe, and internationally. The company operates through four segments: Compute and Networking Business Unit, Mobile Business Unit, Embedded Business Unit, and Storage Business Unit. It provides memory and storage technologies comprising dynamic random access memory semiconductor devices with low latency that provide high-speed data retrieval; non-volatile and re-writeable semiconductor storage devices; and non-volatile re-writable semiconductor memory devices that provide fast read speeds under the Micron and Crucial brands, as well as through private labels. The company offers serves the data center, PC, graphics, networking, automotive, industrial, and consumer embedded markets, as well as for smartphone and other mobile-device markets. It markets its products through its direct sales force, independent sales representatives, distributors, and retailers; and web-based customer direct sales channel, as well as through channel and distribution partners. Micron Technology, Inc. was founded in 1978 and is headquartered in Boise, Idaho.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-12-2024 18:20:19"},{"Company Name":"QUALCOMM Incorporated","Symbol":"QCOM","Current Price":"154.71","Latest MA":"176.21","Price Target":204.70387,"Difference from MA":"-12.20%","Difference from Open":"-0.33%","Change from Yesterday":"-1.57%","Change from Last Report":"0.19","Latest Volume":"1,175,254","Market Cap":"171,882,823,680","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":14.866171,"ROE":0.42253,"DTE":58.765,"Industry":"Semiconductors","Sector":"Technology","Beta":1.286,"Trailing PEG":1.553,"Trailing PE":17.286036,"Trailing PS":4.4115505,"Quick Ratio":1.64,"Day High":155.61,"Day Low":153.815,"VS Average Volume":0.145218584,"Company Summary":"QUALCOMM Incorporated engages in the development and commercialization of foundational technologies for the wireless industry worldwide. It operates through three segments: Qualcomm CDMA Technologies (QCT); Qualcomm Technology Licensing (QTL); and Qualcomm Strategic Initiatives (QSI). The QCT segment develops and supplies integrated circuits and system software with advanced connectivity and high-performance, and low-power computing technologies for use in mobile devices; automotive systems for connectivity, digital cockpit, and ADAS\/AD; and IoT, including consumer electronic devices, industrial devices, and edge networking products. The QTL segment grants licenses or provides rights to use portions of its intellectual property portfolio, which include various patent rights useful in the manufacture and sale of wireless products comprising products implementing CDMA2000, WCDMA, LTE and\/or OFDMA-based 5G products. The QSI segment invests in early-stage companies in various industries, including 5G, artificial intelligence, automotive, consumer, enterprise, cloud, IoT, and extended reality, and investments, including non-marketable equity securities and, to a lesser extent, marketable equity securities, and convertible debt instruments. It also provides development, and other services and sells related products to the United States government agencies and their contractors. The company was incorporated in 1985 and is headquartered in San Diego, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-12-2024 18:20:19"},{"Company Name":"Flagstar Financial, Inc.","Symbol":"FLG","Current Price":"9.09","Latest MA":"10.58","Price Target":12.18333,"Difference from MA":"-14.14%","Difference from Open":"0.94%","Change from Yesterday":"0.66%","Change from Last Report":"1.06","Latest Volume":"2,413,638","Market Cap":"3,771,319,808","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":-24.290144,"ROE":-0.37158,"DTE":"N\/A","Industry":"Banks—Regional","Sector":"Financial Services","Beta":1.0,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":2.6428308,"Quick Ratio":"N\/A","Day High":9.09,"Day Low":8.82,"VS Average Volume":0.3957279888,"Company Summary":"Flagstar Financial, Inc. operates as the bank holding company for Flagstar Bank, N.A. that provides banking products and services in the United States. The company's deposit products include interest-bearing checking and money market, savings, non-interest-bearing, and retirement accounts, as well as certificates of deposit. Its loan products comprise multi-family loans; commercial real estate loans; acquisition, development, and construction loans; commercial and industrial loans; one-to-four family loans; specialty finance loans and leases; warehouse loans; and other loans, such as home equity lines of credit, boat and recreational vehicle indirect lending, point of sale consumer loans, and other consumer loans, including overdraft loans. The company offers cash management products; non-deposit investment and insurance products; and online banking, mobile banking, and bank-by-phone services. It primarily serves individuals, small and mid-size businesses, and professional associations. The company was formerly known as New York Community Bancorp, Inc. and changed its name to Flagstar Financial, Inc. in October 2024. Flagstar Financial, Inc. was founded in 1859 and is headquartered in Hicksville, New York.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"30-12-2024 18:20:19"},{"Company Name":"Boeing Company (The)","Symbol":"BA","Current Price":"176.66","Latest MA":"166.68","Price Target":182.83833,"Difference from MA":"5.98%","Difference from Open":"1.69%","Change from Yesterday":"-2.25%","Change from Last Report":"1.00","Latest Volume":"9,730,270","Market Cap":"132,169,031,680","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":72.31039,"ROE":"N\/A","DTE":"N\/A","Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.572,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":1.8032969,"Quick Ratio":0.238,"Day High":176.69,"Day Low":170.17,"VS Average Volume":0.7364194177,"Company Summary":"The Boeing Company, together with its subsidiaries, designs, develops, manufactures, sells, services, and supports commercial jetliners, military aircraft, satellites, missile defense, human space flight and launch systems, and services worldwide. The company operates through Commercial Airplanes; Defense, Space & Security; and Global Services segments. The Commercial Airplanes segment develops, produces, and markets commercial jet aircraft for passenger and cargo requirements, as well as provides fleet support services. The Defense, Space & Security segment engages in the research, development, production, and modification of manned and unmanned military aircraft and weapons systems; strategic defense and intelligence systems, which include strategic missile and defense systems, command, control, communications, computers, intelligence, surveillance and reconnaissance, cyber and information solutions, and intelligence systems; and satellite systems, such as government and commercial satellites, and space exploration. The Global Services segment offers products and services, including supply chain and logistics management, engineering, maintenance and modifications, upgrades and conversions, spare parts, pilot and maintenance training systems and services, technical and maintenance documents, and data analytics and digital services to commercial and defense customers. The Boeing Company was incorporated in 1916 and is based in Arlington, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-12-2024 18:20:19"}]