[{"Company Name":"Broadcom Inc.","Symbol":"AVGO","Current Price":"236.16","Latest MA":"166.38","Price Target":"243.78","Difference from MA":"41.94%","Difference from Open":"-1.68%","Change from Yesterday":"1.75%","Change from Last Report":"0.05","Latest Volume":"7,477,006","Market Cap":"1,108,138,786,816","Earning Date":"2024-12-12","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":31.067295,"ROE":0.12509,"DTE":166.032,"Industry":"Semiconductors","Sector":"Technology","Beta":1.187,"Trailing PEG":0.6586,"Trailing PE":181.85385,"Trailing PS":23.670593,"Quick Ratio":0.841,"Day High":240.228,"Day Low":234.8,"VS Average Volume":0.2760709519,"Company Summary":"Broadcom Inc. designs, develops, and supplies various semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products worldwide. The company operates in two segments, Semiconductor Solutions and Infrastructure Software. It provides set-top box system-on-chips (SoCs); cable, digital subscriber line, and passive optical networking central office\/consumer premise equipment SoCs; wireless local area network access point SoCs; Ethernet switching and routing custom silicon solutions; serializer\/deserializer application specific integrated circuits; optical and copper, and physical layer devices; and fiber optic components and RF semiconductor devices. The company also offers RF front end modules and filter; Wi-Fi, Bluetooth, and global positioning system\/global navigation satellite system SoCs; custom touch controllers; inductive charging; attached small computer system interface, and redundant array of independent disks controllers and adapters; peripheral component interconnect express; fiber channel host bus adapters; read channel based SoCs; custom flash controllers; preamplifiers; optocouplers, industrial fiber optics, and motion control encoders and subsystems; light emitting diode, ethernet PHYs, switch ICs, and camera microcontrollers. Its products are used in various applications, including enterprise and data center networking, home connectivity, set-top boxes, broadband access, telecommunication equipment, smartphones and base stations, data center servers and storage systems, factory automation, power generation and alternative energy systems, and electronic displays. Broadcom Inc. was founded in 1961 and is headquartered in Palo Alto, California.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"24-12-2024 16:58:25"},{"Company Name":"Walgreens Boots Alliance, Inc.","Symbol":"WBA","Current Price":"9.21","Latest MA":"10.66","Price Target":"9.94","Difference from MA":"-13.56%","Difference from Open":"-0.49%","Change from Yesterday":"-0.91%","Change from Last Report":"-0.11","Latest Volume":"1,304,914","Market Cap":"7,957,042,176","Earning Date":"2025-01-02","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":5.7466965,"ROE":-0.75969005,"DTE":277.898,"Industry":"Pharmaceutical Retailers","Sector":"Healthcare","Beta":0.669,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.053888325,"Quick Ratio":0.332,"Day High":9.29,"Day Low":9.16,"VS Average Volume":0.0542873595,"Company Summary":"Walgreens Boots Alliance, Inc. operates as a healthcare, pharmacy, and retail company in the United States, Germany, the United Kingdom, and internationally. It operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The U.S. Retail Pharmacy segment engages in operation of the retail drugstores, health and wellness services, specialty, and home delivery pharmacy services, which offers health and wellness, beauty, personal care and consumables, and general merchandise. The International segment offers sale of prescription drugs and health and wellness, beauty, personal care, and other consumer products outside the United States; and operates pharmacy-led health and beauty retail businesses under the Boots brand stores in the United Kingdom, the Republic of Ireland, and Thailand, as well as the Benavides brand in Mexico and the Ahumada brand in Chile. The U.S. Healthcare segment provides VillageMD, a national provider of value-based care with primary, multi-specialty, and urgent care providers serving patients in traditional clinic settings, in patients' homes and online appointments; Shields, a specialty pharmacy integrator and accelerator for hospitals; and CareCentrix, a participant in the post-acute and home care management sectors. Walgreens Boots Alliance, Inc. was founded in 1909 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"24-12-2024 16:58:25"},{"Company Name":"American Airlines Group, Inc.","Symbol":"AAL","Current Price":"17.04","Latest MA":"12.22","Price Target":"18.30","Difference from MA":"39.44%","Difference from Open":"0.21%","Change from Yesterday":"-1.07%","Change from Last Report":"0.14","Latest Volume":"5,492,247","Market Cap":"11,213,940,736","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":7.5070715,"ROE":"N\/A","DTE":"N\/A","Industry":"Airlines","Sector":"Industrials","Beta":1.399,"Trailing PEG":0.21,"Trailing PE":40.630955,"Trailing PS":0.20916459,"Quick Ratio":0.422,"Day High":17.08,"Day Low":16.8,"VS Average Volume":0.1857934923,"Company Summary":"American Airlines Group Inc., through its subsidiaries, operates as a network air carrier. The company provides scheduled air transportation services for passengers and cargo through its hubs in Charlotte, Chicago, Dallas\/Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix, and Washington, D.C., as well as through partner gateways in London, Doha, Madrid, Seattle\/Tacoma, Sydney, and Tokyo. It operates a mainline fleet of 965 aircraft. The company was formerly known as AMR Corporation and changed its name to American Airlines Group Inc. in December 2013. American Airlines Group Inc. was founded in 1926 and is headquartered in Fort Worth, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"24-12-2024 16:58:25"},{"Company Name":"Micron Technology, Inc.","Symbol":"MU","Current Price":"89.00","Latest MA":"109.02","Price Target":"132.01","Difference from MA":"-18.36%","Difference from Open":"-0.65%","Change from Yesterday":"-0.79%","Change from Last Report":"0.00","Latest Volume":"3,124,937","Market Cap":"99,170,377,728","Earning Date":"2024-12-18","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":6.9349303,"ROE":0.01743,"DTE":31.194,"Industry":"Semiconductors","Sector":"Technology","Beta":1.179,"Trailing PEG":0.2279,"Trailing PE":25.50381,"Trailing PS":3.9492805,"Quick Ratio":1.592,"Day High":89.7,"Day Low":88.23,"VS Average Volume":0.1313656285,"Company Summary":"Micron Technology, Inc. designs, develops, manufactures, and sells memory and storage products in the United States, Taiwan, Mainland China, rest of the Asia Pacific, Hong Kong, Japan, Europe, and internationally. The company operates through four segments: Compute and Networking Business Unit, Mobile Business Unit, Embedded Business Unit, and Storage Business Unit. It provides memory and storage technologies comprising dynamic random access memory semiconductor devices with low latency that provide high-speed data retrieval; non-volatile and re-writeable semiconductor storage devices; and non-volatile re-writable semiconductor memory devices that provide fast read speeds under the Micron and Crucial brands, as well as through private labels. The company offers serves the data center, PC, graphics, networking, automotive, industrial, and consumer embedded markets, as well as for smartphone and other mobile-device markets. It markets its products through its direct sales force, independent sales representatives, distributors, and retailers; and web-based customer direct sales channel, as well as through channel and distribution partners. Micron Technology, Inc. was founded in 1978 and is headquartered in Boise, Idaho.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"24-12-2024 16:58:25"},{"Company Name":"Bank of America Corporation","Symbol":"BAC","Current Price":"44.04","Latest MA":"41.19","Price Target":"50.10","Difference from MA":"6.93%","Difference from Open":"0.25%","Change from Yesterday":"0.42%","Change from Last Report":"0.01","Latest Volume":"1,728,367","Market Cap":"338,105,466,880","Earning Date":"2025-01-16","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":11.948048,"ROE":0.08092,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.325,"Trailing PEG":1.9446,"Trailing PE":15.965579,"Trailing PS":3.5730717,"Quick Ratio":"N\/A","Day High":44.22,"Day Low":43.95,"VS Average Volume":0.0493958326,"Company Summary":"Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. It operates in four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, non-interest and interest-bearing checking accounts, and investment accounts and products; credit and debit cards; residential mortgages, and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research, and certain market-based services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"24-12-2024 16:58:25"},{"Company Name":"Carnival Corporation","Symbol":"CCL","Current Price":"25.61","Latest MA":"19.37","Price Target":"28.30","Difference from MA":"32.21%","Difference from Open":"-1.50%","Change from Yesterday":"-0.35%","Change from Last Report":"0.10","Latest Volume":"2,658,622","Market Cap":"33,537,118,208","Earning Date":"2024-12-20","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":12.701936,"ROE":0.20120001,"DTE":352.355,"Industry":"Travel Services","Sector":"Consumer Cyclical","Beta":2.668,"Trailing PEG":null,"Trailing PE":17.805555,"Trailing PS":1.3700362,"Quick Ratio":0.202,"Day High":26.05,"Day Low":25.49,"VS Average Volume":0.1028060292,"Company Summary":"Carnival Corporation & plc engages in the provision of leisure travel services in North America, Australia, Europe, Asia, and internationally. The company operates through four segments: NAA Cruise Operations, Europe Cruise Operations, Cruise Support, and Tour and Other. It operates port destinations, private islands, and a solar park, as well as owns and operates hotels, lodges, glass-domed railcars, and motor coaches. The company offers its services under the Carnival Cruise Line, Princess Cruises, Holland America Line, Seabourn, Costa Cruises, AIDA Cruises, P&O Cruises, and Cunard brand. Additionally, it sells its cruises primarily through travel agents, tour operators, vacation planners, and websites. Carnival Corporation & plc was founded in 1972 and is headquartered in Miami, Florida.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"24-12-2024 16:58:25"},{"Company Name":"Citigroup, Inc.","Symbol":"C","Current Price":"70.35","Latest MA":"63.29","Price Target":"82.14","Difference from MA":"11.15%","Difference from Open":"0.36%","Change from Yesterday":"0.86%","Change from Last Report":"-0.06","Latest Volume":"1,036,118","Market Cap":"133,087,977,472","Earning Date":"2025-01-15","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":9.668865,"ROE":0.03874,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.426,"Trailing PEG":0.7697,"Trailing PE":20.048433,"Trailing PS":1.9202398,"Quick Ratio":"N\/A","Day High":70.4399,"Day Low":69.935,"VS Average Volume":0.0757764778,"Company Summary":"Citigroup Inc., a diversified financial service holding company, provides various financial product and services to consumers, corporations, governments, and institutions worldwide. It operates through five segments: Services, Markets, Banking, U.S. Personal Banking, and Wealth. The Services segment includes Treasury and Trade Solutions, which provides cash management, trade, and working capital solutions to multinational corporations, financial institutions, and public sector organizations; and Securities Services, such as cross-border support for clients, local market expertise, post-trade technologies, data solutions, and various securities services solutions. The Markets segment offers sales and trading services for equities, foreign exchange, rates, spread products, and commodities to corporate, institutional, and public sector clients; and market-making services, including asset classes, risk management solutions, financing, prime brokerage, research, securities clearing, and settlement. The banking segment includes investment banking; advisory services related to mergers and acquisitions, divestitures, restructurings, and corporate defense activities; and corporate lending, which includes corporate and commercial banking. The U.S. Personal Banking segment provides co-branded cards and retail banking services. The Wealth segment provides financial services to high-net-worth clients through banking, lending, mortgages, investment, custody, and trust product offerings; and to professional industries, including law firms, consulting groups, accounting, and asset management. The company was founded in 1812 and is headquartered in New York, New York.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"24-12-2024 16:58:25"},{"Company Name":"AT&T Inc.","Symbol":"T","Current Price":"22.86","Latest MA":"20.39","Price Target":"25.48","Difference from MA":"12.09%","Difference from Open":"0.07%","Change from Yesterday":"0.05%","Change from Last Report":"-0.03","Latest Volume":"1,266,189","Market Cap":"163,958,964,224","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":10.424926,"ROE":0.08759,"DTE":125.151,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.73,"Trailing PEG":1.758,"Trailing PE":18.577642,"Trailing PS":1.3432653,"Quick Ratio":0.42,"Day High":22.89,"Day Low":22.76,"VS Average Volume":0.0369153949,"Company Summary":"AT&T Inc. provides telecommunications and technology services worldwide. The company operates through two segments, Communications and Latin America. The Communications segment offers wireless voice and data communications services; and sells handsets, wireless data cards, wireless computing devices, carrying cases\/protective covers, and wireless chargers through its own company-owned stores, agents, and third-party retail stores. It also provides Virtual Private Networks, AT&T Dedicated Internet, Ethernet, data services, cloud solutions, outsourcing, and managed professional services, as well as customer premises equipment for multinational corporations, small and mid-sized businesses, governmental, and wholesale customers. In addition, this segment offers broadband services, including fiber connections, legacy telephony voice communication services, and other VoIP services and equipment to residential customers. This segment markets its communications services and products under the AT&T, AT&T Business, Cricket, AT&T PREPAID, and AT&T Fiber brand names. The Latin America segment provides postpaid and prepaid wireless services in Mexico under the AT&T and Unefon brand names, as well as sells smartphones through its owned stores, agents and third-party retail stores. The company was formerly known as SBC Communications Inc. and changed its name to AT&T Inc. in 2005. AT&T Inc. was incorporated in 1983 and is based in Dallas, Texas.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"24-12-2024 16:58:25"}]