[{"Company Name":"Danaher Corporation","Symbol":"DHR","Current Price":"230.61","Latest MA":"252.92","Price Target":283.31155,"Difference from MA":"-8.82%","Difference from Open":"-1.88%","Change from Yesterday":"-6.95%","Change from Last Report":"-0.05","Latest Volume":"3,098,788","Market Cap":"166,563,840,000","Earning Date":"2025-01-29","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":25.135973,"PB Ratio":3.246565,"ROE":0.07586,"DTE":36.69,"Industry":"Diagnostics & Research","Sector":"Healthcare","Beta":0.881,"Trailing PEG":3.3095,"Trailing PE":43.51132,"Trailing PS":7.015578,"Quick Ratio":0.916,"Day High":235.53,"Day Low":227.78,"VS Average Volume":1.0069153399,"Company Summary":"Danaher Corporation designs, manufactures, and markets professional, medical, industrial, and commercial products and services worldwide. The Biotechnology segments offers bioprocess technologies, consumables, and services that advance, accelerate, and integrate the development and manufacture of therapeutics; cell line and cell culture media development services; cell culture media, process liquids and buffers for manufacturing, chromatography resins, filtration technologies, aseptic fill finish; single-use hardware and consumables and services, such as the design and installation of full manufacturing suites; lab filtration, separation, and purification; lab-scale protein purification and analytical tools; reagents, membranes, and services; and healthcare filtration solutions. The Life Sciences segment provides mass spectrometers; flow cytometry, genomics, lab automation, centrifugation, liquid handling automation instruments, antibodies and reagents, and particle counting and characterization; microscopes; protein consumables; industrial filtration products; and genomic medicines, such as custom nucleic acid products, plasmid DNA, RNA, and proteins under the ABCAM, ALDEVRON, BECKMAN COULTER, IDT, LEICA MICROSYSTEMS, MOLECULAR DEVICES, PALL, PHENOMENEX and SCIEX brands. The Diagnostics segment offers chemistry, immunoassay, microbiology, and automation systems; and molecular, acute care, and pathology diagnostics products. This segment also provides clinical instruments, reagents, consumables, software, and services for hospitals, physicians' offices, reference laboratories, and other critical care settings. The company has a research  collaboration  with Stanford  University's Department  of  Bioengineering for cancer drug development. The company was formerly known as Diversified Mortgage Investors, Inc. and changed its name to Danaher Corporation in 1984. Danaher Corporation was founded in 1969 and is based in Washington, the District of Columbia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"Tesla, Inc.","Symbol":"TSLA","Current Price":"392.95","Latest MA":"288.43","Price Target":319.46732,"Difference from MA":"36.24%","Difference from Open":"-0.57%","Change from Yesterday":"-1.23%","Change from Last Report":"-0.29","Latest Volume":"8,007,605","Market Cap":"1,261,397,868,544","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":120.49144,"PB Ratio":18.020338,"ROE":0.20389,"DTE":18.078,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":2.295,"Trailing PEG":4.8786,"Trailing PE":107.3638,"Trailing PS":12.984023,"Quick Ratio":1.214,"Day High":398.5899,"Day Low":391.95,"VS Average Volume":0.0893600867,"Company Summary":"Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners; and provision of service and repairs to its energy product customers, including under warranty, as well as various financing options to its solar customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was incorporated in 2003 and is headquartered in Austin, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"QUALCOMM Incorporated","Symbol":"QCOM","Current Price":"173.31","Latest MA":"169.19","Price Target":202.92969,"Difference from MA":"2.43%","Difference from Open":"1.02%","Change from Yesterday":"1.00%","Change from Last Report":"1.02","Latest Volume":"1,068,566","Market Cap":"191,569,592,320","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":14.191253,"PB Ratio":7.341565,"ROE":0.42253,"DTE":58.765,"Industry":"Semiconductors","Sector":"Technology","Beta":1.286,"Trailing PEG":1.6944,"Trailing PE":19.385347,"Trailing PS":4.9168315,"Quick Ratio":1.64,"Day High":173.49,"Day Low":170.63,"VS Average Volume":0.1276776904,"Company Summary":"QUALCOMM Incorporated engages in the development and commercialization of foundational technologies for the wireless industry worldwide. It operates through three segments: Qualcomm CDMA Technologies (QCT); Qualcomm Technology Licensing (QTL); and Qualcomm Strategic Initiatives (QSI). The QCT segment develops and supplies integrated circuits and system software with advanced connectivity and high-performance, and low-power computing technologies for use in mobile devices; automotive systems for connectivity, digital cockpit, and ADAS\/AD; and IoT, including consumer electronic devices, industrial devices, and edge networking products. The QTL segment grants licenses or provides rights to use portions of its intellectual property portfolio, which include various patent rights useful in the manufacture and sale of wireless products comprising products implementing CDMA2000, WCDMA, LTE and\/or OFDMA-based 5G products. The QSI segment invests in early-stage companies in various industries, including 5G, artificial intelligence, automotive, consumer, enterprise, cloud, IoT, and extended reality, and investments, including non-marketable equity securities and, to a lesser extent, marketable equity securities, and convertible debt instruments. It also provides development, and other services and sells related products to the United States government agencies and their contractors. The company was incorporated in 1985 and is headquartered in San Diego, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"Microsoft Corporation","Symbol":"MSFT","Current Price":"441.50","Latest MA":"426.94","Price Target":509.0436,"Difference from MA":"3.41%","Difference from Open":"-1.16%","Change from Yesterday":"-1.24%","Change from Last Report":"0.14","Latest Volume":"2,739,655","Market Cap":"3,282,462,310,400","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":29.452301,"PB Ratio":11.410203,"ROE":0.35604,"DTE":33.657,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.904,"Trailing PEG":2.3466,"Trailing PE":36.42698,"Trailing PS":12.913421,"Quick Ratio":1.163,"Day High":446.88,"Day Low":440.4,"VS Average Volume":0.1248992303,"Company Summary":"Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services. This segment also provides LinkedIn; and dynamics business solutions, including Dynamics 365, a set of intelligent, cloud-based applications across ERP, CRM, power apps, and power automate; and on-premises ERP and CRM applications. The Intelligent Cloud segment offers server products and cloud services, such as azure and other cloud services; SQL and windows server, visual studio, system center, and related client access licenses, as well as nuance and GitHub; and enterprise services including enterprise support services, industry solutions, and nuance professional services. The More Personal Computing segment offers Windows, including windows OEM licensing and other non-volume licensing of the Windows operating system; Windows commercial comprising volume licensing of the Windows operating system, windows cloud services, and other Windows commercial offerings; patent licensing; and windows Internet of Things; and devices, such as surface, HoloLens, and PC accessories. Additionally, this segment provides gaming, which includes Xbox hardware and content, and first- and third-party content; Xbox game pass and other subscriptions, cloud gaming, advertising, third-party disc royalties, and other cloud services; and search and news advertising, which includes Bing, Microsoft News and Edge, and third-party affiliates. The company sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online, and retail stores. The company was founded in 1975 and is headquartered in Redmond, Washington.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"Nasdaq, Inc.","Symbol":"NDAQ","Current Price":"78.50","Latest MA":"72.90","Price Target":86.55556,"Difference from MA":"7.69%","Difference from Open":"-1.01%","Change from Yesterday":"-3.31%","Change from Last Report":"0.42","Latest Volume":"2,019,832","Market Cap":"45,118,504,960","Earning Date":"2025-01-29","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":22.00951,"PB Ratio":4.0749583,"ROE":0.10888,"DTE":93.096,"Industry":"Financial Data & Stock Exchanges","Sector":"Financial Services","Beta":0.96,"Trailing PEG":4.3614,"Trailing PE":47.289158,"Trailing PS":6.4298854,"Quick Ratio":0.154,"Day High":79.3,"Day Low":76.34,"VS Average Volume":0.7913722282,"Company Summary":"Nasdaq, Inc. operates as a technology company that serves capital markets and other industries worldwide. It operates in three segments: Capital Access Platforms, Financial Technology, and Market Services. The Capital Access Platforms segment sells and distributes historical and real-time market data; and develops and licenses Nasdaq-branded indices and financial products. This segment also offers investor relations intelligence, governance solutions, and ESG solutions; and insights and workflow solutions, as well as operates listing platforms. The Financial Technology segment offers Verafin, a cloud-based platform to detect, investigate, and report money laundering and financial frauds; surveillance solutions, including a SaaS platform to assist in complying with market rules, regulations, and internal market surveillance policies; AxiomSL, a risk data management and regulatory reporting solution; and Calypso, a front-to-back trading technology solution for the financial market. This segment also handles assets, comprising cash equities, equity derivatives, currencies, various interest-bearing securities, commodities, energy products, and digital currencies; and trade management and colocation services. The Market Platforms segment offers equity derivative trading and clearing, cash equity trading, fixed income and commodities trading and clearing, and currency trading services. This segment operates various exchanges and other marketplace facilities across various asset classes which includes derivatives, commodities, cash equity, debt, structured products, and exchange traded products; and provides clearing, settlement, and central depository services. The company was formerly known as The NASDAQ OMX Group, Inc. and changed its name to Nasdaq, Inc. in September 2015. Nasdaq, Inc. was founded in 1971 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"Brinker International, Inc.","Symbol":"EAT","Current Price":"174.97","Latest MA":"96.96","Price Target":144.2,"Difference from MA":"80.45%","Difference from Open":"-0.91%","Change from Yesterday":"13.21%","Change from Last Report":"-0.11","Latest Volume":"1,266,009","Market Cap":"7,773,584,896","Earning Date":"2025-01-29","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":23.625757,"PB Ratio":611.7832,"ROE":"N\/A","DTE":15818.898,"Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":2.48,"Trailing PEG":null,"Trailing PE":42.884804,"Trailing PS":1.7116402,"Quick Ratio":0.122,"Day High":180.0,"Day Low":171.2,"VS Average Volume":1.0800299949,"Company Summary":"Brinker International, Inc., together with its subsidiaries, engages in the ownership, development, operation, and franchising of casual dining restaurants in the United States and internationally. The company operates and franchises Chili's Grill & Bar and Maggiano's Little Italy restaurant brands. It also operates virtual brands, It's Just Wings. The company was founded in 1975 and is headquartered in Dallas, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"Flex Ltd.","Symbol":"FLEX","Current Price":"41.97","Latest MA":"34.69","Price Target":44.72857,"Difference from MA":"20.98%","Difference from Open":"-0.75%","Change from Yesterday":"3.35%","Change from Last Report":"0.67","Latest Volume":"1,621,569","Market Cap":"16,273,313,792","Earning Date":"2025-01-29","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":15.0379305,"PB Ratio":3.2693205,"ROE":0.15442,"DTE":83.65,"Industry":"Electronic Components","Sector":"Technology","Beta":1.076,"Trailing PEG":null,"Trailing PE":20.175482,"Trailing PS":0.63944805,"Quick Ratio":0.72,"Day High":42.28,"Day Low":39.93,"VS Average Volume":0.3573998794,"Company Summary":"Flex Ltd. provides manufacturing solutions to various brands in Asia, the Americas, and Europe. It operates through two segments, Flex Agility Solutions (FAS) and Flex Reliability Solutions (FRS). The FAS segment offers flexible supply and manufacturing system comprising communications, enterprise, and cloud solution, which includes data, edge, and communications infrastructure; lifestyle solution, including appliances, consumer packaging, floorcare, micro mobility, and audio; and consumer devices, such as mobile and high velocity consumer devices. Its FRS segment provides complex ramps with specialized production models and critical environments, which comprise automotive including next generation mobility, autonomous, connectivity, electrification, and smart technologies; health solutions, such as medical devices, medical equipment, and drug delivery; and industrial solutions, including capital equipment, industrial devices, embedded and critical power offerings, and renewables and grid edge. In addition, it provides various services, including design and engineering, such as product design and engineering resources that provide design services, product development, systems integration services, and solutions; supply chain comprising manufacturing, customization, procurement, logistics services, and innovative supply chain solutions; manufacturing; logistics and value-added fulfillment, including warehousing and vendor managed inventory, omni-channel fulfillment, kitting, configuration, and postponement; and integrated reverse logistics and circular economy. Further, the company offers embedded and critical power solutions. The company was formerly known as Flextronics International Ltd. and changed its name to Flex Ltd. in September 2016. Flex Ltd. was founded in 1969 and is headquartered in Austin, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"V.F. Corporation","Symbol":"VFC","Current Price":"28.56","Latest MA":"18.98","Price Target":22.805,"Difference from MA":"50.49%","Difference from Open":"2.96%","Change from Yesterday":"7.44%","Change from Last Report":"0.19","Latest Volume":"5,011,153","Market Cap":"11,118,950,400","Earning Date":"2025-01-29","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":30.215826,"PB Ratio":7.9047885,"ROE":-0.22331,"DTE":524.646,"Industry":"Apparel Manufacturing","Sector":"Consumer Cyclical","Beta":1.545,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":1.1015964,"Quick Ratio":0.465,"Day High":29.02,"Day Low":27.545,"VS Average Volume":0.8732513723,"Company Summary":"V.F. Corporation, together with its subsidiaries, engages in the design, procurement, marketing, and distribution of branded lifestyle apparel, footwear, and accessories for men, women, and children in the Americas, Europe, and the Asia-Pacific. It operates through three segments: Outdoor, Active, and Work. The company offers High performance outdoor apparel, footwear, equipment, accessories; outdoor, adventure-inspired lifestyle footwear, apparel, and accessories; performance merino wool and other natural fibers-based apparel and accessories; performance-based footwear; and high performance apparel and accessories based on natural fibers under the The North Face, Timberland, Smartwool, Icebreaker, and Altra brands. It also offers youth culture\/action sports-inspired and streetwear apparel, footwear, and accessories; handbags, luggage, backpacks, totes, and accessories; outdoor-inspired apparel, footwear, and accessories; and backpacks and luggage under the Vans, Supreme, Kipling, Napapijri, Eastpak, and JanSport brands. In addition, the company provides work and work-inspired lifestyle apparel and footwear; and protective work footwear under the Dickies, and Timberland PRO brands. The company sells its products primarily to specialty stores, department stores, national chains, independently-operated partnership stores, and mass merchants, as well as sells through direct-to-consumer operations, including retail stores, concession retail stores, and e-commerce sites, and other digital platforms. V.F. Corporation was founded in 1899 and is headquartered in Denver, Colorado.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"Alibaba Group Holding Limited","Symbol":"BABA","Current Price":"97.92","Latest MA":"87.48","Price Target":120.953445,"Difference from MA":"11.93%","Difference from Open":"-1.48%","Change from Yesterday":"1.96%","Change from Last Report":"0.48","Latest Volume":"20,872,174","Market Cap":"232,653,029,376","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":1.381393,"PB Ratio":0.24155232,"ROE":0.05668,"DTE":22.796,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":0.349,"Trailing PEG":0.6385,"Trailing PE":20.148148,"Trailing PS":0.244834,"Quick Ratio":0.97,"Day High":99.47,"Day Low":96.45,"VS Average Volume":1.448037652,"Company Summary":"Alibaba Group Holding Limited, through its subsidiaries, provides technology infrastructure and marketing reach to help merchants, brands, retailers, and other businesses to engage with their users and customers in the People's Republic of China and internationally. The company operates through seven segments: China Commerce, International Commerce, Local Consumer Services, Cainiao, Cloud, Digital Media and Entertainment, and Innovation Initiatives and Others. It operates Taobao and Tmall, which are digital retail platforms; Alimama, a proprietary monetization platform; 1688.com and Alibaba.com, which are online wholesale marketplaces; AliExpress, a retail marketplace; Lazada, Trendyol, and Daraz that are e-commerce platforms; Freshippo, a retail platform for groceries and fresh goods; and Tmall Global, an import e-commerce platform. The company also operates Cainiao Network logistic services platform; Ele.me, an on-demand delivery and local services platform; Koubei, a restaurant and local services guide platform; and Fliggy, an online travel platform. In addition, it offers pay-for-performance, in-feed, and display marketing services; and Taobao Ad Network and Exchange, a real-time online bidding marketing exchange. Further, the company provides elastic computing, storage, network, security, database, big data, and IoT services; and hardware, software license, software installation, and application development and maintenance services. Additionally, it operates Youku, an online video platform; Quark, a platform for information search, storage, and consumption; Alibaba Pictures and other content platforms that provide online videos, films, live events, news feeds, literature, music, and others; Amap, a mobile digital map, navigation, and real-time traffic information app; DingTalk, a business efficiency mobile app; and Tmall Genie smart speaker. The company was incorporated in 1999 and is based in Hangzhou, the People's Republic of China.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"Meta Platforms, Inc.","Symbol":"META","Current Price":"668.66","Latest MA":"558.09","Price Target":672.0384,"Difference from MA":"19.81%","Difference from Open":"-0.91%","Change from Yesterday":"-0.84%","Change from Last Report":"-0.10","Latest Volume":"3,020,220","Market Cap":"1,688,013,897,728","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":26.26378,"PB Ratio":10.257654,"ROE":0.36134,"DTE":29.811,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.215,"Trailing PEG":1.4322,"Trailing PE":31.585045,"Trailing PS":10.80488,"Quick Ratio":2.568,"Day High":675.73,"Day Low":665.67,"VS Average Volume":0.2257792742,"Company Summary":"Meta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and wearables worldwide. It operates in two segments, Family of Apps and Reality Labs. The Family of Apps segment offers Facebook, which enables people to share, discuss, discover, and connect with interests; Instagram, a community for sharing photos, videos, and private messages, as well as feed, stories, reels, video, live, and shops; Messenger, a messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls; and WhatsApp, a messaging application that is used by people and businesses to communicate and transact privately. The Reality Labs segment provides augmented and virtual reality related products comprising consumer hardware, software, and content that help people feel connected, anytime, and anywhere. The company was formerly known as Facebook, Inc. and changed its name to Meta Platforms, Inc. in October 2021. The company was incorporated in 2004 and is headquartered in Menlo Park, California","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"T-Mobile US, Inc.","Symbol":"TMUS","Current Price":"239.26","Latest MA":"208.85","Price Target":244.76,"Difference from MA":"14.56%","Difference from Open":"0.53%","Change from Yesterday":"8.19%","Change from Last Report":"0.19","Latest Volume":"2,114,720","Market Cap":"277,658,828,800","Earning Date":"2025-01-29","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":22.371996,"PB Ratio":4.3369346,"ROE":0.16087,"DTE":182.272,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.496,"Trailing PEG":0.8852,"Trailing PE":27.25057,"Trailing PS":3.4704752,"Quick Ratio":0.862,"Day High":240.4,"Day Low":233.245,"VS Average Volume":0.5845986109,"Company Summary":"T-Mobile US, Inc., together with its subsidiaries, provides mobile communications services in the United States, Puerto Rico, and the United States Virgin Islands. The company offers voice, messaging, and data services to customers in the postpaid, prepaid, and wholesale and other services. It also provides wireless devices, including smartphones, wearables, tablets, home broadband routers, and other mobile communication devices, as well as wireless devices and accessories; financing through equipment installment plans; reinsurance for device insurance policies and extended warranty contracts; leasing through JUMP! On Demand; and High Speed Internet services. In addition, the company offers services, devices, and accessories under the T-Mobile and Metro by T-Mobile brands through its owned and operated retail stores, T-Mobile app and customer care channels, and its websites. It also sells its devices to dealers and other third-party distributors for resale through independent third-party retail outlets and various third-party websites. The company was founded in 1994 and is headquartered in Bellevue, Washington. T-Mobile US, Inc. operates as a subsidiary of Deutsche Telekom AG.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"Corning Incorporated","Symbol":"GLW","Current Price":"51.41","Latest MA":"44.89","Price Target":53.35143,"Difference from MA":"14.52%","Difference from Open":"-6.71%","Change from Yesterday":"0.29%","Change from Last Report":"-0.24","Latest Volume":"4,066,240","Market Cap":"44,017,704,960","Earning Date":"2025-01-29","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":19.212587,"PB Ratio":3.7690616,"ROE":0.019299999,"DTE":72.739,"Industry":"Electronic Components","Sector":"Technology","Beta":1.029,"Trailing PEG":0.6556,"Trailing PE":270.57895,"Trailing PS":3.4904213,"Quick Ratio":0.776,"Day High":55.33,"Day Low":50.3,"VS Average Volume":0.8845613348,"Company Summary":"Corning Incorporated engages in the display technologies, optical communications, environmental technologies, specialty materials, and life sciences businesses in the United States and internationally. The company's Display Technologies segment offers glass substrates for flat panel displays, including liquid crystal displays and organic light-emitting diodes that are used in televisions, notebook computers, desktop monitors, tablets, and handheld devices. Its Optical Communications segment provides optical fibers and cables; and hardware and equipment products, such as cable assemblies, fiber optic hardware and connectors, optical components and couplers, closures, network interface devices, and other accessories for the telecommunications industry, businesses, governments, and individuals. The company's Specialty Materials segment manufactures products that offer material formulations for glass, glass ceramics, crystals, precision metrology instruments, and software, as well as glass wafers and substrates, tinted sunglasses, and radiation shielding products for various markets comprising mobile consumer electronics, semiconductor equipment optics and consumables, aerospace and defense optics, radiation shielding products, sunglasses, and telecommunications components. Its Environmental Technologies segment provides ceramic substrates and filter products for emissions control in mobile, gasoline, and diesel applications. The company's Life Sciences segment offers laboratory products, including consumables, such as plastic vessels, liquid handling plastics, specialty surfaces, cell culture media, and serum, as well as general labware, and glassware and equipment under the Corning, Pyrex, Falcon, and Axygen brands. The company was formerly known as Corning Glass Works and changed its name to Corning Incorporated in April 1989. Corning Incorporated was founded in 1851 and is headquartered in Corning, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"General Motors Company","Symbol":"GM","Current Price":"50.17","Latest MA":"49.46","Price Target":60.05308,"Difference from MA":"1.44%","Difference from Open":"-0.22%","Change from Yesterday":"0.31%","Change from Last Report":"0.42","Latest Volume":"2,357,787","Market Cap":"55,166,930,944","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":4.547807,"PB Ratio":0.77799827,"ROE":0.14167,"DTE":174.581,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":1.414,"Trailing PEG":7.6619,"Trailing PE":7.875981,"Trailing PS":0.30192223,"Quick Ratio":0.948,"Day High":50.6,"Day Low":49.12,"VS Average Volume":0.2110776352,"Company Summary":"General Motors Company designs, builds, and sells trucks, crossovers, cars, and automobile parts; and provide software-enabled services and subscriptions worldwide. The company operates through GM North America, GM International, Cruise, and GM Financial segments. It markets its vehicles primarily under the Buick, Cadillac, Chevrolet, GMC, Baojun, and Wuling brand names. In addition, the company sells trucks, crossovers, cars, and automobile parts through retail dealers, and distributors and dealers, as well as to fleet customers, including daily rental car companies, commercial fleet customers, leasing companies, and governments. Further, it offers range of after-sale services through dealer network, such as maintenance, light repairs, collision repairs, vehicle accessories, and extended service warranties. Additionally, the company provides automotive financing; and software-enabled services and subscriptions. General Motors Company was founded in 1908 and is headquartered in Detroit, Michigan.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"Qorvo, Inc.","Symbol":"QRVO","Current Price":"87.41","Latest MA":"94.61","Price Target":92.59682,"Difference from MA":"-7.61%","Difference from Open":"3.73%","Change from Yesterday":"1.81%","Change from Last Report":"1.32","Latest Volume":"1,507,048","Market Cap":"8,262,579,712","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":15.340309,"PB Ratio":2.3545415,"ROE":-0.03908,"DTE":57.517,"Industry":"Semiconductors","Sector":"Technology","Beta":1.487,"Trailing PEG":null,"Trailing PE":312.1786,"Trailing PS":2.0928366,"Quick Ratio":1.267,"Day High":87.97,"Day Low":82.51,"VS Average Volume":0.4590236236,"Company Summary":"Qorvo, Inc. engages in development and commercialization of technologies and products for wireless, wired, and power markets worldwide. It operates through three segments: High Performance Analog (HPA), Connectivity and Sensors Group (CSG), and Advanced Cellular Group (ACG). The HPA segment supplies radio frequency and power management solutions for defense and aerospace, and 5G and 6G infrastructure markets. The CSG segment supplies connectivity and sensor solutions featuring various technologies, such as UWB, Matter, Bluetooth Low Energy, Zigbee, Thread, Wi-Fi, cellular IoT, and MEMS-based sensors. It serves smart home, industrial automation, automotive, smartphones, wearables, gaming, and industrial and enterprise access points markets. The ACG segment supplies cellular RF solutions for smartphones, wearables, laptops, tablets, and various other devices. It also offers foundry services for defense primes and other defense and aerospace customers. The company sells its products directly to original equipment manufacturers and original design manufacturers, as well as through a network of sales representative firms and distributors. Qorvo, Inc. was founded in 1957 and is headquartered in Greensboro, North Carolina.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"Nextracker Inc.","Symbol":"NXT","Current Price":"49.65","Latest MA":"39.75","Price Target":54.2831,"Difference from MA":"24.91%","Difference from Open":"-0.15%","Change from Yesterday":"25.23%","Change from Last Report":"1.73","Latest Volume":"3,787,508","Market Cap":"7,320,826,880","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":13.844576,"PB Ratio":7.272184,"ROE":0.60612,"DTE":11.396,"Industry":"Solar","Sector":"Technology","Beta":"N\/A","Trailing PEG":4.1543,"Trailing PE":12.4118,"Trailing PS":2.6123111,"Quick Ratio":1.794,"Day High":49.98,"Day Low":46.43,"VS Average Volume":1.3769797109,"Company Summary":"Nextracker Inc., an energy solutions company, provides solar tracker and software solutions for utility-scale and distributed generation solar projects in the United States and internationally. The company offers tracking solutions, which includes NX Horizon, a solar tracking solution; and NX Horizon-XTR, a terrain-following tracker designed to expand the addressable market for trackers on sites with sloped, uneven, and challenging terrain. It also provides TrueCapture, a self-adjusting tracker control system, which boosts solar power plant production by optimizing the position of individual tracker row in response to site features, such as varying topography and changing weather conditions; and NX Navigator, that assists solar power plant owners and operators in monitoring, controlling, and protecting their solar projects. The company was founded in 2013 and is headquartered in Fremont, California. As of March 31, 2024 Nextracker Inc. was formerly a subsidiary of Flex Ltd.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"Starbucks Corporation","Symbol":"SBUX","Current Price":"105.78","Latest MA":"90.99","Price Target":105.53733,"Difference from MA":"16.25%","Difference from Open":"3.00%","Change from Yesterday":"5.46%","Change from Last Report":"0.52","Latest Volume":"7,482,865","Market Cap":"120,164,360,192","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":28.801493,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":0.962,"Trailing PEG":2.1005,"Trailing PE":34.124195,"Trailing PS":3.3216414,"Quick Ratio":0.524,"Day High":107.2,"Day Low":102.68,"VS Average Volume":0.9257316728,"Company Summary":"Starbucks Corporation, together with its subsidiaries, operates as a roaster, marketer, and retailer of coffee worldwide. The company operates through three segments: North America, International, and Channel Development. Its stores offer coffee, tea, and other beverages, roasted whole beans and ground coffees, single serve products, and ready-to-drink beverages; and various food products, such as pastries, breakfast sandwiches, and lunch items. The company also licenses its trademarks through licensed stores, and grocery and foodservice accounts. The company offers its products under the Starbucks Coffee, Teavana, Seattle's Best Coffee, Ethos, and Starbucks Reserve brands. Starbucks Corporation was founded in 1971 and is based in Seattle, Washington.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"Boeing Company (The)","Symbol":"BA","Current Price":"177.04","Latest MA":"165.62","Price Target":188.505,"Difference from MA":"6.89%","Difference from Open":"-1.16%","Change from Yesterday":"-0.42%","Change from Last Report":"-0.48","Latest Volume":"1,497,014","Market Cap":"132,641,193,984","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":42.75502,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.572,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":1.809739,"Quick Ratio":0.238,"Day High":182.55,"Day Low":176.94,"VS Average Volume":0.1217157978,"Company Summary":"The Boeing Company, together with its subsidiaries, designs, develops, manufactures, sells, services, and supports commercial jetliners, military aircraft, satellites, missile defense, human space flight and launch systems, and services worldwide. The company operates through Commercial Airplanes; Defense, Space & Security; and Global Services segments. The Commercial Airplanes segment develops, produces, and markets commercial jet aircraft for passenger and cargo requirements, as well as provides fleet support services. The Defense, Space & Security segment engages in the research, development, production, and modification of manned and unmanned military aircraft and weapons systems; strategic defense and intelligence systems, which include strategic missile and defense systems, command, control, communications, computers, intelligence, surveillance and reconnaissance, cyber and information solutions, and intelligence systems; and satellite systems, such as government and commercial satellites, and space exploration. The Global Services segment offers products and services, including supply chain and logistics management, engineering, maintenance and modifications, upgrades and conversions, spare parts, pilot and maintenance training systems and services, technical and maintenance documents, and data analytics and digital services to commercial and defense customers. The Boeing Company was incorporated in 1916 and is based in Arlington, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"SoFi Technologies, Inc.","Symbol":"SOFI","Current Price":"16.18","Latest MA":"10.71","Price Target":13.23333,"Difference from MA":"50.97%","Difference from Open":"0.47%","Change from Yesterday":"0.05%","Change from Last Report":"0.75","Latest Volume":"5,373,339","Market Cap":"17,717,446,656","Earning Date":"2025-01-27","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":34.835136,"PB Ratio":2.86486,"ROE":0.037249997,"DTE":54.394,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.613,"Trailing PEG":null,"Trailing PE":41.474358,"Trailing PS":7.0329347,"Quick Ratio":0.47,"Day High":16.23,"Day Low":15.86,"VS Average Volume":0.1077680456,"Company Summary":"SoFi Technologies, Inc. provides various financial services in the United States, Latin America, and Canada. It operates through three segments: Lending, Technology Platform, and Financial Services. The company offers lending and financial services and products that allows its members to borrow, save, spend, invest, and protect money. It offers personal loans, student loans, home loans, and related services. The company also operates Galileo, a technology platform that offers services to financial and non-financial institution; and Technisys, a cloud-native digital and core banking platform with financial services customers. In addition, it provides SoFi Money offers checking and savings accounts, debit cards, and cash management products; and SoFi Invest, a mobile-first investment platform that provides access to trading and advisory solutions, such as investing and robo-advisory. Further, the company offers SoFi Credit Card that provides cash backs on every purchase; Sofi Relay, a personal finance management product that allows to track all of their financial accounts comprising credit score and spending behaviors; SoFi Protect, which offers insurance product; SoFi Travel, an application that manages travel search and booking experience; SoFi At Work provides financial benefits to employees, including student loan payments made on their employees' behalf; Lantern Credit, a financial services marketplace platform for seeking alternative products and provide product comparisons; and other lending as a service that offers pre-qualified borrower referrals and sells loans to third-party partner. The company was founded in 2011 and is based in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"AT&T Inc.","Symbol":"T","Current Price":"24.66","Latest MA":"20.92","Price Target":26.515,"Difference from MA":"17.89%","Difference from Open":"-0.18%","Change from Yesterday":"1.07%","Change from Last Report":"0.00","Latest Volume":"5,887,248","Market Cap":"176,996,040,704","Earning Date":"2025-01-27","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":11.013029,"PB Ratio":1.7289361,"ROE":0.08759,"DTE":125.151,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.73,"Trailing PEG":2.0187,"Trailing PE":16.553692,"Trailing PS":1.4500741,"Quick Ratio":0.42,"Day High":24.98,"Day Low":24.6238,"VS Average Volume":0.163771749,"Company Summary":"AT&T Inc. provides telecommunications and technology services worldwide. The company operates through two segments, Communications and Latin America. The Communications segment offers wireless voice and data communications services; and sells handsets, wireless data cards, wireless computing devices, carrying cases\/protective covers, and wireless chargers through its own company-owned stores, agents, and third-party retail stores. It also provides Virtual Private Networks, AT&T Dedicated Internet, Ethernet, data services, cloud solutions, outsourcing, and managed professional services, as well as customer premises equipment for multinational corporations, small and mid-sized businesses, governmental, and wholesale customers. In addition, this segment offers broadband services, including fiber connections, legacy telephony voice communication services, and other VoIP services and equipment to residential customers. This segment markets its communications services and products under the AT&T, AT&T Business, Cricket, AT&T PREPAID, and AT&T Fiber brand names. The Latin America segment provides postpaid and prepaid wireless services in Mexico under the AT&T and Unefon brand names, as well as sells smartphones through its owned stores, agents and third-party retail stores. The company was formerly known as SBC Communications Inc. and changed its name to AT&T Inc. in 2005. AT&T Inc. was incorporated in 1983 and is based in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"Verizon Communications Inc.","Symbol":"VZ","Current Price":"40.61","Latest MA":"40.58","Price Target":47.66043,"Difference from MA":"0.07%","Difference from Open":"-0.51%","Change from Yesterday":"0.48%","Change from Last Report":"0.27","Latest Volume":"2,266,421","Market Cap":"170,953,080,832","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.3251,"PB Ratio":1.7747575,"ROE":0.10431,"DTE":182.615,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.418,"Trailing PEG":1.0863,"Trailing PE":9.809179,"Trailing PS":1.2735168,"Quick Ratio":0.51,"Day High":40.88,"Day Low":40.49,"VS Average Volume":0.113861322,"Company Summary":"Verizon Communications Inc., through its subsidiaries, engages in the provision of communications, technology, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide. It operates in two segments, Verizon Consumer Group (Consumer) and Verizon Business Group (Business). The Consumer segment provides wireless services across the wireless networks in the United States under the Verizon and TracFone brands and through wholesale and other arrangements; and fixed wireless access (FWA) broadband through its wireless networks, as well as related equipment and devices, such as smartphones, tablets, smart watches, and other wireless-enabled connected devices. The segment also offers wireline services in the Mid-Atlantic and Northeastern United States, as well as Washington D.C. through its fiber-optic network, Verizon Fios product portfolio, and a copper-based network. The Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and conferencing, corporate networking, security and managed network, local and long-distance voice, and network access services to deliver various IoT services and products to businesses, government customers, and wireless and wireline carriers in the United States and internationally. The company was formerly known as Bell Atlantic Corporation and changed its name to Verizon Communications Inc. in June 2000. Verizon Communications Inc. was incorporated in 1983 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"American Airlines Group, Inc.","Symbol":"AAL","Current Price":"17.00","Latest MA":"13.07","Price Target":20.87,"Difference from MA":"30.09%","Difference from Open":"-0.76%","Change from Yesterday":"-0.85%","Change from Last Report":"0.08","Latest Volume":"3,213,117","Market Cap":"11,178,621,952","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":5.53598,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Airlines","Sector":"Industrials","Beta":1.399,"Trailing PEG":0.2367,"Trailing PE":13.709678,"Trailing PS":0.20850581,"Quick Ratio":0.422,"Day High":17.23,"Day Low":16.97,"VS Average Volume":0.1181530581,"Company Summary":"American Airlines Group Inc., through its subsidiaries, operates as a network air carrier. The company provides scheduled air transportation services for passengers and cargo through its hubs in Charlotte, Chicago, Dallas\/Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix, and Washington, D.C., as well as through partner gateways in London, Doha, Madrid, Seattle\/Tacoma, Sydney, and Tokyo. It operates a mainline fleet of 965 aircraft. The company was formerly known as AMR Corporation and changed its name to American Airlines Group Inc. in December 2013. American Airlines Group Inc. was founded in 1926 and is headquartered in Fort Worth, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"Freeport-McMoRan, Inc.","Symbol":"FCX","Current Price":"36.55","Latest MA":"44.02","Price Target":48.4219,"Difference from MA":"-16.97%","Difference from Open":"1.58%","Change from Yesterday":"2.00%","Change from Last Report":"0.29","Latest Volume":"2,352,220","Market Cap":"52,519,792,640","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.311502,"PB Ratio":2.9929576,"ROE":0.16870001,"DTE":33.531,"Industry":"Copper","Sector":"Basic Materials","Beta":1.91,"Trailing PEG":5.0463,"Trailing PE":28.115385,"Trailing PS":2.048354,"Quick Ratio":1.048,"Day High":36.66,"Day Low":35.94,"VS Average Volume":0.1917502914,"Company Summary":"Freeport-McMoRan Inc. engages in the mining of mineral properties in North America, South America, and Indonesia. It primarily explores for copper, gold, molybdenum, silver, and other metals. The company's assets include the Grasberg minerals district in Indonesia; Morenci, Bagdad, Safford, Sierrita, and Miami in Arizona; Chino and Tyrone in New Mexico; and Henderson and Climax in Colorado, North America, as well as Cerro Verde in Peru and El Abra in Chile. The company was formerly known as Freeport-McMoRan Copper & Gold Inc. and changed its name to Freeport-McMoRan Inc. in July 2014. Freeport-McMoRan Inc. was incorporated in 1987 and is headquartered in Phoenix, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"TAL Education Group","Symbol":"TAL","Current Price":"12.63","Latest MA":"9.92","Price Target":14.73579,"Difference from MA":"27.31%","Difference from Open":"-1.37%","Change from Yesterday":"-2.47%","Change from Last Report":"0.00","Latest Volume":"1,573,944","Market Cap":"7,635,116,032","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":26.535755,"PB Ratio":2.0846395,"ROE":0.019609999,"DTE":9.291,"Industry":"Education & Training Services","Sector":"Consumer Defensive","Beta":0.033,"Trailing PEG":0.6915,"Trailing PE":66.5,"Trailing PS":4.157163,"Quick Ratio":2.67,"Day High":12.9,"Day Low":12.395,"VS Average Volume":0.2326959495,"Company Summary":"TAL Education Group provides K-12 after-school tutoring services in the People's Republic of China. It provides learning services primarily through small-classes services; personalized premium services; and learning content solutions, such as print books, smart books, mobile apps, and AI-driven learning devices. The company also operates www.xueersi.com, an online education platform; provides investment management and consulting services; develops and sells software and networks, as well as related consulting services; and sells educational materials and products. It offers its services under the Haoweilai and Think Academy brands. TAL Education Group was founded in 2003 and is headquartered in Beijing, the People's Republic of China.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"CSX Corporation","Symbol":"CSX","Current Price":"33.12","Latest MA":"33.79","Price Target":37.08923,"Difference from MA":"-1.99%","Difference from Open":"1.11%","Change from Yesterday":"1.36%","Change from Last Report":"-0.12","Latest Volume":"2,635,358","Market Cap":"63,859,630,080","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":15.602915,"PB Ratio":4.938852,"ROE":0.29458,"DTE":147.913,"Industry":"Railroads","Sector":"Industrials","Beta":1.191,"Trailing PEG":2.1745,"Trailing PE":18.500002,"Trailing PS":4.349815,"Quick Ratio":1.195,"Day High":33.615,"Day Low":32.75,"VS Average Volume":0.2076798316,"Company Summary":"CSX Corporation, together with its subsidiaries, provides rail-based freight transportation services. The company offers rail services; and transportation of intermodal containers and trailers, as well as other transportation services, such as rail-to-truck transfers and bulk commodity operations. It also transports chemicals, agricultural and food products, minerals, automotive, forest products, fertilizers, and metals and equipment; and coal, coke, and iron ore to electricity-generating power plants, steel manufacturers, and industrial plants, as well as exports coal to deep-water port facilities. In addition, the company provides intermodal services through a network of approximately 30 terminals transporting manufactured consumer goods in containers; and drayage services, including the pickup and delivery of intermodal shipments. It serves the automotive industry with distribution centers and storage locations, as well as connects non-rail served customers through transferring products, such as plastics and ethanol from rail to trucks. The company operates approximately 20,000 route mile rail network, which serves various population centers in 26 states east of the Mississippi River, the District of Columbia, and the Canadian provinces of Ontario and Quebec, as well as owns and leases approximately 3,500 locomotives. It serves production and distribution facilities through track connections. CSX Corporation was incorporated in 1978 and is headquartered in Jacksonville, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"Abbott Laboratories","Symbol":"ABT","Current Price":"128.91","Latest MA":"112.13","Price Target":133.07957,"Difference from MA":"14.97%","Difference from Open":"0.59%","Change from Yesterday":"1.26%","Change from Last Report":"1.19","Latest Volume":"1,005,388","Market Cap":"223,589,253,120","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":22.72535,"PB Ratio":5.6184626,"ROE":0.14840001,"DTE":37.589,"Industry":"Medical Devices","Sector":"Healthcare","Beta":0.722,"Trailing PEG":2.2904,"Trailing PE":16.873037,"Trailing PS":5.4246855,"Quick Ratio":0.996,"Day High":129.3,"Day Low":127.72,"VS Average Volume":0.1771043949,"Company Summary":"Abbott Laboratories, together with its subsidiaries, discovers, develops, manufactures, and sells health care products worldwide. It operates in four segments: Established Pharmaceutical Products, Diagnostic Products, Nutritional Products, and Medical Devices. The company provides generic pharmaceuticals for the treatment of pancreatic exocrine insufficiency, irritable bowel syndrome or biliary spasm, intrahepatic cholestasis or depressive symptoms, gynecological disorder, hormone replacement therapy, dyslipidemia, hypertension, hypothyroidism, Ménière's disease and vestibular vertigo, pain, fever, inflammation, and migraine, as well as provides anti-infective clarithromycin, influenza vaccine, and products to regulate physiological rhythm of the colon. It also offers laboratory and transfusion medicine systems in the areas of immunoassay, clinical chemistry, hematology, and transfusion; molecular diagnostics polymerase chain reaction instrument systems that automate the extraction, purification, and preparation of DNA and RNA from patient samples, and detect and measure infectious agents; point of care systems; cartridges for testing blood gas, chemistry, electrolytes, coagulation, and immunoassay; rapid diagnostics lateral flow testing products; molecular point-of-care testing for HIV, SARS-CoV-2, influenza A and B, RSV, and strep A; cardiometabolic test systems; drug and alcohol test, and remote patient monitoring and consumer self-test systems; and informatics and automation solutions for laboratories. In addition, the company provides pediatric and adult nutritional products; rhythm management, electrophysiology, heart failure, vascular, and structural heart devices for the treatment of cardiovascular diseases; diabetes care products, such as glucose and blood glucose monitoring systems; and neuromodulation devices for the management of chronic pain and movement disorders. Abbott Laboratories was founded in 1888 and is based in North Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"Lam Research Corporation","Symbol":"LRCX","Current Price":"75.44","Latest MA":"81.25","Price Target":90.85239,"Difference from MA":"-7.15%","Difference from Open":"-2.60%","Change from Yesterday":"1.19%","Change from Last Report":"0.33","Latest Volume":"3,304,849","Market Cap":"97,067,900,928","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":18.534945,"PB Ratio":11.505261,"ROE":0.49116,"DTE":58.827,"Industry":"Semiconductor Equipment & Materials","Sector":"Technology","Beta":1.486,"Trailing PEG":1.4323,"Trailing PE":24.414242,"Trailing PS":6.2257733,"Quick Ratio":1.685,"Day High":77.47,"Day Low":74.47,"VS Average Volume":0.2891097907,"Company Summary":"Lam Research Corporation designs, manufactures, markets, refurbishes, and services semiconductor processing equipment used in the fabrication of integrated circuits. The company offers ALTUS systems to deposit conformal films for tungsten metallization applications; SABRE electrochemical deposition products for copper interconnect transition that offers copper damascene manufacturing; and VECTOR plasma-enhanced CVD products. It also provides SPEED gapfill high-density plasma chemical vapor deposition products; and Striker single-wafer atomic layer deposition products for dielectric film solutions. In addition, the company offers Flex for dielectric etch applications; Vantex, a dielectric etch system that provides RF technology and repeatable wafer-to-wafer performance enabled by Equipment Intelligence solutions; Kiyo for conductor etch applications; Syndion for through-silicon via etch applications; and Versys metal products for metal etch processes. Further, it provides Coronus bevel clean products to enhance die yield; and Da Vinci, DV-Prime, EOS, and SP series products to address various wafer cleaning applications. The company sells its products in the United States, China, Europe, Japan, Korea, Southeast Asia, and Taiwan. Lam Research Corporation was incorporated in 1980 and is headquartered in Fremont, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"Halliburton Company","Symbol":"HAL","Current Price":"26.85","Latest MA":"30.00","Price Target":34.41481,"Difference from MA":"-10.51%","Difference from Open":"0.83%","Change from Yesterday":"0.75%","Change from Last Report":"0.75","Latest Volume":"1,224,447","Market Cap":"23,587,778,560","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.712299,"PB Ratio":2.2895882,"ROE":0.26293,"DTE":83.993,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.905,"Trailing PEG":1.7831,"Trailing PE":9.487633,"Trailing PS":1.0223109,"Quick Ratio":1.377,"Day High":26.855,"Day Low":26.495,"VS Average Volume":0.1214677591,"Company Summary":"Halliburton Company provides products and services to the energy industry worldwide. It operates through two segments, Completion and Production, and Drilling and Evaluation. The Completion and Production segment offers production enhancement services that include stimulation and sand control services; cementing services, such as well bonding and casing, and casing equipment; and completion tools that offer downhole solutions and services, including well completion products and services, intelligent well completions, and service tools, as well as liner hanger, sand control, and multilateral systems. This segment also provides electrical submersible pumps, as well as artificial lift services; production solutions comprising coiled tubing, hydraulic workover units, downhole tools, and pumping and nitrogen services; pipeline and process services, such as pre-commissioning, commissioning, maintenance, and decommissioning; and specialty chemicals and services. The Drilling and Evaluation segment offers drilling fluid systems, performance additives, completion fluids, solids control, specialized testing equipment, and waste management services; drilling systems and services; wireline and perforating services consists of open-hole logging, and cased-hole and slickline; and drill bits and services comprising roller cone rock bits, fixed cutter bits, hole enlargement, and related downhole tools and services, as well as coring equipment and services. This segment also provides cloud based digital services and artificial intelligence solutions on an open architecture for subsurface insights, integrated well construction, and reservoir and production management; testing and subsea services, such as acquisition and analysis of reservoir information and optimization solutions; and project management and integrated asset management services. Halliburton Company was founded in 1919 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"Kinder Morgan, Inc.","Symbol":"KMI","Current Price":"27.89","Latest MA":"23.92","Price Target":29.585,"Difference from MA":"16.57%","Difference from Open":"1.25%","Change from Yesterday":"1.55%","Change from Last Report":"0.50","Latest Volume":"2,124,298","Market Cap":"61,950,431,232","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.688965,"PB Ratio":2.0374837,"ROE":0.083500005,"DTE":101.433,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.907,"Trailing PEG":2.0107,"Trailing PE":23.833334,"Trailing PS":4.0888677,"Quick Ratio":0.291,"Day High":27.8899,"Day Low":27.38,"VS Average Volume":0.1487254949,"Company Summary":"Kinder Morgan, Inc. operates as an energy infrastructure company primarily in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas gasification, liquefaction, and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and\/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, renewable fuel and feedstocks, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; owns interests in\/or operates oil fields and gasoline processing plants; and operates a crude oil pipeline system in West Texas, as well as owns and operates RNG and LNG facilities. It owns and operates approximately 82,000 miles of pipelines and 139 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1997 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"GE Vernova Inc.","Symbol":"GEV","Current Price":"365.57","Latest MA":"265.52","Price Target":413.59042,"Difference from MA":"37.68%","Difference from Open":"2.03%","Change from Yesterday":"2.99%","Change from Last Report":"2.94","Latest Volume":"1,252,778","Market Cap":"100,770,152,448","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":35.313606,"PB Ratio":10.593396,"ROE":"N\/A","DTE":9.346,"Industry":"Utilities - Renewable","Sector":"Utilities","Beta":"N\/A","Trailing PEG":3.0778,"Trailing PE":65.51389,"Trailing PS":2.9274926,"Quick Ratio":0.717,"Day High":366.235,"Day Low":353.51,"VS Average Volume":0.3856406664,"Company Summary":"GE Vernova Inc., an energy company, engages in the provision of various products and services that generate, transfer, orchestrate, convert, and store electricity in the United States, Europe, Asia, the Americas, the Middle East, and Africa. The company operates through three segments: Power, Wind, and Electrification. The Power segment designs, manufactures, and services gas, nuclear, hydro, and steam technologies. The Wind segment offers wind generation technologies, including onshore and offshore wind turbines and blades. The Electrification segment provides grid solutions, power conversion, solar, and storage solutions; and electrification software for the transmission, distribution, conversion, storage, and orchestration of electricity from point of generation to point of consumption. The company was incorporated in 2023 and is headquartered in Cambridge, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"Amphenol Corporation","Symbol":"APH","Current Price":"69.89","Latest MA":"67.71","Price Target":84.65,"Difference from MA":"3.22%","Difference from Open":"1.15%","Change from Yesterday":"1.78%","Change from Last Report":"1.90","Latest Volume":"1,216,455","Market Cap":"84,254,056,448","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":27.8834,"PB Ratio":8.91163,"ROE":0.25293,"DTE":57.565,"Industry":"Electronic Components","Sector":"Technology","Beta":1.238,"Trailing PEG":2.4242,"Trailing PE":36.39844,"Trailing PS":5.919877,"Quick Ratio":1.208,"Day High":69.92,"Day Low":69.0,"VS Average Volume":0.1802765558,"Company Summary":"Amphenol Corporation, together with its subsidiaries, primarily designs, manufactures, and markets electrical, electronic, and fiber optic connectors in the United States, China, and internationally. It operates through three segments: Harsh Environment Solutions, Communications Solutions, and Interconnect and Sensor Systems. The company offers connectors and connector systems, including harsh environment data, power, high-speed, fiber optic, and radio frequency interconnect products; busbars and power distribution systems; and other connectors. It also provides value-add products, such as backplane interconnect systems, cable assemblies and harnesses, and cable management products; other products comprising flexible and rigid printed circuit boards, hinges, other mechanical, and production related products. In addition, the company offers consumer device, network infrastructure, and other antennas; coaxial, power, and specialty cables; and sensors and sensor-based products. It sells its products through its sales force, independent representatives, and a network of electronics distributors to original equipment manufacturers, electronic manufacturing services companies, original design manufacturers, and service providers in the automotive, broadband communication, commercial aerospace, industrial, information technology and data communication, military, mobile device, and mobile network markets. Amphenol Corporation was founded in 1932 and is headquartered in Wallingford, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"Charles Schwab Corporation (The","Symbol":"SCHW","Current Price":"82.22","Latest MA":"70.93","Price Target":89.5,"Difference from MA":"15.91%","Difference from Open":"-0.10%","Change from Yesterday":"0.68%","Change from Last Report":"0.64","Latest Volume":"1,051,357","Market Cap":"150,508,650,496","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":15.852449,"PB Ratio":3.9561179,"ROE":0.12111,"DTE":144.242,"Industry":"Capital Markets","Sector":"Financial Services","Beta":0.952,"Trailing PEG":0.9688,"Trailing PE":27.498327,"Trailing PS":8.033126,"Quick Ratio":0.481,"Day High":82.5521,"Day Low":81.71,"VS Average Volume":0.1284314114,"Company Summary":"The Charles Schwab Corporation, together with its subsidiaries, operates as a savings and loan holding company that provides wealth management, securities brokerage, banking, asset management, custody, and financial advisory services in the United States and internationally. The company operates in two segments, Investor Services and Advisor Services. It offers brokerage accounts with equity and fixed income trading, margin lending, options trading, futures and forex trading, and cash management capabilities, including certificates of deposit; third-party mutual funds through the Mutual Fund Marketplace and Mutual Fund OneSource service, as well as mutual fund trading and clearing services to broker-dealers; exchange-traded funds; advisory solutions for managed portfolios, separately managed accounts, customized personal advice for tailored portfolios, specialized planning, and full-time portfolio management; banking products comprising checking and savings accounts, first lien residential real estate mortgage loans, home equity lines of credit, and pledged asset lines; and trust custody services, personal trust reporting services, and administrative trustee services. It also provides digital retirement calculators; integrated web-, mobile-, and software-based trading platforms, real-time market data, options trading, premium research, and multi-channel access; self-service education and support tools; online research and analysis tools; equity compensation plan sponsors full-service recordkeeping for stock plans, stock options, restricted stock, performance shares, and stock appreciation rights; retirement plan services; mutual fund clearing services; and advisor services, including interactive tools and educational content. The Company operates through branch offices. The Charles Schwab Corporation was founded in 1971 and is headquartered in Westlake, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"Schlumberger N.V.","Symbol":"SLB","Current Price":"41.63","Latest MA":"42.74","Price Target":53.26903,"Difference from MA":"-2.59%","Difference from Open":"0.75%","Change from Yesterday":"0.75%","Change from Last Report":"0.75","Latest Volume":"1,032,364","Market Cap":"58,317,389,824","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":11.0686,"PB Ratio":2.7328827,"ROE":0.21722999,"DTE":57.141,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.532,"Trailing PEG":1.9332,"Trailing PE":13.385853,"Trailing PS":1.6201525,"Quick Ratio":1.003,"Day High":41.685,"Day Low":41.15,"VS Average Volume":0.0799001415,"Company Summary":"Schlumberger Limited engages in the provision of technology for the energy industry worldwide. The company operates through four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company provides field development and hydrocarbon production, carbon management, and integration of adjacent energy systems; reservoir interpretation and data processing services for exploration data; and well construction and production improvement services and products. It also offers subsurface geology and fluids evaluation information; open and cased hole services; exploration and production pressure, and flow-rate measurement services; and pressure pumping, well stimulation, and coiled tubing equipment solutions. In addition, the company offers mud logging, directional drilling, measurement-while-drilling, and logging-while-drilling services, as well as engineering support services; supplies drilling fluid systems; designs, manufactures, and markets roller cone and fixed cutter drill bits; bottom-hole-assembly and borehole enlargement technologies; well cementing products and services; well planning, well drilling, engineering, supervision, logistics, procurement, and contracting of third parties, as well as drilling rig management solutions; and drilling equipment and services, as well as land drilling rigs and related services. Further, it provides artificial lift production equipment and optimization services; supplies packers, safety valves, sand control technology, and various intelligent well completions technology and equipment; designs and manufactures valves, chokes, actuators, and surface trees; and OneSubsea, an integrated solutions, products, systems, and services, including wellheads, subsea trees, manifolds and flowline connectors, control systems, connectors, and services. The company was formerly known as Socie´te´ de Prospection E´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"Huntington Bancshares Incorpora","Symbol":"HBAN","Current Price":"17.41","Latest MA":"15.26","Price Target":18.69526,"Difference from MA":"14.07%","Difference from Open":"1.31%","Change from Yesterday":"1.02%","Change from Last Report":"1.02","Latest Volume":"1,296,407","Market Cap":"25,300,604,928","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":11.208136,"PB Ratio":1.3884014,"ROE":0.08545,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.057,"Trailing PEG":2.9131,"Trailing PE":14.266394,"Trailing PS":3.7818544,"Quick Ratio":"N\/A","Day High":17.41,"Day Low":17.165,"VS Average Volume":0.0822926518,"Company Summary":"Huntington Bancshares Incorporated operates as the bank holding company for The Huntington National Bank that provides commercial, consumer, and mortgage banking services in the United States. The company offers financial products and services to consumer and business customers, including deposits, lending, payments, mortgage banking, dealer financing, investment management, trust, brokerage, insurance, and other financial products and services. It also provides 24-hour grace, asterisk-free checking, money scout, $50 safety zone, standby cash, early pay, instant access, savings goal getter, and Huntington heads up; digitally powered consumer and business financial solutions to consumer lending, regional banking, branch banking, and wealth management customers; direct and indirect consumer loans, as well as dealer finance loans and deposits; and private banking, wealth management and legacy planning through investment and portfolio management, fiduciary administration and trust, institutional custody, and full-service retail brokerage investment services. The company offers equipment financing, asset-based lending, distribution finance, structured lending, and municipal financing solutions, as well as Huntington ChoicePay. In addition, it offers lending, liquidity, treasury management and other payment services, and capital markets; government and non-profits, healthcare, technology and telecommunications, franchises, financial sponsors, and global services; and corporate risk management, institutional sales and trading, debt and equity issuance, and additional advisory services. The company offers its products through a network of channels, including branches and ATMs, online and mobile banking, and through customer call centers to customers in middle market banking, corporate, specialty, and government banking, asset finance, commercial real estate banking, and capital markets. The company was founded in 1866 and is headquartered in Columbus, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"First Horizon Corporation","Symbol":"FHN","Current Price":"21.91","Latest MA":"17.55","Price Target":23.2,"Difference from MA":"24.80%","Difference from Open":"2.99%","Change from Yesterday":"2.86%","Change from Last Report":"2.89","Latest Volume":"1,038,840","Market Cap":"11,478,220,800","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":11.625069,"PB Ratio":1.3562629,"ROE":0.08979,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.882,"Trailing PEG":null,"Trailing PE":16.106619,"Trailing PS":3.7376165,"Quick Ratio":"N\/A","Day High":21.95,"Day Low":21.2,"VS Average Volume":0.1678492517,"Company Summary":"First Horizon Corporation operates as the bank holding company for First Horizon Bank that provides various financial services. The company operates through Regional Banking and Specialty Banking segments. It offers general banking services for consumers, businesses, financial institutions, and governments. The company also accepts deposits; provides underwriting services for bank-eligible securities and other fixed-income securities by financial subsidiaries; sells loans and derivatives; financial planning; and offers investment and financial advisory services. In addition, it offers mortgage banking; loan syndications; brokerage services; commercial and business banking for business enterprises, consumer banking, and private client and wealth management services; capital markets, professional commercial real estate, mortgage warehouse and asset-based lending, franchise and equipment finance, tax credit finance, energy and healthcare finance, asset management, and corporate and correspondent banking services. Further, the company provides transaction processing services including check clearing services and remittance processing, credit cards, investment, and sale of mutual fund and retail insurances, as well as trust, fiduciary, and agency services. First Horizon Corporation was founded in 1864 and is headquartered in Memphis, Tennessee.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"Bank of America Corporation","Symbol":"BAC","Current Price":"47.23","Latest MA":"42.19","Price Target":52.02381,"Difference from MA":"11.95%","Difference from Open":"1.02%","Change from Yesterday":"0.85%","Change from Last Report":"0.30","Latest Volume":"2,797,679","Market Cap":"359,443,398,656","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.903741,"PB Ratio":1.3352097,"ROE":0.08092,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.325,"Trailing PEG":2.0753,"Trailing PE":14.712679,"Trailing PS":3.7985692,"Quick Ratio":"N\/A","Day High":47.23,"Day Low":46.68,"VS Average Volume":0.0781144318,"Company Summary":"Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. It operates in four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, non-interest and interest-bearing checking accounts, and investment accounts and products; credit and debit cards; residential mortgages, and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research, and certain market-based services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"Citigroup, Inc.","Symbol":"C","Current Price":"81.29","Latest MA":"65.57","Price Target":90.40579,"Difference from MA":"23.97%","Difference from Open":"1.77%","Change from Yesterday":"1.76%","Change from Last Report":"0.26","Latest Volume":"1,904,110","Market Cap":"152,589,467,648","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.78961,"PB Ratio":0.7976881,"ROE":0.03874,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.426,"Trailing PEG":0.8666,"Trailing PE":13.662186,"Trailing PS":2.2016141,"Quick Ratio":"N\/A","Day High":81.48,"Day Low":79.88,"VS Average Volume":0.1287257844,"Company Summary":"Citigroup Inc., a diversified financial service holding company, provides various financial product and services to consumers, corporations, governments, and institutions worldwide. It operates through five segments: Services, Markets, Banking, U.S. Personal Banking, and Wealth. The Services segment includes Treasury and Trade Solutions, which provides cash management, trade, and working capital solutions to multinational corporations, financial institutions, and public sector organizations; and Securities Services, such as cross-border support for clients, local market expertise, post-trade technologies, data solutions, and various securities services solutions. The Markets segment offers sales and trading services for equities, foreign exchange, rates, spread products, and commodities to corporate, institutional, and public sector clients; and market-making services, including asset classes, risk management solutions, financing, prime brokerage, research, securities clearing, and settlement. The banking segment includes investment banking; advisory services related to mergers and acquisitions, divestitures, restructurings, and corporate defense activities; and corporate lending, which includes corporate and commercial banking. The U.S. Personal Banking segment provides co-branded cards and retail banking services. The Wealth segment provides financial services to high-net-worth clients through banking, lending, mortgages, investment, custody, and trust product offerings; and to professional industries, including law firms, consulting groups, accounting, and asset management. The company was founded in 1812 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"Wells Fargo & Company","Symbol":"WFC","Current Price":"78.83","Latest MA":"63.44","Price Target":82.95238,"Difference from MA":"24.25%","Difference from Open":"1.38%","Change from Yesterday":"1.17%","Change from Last Report":"1.21","Latest Volume":"1,126,610","Market Cap":"259,250,683,904","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":11.524037,"PB Ratio":1.6015482,"ROE":0.099139996,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.136,"Trailing PEG":3.443,"Trailing PE":14.678771,"Trailing PS":3.3290615,"Quick Ratio":"N\/A","Day High":78.845,"Day Low":77.61,"VS Average Volume":0.0675836875,"Company Summary":"Wells Fargo & Company, a financial services company, provides diversified banking, investment, mortgage, and consumer and commercial finance products and services in the United States and internationally. The company operates through four segments: Consumer Banking and Lending; Commercial Banking; Corporate and Investment Banking; and Wealth and Investment Management. The Consumer Banking and Lending segment offers diversified financial products and services for consumers and small businesses. Its financial products and services include checking and savings accounts, and credit and debit cards, as well as home, auto, personal, and small business lending services. The Commercial Banking segment provides financial solutions to private, family owned, and certain public companies. Its products and services include banking and credit products across various industry sectors and municipalities, secured lending and lease products, and treasury management services. The Corporate and Investment Banking segment offers a suite of capital markets, banking, and financial products and services, such as corporate banking, investment banking, treasury management, commercial real estate lending and servicing, equity, and fixed income solutions, as well as sales, trading, and research capabilities services to corporate, commercial real estate, government, and institutional clients. The Wealth and Investment Management segment provides personalized wealth management, brokerage, financial planning, lending, private banking, and trust and fiduciary products and services to affluent, high-net worth, and ultra-high-net worth clients. It also operates through financial advisors in brokerage and wealth offices, consumer bank branches, independent offices, and digitally through WellsTrade and Intuitive Investor. The company was founded in 1852 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"JP Morgan Chase & Co.","Symbol":"JPM","Current Price":"270.15","Latest MA":"223.34","Price Target":264.1195,"Difference from MA":"20.96%","Difference from Open":"1.10%","Change from Yesterday":"1.12%","Change from Last Report":"1.13","Latest Volume":"1,099,515","Market Cap":"755,771,637,760","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.8352995,"PB Ratio":2.3460703,"ROE":0.16216,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.091,"Trailing PEG":7.2592,"Trailing PE":13.6854105,"Trailing PS":4.660999,"Quick Ratio":"N\/A","Day High":270.08,"Day Low":267.16,"VS Average Volume":0.1154845859,"Company Summary":"JPMorgan Chase & Co. operates as a financial services company worldwide. It operates through three segments: Consumer & Community Banking, Commercial & Investment Bank, and Asset & Wealth Management. It offers deposit, investment and lending products, cash management, and payments and services; mortgage origination and servicing activities; residential mortgages and home equity loans; and credit cards, auto loans, leases, and travel services to consumers and small businesses through bank branches, ATMs, and digital and telephone banking. The company also provides investment banking products and services, including corporate strategy and structure advisory, and equity and debt market capital-raising services, as well as loan origination and syndication; payments; and cash and derivative instruments, risk management solutions, prime brokerage, and research, as well as offers securities services, including custody, fund accounting and administration, and securities lending products for asset managers, insurance companies, and public and private investment funds. In addition, it provides financial solutions, including lending, payments, investment banking, and asset management to small and midsized companies, local governments, nonprofit clients, and large corporations, as well as investors, developers, and owners of multifamily, office, retail, industrial, and affordable housing properties. Further, the company offers multi-asset investment management solutions in equities, fixed income, alternatives, and money market funds to institutional clients and retail investors; and retirement products and services, brokerage, custody, estate planning, lending, deposits, and investment management products to high net worth clients. JPMorgan Chase & Co. was founded in 1799 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"Walgreens Boots Alliance, Inc.","Symbol":"WBA","Current Price":"11.27","Latest MA":"9.79","Price Target":12.414,"Difference from MA":"15.11%","Difference from Open":"3.58%","Change from Yesterday":"3.25%","Change from Last Report":"1.71","Latest Volume":"2,202,700","Market Cap":"9,739,004,928","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":7.6148133,"PB Ratio":0.9322525,"ROE":-0.75969005,"DTE":277.898,"Industry":"Pharmaceutical Retailers","Sector":"Healthcare","Beta":0.669,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.0659565,"Quick Ratio":0.332,"Day High":11.27,"Day Low":10.87,"VS Average Volume":0.0906523094,"Company Summary":"Walgreens Boots Alliance, Inc. operates as a healthcare, pharmacy, and retail company in the United States, Germany, the United Kingdom, and internationally. It operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The U.S. Retail Pharmacy segment engages in operation of the retail drugstores, health and wellness services, specialty, and home delivery pharmacy services, which offers health and wellness, beauty, personal care and consumables, and general merchandise. The International segment offers sale of prescription drugs and health and wellness, beauty, personal care, and other consumer products outside the United States; and operates pharmacy-led health and beauty retail businesses under the Boots brand stores in the United Kingdom, the Republic of Ireland, and Thailand, as well as the Benavides brand in Mexico and the Ahumada brand in Chile. The U.S. Healthcare segment provides VillageMD, a national provider of value-based care with primary, multi-specialty, and urgent care providers serving patients in traditional clinic settings, in patients' homes and online appointments; Shields, a specialty pharmacy integrator and accelerator for hospitals; and CareCentrix, a participant in the post-acute and home care management sectors. Walgreens Boots Alliance, Inc. was founded in 1909 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"Palantir Technologies Inc.","Symbol":"PLTR","Current Price":"78.55","Latest MA":"47.40","Price Target":49.245,"Difference from MA":"65.71%","Difference from Open":"-1.76%","Change from Yesterday":"-2.02%","Change from Last Report":"-0.07","Latest Volume":"11,248,229","Market Cap":"178,927,091,712","Earning Date":"2025-02-03","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":163.13919,"PB Ratio":39.62916,"ROE":0.12409,"DTE":5.552,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":2.697,"Trailing PEG":3.4392,"Trailing PE":392.72498,"Trailing PS":67.61309,"Quick Ratio":5.546,"Day High":80.8199,"Day Low":78.19,"VS Average Volume":0.1356074028,"Company Summary":"Palantir Technologies Inc. builds and deploys software platforms for the intelligence community to assist in counterterrorism investigations and operations in the United States, the United Kingdom, and internationally. The company provides Palantir Gotham, a software platform which enables users to identify patterns hidden deep within datasets, ranging from signals intelligence sources to reports from confidential informants, as well as facilitates the handoff between analysts and operational users, helping operators plan and execute real-world responses to threats that have been identified within the platform. It also offers Palantir Foundry, a platform that transforms the ways organizations operate by creating a central operating system for their data; and allows individual users to integrate and analyze the data they need in one place. In addition, it provides Palantir Apollo, a software that delivers software and updates across the business, as well as enables customers to deploy their software virtually in any environment; and Palantir Artificial Intelligence Platform (AIP) that provides unified access to open-source, self-hosted, and commercial large language models (LLM) that can transform structured and unstructured data into LLM-understandable objects and can turn organizations' actions and processes into tools for humans and LLM-driven agents. The company was incorporated in 2003 and is headquartered in Denver, Colorado.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"Exxon Mobil Corporation","Symbol":"XOM","Current Price":"108.38","Latest MA":"114.48","Price Target":129.47845,"Difference from MA":"-5.34%","Difference from Open":"0.62%","Change from Yesterday":"0.31%","Change from Last Report":"0.31","Latest Volume":"1,282,839","Market Cap":"476,317,876,224","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":13.707129,"PB Ratio":1.7733833,"ROE":0.14513999,"DTE":15.394,"Industry":"Oil & Gas Integrated","Sector":"Energy","Beta":0.88,"Trailing PEG":4.1421,"Trailing PE":13.496264,"Trailing PS":1.3853779,"Quick Ratio":0.978,"Day High":108.42,"Day Low":107.47,"VS Average Volume":0.0819673587,"Company Summary":"Exxon Mobil Corporation engages in the exploration and production of crude oil and natural gas in the United States and internationally. It operates through Upstream, Energy Products, Chemical Products, and Specialty Products segments. The Upstream segment explores for and produces crude oil and natural gas. The Energy Products segment offers fuels, aromatics, and catalysts, as well as licensing services. It sells its products under the Exxon, Esso, and Mobil brands. The Chemical Products segment manufactures and markets petrochemicals including olefins, polyolefins, and intermediates. The Specialty Products segment offers performance products, including lubricants, basestocks, waxes, synthetics, elastomers, and resins. The company also involves in the manufacturing, trade, transport, and sale of crude oil, natural gas, petroleum products, petrochemicals, and other specialty products; and pursuit lower-emission business opportunities, including carbon capture and storage, hydrogen, lower-emission fuels, and lithium. Exxon Mobil Corporation was founded in 1870 and is based in Spring, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"International Paper Company","Symbol":"IP","Current Price":"58.56","Latest MA":"50.34","Price Target":56.46,"Difference from MA":"16.33%","Difference from Open":"0.62%","Change from Yesterday":"-0.98%","Change from Last Report":"-0.12","Latest Volume":"1,619,094","Market Cap":"20,344,213,504","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":19.193079,"PB Ratio":2.3575828,"ROE":0.04797,"DTE":69.707,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":0.988,"Trailing PEG":0.5253,"Trailing PE":50.051285,"Trailing PS":1.0914278,"Quick Ratio":1.021,"Day High":58.975,"Day Low":58.09,"VS Average Volume":0.357890316,"Company Summary":"International Paper Company produces and sells renewable fiber-based packaging and pulp products in North America, Latin America, Europe, and North Africa. It operates through two segments, Industrial Packaging and Global Cellulose Fibers. The company offers linerboard, medium, whitetop, recycled linerboard, recycled medium and saturating kraft; and pulp for a range of applications, such as diapers, towel and tissue products, feminine care, incontinence, and other personal care products, as well as specialty pulps for use in textiles, construction materials, paints, coatings, and others. It sells its products directly to end users and converters, as well as through agents, resellers, and distributors. The company was founded in 1898 and is headquartered in Memphis, Tennessee.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"Intel Corporation","Symbol":"INTC","Current Price":"20.00","Latest MA":"23.49","Price Target":23.82824,"Difference from MA":"-14.82%","Difference from Open":"0.68%","Change from Yesterday":"1.11%","Change from Last Report":"0.81","Latest Volume":"13,049,790","Market Cap":"86,281,560,064","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":21.252523,"PB Ratio":0.8660547,"ROE":-0.15597,"DTE":47.906,"Industry":"Semiconductors","Sector":"Technology","Beta":1.026,"Trailing PEG":0.5876,"Trailing PE":"N\/A","Trailing PS":1.5905315,"Quick Ratio":0.833,"Day High":20.04,"Day Low":19.78,"VS Average Volume":0.1762988449,"Company Summary":"Intel Corporation designs, develops, manufactures, markets, and sells computing and related products and services worldwide. It operates through Client Computing Group, Data Center and AI, Network and Edge, Mobileye, and Intel Foundry Services segments. The company's products portfolio comprises central processing units and chipsets, system-on-chips (SoCs), and multichip packages; mobile and desktop processors; hardware products comprising graphics processing units (GPUs), domain-specific accelerators, and field programmable gate arrays (FPGAs); and memory and storage, connectivity and networking, and other semiconductor products. It also offers silicon devices and software products; and optimization solutions for workloads, such as AI, cryptography, security, storage, networking, and leverages various features supporting diverse compute environments. In addition, the company develops and deploys advanced driver assistance systems (ADAS), and autonomous driving technologies and solutions; and provides advanced process technologies backed by an ecosystem of IP, EDA, and design services, as well as systems of chips, including advanced packaging technologies, software and accelerate bring-up, and integration of chips and driving standards. Further, it delivers and deploys intelligent edge platforms that allow developers to achieve agility and drive automation using AI for efficient operations with data integrity, as well as provides hardware and software platforms, tools, and ecosystem partnerships for digital transformation from the cloud to edge. The company serves original equipment manufacturers, original design manufacturers, cloud service providers, and other manufacturers and service providers. It has a strategic agreement with Synopsys, Inc. to develop EDA and IP solutions; and ARM that enables chip designers to build optimized compute SoCs on the Intel 18A process. Intel Corporation was incorporated in 1968 and is headquartered in Santa Clara, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"Apple Inc.","Symbol":"AAPL","Current Price":"235.97","Latest MA":"229.37","Price Target":245.794,"Difference from MA":"2.88%","Difference from Open":"0.78%","Change from Yesterday":"-0.94%","Change from Last Report":"0.32","Latest Volume":"8,929,959","Market Cap":"3,548,493,119,488","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":28.490707,"PB Ratio":62.64136,"ROE":1.5741299,"DTE":209.059,"Industry":"Consumer Electronics","Sector":"Technology","Beta":1.24,"Trailing PEG":2.1712,"Trailing PE":38.810856,"Trailing PS":9.074617,"Quick Ratio":0.745,"Day High":236.29,"Day Low":234.01,"VS Average Volume":0.1798584554,"Company Summary":"Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod. It also provides AppleCare support and cloud services; and operates various platforms, including the App Store that allow customers to discover and download applications and digital content, such as books, music, video, games, and podcasts, as well as advertising services include third-party licensing arrangements and its own advertising platforms. In addition, the company offers various subscription-based services, such as Apple Arcade, a game subscription service; Apple Fitness+, a personalized fitness service; Apple Music, which offers users a curated listening experience with on-demand radio stations; Apple News+, a subscription news and magazine service; Apple TV+, which offers exclusive original content; Apple Card, a co-branded credit card; and Apple Pay, a cashless payment service, as well as licenses its intellectual property. The company serves consumers, and small and mid-sized businesses; and the education, enterprise, and government markets. It distributes third-party applications for its products through the App Store. The company also sells its products through its retail and online stores, and direct sales force; and third-party cellular network carriers, wholesalers, retailers, and resellers. Apple Inc. was founded in 1976 and is headquartered in Cupertino, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"Comcast Corporation","Symbol":"CMCSA","Current Price":"37.62","Latest MA":"39.58","Price Target":47.7025,"Difference from MA":"-4.96%","Difference from Open":"0.13%","Change from Yesterday":"0.20%","Change from Last Report":"-0.09","Latest Volume":"2,698,184","Market Cap":"143,954,804,736","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":8.659985,"PB Ratio":1.6817209,"ROE":0.16884,"DTE":117.127,"Industry":"Telecom Services","Sector":"Communication Services","Beta":1.004,"Trailing PEG":1.1651,"Trailing PE":10.140188,"Trailing PS":1.1696986,"Quick Ratio":0.605,"Day High":37.825,"Day Low":37.52,"VS Average Volume":0.1280970258,"Company Summary":"Comcast Corporation operates as a media and technology company worldwide. It operates through Residential Connectivity & Platforms, Business Services Connectivity, Media, Studios, and Theme Parks segments. The Residential Connectivity & Platforms segment provides residential broadband and wireless connectivity services, residential and business video services, sky-branded entertainment television networks, and advertising. The Business Services Connectivity segment offers connectivity services for small business locations, which include broadband, wireline voice, and wireless services, as well as solutions for medium-sized customers and larger enterprises; and small business connectivity services in the United Kingdom. The Media segment operates NBCUniversal's television and streaming business, including national and regional cable networks; the NBC and Telemundo broadcast networks and owned local broadcast television stations; and Peacock, a direct-to-consumer streaming services. It also operates international television networks comprising the Sky Sports networks, as well as other digital properties. The Studios segment operates NBCUniversal and Sky film and television studio production and distribution operations. The Theme Parks segment operates Universal theme parks in Orlando, Florida; Hollywood, California; Osaka, Japan; and Beijing, China. The company also offers a consolidated streaming platforms under the Philadelphia Flyers and the Wells Fargo Center arena in Philadelphia, Pennsylvania; and Xumo. Comcast Corporation was founded in 1963 and is headquartered in Philadelphia, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"29-01-2025 17:04:11"},{"Company Name":"Altria Group, Inc.","Symbol":"MO","Current Price":"52.96","Latest MA":"50.53","Price Target":56.58769,"Difference from MA":"4.80%","Difference from Open":"0.30%","Change from Yesterday":"0.70%","Change from Last Report":"0.68","Latest Volume":"1,108,683","Market Cap":"89,757,138,944","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":9.895403,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Tobacco","Sector":"Consumer Defensive","Beta":0.67,"Trailing PEG":3.6792,"Trailing PE":8.945946,"Trailing PS":4.4080706,"Quick Ratio":0.274,"Day High":53.11,"Day Low":52.74,"VS Average Volume":0.1388179297,"Company Summary":"Altria Group, Inc., through its subsidiaries, manufactures and sells smokeable and oral tobacco products in the United States. The company offers cigarettes primarily under the Marlboro brand; large cigars and pipe tobacco under the Black & Mild brand; moist smokeless tobacco and snus products under the Copenhagen, Skoal, Red Seal, and Husky brands; oral nicotine pouches under the on! brand; and e-vapor products under the NJOY ACE brand. It sells its products to distributors, as well as large retail organizations, such as chain stores. The company was founded in 1822 and is headquartered in Richmond, Virginia.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"29-01-2025 17:04:11"}]