[{"Company Name":"Danaher Corporation","Symbol":"DHR","Current Price":"239.86","Latest MA":"254.71","Price Target":286.9269,"Difference from MA":"-5.83%","Difference from Open":"2.44%","Change from Yesterday":"1.88%","Change from Last Report":"0.29","Latest Volume":"1,224,083","Market Cap":"173,244,891,136","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":28.726091,"ROE":0.07586,"DTE":36.69,"Industry":"Diagnostics & Research","Sector":"Healthcare","Beta":0.881,"Trailing PEG":3.1359,"Trailing PE":45.171375,"Trailing PS":7.29698,"Quick Ratio":0.916,"Day High":240.2301,"Day Low":233.7,"VS Average Volume":0.4158321429,"Company Summary":"Danaher Corporation designs, manufactures, and markets professional, medical, industrial, and commercial products and services worldwide. The Biotechnology segments offers bioprocess technologies, consumables, and services that advance, accelerate, and integrate the development and manufacture of therapeutics; cell line and cell culture media development services; cell culture media, process liquids and buffers for manufacturing, chromatography resins, filtration technologies, aseptic fill finish; single-use hardware and consumables and services, such as the design and installation of full manufacturing suites; lab filtration, separation, and purification; lab-scale protein purification and analytical tools; reagents, membranes, and services; and healthcare filtration solutions. The Life Sciences segment provides mass spectrometers; flow cytometry, genomics, lab automation, centrifugation, liquid handling automation instruments, antibodies and reagents, and particle counting and characterization; microscopes; protein consumables; industrial filtration products; and genomic medicines, such as custom nucleic acid products, plasmid DNA, RNA, and proteins under the ABCAM, ALDEVRON, BECKMAN COULTER, IDT, LEICA MICROSYSTEMS, MOLECULAR DEVICES, PALL, PHENOMENEX and SCIEX brands. The Diagnostics segment offers chemistry, immunoassay, microbiology, and automation systems; and molecular, acute care, and pathology diagnostics products. This segment also provides clinical instruments, reagents, consumables, software, and services for hospitals, physicians' offices, reference laboratories, and other critical care settings. The company has a research  collaboration  with Stanford  University's Department  of  Bioengineering for cancer drug development. The company was formerly known as Diversified Mortgage Investors, Inc. and changed its name to Danaher Corporation in 1984. Danaher Corporation was founded in 1969 and is based in Washington, the District of Columbia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-01-2025 18:53:06"},{"Company Name":"Tesla, Inc.","Symbol":"TSLA","Current Price":"407.36","Latest MA":"265.64","Price Target":288.0919,"Difference from MA":"53.35%","Difference from Open":"-3.77%","Change from Yesterday":"-0.45%","Change from Last Report":"-0.53","Latest Volume":"46,313,734","Market Cap":"1,307,653,963,776","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":125.60781,"ROE":0.20389,"DTE":18.078,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":2.295,"Trailing PEG":4.9787,"Trailing PE":111.605804,"Trailing PS":13.460154,"Quick Ratio":1.214,"Day High":426.43,"Day Low":406.88,"VS Average Volume":0.4983486631,"Company Summary":"Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners; and provision of service and repairs to its energy product customers, including under warranty, as well as various financing options to its solar customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was incorporated in 2003 and is headquartered in Austin, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"06-01-2025 18:53:06"},{"Company Name":"Nextracker Inc.","Symbol":"NXT","Current Price":"42.65","Latest MA":"41.18","Price Target":53.37367,"Difference from MA":"3.56%","Difference from Open":"5.04%","Change from Yesterday":"7.87%","Change from Last Report":"-0.05","Latest Volume":"1,056,059","Market Cap":"6,289,114,624","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":12.710209,"ROE":0.60612,"DTE":11.396,"Industry":"Solar","Sector":"Technology","Beta":"N\/A","Trailing PEG":2.5078,"Trailing PE":10.662625,"Trailing PS":2.2441623,"Quick Ratio":1.794,"Day High":42.76,"Day Low":40.46,"VS Average Volume":0.4152347243,"Company Summary":"Nextracker Inc., an energy solutions company, provides solar tracker and software solutions for utility-scale and distributed generation solar projects in the United States and internationally. The company offers tracking solutions, which includes NX Horizon, a solar tracking solution; and NX Horizon-XTR, a terrain-following tracker designed to expand the addressable market for trackers on sites with sloped, uneven, and challenging terrain. It also provides TrueCapture, a self-adjusting tracker control system, which boosts solar power plant production by optimizing the position of individual tracker row in response to site features, such as varying topography and changing weather conditions; and NX Navigator, that assists solar power plant owners and operators in monitoring, controlling, and protecting their solar projects. The company was founded in 2013 and is headquartered in Fremont, California. As of March 31, 2024 Nextracker Inc. was formerly a subsidiary of Flex Ltd.","Stock Sentiment":"N\/A","Row Color":"positive-row","Last Updated":"06-01-2025 18:53:06"},{"Company Name":"QUALCOMM Incorporated","Symbol":"QCOM","Current Price":"164.62","Latest MA":"173.66","Price Target":204.70387,"Difference from MA":"-5.21%","Difference from Open":"3.25%","Change from Yesterday":"4.44%","Change from Last Report":"0.05","Latest Volume":"2,986,117","Market Cap":"182,887,284,736","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":13.450225,"ROE":0.42253,"DTE":58.765,"Industry":"Semiconductors","Sector":"Technology","Beta":1.286,"Trailing PEG":1.5589,"Trailing PE":18.433931,"Trailing PS":4.693991,"Quick Ratio":1.64,"Day High":164.82,"Day Low":159.41,"VS Average Volume":0.3726388247,"Company Summary":"QUALCOMM Incorporated engages in the development and commercialization of foundational technologies for the wireless industry worldwide. It operates through three segments: Qualcomm CDMA Technologies (QCT); Qualcomm Technology Licensing (QTL); and Qualcomm Strategic Initiatives (QSI). The QCT segment develops and supplies integrated circuits and system software with advanced connectivity and high-performance, and low-power computing technologies for use in mobile devices; automotive systems for connectivity, digital cockpit, and ADAS\/AD; and IoT, including consumer electronic devices, industrial devices, and edge networking products. The QTL segment grants licenses or provides rights to use portions of its intellectual property portfolio, which include various patent rights useful in the manufacture and sale of wireless products comprising products implementing CDMA2000, WCDMA, LTE and\/or OFDMA-based 5G products. The QSI segment invests in early-stage companies in various industries, including 5G, artificial intelligence, automotive, consumer, enterprise, cloud, IoT, and extended reality, and investments, including non-marketable equity securities and, to a lesser extent, marketable equity securities, and convertible debt instruments. It also provides development, and other services and sells related products to the United States government agencies and their contractors. The company was incorporated in 1985 and is headquartered in San Diego, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-01-2025 18:53:06"},{"Company Name":"Flagstar Financial, Inc.","Symbol":"FLG","Current Price":"9.82","Latest MA":"10.56","Price Target":12.18333,"Difference from MA":"-6.95%","Difference from Open":"1.39%","Change from Yesterday":"3.03%","Change from Last Report":"-0.30","Latest Volume":"1,367,450","Market Cap":"4,078,504,960","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":-25.838943,"ROE":-0.37158,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.0,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":2.8580973,"Quick Ratio":"N\/A","Day High":9.87,"Day Low":9.51,"VS Average Volume":0.2209769851,"Company Summary":"Flagstar Financial, Inc. operates as the bank holding company for Flagstar Bank, N.A. that provides banking products and services in the United States. The company's deposit products include interest-bearing checking and money market, savings, non-interest-bearing, and retirement accounts, as well as certificates of deposit. Its loan products comprise multi-family loans; commercial real estate loans; acquisition, development, and construction loans; commercial and industrial loans; one-to-four family loans; specialty finance loans and leases; warehouse loans; and other loans, such as home equity lines of credit, boat and recreational vehicle indirect lending, point of sale consumer loans, and other consumer loans, including overdraft loans. The company offers cash management products; non-deposit investment and insurance products; and online banking, mobile banking, and bank-by-phone services. It primarily serves individuals, small and mid-size businesses, and professional associations. The company was formerly known as New York Community Bancorp, Inc. and changed its name to Flagstar Financial, Inc. in October 2024. Flagstar Financial, Inc. was founded in 1859 and is headquartered in Hicksville, New York.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"06-01-2025 18:53:06"},{"Company Name":"Microsoft Corporation","Symbol":"MSFT","Current Price":"431.53","Latest MA":"427.87","Price Target":507.41183,"Difference from MA":"0.86%","Difference from Open":"0.81%","Change from Yesterday":"1.89%","Change from Last Report":"-0.03","Latest Volume":"7,854,031","Market Cap":"3,208,373,862,400","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":28.730684,"ROE":0.35604,"DTE":33.657,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.904,"Trailing PEG":2.2223,"Trailing PE":35.634186,"Trailing PS":12.621952,"Quick Ratio":1.163,"Day High":434.32,"Day Low":426.77,"VS Average Volume":0.3780741995,"Company Summary":"Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services. This segment also provides LinkedIn; and dynamics business solutions, including Dynamics 365, a set of intelligent, cloud-based applications across ERP, CRM, power apps, and power automate; and on-premises ERP and CRM applications. The Intelligent Cloud segment offers server products and cloud services, such as azure and other cloud services; SQL and windows server, visual studio, system center, and related client access licenses, as well as nuance and GitHub; and enterprise services including enterprise support services, industry solutions, and nuance professional services. The More Personal Computing segment offers Windows, including windows OEM licensing and other non-volume licensing of the Windows operating system; Windows commercial comprising volume licensing of the Windows operating system, windows cloud services, and other Windows commercial offerings; patent licensing; and windows Internet of Things; and devices, such as surface, HoloLens, and PC accessories. Additionally, this segment provides gaming, which includes Xbox hardware and content, and first- and third-party content; Xbox game pass and other subscriptions, cloud gaming, advertising, third-party disc royalties, and other cloud services; and search and news advertising, which includes Bing, Microsoft News and Edge, and third-party affiliates. The company sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online, and retail stores. The company was founded in 1975 and is headquartered in Redmond, Washington.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"06-01-2025 18:53:06"},{"Company Name":"Mastercard Incorporated","Symbol":"MA","Current Price":"517.63","Latest MA":"486.03","Price Target":564.63513,"Difference from MA":"6.50%","Difference from Open":"-0.64%","Change from Yesterday":"-0.75%","Change from Last Report":"-0.11","Latest Volume":"1,112,168","Market Cap":"475,096,842,240","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":31.611416,"ROE":1.7757801,"DTE":244.839,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.101,"Trailing PEG":2.0014,"Trailing PE":39.095924,"Trailing PS":17.450115,"Quick Ratio":0.891,"Day High":521.36,"Day Low":516.0,"VS Average Volume":0.4461981198,"Company Summary":"Mastercard Incorporated, a technology company, provides transaction processing and other payment-related products and services in the United States and internationally. The company offers integrated products and value-added services for account holders, merchants, financial institutions, digital partners, businesses, governments, and other organizations, such as programs that enable issuers to provide consumers with credits to defer payments; payment products and solutions that allow its customers to access funds in deposit and other accounts; prepaid programs services; and commercial credit, debit, and prepaid payment products and solutions. It also provides solutions that enable businesses or governments to make payments to businesses, including Virtual Card Number, which is generated dynamically from a physical card and leverages the credit limit of the funding account; a platform to optimize supplier payment enablement campaigns for financial institutions; and treasury intelligence platform that offers corporations with recommendations to enhance working capital performance and accelerate spend on cards. In addition, the company offers Mastercard Send, which partners with digital messaging and payment platforms to enable consumers to send money directly within applications to other consumers; and Mastercard Cross-Border Services enables a range of payment flows through a distribution network with a single point of access to send and receive money globally through various channels, including bank accounts, mobile wallets, cards, and cash payouts. Further, it provides cyber and intelligence solutions; insights and analytics, consulting, marketing, loyalty, processing, and payment gateway solutions for e-commerce merchants; and open banking and digital identity services. The company offers payment solutions and services under the MasterCard, Maestro, and Cirrus name. Mastercard Incorporated was founded in 1966 and is headquartered in Purchase, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-01-2025 18:53:06"},{"Company Name":"Dynatrace, Inc.","Symbol":"DT","Current Price":"53.09","Latest MA":"50.40","Price Target":62.21379,"Difference from MA":"5.33%","Difference from Open":"-2.89%","Change from Yesterday":"-3.03%","Change from Last Report":"-0.08","Latest Volume":"1,265,222","Market Cap":"15,846,515,712","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":35.37046,"ROE":0.08276,"DTE":3.76,"Industry":"Software - Application","Sector":"Technology","Beta":1.053,"Trailing PEG":1.2263,"Trailing PE":98.31481,"Trailing PS":10.136625,"Quick Ratio":1.249,"Day High":54.67,"Day Low":52.59,"VS Average Volume":0.4402096631,"Company Summary":"Dynatrace, Inc. provides a security platform for multicloud environments in North America, Europe, the Middle East, Africa, the Asia Pacific, and Latin America. The company operates Dynatrace, a security platform, which provides application and microservices monitoring, runtime application security, infrastructure monitoring, log management and analytics, digital experience monitoring, digital business analytics, and cloud automation. Its platform allows its customers to modernize and automate IT operations, delivers software, and enhance user experiences. In addition, the company offers implementation, consulting, and training services. It markets its products through a combination of direct sales team and a network of partners, including resellers, system integrators, and managed service providers. It serves customers in various industries comprising banking, financial services, government, insurance, retail and wholesale, transportation, and software. Dynatrace, Inc. was founded in 2005 and is headquartered in Waltham, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-01-2025 18:53:06"},{"Company Name":"Alibaba Group Holding Limited","Symbol":"BABA","Current Price":"86.02","Latest MA":"86.45","Price Target":120.97289,"Difference from MA":"-0.50%","Difference from Open":"-0.61%","Change from Yesterday":"0.54%","Change from Last Report":"-0.12","Latest Volume":"8,617,954","Market Cap":"204,769,869,824","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":1.2154559,"ROE":0.05668,"DTE":22.796,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":0.349,"Trailing PEG":0.5664,"Trailing PE":17.847157,"Trailing PS":0.21549097,"Quick Ratio":0.97,"Day High":87.3601,"Day Low":85.87,"VS Average Volume":0.5403246542,"Company Summary":"Alibaba Group Holding Limited, through its subsidiaries, provides technology infrastructure and marketing reach to help merchants, brands, retailers, and other businesses to engage with their users and customers in the People's Republic of China and internationally. The company operates through seven segments: China Commerce, International Commerce, Local Consumer Services, Cainiao, Cloud, Digital Media and Entertainment, and Innovation Initiatives and Others. It operates Taobao and Tmall, which are digital retail platforms; Alimama, a proprietary monetization platform; 1688.com and Alibaba.com, which are online wholesale marketplaces; AliExpress, a retail marketplace; Lazada, Trendyol, and Daraz that are e-commerce platforms; Freshippo, a retail platform for groceries and fresh goods; and Tmall Global, an import e-commerce platform. The company also operates Cainiao Network logistic services platform; Ele.me, an on-demand delivery and local services platform; Koubei, a restaurant and local services guide platform; and Fliggy, an online travel platform. In addition, it offers pay-for-performance, in-feed, and display marketing services; and Taobao Ad Network and Exchange, a real-time online bidding marketing exchange. Further, the company provides elastic computing, storage, network, security, database, big data, and IoT services; and hardware, software license, software installation, and application development and maintenance services. Additionally, it operates Youku, an online video platform; Quark, a platform for information search, storage, and consumption; Alibaba Pictures and other content platforms that provide online videos, films, live events, news feeds, literature, music, and others; Amap, a mobile digital map, navigation, and real-time traffic information app; DingTalk, a business efficiency mobile app; and Tmall Genie smart speaker. The company was incorporated in 1999 and is based in Hangzhou, the People's Republic of China.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-01-2025 18:53:06"},{"Company Name":"Boeing Company (The)","Symbol":"BA","Current Price":"171.24","Latest MA":"166.63","Price Target":185.505,"Difference from MA":"2.76%","Difference from Open":"-1.30%","Change from Yesterday":"0.79%","Change from Last Report":"-0.06","Latest Volume":"4,510,664","Market Cap":"128,117,661,696","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":245.09076,"ROE":"N\/A","DTE":"N\/A","Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.572,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":1.7480205,"Quick Ratio":0.238,"Day High":173.9442,"Day Low":170.19,"VS Average Volume":0.332659778,"Company Summary":"The Boeing Company, together with its subsidiaries, designs, develops, manufactures, sells, services, and supports commercial jetliners, military aircraft, satellites, missile defense, human space flight and launch systems, and services worldwide. The company operates through Commercial Airplanes; Defense, Space & Security; and Global Services segments. The Commercial Airplanes segment develops, produces, and markets commercial jet aircraft for passenger and cargo requirements, as well as provides fleet support services. The Defense, Space & Security segment engages in the research, development, production, and modification of manned and unmanned military aircraft and weapons systems; strategic defense and intelligence systems, which include strategic missile and defense systems, command, control, communications, computers, intelligence, surveillance and reconnaissance, cyber and information solutions, and intelligence systems; and satellite systems, such as government and commercial satellites, and space exploration. The Global Services segment offers products and services, including supply chain and logistics management, engineering, maintenance and modifications, upgrades and conversions, spare parts, pilot and maintenance training systems and services, technical and maintenance documents, and data analytics and digital services to commercial and defense customers. The Boeing Company was incorporated in 1916 and is based in Arlington, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-01-2025 18:53:06"},{"Company Name":"Meta Platforms, Inc.","Symbol":"META","Current Price":"621.00","Latest MA":"544.91","Price Target":656.5144,"Difference from MA":"13.96%","Difference from Open":"1.47%","Change from Yesterday":"2.82%","Change from Last Report":"-0.29","Latest Volume":"5,519,809","Market Cap":"1,567,720,865,792","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":24.428118,"ROE":0.36134,"DTE":29.811,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.215,"Trailing PEG":1.3498,"Trailing PE":29.348063,"Trailing PS":10.034891,"Quick Ratio":2.568,"Day High":623.9,"Day Low":605.62,"VS Average Volume":0.4603066816,"Company Summary":"Meta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and wearables worldwide. It operates in two segments, Family of Apps and Reality Labs. The Family of Apps segment offers Facebook, which enables people to share, discuss, discover, and connect with interests; Instagram, a community for sharing photos, videos, and private messages, as well as feed, stories, reels, video, live, and shops; Messenger, a messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls; and WhatsApp, a messaging application that is used by people and businesses to communicate and transact privately. The Reality Labs segment provides augmented and virtual reality related products comprising consumer hardware, software, and content that help people feel connected, anytime, and anywhere. The company was formerly known as Facebook, Inc. and changed its name to Meta Platforms, Inc. in October 2021. The company was incorporated in 2004 and is headquartered in Menlo Park, California","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"06-01-2025 18:53:06"},{"Company Name":"T-Mobile US, Inc.","Symbol":"TMUS","Current Price":"210.57","Latest MA":"205.25","Price Target":244.49077,"Difference from MA":"2.59%","Difference from Open":"-1.33%","Change from Yesterday":"-3.91%","Change from Last Report":"0.28","Latest Volume":"2,530,317","Market Cap":"244,370,178,048","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":19.441107,"ROE":0.16087,"DTE":182.272,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.496,"Trailing PEG":0.8771,"Trailing PE":24.03824,"Trailing PS":3.0543983,"Quick Ratio":0.862,"Day High":215.0,"Day Low":208.39,"VS Average Volume":0.7056134136,"Company Summary":"T-Mobile US, Inc., together with its subsidiaries, provides mobile communications services in the United States, Puerto Rico, and the United States Virgin Islands. The company offers voice, messaging, and data services to customers in the postpaid, prepaid, and wholesale and other services. It also provides wireless devices, including smartphones, wearables, tablets, home broadband routers, and other mobile communication devices, as well as wireless devices and accessories; financing through equipment installment plans; reinsurance for device insurance policies and extended warranty contracts; leasing through JUMP! On Demand; and High Speed Internet services. In addition, the company offers services, devices, and accessories under the T-Mobile and Metro by T-Mobile brands through its owned and operated retail stores, T-Mobile app and customer care channels, and its websites. It also sells its devices to dealers and other third-party distributors for resale through independent third-party retail outlets and various third-party websites. The company was founded in 1994 and is headquartered in Bellevue, Washington. T-Mobile US, Inc. operate as a subsidiary Deutsche Telekom AG","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-01-2025 18:53:06"},{"Company Name":"SiriusXM Holdings Inc.","Symbol":"SIRI","Current Price":"23.14","Latest MA":"27.67","Price Target":25.53846,"Difference from MA":"-16.37%","Difference from Open":"1.71%","Change from Yesterday":"3.51%","Change from Last Report":"0.09","Latest Volume":"1,829,188","Market Cap":"7,849,133,568","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.1490583,"ROE":-0.46799,"DTE":98.775,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.05,"Trailing PEG":0.1896,"Trailing PE":"N\/A","Trailing PS":0.8920484,"Quick Ratio":0.26,"Day High":23.3,"Day Low":22.64,"VS Average Volume":0.2985754242,"Company Summary":"Sirius XM Holdings Inc. operates as an audio entertainment company in North America. It operates in two segments, Sirius XM, and Pandora and Off-platform. The company's Sirius XM segment provides music, sports, entertainment, comedy, talk, news, traffic and weather channels, and other content, as well as podcast and infotainment services on subscription fee basis; and live, curated, and exclusive and on demand programming services through satellite radio systems and streamed through applications for mobile and home devices, and other consumer electronic equipment. This segment also distributes satellite radios through automakers and retailers, as well as its website; podcasts, including true crime, news, politics, music, comedy, sports, and entertainment; and offers location-based services through two-way wireless connectivity, including safety, security, convenience, maintenance and data, remote vehicles diagnostic, and stolen or parked vehicle locator services. In addition, this segment provides music channels on the DISH Network satellite television service as a programming package; Travel Link, a suite of data services that include graphical weather, fuel prices, sports schedule and scores, and movie listings; graphic information related to road closings, traffic flow, and incident data for consumers with in-vehicle navigation systems; real-time weather services in vehicles, boats, and planes; and music programming and commercial-free music services for office, restaurants, and other business. Its Pandora and Off-platform segment operates music, comedy, and podcast streaming platform, which offers personalized experience for listener through computers, tablets, mobile devices, vehicle speakers, and connected devices; and provides advertising services. The company was incorporated in 2013 and is headquartered in New York.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"06-01-2025 18:53:06"},{"Company Name":"Mondelez International, Inc.","Symbol":"MDLZ","Current Price":"59.17","Latest MA":"67.07","Price Target":78.1244,"Difference from MA":"-11.77%","Difference from Open":"-0.70%","Change from Yesterday":"-1.21%","Change from Last Report":"0.22","Latest Volume":"2,979,304","Market Cap":"79,121,530,880","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":17.419746,"ROE":0.13552,"DTE":73.232,"Industry":"Confectioners","Sector":"Consumer Defensive","Beta":0.561,"Trailing PEG":4.7291,"Trailing PE":20.98227,"Trailing PS":2.18864,"Quick Ratio":0.295,"Day High":59.685,"Day Low":58.96,"VS Average Volume":0.3848343463,"Company Summary":"Mondelez International, Inc., through its subsidiaries, manufactures, markets, and sells snack food and beverage products in the Latin America, North America, Asia, the Middle East, Africa, and Europe. It provides biscuits and baked snacks, including cookies, crackers, salted snacks, snack bars, and cakes and pastries; chocolates; and gums and candies, as well as various cheese and grocery, and powdered beverage products. The company's brand portfolio includes Oreo, Ritz, LU, CLIF Bar, and Tate's Bake Shop biscuits and baked snacks, as well as Cadbury Dairy Milk, Milka, and Toblerone chocolate. It serves supermarket chains, wholesalers, supercenters, club stores, mass merchandisers, distributors, convenience stores, gasoline stations, drug stores, value stores, and other retail food outlets through direct store delivery, company-owned and satellite warehouses, distribution centers, third party distributors, and other facilities, as well as through independent sales offices and agents. The company also sells products directly to businesses and consumers through e-retail platforms, retailer digital platforms, as well as through its direct-to-consumer websites and social media platforms. Mondelez International, Inc. was formerly known as Kraft Foods Inc. and changed its name to Mondelez International, Inc. in October 2012. The company was incorporated in 2000 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"06-01-2025 18:53:06"},{"Company Name":"General Motors Company","Symbol":"GM","Current Price":"54.05","Latest MA":"48.95","Price Target":59.20692,"Difference from MA":"10.43%","Difference from Open":"2.45%","Change from Yesterday":"4.25%","Change from Last Report":"-0.41","Latest Volume":"3,918,487","Market Cap":"59,438,878,720","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":5.1220555,"ROE":0.14167,"DTE":174.581,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":1.414,"Trailing PEG":8.0601,"Trailing PE":5.7689433,"Trailing PS":0.32530212,"Quick Ratio":0.948,"Day High":54.395,"Day Low":52.29,"VS Average Volume":0.3265024642,"Company Summary":"General Motors Company designs, builds, and sells trucks, crossovers, cars, and automobile parts; and provide software-enabled services and subscriptions worldwide. The company operates through GM North America, GM International, Cruise, and GM Financial segments. It markets its vehicles primarily under the Buick, Cadillac, Chevrolet, GMC, Baojun, and Wuling brand names. In addition, the company sells trucks, crossovers, cars, and automobile parts through retail dealers, and distributors and dealers, as well as to fleet customers, including daily rental car companies, commercial fleet customers, leasing companies, and governments. Further, it offers range of after-sale services through dealer network, such as maintenance, light repairs, collision repairs, vehicle accessories, and extended service warranties. Additionally, the company provides automotive financing; and software-enabled services and subscriptions. General Motors Company was founded in 1908 and is headquartered in Detroit, Michigan.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-01-2025 18:53:06"},{"Company Name":"Starbucks Corporation","Symbol":"SBUX","Current Price":"94.16","Latest MA":"89.75","Price Target":103.304,"Difference from MA":"4.91%","Difference from Open":"2.20%","Change from Yesterday":"1.74%","Change from Last Report":"0.05","Latest Volume":"2,048,888","Market Cap":"106,758,602,752","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":25.206598,"ROE":"N\/A","DTE":"N\/A","Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":0.962,"Trailing PEG":1.8732,"Trailing PE":28.447132,"Trailing PS":2.951073,"Quick Ratio":0.524,"Day High":94.28,"Day Low":91.94,"VS Average Volume":0.2595914398,"Company Summary":"Starbucks Corporation, together with its subsidiaries, operates as a roaster, marketer, and retailer of coffee worldwide. The company operates through three segments: North America, International, and Channel Development. Its stores offer coffee, tea, and other beverages, roasted whole beans and ground coffees, single serve products, and ready-to-drink beverages; and various food products, such as pastries, breakfast sandwiches, and lunch items. The company also licenses its trademarks through licensed stores, and grocery and foodservice accounts. The company offers its products under the Starbucks Coffee, Teavana, Seattle's Best Coffee, Ethos, and Starbucks Reserve brands. Starbucks Corporation was founded in 1971 and is based in Seattle, Washington.","Stock Sentiment":"N\/A","Row Color":"positive-row","Last Updated":"06-01-2025 18:53:06"},{"Company Name":"SoFi Technologies, Inc.","Symbol":"SOFI","Current Price":"15.22","Latest MA":"9.78","Price Target":12.1,"Difference from MA":"55.56%","Difference from Open":"0.13%","Change from Yesterday":"2.97%","Change from Last Report":"-0.36","Latest Volume":"16,745,652","Market Cap":"16,516,090,880","Earning Date":"2025-01-27","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":62.763298,"ROE":0.037249997,"DTE":54.394,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.613,"Trailing PEG":null,"Trailing PE":126.834175,"Trailing PS":6.556057,"Quick Ratio":0.47,"Day High":15.4189,"Day Low":14.89,"VS Average Volume":0.3129598457,"Company Summary":"SoFi Technologies, Inc. provides various financial services in the United States, Latin America, and Canada. It operates through three segments: Lending, Technology Platform, and Financial Services. The company offers lending and financial services and products that allows its members to borrow, save, spend, invest, and protect money. It offers personal loans, student loans, home loans, and related services. The company also operates Galileo, a technology platform that offers services to financial and non-financial institution; and Technisys, a cloud-native digital and core banking platform with financial services customers. In addition, it provides SoFi Money offers checking and savings accounts, debit cards, and cash management products; and SoFi Invest, a mobile-first investment platform that provides access to trading and advisory solutions, such as investing and robo-advisory. Further, the company offers SoFi Credit Card that provides cash backs on every purchase; Sofi Relay, a personal finance management product that allows to track all of their financial accounts comprising credit score and spending behaviors; SoFi Protect, which offers insurance product; SoFi Travel, an application that manages travel search and booking experience; SoFi At Work provides financial benefits to employees, including student loan payments made on their employees' behalf; Lantern Credit, a financial services marketplace platform for seeking alternative products and provide product comparisons; and other lending as a service that offers pre-qualified borrower referrals and sells loans to third-party partner. The company was founded in 2011 and is based in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"06-01-2025 18:53:06"},{"Company Name":"AT&T Inc.","Symbol":"T","Current Price":"22.67","Latest MA":"20.66","Price Target":25.91885,"Difference from MA":"9.74%","Difference from Open":"-0.37%","Change from Yesterday":"-0.07%","Change from Last Report":"0.03","Latest Volume":"14,120,436","Market Cap":"162,663,825,408","Earning Date":"2025-01-27","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":10.389979,"ROE":0.08759,"DTE":125.151,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.73,"Trailing PEG":1.7449,"Trailing PE":18.430895,"Trailing PS":1.3326547,"Quick Ratio":0.42,"Day High":22.77,"Day Low":22.53,"VS Average Volume":0.4193661465,"Company Summary":"AT&T Inc. provides telecommunications and technology services worldwide. The company operates through two segments, Communications and Latin America. The Communications segment offers wireless voice and data communications services; and sells handsets, wireless data cards, wireless computing devices, carrying cases\/protective covers, and wireless chargers through its own company-owned stores, agents, and third-party retail stores. It also provides Virtual Private Networks, AT&T Dedicated Internet, Ethernet, data services, cloud solutions, outsourcing, and managed professional services, as well as customer premises equipment for multinational corporations, small and mid-sized businesses, governmental, and wholesale customers. In addition, this segment offers broadband services, including fiber connections, legacy telephony voice communication services, and other VoIP services and equipment to residential customers. This segment markets its communications services and products under the AT&T, AT&T Business, Cricket, AT&T PREPAID, and AT&T Fiber brand names. The Latin America segment provides postpaid and prepaid wireless services in Mexico under the AT&T and Unefon brand names, as well as sells smartphones through its owned stores, agents and third-party retail stores. The company was formerly known as SBC Communications Inc. and changed its name to AT&T Inc. in 2005. AT&T Inc. was incorporated in 1983 and is based in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-01-2025 18:53:06"},{"Company Name":"Verizon Communications Inc.","Symbol":"VZ","Current Price":"39.89","Latest MA":"41.26","Price Target":47.49583,"Difference from MA":"-3.32%","Difference from Open":"-0.99%","Change from Yesterday":"-0.97%","Change from Last Report":"-0.05","Latest Volume":"10,611,158","Market Cap":"167,922,139,136","Earning Date":"2025-01-24","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":8.436722,"ROE":0.10431,"DTE":182.615,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.418,"Trailing PEG":1.0684,"Trailing PE":17.268398,"Trailing PS":1.2509378,"Quick Ratio":0.51,"Day High":40.33,"Day Low":39.76,"VS Average Volume":0.6116996789,"Company Summary":"Verizon Communications Inc., through its subsidiaries, engages in the provision of communications, technology, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide. It operates in two segments, Verizon Consumer Group (Consumer) and Verizon Business Group (Business). The Consumer segment provides wireless services across the wireless networks in the United States under the Verizon and TracFone brands and through wholesale and other arrangements; and fixed wireless access (FWA) broadband through its wireless networks, as well as related equipment and devices, such as smartphones, tablets, smart watches, and other wireless-enabled connected devices. The segment also offers wireline services in the Mid-Atlantic and Northeastern United States, as well as Washington D.C. through its fiber-optic network, Verizon Fios product portfolio, and a copper-based network. The Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and conferencing, corporate networking, security and managed network, local and long-distance voice, and network access services to deliver various IoT services and products to businesses, government customers, and wireless and wireline carriers in the United States and internationally. The company was formerly known as Bell Atlantic Corporation and changed its name to Verizon Communications Inc. in June 2000. Verizon Communications Inc. was incorporated in 1983 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-01-2025 18:53:06"},{"Company Name":"NextEra Energy, Inc.","Symbol":"NEE","Current Price":"71.61","Latest MA":"77.04","Price Target":86.64545,"Difference from MA":"-7.05%","Difference from Open":"-0.26%","Change from Yesterday":"-0.54%","Change from Last Report":"0.13","Latest Volume":"2,134,606","Market Cap":"147,258,802,176","Earning Date":"2025-01-24","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":19.467228,"ROE":0.09887999,"DTE":139.015,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.561,"Trailing PEG":2.9317,"Trailing PE":21.24926,"Trailing PS":5.610714,"Quick Ratio":0.258,"Day High":71.93,"Day Low":70.84,"VS Average Volume":0.2097489662,"Company Summary":"NextEra Energy, Inc., through its subsidiaries, generates, transmits, distributes, and sells electric power to retail and wholesale customers in North America. The company generates electricity through wind, solar, nuclear,natural gas, and other clean energy. It also develops, constructs, and operates long-term contracted assets that consists of clean energy solutions, such as renewable generation facilities, battery storage projects, and electric transmission facilities; sells energy commodities; and owns, develops, constructs, manages and operates electric generation facilities in wholesale energy markets. The company had approximately 33,276 megawatts of net generating capacity; approximately 90,000 circuit miles of transmission and distribution lines; and 883 substations. It serves approximately 12 million people through approximately 5.9 million customer accounts in the east and lower west coasts of Florida. The company was formerly known as FPL Group, Inc. and changed its name to NextEra Energy, Inc. in 2010. NextEra Energy, Inc. was founded in 1925 and is headquartered in Juno Beach, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-01-2025 18:53:06"},{"Company Name":"Mobileye Global Inc.","Symbol":"MBLY","Current Price":"21.80","Latest MA":"18.15","Price Target":20.22852,"Difference from MA":"20.11%","Difference from Open":"-0.91%","Change from Yesterday":"0.09%","Change from Last Report":"-0.34","Latest Volume":"4,203,634","Market Cap":"17,680,844,800","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":51.82086,"ROE":-0.21936001,"DTE":0.439,"Industry":"Auto Parts","Sector":"Consumer Cyclical","Beta":0.059,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":9.817238,"Quick Ratio":4.215,"Day High":22.37,"Day Low":21.66,"VS Average Volume":0.6387088207,"Company Summary":"Mobileye Global Inc. develops and deploys advanced driver assistance systems (ADAS) and autonomous driving technologies and solutions worldwide. The company operates through Mobileye and Other segments. It offers Driver Assist comprising ADAS and autonomous vehicle solutions that covers safety features, such as real-time detection of road users, geometry, semantics, and markings to provide safety alerts and emergency interventions; Cloud-Enhanced Driver Assist, a solution for drivers with interpretations of a scene in real-time; Mobileye SuperVision Lite, a navigation and assisted driving solution; and Mobileye SuperVision, an operational point-to-point assisted driving navigation solution on various road types and includes cloud-based enhancements, such as road experience management. The company also provides Mobileye Chauffeur, a first-generation solution for eyes-off\/hands-off driving with a human driver still in the driver's seat; Mobileye Drive, a self-driving system comprising of radar and lidar subsystems, as well as collision avoidance systems, including Mobileye 8 Connect for light and medium-duty vehicles, and Mobileye Shield+ for large vehicles. It serves original equipment manufacturers. The company was founded in 1999 and is headquartered in Jerusalem, Israel. Mobileye Global Inc. operates as a subsidiary of Intel Overseas Funding Corporation.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"06-01-2025 18:53:06"},{"Company Name":"Western Digital Corporation","Symbol":"WDC","Current Price":"66.22","Latest MA":"67.90","Price Target":88.8,"Difference from MA":"-2.48%","Difference from Open":"1.41%","Change from Yesterday":"3.32%","Change from Last Report":"0.05","Latest Volume":"2,626,571","Market Cap":"22,892,783,616","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":7.3687,"ROE":0.033239998,"DTE":"N\/A","Industry":"Computer Hardware","Sector":"Technology","Beta":1.394,"Trailing PEG":null,"Trailing PE":72.76923,"Trailing PS":1.5955383,"Quick Ratio":0.683,"Day High":67.465,"Day Low":65.265,"VS Average Volume":0.497649468,"Company Summary":"Western Digital Corporation develops, manufactures, and sells data storage devices and solutions in the United States, China, Hong Kong, Europe, the Middle East, Africa, rest of Asia, and internationally. It offers client devices, including hard disk drives (HDDs) and solid state drives (SSDs) for desktop and notebook personal computers (PCs), gaming consoles, and set top boxes; and flash-based embedded storage products for mobile phones, tablets, notebook PCs, and other portable and wearable devices, as well as automotive, Internet of Things, industrial, and connected home applications. The company also provides enterprise HDDs; enterprise SSDs consisting of flash-based SSDs and software solutions for use in enterprise servers, online transactions, artificial intelligence-related workloads, data analysis, and other enterprise applications; and data storage platforms. In addition, it offers external HDD storage products in mobile and desktop form; client portable SSDs; removable cards that are used in consumer devices comprising mobile phones, tablets, imaging systems, and cameras and smart video systems; universal serial bus flash drives for use in the computing and consumer markets; and wireless drive products used in-field backup of created content, as well as wireless streaming of high-definition movies, photos, music, documents to tablets, smartphones, and PCs. The company sells its products under the Western Digital, SanDisk, and WD brands to original equipment manufacturers, distributors, dealers, resellers, and retailers. Western Digital Corporation was founded in 1970 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"06-01-2025 18:53:06"},{"Company Name":"Intel Corporation","Symbol":"INTC","Current Price":"20.50","Latest MA":"24.51","Price Target":24.32824,"Difference from MA":"-16.36%","Difference from Open":"-1.60%","Change from Yesterday":"-0.31%","Change from Last Report":"0.06","Latest Volume":"30,404,474","Market Cap":"88,406,581,248","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":20.970587,"ROE":-0.15597,"DTE":47.906,"Industry":"Semiconductors","Sector":"Technology","Beta":1.026,"Trailing PEG":0.5553,"Trailing PE":"N\/A","Trailing PS":1.6297046,"Quick Ratio":0.833,"Day High":20.98,"Day Low":20.435,"VS Average Volume":0.4444366842,"Company Summary":"Intel Corporation designs, develops, manufactures, markets, and sells computing and related products and services worldwide. It operates through Client Computing Group, Data Center and AI, Network and Edge, Mobileye, and Intel Foundry Services segments. The company's products portfolio comprises central processing units and chipsets, system-on-chips (SoCs), and multichip packages; mobile and desktop processors; hardware products comprising graphics processing units (GPUs), domain-specific accelerators, and field programmable gate arrays (FPGAs); and memory and storage, connectivity and networking, and other semiconductor products. It also offers silicon devices and software products; and optimization solutions for workloads, such as AI, cryptography, security, storage, networking, and leverages various features supporting diverse compute environments. In addition, the company develops and deploys advanced driver assistance systems (ADAS), and autonomous driving technologies and solutions; and provides advanced process technologies backed by an ecosystem of IP, EDA, and design services, as well as systems of chips, including advanced packaging technologies, software and accelerate bring-up, and integration of chips and driving standards. Further, it delivers and deploys intelligent edge platforms that allow developers to achieve agility and drive automation using AI for efficient operations with data integrity, as well as provides hardware and software platforms, tools, and ecosystem partnerships for digital transformation from the cloud to edge. The company serves original equipment manufacturers, original design manufacturers, cloud service providers, and other manufacturers and service providers. It has a strategic agreement with Synopsys, Inc. to develop EDA and IP solutions; and ARM that enables chip designers to build optimized compute SoCs on the Intel 18A process. Intel Corporation was incorporated in 1968 and is headquartered in Santa Clara, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"06-01-2025 18:53:06"},{"Company Name":"American Express Company","Symbol":"AXP","Current Price":"303.15","Latest MA":"262.94","Price Target":294.9148,"Difference from MA":"15.29%","Difference from Open":"-0.38%","Change from Yesterday":"0.09%","Change from Last Report":"0.02","Latest Volume":"1,029,225","Market Cap":"213,552,496,640","Earning Date":"2025-01-24","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":20.019388,"ROE":0.3469,"DTE":186.815,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.214,"Trailing PEG":1.9185,"Trailing PE":22.323269,"Trailing PS":3.6049309,"Quick Ratio":1.619,"Day High":305.1536,"Day Low":301.55,"VS Average Volume":0.4033244065,"Company Summary":"American Express Company, together with its subsidiaries, operates as integrated payments company in the United States, Europe, the Middle East and Africa, the Asia Pacific, Australia, New Zealand, Latin America, Canada, the Caribbean, and Internationally. It operates through four segments: U.S. Consumer Services, Commercial Services, International Card Services, and Global Merchant and Network Services. The company's products and services include credit card, charge card, banking, and other payment and financing products; network services; expense management products and services; and travel and lifestyle services. It also provides merchant acquisition and processing, servicing and settlement, point-of-sale marketing, and information products and services for merchants; and fraud prevention services, as well as the design and operation of customer loyalty programs. In addition, the company operates lounges at airports under Centurion Lounge brand name. It sells its products and services to consumers, small businesses, mid-sized companies, and large corporations through mobile and online applications, affiliate marketing, customer referral programs, third-party service providers and business partners, direct mail, telephone, in-house sales teams, and direct response advertising. American Express Company was founded in 1850 and is headquartered in New York, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"06-01-2025 18:53:06"}]