[{"Company Name":"American Airlines Group, Inc.","Symbol":"AAL","Current Price":"17.17","Latest MA":"12.91","Price Target":20.24273,"Difference from MA":"32.98%","Difference from Open":"-0.75%","Change from Yesterday":"-8.20%","Change from Last Report":"0.73","Latest Volume":"24,948,837","Market Cap":"11,282,939,904","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":5.6767087,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Airlines","Sector":"Industrials","Beta":1.399,"Trailing PEG":0.2271,"Trailing PE":40.880955,"Trailing PS":0.21045157,"Quick Ratio":0.422,"Day High":17.536,"Day Low":16.85,"VS Average Volume":0.9331493902,"Company Summary":"American Airlines Group Inc., through its subsidiaries, operates as a network air carrier. The company provides scheduled air transportation services for passengers and cargo through its hubs in Charlotte, Chicago, Dallas\/Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix, and Washington, D.C., as well as through partner gateways in London, Doha, Madrid, Seattle\/Tacoma, Sydney, and Tokyo. It operates a mainline fleet of 965 aircraft. The company was formerly known as AMR Corporation and changed its name to American Airlines Group Inc. in December 2013. American Airlines Group Inc. was founded in 1926 and is headquartered in Fort Worth, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 16:44:41"},{"Company Name":"TAL Education Group","Symbol":"TAL","Current Price":"10.54","Latest MA":"9.87","Price Target":13.85947,"Difference from MA":"6.74%","Difference from Open":"14.57%","Change from Yesterday":"15.33%","Change from Last Report":"0.09","Latest Volume":"6,598,116","Market Cap":"6,369,142,784","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":23.1257,"PB Ratio":1.6978092,"ROE":0.019609999,"DTE":9.291,"Industry":"Education & Training Services","Sector":"Consumer Defensive","Beta":0.033,"Trailing PEG":0.739,"Trailing PE":87.833336,"Trailing PS":3.4678667,"Quick Ratio":2.67,"Day High":11.0,"Day Low":10.4,"VS Average Volume":1.0512270606,"Company Summary":"TAL Education Group provides K-12 after-school tutoring services in the People's Republic of China. It provides learning services primarily through small-classes services; personalized premium services; and learning content solutions, such as print books, smart books, mobile apps, and AI-driven learning devices. The company also operates www.xueersi.com, an online education platform; provides investment management and consulting services; develops and sells software and networks, as well as related consulting services; and sells educational materials and products. It offers its services under the Haoweilai and Think Academy brands. TAL Education Group was founded in 2003 and is headquartered in Beijing, the People's Republic of China.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"23-01-2025 16:44:41"},{"Company Name":"Freeport-McMoRan, Inc.","Symbol":"FCX","Current Price":"36.83","Latest MA":"44.33","Price Target":50.18381,"Difference from MA":"-16.91%","Difference from Open":"-8.92%","Change from Yesterday":"-5.58%","Change from Last Report":"-0.96","Latest Volume":"3,078,463","Market Cap":"52,927,164,416","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":19.65512,"PB Ratio":3.0161726,"ROE":0.16870001,"DTE":33.531,"Industry":"Copper","Sector":"Basic Materials","Beta":1.91,"Trailing PEG":10.2244,"Trailing PE":26.690943,"Trailing PS":2.0642421,"Quick Ratio":1.048,"Day High":38.13,"Day Low":36.56,"VS Average Volume":0.269765406,"Company Summary":"Freeport-McMoRan Inc. engages in the mining of mineral properties in North America, South America, and Indonesia. It primarily explores for copper, gold, molybdenum, silver, and other metals. The company's assets include the Grasberg minerals district in Indonesia; Morenci, Bagdad, Safford, Sierrita, and Miami in Arizona; Chino and Tyrone in New Mexico; and Henderson and Climax in Colorado, North America, as well as Cerro Verde in Peru and El Abra in Chile. The company was formerly known as Freeport-McMoRan Copper & Gold Inc. and changed its name to Freeport-McMoRan Inc. in July 2014. Freeport-McMoRan Inc. was incorporated in 1987 and is headquartered in Phoenix, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-01-2025 16:44:41"},{"Company Name":"CSX Corporation","Symbol":"CSX","Current Price":"33.67","Latest MA":"33.79","Price Target":37.96615,"Difference from MA":"-0.33%","Difference from Open":"-0.55%","Change from Yesterday":"1.25%","Change from Last Report":"-0.34","Latest Volume":"1,377,951","Market Cap":"64,939,540,480","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":17.199463,"PB Ratio":5.0223713,"ROE":0.29458,"DTE":147.913,"Industry":"Railroads","Sector":"Industrials","Beta":1.191,"Trailing PEG":2.1277,"Trailing PE":17.912233,"Trailing PS":4.423373,"Quick Ratio":1.195,"Day High":34.1,"Day Low":33.6,"VS Average Volume":0.1126092892,"Company Summary":"CSX Corporation, together with its subsidiaries, provides rail-based freight transportation services. The company offers rail services; and transportation of intermodal containers and trailers, as well as other transportation services, such as rail-to-truck transfers and bulk commodity operations. It also transports chemicals, agricultural and food products, minerals, automotive, forest products, fertilizers, and metals and equipment; and coal, coke, and iron ore to electricity-generating power plants, steel manufacturers, and industrial plants, as well as exports coal to deep-water port facilities. In addition, the company provides intermodal services through a network of approximately 30 terminals transporting manufactured consumer goods in containers; and drayage services, including the pickup and delivery of intermodal shipments. It serves the automotive industry with distribution centers and storage locations, as well as connects non-rail served customers through transferring products, such as plastics and ethanol from rail to trucks. The company operates approximately 20,000 route mile rail network, which serves various population centers in 26 states east of the Mississippi River, the District of Columbia, and the Canadian provinces of Ontario and Quebec, as well as owns and leases approximately 3,500 locomotives. It serves production and distribution facilities through track connections. CSX Corporation was incorporated in 1978 and is headquartered in Jacksonville, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-01-2025 16:44:41"},{"Company Name":"Abbott Laboratories","Symbol":"ABT","Current Price":"119.99","Latest MA":"111.47","Price Target":131.7787,"Difference from MA":"7.65%","Difference from Open":"5.14%","Change from Yesterday":"1.85%","Change from Last Report":"-0.01","Latest Volume":"1,444,743","Market Cap":"208,117,858,304","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":21.175552,"PB Ratio":5.2296896,"ROE":0.14840001,"DTE":37.589,"Industry":"Medical Devices","Sector":"Healthcare","Beta":0.722,"Trailing PEG":2.2826,"Trailing PE":15.705498,"Trailing PS":5.049321,"Quick Ratio":0.996,"Day High":120.285,"Day Low":117.78,"VS Average Volume":0.2776827338,"Company Summary":"Abbott Laboratories, together with its subsidiaries, discovers, develops, manufactures, and sells health care products worldwide. It operates in four segments: Established Pharmaceutical Products, Diagnostic Products, Nutritional Products, and Medical Devices. The company provides generic pharmaceuticals for the treatment of pancreatic exocrine insufficiency, irritable bowel syndrome or biliary spasm, intrahepatic cholestasis or depressive symptoms, gynecological disorder, hormone replacement therapy, dyslipidemia, hypertension, hypothyroidism, Ménière's disease and vestibular vertigo, pain, fever, inflammation, and migraine, as well as provides anti-infective clarithromycin, influenza vaccine, and products to regulate physiological rhythm of the colon. It also offers laboratory and transfusion medicine systems in the areas of immunoassay, clinical chemistry, hematology, and transfusion; molecular diagnostics polymerase chain reaction instrument systems that automate the extraction, purification, and preparation of DNA and RNA from patient samples, and detect and measure infectious agents; point of care systems; cartridges for testing blood gas, chemistry, electrolytes, coagulation, and immunoassay; rapid diagnostics lateral flow testing products; molecular point-of-care testing for HIV, SARS-CoV-2, influenza A and B, RSV, and strep A; cardiometabolic test systems; drug and alcohol test, and remote patient monitoring and consumer self-test systems; and informatics and automation solutions for laboratories. In addition, the company provides pediatric and adult nutritional products; rhythm management, electrophysiology, heart failure, vascular, and structural heart devices for the treatment of cardiovascular diseases; diabetes care products, such as glucose and blood glucose monitoring systems; and neuromodulation devices for the management of chronic pain and movement disorders. Abbott Laboratories was founded in 1888 and is based in North Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 16:44:41"},{"Company Name":"Lam Research Corporation","Symbol":"LRCX","Current Price":"80.30","Latest MA":"80.99","Price Target":90.85239,"Difference from MA":"-0.85%","Difference from Open":"-0.56%","Change from Yesterday":"-3.53%","Change from Last Report":"-3.54","Latest Volume":"1,125,885","Market Cap":"103,321,214,976","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":19.737392,"PB Ratio":12.246454,"ROE":0.49116,"DTE":58.827,"Industry":"Semiconductor Equipment & Materials","Sector":"Technology","Beta":1.486,"Trailing PEG":1.6003,"Trailing PE":25.987057,"Trailing PS":6.6268506,"Quick Ratio":1.685,"Day High":81.19,"Day Low":80.12,"VS Average Volume":0.0975630743,"Company Summary":"Lam Research Corporation designs, manufactures, markets, refurbishes, and services semiconductor processing equipment used in the fabrication of integrated circuits. The company offers ALTUS systems to deposit conformal films for tungsten metallization applications; SABRE electrochemical deposition products for copper interconnect transition that offers copper damascene manufacturing; and VECTOR plasma-enhanced CVD products. It also provides SPEED gapfill high-density plasma chemical vapor deposition products; and Striker single-wafer atomic layer deposition products for dielectric film solutions. In addition, the company offers Flex for dielectric etch applications; Vantex, a dielectric etch system that provides RF technology and repeatable wafer-to-wafer performance enabled by Equipment Intelligence solutions; Kiyo for conductor etch applications; Syndion for through-silicon via etch applications; and Versys metal products for metal etch processes. Further, it provides Coronus bevel clean products to enhance die yield; and Da Vinci, DV-Prime, EOS, and SP series products to address various wafer cleaning applications. The company sells its products in the United States, China, Europe, Japan, Korea, Southeast Asia, and Taiwan. Lam Research Corporation was incorporated in 1980 and is headquartered in Fremont, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-01-2025 16:44:41"},{"Company Name":"Alcoa Corporation","Symbol":"AA","Current Price":"37.01","Latest MA":"37.77","Price Target":48.27692,"Difference from MA":"-2.03%","Difference from Open":"-6.58%","Change from Yesterday":"-4.64%","Change from Last Report":"-1.63","Latest Volume":"2,059,301","Market Cap":"9,560,427,520","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":11.062086,"PB Ratio":1.8210227,"ROE":-0.07142,"DTE":56.095,"Industry":"Aluminum","Sector":"Basic Materials","Beta":2.419,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.8688138,"Quick Ratio":0.671,"Day High":37.91,"Day Low":36.11,"VS Average Volume":0.4666648538,"Company Summary":"Alcoa Corporation, together with its subsidiaries, produces and sells bauxite, alumina, and aluminum products in the United States, Spain, Australia, Iceland, Norway, Brazil, Canada, and internationally. The company operates through two segments, Alumina and Aluminum. It engages in bauxite mining operations; and processes bauxite into alumina and sells it to customers who process it into industrial chemical products, as well as aluminum smelting and casting businesses. The company offers primary aluminum in the form of alloy ingot or value-add ingot to customers that produce products for the transportation, building and construction, packaging, wire, and other industrial markets; and flat-rolled aluminum in the form of sheet, which is sold primarily to customers that produce beverage and food cans. In addition, it owns hydro power plants that generates and sells electricity in the wholesale market to traders, large industrial consumers, distribution companies, and other generation companies. The company was formerly known as Alcoa Upstream Corporation and changed its name to Alcoa Corporation in October 2016. The company was founded in 1886 and is headquartered in Pittsburgh, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-01-2025 16:44:41"},{"Company Name":"Kinder Morgan, Inc.","Symbol":"KMI","Current Price":"30.17","Latest MA":"23.68","Price Target":28.91833,"Difference from MA":"27.40%","Difference from Open":"-4.07%","Change from Yesterday":"-1.98%","Change from Last Report":"-0.82","Latest Volume":"3,403,534","Market Cap":"67,026,878,464","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":22.429392,"PB Ratio":2.2044425,"ROE":0.083500005,"DTE":101.433,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.907,"Trailing PEG":2.2538,"Trailing PE":25.786325,"Trailing PS":4.4239244,"Quick Ratio":0.291,"Day High":31.3,"Day Low":30.14,"VS Average Volume":0.2511008562,"Company Summary":"Kinder Morgan, Inc. operates as an energy infrastructure company primarily in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas gasification, liquefaction, and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and\/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, renewable fuel and feedstocks, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; owns interests in\/or operates oil fields and gasoline processing plants; and operates a crude oil pipeline system in West Texas, as well as owns and operates RNG and LNG facilities. It owns and operates approximately 82,000 miles of pipelines and 139 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1997 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 16:44:41"},{"Company Name":"Netflix, Inc.","Symbol":"NFLX","Current Price":"974.96","Latest MA":"754.43","Price Target":1043.0215,"Difference from MA":"29.23%","Difference from Open":"1.88%","Change from Yesterday":"2.20%","Change from Last Report":"-0.05","Latest Volume":"1,260,408","Market Cap":"416,754,434,048","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":32.54812,"PB Ratio":18.342522,"ROE":0.34714,"DTE":81.461,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.25,"Trailing PEG":1.9552,"Trailing PE":49.14113,"Trailing PS":11.087646,"Quick Ratio":0.975,"Day High":978.05,"Day Low":954.3442,"VS Average Volume":0.3825858377,"Company Summary":"Netflix, Inc. provides entertainment services. It offers TV series, documentaries, feature films, and games across various genres and languages. The company also provides members the ability to receive streaming content through a host of internet-connected devices, including TVs, digital video players, TV set-top boxes, and mobile devices. It has operations in approximately 190 countries. The company was incorporated in 1997 and is headquartered in Los Gatos, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 16:44:41"},{"Company Name":"GE Aerospace","Symbol":"GE","Current Price":"207.00","Latest MA":"173.36","Price Target":208.59529,"Difference from MA":"19.41%","Difference from Open":"10.06%","Change from Yesterday":"9.91%","Change from Last Report":"0.24","Latest Volume":"3,824,637","Market Cap":"224,034,045,952","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":39.344337,"PB Ratio":11.869947,"ROE":0.22552,"DTE":110.224,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.188,"Trailing PEG":null,"Trailing PE":40.8284,"Trailing PS":3.2026365,"Quick Ratio":0.804,"Day High":207.64,"Day Low":198.1,"VS Average Volume":0.7666660453,"Company Summary":"General Electric Company, doing business as GE Aerospace, designs and produces commercial and defense aircraft engines, integrated engine components, electric power, and mechanical aircraft systems. It also offers aftermarket services to support its products. The company operates in the United States, Europe, China, Asia, the Americas, the Middle East, and Africa. General Electric Company was incorporated in 1892 and is based in Evendale, Ohio.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"23-01-2025 16:44:41"},{"Company Name":"Schlumberger N.V.","Symbol":"SLB","Current Price":"41.72","Latest MA":"42.82","Price Target":53.44613,"Difference from MA":"-2.59%","Difference from Open":"-3.84%","Change from Yesterday":"0.20%","Change from Last Report":"0.20","Latest Volume":"1,060,464","Market Cap":"58,442,711,040","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":10.978094,"PB Ratio":2.7384627,"ROE":0.21722999,"DTE":57.141,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.532,"Trailing PEG":1.8559,"Trailing PE":13.413184,"Trailing PS":1.6236341,"Quick Ratio":1.003,"Day High":42.17,"Day Low":41.6,"VS Average Volume":0.0836021425,"Company Summary":"Schlumberger Limited engages in the provision of technology for the energy industry worldwide. The company operates through four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company provides field development and hydrocarbon production, carbon management, and integration of adjacent energy systems; reservoir interpretation and data processing services for exploration data; and well construction and production improvement services and products. It also offers subsurface geology and fluids evaluation information; open and cased hole services; exploration and production pressure, and flow-rate measurement services; and pressure pumping, well stimulation, and coiled tubing equipment solutions. In addition, the company offers mud logging, directional drilling, measurement-while-drilling, and logging-while-drilling services, as well as engineering support services; supplies drilling fluid systems; designs, manufactures, and markets roller cone and fixed cutter drill bits; bottom-hole-assembly and borehole enlargement technologies; well cementing products and services; well planning, well drilling, engineering, supervision, logistics, procurement, and contracting of third parties, as well as drilling rig management solutions; and drilling equipment and services, as well as land drilling rigs and related services. Further, it provides artificial lift production equipment and optimization services; supplies packers, safety valves, sand control technology, and various intelligent well completions technology and equipment; designs and manufactures valves, chokes, actuators, and surface trees; and OneSubsea, an integrated solutions, products, systems, and services, including wellheads, subsea trees, manifolds and flowline connectors, control systems, connectors, and services. The company was formerly known as Socie´te´ de Prospection E´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-01-2025 16:44:41"},{"Company Name":"Bank of America Corporation","Symbol":"BAC","Current Price":"46.55","Latest MA":"41.99","Price Target":51.92857,"Difference from MA":"10.86%","Difference from Open":"-0.12%","Change from Yesterday":"1.65%","Change from Last Report":"-0.10","Latest Volume":"3,013,362","Market Cap":"354,247,475,200","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.746121,"PB Ratio":1.3159086,"ROE":0.08092,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.325,"Trailing PEG":2.0288,"Trailing PE":14.499999,"Trailing PS":3.743659,"Quick Ratio":"N\/A","Day High":46.61,"Day Low":46.05,"VS Average Volume":0.085276091,"Company Summary":"Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. It operates in four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, non-interest and interest-bearing checking accounts, and investment accounts and products; credit and debit cards; residential mortgages, and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research, and certain market-based services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 16:44:41"},{"Company Name":"Walgreens Boots Alliance, Inc.","Symbol":"WBA","Current Price":"11.91","Latest MA":"9.89","Price Target":12.414,"Difference from MA":"20.39%","Difference from Open":"2.58%","Change from Yesterday":"2.53%","Change from Last Report":"-0.55","Latest Volume":"1,990,374","Market Cap":"10,292,062,208","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":7.427363,"PB Ratio":0.98519313,"ROE":-0.75969005,"DTE":277.898,"Industry":"Pharmaceutical Retailers","Sector":"Healthcare","Beta":0.669,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.06970203,"Quick Ratio":0.332,"Day High":12.01,"Day Low":11.58,"VS Average Volume":0.0827393123,"Company Summary":"Walgreens Boots Alliance, Inc. operates as a healthcare, pharmacy, and retail company in the United States, Germany, the United Kingdom, and internationally. It operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The U.S. Retail Pharmacy segment engages in operation of the retail drugstores, health and wellness services, specialty, and home delivery pharmacy services, which offers health and wellness, beauty, personal care and consumables, and general merchandise. The International segment offers sale of prescription drugs and health and wellness, beauty, personal care, and other consumer products outside the United States; and operates pharmacy-led health and beauty retail businesses under the Boots brand stores in the United Kingdom, the Republic of Ireland, and Thailand, as well as the Benavides brand in Mexico and the Ahumada brand in Chile. The U.S. Healthcare segment provides VillageMD, a national provider of value-based care with primary, multi-specialty, and urgent care providers serving patients in traditional clinic settings, in patients' homes and online appointments; Shields, a specialty pharmacy integrator and accelerator for hospitals; and CareCentrix, a participant in the post-acute and home care management sectors. Walgreens Boots Alliance, Inc. was founded in 1909 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"23-01-2025 16:44:41"},{"Company Name":"Starbucks Corporation","Symbol":"SBUX","Current Price":"97.16","Latest MA":"90.39","Price Target":103.86621,"Difference from MA":"7.49%","Difference from Open":"-0.86%","Change from Yesterday":"-0.58%","Change from Last Report":"-0.58","Latest Volume":"1,007,725","Market Cap":"110,160,003,072","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":26.139784,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":0.962,"Trailing PEG":2.0445,"Trailing PE":29.353476,"Trailing PS":3.0450962,"Quick Ratio":0.524,"Day High":98.0,"Day Low":97.08,"VS Average Volume":0.1259931703,"Company Summary":"Starbucks Corporation, together with its subsidiaries, operates as a roaster, marketer, and retailer of coffee worldwide. The company operates through three segments: North America, International, and Channel Development. Its stores offer coffee, tea, and other beverages, roasted whole beans and ground coffees, single serve products, and ready-to-drink beverages; and various food products, such as pastries, breakfast sandwiches, and lunch items. The company also licenses its trademarks through licensed stores, and grocery and foodservice accounts. The company offers its products under the Starbucks Coffee, Teavana, Seattle's Best Coffee, Ethos, and Starbucks Reserve brands. Starbucks Corporation was founded in 1971 and is based in Seattle, Washington.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 16:44:41"},{"Company Name":"SoFi Technologies, Inc.","Symbol":"SOFI","Current Price":"17.55","Latest MA":"10.44","Price Target":12.6,"Difference from MA":"68.07%","Difference from Open":"0.83%","Change from Yesterday":"-0.18%","Change from Last Report":"0.03","Latest Volume":"3,394,802","Market Cap":"19,038,955,520","Earning Date":"2025-01-27","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":68.00388,"PB Ratio":3.1075099,"ROE":0.037249997,"DTE":54.394,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.613,"Trailing PEG":null,"Trailing PE":146.20834,"Trailing PS":7.557507,"Quick Ratio":0.47,"Day High":17.64,"Day Low":17.28,"VS Average Volume":0.0657374458,"Company Summary":"SoFi Technologies, Inc. provides various financial services in the United States, Latin America, and Canada. It operates through three segments: Lending, Technology Platform, and Financial Services. The company offers lending and financial services and products that allows its members to borrow, save, spend, invest, and protect money. It offers personal loans, student loans, home loans, and related services. The company also operates Galileo, a technology platform that offers services to financial and non-financial institution; and Technisys, a cloud-native digital and core banking platform with financial services customers. In addition, it provides SoFi Money offers checking and savings accounts, debit cards, and cash management products; and SoFi Invest, a mobile-first investment platform that provides access to trading and advisory solutions, such as investing and robo-advisory. Further, the company offers SoFi Credit Card that provides cash backs on every purchase; Sofi Relay, a personal finance management product that allows to track all of their financial accounts comprising credit score and spending behaviors; SoFi Protect, which offers insurance product; SoFi Travel, an application that manages travel search and booking experience; SoFi At Work provides financial benefits to employees, including student loan payments made on their employees' behalf; Lantern Credit, a financial services marketplace platform for seeking alternative products and provide product comparisons; and other lending as a service that offers pre-qualified borrower referrals and sells loans to third-party partner. The company was founded in 2011 and is based in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"23-01-2025 16:44:41"},{"Company Name":"AT&T Inc.","Symbol":"T","Current Price":"22.34","Latest MA":"20.75","Price Target":26.14962,"Difference from MA":"7.64%","Difference from Open":"-0.20%","Change from Yesterday":"0.07%","Change from Last Report":"-0.13","Latest Volume":"1,933,705","Market Cap":"160,260,096,000","Earning Date":"2025-01-27","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":10.327321,"PB Ratio":1.5656105,"ROE":0.08759,"DTE":125.151,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.73,"Trailing PEG":1.8466,"Trailing PE":18.158535,"Trailing PS":1.3129617,"Quick Ratio":0.42,"Day High":22.45,"Day Low":22.22,"VS Average Volume":0.0563864675,"Company Summary":"AT&T Inc. provides telecommunications and technology services worldwide. The company operates through two segments, Communications and Latin America. The Communications segment offers wireless voice and data communications services; and sells handsets, wireless data cards, wireless computing devices, carrying cases\/protective covers, and wireless chargers through its own company-owned stores, agents, and third-party retail stores. It also provides Virtual Private Networks, AT&T Dedicated Internet, Ethernet, data services, cloud solutions, outsourcing, and managed professional services, as well as customer premises equipment for multinational corporations, small and mid-sized businesses, governmental, and wholesale customers. In addition, this segment offers broadband services, including fiber connections, legacy telephony voice communication services, and other VoIP services and equipment to residential customers. This segment markets its communications services and products under the AT&T, AT&T Business, Cricket, AT&T PREPAID, and AT&T Fiber brand names. The Latin America segment provides postpaid and prepaid wireless services in Mexico under the AT&T and Unefon brand names, as well as sells smartphones through its owned stores, agents and third-party retail stores. The company was formerly known as SBC Communications Inc. and changed its name to AT&T Inc. in 2005. AT&T Inc. was incorporated in 1983 and is based in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"23-01-2025 16:44:41"},{"Company Name":"Verizon Communications Inc.","Symbol":"VZ","Current Price":"39.21","Latest MA":"40.53","Price Target":47.1625,"Difference from MA":"-3.26%","Difference from Open":"0.84%","Change from Yesterday":"0.69%","Change from Last Report":"-0.08","Latest Volume":"2,222,081","Market Cap":"165,068,013,568","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.306906,"PB Ratio":1.7136614,"ROE":0.10431,"DTE":182.615,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.418,"Trailing PEG":1.0336,"Trailing PE":16.974894,"Trailing PS":1.2296759,"Quick Ratio":0.51,"Day High":39.4,"Day Low":39.09,"VS Average Volume":0.1162034587,"Company Summary":"Verizon Communications Inc., through its subsidiaries, engages in the provision of communications, technology, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide. It operates in two segments, Verizon Consumer Group (Consumer) and Verizon Business Group (Business). The Consumer segment provides wireless services across the wireless networks in the United States under the Verizon and TracFone brands and through wholesale and other arrangements; and fixed wireless access (FWA) broadband through its wireless networks, as well as related equipment and devices, such as smartphones, tablets, smart watches, and other wireless-enabled connected devices. The segment also offers wireline services in the Mid-Atlantic and Northeastern United States, as well as Washington D.C. through its fiber-optic network, Verizon Fios product portfolio, and a copper-based network. The Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and conferencing, corporate networking, security and managed network, local and long-distance voice, and network access services to deliver various IoT services and products to businesses, government customers, and wireless and wireline carriers in the United States and internationally. The company was formerly known as Bell Atlantic Corporation and changed its name to Verizon Communications Inc. in June 2000. Verizon Communications Inc. was incorporated in 1983 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"23-01-2025 16:44:41"}]