[{"Company Name":"BGC Group, Inc.","Symbol":"BGC","Current Price":"9.55","Latest MA":"9.51","Price Target":12.0,"Difference from MA":"0.47%","Difference from Open":"3.69%","Change from Yesterday":"0.63%","Change from Last Report":"0.05","Latest Volume":"649,206","Market Cap":"4,650,668,544","Earning Date":"2025-02-14","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":9.009435,"PB Ratio":5.3833146,"Previous Close":9.49,"ROE":0.12765999,"DTE":152.907,"Industry":"Capital Markets","Sector":"Financial Services","Beta":1.486,"Trailing PEG":null,"Trailing PE":41.52174,"Trailing PS":2.1940851,"Quick Ratio":1.424,"Day High":9.78,"Day Low":9.04,"VS Average Volume":0.2177232171,"Company Summary":"BGC Group, Inc. operates as a financial brokerage and technology company in the United States and internationally. The company offers various brokerage products, such as fixed income, such as government bonds, corporate bonds, and other debt instruments, as well as related interest rate derivatives and credit derivatives; equities, energy and commodities, shipping, insurance, and futures and options. It also provides trade execution, connectivity solutions, brokerage services, clearing, trade compression and other post-trade services, information, and other back-office services to an assortment of financial and non-financial institutions. In addition, the company offers electronic and hybrid brokerage, other financial technology solutions, market data and related information services. Further, its integrated platform is designed to provide flexibility to customers with regard to price discovery, execution and processing of transactions, Hybrid, or in various markets, as well as fully electronic brokerage services in connection with transactions executed either OTC or through an exchange. The company primarily serves banks, broker-dealers, investment banks, trading firms, hedge funds, governments, and corporations, as well as investment firms. BGC Group, Inc. was founded in 1945 and is headquartered in New York, New York.","Stock Sentiment":"N\/A","Row Color":"positive-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"Roku, Inc.","Symbol":"ROKU","Current Price":"97.50","Latest MA":"72.59","Price Target":92.87667,"Difference from MA":"34.30%","Difference from Open":"-3.10%","Change from Yesterday":"12.32%","Change from Last Report":"-0.05","Latest Volume":"11,257,969","Market Cap":"14,156,177,408","Earning Date":"2025-02-14","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":1271.6187,"PB Ratio":5.7532754,"Previous Close":86.8,"ROE":-0.0722,"DTE":24.921,"Industry":"Entertainment","Sector":"Communication Services","Beta":2.072,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":3.6332583,"Quick Ratio":2.309,"Day High":104.96,"Day Low":96.36,"VS Average Volume":3.31973422,"Company Summary":"Roku, Inc., together with its subsidiaries, operates a TV streaming platform in the United states and internationally. The company operates in two segments, Platform and Devices. Its streaming platform allows users to find and access TV shows, movies, news, sports, and others. The Platform segment offers digital advertising, including direct and programmatic video advertising, media and entertainment promotional spending, and related services; and streaming services distribution, such as subscription and transaction revenue shares, and sale of premium subscriptions and branded app buttons on remote controls. The Devices segment provides sale of streaming players, Roku-branded TVs, smart home products and services, audio products, and related accessories as well as licensing arrangements with service operators. Roku, Inc. was incorporated in 2002 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"Moderna, Inc.","Symbol":"MRNA","Current Price":"32.99","Latest MA":"60.82","Price Target":62.00545,"Difference from MA":"-45.76%","Difference from Open":"7.98%","Change from Yesterday":"3.35%","Change from Last Report":"0.70","Latest Volume":"11,502,479","Market Cap":"12,695,145,472","Earning Date":"2025-02-14","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":-4.927698,"PB Ratio":1.064915,"Previous Close":31.92,"ROE":-0.17524,"DTE":11.361,"Industry":"Biotechnology","Sector":"Healthcare","Beta":1.69,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":2.4985526,"Quick Ratio":3.954,"Day High":33.23,"Day Low":29.2543,"VS Average Volume":1.0884325502,"Company Summary":"Moderna, Inc., a biotechnology company, discovers, develops, and commercializes messenger RNA therapeutics and vaccines for the treatment of infectious diseases, immuno-oncology, rare diseases, autoimmune, and cardiovascular diseases in the United States, Europe, and internationally. Its respiratory vaccines include COVID-19, influenza, and respiratory syncytial virus, spikevax, and hMPV\/PIV3 vaccines; latent vaccines comprise cytomegalovirus, epstein-barr virus, herpes simplex virus, varicella zoster virus, and human immunodeficiency virus vaccines; public health vaccines consists of Zika, Nipah, Mpox vaccines; and infectious diseases vaccines, such as lyme and norovirus vaccines. The company also offers systemic secreted and cell surface therapeutics; cancer vaccines, such as personalized cancer, KRAS, and checkpoint vaccines; intratumoral immuno-oncology products; rare disease intracellular therapeutics; and inhaled pulmonary therapeutics. It has strategic alliances and collaborations with AstraZeneca; Merck & Co., Inc; Vertex Pharmaceuticals Incorporated; Vertex Pharmaceuticals (Europe) Limited; Chiesi Farmaceutici S.p.A.; Metagenomi, Inc.; Carisma Therapeutics, Inc.; CytomX Therapeutics; Defense Advanced Research Projects Agency; Biomedical Advanced Research and Development Authority; Institute for Life Changing Medicines; The Bill & Melinda Gates Foundation; and OpenAI. The company was formerly known as Moderna Therapeutics, Inc. and changed its name to Moderna, Inc. in August 2018. Moderna, Inc. was founded in 2010 and is headquartered in Cambridge, Massachusetts.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"Coinbase Global, Inc.","Symbol":"COIN","Current Price":"279.24","Latest MA":"237.68","Price Target":314.25,"Difference from MA":"17.49%","Difference from Open":"-3.05%","Change from Yesterday":"-6.33%","Change from Last Report":"0.34","Latest Volume":"9,092,315","Market Cap":"69,908,455,424","Earning Date":"2025-02-14","Earning Time":"After","Earning Day of Week":"Friday","PE Ratio":40.399723,"PB Ratio":8.007653,"Previous Close":298.11,"ROE":0.21316,"DTE":51.515,"Industry":"Financial Data & Stock Exchanges","Sector":"Financial Services","Beta":3.343,"Trailing PEG":0.7724,"Trailing PE":47.329304,"Trailing PS":13.979259,"Quick Ratio":0.029,"Day High":291.5,"Day Low":276.5,"VS Average Volume":0.8782427061,"Company Summary":"Coinbase Global, Inc. provides financial infrastructure and technology for the crypto economy in the United States and internationally. The company offers the primary financial account in the crypto economy for consumers; and a marketplace with a pool of liquidity for transacting in crypto assets for institutions. It also provides technology and services that enable developers to build crypto products and securely accept crypto assets as payment. The company was founded in 2012 and is based in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"DraftKings Inc.","Symbol":"DKNG","Current Price":"52.35","Latest MA":"38.63","Price Target":52.35714,"Difference from MA":"35.53%","Difference from Open":"7.38%","Change from Yesterday":"12.70%","Change from Last Report":"0.23","Latest Volume":"21,629,747","Market Cap":"25,527,324,672","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":24.09999,"PB Ratio":23.698503,"Previous Close":46.45,"ROE":-0.44426,"DTE":124.782,"Industry":"Gambling","Sector":"Consumer Cyclical","Beta":1.819,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":5.5424495,"Quick Ratio":0.572,"Day High":53.45,"Day Low":48.04,"VS Average Volume":2.7483481129,"Company Summary":"DraftKings Inc. operates as a digital sports entertainment and gaming company in the United States and internationally. It provides online sports betting and casino, daily fantasy sports, media, and other consumer products, as well as retails sportsbooks. The company also engages in the design and development of sports betting and casino gaming software for online and retail sportsbooks, and iGaming operators. In addition, it offers DraftKings marketplace, a digital collectibles ecosystem designed for mainstream accessibility that offers curated NFT drops and supports secondary-market transactions. The company was founded in 2012 and is headquartered in Boston, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"GE HealthCare Technologies Inc.","Symbol":"GEHC","Current Price":"91.82","Latest MA":"85.21","Price Target":99.357,"Difference from MA":"7.76%","Difference from Open":"-1.48%","Change from Yesterday":"-1.78%","Change from Last Report":"0.02","Latest Volume":"580,121","Market Cap":"41,989,099,520","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":17.55627,"PB Ratio":5.043669,"Previous Close":93.48,"ROE":0.21853,"DTE":126.093,"Industry":"Health Information Services","Sector":"Healthcare","Beta":"N\/A","Trailing PEG":2.4686,"Trailing PE":21.156681,"Trailing PS":2.1467917,"Quick Ratio":0.883,"Day High":93.2099,"Day Low":91.2401,"VS Average Volume":0.1940485676,"Company Summary":"GE HealthCare Technologies Inc. engages in the development, manufacture, and marketing of products, services, and complementary digital solutions used in the diagnosis, treatment, and monitoring of patients in the United States, Canada, and internationally. The company operates through four segments: Imaging, Ultrasound, Patient Care Solutions, and Pharmaceutical Diagnostics. The Imaging segment offers molecular imaging, computed tomography (CT) scanning, magnetic resonance (MR) imaging, image-guided therapy, X-ray systems, and women's health products. The Ultrasound segment provides medical devices and solutions for screening, diagnosis, treatment, and monitoring of certain diseases in clinical areas, such as radiology and primary care, women's health, cardiovascular, and point of care and handheld ultrasound solutions, as well as surgical visualization and guidance products. The Patient Care Solutions segment provides medical devices, consumables, services, and digital solutions. Its portfolio includes patient monitoring solutions, anesthesia delivery and respiratory care products, electrocardiogram solutions, maternal infant care products, and consumables and services. The Pharmaceutical Diagnostics supplies diagnostic agents, including CT, angiography and X-ray, MR, single-photon emission computed tomography, positron emission tomography, and ultrasound to the radiology and nuclear medicine industry. The segment also provides contrast media pharmaceuticals that are administered to a patient prior to certain diagnostic scans to increase the visibility of tissues or structures during imaging exams; and molecular imaging agents or radiopharmaceuticals, which are molecular tracers labeled with radioisotopes. It has an AI collaboration with Mass General Brigham. The company was formerly known as GE Healthcare Holding LLC and changed its name to GE HealthCare Technologies Inc. in December 2022. The company was incorporated in 2022 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"Iron Mountain Incorporated (Del","Symbol":"IRM","Current Price":"96.36","Latest MA":"110.95","Price Target":119.25,"Difference from MA":"-13.14%","Difference from Open":"1.44%","Change from Yesterday":"1.17%","Change from Last Report":"-0.06","Latest Volume":"791,586","Market Cap":"28,292,087,808","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":44.8078,"PB Ratio":"N\/A","Previous Close":95.25,"ROE":0.54398996,"DTE":"N\/A","Industry":"REIT - Specialty","Sector":"Real Estate","Beta":1.023,"Trailing PEG":null,"Trailing PE":157.9754,"Trailing PS":4.7244353,"Quick Ratio":0.612,"Day High":96.6,"Day Low":93.95,"VS Average Volume":0.4446093255,"Company Summary":"Iron Mountain Incorporated (NYSE: IRM) is a global leader in information management services. Founded in 1951 and trusted by more than 240,000 customers worldwide, Iron Mountain serves to protect and elevate the power of our customers' work. Through a range of offerings including digital transformation, data centers, secure records storage, information management, asset lifecycle management, secure destruction and art storage and logistics, Iron Mountain helps businesses bring light to their dark data, enabling customers to unlock value and intelligence from their stored digital and physical assets at speed and with security, while helping them meet their environmental goals.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"US Foods Holding Corp.","Symbol":"USFD","Current Price":"70.95","Latest MA":"63.00","Price Target":78.6375,"Difference from MA":"12.61%","Difference from Open":"-0.10%","Change from Yesterday":"-0.23%","Change from Last Report":"-0.04","Latest Volume":"873,790","Market Cap":"16,527,022,080","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":15.406363,"PB Ratio":3.626003,"Previous Close":71.11,"ROE":0.12368,"DTE":107.859,"Industry":"Food Distribution","Sector":"Consumer Defensive","Beta":1.661,"Trailing PEG":null,"Trailing PE":35.12376,"Trailing PS":0.44282255,"Quick Ratio":0.681,"Day High":71.348,"Day Low":70.4,"VS Average Volume":0.4578616286,"Company Summary":"US Foods Holding Corp., together with its subsidiaries, engages in marketing, sale, and distribution of fresh, frozen, and dry food and non-food products to foodservice customers in the United States. The company's customers include independently owned single and multi-unit restaurants, regional concepts, national restaurant chains, hospitals, nursing homes, hotels and motels, country clubs, government and military organizations, colleges and universities, and retail locations. The company was formerly known as USF Holding Corp. and changed its name to US Foods Holding Corp. in February 2016. US Foods Holding Corp. was incorporated in 2007 and is headquartered in Rosemont, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"Summit Materials, Inc.","Symbol":"SUM","Current Price":"52.49","Latest MA":"44.31","Price Target":"N\/A","Difference from MA":"18.47%","Difference from Open":"0.19%","Change from Yesterday":"-0.08%","Change from Last Report":"0.00","Latest Volume":"4,694,636","Market Cap":"9,228,477,440","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":24.99524,"PB Ratio":2.0728192,"Previous Close":52.45,"ROE":0.04364,"DTE":65.584,"Industry":"Building Materials","Sector":"Basic Materials","Beta":1.142,"Trailing PEG":null,"Trailing PE":61.75294,"Trailing PS":2.457947,"Quick Ratio":2.431,"Day High":54.07,"Day Low":52.4,"VS Average Volume":1.1774317858,"Company Summary":"Summit Materials, Inc. operates as a vertically integrated construction materials company in the United States and Canada. It operates in three segments: West, East, and Cement. The company offers aggregates, cement, ready-mix concrete, asphalt paving mixes, and concrete products, as well as plastics components. It also provides asphalt paving and related services. In addition, the company operates municipal waste, construction, and demolition debris landfills; and liquid asphalt terminals. The company serves the public infrastructure, and residential and nonresidential end markets. Summit Materials, Inc. was founded in 2009 and is headquartered in Denver, Colorado. As of February 10, 2025, Summit Materials, Inc. operates as a subsidiary of Quikrete Holdings, Inc.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"Howmet Aerospace Inc.","Symbol":"HWM","Current Price":"130.74","Latest MA":"105.54","Price Target":130.2074,"Difference from MA":"23.87%","Difference from Open":"1.45%","Change from Yesterday":"2.08%","Change from Last Report":"0.05","Latest Volume":"828,851","Market Cap":"52,897,406,976","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":33.39532,"PB Ratio":11.967049,"Previous Close":128.08,"ROE":0.25719,"DTE":78.925,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.293,"Trailing PEG":null,"Trailing PE":46.69286,"Trailing PS":7.276122,"Quick Ratio":0.824,"Day High":131.6085,"Day Low":126.89,"VS Average Volume":0.3358342423,"Company Summary":"Howmet Aerospace Inc. provides advanced engineered solutions for the aerospace and transportation industries in the United States, Japan, France, Germany, the United Kingdom, Mexico, Italy, Canada, Poland, China, and internationally. It operates through four segments: Engine Products, Fastening Systems, Engineered Structures, and Forged Wheels. The Engine Products segment offers airfoils and seamless rolled rings primarily for aircraft engines and industrial gas turbines; and rotating and structural parts. The Fastening Systems segment produces aerospace fastening systems, as well as commercial transportation, industrial, and other fasteners; and latches, bearings, fluid fittings, and installation tools. The Engineered Structures segment provides titanium ingots and mill products, aluminum and nickel forgings, and machined components and assemblies for aerospace and defense applications; and titanium forgings, extrusions, and forming and machining services for airframe, wing, aero-engine, and landing gear components. The Forged Wheels segment offers forged aluminum wheels and related products for heavy-duty trucks and commercial transportation markets. The company was formerly known as Arconic Inc. Howmet Aerospace Inc. was founded in 1888 and is based in Pittsburgh, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"Informatica Inc.","Symbol":"INFA","Current Price":"17.36","Latest MA":"25.42","Price Target":28.67647,"Difference from MA":"-31.70%","Difference from Open":"4.14%","Change from Yesterday":"-31.03%","Change from Last Report":"0.22","Latest Volume":"11,291,974","Market Cap":"5,301,222,912","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":12.822124,"PB Ratio":2.2013695,"Previous Close":25.17,"ROE":0.028970001,"DTE":77.673,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.044,"Trailing PEG":null,"Trailing PE":578.6667,"Trailing PS":3.1995,"Quick Ratio":1.895,"Day High":17.77,"Day Low":16.38,"VS Average Volume":6.9281822192,"Company Summary":"Informatica Inc. develops an artificial intelligence-powered platform that connects, manages, and unifies data across multi-vendor, multi-cloud, and hybrid systems at enterprise scale worldwide. The company's platform includes a suite of interoperable data management products, including data integration products to ingest, transform, and integrate data; API and application integration products that enable users to create and manage APIs and integration processes for app-to-app synchronization, business process orchestration, B2B partner management, application development, and API management; data quality and observability products to profile, cleanse, standardize, observe, and monitor data to deliver accurate, complete, and consistent data; and master data management products to create an authoritative single source of truth of business-critical data. Its platform also includes customer and business 360 application that allow business analysts to create 360-degree views of business data domains like customer, product, supplier, reference, and finance with simplified business user experiences; data catalog products that enables customers to quickly find, access, and understand enterprise data using a simple Google-like search experience; governance and privacy products that help users define policies, govern data, and ensure compliance with industry and corporate policies; and a data marketplace that delivers cloud shopping experience for data consumers and enables data sharing and AI models across organizations to facilitate data-driven decision making. In addition, the company provides CLAIRE GPT, GenAI-powered data management assistant. Further, it offers maintenance and professional services. The company sells its products through its direct sales team. The company was founded in 1993 and is headquartered in Redwood City, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"Zoetis Inc.","Symbol":"ZTS","Current Price":"158.52","Latest MA":"178.57","Price Target":207.59941,"Difference from MA":"-11.23%","Difference from Open":"-3.33%","Change from Yesterday":"-3.89%","Change from Last Report":"-0.01","Latest Volume":"2,502,276","Market Cap":"71,518,674,944","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":22.967457,"PB Ratio":13.676129,"Previous Close":164.93,"ROE":0.47303,"DTE":129.442,"Industry":"Drug Manufacturers - Specialty & Generic","Sector":"Healthcare","Beta":0.896,"Trailing PEG":2.5654,"Trailing PE":28.927008,"Trailing PS":7.8145404,"Quick Ratio":1.836,"Day High":164.54,"Day Low":157.5,"VS Average Volume":0.9275167422,"Company Summary":"Zoetis Inc. engages in the discovery, development, manufacture, and commercialization of animal health medicines, vaccines, and diagnostic products and services in the United States and internationally. The company commercializes products primarily across species, including livestock, such as cattle, swine, poultry, fish, and sheep and others; and companion animals comprising dogs, cats, and horses. It also offers parasiticides, vaccines, dermatology, other pharmaceutical, anti-infectives, animal health diagnostics, and medicated feed additives. In addition, the company provides animal health diagnostics, including point-of-care diagnostic products, instruments and reagents, rapid immunoassay tests, reference laboratory kits and services, and blood glucose monitors; and other non-pharmaceutical products, which include nutritionals, as well as products and services in biodevices, genetic tests, and precision animal health. It markets its products to veterinarians, livestock producers, and pet owners. The company has collaboration Blacksmith Medicines, Inc. to discover and develop novel antibiotics for animal health. Zoetis Inc. was founded in 1952 and is headquartered in Parsippany, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"Crocs, Inc.","Symbol":"CROX","Current Price":"108.41","Latest MA":"120.72","Price Target":130.02357,"Difference from MA":"-10.20%","Difference from Open":"-1.09%","Change from Yesterday":"-1.49%","Change from Last Report":"-0.05","Latest Volume":"651,421","Market Cap":"6,124,882,432","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":7.82893,"PB Ratio":3.674995,"Previous Close":110.05,"ROE":0.57069,"DTE":102.834,"Industry":"Footwear & Accessories","Sector":"Consumer Cyclical","Beta":2.017,"Trailing PEG":null,"Trailing PE":6.8265114,"Trailing PS":1.5039864,"Quick Ratio":0.826,"Day High":110.73,"Day Low":107.48,"VS Average Volume":0.438392791,"Company Summary":"Crocs, Inc., together with its subsidiaries, designs, develops, manufactures, markets, distributes, and sells casual lifestyle footwear and accessories for men, women, and children under Crocs and HEYDUDE Brand in the United States and internationally. The company offers various footwear products, including clogs, sandals, slides, flips, wedges, platforms, socks, boots, charms, flip flops, sneakers, and slippers. It sells its products through wholesalers, retail stores, e-commerce sites, third-party marketplaces, and kiosks\/store-in-store locations. Crocs, Inc. was founded in 1999 and is headquartered in Broomfield, Colorado.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"Digital Realty Trust, Inc.","Symbol":"DLR","Current Price":"164.83","Latest MA":"166.16","Price Target":188.79167,"Difference from MA":"-0.80%","Difference from Open":"0.01%","Change from Yesterday":"0.01%","Change from Last Report":"0.16","Latest Volume":"1,931,448","Market Cap":"55,730,507,776","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":139.68645,"PB Ratio":2.6623273,"Previous Close":164.81,"ROE":0.01956,"DTE":79.825,"Industry":"REIT - Specialty","Sector":"Real Estate","Beta":0.609,"Trailing PEG":10.5005,"Trailing PE":132.92741,"Trailing PS":10.368748,"Quick Ratio":1.6,"Day High":165.5603,"Day Low":157.22,"VS Average Volume":0.9163597028,"Company Summary":"Digital Realty brings companies and data together by delivering the full spectrum of data center, colocation, and interconnection solutions. PlatformDIGITAL, the company's global data center platform, provides customers with a secure data meeting place and a proven Pervasive Datacenter Architecture (PDx) solution methodology for powering innovation and efficiently managing Data Gravity challenges. Digital Realty gives its customers access to the connected data communities that matter to them with a global data center footprint of 300+ facilities in 50+ metros across 25+ countries on six continents.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"Palo Alto Networks, Inc.","Symbol":"PANW","Current Price":"191.78","Latest MA":"180.29","Price Target":209.3551,"Difference from MA":"6.37%","Difference from Open":"-0.11%","Change from Yesterday":"-5.00%","Change from Last Report":"0.22","Latest Volume":"5,609,656","Market Cap":"125,844,389,888","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":52.884007,"PB Ratio":12.05996,"Previous Close":201.88,"ROE":0.74517995,"DTE":27.28,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.118,"Trailing PEG":2.2513,"Trailing PE":49.683292,"Trailing PS":15.676661,"Quick Ratio":0.771,"Day High":193.36,"Day Low":188.7584,"VS Average Volume":0.9630376861,"Company Summary":"Palo Alto Networks, Inc. provides cybersecurity solutions worldwide. The company's network security platforms include Prisma Access, a security services edge (SSE) solution, as well as Strata Cloud Manager, a network security management solution. It also provides cloud security solutions, including Prisma Cloud, a cloud native application protection platform; and Code to Cloud platform, as well as offers VM-Series and CN-Series virtual firewalls for inline network security on multi- and hybrid-cloud environments. In addition, the company provides security operation solutions through Cortex platform that includes Cortex XSIAM, an AI-driven security operations platform; Cortex XDR for the prevention, detection, and response to complex cybersecurity attacks; and Cortex XSOAR for security orchestration, automation, and response; and Cortex Xpanse for attack surface management, as well as offers threat intelligence and advisory services under the Unit 42 name. Further, it provides subscription services covering the areas of threat prevention, malware and persistent threat, URL filtering, laptop and mobile device protection, DNS security, Internet of Things security, SaaS security API, and SaaS security inline, as well as threat intelligence, and data loss prevention. Additionally, the company offers professional services, including architecture design and planning, implementation, configuration, and firewall migration; education services, such as certifications, as well as online and in-classroom training; and support services. It sells its products and services through its channel partners, as well as directly to medium to large enterprises, service providers, and government entities operating in various industries, including education, energy, financial services, government entities, healthcare, Internet and media, manufacturing, public sector, and telecommunications. The company was incorporated in 2005 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"DexCom, Inc.","Symbol":"DXCM","Current Price":"87.45","Latest MA":"77.61","Price Target":99.62261,"Difference from MA":"12.69%","Difference from Open":"1.65%","Change from Yesterday":"4.00%","Change from Last Report":"0.10","Latest Volume":"2,593,521","Market Cap":"34,158,510,080","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":35.342056,"PB Ratio":17.259226,"Previous Close":84.09,"ROE":0.32061002,"DTE":130.935,"Industry":"Medical Devices","Sector":"Healthcare","Beta":1.173,"Trailing PEG":1.3116,"Trailing PE":61.58627,"Trailing PS":8.638976,"Quick Ratio":2.033,"Day High":89.84,"Day Low":86.0,"VS Average Volume":0.7521485434,"Company Summary":"DexCom, Inc., a medical device company, focuses on the design, development, and commercialization of continuous glucose monitoring (CGM) systems in the United States and internationally. The company provides its systems for use by people with diabetes, as well as for use by healthcare providers. Its products include Dexcom G6 and Dexcom G7, integrated CGM systems for diabetes management; Dexcom Share, a remote monitoring system; Dexcom Real-Time API, which enables authorized third-party software developers to integrate real-time CGM data into their digital health apps and devices; and Dexcom ONE, that is designed to replace finger stick blood glucose testing for diabetes treatment decisions. It has also submitted FDA review for Dexcom Stelo for people with type 2 diabetes. The company has a collaboration and license agreement with Verily Life Sciences LLC and Verily Ireland Limited to develop blood-based or interstitial glucose monitoring products. It markets its products directly to endocrinologists, physicians, and diabetes educators. The company was incorporated in 1999 and is headquartered in San Diego, California.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"Wynn Resorts, Limited","Symbol":"WYNN","Current Price":"88.66","Latest MA":"86.45","Price Target":112.45556,"Difference from MA":"2.56%","Difference from Open":"4.89%","Change from Yesterday":"10.18%","Change from Last Report":"-0.02","Latest Volume":"4,373,913","Market Cap":"9,736,142,848","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":16.756123,"PB Ratio":"N\/A","Previous Close":80.47,"ROE":"N\/A","DTE":"N\/A","Industry":"Resorts & Casinos","Sector":"Consumer Cyclical","Beta":1.802,"Trailing PEG":2.0763,"Trailing PE":10.643397,"Trailing PS":1.36559,"Quick Ratio":1.019,"Day High":88.7493,"Day Low":83.525,"VS Average Volume":1.9374858252,"Company Summary":"Wynn Resorts, Limited designs, develops, and operates integrated resorts. The company operates through four segments: Wynn Palace, Wynn Macau, Las Vegas Operations, and Encore Boston Harbor. The Wynn Palace segment operates private gaming salons and sky casinos; a luxury hotel tower with suites, and villas, including a health club, spa, salon, and pool; food and beverage outlets; retail space; meeting and convention space; and performance lake and floral art displays. The Wynn Macau segment operates casino space with private gaming salons, sky casinos, and a poker room; a luxury hotel tower, that include health clubs, spas, a salon, and a pool; food and beverage outlets; retail space; meeting and convention space; and Chinese zodiac-inspired ceiling attractions. The Las Vegas Operations segment operates casino space with private gaming salons, a sky casino, a poker room, and a race and sports book; a luxury hotel tower with suites, and villas, including swimming pools, private cabanas, full-service spas and salons, and a wedding chapel; food and beverage outlets; meeting and convention space; retail space; and theaters, nightclubs, a beach club. The Encore Boston Harbor segment operates casino space with gaming areas, and a poker room; a luxury hotel tower including a spa and salon; food and beverage outlets and a nightclub; retail space; meeting and convention space; and a waterfront park, floral displays, and water shuttle service. Wynn Resorts, Limited was incorporated in 2002 and is based in Las Vegas, Nevada.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"Datadog, Inc.","Symbol":"DDOG","Current Price":"130.97","Latest MA":"129.95","Price Target":160.8045,"Difference from MA":"0.79%","Difference from Open":"-1.97%","Change from Yesterday":"-3.62%","Change from Last Report":"0.05","Latest Volume":"3,225,665","Market Cap":"44,495,224,832","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":60.607674,"PB Ratio":16.867355,"Previous Close":135.89,"ROE":0.08663999,"DTE":36.865,"Industry":"Software - Application","Sector":"Technology","Beta":1.095,"Trailing PEG":0.857,"Trailing PE":251.87502,"Trailing PS":17.544071,"Quick Ratio":2.07,"Day High":135.81,"Day Low":129.7101,"VS Average Volume":0.6437703956,"Company Summary":"Datadog, Inc. operates an observability and security platform for cloud applications in North America and internationally. The company's products comprise infrastructure and application performance monitoring, log management, digital experience monitoring, continuous profiler, database monitoring, data streams and universal service monitoring, network monitoring, incident management, workflow automation, observability pipelines, cloud cost and cloud security management, application security management, cloud SIEM, sensitive data scanner, and CI visibility. Datadog, Inc. was incorporated in 2010 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"Airbnb, Inc.","Symbol":"ABNB","Current Price":"163.30","Latest MA":"131.40","Price Target":147.94441,"Difference from MA":"24.28%","Difference from Open":"3.23%","Change from Yesterday":"15.78%","Change from Last Report":"0.01","Latest Volume":"11,563,863","Market Cap":"102,025,265,152","Earning Date":"2025-02-13","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":32.01176,"PB Ratio":12.274505,"Previous Close":141.04,"ROE":0.20873,"DTE":26.614,"Industry":"Travel Services","Sector":"Consumer Cyclical","Beta":1.156,"Trailing PEG":20.8039,"Trailing PE":39.82927,"Trailing PS":9.411924,"Quick Ratio":1.008,"Day High":163.9,"Day Low":156.93,"VS Average Volume":2.6074128607,"Company Summary":"Airbnb, Inc., together with its subsidiaries, operates a platform that enables hosts to offer stays and experiences to guests worldwide. The company's marketplace connects hosts and guests online or through mobile devices to book spaces and experiences. It primarily offers private rooms, primary homes, and vacation homes. The company was formerly known as AirBed & Breakfast, Inc. and changed its name to Airbnb, Inc. in November 2010. Airbnb, Inc. was founded in 2007 and is headquartered in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"Brookfield Corporation","Symbol":"BN","Current Price":"60.77","Latest MA":"53.71","Price Target":66.625,"Difference from MA":"13.13%","Difference from Open":"-1.00%","Change from Yesterday":"0.64%","Change from Last Report":"-0.14","Latest Volume":"660,457","Market Cap":"91,656,708,096","Earning Date":"2025-02-13","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.3517885,"PB Ratio":2.221349,"Previous Close":60.38,"ROE":0.02106,"DTE":147.727,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.753,"Trailing PEG":null,"Trailing PE":196.01613,"Trailing PS":0.9384806,"Quick Ratio":0.88,"Day High":61.5,"Day Low":60.75,"VS Average Volume":0.3112764343,"Company Summary":"Brookfield Corporation is an alternative asset manager and REIT\/Real Estate Investment Manager firm focuses on real estate, renewable power, infrastructure and venture capital and private equity assets. It manages a range of public and private investment products and services for institutional and retail clients. It typically makes investments in sizeable, premier assets across geographies and asset classes. It invests both its own capital as well as capital from other investors. Within private equity and venture capital, it focuses on acquisition, early ventures, control buyouts and financially distressed, buyouts and corporate carve-outs, recapitalizations, convertible, senior and mezzanine financings, operational and capital structure restructuring, strategic re-direction, turnaround, and under-performing midmarket companies. It invests in both public debt and equity markets. It invests in private equity sectors with focus on Business Services include infrastructure, healthcare, road fuel distribution and marketing, construction and real estate; Industrials include manufacturers of automotive batteries, graphite electrodes, returnable plastic packaging, and sanitation management and development; and Residential\/ infrastructure services. It targets companies which likely possess underlying real assets, primarily in sectors such as industrial products, building materials, metals, mining, homebuilding, oil and gas, paper and packaging, manufacturing and forest product sectors. It invests globally with focus on North America including Brazil, the United States, Canada; Europe; and Australia; and Asia-Pacific. The firm considers equity investments in the range of $2 million to $500 million. It has a four-year investment period and a 10-year term with two one-year extensions. The firm prefers to take minority stake and majority stake. Brookfield Corporation was founded in 1997 and based in Toronto, Canada with additional offices across Northern America; South America; Europe; Middle East and Asia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"Cisco Systems, Inc.","Symbol":"CSCO","Current Price":"64.30","Latest MA":"54.35","Price Target":68.53708,"Difference from MA":"18.29%","Difference from Open":"0.76%","Change from Yesterday":"0.71%","Change from Last Report":"0.06","Latest Volume":"6,265,622","Market Cap":"256,071,548,928","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":16.08835,"PB Ratio":5.6677537,"Previous Close":63.84,"ROE":0.20761,"DTE":70.647,"Industry":"Communication Equipment","Sector":"Technology","Beta":"N\/A","Trailing PEG":2.8673,"Trailing PE":28.19956,"Trailing PS":4.8337274,"Quick Ratio":0.648,"Day High":64.345,"Day Low":63.44,"VS Average Volume":0.3138357891,"Company Summary":"Cisco Systems, Inc. designs, manufactures, and sells Internet Protocol based networking and other products related to the communications and information technology industry in the Americas, Europe, the Middle East, Africa, the Asia Pacific, Japan, and China. The company also offers switching portfolio encompasses campus switching as well as data center switching; enterprise routing portfolio interconnects public and private wireline and mobile networks, delivering highly secure, and reliable connectivity to campus, data center and branch networks; and wireless products include indoor and outdoor wireless coverage designed for seamless roaming use of voice, video, and data applications. In addition, it provides security, which comprising network security, identity and access management, secure access service edge, and threat intelligence, detection, and response offerings; collaboration products, such as Webex Suite, collaboration devices, contact center, and communication platform as a service; end-to-end collaboration solutions that can be delivered from the cloud, on-premise or within hybrid cloud environments allowing customers to transition their collaboration solutions from on-premise to the cloud; and observability offers network assurance, monitoring and analytics and observability suite. Further, the company offers a range of service and support options for its customers, including technical support and advanced services and advisory services. It serves businesses of various sizes, public institutions, governments, and service providers. The company sells its products and services directly, as well as through systems integrators, service providers, other resellers, and distributors. Cisco Systems, Inc. has strategic alliances with other companies. Cisco Systems, Inc. was incorporated in 1984 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"CVS Health Corporation","Symbol":"CVS","Current Price":"66.42","Latest MA":"55.58","Price Target":70.3776,"Difference from MA":"19.51%","Difference from Open":"-0.70%","Change from Yesterday":"0.08%","Change from Last Report":"-0.22","Latest Volume":"2,364,654","Market Cap":"83,742,334,976","Earning Date":"2025-02-12","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":9.700173,"PB Ratio":1.1149158,"Previous Close":66.37,"ROE":0.06697,"DTE":110.116,"Industry":"Healthcare Plans","Sector":"Healthcare","Beta":0.543,"Trailing PEG":0.6986,"Trailing PE":18.14754,"Trailing PS":0.22802791,"Quick Ratio":0.542,"Day High":66.89,"Day Low":66.06,"VS Average Volume":0.1715597865,"Company Summary":"CVS Health Corporation provides health solutions in the United States. It operates through Health Care Benefits, Health Services, and Pharmacy & Consumer Wellness segments. The Health Care Benefits segment offers traditional, voluntary, and consumer-directed health insurance products and related services. It serves employer groups, individuals, college students, part-time and hourly workers, health plans, health care providers, governmental units, government-sponsored plans, labor groups, and expatriates. The Health Services segment offers pharmacy benefit management solutions, including plan design and administration, formulary management, retail pharmacy network management, specialty and mail order pharmacy, clinical, disease management, and medical spend management services. It serves employers, insurance companies, unions, government employee groups, health plans, prescription drug plans, Medicaid managed care plans, CMS, plans offered on public health insurance, and other sponsors of health benefit plans. The Pharmacy & Consumer Wellness segment sells prescription and over-the-counter drugs, consumer health and beauty products, and personal care products. This segment also distributes prescription drugs; and provides related pharmacy consulting and other ancillary services to care facilities and other care settings. It operates online retail pharmacy websites, LTC pharmacies and on-site pharmacies, retail specialty pharmacy stores, compounding pharmacies and branches for infusion and enteral nutrition services. The company was formerly known as CVS Caremark Corporation and changed its name to CVS Health Corporation in September 2014. CVS Health Corporation was incorporated in 1996 and is headquartered in Woonsocket, Rhode Island.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"Antero Resources Corporation","Symbol":"AR","Current Price":"39.43","Latest MA":"30.99","Price Target":42.59091,"Difference from MA":"27.24%","Difference from Open":"-2.28%","Change from Yesterday":"-1.79%","Change from Last Report":"-0.35","Latest Volume":"816,631","Market Cap":"12,269,827,072","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":10.691084,"PB Ratio":1.7570518,"Previous Close":40.15,"ROE":0.0130900005,"DTE":59.551,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":3.378,"Trailing PEG":0.9308,"Trailing PE":281.64285,"Trailing PS":2.8719018,"Quick Ratio":0.261,"Day High":40.5,"Day Low":39.43,"VS Average Volume":0.1920361859,"Company Summary":"Antero Resources Corporation, an independent oil and natural gas company, engages in the development, production, exploration, and acquisition of natural gas, natural gas liquids (NGLs), and oil properties in the United States. It operates in three segments: Exploration and Development; Marketing; and Equity Method Investment in Antero Midstream. As of December 31, 2023, the company had approximately 515,000 net acres in the Appalachian Basin; and approximately 172,000 net acres in the Upper Devonian Shale. Its gathering and compression systems also comprise 631 miles of gas gathering pipelines in the Appalachian Basin. The company was formerly known as Antero Resources Appalachian Corporation and changed its name to Antero Resources Corporation in June 2013. Antero Resources Corporation was incorporated in 2002 and is headquartered in Denver, Colorado.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"Tenet Healthcare Corporation","Symbol":"THC","Current Price":"135.22","Latest MA":"147.85","Price Target":172.16,"Difference from MA":"-8.55%","Difference from Open":"0.88%","Change from Yesterday":"1.24%","Change from Last Report":"0.34","Latest Volume":"466,950","Market Cap":"12,859,016,192","Earning Date":"2025-02-12","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":10.309938,"PB Ratio":3.353421,"Previous Close":133.57,"ROE":0.59564996,"DTE":159.393,"Industry":"Medical Care Facilities","Sector":"Healthcare","Beta":2.15,"Trailing PEG":0.6196,"Trailing PE":4.135168,"Trailing PS":0.61315167,"Quick Ratio":1.383,"Day High":136.375,"Day Low":132.59,"VS Average Volume":0.3518985339,"Company Summary":"Tenet Healthcare Corporation operates as a diversified healthcare services company in the United States. The company operates through two segments: Hospital Operations and Services, and Ambulatory Care. Its general hospitals offer acute care services, operating and recovery rooms, radiology and respiratory therapy services, clinical laboratories, and pharmacies. The company also provides intensive and critical care, and\/or coronary care units; cardiovascular, digestive disease, neurosciences, musculoskeletal, and obstetrics services; outpatient services, including physical therapy; tertiary care services, such as cardiothoracic surgery, complex spinal surgery, neonatal intensive care, and neurosurgery services; quaternary care services in heart and kidney transplants; and limb salvaging vascular procedure, acute level 1 trauma, intravascular stroke care, minimally invasive cardiac valve replacement, imaging, surgical robotic, and telemedicine access services. In addition, it offers a range of procedures and services, such as orthopedics, total joint replacement, and spinal and other musculoskeletal procedures; gastroenterology; pain management; otolaryngology; ophthalmology; and urology. It operates hospitals, ambulatory surgery centers, imaging centers, surgical hospitals, off-campus emergency departments, and micro-hospitals. Tenet Healthcare Corporation was founded in 1967 and is headquartered in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"MGM Resorts International","Symbol":"MGM","Current Price":"40.59","Latest MA":"37.49","Price Target":48.98667,"Difference from MA":"8.26%","Difference from Open":"-1.50%","Change from Yesterday":"0.54%","Change from Last Report":"-0.05","Latest Volume":"1,537,672","Market Cap":"11,948,641,280","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":14.535258,"PB Ratio":3.7286425,"Previous Close":40.37,"ROE":0.2901,"DTE":841.031,"Industry":"Resorts & Casinos","Sector":"Consumer Cyclical","Beta":2.241,"Trailing PEG":2.2372,"Trailing PE":16.912498,"Trailing PS":0.6938149,"Quick Ratio":1.062,"Day High":41.32,"Day Low":40.42,"VS Average Volume":0.3510197839,"Company Summary":"MGM Resorts International, through its subsidiaries, owns and operates casino, hotel, and entertainment resorts in the United States and internationally. The company operates through three segments: Las Vegas Strip Resorts, Regional Operations, and MGM China. Its casino resorts offer gaming, hotel, convention, dining, entertainment, retail, and other resort amenities. The company's casino operations include slots and table games, as well as online sports betting and iGaming through BetMGM. Its customers include premium gaming customers; leisure and wholesale travel customers; business travelers; and group customers, including conventions, trade associations, and small meetings. The company was formerly known as MGM MIRAGE and changed its name to MGM Resorts International in June 2010. MGM Resorts International was incorporated in 1986 and is based in Las Vegas, Nevada.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"The Kraft Heinz Company","Symbol":"KHC","Current Price":"29.25","Latest MA":"32.46","Price Target":33.37619,"Difference from MA":"-9.89%","Difference from Open":"0.10%","Change from Yesterday":"-0.02%","Change from Last Report":"0.05","Latest Volume":"2,092,002","Market Cap":"34,947,481,600","Earning Date":"2025-02-12","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":10.195793,"PB Ratio":0.7316006,"Previous Close":29.25,"ROE":0.027999999,"DTE":41.451,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.475,"Trailing PEG":0.7903,"Trailing PE":12.940266,"Trailing PS":1.3374467,"Quick Ratio":0.448,"Day High":29.59,"Day Low":29.2,"VS Average Volume":0.1981232293,"Company Summary":"The Kraft Heinz Company, together with its subsidiaries, manufactures and markets food and beverage products in North America and internationally. Its products include condiments and sauces, cheese and dairy products, meals, meats, refreshment beverages, coffee, and other grocery products under the Kraft, Oscar Mayer, Heinz, Philadelphia, Lunchables, Velveeta, Ore-Ida, Maxwell House, Kool-Aid, Jell-O, Heinz, ABC, Master, Quero, Kraft, Golden Circle, Wattie's, Pudliszki, and Plasmon brands. It sells its products through its own sales organizations, as well as through independent brokers, agents, and distributors to chain, wholesale, cooperative, and independent grocery accounts; convenience, value, and club stores; pharmacies and drug stores; mass merchants; foodservice distributors; institutions, including hotels, restaurants, bakeries, hospitals, health care facilities, and government agencies; and online through various e-commerce platforms and retailers. The company was formerly known as H.J. Heinz Holding Corporation and changed its name to The Kraft Heinz Company in July 2015. The Kraft Heinz Company was founded in 1869 and is based in Pittsburgh, Pennsylvania.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"Paramount Global","Symbol":"PARA","Current Price":"11.00","Latest MA":"10.72","Price Target":12.75429,"Difference from MA":"2.61%","Difference from Open":"0.92%","Change from Yesterday":"1.76%","Change from Last Report":"0.04","Latest Volume":"2,774,353","Market Cap":"7,834,155,520","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":7.3129063,"PB Ratio":0.44123545,"Previous Close":10.81,"ROE":-0.30080998,"DTE":91.924,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.767,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.27138793,"Quick Ratio":0.938,"Day High":11.03,"Day Low":10.84,"VS Average Volume":0.282106246,"Company Summary":"Paramount Global operates as a media, streaming, and entertainment company worldwide. It operates through TV Media, Direct-to-Consumer, and Filmed Entertainment segments. The TV Media segment operates CBS Television Network, a domestic broadcast television network; CBS Stations, a television station; and international free-to-air networks comprising Network 10, Channel 5, Telefe, and Chilevisión; domestic premium and basic cable networks, such as Paramount+ with Showtime, MTV, Comedy Central, Paramount Network, The Smithsonian Channel, Nickelodeon, BET Media Group, and CBS Sports Network; and international extensions of these brands. This segment also offers domestic and international television studio operations, including CBS Studios, Paramount Television Studios, and Showtime\/MTV Entertainment Studios; CBS Media Ventures, which produces and distributes first-run syndicated programming; and digital properties consisting of CBS News Streaming and CBS Sports HQ. The Direct-to-Consumer segment provides a portfolio of domestic and international pay and free streaming services, including Paramount+, Pluto TV, BET+, and Noggin. The Filmed Entertainment segment produces and acquires films, series, and short-form content for release and licensing around the world, including in theaters, on streaming services, on television, through digital home entertainment, and DVDs\/Blu-rays; and operates a portfolio consisting of Paramount Pictures, Paramount Players, Paramount Animation, Nickelodeon Studio, Awesomeness, and Miramax. It also offers production, distribution, and advertising solutions. The company was formerly known as ViacomCBS Inc. and changed its name to Paramount Global in February 2022. The company was founded in 1914 and is headquartered in New York, New York. Paramount Global is a subsidiary of National Amusements, Inc.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"NiSource Inc","Symbol":"NI","Current Price":"39.84","Latest MA":"34.49","Price Target":40.54286,"Difference from MA":"15.51%","Difference from Open":"0.52%","Change from Yesterday":"0.59%","Change from Last Report":"0.00","Latest Volume":"751,034","Market Cap":"18,720,059,392","Earning Date":"2025-02-12","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":19.799791,"PB Ratio":2.2277837,"Previous Close":39.6,"ROE":0.08756,"DTE":131.811,"Industry":"Utilities - Regulated Gas","Sector":"Utilities","Beta":0.507,"Trailing PEG":2.2411,"Trailing PE":24.589506,"Trailing PS":3.539232,"Quick Ratio":0.207,"Day High":39.985,"Day Low":39.54,"VS Average Volume":0.1989585745,"Company Summary":"NiSource Inc., an energy holding company, operates as a regulated natural gas and electric utility company in the United States. It operates in two segments, Gas Distribution Operations and Electric Operations. The company distributes natural gas to approximately 3.3 million customers through approximately 55,000 miles of distribution main pipeline and the associated individual customer service lines; and 1,000 miles of transmission main pipeline in northern Indiana, Ohio, Pennsylvania, Virginia, Kentucky, and Maryland. It also generates, transmits, and distributes electricity to approximately 0.5 million customers in various counties in the northern part of Indiana, as well as engages in wholesale electric and transmission transactions. It owns and operates coal-fired electric generating stations in Wheatfield and Michigan City; combined cycle gas turbine in West Terre Haute; natural gas generating units in Wheatfield; hydro generating plants in Carroll County and White County; wind generating units in White County, Indiana; and solar generating units in Jasper County and White County. The company was formerly known as NIPSCO Industries, Inc. and changed its name to NiSource Inc. in April 1999. NiSource Inc. was founded in 1847 and is headquartered in Merrillville, Indiana.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"Reddit, Inc.","Symbol":"RDDT","Current Price":"194.50","Latest MA":"113.47","Price Target":201.15788,"Difference from MA":"71.41%","Difference from Open":"-3.71%","Change from Yesterday":"-5.10%","Change from Last Report":"-0.61","Latest Volume":"3,191,229","Market Cap":"35,185,827,840","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":49.053608,"PB Ratio":17.129019,"Previous Close":204.95,"ROE":-0.31801,"DTE":1.364,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":"N\/A","Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":31.35299,"Quick Ratio":11.834,"Day High":203.95,"Day Low":194.24,"VS Average Volume":0.5213587356,"Company Summary":"Reddit, Inc. operates a website that organizes digital communities. It organizes communities based on specific interests that enable users to engage in conversations by sharing experiences, submitting links, uploading images and videos, and replying to one another. The company was founded in 2005 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"The Trade Desk, Inc.","Symbol":"TTD","Current Price":"81.32","Latest MA":"113.51","Price Target":114.93939,"Difference from MA":"-28.36%","Difference from Open":"-1.49%","Change from Yesterday":"-0.73%","Change from Last Report":"-0.22","Latest Volume":"8,032,327","Market Cap":"40,136,548,352","Earning Date":"2025-02-12","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":36.691967,"PB Ratio":15.282503,"Previous Close":81.92,"ROE":0.12891,"DTE":11.167,"Industry":"Software - Application","Sector":"Technology","Beta":1.47,"Trailing PEG":1.6109,"Trailing PE":104.254105,"Trailing PS":17.378017,"Quick Ratio":1.805,"Day High":83.6,"Day Low":81.0301,"VS Average Volume":1.6917452637,"Company Summary":"The Trade Desk, Inc. operates as a technology company in the United States and internationally. The company offers a self-service cloud-based platform that allows buyers to plan, manage, optimize, and measure data-driven digital advertising campaigns across various ad formats and channels, including video, display, audio, digital-out-of-home, native, and social on various devices, such as computers, mobile devices, televisions, and streaming devices. It provides data and other value-added services. The company serves advertising agencies, brands, and other service providers for advertisers. The Trade Desk, Inc. was incorporated in 2009 and is headquartered in Ventura, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"Fidelity National Information S","Symbol":"FIS","Current Price":"69.92","Latest MA":"81.90","Price Target":85.90385,"Difference from MA":"-14.63%","Difference from Open":"-0.82%","Change from Yesterday":"-0.86%","Change from Last Report":"0.04","Latest Volume":"874,394","Market Cap":"37,641,711,616","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":11.150448,"PB Ratio":2.291407,"Previous Close":70.53,"ROE":0.03034,"DTE":66.387,"Industry":"Information Technology Services","Sector":"Technology","Beta":1.074,"Trailing PEG":0.5342,"Trailing PE":49.239437,"Trailing PS":3.7525384,"Quick Ratio":0.661,"Day High":70.9,"Day Low":69.7001,"VS Average Volume":0.2716103148,"Company Summary":"Fidelity National Information Services, Inc. engages in the provision of financial services technology solutions for financial institutions, businesses, and developers worldwide. It operates through Banking Solutions, Capital Market Solutions, and Corporate and Other segments. The company provides core processing and ancillary applications; mobile and online banking; fraud, risk management, and compliance; card and retail payment; electronic funds transfer and network; wealth and retirement; and item processing and output solutions. It also offers trading and asset, lending, leveraged and syndicated loan markets, and treasury and risk solutions. The company was founded in 1968 and is headquartered in Jacksonville, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"Coca-Cola Company (The)","Symbol":"KO","Current Price":"69.68","Latest MA":"65.89","Price Target":73.7932,"Difference from MA":"5.75%","Difference from Open":"0.45%","Change from Yesterday":"0.26%","Change from Last Report":"-0.02","Latest Volume":"5,269,557","Market Cap":"299,763,367,936","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":21.817884,"PB Ratio":11.324557,"Previous Close":69.5,"ROE":0.3723,"DTE":167.358,"Industry":"Beverages - Non-Alcoholic","Sector":"Consumer Defensive","Beta":0.62,"Trailing PEG":2.9449,"Trailing PE":28.325203,"Trailing PS":6.465155,"Quick Ratio":0.784,"Day High":70.03,"Day Low":69.365,"VS Average Volume":0.2965017226,"Company Summary":"The Coca-Cola Company, a beverage company, manufactures, markets, and sells various nonalcoholic beverages worldwide. The company provides sparkling soft drinks, sparkling flavors; water, sports, coffee, and tea; juice, value-added dairy, and plant-based beverages; and other beverages. It also offers beverage concentrates and syrups, as well as fountain syrups to fountain retailers, such as restaurants and convenience stores. The company sells its products under the Coca-Cola, Diet Coke\/Coca-Cola Light, Coca-Cola Zero Sugar, caffeine free Diet Coke, Cherry Coke, Fanta Orange, Fanta Zero Orange, Fanta Zero Sugar, Fanta Apple, Sprite, Sprite Zero Sugar, Simply Orange, Simply Apple, Simply Grapefruit, Fresca, Schweppes, Thums Up, Aquarius, Ayataka, BODYARMOR, Ciel, Costa, Dasani, dogadan, FUZE TEA, Georgia, glacéau smartwater, glacéau vitaminwater, Gold Peak, Ice Dew, I LOHAS, Powerade, Topo Chico, AdeS, Del Valle, fairlife, innocent, Minute Maid, and Minute Maid Pulpy brands. It operates through a network of independent bottling partners, distributors, wholesalers, and retailers, as well as through bottling and distribution operators. The company was founded in 1886 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"Royalty Pharma plc","Symbol":"RPRX","Current Price":"32.51","Latest MA":"27.65","Price Target":40.36444,"Difference from MA":"17.55%","Difference from Open":"0.23%","Change from Yesterday":"0.14%","Change from Last Report":"-0.05","Latest Volume":"825,341","Market Cap":"18,737,604,608","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":6.97402,"PB Ratio":2.1104403,"Previous Close":32.46,"ROE":0.17276,"DTE":74.157,"Industry":"Biotechnology","Sector":"Healthcare","Beta":0.466,"Trailing PEG":7.044,"Trailing PE":17.018326,"Trailing PS":8.2690115,"Quick Ratio":1.532,"Day High":32.89,"Day Low":32.43,"VS Average Volume":0.2200740316,"Company Summary":"Royalty Pharma plc operates as a buyer of biopharmaceutical royalties and a funder of innovations in the biopharmaceutical industry in the United States. It is also involved in the identification, evaluation, and acquisition of royalties on various biopharmaceutical therapies. In addition, the company collaborates with innovators from academic institutions, research hospitals and not-for-profits, small and mid-cap biotechnology companies, and pharmaceutical companies. Its portfolio consists of royalties on approximately 35 commercial products and 14 development-stage product candidates that address various therapeutic areas, such as rare disease, cancer, neuroscience, immunology, respiratory, infectious disease, hematology, and diabetes. The company was founded in 1996 and is based in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"Super Micro Computer, Inc.","Symbol":"SMCI","Current Price":"46.92","Latest MA":"43.50","Price Target":47.51909,"Difference from MA":"7.86%","Difference from Open":"9.31%","Change from Yesterday":"10.97%","Change from Last Report":"0.54","Latest Volume":"55,151,403","Market Cap":"27,477,637,120","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":12.539214,"PB Ratio":5.034871,"Previous Close":42.28,"ROE":0.32469,"DTE":39.749,"Industry":"Computer Hardware","Sector":"Technology","Beta":1.279,"Trailing PEG":null,"Trailing PE":23.345772,"Trailing PS":1.838848,"Quick Ratio":1.805,"Day High":47.33,"Day Low":42.85,"VS Average Volume":0.7528862282,"Company Summary":"Super Micro Computer, Inc., together with its subsidiaries, develops and manufactures high performance server and storage solutions based on modular and open architecture in the United States, Europe, Asia, and internationally. Its solutions range from complete server, storage systems, modular blade servers, blades, workstations, full racks, networking devices, server sub-systems, server management software, and security software. The company provides application-optimized server solutions, rackmount and blade servers, storage, and subsystems and accessories; and server software management solutions, such as Server Management Suite, including Supermicro Server Manager, Supermicro Power Management software, Supermicro Update Manager, SuperCloud Composer, and SuperDoctor 5. In addition, it offers server subsystems and accessories comprising server boards, chassis, power supplies, and other accessories. Further, the company provides server and storage system integration, configuration, and software upgrade and update services; and technical documentation services, as well as identifies service requirements, creates and executes project plans, and conducts verification testing and technical documentation, and training services. Additionally, it offers help desk and on-site product support services for its server and storage systems; and customer support services, including ongoing maintenance and technical support for its products. The company provides its products to enterprise data centers, cloud computing, artificial intelligence, and 5G and edge computing markets. It sells its products through direct and indirect sales force, distributors, value-added resellers, system integrators, and original equipment manufacturers. The company was incorporated in 1993 and is headquartered in San Jose, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"DuPont de Nemours, Inc.","Symbol":"DD","Current Price":"84.71","Latest MA":"80.84","Price Target":96.58824,"Difference from MA":"4.78%","Difference from Open":"0.29%","Change from Yesterday":"0.79%","Change from Last Report":"-0.14","Latest Volume":"690,512","Market Cap":"35,408,437,248","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":17.546814,"PB Ratio":1.4620872,"Previous Close":84.05,"ROE":0.02187,"DTE":31.03,"Industry":"Specialty Chemicals","Sector":"Basic Materials","Beta":1.338,"Trailing PEG":0.4564,"Trailing PE":47.858986,"Trailing PS":2.9042354,"Quick Ratio":1.403,"Day High":84.97,"Day Low":84.13,"VS Average Volume":0.312473188,"Company Summary":"DuPont de Nemours, Inc. provides technology-based materials and solutions in the United States, Canada, the Asia Pacific, Latin America, Europe, the Middle East, and Africa. It operates through Electronics & Industrial, Water & Protection, and Corporate & Other segments. The Electronics & Industrial segment supplies materials and solutions for the fabrication of semiconductors and integrated circuits. This segment also provides semiconductor and advanced packaging materials; dielectric and metallization solutions for chip packaging; and silicones for light emitting diode packaging and semiconductor applications; permanent and process chemistries for the fabrication of printed circuit boards to include laminates and substrates, and electroless and electrolytic metallization solutions, and electromagnetic shielding and thermal management solutions, as well as patterning solutions, and materials and metallization processes for metal finishing, decorative, and industrial applications. In addition, it offers various materials to manufacture rigid and flexible displays for organic light emitting diode, and other display applications; provides high performance parts, and specialty silicone elastomers, and lubricants to automotive, aerospace, electronics, industrial, and healthcare markets; and photopolymer plates and platemaking systems used in flexographic printing, and digital inks for textile, commercial, and home-office printing applications. The Water & Protection segment provides engineered products and integrated systems for worker safety, water purification and separation, transportation, energy, medical packaging and building materials. The Corporate & Other segment offers auto adhesives and fluids; Multibase; and Tedlar products. The company was formerly known as DowDuPont Inc. and changed its name to DuPont de Nemours, Inc. in June 2019. DuPont de Nemours, Inc. was incorporated in 2015 and is headquartered in Wilmington, Delaware.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"GlobalFoundries Inc.","Symbol":"GFS","Current Price":"43.41","Latest MA":"43.18","Price Target":47.79,"Difference from MA":"0.53%","Difference from Open":"-0.21%","Change from Yesterday":"1.38%","Change from Last Report":"0.21","Latest Volume":"353,379","Market Cap":"23,990,753,280","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":17.580734,"PB Ratio":2.0802186,"Previous Close":42.82,"ROE":0.066479996,"DTE":24.599,"Industry":"Semiconductors","Sector":"Technology","Beta":1.527,"Trailing PEG":0.942,"Trailing PE":"N\/A","Trailing PS":3.5415933,"Quick Ratio":1.74,"Day High":44.2532,"Day Low":43.0301,"VS Average Volume":0.1943629203,"Company Summary":"GlobalFoundries Inc., a semiconductor foundry, provides range of mainstream wafer fabrication services and technologies worldwide. It manufactures various semiconductor devices, including microprocessors, mobile application processors, baseband processors, network processors, radio frequency modems, microcontrollers, and power management units. GlobalFoundries Inc. has a strategic partnership with Efficient Computer to develop high-performance computer processors. The company was incorporated in 2008 and is headquartered in Malta, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"Edwards Lifesciences Corporatio","Symbol":"EW","Current Price":"76.39","Latest MA":"70.32","Price Target":80.42233,"Difference from MA":"8.64%","Difference from Open":"0.25%","Change from Yesterday":"0.51%","Change from Last Report":"-0.01","Latest Volume":"634,432","Market Cap":"45,054,820,352","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":27.769093,"PB Ratio":4.7200937,"Previous Close":76.0,"ROE":0.19139,"DTE":7.353,"Industry":"Medical Devices","Sector":"Healthcare","Beta":1.12,"Trailing PEG":5.7337,"Trailing PE":32.6453,"Trailing PS":7.1346846,"Quick Ratio":2.704,"Day High":76.58,"Day Low":75.74,"VS Average Volume":0.1300645,"Company Summary":"Edwards Lifesciences Corporation provides products and technologies for structural heart disease and critical care monitoring in the United States, Europe, Japan, and internationally. It offers transcatheter heart valve replacement products for the minimally invasive replacement of aortic heart valves under the Edwards SAPIEN family of valves system; and transcatheter heart valve repair and replacement products to treat mitral and tricuspid valve diseases under the PASCAL PRECISION and Cardioband names. The company also provides surgical structural heart solutions, such as aortic surgical valve under the INSPIRIS name; INSPIRIS RESILLA aortic valve, which offers RESILIA tissue and VFit technology; KONECT RESILIA, a pre-assembled tissue valves conduit for complex combined procedures; and MITRIS RESILIA valve. In addition, it offers critical care solutions, including hemodynamic monitoring systems to measure a patient's heart function and fluid status in surgical and intensive care settings under the FloTrac, Acumen IQ sensors, ClearSight, Acumen IQ cuffs, and ForeSight names; HemoSphere, a monitoring platform that displays physiological information; and Acumen Hypotension Prediction Index software that alerts clinicians in advance of a patient developing dangerously low blood pressure. The company distributes its products through a direct sales force and independent distributors. Edwards Lifesciences Corporation was founded in 1958 and is headquartered in Irvine, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"Carrier Global Corporation","Symbol":"CARR","Current Price":"64.53","Latest MA":"71.62","Price Target":77.88368,"Difference from MA":"-9.90%","Difference from Open":"0.83%","Change from Yesterday":"1.35%","Change from Last Report":"-0.24","Latest Volume":"1,675,951","Market Cap":"56,033,976,320","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":18.896048,"PB Ratio":3.9429305,"Previous Close":63.67,"ROE":0.13931,"DTE":85.607,"Industry":"Building Products & Equipment","Sector":"Industrials","Beta":1.212,"Trailing PEG":424.4667,"Trailing PE":52.89344,"Trailing PS":2.2593434,"Quick Ratio":0.513,"Day High":64.95,"Day Low":63.86,"VS Average Volume":0.3165873381,"Company Summary":"Carrier Global Corporation provides heating, ventilating, and air conditioning (HVAC), refrigeration, fire, security, and building automation technologies in the United States, Europe, the Asia Pacific, and internationally. It operates through three segments: HVAC, Refrigeration, and Fire & Security. The HVAC segment provides products, controls, services, and solutions to meet the heating, cooling, and ventilation needs of residential and commercial customers. Its products include air conditioners, heating systems, heat pumps, controls, and aftermarket components, as well as aftermarket repair and maintenance services and building automation solutions. The Refrigeration segment offers transport refrigeration and monitoring products and services, as well as digital solutions for trucks, trailers, shipping containers, intermodal applications, food retail, and warehouse cooling; and commercial refrigeration solutions, such as refrigerated cabinets, freezers, systems, and controls. The Fire & Security segment provides various residential, commercial, and industrial technologies, including fire, flame, gas, smoke, and carbon monoxide detection; portable fire extinguishers; fire suppression systems; intruder alarms; access control systems; video management systems; and electronic controls. This segment also offers fire and security service, such as audit, design, installation, and system integration, as well as aftermarket maintenance and repair and monitoring services. It offers its products under the Autronica, Det-Tronics, Edwards, Aritech, Fireye, GST, Kidde, LenelS2, Marioff, Onity, and Supra; Carrier, Toshiba, Automated Logic, Bryant, CIAT, Day & Night, Heil, NORESCO, and Riello; and Carrier Commercial Refrigeration, Carrier Transicold, and Sensitech brands. Carrier Global Corporation was incorporated in 2019 and is headquartered in Palm Beach Gardens, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"Zillow Group, Inc.","Symbol":"Z","Current Price":"77.92","Latest MA":"66.77","Price Target":85.0,"Difference from MA":"16.68%","Difference from Open":"-1.00%","Change from Yesterday":"-1.01%","Change from Last Report":"0.01","Latest Volume":"547,793","Market Cap":"18,700,535,808","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":32.968315,"PB Ratio":3.9049268,"Previous Close":78.71,"ROE":-0.028959999,"DTE":25.0,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":2.017,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":8.6737175,"Quick Ratio":2.689,"Day High":79.5,"Day Low":77.4409,"VS Average Volume":0.1973004289,"Company Summary":"Zillow Group, Inc. operates real estate brands in mobile applications and Websites in the United States. The company offers premier agent and rentals marketplaces, new construction marketplaces, advertising, display advertising, and business technology solutions, as well as dotloop and floor plans. It also provides mortgage originations and the sale of mortgages, and advertising to mortgage lenders and other mortgage professionals; and title and escrow services. In addition, the company's brand portfolio includes Zillow Premier Agent, Zillow Home Loans, Zillow Rentals, Trulia, StreetEasy, HotPads, and Out East; and a suite of marketing software and technology solutions for the real estate industry, including ShowingTime+, Spruce, and Follow Up Boss. Zillow Group, Inc. was incorporated in 2004 and is headquartered in Seattle, Washington.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"Shopify Inc.","Symbol":"SHOP","Current Price":"127.08","Latest MA":"89.95","Price Target":131.46152,"Difference from MA":"41.27%","Difference from Open":"1.05%","Change from Yesterday":"-0.45%","Change from Last Report":"0.12","Latest Volume":"3,042,963","Market Cap":"163,149,987,840","Earning Date":"2025-02-11","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":66.22166,"PB Ratio":16.223503,"Previous Close":127.65,"ROE":0.15031,"DTE":11.277,"Industry":"Software - Application","Sector":"Technology","Beta":2.365,"Trailing PEG":null,"Trailing PE":82.51864,"Trailing PS":19.867266,"Quick Ratio":5.62,"Day High":127.135,"Day Low":123.88,"VS Average Volume":0.4126097402,"Company Summary":"Shopify Inc., a commerce company, provides a commerce platform and services in Canada, the United States, Europe, the Middle East, Africa, the Asia Pacific, Australia, China, and Latin America. The company's platform enables merchants to displays, manages, markets, and sells its products through various sales channels, including web and mobile storefronts, physical retail locations, pop-up shops, social media storefronts, native mobile apps, buy buttons, and marketplaces; and enables to manage products and inventory, process orders and payments, fulfill and ship orders, new buyers and build customer relationships, source products, leverage analytics and reporting, manage cash, payments and transactions, and access financing. It also sells custom themes and apps, and registration of domain names; and merchant solutions, which include accepting payments, shipping, and securing working capital. The company was formerly known as Jaded Pixel Technologies Inc. and changed its name to Shopify Inc. in November 2011. Shopify Inc. was incorporated in 2004 and is headquartered in Ottawa, Canada.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"DoorDash, Inc.","Symbol":"DASH","Current Price":"208.37","Latest MA":"152.85","Price Target":216.48175,"Difference from MA":"36.33%","Difference from Open":"1.22%","Change from Yesterday":"1.33%","Change from Last Report":"-0.13","Latest Volume":"1,342,330","Market Cap":"86,556,065,792","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":33.32411,"PB Ratio":11.429433,"Previous Close":205.64,"ROE":-0.02517,"DTE":7.02,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.671,"Trailing PEG":1.028,"Trailing PE":672.16125,"Trailing PS":8.526011,"Quick Ratio":1.364,"Day High":209.4,"Day Low":204.865,"VS Average Volume":0.4614600279,"Company Summary":"DoorDash, Inc., together with its subsidiaries, operates a commerce platform that connects merchants, consumers, and independent contractors in the United States and internationally. The company operates DoorDash Marketplace and Wolt Marketplace, which provide various services, such as customer acquisition, demand generation, order fulfillment, merchandising, payment processing, and customer support. It also offers membership products, including DashPass and Wolt+; DoorDash Drive and Wolt Drive, which are white-label delivery fulfillment services that enable merchants that have generated consumer demand through their channels to fulfill demand using its platform; DoorDash Storefront that enables merchants to offer consumers on-demand access to e-commerce; and Bbot, which offers merchants digital ordering and payment solutions for in-store and online channels. In addition, the company enables merchants to advertise and promote on its platform to acquire consumers. The company was formerly known as Palo Alto Delivery Inc. and changed its name to DoorDash, Inc. in 2015. DoorDash, Inc. was founded in 2013 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"Exelixis, Inc.","Symbol":"EXEL","Current Price":"34.89","Latest MA":"30.08","Price Target":36.88522,"Difference from MA":"16.00%","Difference from Open":"1.52%","Change from Yesterday":"1.16%","Change from Last Report":"0.03","Latest Volume":"627,801","Market Cap":"9,765,411,840","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":12.2602415,"PB Ratio":4.3822284,"Previous Close":34.49,"ROE":0.202,"DTE":8.545,"Industry":"Biotechnology","Sector":"Healthcare","Beta":0.511,"Trailing PEG":2.2685,"Trailing PE":19.824602,"Trailing PS":4.6913056,"Quick Ratio":3.732,"Day High":35.06,"Day Low":34.1823,"VS Average Volume":0.275588225,"Company Summary":"Exelixis, Inc., an oncology company, focuses on the discovery, development, and commercialization of new medicines for difficult-to-treat cancers in the United States. The company offers CABOMETYX tablets for the treatment of patients with advanced renal cell carcinoma who received prior anti-angiogenic therapy; and COMETRIQ capsules for the treatment of progressive and metastatic medullary thyroid cancer. Its CABOMETYX and COMETRIQ are derived from cabozantinib, an inhibitor of multiple tyrosine kinases, including MET, AXL, RET, and VEGF receptors. The company also offers COTELLIC, an inhibitor of MEK as a combination regimen to treat specific forms of advanced melanoma; and MINNEBRO, an oral non-steroidal selective blocker of the mineralocorticoid receptor for the treatment of hypertension in Japan. It develops zanzalintinib, a novel, potent, next-generation oral tyrosine kinase inhibitor (TKI) that targets VEGF receptors, MET and the TAM kinases (TYRO3, AXL and MER); and XB002, a next-generation tissue factor (TF)-targeting ADC, administered via intravenous infusion and composed of a human monoclonal antibody (mAb) against TF that is conjugated to an auristatin-based microtubulin inhibitor (MTI) payload. It has research collaborations and license agreements with Ipsen Pharma SAS; Takeda Pharmaceutical Company Ltd.; F. Hoffmann-La Roche Ltd.; Redwood Bioscience, Inc.; R.P. Scherer Technologies, LLC; Catalent Pharma Solutions, Inc.; NBE Therapeutics AG; Aurigene Discovery Technologies Limited; Iconic Therapeutics, Inc.; Invenra, Inc.; StemSynergy Therapeutics, Inc.; Genentech, Inc.; Bristol-Myers Squibb Company; and Daiichi Sankyo Company, Limited, as well as clinical development agreement and collaboration with Sairopa B.V. and Merck & Co., Inc. The company was formerly known as Exelixis Pharmaceuticals, Inc. and changed its name to Exelixis, Inc. in February 2000. Exelixis, Inc. was incorporated in 1994 and is headquartered in Alameda, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-02-2025 17:55:34"},{"Company Name":"Lyft, Inc.","Symbol":"LYFT","Current Price":"13.19","Latest MA":"13.44","Price Target":17.55447,"Difference from MA":"-1.93%","Difference from Open":"-2.12%","Change from Yesterday":"-2.12%","Change from Last Report":"-0.30","Latest Volume":"7,239,468","Market Cap":"5,511,395,840","Earning Date":"2025-02-11","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":9.42978,"PB Ratio":8.339659,"Previous Close":13.47,"ROE":-0.1161,"DTE":189.385,"Industry":"Software - Application","Sector":"Technology","Beta":2.041,"Trailing PEG":0.2053,"Trailing PE":219.75002,"Trailing PS":1.0093533,"Quick Ratio":0.58,"Day High":13.54,"Day Low":13.06,"VS Average Volume":0.4293682159,"Company Summary":"Lyft, Inc. operates a peer-to-peer marketplace for on-demand ridesharing in the United States and Canada. It operates multimodal transportation networks that offer access to various transportation options through the Lyft platform and mobile-based applications. The company's platform provides a ridesharing marketplace, which connects drivers with riders; Express Drive, a car rental program for drivers; and a network of shared bikes and scooters in various cities to address the needs of riders for short trips. It also offers centralized tools and enterprise transportation solutions, such as concierge transportation solutions for organizations; Lyft Pink subscription plans; Lyft Pass commuter programs; first-mile and last-mile services; and university safe rides programs. The company was formerly known as Zimride, Inc. and changed its name to Lyft, Inc. in April 2013. Lyft, Inc. was incorporated in 2007 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"14-02-2025 17:55:34"}]