[{"Company Name":"International Paper Company","Symbol":"IP","Current Price":"57.37","Latest MA":"50.41","Price Target":56.46,"Difference from MA":"13.80%","Difference from Open":"3.91%","Change from Yesterday":"-0.99%","Change from Last Report":"0.29","Latest Volume":"6,220,142","Market Cap":"19,930,796,032","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":14.236898,"PB Ratio":2.3096743,"ROE":0.04797,"DTE":69.707,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":0.988,"Trailing PEG":0.5152,"Trailing PE":49.034187,"Trailing PS":1.0692488,"Quick Ratio":1.021,"Day High":57.47,"Day Low":54.5,"VS Average Volume":1.3657644483,"Company Summary":"International Paper Company produces and sells renewable fiber-based packaging and pulp products in North America, Latin America, Europe, and North Africa. It operates through two segments, Industrial Packaging and Global Cellulose Fibers. The company offers linerboard, medium, whitetop, recycled linerboard, recycled medium and saturating kraft; and pulp for a range of applications, such as diapers, towel and tissue products, feminine care, incontinence, and other personal care products, as well as specialty pulps for use in textiles, construction materials, paints, coatings, and others. It sells its products directly to end users and converters, as well as through agents, resellers, and distributors. The company was founded in 1898 and is headquartered in Memphis, Tennessee.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Mobileye Global Inc.","Symbol":"MBLY","Current Price":"16.29","Latest MA":"16.95","Price Target":20.79179,"Difference from MA":"-3.89%","Difference from Open":"11.42%","Change from Yesterday":"1.81%","Change from Last Report":"1.05","Latest Volume":"12,408,588","Market Cap":"13,211,890,688","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":25.929422,"PB Ratio":1.0938692,"ROE":-0.21936001,"DTE":0.439,"Industry":"Auto Parts","Sector":"Consumer Cyclical","Beta":0.059,"Trailing PEG":0.6671,"Trailing PE":"N\/A","Trailing PS":7.335864,"Quick Ratio":4.215,"Day High":16.8,"Day Low":14.5,"VS Average Volume":1.6953392403,"Company Summary":"Mobileye Global Inc. develops and deploys advanced driver assistance systems (ADAS) and autonomous driving technologies and solutions worldwide. The company operates through Mobileye and Other segments. It offers Driver Assist comprising ADAS and autonomous vehicle solutions that covers safety features, such as real-time detection of road users, geometry, semantics, and markings to provide safety alerts and emergency interventions; Cloud-Enhanced Driver Assist, a solution for drivers with interpretations of a scene in real-time; Mobileye SuperVision Lite, a navigation and assisted driving solution; and Mobileye SuperVision, an operational point-to-point assisted driving navigation solution on various road types and includes cloud-based enhancements, such as road experience management. The company also provides Mobileye Chauffeur, a first-generation solution for eyes-off\/hands-off driving with a human driver still in the driver's seat; Mobileye Drive, a self-driving system comprising of radar and lidar subsystems, as well as collision avoidance systems, including Mobileye 8 Connect for light and medium-duty vehicles, and Mobileye Shield+ for large vehicles. It serves original equipment manufacturers. The company was founded in 1999 and is headquartered in Jerusalem, Israel. Mobileye Global Inc. operates as a subsidiary of Intel Overseas Funding Corporation.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Trane Technologies plc","Symbol":"TT","Current Price":"363.29","Latest MA":"372.14","Price Target":414.62906,"Difference from MA":"-2.38%","Difference from Open":"0.08%","Change from Yesterday":"-0.20%","Change from Last Report":"0.36","Latest Volume":"1,186,217","Market Cap":"81,748,967,424","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":25.458963,"PB Ratio":10.776921,"ROE":0.35146,"DTE":69.203,"Industry":"Building Products & Equipment","Sector":"Industrials","Beta":1.221,"Trailing PEG":2.5281,"Trailing PE":33.268314,"Trailing PS":4.2164073,"Quick Ratio":0.873,"Day High":370.0,"Day Low":356.945,"VS Average Volume":0.9266444344,"Company Summary":"Trane Technologies plc, together with its subsidiaries, designs, manufactures, sells, and services of solutions for heating, ventilation, air conditioning, custom, and custom and transport refrigeration in Ireland and internationally. It offers air conditioners, exchangers, and handlers; airside and terminal devices; air sourced heat pumps, auxiliary power units; chillers; coils and condensers; gensets; dehumidifiers; ductless; furnaces; home automation products; humidifiers; indoor air quality assessments and related products; large and light commercial unitary products; refrigerant reclamation products; thermostats\/controls; transport heater products; variable refrigerant flow products; and water source heat pumps. The company also provides building management, telematic, control, energy efficiency and infrastructure program, geothermal, thermal energy, thermostats, rate chambers, package heating and cooling, temporary heating and cooling, and unitary systems; bus, rail, and multi-pipe heating, ventilation, and air conditioning systems; and container, diesel-powered, truck, industrial, rail, self-powered truck, trailer, and vehicle-powered truck refrigeration and air filtration systems, as well as aftermarket and OEM parts and supplies. In addition, it offers energy and facility management, installation and performance contracting, repair and maintenance, and rental services. It markets and sells its products under the Trane and Thermo King brands through sales offices, distributors, and dealers; and through sales and service companies with a supporting chain of distributors. The company was formerly known as Ingersoll-Rand Plc and changed its name to Trane Technologies plc in March 2020. Trane Technologies plc was founded in 1885 and is headquartered in Swords, Ireland.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Baker Hughes Company","Symbol":"BKR","Current Price":"43.94","Latest MA":"38.36","Price Target":47.63885,"Difference from MA":"14.54%","Difference from Open":"-0.05%","Change from Yesterday":"2.02%","Change from Last Report":"0.18","Latest Volume":"2,547,581","Market Cap":"43,478,982,656","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":17.259623,"PB Ratio":2.6844575,"ROE":0.14292,"DTE":36.933,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.363,"Trailing PEG":0.9598,"Trailing PE":19.703678,"Trailing PS":1.5926367,"Quick Ratio":0.749,"Day High":44.258,"Day Low":43.38,"VS Average Volume":0.3903857072,"Company Summary":"Baker Hughes Company provides a portfolio of technologies and services to energy and industrial value chain worldwide. The company operates through Oilfield Services & Equipment (OFSE) and Industrial & Energy Technology (IET) segments. The OFSE segment designs and manufactures products and provides related services, including exploration, appraisal, development, production, rejuvenation, and decommissioning for onshore and offshore oilfield operations. This segment also provides drilling services, drill bits, and drilling and completions fluids; completions, intervention, measurements, pressure pumping, and wireline services; artificial lift systems, and oilfield and industrial chemicals; subsea projects and services, flexible pipe systems, and surface pressure control systems; and integrated well services and solutions. It serves oil and natural gas companies; the United States and international independent oil and natural gas companies; national or state-owned oil companies; engineering, procurement, and construction contractors; geothermal companies; and other oilfield service companies. The IET segment provides gas technology equipment, including drivers, driven equipment, flow control, and turnkey solutions for the mechanical-drive, compression, and power-generation applications; and energy sectors, such as oil and gas, LNG operations, petrochemical, and carbon solutions. This segment also provides rack-based vibration monitoring equipment and sensors; integrated asset performance management products; inspection services; pumps, valves, and gears; precision sensors and instrumentation, and condition monitoring solutions. It serves upstream, midstream, downstream, onshore, offshore, and small and large scale customers. The company was formerly known as Baker Hughes, a GE company and changed its name to Baker Hughes Company in October 2019. Baker Hughes Company was incorporated in 2016 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"CNX Resources Corporation","Symbol":"CNX","Current Price":"28.10","Latest MA":"31.51","Price Target":30.83333,"Difference from MA":"-10.82%","Difference from Open":"-0.99%","Change from Yesterday":"0.90%","Change from Last Report":"0.18","Latest Volume":"2,500,589","Market Cap":"4,194,470,656","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":8.404478,"PB Ratio":0.98529756,"ROE":0.13833,"DTE":56.482,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":1.375,"Trailing PEG":null,"Trailing PE":9.152997,"Trailing PS":3.063359,"Quick Ratio":0.172,"Day High":29.21,"Day Low":28.0,"VS Average Volume":0.8993740392,"Company Summary":"CNX Resources Corporation, an independent natural gas and midstream company, engages in the acquisition, exploration, development, and production of natural gas properties in the Appalachian Basin. The company operates in two segments, Shale and Coalbed Methane (CBM). It produces and sells pipeline quality natural gas primarily for gas wholesalers. The company owns rights to extract natural gas from shale properties in Pennsylvania, West Virginia, and Ohio, as well as rights to extract natural gas from other shale and shallow oil and gas formations in Illinois, Indiana, New York, and Virginia. It also owns rights to extract CBM in Virginia, West Virginia, Pennsylvania, Ohio, Illinois, Indiana, and New Mexico. In addition, the company designs, builds, and operates natural gas gathering systems to move gas from the wellhead to interstate pipelines or other local sales points; owns and operates approximately 2,600 miles of natural gas gathering pipelines, as well as various natural gas processing facilities. It also offers turn-key solutions for water sourcing, delivery, and disposal for its natural gas operations and for third parties. The company was formerly known as CONSOL Energy Inc. and changed its name to CNX Resources Corporation in November 2017. CNX Resources Corporation was founded in 1860 and is headquartered in Canonsburg, Pennsylvania.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Intel Corporation","Symbol":"INTC","Current Price":"19.57","Latest MA":"23.41","Price Target":23.82824,"Difference from MA":"-16.39%","Difference from Open":"-0.76%","Change from Yesterday":"-0.86%","Change from Last Report":"0.13","Latest Volume":"28,590,137","Market Cap":"84,426,973,184","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":20.79571,"PB Ratio":0.8474393,"ROE":-0.15597,"DTE":47.906,"Industry":"Semiconductors","Sector":"Technology","Beta":1.026,"Trailing PEG":0.5861,"Trailing PE":"N\/A","Trailing PS":1.5563437,"Quick Ratio":0.833,"Day High":19.73,"Day Low":19.43,"VS Average Volume":0.383192635,"Company Summary":"Intel Corporation designs, develops, manufactures, markets, and sells computing and related products and services worldwide. It operates through Client Computing Group, Data Center and AI, Network and Edge, Mobileye, and Intel Foundry Services segments. The company's products portfolio comprises central processing units and chipsets, system-on-chips (SoCs), and multichip packages; mobile and desktop processors; hardware products comprising graphics processing units (GPUs), domain-specific accelerators, and field programmable gate arrays (FPGAs); and memory and storage, connectivity and networking, and other semiconductor products. It also offers silicon devices and software products; and optimization solutions for workloads, such as AI, cryptography, security, storage, networking, and leverages various features supporting diverse compute environments. In addition, the company develops and deploys advanced driver assistance systems (ADAS), and autonomous driving technologies and solutions; and provides advanced process technologies backed by an ecosystem of IP, EDA, and design services, as well as systems of chips, including advanced packaging technologies, software and accelerate bring-up, and integration of chips and driving standards. Further, it delivers and deploys intelligent edge platforms that allow developers to achieve agility and drive automation using AI for efficient operations with data integrity, as well as provides hardware and software platforms, tools, and ecosystem partnerships for digital transformation from the cloud to edge. The company serves original equipment manufacturers, original design manufacturers, cloud service providers, and other manufacturers and service providers. It has a strategic agreement with Synopsys, Inc. to develop EDA and IP solutions; and ARM that enables chip designers to build optimized compute SoCs on the Intel 18A process. Intel Corporation was incorporated in 1968 and is headquartered in Santa Clara, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Apple Inc.","Symbol":"AAPL","Current Price":"238.18","Latest MA":"229.59","Price Target":245.794,"Difference from MA":"3.74%","Difference from Open":"-0.20%","Change from Yesterday":"-0.45%","Change from Last Report":"-0.05","Latest Volume":"15,590,017","Market Cap":"3,581,726,949,376","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":28.75754,"PB Ratio":63.22803,"ROE":1.5741299,"DTE":209.059,"Industry":"Consumer Electronics","Sector":"Technology","Beta":1.24,"Trailing PEG":2.1812,"Trailing PE":39.174343,"Trailing PS":9.159607,"Quick Ratio":0.745,"Day High":240.79,"Day Low":237.21,"VS Average Volume":0.314169758,"Company Summary":"Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod. It also provides AppleCare support and cloud services; and operates various platforms, including the App Store that allow customers to discover and download applications and digital content, such as books, music, video, games, and podcasts, as well as advertising services include third-party licensing arrangements and its own advertising platforms. In addition, the company offers various subscription-based services, such as Apple Arcade, a game subscription service; Apple Fitness+, a personalized fitness service; Apple Music, which offers users a curated listening experience with on-demand radio stations; Apple News+, a subscription news and magazine service; Apple TV+, which offers exclusive original content; Apple Card, a co-branded credit card; and Apple Pay, a cashless payment service, as well as licenses its intellectual property. The company serves consumers, and small and mid-sized businesses; and the education, enterprise, and government markets. It distributes third-party applications for its products through the App Store. The company also sells its products through its retail and online stores, and direct sales force; and third-party cellular network carriers, wholesalers, retailers, and resellers. Apple Inc. was founded in 1976 and is headquartered in Cupertino, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Cardinal Health, Inc.","Symbol":"CAH","Current Price":"127.79","Latest MA":"111.61","Price Target":134.34067,"Difference from MA":"14.50%","Difference from Open":"0.49%","Change from Yesterday":"0.02%","Change from Last Report":"-0.06","Latest Volume":"1,439,218","Market Cap":"30,925,852,672","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":14.601666,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Medical Distribution","Sector":"Healthcare","Beta":0.616,"Trailing PEG":1.0527,"Trailing PE":24.57452,"Trailing PS":0.13778259,"Quick Ratio":0.422,"Day High":132.84,"Day Low":125.0,"VS Average Volume":0.6355816148,"Company Summary":"Cardinal Health, Inc. operates as a healthcare services and products company in the United States, Canada, Europe, Asia, and internationally. It provides customized solutions for hospitals, healthcare systems, pharmacies, ambulatory surgery centers, clinical laboratories, physician offices, and patients in the home. The company operates in two segments: Pharmaceutical and Specialty Solutions, and Global Medical Products and Distribution. It distributes branded and generic pharmaceutical, specialty pharmaceutical, and over-the-counter healthcare and consumer products, as well as medical supplies. The company also provides services to pharmaceutical manufacturers and healthcare providers for specialty pharmaceutical products; offers pharmacy management services to hospitals; operates pharmacies, including pharmacies in community health centers; and repackages generic pharmaceuticals and over-the-counter healthcare products. In addition, it manufactures, sources, and distributes Cardinal Health branded medical, surgical, and laboratory products and devices that include exam and surgical gloves; needles, syringe, and sharps disposals; compression solution, incontinence, nutritional delivery, and wound care products; single-use surgical drapes, gowns, and apparel products; fluid suction and collection systems; urology products; operating room supply products; and electrode product lines. Further, the company distributes a range of national brand products, including medical, surgical, and laboratory products; provides supply chain services and solutions to hospitals, ambulatory surgery centers, clinical laboratories, and other healthcare providers; and assembles and sells sterile, and non-sterile procedure kits. Additionally, it manufactures, prepares, delivers, and distributes radiopharmaceuticals and related treatments; and optimizes direct shipments through integrated technology solutions. The company was incorporated in 1979 and is headquartered in Dublin, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Caterpillar, Inc.","Symbol":"CAT","Current Price":"375.21","Latest MA":"365.31","Price Target":392.78738,"Difference from MA":"2.71%","Difference from Open":"0.46%","Change from Yesterday":"-4.69%","Change from Last Report":"0.13","Latest Volume":"1,738,413","Market Cap":"181,152,120,832","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":15.4740505,"PB Ratio":9.339158,"ROE":0.53475,"DTE":195.336,"Industry":"Farm & Heavy Construction Machinery","Sector":"Industrials","Beta":1.095,"Trailing PEG":1.7647,"Trailing PE":17.411137,"Trailing PS":2.7587738,"Quick Ratio":0.768,"Day High":380.81,"Day Low":373.25,"VS Average Volume":0.8382224455,"Company Summary":"Caterpillar Inc. manufactures and sells construction and mining equipment, off-highway diesel and natural gas engines, industrial gas turbines, and diesel-electric locomotives in worldwide. Its Construction Industries segment offers asphalt pavers, compactors, road reclaimers, forestry machines, cold planers, material handlers, track-type tractors, excavators, telehandlers, motor graders, and pipelayers; compact track, wheel, track-type, backhoe, and skid steer loaders; and related parts and tools. The company's Resource Industries segment provides electric rope and hydraulic shovels, draglines, rotary drills, hard rock vehicles, tractors, mining trucks, wheel loaders, off-highway and articulated trucks, wheel tractor scrapers and dozers, fleet management products, landfill and soil compactors, machinery components, autonomous ready vehicles and solutions, work tools, and safety services and mining performance solutions, as well as related parts and services. Its Energy & Transportation segment offers reciprocating engine powered generator sets; reciprocating engines, drivetrain, and integrated systems and solutions; turbines, centrifugal gas compressors, and related services; and diesel-electric locomotives and components, and other rail-related products. The company's Financial Products segment provides operating and finance leases, installment sale contracts, revolving charge accounts, repair\/rebuild financing services, working capital loans, and wholesale financing; and insurance and risk management products and services. Its All Other Operating segment offers filters and fluids, undercarriage, ground engaging tools, fluid transfer products, precision seals, and rubber sealing and connecting components; parts distribution; logistics solutions and distribution services; brand management and marketing strategy services; and digital investments services. Caterpillar Inc. was founded in 1925 and is headquartered in Irving, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Comcast Corporation","Symbol":"CMCSA","Current Price":"32.70","Latest MA":"39.55","Price Target":47.7025,"Difference from MA":"-17.31%","Difference from Open":"-5.13%","Change from Yesterday":"-12.45%","Change from Last Report":"0.44","Latest Volume":"29,995,671","Market Cap":"125,136,666,624","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":6.785076,"PB Ratio":1.461882,"ROE":0.16884,"DTE":117.127,"Industry":"Telecom Services","Sector":"Communication Services","Beta":1.004,"Trailing PEG":1.1592,"Trailing PE":8.814636,"Trailing PS":1.0167927,"Quick Ratio":0.605,"Day High":34.68,"Day Low":32.5,"VS Average Volume":1.4308588639,"Company Summary":"Comcast Corporation operates as a media and technology company worldwide. It operates through Residential Connectivity & Platforms, Business Services Connectivity, Media, Studios, and Theme Parks segments. The Residential Connectivity & Platforms segment provides residential broadband and wireless connectivity services, residential and business video services, sky-branded entertainment television networks, and advertising. The Business Services Connectivity segment offers connectivity services for small business locations, which include broadband, wireline voice, and wireless services, as well as solutions for medium-sized customers and larger enterprises; and small business connectivity services in the United Kingdom. The Media segment operates NBCUniversal's television and streaming business, including national and regional cable networks; the NBC and Telemundo broadcast networks and owned local broadcast television stations; and Peacock, a direct-to-consumer streaming services. It also operates international television networks comprising the Sky Sports networks, as well as other digital properties. The Studios segment operates NBCUniversal and Sky film and television studio production and distribution operations. The Theme Parks segment operates Universal theme parks in Orlando, Florida; Hollywood, California; Osaka, Japan; and Beijing, China. The company also offers a consolidated streaming platforms under the Philadelphia Flyers and the Wells Fargo Center arena in Philadelphia, Pennsylvania; and Xumo. Comcast Corporation was founded in 1963 and is headquartered in Philadelphia, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"PulteGroup, Inc.","Symbol":"PHM","Current Price":"120.10","Latest MA":"125.95","Price Target":142.07143,"Difference from MA":"-4.64%","Difference from Open":"3.20%","Change from Yesterday":"6.19%","Change from Last Report":"0.08","Latest Volume":"1,301,660","Market Cap":"24,630,347,776","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":8.2084465,"PB Ratio":2.132912,"ROE":0.26705,"DTE":19.411,"Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":1.641,"Trailing PEG":0.292,"Trailing PE":8.863468,"Trailing PS":1.4221734,"Quick Ratio":0.553,"Day High":120.39,"Day Low":113.395,"VS Average Volume":0.6833108391,"Company Summary":"PulteGroup, Inc., through its subsidiaries, primarily engages in the homebuilding business in the United States. It acquires and develops land primarily for residential purposes; and constructs housing on such land. The company also offers various home designs, including single-family detached, townhomes, condominiums, and duplexes under the Centex, Pulte Homes, Del Webb, DiVosta Homes, John Wieland Homes and Neighborhoods, and American West brand names. In addition, the company arranges financing through the origination of mortgage loans primarily for homebuyers; sells the servicing rights for the originated loans; and provides title insurance policies, and examination and closing services to homebuyers. PulteGroup, Inc. was founded in 1950 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Flagstar Financial, Inc.","Symbol":"FLG","Current Price":"11.16","Latest MA":"10.57","Price Target":12.125,"Difference from MA":"5.59%","Difference from Open":"5.58%","Change from Yesterday":"16.41%","Change from Last Report":"-0.45","Latest Volume":"8,391,333","Market Cap":"4,632,683,520","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":15.254863,"PB Ratio":0.57439905,"ROE":-0.37158,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.0,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":3.2464495,"Quick Ratio":"N\/A","Day High":11.36,"Day Low":10.42,"VS Average Volume":1.4196512814,"Company Summary":"Flagstar Financial, Inc. operates as the bank holding company for Flagstar Bank, N.A. that provides banking products and services in the United States. The company's deposit products include interest-bearing checking and money market, savings, non-interest-bearing, and retirement accounts, as well as certificates of deposit. Its loan products comprise multi-family loans; commercial real estate loans; acquisition, development, and construction loans; commercial and industrial loans; one-to-four family loans; specialty finance loans and leases; warehouse loans; and other loans, such as home equity lines of credit, boat and recreational vehicle indirect lending, point of sale consumer loans, and other consumer loans, including overdraft loans. The company offers cash management products; non-deposit investment and insurance products; and online banking, mobile banking, and bank-by-phone services. It primarily serves individuals, small and mid-size businesses, and professional associations. The company was formerly known as New York Community Bancorp, Inc. and changed its name to Flagstar Financial, Inc. in October 2024. Flagstar Financial, Inc. was founded in 1859 and is headquartered in Hicksville, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Murphy Oil Corporation","Symbol":"MUR","Current Price":"27.70","Latest MA":"34.32","Price Target":40.8125,"Difference from MA":"-19.28%","Difference from Open":"-2.60%","Change from Yesterday":"-5.07%","Change from Last Report":"0.18","Latest Volume":"2,218,660","Market Cap":"4,039,851,520","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":6.7175455,"PB Ratio":0.76953,"ROE":0.10342,"DTE":39.841,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":2.203,"Trailing PEG":null,"Trailing PE":8.906753,"Trailing PS":1.2658976,"Quick Ratio":0.604,"Day High":28.436,"Day Low":27.195,"VS Average Volume":1.228139612,"Company Summary":"Murphy Oil Corporation, together with its subsidiaries, operates as an oil and gas exploration and production company in the United States, Canada, and internationally. It explores for and produces crude oil, natural gas, and natural gas liquids. The company was formerly known as Murphy Corporation and changed its name to Murphy Oil Corporation in 1964. The company was incorporated in 1950 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Tractor Supply Company","Symbol":"TSCO","Current Price":"54.88","Latest MA":"54.87","Price Target":58.577,"Difference from MA":"0.00%","Difference from Open":"1.55%","Change from Yesterday":"-4.05%","Change from Last Report":"0.05","Latest Volume":"4,273,794","Market Cap":"29,313,951,744","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":24.887863,"PB Ratio":2.5635335,"ROE":0.5058,"DTE":233.038,"Industry":"Specialty Retail","Sector":"Consumer Cyclical","Beta":0.814,"Trailing PEG":2.6839,"Trailing PE":26.63835,"Trailing PS":1.9847571,"Quick Ratio":0.086,"Day High":55.31,"Day Low":53.5001,"VS Average Volume":0.8258502426,"Company Summary":"Tractor Supply Company operates as a rural lifestyle retailer in the United States. The company offers various merchandise, including livestock and equine feed and equipment, poultry, fencing, and sprayers and chemicals; food, treats, and equipment for dogs, cats, and other small animals, as well as dog wellness products; seasonal and recreation products comprising tractors and riders, lawn and garden, bird feeding, power equipment, and other recreational products; truck, tool, and hardware products, such as truck accessories, trailers, generators, lubricants, batteries, and hardware and tools; and clothing, gift, and décor products consist of clothing, footwear, toys, snacks, and decorative merchandise. It provides its products under the 4health, Paws & Claws, American Farmworks, Producer's Pride, Bit & Bridle, Red Shed, Blue Mountain, Redstone, C.E. Schmidt, Retriever, Country Lane, Ridgecut, Countyline, Royal Wing, Country Tuff, Strive, Dumor, Traveller, Farm Table, Treeline, Groundwork, TSC Tractor Supply Co, Huskee, Untamed, and JobSmart brand names. The company operates its retail stores under the Tractor Supply Company, Petsense by Tractor Supply, and Orscheln Farm and Home names; and operates websites under the TractorSupply.com and Petsense.com names. It sells its products to recreational farmers, ranchers, and others. Tractor Supply Company was founded in 1938 and is based in Brentwood, Tennessee.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Gen Digital Inc.","Symbol":"GEN","Current Price":"28.04","Latest MA":"27.08","Price Target":31.232,"Difference from MA":"3.55%","Difference from Open":"1.32%","Change from Yesterday":"1.45%","Change from Last Report":"0.00","Latest Volume":"1,005,203","Market Cap":"17,277,857,792","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":11.439869,"PB Ratio":8.231063,"ROE":0.2766,"DTE":409.342,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.054,"Trailing PEG":0.6439,"Trailing PE":28.318182,"Trailing PS":4.472653,"Quick Ratio":0.273,"Day High":28.19,"Day Low":27.64,"VS Average Volume":0.2958883069,"Company Summary":"Gen Digital Inc. engages in the provision of cyber safety solutions for consumers in the United States, Canada, Latin America, Europe, the Middle East, Africa, the Asia Pacific, and Japan. The company offers security and performance products under Norton, Avast, Avira, AVG, and CCleaner brands that provide real-time protection and maintenance for PCs, Macs, and mobile devices against malware, viruses, adware, and other online threats. It also provides identity protection solutions, including LifeLock Identity Theft Protection, Avast and AVG Secure Identity, Norton Identity Theft Protection, and Dark Web Monitoring for monitoring of credit reports, financial accounts, the dark web, and social media accounts to help safeguard customers' personal information. In addition, the company offers Virtual Private Network (VPN) solutions under Norton, Avast and AVG brands to enhance security and online privacy that allows customers to securely transmit and access private information, such as passwords, bank details, and credit card numbers, when using public Wi-Fi on PCs, Macs, and mobile iOS and Android devices; AntiTrack and Secure Browser products which helps to keep personal information and browsing activity anonymous while browsing online; and Privacy Monitor Assistant and BreachGuard products for removing customers' data from public data broker sites; and ReputationDefender, a white glove service that helps customers manage all aspects of their personal branding online, including search results, social media sites, and overall web presence. It markets and sells its products and related services through retailers, telecom service providers, hardware original equipment manufacturers, and employee benefit providers, as well as e-commerce platform. The company was formerly known as NortonLifeLock Inc. and changed its name to Gen Digital Inc. in November 2022. Gen Digital Inc. was founded in 1982 and is headquartered in Tempe, Arizona.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Sherwin-Williams Company (The)","Symbol":"SHW","Current Price":"367.52","Latest MA":"357.76","Price Target":385.00912,"Difference from MA":"2.73%","Difference from Open":"1.43%","Change from Yesterday":"1.97%","Change from Last Report":"0.24","Latest Volume":"1,769,221","Market Cap":"92,562,268,160","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":25.944967,"PB Ratio":22.160086,"ROE":0.64452004,"DTE":291.114,"Industry":"Specialty Chemicals","Sector":"Basic Materials","Beta":1.175,"Trailing PEG":3.3649,"Trailing PE":36.5333,"Trailing PS":4.0151067,"Quick Ratio":0.453,"Day High":370.0,"Day Low":355.5588,"VS Average Volume":0.9086576709,"Company Summary":"The Sherwin-Williams Company engages in the development, manufacture, distribution, and sale of paints, coating, and related products to professional, industrial, commercial, and retail customers. It operates through three segments: Paint Stores Group, Consumer Brands Group, and Performance Coatings Group. The Paint Stores Group segment offers architectural paints and coatings, and protective and marine products, as well as OEM product finishes and related products for architectural and industrial paint contractors, and do-it-yourself homeowners. The Consumer Brands Group segment supplies a portfolio of branded and private-label architectural paints, stains, varnishes, industrial products, wood finishes products, wood preservatives, applicators, corrosion inhibitors, aerosols, caulks, and adhesives to retailers, including home centers and hardware stores, and dedicated dealers and distributors. The Performance Coatings Group segment develops and sells industrial coatings for wood finishing and general industrial applications, automotive refinish products, protective and marine coatings, coil coatings, packaging coatings, and performance-based resins and colorants. It serves retailers, dealers, jobbers, licensees, and other third-party distributors through its branches and direct sales staff, as well as through outside sales representatives. The company has operations primarily in the North and South America, the Caribbean, Europe, Asia, and Australia. The Sherwin-Williams Company was founded in 1866 and is headquartered in Cleveland, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"The Cigna Group","Symbol":"CI","Current Price":"277.80","Latest MA":"324.40","Price Target":389.5375,"Difference from MA":"-14.37%","Difference from Open":"1.02%","Change from Yesterday":"-8.41%","Change from Last Report":"0.46","Latest Volume":"2,680,700","Market Cap":"77,270,900,736","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":7.919281,"PB Ratio":1.8445234,"ROE":0.07606,"DTE":80.15,"Industry":"Healthcare Plans","Sector":"Healthcare","Beta":0.511,"Trailing PEG":0.7266,"Trailing PE":26.306816,"Trailing PS":0.3363304,"Quick Ratio":0.606,"Day High":282.67,"Day Low":268.99,"VS Average Volume":1.3376746507,"Company Summary":"The Cigna Group, together with its subsidiaries, provides insurance and related products and services in the United States. Its Evernorth Health Services segment provides a range of coordinated and point solution health services, including pharmacy benefits, home delivery pharmacy, specialty pharmacy, distribution, and care delivery and management solutions to health plans, employers, government organizations, and health care providers. The company's Cigna Healthcare segment offers medical, pharmacy, behavioral health, dental, and other products and services for insured and self-insured customers; Medicare Advantage, Medicare Supplement, and Medicare Part D plans for seniors, as well as individual health insurance plans; and health care coverage in its international markets, as well as health care benefits for mobile individuals and employees of multinational organizations. In addition, it offers permanent insurance contracts sold to corporations to provide coverage on the lives of certain employees for financing employer-paid future benefit obligations. The company distributes its products and services through insurance brokers and consultants; directly to employers, unions and other groups, or individuals; and private and public exchanges. The company was formerly known as Cigna Corporation and changed its name to The Cigna Group in February 2023. The Cigna Group was founded in 1792 and is headquartered in Bloomfield, Connecticut.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Southwest Airlines Company","Symbol":"LUV","Current Price":"31.60","Latest MA":"29.94","Price Target":32.82571,"Difference from MA":"5.54%","Difference from Open":"0.99%","Change from Yesterday":"-0.19%","Change from Last Report":"-0.33","Latest Volume":"6,876,315","Market Cap":"18,951,690,240","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":13.262098,"PB Ratio":1.8203814,"ROE":-0.00447,"DTE":87.36,"Industry":"Airlines","Sector":"Industrials","Beta":1.153,"Trailing PEG":0.4751,"Trailing PE":"N\/A","Trailing PS":0.69227386,"Quick Ratio":0.783,"Day High":33.085,"Day Low":31.245,"VS Average Volume":1.0051577021,"Company Summary":"Southwest Airlines Co. operates as a passenger airline company that provides scheduled air transportation services in the United States and near-international markets. As of December 31, 2023, the company operated a total fleet of 817 Boeing 737 aircraft; and served 121 destinations in 42 states, the District of Columbia, and the Commonwealth of Puerto Rico, as well as ten near-international countries, including Mexico, Jamaica, the Bahamas, Aruba, the Dominican Republic, Costa Rica, Belize, Cuba, the Cayman Islands, and Turks and Caicos. It also provides inflight entertainment and connectivity services on Wi-Fi enabled aircraft; and Rapid Rewards loyalty program that enables program members to earn points for dollars spent on Southwest base fares. In addition, the company offers a suite of digital platforms to support customers' travel needs, including websites and apps; and SWABIZ, an online booking tool. Further, it provides ancillary services, such as Southwest's EarlyBird Check-In, upgraded boarding, and transportation of pets and unaccompanied minors. Southwest Airlines Co. was incorporated in 1967 and is headquartered in Dallas, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Dynatrace, Inc.","Symbol":"DT","Current Price":"57.64","Latest MA":"51.27","Price Target":62.10323,"Difference from MA":"12.43%","Difference from Open":"0.19%","Change from Yesterday":"0.51%","Change from Last Report":"-0.09","Latest Volume":"3,616,691","Market Cap":"17,204,617,216","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":38.406696,"PB Ratio":8.0256195,"ROE":0.08276,"DTE":3.76,"Industry":"Software - Application","Sector":"Technology","Beta":1.053,"Trailing PEG":1.2831,"Trailing PE":106.74074,"Trailing PS":11.005369,"Quick Ratio":1.249,"Day High":58.14,"Day Low":55.44,"VS Average Volume":1.0653494716,"Company Summary":"Dynatrace, Inc. provides a security platform for multicloud environments in North America, Europe, the Middle East, Africa, the Asia Pacific, and Latin America. The company operates Dynatrace, a security platform, which provides application and microservices monitoring, runtime application security, infrastructure monitoring, log management and analytics, digital experience monitoring, digital business analytics, and cloud automation. Its platform allows its customers to modernize and automate IT operations, delivers software, and enhance user experiences. In addition, the company offers implementation, consulting, and training services. It markets its products through a combination of direct sales team and a network of partners, including resellers, system integrators, and managed service providers. It serves customers in various industries comprising banking, financial services, government, insurance, retail and wholesale, transportation, and software. Dynatrace, Inc. was founded in 2005 and is headquartered in Waltham, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"United Parcel Service, Inc.","Symbol":"UPS","Current Price":"111.02","Latest MA":"129.64","Price Target":148.61774,"Difference from MA":"-14.36%","Difference from Open":"-5.43%","Change from Yesterday":"-17.00%","Change from Last Report":"0.33","Latest Volume":"21,486,061","Market Cap":"94,741,135,360","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":12.658906,"PB Ratio":5.6178527,"ROE":0.31422,"DTE":155.425,"Industry":"Integrated Freight & Logistics","Sector":"Industrials","Beta":0.982,"Trailing PEG":1.7181,"Trailing PE":16.770393,"Trailing PS":1.0447162,"Quick Ratio":1.027,"Day High":117.89,"Day Low":109.6201,"VS Average Volume":5.0761733331,"Company Summary":"United Parcel Service, Inc., a package delivery company, provides transportation and delivery, distribution, contract logistics, ocean freight, airfreight, customs brokerage, and insurance services. It operates through two segments, U.S. Domestic Package and International Package. The U.S. Domestic Package segment offers time-definite delivery of express letters, documents, small packages, and palletized freight through air and ground services in the United States. The International Package segment provides guaranteed day and time-definite international shipping services comprising guaranteed time-definite express options in Europe, Asia, the Indian sub-continent, the Middle East, Africa, Canada, and Latin America. The company also offers international air and ocean freight forwarding, post-sales, and mail and consulting services. In addition, it provides truckload and customs brokerage services; supply chain solutions to the healthcare and life sciences industries; fulfillment and transportation management services; and integrated supply chain and shipment insurance solutions. United Parcel Service, Inc. was founded in 1907 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Mastercard Incorporated","Symbol":"MA","Current Price":"575.23","Latest MA":"493.98","Price Target":571.4441,"Difference from MA":"16.45%","Difference from Open":"3.65%","Change from Yesterday":"4.82%","Change from Last Report":"0.29","Latest Volume":"2,490,954","Market Cap":"527,963,881,472","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":30.281828,"PB Ratio":71.13021,"ROE":1.7757801,"DTE":244.839,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.101,"Trailing PEG":2.1081,"Trailing PE":43.479214,"Trailing PS":19.391901,"Quick Ratio":0.891,"Day High":576.56,"Day Low":554.53,"VS Average Volume":0.9423053353,"Company Summary":"Mastercard Incorporated, a technology company, provides transaction processing and other payment-related products and services in the United States and internationally. The company offers integrated products and value-added services for account holders, merchants, financial institutions, digital partners, businesses, governments, and other organizations, such as programs that enable issuers to provide consumers with credits to defer payments; payment products and solutions that allow its customers to access funds in deposit and other accounts; prepaid programs services; and commercial credit, debit, and prepaid payment products and solutions. It also provides solutions that enable businesses or governments to make payments to businesses, including Virtual Card Number, which is generated dynamically from a physical card and leverages the credit limit of the funding account; a platform to optimize supplier payment enablement campaigns for financial institutions; and treasury intelligence platform that offers corporations with recommendations to enhance working capital performance and accelerate spend on cards. In addition, the company offers Mastercard Send, which partners with digital messaging and payment platforms to enable consumers to send money directly within applications to other consumers; and Mastercard Cross-Border Services enables a range of payment flows through a distribution network with a single point of access to send and receive money globally through various channels, including bank accounts, mobile wallets, cards, and cash payouts. Further, it provides cyber and intelligence solutions; insights and analytics, consulting, marketing, loyalty, processing, and payment gateway solutions for e-commerce merchants; and open banking and digital identity services. The company offers payment solutions and services under the MasterCard, Maestro, and Cirrus name. Mastercard Incorporated was founded in 1966 and is headquartered in Purchase, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Thermo Fisher Scientific Inc","Symbol":"TMO","Current Price":"606.51","Latest MA":"568.75","Price Target":645.4593,"Difference from MA":"6.64%","Difference from Open":"2.69%","Change from Yesterday":"6.74%","Change from Last Report":"0.12","Latest Volume":"1,421,152","Market Cap":"231,988,297,728","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":23.40786,"PB Ratio":4.7352157,"ROE":0.12944001,"DTE":72.329,"Industry":"Diagnostics & Research","Sector":"Healthcare","Beta":0.792,"Trailing PEG":2.2056,"Trailing PE":37.977795,"Trailing PS":5.4752965,"Quick Ratio":1.126,"Day High":610.58,"Day Low":590.0,"VS Average Volume":0.7230173205,"Company Summary":"Thermo Fisher Scientific Inc. provides life sciences solutions, analytical instruments, specialty diagnostics, and laboratory products and biopharma services in the North America, Europe, Asia-Pacific, and internationally. The company's Life Sciences Solutions segment offers reagents, instruments, and consumables for biological and medical research, discovery, and production of drugs and vaccines, as well as diagnosis of infections and diseases; and solutions include biosciences, genetic sciences, and bio production to pharmaceutical, biotechnology, agricultural, clinical, healthcare, academic, and government markets. Its Analytical Instruments segment provides instruments, consumables, software, and services for pharmaceutical, biotechnology, academic, government, environmental, and other research and industrial markets, as well as clinical laboratories. The company's Specialty Diagnostics segment offers liquid, ready-to-use, and lyophilized immunodiagnostic reagent kits, as well as calibrators, controls, protein detection assays, and instruments; immunodiagnostics develops, manufactures and markets complete bloodtest systems to support the clinical diagnosis and monitoring of allergy, asthma and autoimmune diseases; dehydrated and prepared culture media, collection and transport systems, instrumentation, and consumables; human leukocyte antigen typing and testing for organ transplant market; and healthcare products. Its Laboratory Products and Biopharma Services segment provides laboratory products, research and safety market channel, and pharma services and clinical research. It offers products and services through a direct sales force, customer-service professionals, electronic commerce, and third-party distributors under Thermo Scientific; Applied Biosystems; Invitrogen; Fisher Scientific; Unity Lab Services; and Patheon and PPD. It has a collaboration agreement with Mainz Biomed N.V. for the development of colorectal cancer screening product. Thermo Fisher Scientific Inc. was founded in 1956 and is headquartered in Waltham, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Unity Software Inc.","Symbol":"U","Current Price":"22.75","Latest MA":"20.06","Price Target":23.09783,"Difference from MA":"13.42%","Difference from Open":"-1.17%","Change from Yesterday":"-0.83%","Change from Last Report":"-0.02","Latest Volume":"1,742,253","Market Cap":"9,164,609,536","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":29.72069,"PB Ratio":2.8768337,"ROE":-0.23091999,"DTE":68.801,"Industry":"Software - Application","Sector":"Technology","Beta":2.291,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":4.662917,"Quick Ratio":2.26,"Day High":23.2304,"Day Low":22.47,"VS Average Volume":0.1591928323,"Company Summary":"Unity Software Inc. operates a platform that provides real-time 3D content and experiences. Its platform provides artificial intelligence solutions that support creators in building, running, and growing immersive, real-time 2D and 3D content for mobile phones, tablets, PCs, consoles, and augmented and virtual reality devices. The company also offers Create Solutions, a set of tools and services used to build, ship, and run real-time 2D and 3D content; and Grow Solutions, which allows customers to grow and engage their user base and monetize their content. It serves enterprises, mid-market companies, and government and non-profit institutions; mid-sized, small, and independent businesses; and individuals across various industries. The company offers its solutions directly through its online store, field sales operations, independent distributors, and resellers in North America, Denmark, China, Finland, the United Kingdom, Germany, Israel, Japan, Singapore, South Korea, Spain, and internationally. Unity Software Inc. was founded in 2004 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Altria Group, Inc.","Symbol":"MO","Current Price":"51.37","Latest MA":"50.58","Price Target":56.58769,"Difference from MA":"1.57%","Difference from Open":"0.69%","Change from Yesterday":"-2.48%","Change from Last Report":"-0.05","Latest Volume":"8,081,802","Market Cap":"87,062,388,736","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":9.287265,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Tobacco","Sector":"Consumer Defensive","Beta":0.67,"Trailing PEG":3.6834,"Trailing PE":8.677364,"Trailing PS":4.2757287,"Quick Ratio":0.274,"Day High":51.46,"Day Low":50.08,"VS Average Volume":1.0173251623,"Company Summary":"Altria Group, Inc., through its subsidiaries, manufactures and sells smokeable and oral tobacco products in the United States. The company offers cigarettes primarily under the Marlboro brand; large cigars and pipe tobacco under the Black & Mild brand; moist smokeless tobacco and snus products under the Copenhagen, Skoal, Red Seal, and Husky brands; oral nicotine pouches under the on! brand; and e-vapor products under the NJOY ACE brand. It sells its products to distributors, as well as large retail organizations, such as chain stores. The company was founded in 1822 and is headquartered in Richmond, Virginia.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Dow Inc.","Symbol":"DOW","Current Price":"38.48","Latest MA":"47.80","Price Target":48.05882,"Difference from MA":"-19.51%","Difference from Open":"-2.15%","Change from Yesterday":"-6.29%","Change from Last Report":"0.09","Latest Volume":"8,890,524","Market Cap":"26,936,039,424","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":11.381048,"PB Ratio":1.471038,"ROE":0.05863,"DTE":95.059,"Industry":"Chemicals","Sector":"Basic Materials","Beta":1.222,"Trailing PEG":0.589,"Trailing PE":25.65,"Trailing PS":0.62380826,"Quick Ratio":0.8,"Day High":39.48,"Day Low":37.49,"VS Average Volume":1.1645403814,"Company Summary":"Dow Inc., through its subsidiaries, engages in the provision of various materials science solutions for packaging, infrastructure, mobility, and consumer applications in the United States, Canada, Europe, the Middle East, Africa, India, the Asia Pacific, and Latin America. The company operates through Packaging & Specialty Plastics, Industrial Intermediates & Infrastructure, and Performance Materials & Coatings segments. The Packaging & Specialty Plastics segment provides ethylene, and propylene and aromatics products; and polyethylene, polyolefin elastomers, ethylene vinyl acetate, and ethylene propylene diene monomer rubbers for mobility and transportation, consumer, wire and cable, and construction end-markets. The Industrial Intermediates & Infrastructure segment offers purified ethylene, ethylene and ethanol amines, propylene glycol and polyether polyols, aromatic isocyanates and coatings, adhesives, sealants, elastomers, and composites. This segment also provides caustic soda, and ethylene dichloride and vinyl chloride monomers; and cellulose ethers, redispersible latex powders, and acrylic emulsions. The Performance Materials and Coatings segment provides architectural paints and coatings, and industrial coatings that are used in maintenance and protective industries, wood, metal packaging, traffic markings, thermal paper, and leather; and silicon metal, siloxanes, and intermediates used as key materials in manufacturing differentiated downstream silicone products. It also engages in property and casualty insurance, as well as reinsurance business. Dow Inc. was incorporated in 2018 and is headquartered in Midland, Michigan.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Visa Inc.","Symbol":"V","Current Price":"343.18","Latest MA":"289.20","Price Target":342.5589,"Difference from MA":"18.66%","Difference from Open":"1.08%","Change from Yesterday":"2.17%","Change from Last Report":"0.10","Latest Volume":"2,700,852","Market Cap":"664,557,780,992","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":27.17162,"PB Ratio":17.093191,"ROE":0.50708,"DTE":53.239,"Industry":"Credit Services","Sector":"Financial Services","Beta":0.952,"Trailing PEG":2.2277,"Trailing PE":35.234085,"Trailing PS":18.497963,"Quick Ratio":0.837,"Day High":344.43,"Day Low":339.0,"VS Average Volume":0.4527355712,"Company Summary":"Visa Inc. operates as a payment technology company in the United States and internationally. The company operates VisaNet, a transaction processing network that enables authorization, clearing, and settlement of payment transactions. It also offers credit, debit, and prepaid card products; tap to pay, tokenization, and click to pay services; Visa Direct, a solution that facilitates the delivery of funds to eligible cards, bank accounts, and digital wallets; Visa B2B Connect, a multilateral business-to-business cross-border payments network; Visa Cross-Border Solution, a cross-border consumer payments solution; and Visa DPS that provides a range of value-added services, including fraud mitigation, dispute management, data analytics, campaign management, a suite of digital solutions, and contact center services. The company also provides acceptance solutions, which include Cybersource and Authorize.net that provides new and enhanced payment integrations with ecommerce platforms, enabling sellers and acquirers to offer tailored commerce experiences; risk and identity solutions, such as Visa Advanced Authorization, Visa Secure, Visa Consumer Authentication Service, Visa Protect Authentication Intelligence, and Visa Provisioning Intelligence; and Visa Consulting and Analytics, a payment consulting advisory services. It provides its services under the Visa, Visa Electron, Interlink, V PAY, and PLUS brands. The company serves merchants, financial institutions, and government entities. Visa Inc. was founded in 1958 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Valero Energy Corporation","Symbol":"VLO","Current Price":"136.29","Latest MA":"138.17","Price Target":147.33368,"Difference from MA":"-1.36%","Difference from Open":"-5.28%","Change from Yesterday":"-2.17%","Change from Last Report":"0.39","Latest Volume":"1,302,968","Market Cap":"43,147,874,304","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":12.117265,"PB Ratio":1.7086214,"ROE":0.13797,"DTE":38.593,"Industry":"Oil & Gas Refining & Marketing","Sector":"Energy","Beta":1.374,"Trailing PEG":null,"Trailing PE":11.986948,"Trailing PS":0.33517858,"Quick Ratio":1.001,"Day High":143.89,"Day Low":134.01,"VS Average Volume":0.4743652615,"Company Summary":"Valero Energy Corporation manufactures, markets, and sells petroleum-based and low-carbon liquid transportation fuels and petrochemical products in the United States, Canada, the United Kingdom, Ireland, Latin America, Mexico, Peru, and internationally. It operates through three segments: Refining, Renewable Diesel, and Ethanol. The company produces California Reformulated Gasoline Blendstock for Oxygenate Blending and Conventional Blendstock for Oxygenate Blending gasolines, CARB diesel, diesel, jet fuel, heating oil, and asphalt; feedstocks; aromatics; sulfur and residual fuel oil; intermediate oils; and sulfur, sweet, and sour crude oils. It sells its refined products through wholesale rack and bulk markets; and through outlets under the Valero, Beacon, Diamond Shamrock, Shamrock, Ultramar, and Texaco brands. The company owns and operates renewable diesel and ethanol plants, as well as produces renewable diesel and naphtha under the Diamond Green Diesel brand name. In addition, it offers ethanol and various co-products, including dry distiller grains, syrup, and inedible distillers corn oil to animal feed customers. The company was formerly known as Valero Refining and Marketing Company and changed its name to Valero Energy Corporation in August 1997. Valero Energy Corporation was founded in 1980 and is headquartered in San Antonio, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Blackstone Inc.","Symbol":"BX","Current Price":"177.89","Latest MA":"157.94","Price Target":183.63158,"Difference from MA":"12.63%","Difference from Open":"-5.38%","Change from Yesterday":"-3.98%","Change from Last Report":"-0.07","Latest Volume":"2,347,633","Market Cap":"215,759,224,832","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":25.68056,"PB Ratio":19.492657,"ROE":0.22041,"DTE":65.956,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.486,"Trailing PEG":2.309,"Trailing PE":61.13058,"Trailing PS":19.37097,"Quick Ratio":0.886,"Day High":188.85,"Day Low":176.11,"VS Average Volume":0.7204543746,"Company Summary":"Blackstone Inc. is an alternative asset management firm specializing in private equity, real estate, hedge fund solutions, credit, secondary funds of funds, public debt and equity and multi-asset class strategies. The firm typically invests in early-stage, seed, middle market, mature, late venture and later stage companies. It also provide capital markets services. The real estate segment specializes in opportunistic, core+ investments as well as debt investment opportunities collateralized by commercial real estate, and stabilized income-oriented commercial real estate across North America, Europe and Asia. The firm's corporate private equity business pursues transactions throughout the world across a variety of transaction types, including large buyouts, recapitalization, special situations, distressed mortgage loans, mid-cap buyouts, buy and build platforms, which involves multiple acquisitions behind a single management team and platform, and growth equity\/development projects involving significant majority stakes in portfolio companies and minority investments in operating companies, shipping, real estate, corporate or consumer loans, and alternative energy greenfield development projects in energy and power, property, dislocated markets, shipping opportunities, financial institution breakups, re-insurance, and improving freight mobility, financial services, healthcare, life sciences, infrastructure, enterprise tech and consumer, as well as consumer technologies. The firm considers investment in Asia and Latin America. It seeks to invest between $0.25 million and $900 million per transaction. It invests in companies with enterprise value between $500 million and $5000 million. It has a three year investment period. The firm prefers to take majority and minority stakes. Its hedge fund business manages a broad range of commingled and customized fund solutions and its credit business focuses on loans, and securities of non-investment grade companies spread across the capital structure including senior debt, subordinated debt, preferred stock and common equity. Blackstone Inc. was founded in 1985 and is headquartered in New York, New York with additional offices across Asia, Europe, North America and Central America.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Western Digital Corporation","Symbol":"WDC","Current Price":"65.18","Latest MA":"66.61","Price Target":83.75,"Difference from MA":"-2.15%","Difference from Open":"-1.91%","Change from Yesterday":"3.69%","Change from Last Report":"0.03","Latest Volume":"8,668,098","Market Cap":"22,533,246,976","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":8.522924,"PB Ratio":1.9369985,"ROE":0.033239998,"DTE":"N\/A","Industry":"Computer Hardware","Sector":"Technology","Beta":1.394,"Trailing PEG":null,"Trailing PE":18.83815,"Trailing PS":1.57048,"Quick Ratio":0.683,"Day High":67.59,"Day Low":63.7,"VS Average Volume":1.5958534055,"Company Summary":"Western Digital Corporation develops, manufactures, and sells data storage devices and solutions in the United States, China, Hong Kong, Europe, the Middle East, Africa, rest of Asia, and internationally. It offers client devices, including hard disk drives (HDDs) and solid state drives (SSDs) for desktop and notebook personal computers (PCs), gaming consoles, and set top boxes; and flash-based embedded storage products for mobile phones, tablets, notebook PCs, and other portable and wearable devices, as well as automotive, Internet of Things, industrial, and connected home applications. The company also provides enterprise HDDs; enterprise SSDs consisting of flash-based SSDs and software solutions for use in enterprise servers, online transactions, artificial intelligence-related workloads, data analysis, and other enterprise applications; and data storage platforms. In addition, it offers external HDD storage products in mobile and desktop form; client portable SSDs; removable cards that are used in consumer devices comprising mobile phones, tablets, imaging systems, and cameras and smart video systems; universal serial bus flash drives for use in the computing and consumer markets; and wireless drive products used in-field backup of created content, as well as wireless streaming of high-definition movies, photos, music, documents to tablets, smartphones, and PCs. The company sells its products under the Western Digital, SanDisk, and WD brands to original equipment manufacturers, distributors, dealers, resellers, and retailers. Western Digital Corporation was founded in 1970 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Danaher Corporation","Symbol":"DHR","Current Price":"223.87","Latest MA":"252.68","Price Target":271.484,"Difference from MA":"-11.40%","Difference from Open":"-0.50%","Change from Yesterday":"0.11%","Change from Last Report":"-0.20","Latest Volume":"2,101,788","Market Cap":"160,984,924,160","Earning Date":"2025-01-29","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":25.636063,"PB Ratio":3.151678,"ROE":0.07586,"DTE":36.69,"Industry":"Diagnostics & Research","Sector":"Healthcare","Beta":0.881,"Trailing PEG":2.9875,"Trailing PE":42.39962,"Trailing PS":6.7805967,"Quick Ratio":0.916,"Day High":228.95,"Day Low":223.6,"VS Average Volume":0.6517060949,"Company Summary":"Danaher Corporation designs, manufactures, and markets professional, medical, industrial, and commercial products and services worldwide. The Biotechnology segments offers bioprocess technologies, consumables, and services that advance, accelerate, and integrate the development and manufacture of therapeutics; cell line and cell culture media development services; cell culture media, process liquids and buffers for manufacturing, chromatography resins, filtration technologies, aseptic fill finish; single-use hardware and consumables and services, such as the design and installation of full manufacturing suites; lab filtration, separation, and purification; lab-scale protein purification and analytical tools; reagents, membranes, and services; and healthcare filtration solutions. The Life Sciences segment provides mass spectrometers; flow cytometry, genomics, lab automation, centrifugation, liquid handling automation instruments, antibodies and reagents, and particle counting and characterization; microscopes; protein consumables; industrial filtration products; and genomic medicines, such as custom nucleic acid products, plasmid DNA, RNA, and proteins under the ABCAM, ALDEVRON, BECKMAN COULTER, IDT, LEICA MICROSYSTEMS, MOLECULAR DEVICES, PALL, PHENOMENEX and SCIEX brands. The Diagnostics segment offers chemistry, immunoassay, microbiology, and automation systems; and molecular, acute care, and pathology diagnostics products. This segment also provides clinical instruments, reagents, consumables, software, and services for hospitals, physicians' offices, reference laboratories, and other critical care settings. The company has a research  collaboration  with Stanford  University's Department  of  Bioengineering for cancer drug development. The company was formerly known as Diversified Mortgage Investors, Inc. and changed its name to Danaher Corporation in 1984. Danaher Corporation was founded in 1969 and is based in Washington, the District of Columbia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Teradyne, Inc.","Symbol":"TER","Current Price":"113.07","Latest MA":"127.42","Price Target":142.66058,"Difference from MA":"-11.27%","Difference from Open":"10.53%","Change from Yesterday":"-7.31%","Change from Last Report":"-0.08","Latest Volume":"4,829,880","Market Cap":"18,414,692,352","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":18.398798,"PB Ratio":6.348324,"ROE":0.19206,"DTE":2.738,"Industry":"Semiconductor Equipment & Materials","Sector":"Technology","Beta":1.515,"Trailing PEG":1.2544,"Trailing PE":36.009552,"Trailing PS":6.726595,"Quick Ratio":1.742,"Day High":113.3982,"Day Low":100.77,"VS Average Volume":1.9757940803,"Company Summary":"Teradyne, Inc. designs, develops, manufactures, and sells automated test systems and robotics products worldwide. It operates through four segments; Semiconductor Test, System Test, Robotics, and Wireless Test. The Semiconductor Test segment offers products and services for wafer level and device package testing of semiconductor devices in automotive, industrial, communications, consumer, smartphones, cloud, computer and electronic game, and other applications. This segment also provides FLEX test platform systems; J750 test system to address the volume semiconductor devices, including microcontrollers; Magnum platform that tests memory devices, such as flash memory and DRAM; and ETS platform for semiconductor manufacturers, and assembly and test subcontractors in the analog\/mixed signal markets. It serves integrated device manufacturers that integrate the fabrication of silicon wafers into their business; fabless companies that outsource the manufacturing of silicon wafers; foundries; and semiconductor assembly and test providers. The System Test segment offers defense\/aerospace test instrumentation and systems; storage and system level test systems; and circuit-board test and inspection systems. The Wireless Test segment provides wireless test solutions for silicon validation, wireless module manufacturing, and wireless end device manufacturing under the LitePoint brand. This segment also offers IQxel-MX and IQxel-MW7G series products for edge measurement performance in the manufacturing of connectivity products; IQxstream-5G and IQgig-5G family products to support 4G and 5G technologies; and IQgig-UWB+ for certification and manufacturing test support for ultra wideband products. The Robotics segment provides collaborative robotic arms, autonomous mobile robots, and advanced robotic control software for manufacturing, logistics, and industrial customers. The company was incorporated in 1960 and is headquartered in North Reading, Massachusetts.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Tesla, Inc.","Symbol":"TSLA","Current Price":"398.70","Latest MA":"289.82","Price Target":323.97952,"Difference from MA":"37.57%","Difference from Open":"-2.87%","Change from Yesterday":"2.40%","Change from Last Report":"0.14","Latest Volume":"52,212,624","Market Cap":"1,279,863,816,192","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":99.1547,"PB Ratio":18.284143,"ROE":0.20389,"DTE":18.078,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":2.295,"Trailing PEG":4.7684,"Trailing PE":197.37822,"Trailing PS":13.1741,"Quick Ratio":1.214,"Day High":412.5,"Day Low":384.41,"VS Average Volume":0.5813060113,"Company Summary":"Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners; and provision of service and repairs to its energy product customers, including under warranty, as well as various financing options to its solar customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was incorporated in 2003 and is headquartered in Austin, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Whirlpool Corporation","Symbol":"WHR","Current Price":"108.24","Latest MA":"106.15","Price Target":115.15375,"Difference from MA":"1.97%","Difference from Open":"-2.49%","Change from Yesterday":"-16.54%","Change from Last Report":"0.39","Latest Volume":"2,812,530","Market Cap":"5,968,321,024","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":8.094719,"PB Ratio":1.9570053,"ROE":0.20857,"DTE":245.308,"Industry":"Furnishings, Fixtures & Appliances","Sector":"Consumer Cyclical","Beta":1.424,"Trailing PEG":null,"Trailing PE":10.653543,"Trailing PS":0.33990097,"Quick Ratio":0.457,"Day High":112.9966,"Day Low":104.0,"VS Average Volume":3.7192643274,"Company Summary":"Whirlpool Corporation manufactures and markets home appliances and related products and services in the North America, Europe, the Middle East, Africa, Latin America, and Asia. The company's principal products include refrigerators, freezers, ice makers, and refrigerator water filters; laundry appliances, and commercial laundry products and related laundry accessories; cooking and other small domestic appliances; and dishwasher appliances and related accessories, as well as mixers. It markets and distributes its products primarily under the Whirlpool, Maytag, KitchenAid, JennAir, Consul, Brastemp, Amana, Bauknecht, Hotpoint, Indesit, InSinkErator, Yummly, Affresh, Gladiator, Swash, everydrop, Ignis, Privileg, Eslabon de Lujo, and Acros brands. The company sells its products to retailers, distributors, dealers, builders, and other manufacturers, as well as directly to consumers. Whirlpool Corporation was founded in 1911 and is headquartered in Benton Harbor, Michigan.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"QUALCOMM Incorporated","Symbol":"QCOM","Current Price":"172.43","Latest MA":"168.99","Price Target":202.6071,"Difference from MA":"2.03%","Difference from Open":"0.05%","Change from Yesterday":"0.40%","Change from Last Report":"-0.07","Latest Volume":"1,483,316","Market Cap":"190,596,857,856","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":14.15516,"PB Ratio":7.304287,"ROE":0.42253,"DTE":58.765,"Industry":"Semiconductors","Sector":"Technology","Beta":1.286,"Trailing PEG":1.6873,"Trailing PE":19.265364,"Trailing PS":4.8918653,"Quick Ratio":1.64,"Day High":173.54,"Day Low":170.97,"VS Average Volume":0.1785539441,"Company Summary":"QUALCOMM Incorporated engages in the development and commercialization of foundational technologies for the wireless industry worldwide. It operates through three segments: Qualcomm CDMA Technologies (QCT); Qualcomm Technology Licensing (QTL); and Qualcomm Strategic Initiatives (QSI). The QCT segment develops and supplies integrated circuits and system software with advanced connectivity and high-performance, and low-power computing technologies for use in mobile devices; automotive systems for connectivity, digital cockpit, and ADAS\/AD; and IoT, including consumer electronic devices, industrial devices, and edge networking products. The QTL segment grants licenses or provides rights to use portions of its intellectual property portfolio, which include various patent rights useful in the manufacture and sale of wireless products comprising products implementing CDMA2000, WCDMA, LTE and\/or OFDMA-based 5G products. The QSI segment invests in early-stage companies in various industries, including 5G, artificial intelligence, automotive, consumer, enterprise, cloud, IoT, and extended reality, and investments, including non-marketable equity securities and, to a lesser extent, marketable equity securities, and convertible debt instruments. It also provides development, and other services and sells related products to the United States government agencies and their contractors. The company was incorporated in 1985 and is headquartered in San Diego, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Liberty Energy Inc.","Symbol":"LBRT","Current Price":"18.53","Latest MA":"19.73","Price Target":21.92857,"Difference from MA":"-6.08%","Difference from Open":"-9.61%","Change from Yesterday":"-10.21%","Change from Last Report":"-0.27","Latest Volume":"2,995,047","Market Cap":"3,028,098,560","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":12.083312,"PB Ratio":1.5376319,"ROE":0.18975,"DTE":23.924,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.716,"Trailing PEG":null,"Trailing PE":8.908654,"Trailing PS":0.68100035,"Quick Ratio":0.824,"Day High":20.9,"Day Low":18.52,"VS Average Volume":1.0706591797,"Company Summary":"Liberty Energy Inc. provides hydraulic services and related technologies to onshore oil and natural gas exploration, and production companies in North America. The company offers hydraulic fracturing services, including complementary services, such as wireline services, proppant delivery solutions, field gas processing and treating, compressed natural gas (CNG) delivery, data analytics, related goods comprising sand mine operations, and technologies; and well site fueling and logistics. As of as of December 31, 2023, the company owned and operated a fleet of approximately 40 active hydraulic fracturing; and two sand mines in the Permian Basin. In addition, the company provides services primarily in the Permian Basin, the Williston Basin, the Eagle Ford Shale, the Haynesville Shale, the Appalachian Basin (Marcellus Shale and Utica Shale), the Western Canadian Sedimentary Basin, the Denver-Julesburg Basin (the DJ Basin), and the Anadarko Basin. Liberty Energy Inc. was formerly known as Liberty Oilfield Services Inc. and changed its name to Liberty Energy Inc. in April 2022. The company was founded in 2011 and is headquartered in Denver, Colorado.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Waste Management, Inc.","Symbol":"WM","Current Price":"220.51","Latest MA":"210.55","Price Target":232.1,"Difference from MA":"4.73%","Difference from Open":"2.33%","Change from Yesterday":"5.20%","Change from Last Report":"0.00","Latest Volume":"1,301,954","Market Cap":"88,505,221,120","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":25.045574,"PB Ratio":11.092052,"ROE":0.35025,"DTE":208.894,"Industry":"Waste Management","Sector":"Industrials","Beta":0.747,"Trailing PEG":2.2414,"Trailing PE":33.61433,"Trailing PS":4.138272,"Quick Ratio":0.782,"Day High":221.25,"Day Low":214.7184,"VS Average Volume":0.7888670088,"Company Summary":"Waste Management, Inc., through its subsidiaries, engages in the provision of environmental solutions to residential, commercial, industrial, and municipal customers in the United States and Canada. It offers collection services, including picking up and transporting waste and recyclable materials from where it was generated to a transfer station, material recovery facility (MRF), or disposal site; and owns and operates transfer stations, as well as owns, develops, and operates landfill facilities that produce landfill gas used as renewable natural gas for generating electricity. As of December 31, 2022, the company owned or operated 254 solid waste landfills, five secure hazardous waste landfills, 97 MRFs, and 337 transfer stations. It also provides materials processing and commodities recycling services at its MRFs, where cardboard, paper, glass, metals, plastics, construction and demolition materials, and other recycling commodities are recovered for resale or redirected for other purposes; recycling brokerage services, such as managing the marketing of recyclable materials for third parties; and other strategic business solutions. In addition, the company offers construction and remediation services; services related with the disposal of fly ash, and residue generated from the combustion of coal and other fuel stocks; in-plant services comprising full-service waste management solutions and consulting services; and specialized disposal services for oil and gas exploration and production operations. The company was formerly known as USA Waste Services, Inc. and changed its name to Waste Management, Inc. in 1998. Waste Management, Inc. was incorporated in 1987 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Robert Half Inc.","Symbol":"RHI","Current Price":"66.07","Latest MA":"67.00","Price Target":69.2,"Difference from MA":"-1.39%","Difference from Open":"1.87%","Change from Yesterday":"-4.45%","Change from Last Report":"-0.33","Latest Volume":"1,808,495","Market Cap":"6,821,529,088","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":17.440956,"PB Ratio":4.549649,"ROE":0.1864,"DTE":16.213,"Industry":"Staffing & Employment Services","Sector":"Industrials","Beta":1.224,"Trailing PEG":null,"Trailing PE":27.077868,"Trailing PS":1.1588712,"Quick Ratio":1.111,"Day High":66.725,"Day Low":63.1,"VS Average Volume":2.0064158889,"Company Summary":"Robert Half Inc. provides talent solutions and business consulting services in North America, South America, Europe, Asia, and Australia. The company operates through Contract Talent Solutions, Permanent Placement Talent Solutions, and Protiviti segments. The Contract Talent Solutions segment provides contract engagement professionals in the fields of finance and accounting, technology, marketing and creative, legal and administrative, and customer support. This segment markets its services to clients and employment candidates through both national and local advertising activities, including radio, digital advertising, job boards, alliance partners, and events. The Permanent Placement Talent Solutions segment engages in the placement of full-time accounting, finance, and tax and accounting operations personnel. The Protiviti segment offers consulting services in the areas of internal audit, technology consulting, risk, and compliance consulting. It offers it services under the Robert Half brand name. The company was formerly known as Robert Half International Inc. and changed its name to Robert Half Inc. in July 2023. Robert Half Inc. was founded in 1948 and is headquartered in Menlo Park, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Tetra Tech, Inc.","Symbol":"TTEK","Current Price":"33.34","Latest MA":"43.95","Price Target":44.5,"Difference from MA":"-24.14%","Difference from Open":"-2.74%","Change from Yesterday":"-11.55%","Change from Last Report":"-0.28","Latest Volume":"6,240,151","Market Cap":"8,936,053,760","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.474966,"PB Ratio":4.8494544,"ROE":0.18655,"DTE":55.515,"Industry":"Engineering & Construction","Sector":"Industrials","Beta":0.939,"Trailing PEG":null,"Trailing PE":27.10569,"Trailing PS":2.1101577,"Quick Ratio":1.111,"Day High":35.185,"Day Low":31.09,"VS Average Volume":2.612755465,"Company Summary":"Tetra Tech, Inc. provides consulting and engineering services in the United States and internationally. The company operates through two segments, Government Services Group (GSG) and Commercial\/International Services Group (CIG). The GSG segment offers early data collection and monitoring, data analysis and information management, science and engineering applied research, engineering design, project management, and operations and maintenance services; and climate change and energy management consulting, as well as greenhouse gas inventory assessment, certification, reduction, and management services. This segment serves federal, state, and local governments; and development agencies in water resources analysis and water management, environmental monitoring, data analytics, government consulting, waste management, and a range of civil infrastructure master planning and engineering design markets. The CIG segment provides early data collection and monitoring, data analysis and information management, feasibility studies and assessments, science and engineering applied research, engineering design, project management, and operations and maintenance services; and environmental remediation and reconstruction services, and industrial water treatment services. This segment serves natural resources, energy, and utilities markets, as well as sustainable infrastructure master planning and engineering design for facilities, transportation, and local development projects. Tetra Tech, Inc. was founded in 1966 and is headquartered in Pasadena, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Microsoft Corporation","Symbol":"MSFT","Current Price":"415.01","Latest MA":"426.72","Price Target":508.1818,"Difference from MA":"-2.74%","Difference from Open":"-0.83%","Change from Yesterday":"-6.16%","Change from Last Report":"0.08","Latest Volume":"27,071,096","Market Cap":"3,085,549,699,072","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":27.592009,"PB Ratio":11.491346,"ROE":0.35604,"DTE":33.657,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.904,"Trailing PEG":2.3451,"Trailing PE":33.38777,"Trailing PS":12.138754,"Quick Ratio":1.163,"Day High":422.86,"Day Low":413.16,"VS Average Volume":1.2409117779,"Company Summary":"Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services. This segment also provides LinkedIn; and dynamics business solutions, including Dynamics 365, a set of intelligent, cloud-based applications across ERP, CRM, power apps, and power automate; and on-premises ERP and CRM applications. The Intelligent Cloud segment offers server products and cloud services, such as azure and other cloud services; SQL and windows server, visual studio, system center, and related client access licenses, as well as nuance and GitHub; and enterprise services including enterprise support services, industry solutions, and nuance professional services. The More Personal Computing segment offers Windows, including windows OEM licensing and other non-volume licensing of the Windows operating system; Windows commercial comprising volume licensing of the Windows operating system, windows cloud services, and other Windows commercial offerings; patent licensing; and windows Internet of Things; and devices, such as surface, HoloLens, and PC accessories. Additionally, this segment provides gaming, which includes Xbox hardware and content, and first- and third-party content; Xbox game pass and other subscriptions, cloud gaming, advertising, third-party disc royalties, and other cloud services; and search and news advertising, which includes Bing, Microsoft News and Edge, and third-party affiliates. The company sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online, and retail stores. The company was founded in 1975 and is headquartered in Redmond, Washington.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Las Vegas Sands Corp.","Symbol":"LVS","Current Price":"47.55","Latest MA":"46.18","Price Target":58.62889,"Difference from MA":"2.95%","Difference from Open":"0.09%","Change from Yesterday":"9.53%","Change from Last Report":"0.12","Latest Volume":"6,531,818","Market Cap":"34,471,358,464","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":16.055449,"PB Ratio":10.060305,"ROE":0.45166,"DTE":384.206,"Industry":"Resorts & Casinos","Sector":"Consumer Cyclical","Beta":1.117,"Trailing PEG":0.6553,"Trailing PE":24.257652,"Trailing PS":3.0459802,"Quick Ratio":0.864,"Day High":48.36,"Day Low":46.5358,"VS Average Volume":1.3507587166,"Company Summary":"Las Vegas Sands Corp., together with its subsidiaries, develops, owns, and operates integrated resorts in Macao and Singapore. It owns and operates The Venetian Macao Resort Hotel, the Londoner Macao, The Parisian Macao, The Plaza Macao and Four Seasons Hotel Macao, Cotai Strip, and the Sands Macao in Macao, the People's Republic of China; and Marina Bay Sands in Singapore. The company's integrated resorts feature accommodations, gaming, entertainment and retail malls, convention and exhibition facilities, celebrity chef restaurants, and other amenities. Las Vegas Sands Corp. was founded in 1988 and is based in Las Vegas, Nevada.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Flex Ltd.","Symbol":"FLEX","Current Price":"42.72","Latest MA":"34.77","Price Target":46.15714,"Difference from MA":"22.87%","Difference from Open":"1.09%","Change from Yesterday":"2.90%","Change from Last Report":"-0.04","Latest Volume":"1,415,688","Market Cap":"16,564,151,296","Earning Date":"2025-01-29","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":15.095186,"PB Ratio":3.2736816,"ROE":0.15442,"DTE":83.65,"Industry":"Electronic Components","Sector":"Technology","Beta":1.076,"Trailing PEG":null,"Trailing PE":19.867441,"Trailing PS":0.6508763,"Quick Ratio":0.72,"Day High":43.0,"Day Low":41.685,"VS Average Volume":0.3111384418,"Company Summary":"Flex Ltd. provides manufacturing solutions to various brands in Asia, the Americas, and Europe. It operates through two segments, Flex Agility Solutions (FAS) and Flex Reliability Solutions (FRS). The FAS segment offers flexible supply and manufacturing system comprising communications, enterprise, and cloud solution, which includes data, edge, and communications infrastructure; lifestyle solution, including appliances, consumer packaging, floorcare, micro mobility, and audio; and consumer devices, such as mobile and high velocity consumer devices. Its FRS segment provides complex ramps with specialized production models and critical environments, which comprise automotive including next generation mobility, autonomous, connectivity, electrification, and smart technologies; health solutions, such as medical devices, medical equipment, and drug delivery; and industrial solutions, including capital equipment, industrial devices, embedded and critical power offerings, and renewables and grid edge. In addition, it provides various services, including design and engineering, such as product design and engineering resources that provide design services, product development, systems integration services, and solutions; supply chain comprising manufacturing, customization, procurement, logistics services, and innovative supply chain solutions; manufacturing; logistics and value-added fulfillment, including warehousing and vendor managed inventory, omni-channel fulfillment, kitting, configuration, and postponement; and integrated reverse logistics and circular economy. Further, the company offers embedded and critical power solutions. The company was formerly known as Flextronics International Ltd. and changed its name to Flex Ltd. in September 2016. Flex Ltd. was founded in 1969 and is headquartered in Austin, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"V.F. Corporation","Symbol":"VFC","Current Price":"26.64","Latest MA":"19.04","Price Target":25.755,"Difference from MA":"39.90%","Difference from Open":"2.23%","Change from Yesterday":"4.13%","Change from Last Report":"0.85","Latest Volume":"3,275,462","Market Cap":"10,378,224,640","Earning Date":"2025-01-29","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":25.077898,"PB Ratio":7.373374,"ROE":-0.22331,"DTE":524.646,"Industry":"Apparel Manufacturing","Sector":"Consumer Cyclical","Beta":1.545,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":1.0282098,"Quick Ratio":0.465,"Day High":26.64,"Day Low":25.67,"VS Average Volume":0.5658602065,"Company Summary":"V.F. Corporation, together with its subsidiaries, engages in the design, procurement, marketing, and distribution of branded lifestyle apparel, footwear, and accessories for men, women, and children in the Americas, Europe, and the Asia-Pacific. It operates through three segments: Outdoor, Active, and Work. The company offers High performance outdoor apparel, footwear, equipment, accessories; outdoor, adventure-inspired lifestyle footwear, apparel, and accessories; performance merino wool and other natural fibers-based apparel and accessories; performance-based footwear; and high performance apparel and accessories based on natural fibers under the The North Face, Timberland, Smartwool, Icebreaker, and Altra brands. It also offers youth culture\/action sports-inspired and streetwear apparel, footwear, and accessories; handbags, luggage, backpacks, totes, and accessories; outdoor-inspired apparel, footwear, and accessories; and backpacks and luggage under the Vans, Supreme, Kipling, Napapijri, Eastpak, and JanSport brands. In addition, the company provides work and work-inspired lifestyle apparel and footwear; and protective work footwear under the Dickies, and Timberland PRO brands. The company sells its products primarily to specialty stores, department stores, national chains, independently-operated partnership stores, and mass merchants, as well as sells through direct-to-consumer operations, including retail stores, concession retail stores, and e-commerce sites, and other digital platforms. V.F. Corporation was founded in 1899 and is headquartered in Denver, Colorado.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Levi Strauss & Co","Symbol":"LEVI","Current Price":"17.95","Latest MA":"18.18","Price Target":21.21571,"Difference from MA":"-1.25%","Difference from Open":"5.59%","Change from Yesterday":"-0.88%","Change from Last Report":"-1.07","Latest Volume":"2,492,590","Market Cap":"7,106,063,872","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":12.210885,"PB Ratio":3.8021605,"ROE":0.08122,"DTE":120.196,"Industry":"Apparel Manufacturing","Sector":"Consumer Cyclical","Beta":1.173,"Trailing PEG":null,"Trailing PE":47.236843,"Trailing PS":1.1539752,"Quick Ratio":0.646,"Day High":18.86,"Day Low":16.77,"VS Average Volume":1.4023972391,"Company Summary":"Levi Strauss & Co. designs, markets, and sells apparels and related accessories for men, women, and children worldwide. The company offers jeans, casual and dress pants, activewears, tops, shorts, skirts, dresses, jumpsuits, shirts, sweaters, jackets, footwear, and related accessories under the Levi's, Dockers, Signature by Levi Strauss & Co., Denizen, and Beyond Yoga brands. It also licenses Levi's and Dockers trademarks for various product categories, including footwear, belts, wallets, bags, outerwear, sweaters, dress shirts, kids wear, sleepwear, and hosiery. In addition, the company sells its products through third-party retailers, such as department stores, specialty retailers, third-party e-commerce sites, and franchisees; and directly to consumers through various formats, including company-operated mainline and outlet stores, company-operated e-commerce sites, and select shop-in-shops located in department stores and other third-party retail locations. Further, it operates brand-dedicated stores and shop-in-shops. The company was founded in 1853 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Alibaba Group Holding Limited","Symbol":"BABA","Current Price":"102.19","Latest MA":"87.66","Price Target":120.953445,"Difference from MA":"16.57%","Difference from Open":"5.03%","Change from Yesterday":"5.60%","Change from Last Report":"0.23","Latest Volume":"18,170,110","Market Cap":"242,800,951,296","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":1.4416469,"PB Ratio":0.25208843,"ROE":0.05668,"DTE":22.796,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":0.349,"Trailing PEG":0.6431,"Trailing PE":21.026976,"Trailing PS":0.25551325,"Quick Ratio":0.97,"Day High":102.65,"Day Low":97.14,"VS Average Volume":1.1723884512,"Company Summary":"Alibaba Group Holding Limited, through its subsidiaries, provides technology infrastructure and marketing reach to help merchants, brands, retailers, and other businesses to engage with their users and customers in the People's Republic of China and internationally. The company operates through seven segments: China Commerce, International Commerce, Local Consumer Services, Cainiao, Cloud, Digital Media and Entertainment, and Innovation Initiatives and Others. It operates Taobao and Tmall, which are digital retail platforms; Alimama, a proprietary monetization platform; 1688.com and Alibaba.com, which are online wholesale marketplaces; AliExpress, a retail marketplace; Lazada, Trendyol, and Daraz that are e-commerce platforms; Freshippo, a retail platform for groceries and fresh goods; and Tmall Global, an import e-commerce platform. The company also operates Cainiao Network logistic services platform; Ele.me, an on-demand delivery and local services platform; Koubei, a restaurant and local services guide platform; and Fliggy, an online travel platform. In addition, it offers pay-for-performance, in-feed, and display marketing services; and Taobao Ad Network and Exchange, a real-time online bidding marketing exchange. Further, the company provides elastic computing, storage, network, security, database, big data, and IoT services; and hardware, software license, software installation, and application development and maintenance services. Additionally, it operates Youku, an online video platform; Quark, a platform for information search, storage, and consumption; Alibaba Pictures and other content platforms that provide online videos, films, live events, news feeds, literature, music, and others; Amap, a mobile digital map, navigation, and real-time traffic information app; DingTalk, a business efficiency mobile app; and Tmall Genie smart speaker. The company was incorporated in 1999 and is based in Hangzhou, the People's Republic of China.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Annaly Capital Management Inc.","Symbol":"NLY","Current Price":"20.30","Latest MA":"18.82","Price Target":20.95455,"Difference from MA":"7.90%","Difference from Open":"1.47%","Change from Yesterday":"2.76%","Change from Last Report":"0.10","Latest Volume":"4,467,759","Market Cap":"11,743,539,200","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":7.3776274,"PB Ratio":1.0389378,"ROE":0.0127,"DTE":687.699,"Industry":"REIT - Mortgage","Sector":"Real Estate","Beta":1.579,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":31.793602,"Quick Ratio":0.371,"Day High":20.38,"Day Low":20.01,"VS Average Volume":0.6812564767,"Company Summary":"Annaly Capital Management, Inc., a diversified capital manager, engages in mortgage finance. The company invests in agency mortgage-backed securities collateralized by residential mortgages; non-agency residential whole loans and securitized products within the residential and commercial markets; mortgage servicing rights; agency commercial mortgage-backed securities; to-be-announced forward contracts; residential mortgage loans; and agency or private label credit risk transfer securities. It has elected to be taxed as a real estate investment trust (REIT). As a REIT, it is not subject to federal income tax to the extent that it distributes its taxable income to its shareholders. The company was incorporated in 1996 and is based in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"International Business Machines","Symbol":"IBM","Current Price":"258.31","Latest MA":"209.23","Price Target":231.32529,"Difference from MA":"23.46%","Difference from Open":"3.32%","Change from Yesterday":"12.99%","Change from Last Report":"0.33","Latest Volume":"8,383,446","Market Cap":"238,846,705,664","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":22.685295,"PB Ratio":9.769735,"ROE":0.26729,"DTE":245.112,"Industry":"Information Technology Services","Sector":"Technology","Beta":0.71,"Trailing PEG":7.571,"Trailing PE":40.23548,"Trailing PS":3.816662,"Quick Ratio":0.896,"Day High":261.8,"Day Low":247.01,"VS Average Volume":2.1447670136,"Company Summary":"International Business Machines Corporation, together with its subsidiaries, provides integrated solutions and services worldwide. The company operates through Software, Consulting, Infrastructure, and Financing segments. The Software segment offers a hybrid cloud and AI platforms that allows clients to realize their digital and AI transformations across the applications, data, and environments in which they operate. The Consulting segment focuses on skills integration for strategy, experience, technology, and operations by domain and industry. The Infrastructure segment provides on-premises and cloud based server, and storage solutions, as well as life-cycle services for hybrid cloud infrastructure deployment. The Financing segment offers client and commercial financing, facilitates IBM clients' acquisition of hardware, software, and services. The company has a strategic partnership to various companies including hyperscalers, service providers, global system integrators, and software and hardware vendors that includes Adobe, Amazon Web services, Microsoft, Oracle, Salesforce, Samsung Electronics and SAP, and others. The company was formerly known as Computing-Tabulating-Recording Co. International Business Machines Corporation was incorporated in 1911 and is headquartered in Armonk, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Meta Platforms, Inc.","Symbol":"META","Current Price":"690.20","Latest MA":"559.34","Price Target":717.7861,"Difference from MA":"23.39%","Difference from Open":"-0.95%","Change from Yesterday":"2.01%","Change from Last Report":"0.29","Latest Volume":"18,637,088","Market Cap":"1,742,403,010,560","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":23.746006,"PB Ratio":10.588163,"ROE":0.36134,"DTE":29.811,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.215,"Trailing PEG":1.4368,"Trailing PE":28.90285,"Trailing PS":11.153022,"Quick Ratio":2.568,"Day High":710.79,"Day Low":676.1,"VS Average Volume":1.4035211594,"Company Summary":"Meta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and wearables worldwide. It operates in two segments, Family of Apps and Reality Labs. The Family of Apps segment offers Facebook, which enables people to share, discuss, discover, and connect with interests; Instagram, a community for sharing photos, videos, and private messages, as well as feed, stories, reels, video, live, and shops; Messenger, a messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls; and WhatsApp, a messaging application that is used by people and businesses to communicate and transact privately. The Reality Labs segment provides augmented and virtual reality related products comprising consumer hardware, software, and content that help people feel connected, anytime, and anywhere. The company was formerly known as Facebook, Inc. and changed its name to Meta Platforms, Inc. in October 2021. The company was incorporated in 2004 and is headquartered in Menlo Park, California","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"C.H. Robinson Worldwide, Inc.","Symbol":"CHRW","Current Price":"101.59","Latest MA":"101.74","Price Target":115.72727,"Difference from MA":"-0.14%","Difference from Open":"2.00%","Change from Yesterday":"-5.93%","Change from Last Report":"0.20","Latest Volume":"1,125,396","Market Cap":"12,009,036,800","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":17.657366,"PB Ratio":7.3147817,"ROE":0.22818,"DTE":116.88,"Industry":"Integrated Freight & Logistics","Sector":"Industrials","Beta":0.842,"Trailing PEG":1.3889,"Trailing PE":35.15398,"Trailing PS":0.67610127,"Quick Ratio":1.355,"Day High":105.285,"Day Low":98.0,"VS Average Volume":0.9872500943,"Company Summary":"C.H. Robinson Worldwide, Inc., together with its subsidiaries, provides freight transportation services, and related logistics and supply chain services in the United States and internationally. It operates through two segments: North American Surface Transportation and Global Forwarding. The company offers transportation and logistics services, such as truckload, less than truckload transportation brokerage services, which include the shipment of single or multiple pallets of freight; intermodal transportation that comprises the shipment service of freight in containers or trailers by a combination of truck and rail; and non-vessel operating common carrier and freight forwarding services, as well as organizes air shipments and provides door-to-door services. It also provides customs brokerage services; and other logistics services, such as fee-based managed, warehousing, small parcel, and other services. It has contractual relationships with approximately 45,000 transportation companies, including motor carriers, railroads, and ocean and air carriers. In addition, the company is involved in the buying, selling, and\/or marketing of fresh fruits, vegetables, and other value-added perishable items under the Robinson Fresh brand name. Further, the company offers transportation management services or managed TMS; and other surface transportation services. It provides its fresh produce to grocery retailers, restaurants, produce wholesalers, and foodservice distributors through a network of independent produce growers and suppliers. The company was founded in 1905 and is headquartered in Eden Prairie, Minnesota.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Corning Incorporated","Symbol":"GLW","Current Price":"49.60","Latest MA":"44.95","Price Target":55.49429,"Difference from MA":"10.34%","Difference from Open":"-1.12%","Change from Yesterday":"-0.39%","Change from Last Report":"0.12","Latest Volume":"3,440,262","Market Cap":"42,418,364,416","Earning Date":"2025-01-29","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":18.34496,"PB Ratio":3.6363635,"ROE":0.019299999,"DTE":72.739,"Industry":"Electronic Components","Sector":"Technology","Beta":1.029,"Trailing PEG":0.6373,"Trailing PE":85.51724,"Trailing PS":3.3636003,"Quick Ratio":0.776,"Day High":50.16,"Day Low":48.78,"VS Average Volume":0.7302233846,"Company Summary":"Corning Incorporated engages in the display technologies, optical communications, environmental technologies, specialty materials, and life sciences businesses in the United States and internationally. The company's Display Technologies segment offers glass substrates for flat panel displays, including liquid crystal displays and organic light-emitting diodes that are used in televisions, notebook computers, desktop monitors, tablets, and handheld devices. Its Optical Communications segment provides optical fibers and cables; and hardware and equipment products, such as cable assemblies, fiber optic hardware and connectors, optical components and couplers, closures, network interface devices, and other accessories for the telecommunications industry, businesses, governments, and individuals. The company's Specialty Materials segment manufactures products that offer material formulations for glass, glass ceramics, crystals, precision metrology instruments, and software, as well as glass wafers and substrates, tinted sunglasses, and radiation shielding products for various markets comprising mobile consumer electronics, semiconductor equipment optics and consumables, aerospace and defense optics, radiation shielding products, sunglasses, and telecommunications components. Its Environmental Technologies segment provides ceramic substrates and filter products for emissions control in mobile, gasoline, and diesel applications. The company's Life Sciences segment offers laboratory products, including consumables, such as plastic vessels, liquid handling plastics, specialty surfaces, cell culture media, and serum, as well as general labware, and glassware and equipment under the Corning, Pyrex, Falcon, and Axygen brands. The company was formerly known as Corning Glass Works and changed its name to Corning Incorporated in April 1989. Corning Incorporated was founded in 1851 and is headquartered in Corning, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"ServiceNow, Inc.","Symbol":"NOW","Current Price":"995.14","Latest MA":"934.95","Price Target":1140.2083,"Difference from MA":"6.44%","Difference from Open":"-3.11%","Change from Yesterday":"-12.99%","Change from Last Report":"0.11","Latest Volume":"3,039,813","Market Cap":"205,314,293,760","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":49.76255,"PB Ratio":22.100471,"ROE":0.16221,"DTE":24.166,"Industry":"Software - Application","Sector":"Technology","Beta":0.986,"Trailing PEG":3.0939,"Trailing PE":145.06413,"Trailing PS":19.621014,"Quick Ratio":0.973,"Day High":1031.0,"Day Low":990.0,"VS Average Volume":2.4106062096,"Company Summary":"ServiceNow, Inc. provides end to-end intelligent workflow automation platform solutions for digital businesses in the North America, Europe, the Middle East and Africa, Asia Pacific, and internationally. The company operates the Now platform for end-to-end digital transformation, artificial intelligence, machine learning, robotic process automation, process mining, performance analytics, and collaboration and development tools. It also provides asset management, cloud observability, integrated risk management; information technology (IT) service management applications; IT service management product suite for enterprise's employees, customers, and partners; strategic portfolio management product suite; IT operations management product that connects a customer's physical and cloud-based IT infrastructure; IT asset management; and security operations that connects with internal and third party. In addition, the company offers integrated risk management product to manage risk and resilience; environmental, social and governance management product; human resources, legal, and workplace service delivery products; customer service management product; and field service management applications. Further, the company provides app engine product; automation engine; platform privacy and security product; and source-to-pay operations. It serves to government, financial services, healthcare, telecommunications, manufacturing, IT services, technology, oil and gas, education, and consumer products through service providers and resale partners. ServiceNow, Inc. has strategic collaboration with Amazon Web Services, Inc. to accelerate AI-driven business transformation. The company was formerly known as Service-now.com and changed its name to ServiceNow, Inc. in May 2012. ServiceNow, Inc. was founded in 2004 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"T-Mobile US, Inc.","Symbol":"TMUS","Current Price":"238.09","Latest MA":"209.23","Price Target":250.4726,"Difference from MA":"13.79%","Difference from Open":"-0.47%","Change from Yesterday":"1.22%","Change from Last Report":"-0.05","Latest Volume":"1,552,283","Market Cap":"272,507,322,368","Earning Date":"2025-01-29","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":18.48809,"PB Ratio":4.315636,"ROE":0.16087,"DTE":182.272,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.496,"Trailing PEG":0.9413,"Trailing PE":27.147661,"Trailing PS":3.4060862,"Quick Ratio":0.862,"Day High":240.84,"Day Low":236.34,"VS Average Volume":0.4201311696,"Company Summary":"T-Mobile US, Inc., together with its subsidiaries, provides mobile communications services in the United States, Puerto Rico, and the United States Virgin Islands. The company offers voice, messaging, and data services to customers in the postpaid, prepaid, and wholesale and other services. It also provides wireless devices, including smartphones, wearables, tablets, home broadband routers, and other mobile communication devices, as well as wireless devices and accessories; financing through equipment installment plans; reinsurance for device insurance policies and extended warranty contracts; leasing through JUMP! On Demand; and High Speed Internet services. In addition, the company offers services, devices, and accessories under the T-Mobile and Metro by T-Mobile brands through its owned and operated retail stores, T-Mobile app and customer care channels, and its websites. It also sells its devices to dealers and other third-party distributors for resale through independent third-party retail outlets and various third-party websites. The company was founded in 1994 and is headquartered in Bellevue, Washington. T-Mobile US, Inc. operates as a subsidiary of Deutsche Telekom AG.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"General Motors Company","Symbol":"GM","Current Price":"50.52","Latest MA":"49.48","Price Target":60.05308,"Difference from MA":"2.10%","Difference from Open":"0.14%","Change from Yesterday":"1.50%","Change from Last Report":"0.10","Latest Volume":"3,428,970","Market Cap":"50,267,500,544","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":4.4064817,"PB Ratio":0.78342587,"ROE":0.14167,"DTE":174.581,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":1.414,"Trailing PEG":7.6221,"Trailing PE":7.9309263,"Trailing PS":0.27510822,"Quick Ratio":0.948,"Day High":50.89,"Day Low":49.94,"VS Average Volume":0.3038168825,"Company Summary":"General Motors Company designs, builds, and sells trucks, crossovers, cars, and automobile parts; and provide software-enabled services and subscriptions worldwide. The company operates through GM North America, GM International, Cruise, and GM Financial segments. It markets its vehicles primarily under the Buick, Cadillac, Chevrolet, GMC, Baojun, and Wuling brand names. In addition, the company sells trucks, crossovers, cars, and automobile parts through retail dealers, and distributors and dealers, as well as to fleet customers, including daily rental car companies, commercial fleet customers, leasing companies, and governments. Further, it offers range of after-sale services through dealer network, such as maintenance, light repairs, collision repairs, vehicle accessories, and extended service warranties. Additionally, the company provides automotive financing; and software-enabled services and subscriptions. General Motors Company was founded in 1908 and is headquartered in Detroit, Michigan.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"SiriusXM Holdings Inc.","Symbol":"SIRI","Current Price":"23.02","Latest MA":"27.22","Price Target":24.69231,"Difference from MA":"-15.44%","Difference from Open":"4.68%","Change from Yesterday":"5.36%","Change from Last Report":"0.17","Latest Volume":"5,588,146","Market Cap":"7,808,430,080","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.205008,"PB Ratio":0.7186563,"ROE":-0.46799,"DTE":98.775,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.05,"Trailing PEG":0.1852,"Trailing PE":"N\/A","Trailing PS":0.8874225,"Quick Ratio":0.26,"Day High":23.325,"Day Low":21.99,"VS Average Volume":1.0002471914,"Company Summary":"Sirius XM Holdings Inc. operates as an audio entertainment company in North America. It operates in two segments, Sirius XM, and Pandora and Off-platform. The company's Sirius XM segment provides music, sports, entertainment, comedy, talk, news, traffic and weather channels, and other content, as well as podcast and infotainment services on subscription fee basis; and live, curated, and exclusive and on demand programming services through satellite radio systems and streamed through applications for mobile and home devices, and other consumer electronic equipment. This segment also distributes satellite radios through automakers and retailers, as well as its website; podcasts, including true crime, news, politics, music, comedy, sports, and entertainment; and offers location-based services through two-way wireless connectivity, including safety, security, convenience, maintenance and data, remote vehicles diagnostic, and stolen or parked vehicle locator services. In addition, this segment provides music channels on the DISH Network satellite television service as a programming package; Travel Link, a suite of data services that include graphical weather, fuel prices, sports schedule and scores, and movie listings; graphic information related to road closings, traffic flow, and incident data for consumers with in-vehicle navigation systems; real-time weather services in vehicles, boats, and planes; and music programming and commercial-free music services for office, restaurants, and other business. Its Pandora and Off-platform segment operates music, comedy, and podcast streaming platform, which offers personalized experience for listener through computers, tablets, mobile devices, vehicle speakers, and connected devices; and provides advertising services. The company was incorporated in 2013 and is headquartered in New York.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Nextracker Inc.","Symbol":"NXT","Current Price":"52.24","Latest MA":"39.76","Price Target":55.66241,"Difference from MA":"31.38%","Difference from Open":"4.61%","Change from Yesterday":"6.12%","Change from Last Report":"0.60","Latest Volume":"1,975,918","Market Cap":"7,703,153,664","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":13.74115,"PB Ratio":7.6519704,"ROE":0.60612,"DTE":11.396,"Industry":"Solar","Sector":"Technology","Beta":"N\/A","Trailing PEG":5.163,"Trailing PE":13.06,"Trailing PS":2.7487378,"Quick Ratio":1.794,"Day High":52.24,"Day Low":48.6501,"VS Average Volume":0.691758905,"Company Summary":"Nextracker Inc., an energy solutions company, provides solar tracker and software solutions for utility-scale and distributed generation solar projects in the United States and internationally. The company offers tracking solutions, which includes NX Horizon, a solar tracking solution; and NX Horizon-XTR, a terrain-following tracker designed to expand the addressable market for trackers on sites with sloped, uneven, and challenging terrain. It also provides TrueCapture, a self-adjusting tracker control system, which boosts solar power plant production by optimizing the position of individual tracker row in response to site features, such as varying topography and changing weather conditions; and NX Navigator, that assists solar power plant owners and operators in monitoring, controlling, and protecting their solar projects. The company was founded in 2013 and is headquartered in Fremont, California. As of March 31, 2024 Nextracker Inc. was formerly a subsidiary of Flex Ltd.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Invesco Ltd","Symbol":"IVZ","Current Price":"19.30","Latest MA":"16.95","Price Target":19.51562,"Difference from MA":"13.84%","Difference from Open":"0.18%","Change from Yesterday":"1.55%","Change from Last Report":"0.10","Latest Volume":"1,414,360","Market Cap":"8,644,160,512","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":9.274391,"PB Ratio":0.8071533,"ROE":-0.00944,"DTE":5.597,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.424,"Trailing PEG":1.6128,"Trailing PE":16.351696,"Trailing PS":1.4682475,"Quick Ratio":0.75,"Day High":19.545,"Day Low":19.24,"VS Average Volume":0.3944483396,"Company Summary":"Invesco Ltd. is a publicly owned investment manager. The firm provides its services to retail clients, institutional clients, high-net worth clients, public entities, corporations, unions, non-profit organizations, endowments, foundations, pension funds, financial institutions, and sovereign wealth funds. It manages separate client-focused equity and fixed income portfolios. The firm also launches equity, fixed income, commodity, multi-asset, and balanced mutual funds for its clients. It launches equity, fixed income, multi-asset, and balanced exchange-traded funds. The firm also launches and manages private funds. It invests in the public equity and fixed income markets across the globe. The firm also invests in alternative markets, such as commodities and currencies. For the equity portion of its portfolio, it invests in growth and value stocks of large-cap, mid-cap, and small-cap companies. For the fixed income portion of its portfolio, the firm invests in convertibles, government bonds, municipal bonds, treasury securities, and cash. It also invests in short term and intermediate term bonds, investment grade and high yield bonds, taxable and tax-free bonds, senior secured loans, and structured securities such as asset-backed securities, mortgage-backed securities, and commercial mortgage-backed securities. The firm employs absolute return, global macro, and long\/short strategies. It employs quantitative analysis to make its investments. The firm was formerly known as Invesco Plc, AMVESCAP plc, Amvesco plc, Invesco PLC, Invesco MIM, and H. Lotery & Co. Ltd. Invesco Ltd. was founded in 1935 and is based in Atlanta, Georgia with an additional office in Hamilton, Bermuda.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Starbucks Corporation","Symbol":"SBUX","Current Price":"109.46","Latest MA":"91.22","Price Target":105.604,"Difference from MA":"20.00%","Difference from Open":"0.42%","Change from Yesterday":"0.84%","Change from Last Report":"-0.02","Latest Volume":"6,861,139","Market Cap":"124,338,896,896","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":29.888403,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":0.962,"Trailing PEG":2.2714,"Trailing PE":35.196144,"Trailing PS":3.4370358,"Quick Ratio":0.524,"Day High":110.34,"Day Low":108.04,"VS Average Volume":0.7966321985,"Company Summary":"Starbucks Corporation, together with its subsidiaries, operates as a roaster, marketer, and retailer of coffee worldwide. The company operates through three segments: North America, International, and Channel Development. Its stores offer coffee, tea, and other beverages, roasted whole beans and ground coffees, single serve products, and ready-to-drink beverages; and various food products, such as pastries, breakfast sandwiches, and lunch items. The company also licenses its trademarks through licensed stores, and grocery and foodservice accounts. The company offers its products under the Starbucks Coffee, Teavana, Seattle's Best Coffee, Ethos, and Starbucks Reserve brands. Starbucks Corporation was founded in 1971 and is based in Seattle, Washington.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Boeing Company (The)","Symbol":"BA","Current Price":"177.71","Latest MA":"165.62","Price Target":189.755,"Difference from MA":"7.30%","Difference from Open":"1.78%","Change from Yesterday":"2.32%","Change from Last Report":"0.13","Latest Volume":"2,595,764","Market Cap":"133,139,431,424","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":41.31272,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.572,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":1.8165369,"Quick Ratio":0.238,"Day High":178.29,"Day Low":173.7218,"VS Average Volume":0.2226576469,"Company Summary":"The Boeing Company, together with its subsidiaries, designs, develops, manufactures, sells, services, and supports commercial jetliners, military aircraft, satellites, missile defense, human space flight and launch systems, and services worldwide. The company operates through Commercial Airplanes; Defense, Space & Security; and Global Services segments. The Commercial Airplanes segment develops, produces, and markets commercial jet aircraft for passenger and cargo requirements, as well as provides fleet support services. The Defense, Space & Security segment engages in the research, development, production, and modification of manned and unmanned military aircraft and weapons systems; strategic defense and intelligence systems, which include strategic missile and defense systems, command, control, communications, computers, intelligence, surveillance and reconnaissance, cyber and information solutions, and intelligence systems; and satellite systems, such as government and commercial satellites, and space exploration. The Global Services segment offers products and services, including supply chain and logistics management, engineering, maintenance and modifications, upgrades and conversions, spare parts, pilot and maintenance training systems and services, technical and maintenance documents, and data analytics and digital services to commercial and defense customers. The Boeing Company was incorporated in 1916 and is based in Arlington, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"SoFi Technologies, Inc.","Symbol":"SOFI","Current Price":"16.38","Latest MA":"10.78","Price Target":13.29375,"Difference from MA":"51.96%","Difference from Open":"0.80%","Change from Yesterday":"2.38%","Change from Last Report":"0.00","Latest Volume":"16,286,304","Market Cap":"17,941,995,520","Earning Date":"2025-01-27","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":35.276634,"PB Ratio":2.9011688,"ROE":0.037249997,"DTE":54.394,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.613,"Trailing PEG":null,"Trailing PE":42.0,"Trailing PS":7.1220694,"Quick Ratio":0.47,"Day High":16.67,"Day Low":16.11,"VS Average Volume":0.3326169316,"Company Summary":"SoFi Technologies, Inc. provides various financial services in the United States, Latin America, and Canada. It operates through three segments: Lending, Technology Platform, and Financial Services. The company offers lending and financial services and products that allows its members to borrow, save, spend, invest, and protect money. It offers personal loans, student loans, home loans, and related services. The company also operates Galileo, a technology platform that offers services to financial and non-financial institution; and Technisys, a cloud-native digital and core banking platform with financial services customers. In addition, it provides SoFi Money offers checking and savings accounts, debit cards, and cash management products; and SoFi Invest, a mobile-first investment platform that provides access to trading and advisory solutions, such as investing and robo-advisory. Further, the company offers SoFi Credit Card that provides cash backs on every purchase; Sofi Relay, a personal finance management product that allows to track all of their financial accounts comprising credit score and spending behaviors; SoFi Protect, which offers insurance product; SoFi Travel, an application that manages travel search and booking experience; SoFi At Work provides financial benefits to employees, including student loan payments made on their employees' behalf; Lantern Credit, a financial services marketplace platform for seeking alternative products and provide product comparisons; and other lending as a service that offers pre-qualified borrower referrals and sells loans to third-party partner. The company was founded in 2011 and is based in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"AT&T Inc.","Symbol":"T","Current Price":"24.20","Latest MA":"20.96","Price Target":26.61885,"Difference from MA":"15.43%","Difference from Open":"0.12%","Change from Yesterday":"-0.08%","Change from Last Report":"0.04","Latest Volume":"19,185,990","Market Cap":"173,623,312,384","Earning Date":"2025-01-27","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":10.803172,"PB Ratio":1.6959904,"ROE":0.08759,"DTE":125.151,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.73,"Trailing PEG":4.1158,"Trailing PE":16.238255,"Trailing PS":1.4224423,"Quick Ratio":0.42,"Day High":24.23,"Day Low":23.775,"VS Average Volume":0.5341745785,"Company Summary":"AT&T Inc. provides telecommunications and technology services worldwide. The company operates through two segments, Communications and Latin America. The Communications segment offers wireless voice and data communications services; and sells handsets, wireless data cards, wireless computing devices, carrying cases\/protective covers, and wireless chargers through its own company-owned stores, agents, and third-party retail stores. It also provides Virtual Private Networks, AT&T Dedicated Internet, Ethernet, data services, cloud solutions, outsourcing, and managed professional services, as well as customer premises equipment for multinational corporations, small and mid-sized businesses, governmental, and wholesale customers. In addition, this segment offers broadband services, including fiber connections, legacy telephony voice communication services, and other VoIP services and equipment to residential customers. This segment markets its communications services and products under the AT&T, AT&T Business, Cricket, AT&T PREPAID, and AT&T Fiber brand names. The Latin America segment provides postpaid and prepaid wireless services in Mexico under the AT&T and Unefon brand names, as well as sells smartphones through its owned stores, agents and third-party retail stores. The company was formerly known as SBC Communications Inc. and changed its name to AT&T Inc. in 2005. AT&T Inc. was incorporated in 1983 and is based in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"Verizon Communications Inc.","Symbol":"VZ","Current Price":"39.71","Latest MA":"40.58","Price Target":47.66043,"Difference from MA":"-2.15%","Difference from Open":"-1.59%","Change from Yesterday":"-1.43%","Change from Last Report":"-0.01","Latest Volume":"11,447,842","Market Cap":"167,163,985,920","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.148328,"PB Ratio":1.7354208,"ROE":0.10431,"DTE":182.615,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.418,"Trailing PEG":1.0831,"Trailing PE":9.5917635,"Trailing PS":1.2452899,"Quick Ratio":0.51,"Day High":40.29,"Day Low":39.16,"VS Average Volume":0.5713599383,"Company Summary":"Verizon Communications Inc., through its subsidiaries, engages in the provision of communications, technology, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide. It operates in two segments, Verizon Consumer Group (Consumer) and Verizon Business Group (Business). The Consumer segment provides wireless services across the wireless networks in the United States under the Verizon and TracFone brands and through wholesale and other arrangements; and fixed wireless access (FWA) broadband through its wireless networks, as well as related equipment and devices, such as smartphones, tablets, smart watches, and other wireless-enabled connected devices. The segment also offers wireline services in the Mid-Atlantic and Northeastern United States, as well as Washington D.C. through its fiber-optic network, Verizon Fios product portfolio, and a copper-based network. The Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and conferencing, corporate networking, security and managed network, local and long-distance voice, and network access services to deliver various IoT services and products to businesses, government customers, and wireless and wireline carriers in the United States and internationally. The company was formerly known as Bell Atlantic Corporation and changed its name to Verizon Communications Inc. in June 2000. Verizon Communications Inc. was incorporated in 1983 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:41:08"},{"Company Name":"NextEra Energy, Inc.","Symbol":"NEE","Current Price":"71.19","Latest MA":"76.30","Price Target":84.81476,"Difference from MA":"-6.69%","Difference from Open":"-1.11%","Change from Yesterday":"0.41%","Change from Last Report":"0.11","Latest Volume":"1,933,397","Market Cap":"146,395,119,616","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":17.8371,"PB Ratio":2.9249353,"ROE":0.09887999,"DTE":139.015,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.561,"Trailing PEG":3.6645,"Trailing PE":21.12463,"Trailing PS":5.577807,"Quick Ratio":0.258,"Day High":72.0,"Day Low":70.88,"VS Average Volume":0.1734065168,"Company Summary":"NextEra Energy, Inc., through its subsidiaries, generates, transmits, distributes, and sells electric power to retail and wholesale customers in North America. The company generates electricity through wind, solar, nuclear,natural gas, and other clean energy. It also develops, constructs, and operates long-term contracted assets that consists of clean energy solutions, such as renewable generation facilities, battery storage projects, and electric transmission facilities; sells energy commodities; and owns, develops, constructs, manages and operates electric generation facilities in wholesale energy markets. The company had approximately 33,276 megawatts of net generating capacity; approximately 90,000 circuit miles of transmission and distribution lines; and 883 substations. It serves approximately 12 million people through approximately 5.9 million customer accounts in the east and lower west coasts of Florida. The company was formerly known as FPL Group, Inc. and changed its name to NextEra Energy, Inc. in 2010. NextEra Energy, Inc. was founded in 1925 and is headquartered in Juno Beach, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Texas Instruments Incorporated","Symbol":"TXN","Current Price":"183.65","Latest MA":"198.01","Price Target":205.69379,"Difference from MA":"-7.25%","Difference from Open":"1.75%","Change from Yesterday":"2.00%","Change from Last Report":"0.04","Latest Volume":"1,595,742","Market Cap":"167,528,644,608","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":25.401669,"PB Ratio":9.699482,"ROE":0.29293,"DTE":84.399,"Industry":"Semiconductors","Sector":"Technology","Beta":0.98,"Trailing PEG":1.7445,"Trailing PE":35.385353,"Trailing PS":10.663143,"Quick Ratio":3.048,"Day High":183.93,"Day Low":180.27,"VS Average Volume":0.2596158398,"Company Summary":"Texas Instruments Incorporated designs, manufactures, and sells semiconductors to electronics designers and manufacturers in the United States and internationally. The company operates through Analog and Embedded Processing segments. The Analog segment offers power products to manage power requirements across various voltage levels, including battery-management solutions, DC\/DC switching regulators, AC\/DC and isolated controllers and converters, power switches, linear regulators, voltage references, and lighting products. This segment provides signal chain products that sense, condition, and measure signals to allow information to be transferred or converted for further processing and control, including amplifiers, data converters, interface products, motor drives, clocks, and logic and sensing products. The Embedded Processing segment offers microcontrollers that are used in electronic equipment; digital signal processors for mathematical computations; and applications processors for specific computing activity. This segment offers products for use in various markets, such as industrial, automotive, personal electronics, communications equipment, enterprise systems, and calculators and other. It provides DLP products primarily for use in project high-definition images; calculators; and application-specific integrated circuits. The company markets and sells its semiconductor products through direct sales and distributors, as well as through its website. Texas Instruments Incorporated was founded in 1930 and is headquartered in Dallas, Texas.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"American Airlines Group, Inc.","Symbol":"AAL","Current Price":"17.00","Latest MA":"13.11","Price Target":20.995,"Difference from MA":"29.71%","Difference from Open":"0.43%","Change from Yesterday":"-1.88%","Change from Last Report":"0.23","Latest Volume":"20,130,047","Market Cap":"11,180,923,904","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":5.5371203,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Airlines","Sector":"Industrials","Beta":1.399,"Trailing PEG":0.2392,"Trailing PE":13.7125,"Trailing PS":0.20854875,"Quick Ratio":0.422,"Day High":17.22,"Day Low":16.8,"VS Average Volume":0.7392063909,"Company Summary":"American Airlines Group Inc., through its subsidiaries, operates as a network air carrier. The company provides scheduled air transportation services for passengers and cargo through its hubs in Charlotte, Chicago, Dallas\/Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix, and Washington, D.C., as well as through partner gateways in London, Doha, Madrid, Seattle\/Tacoma, Sydney, and Tokyo. It operates a mainline fleet of 965 aircraft. The company was formerly known as AMR Corporation and changed its name to American Airlines Group Inc. in December 2013. American Airlines Group Inc. was founded in 1926 and is headquartered in Fort Worth, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"GE Aerospace","Symbol":"GE","Current Price":"202.88","Latest MA":"174.50","Price Target":225.06589,"Difference from MA":"16.26%","Difference from Open":"1.53%","Change from Yesterday":"1.83%","Change from Last Report":"-0.10","Latest Volume":"1,348,528","Market Cap":"217,824,854,016","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":31.579168,"PB Ratio":11.633409,"ROE":0.22552,"DTE":110.224,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.188,"Trailing PEG":16.4144,"Trailing PE":33.312805,"Trailing PS":3.1138742,"Quick Ratio":0.804,"Day High":203.2732,"Day Low":199.48,"VS Average Volume":0.255435879,"Company Summary":"General Electric Company, doing business as GE Aerospace, designs and produces commercial and defense aircraft engines, integrated engine components, electric power, and mechanical aircraft systems. It also offers aftermarket services to support its products. The company operates in the United States, Europe, China, Asia, the Americas, the Middle East, and Africa. General Electric Company was incorporated in 1892 and is based in Evendale, Ohio.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"TAL Education Group","Symbol":"TAL","Current Price":"12.59","Latest MA":"9.94","Price Target":14.73579,"Difference from MA":"26.77%","Difference from Open":"1.57%","Change from Yesterday":"1.98%","Change from Last Report":"0.12","Latest Volume":"3,802,562","Market Cap":"7,610,702,848","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":26.450907,"PB Ratio":2.0779738,"ROE":0.019609999,"DTE":9.291,"Industry":"Education & Training Services","Sector":"Consumer Defensive","Beta":0.033,"Trailing PEG":0.6622,"Trailing PE":66.28737,"Trailing PS":4.1438704,"Quick Ratio":2.67,"Day High":12.64,"Day Low":12.12,"VS Average Volume":0.5599512876,"Company Summary":"TAL Education Group provides K-12 after-school tutoring services in the People's Republic of China. It provides learning services primarily through small-classes services; personalized premium services; and learning content solutions, such as print books, smart books, mobile apps, and AI-driven learning devices. The company also operates www.xueersi.com, an online education platform; provides investment management and consulting services; develops and sells software and networks, as well as related consulting services; and sells educational materials and products. It offers its services under the Haoweilai and Think Academy brands. TAL Education Group was founded in 2003 and is headquartered in Beijing, the People's Republic of China.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Freeport-McMoRan, Inc.","Symbol":"FCX","Current Price":"36.67","Latest MA":"43.93","Price Target":47.8981,"Difference from MA":"-16.53%","Difference from Open":"-0.00%","Change from Yesterday":"1.01%","Change from Last Report":"-0.01","Latest Volume":"3,518,128","Market Cap":"52,692,078,592","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.531004,"PB Ratio":3.002776,"ROE":0.16870001,"DTE":33.531,"Industry":"Copper","Sector":"Basic Materials","Beta":1.91,"Trailing PEG":5.1083,"Trailing PE":28.207615,"Trailing PS":2.0550733,"Quick Ratio":1.048,"Day High":36.815,"Day Low":36.28,"VS Average Volume":0.2854036282,"Company Summary":"Freeport-McMoRan Inc. engages in the mining of mineral properties in North America, South America, and Indonesia. It primarily explores for copper, gold, molybdenum, silver, and other metals. The company's assets include the Grasberg minerals district in Indonesia; Morenci, Bagdad, Safford, Sierrita, and Miami in Arizona; Chino and Tyrone in New Mexico; and Henderson and Climax in Colorado, North America, as well as Cerro Verde in Peru and El Abra in Chile. The company was formerly known as Freeport-McMoRan Copper & Gold Inc. and changed its name to Freeport-McMoRan Inc. in July 2014. Freeport-McMoRan Inc. was incorporated in 1987 and is headquartered in Phoenix, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"CSX Corporation","Symbol":"CSX","Current Price":"33.08","Latest MA":"33.79","Price Target":37.08923,"Difference from MA":"-2.12%","Difference from Open":"0.44%","Change from Yesterday":"0.20%","Change from Last Report":"0.09","Latest Volume":"3,340,832","Market Cap":"63,782,490,112","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":15.584067,"PB Ratio":4.932886,"ROE":0.29458,"DTE":147.913,"Industry":"Railroads","Sector":"Industrials","Beta":1.191,"Trailing PEG":2.1944,"Trailing PE":18.477654,"Trailing PS":4.34456,"Quick Ratio":1.195,"Day High":33.185,"Day Low":32.85,"VS Average Volume":0.261718074,"Company Summary":"CSX Corporation, together with its subsidiaries, provides rail-based freight transportation services. The company offers rail services; and transportation of intermodal containers and trailers, as well as other transportation services, such as rail-to-truck transfers and bulk commodity operations. It also transports chemicals, agricultural and food products, minerals, automotive, forest products, fertilizers, and metals and equipment; and coal, coke, and iron ore to electricity-generating power plants, steel manufacturers, and industrial plants, as well as exports coal to deep-water port facilities. In addition, the company provides intermodal services through a network of approximately 30 terminals transporting manufactured consumer goods in containers; and drayage services, including the pickup and delivery of intermodal shipments. It serves the automotive industry with distribution centers and storage locations, as well as connects non-rail served customers through transferring products, such as plastics and ethanol from rail to trucks. The company operates approximately 20,000 route mile rail network, which serves various population centers in 26 states east of the Mississippi River, the District of Columbia, and the Canadian provinces of Ontario and Quebec, as well as owns and leases approximately 3,500 locomotives. It serves production and distribution facilities through track connections. CSX Corporation was incorporated in 1978 and is headquartered in Jacksonville, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Valley National Bancorp","Symbol":"VLY","Current Price":"10.39","Latest MA":"8.83","Price Target":11.5,"Difference from MA":"17.73%","Difference from Open":"1.71%","Change from Yesterday":"2.37%","Change from Last Report":"0.16","Latest Volume":"3,588,938","Market Cap":"5,808,580,608","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":8.988638,"PB Ratio":0.7998615,"ROE":0.049429998,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.086,"Trailing PEG":null,"Trailing PE":15.065218,"Trailing PS":3.6832287,"Quick Ratio":"N\/A","Day High":10.4282,"Day Low":10.215,"VS Average Volume":0.4439826264,"Company Summary":"Valley National Bancorp operates as the holding company for Valley National Bank that provides various commercial, private banking, retail, insurance, and wealth management financial services products. It operates through Consumer Banking, Commercial Banking, and Treasury and Corporate other segments. The company offers non-interest bearing, savings, NOW, money market, and time deposit accounts; commercial and industrial, commercial real estate, residential mortgage, and automobile loans; loans secured by the cash surrender value of life insurance; home equity loans and lines of credit; automobile financing; and secured and unsecured other consumer loans. It also invests in various securities and interest-bearing deposits with other banks; and provides international banking services, such as standby and documentary letters of credit, and related products, as well as foreign exchange transactions, documentary collections, and foreign wire transfers services. In addition, the company offers investment services for individuals and small to medium sized businesses; and trusts investment strategies designed for various investment profiles and objectives. Further, it provides trust services, such as living and testamentary trusts, investment management, custodial and escrow services, and estate administration to individuals; tax credit advisory services; brokerage services; property and casualty, life, health, and title insurance agency services; and health care equipment lending and other commercial equipment leasing services, as well as owns real estate related investments. Additionally, the company offers online, mobile, and telephone banking services; receivable, payment, and security solution, merchant, payroll processing, and liquidity services; credit cards; and drive-in and night deposit, automated teller machine, remote deposit capture, and safe deposit facility services. Valley National Bancorp was founded in 1927 and is headquartered in Morristown, New Jersey.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Procter & Gamble Company (The)","Symbol":"PG","Current Price":"166.47","Latest MA":"167.46","Price Target":178.47,"Difference from MA":"-0.59%","Difference from Open":"-0.60%","Change from Yesterday":"0.14%","Change from Last Report":"0.05","Latest Volume":"1,222,243","Market Cap":"390,347,161,600","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":22.609299,"PB Ratio":7.9286532,"ROE":0.28766,"DTE":69.338,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":0.414,"Trailing PEG":3.5224,"Trailing PE":26.507961,"Trailing PS":4.6522512,"Quick Ratio":0.507,"Day High":167.48,"Day Low":165.93,"VS Average Volume":0.1713839772,"Company Summary":"The Procter & Gamble Company engages in the provision of branded consumer packaged goods worldwide. The company operates through five segments: Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care. The Beauty segment offers conditioners, shampoos, styling aids, and treatments under the Head & Shoulders, Herbal Essences, Pantene, and Rejoice brands; and antiperspirants and deodorants, personal cleansing, and skin care products under the Olay, Old Spice, Safeguard, Secret, SK-II, and Native brands. The Grooming segment provides blades and razors, shave products, appliances, and other grooming products under the Braun, Gillette, and Venus brand names. The Health Care segment offers toothbrushes, toothpastes, and other oral care products under the Crest and Oral-B brand names; and gastrointestinal, pain relief, rapid diagnostics, respiratory, vitamins\/minerals\/supplements, and other personal health care products under Metamucil, Neurobion, Pepto-Bismol, and Vicks brands. The Fabric & Home Care segment provides fabric enhancers, laundry additives, and laundry detergents under the Ariel, Downy, Gain, and Tide brands; and air care, dish care, P&G professional, and surface care products under the Cascade, Dawn, Fairy, Febreze, Mr. Clean, and Swiffer brands. The Baby, Feminine & Family Care segment offers baby wipes, and taped diapers and pants under the Luvs and Pampers brands; adult incontinence and feminine care products under the Always, Always Discreet, and Tampax brands; and paper towels, tissues, and toilet papers under the Bounty, Charmin, and Puffs brands. It sells its products primarily through mass merchandisers, e-commerce, grocery stores, membership club stores, drug stores, department stores, distributors, wholesalers, specialty beauty stores, high-frequency stores, pharmacies, electronics stores, and professional channels, as well as directly to consumers. The company was founded in 1837 and is headquartered in Cincinnati, Ohio.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Abbott Laboratories","Symbol":"ABT","Current Price":"128.09","Latest MA":"112.28","Price Target":133.07957,"Difference from MA":"14.08%","Difference from Open":"0.08%","Change from Yesterday":"0.16%","Change from Last Report":"0.14","Latest Volume":"2,015,146","Market Cap":"222,162,632,704","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":22.58035,"PB Ratio":5.582614,"ROE":0.14840001,"DTE":37.589,"Industry":"Medical Devices","Sector":"Healthcare","Beta":0.722,"Trailing PEG":2.2988,"Trailing PE":16.743464,"Trailing PS":5.390073,"Quick Ratio":0.996,"Day High":128.905,"Day Low":127.195,"VS Average Volume":0.3524729477,"Company Summary":"Abbott Laboratories, together with its subsidiaries, discovers, develops, manufactures, and sells health care products worldwide. It operates in four segments: Established Pharmaceutical Products, Diagnostic Products, Nutritional Products, and Medical Devices. The company provides generic pharmaceuticals for the treatment of pancreatic exocrine insufficiency, irritable bowel syndrome or biliary spasm, intrahepatic cholestasis or depressive symptoms, gynecological disorder, hormone replacement therapy, dyslipidemia, hypertension, hypothyroidism, Ménière's disease and vestibular vertigo, pain, fever, inflammation, and migraine, as well as provides anti-infective clarithromycin, influenza vaccine, and products to regulate physiological rhythm of the colon. It also offers laboratory and transfusion medicine systems in the areas of immunoassay, clinical chemistry, hematology, and transfusion; molecular diagnostics polymerase chain reaction instrument systems that automate the extraction, purification, and preparation of DNA and RNA from patient samples, and detect and measure infectious agents; point of care systems; cartridges for testing blood gas, chemistry, electrolytes, coagulation, and immunoassay; rapid diagnostics lateral flow testing products; molecular point-of-care testing for HIV, SARS-CoV-2, influenza A and B, RSV, and strep A; cardiometabolic test systems; drug and alcohol test, and remote patient monitoring and consumer self-test systems; and informatics and automation solutions for laboratories. In addition, the company provides pediatric and adult nutritional products; rhythm management, electrophysiology, heart failure, vascular, and structural heart devices for the treatment of cardiovascular diseases; diabetes care products, such as glucose and blood glucose monitoring systems; and neuromodulation devices for the management of chronic pain and movement disorders. Abbott Laboratories was founded in 1888 and is based in North Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Alcoa Corporation","Symbol":"AA","Current Price":"35.38","Latest MA":"37.65","Price Target":48.04231,"Difference from MA":"-6.02%","Difference from Open":"-0.42%","Change from Yesterday":"0.63%","Change from Last Report":"0.06","Latest Volume":"1,559,681","Market Cap":"9,140,600,832","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":10.980724,"PB Ratio":1.7410562,"ROE":-0.07142,"DTE":56.095,"Industry":"Aluminum","Sector":"Basic Materials","Beta":2.419,"Trailing PEG":null,"Trailing PE":136.07693,"Trailing PS":0.83066165,"Quick Ratio":0.671,"Day High":35.815,"Day Low":34.97,"VS Average Volume":0.3307732048,"Company Summary":"Alcoa Corporation, together with its subsidiaries, produces and sells bauxite, alumina, and aluminum products in the United States, Spain, Australia, Iceland, Norway, Brazil, Canada, and internationally. The company operates through two segments, Alumina and Aluminum. It engages in bauxite mining operations; and processes bauxite into alumina and sells it to customers who process it into industrial chemical products, as well as aluminum smelting and casting businesses. The company offers primary aluminum in the form of alloy ingot or value-add ingot to customers that produce products for the transportation, building and construction, packaging, wire, and other industrial markets; and flat-rolled aluminum in the form of sheet, which is sold primarily to customers that produce beverage and food cans. In addition, it owns hydro power plants that generates and sells electricity in the wholesale market to traders, large industrial consumers, distribution companies, and other generation companies. The company was formerly known as Alcoa Upstream Corporation and changed its name to Alcoa Corporation in October 2016. The company was founded in 1886 and is headquartered in Pittsburgh, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Lam Research Corporation","Symbol":"LRCX","Current Price":"81.02","Latest MA":"81.09","Price Target":91.08359,"Difference from MA":"-0.08%","Difference from Open":"1.41%","Change from Yesterday":"8.01%","Change from Last Report":"-0.09","Latest Volume":"12,180,723","Market Cap":"104,247,623,680","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.377108,"PB Ratio":12.369465,"ROE":0.49116,"DTE":58.827,"Industry":"Semiconductor Equipment & Materials","Sector":"Technology","Beta":1.486,"Trailing PEG":1.4446,"Trailing PE":24.626139,"Trailing PS":6.686269,"Quick Ratio":1.685,"Day High":81.27,"Day Low":77.6,"VS Average Volume":1.0602826295,"Company Summary":"Lam Research Corporation designs, manufactures, markets, refurbishes, and services semiconductor processing equipment used in the fabrication of integrated circuits. The company offers ALTUS systems to deposit conformal films for tungsten metallization applications; SABRE electrochemical deposition products for copper interconnect transition that offers copper damascene manufacturing; and VECTOR plasma-enhanced CVD products. It also provides SPEED gapfill high-density plasma chemical vapor deposition products; and Striker single-wafer atomic layer deposition products for dielectric film solutions. In addition, the company offers Flex for dielectric etch applications; Vantex, a dielectric etch system that provides RF technology and repeatable wafer-to-wafer performance enabled by Equipment Intelligence solutions; Kiyo for conductor etch applications; Syndion for through-silicon via etch applications; and Versys metal products for metal etch processes. Further, it provides Coronus bevel clean products to enhance die yield; and Da Vinci, DV-Prime, EOS, and SP series products to address various wafer cleaning applications. The company sells its products in the United States, China, Europe, Japan, Korea, Southeast Asia, and Taiwan. Lam Research Corporation was incorporated in 1980 and is headquartered in Fremont, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Johnson & Johnson","Symbol":"JNJ","Current Price":"152.67","Latest MA":"154.36","Price Target":168.44952,"Difference from MA":"-1.09%","Difference from Open":"0.50%","Change from Yesterday":"0.99%","Change from Last Report":"0.11","Latest Volume":"1,634,527","Market Cap":"367,571,369,984","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.739028,"PB Ratio":5.238471,"ROE":0.20889,"DTE":50.958,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.518,"Trailing PEG":0.9597,"Trailing PE":26.367876,"Trailing PS":4.1914268,"Quick Ratio":0.705,"Day High":152.94,"Day Low":151.405,"VS Average Volume":0.1903403712,"Company Summary":"Johnson & Johnson, together with its subsidiaries, researches, develops, manufactures, and sells various products in the healthcare field worldwide. The company's Innovative Medicine segment offers products for various therapeutic areas, such as immunology, including rheumatoid arthritis, psoriatic arthritis, inflammatory bowel disease, and psoriasis; infectious diseases comprising HIV\/AIDS; neuroscience, consisting of mood disorders, neurodegenerative disorders, and schizophrenia; oncology, such as prostate cancer, hematologic malignancies, lung cancer, and bladder cancer; cardiovascular and metabolism, including thrombosis, diabetes, and macular degeneration; and pulmonary hypertension comprising pulmonary arterial hypertension through retailers, wholesalers, distributors, hospitals, and healthcare professionals for prescription use. Its MedTech segment provides Interventional Solutions, including electrophysiology products to treat heart rhythm disorders; the heart recovery portfolio, which includes technologies to treat severe coronary artery disease requiring high-risk PCI or AMI cardiogenic shock; and neurovascular care that treats hemorrhagic and ischemic stroke. this segment also offers an orthopaedics portfolio that includes products and enabling technologies that support hips, knees, trauma, spine, sports, and other; surgery portfolios comprising advanced and general surgery technologies, as well as solutions for breast aesthetics, ear, nose, and throat procedures; contact lenses under the ACUVUE Brand; and TECNIS intraocular lenses for cataract surgery. It distributes its products to wholesalers, hospitals, and retailers, as well as physicians, nurses, hospitals, eye care professionals, and clinics. The company has a collaboration agreement with Stand Up To Cancer for research testing a combination of teclistamab and daratumumab to treat a rare disease AL amyloidosis. Johnson & Johnson was founded in 1886 and is based in New Brunswick, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Halliburton Company","Symbol":"HAL","Current Price":"26.39","Latest MA":"29.95","Price Target":34.41481,"Difference from MA":"-11.87%","Difference from Open":"-0.58%","Change from Yesterday":"0.06%","Change from Last Report":"0.06","Latest Volume":"3,016,765","Market Cap":"23,188,060,160","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.564661,"PB Ratio":2.2507887,"ROE":0.26293,"DTE":83.993,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.905,"Trailing PEG":1.7644,"Trailing PE":9.326856,"Trailing PS":1.0049868,"Quick Ratio":1.377,"Day High":26.6227,"Day Low":26.28,"VS Average Volume":0.2947074066,"Company Summary":"Halliburton Company provides products and services to the energy industry worldwide. It operates through two segments, Completion and Production, and Drilling and Evaluation. The Completion and Production segment offers production enhancement services that include stimulation and sand control services; cementing services, such as well bonding and casing, and casing equipment; and completion tools that offer downhole solutions and services, including well completion products and services, intelligent well completions, and service tools, as well as liner hanger, sand control, and multilateral systems. This segment also provides electrical submersible pumps, as well as artificial lift services; production solutions comprising coiled tubing, hydraulic workover units, downhole tools, and pumping and nitrogen services; pipeline and process services, such as pre-commissioning, commissioning, maintenance, and decommissioning; and specialty chemicals and services. The Drilling and Evaluation segment offers drilling fluid systems, performance additives, completion fluids, solids control, specialized testing equipment, and waste management services; drilling systems and services; wireline and perforating services consists of open-hole logging, and cased-hole and slickline; and drill bits and services comprising roller cone rock bits, fixed cutter bits, hole enlargement, and related downhole tools and services, as well as coring equipment and services. This segment also provides cloud based digital services and artificial intelligence solutions on an open architecture for subsurface insights, integrated well construction, and reservoir and production management; testing and subsea services, such as acquisition and analysis of reservoir information and optimization solutions; and project management and integrated asset management services. Halliburton Company was founded in 1919 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Kinder Morgan, Inc.","Symbol":"KMI","Current Price":"28.10","Latest MA":"23.97","Price Target":29.585,"Difference from MA":"17.21%","Difference from Open":"1.92%","Change from Yesterday":"2.86%","Change from Last Report":"0.11","Latest Volume":"5,860,615","Market Cap":"62,428,082,176","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.84848,"PB Ratio":2.053193,"ROE":0.083500005,"DTE":101.433,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.907,"Trailing PEG":1.999,"Trailing PE":24.017096,"Trailing PS":4.1203938,"Quick Ratio":0.291,"Day High":28.209,"Day Low":27.5,"VS Average Volume":0.4100672706,"Company Summary":"Kinder Morgan, Inc. operates as an energy infrastructure company primarily in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas gasification, liquefaction, and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and\/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, renewable fuel and feedstocks, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; owns interests in\/or operates oil fields and gasoline processing plants; and operates a crude oil pipeline system in West Texas, as well as owns and operates RNG and LNG facilities. It owns and operates approximately 82,000 miles of pipelines and 139 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1997 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Amphenol Corporation","Symbol":"APH","Current Price":"71.38","Latest MA":"67.73","Price Target":83.37647,"Difference from MA":"5.39%","Difference from Open":"-0.38%","Change from Yesterday":"2.95%","Change from Last Report":"0.08","Latest Volume":"2,100,950","Market Cap":"86,056,435,712","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":28.366482,"PB Ratio":9.102269,"ROE":0.25293,"DTE":57.565,"Industry":"Electronic Components","Sector":"Technology","Beta":1.238,"Trailing PEG":2.4645,"Trailing PE":37.177082,"Trailing PS":6.046516,"Quick Ratio":1.208,"Day High":71.6,"Day Low":70.31,"VS Average Volume":0.3092104673,"Company Summary":"Amphenol Corporation, together with its subsidiaries, primarily designs, manufactures, and markets electrical, electronic, and fiber optic connectors in the United States, China, and internationally. It operates through three segments: Harsh Environment Solutions, Communications Solutions, and Interconnect and Sensor Systems. The company offers connectors and connector systems, including harsh environment data, power, high-speed, fiber optic, and radio frequency interconnect products; busbars and power distribution systems; and other connectors. It also provides value-add products, such as backplane interconnect systems, cable assemblies and harnesses, and cable management products; other products comprising flexible and rigid printed circuit boards, hinges, other mechanical, and production related products. In addition, the company offers consumer device, network infrastructure, and other antennas; coaxial, power, and specialty cables; and sensors and sensor-based products. It sells its products through its sales force, independent representatives, and a network of electronics distributors to original equipment manufacturers, electronic manufacturing services companies, original design manufacturers, and service providers in the automotive, broadband communication, commercial aerospace, industrial, information technology and data communication, military, mobile device, and mobile network markets. Amphenol Corporation was founded in 1932 and is headquartered in Wallingford, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"GE Vernova Inc.","Symbol":"GEV","Current Price":"380.33","Latest MA":"266.77","Price Target":413.59042,"Difference from MA":"42.57%","Difference from Open":"4.20%","Change from Yesterday":"7.48%","Change from Last Report":"0.20","Latest Volume":"2,463,312","Market Cap":"104,838,307,840","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":36.739243,"PB Ratio":11.021059,"ROE":"N\/A","DTE":9.346,"Industry":"Utilities - Renewable","Sector":"Utilities","Beta":"N\/A","Trailing PEG":3.0616,"Trailing PE":68.15873,"Trailing PS":3.0456772,"Quick Ratio":0.717,"Day High":383.83,"Day Low":364.93,"VS Average Volume":0.7454155036,"Company Summary":"GE Vernova Inc., an energy company, engages in the provision of various products and services that generate, transfer, orchestrate, convert, and store electricity in the United States, Europe, Asia, the Americas, the Middle East, and Africa. The company operates through three segments: Power, Wind, and Electrification. The Power segment designs, manufactures, and services gas, nuclear, hydro, and steam technologies. The Wind segment offers wind generation technologies, including onshore and offshore wind turbines and blades. The Electrification segment provides grid solutions, power conversion, solar, and storage solutions; and electrification software for the transmission, distribution, conversion, storage, and orchestration of electricity from point of generation to point of consumption. The company was incorporated in 2023 and is headquartered in Cambridge, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"United Airlines Holdings, Inc.","Symbol":"UAL","Current Price":"108.23","Latest MA":"70.05","Price Target":129.49522,"Difference from MA":"54.51%","Difference from Open":"1.12%","Change from Yesterday":"-0.06%","Change from Last Report":"0.14","Latest Volume":"1,385,221","Market Cap":"35,594,252,288","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.300639,"PB Ratio":3.1119356,"ROE":0.27245,"DTE":291.676,"Industry":"Airlines","Sector":"Industrials","Beta":1.393,"Trailing PEG":1.0167,"Trailing PE":11.45291,"Trailing PS":0.6356798,"Quick Ratio":0.694,"Day High":108.4999,"Day Low":106.53,"VS Average Volume":0.2389428097,"Company Summary":"United Airlines Holdings, Inc., through its subsidiaries, provides air transportation services in North America, Asia, Europe, Africa, the Pacific, the Middle East, and Latin America. The company transports people and cargo through its mainline and regional fleets. It also offers catering, ground handling, flight academy, and maintenance services for third parties. The company was formerly known as United Continental Holdings, Inc. and changed its name to United Airlines Holdings, Inc. in June 2019. United Airlines Holdings, Inc. was incorporated in 1968 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Netflix, Inc.","Symbol":"NFLX","Current Price":"979.75","Latest MA":"764.41","Price Target":1063.7195,"Difference from MA":"28.17%","Difference from Open":"-0.69%","Change from Yesterday":"0.17%","Change from Last Report":"-0.03","Latest Volume":"2,012,634","Market Cap":"419,097,051,136","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":32.306488,"PB Ratio":18.432732,"ROE":0.34714,"DTE":81.461,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.25,"Trailing PEG":2.8552,"Trailing PE":49.33308,"Trailing PS":11.14997,"Quick Ratio":0.975,"Day High":994.57,"Day Low":971.2,"VS Average Volume":0.5826049929,"Company Summary":"Netflix, Inc. provides entertainment services. It offers TV series, documentaries, feature films, and games across various genres and languages. The company also provides members the ability to receive streaming content through a host of internet-connected devices, including TVs, digital video players, TV set-top boxes, and mobile devices. It has operations in approximately 190 countries. The company was incorporated in 1997 and is headquartered in Los Gatos, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"3M Company","Symbol":"MMM","Current Price":"153.62","Latest MA":"127.50","Price Target":154.29611,"Difference from MA":"20.48%","Difference from Open":"1.06%","Change from Yesterday":"1.36%","Change from Last Report":"0.17","Latest Volume":"1,221,879","Market Cap":"82,870,689,792","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":18.162268,"PB Ratio":18.02147,"ROE":1.1329399,"DTE":295.441,"Industry":"Conglomerates","Sector":"Industrials","Beta":1.001,"Trailing PEG":2.7455,"Trailing PE":21.159092,"Trailing PS":2.539086,"Quick Ratio":0.95,"Day High":153.9,"Day Low":151.83,"VS Average Volume":0.346849798,"Company Summary":"3M Company provides diversified technology services in the United States and internationally. The company's Safety and Industrial segment offers industrial abrasives and finishing for metalworking applications; autobody repair solutions; closure systems for personal hygiene products, masking, and packaging materials; electrical products and materials for construction and maintenance, power distribution, and electrical original equipment manufacturers; structural adhesives and tapes; respiratory, hearing, eye, and fall protection solutions; and natural and color-coated mineral granules for shingles. Its Transportation and Electronics segment provides ceramic solutions; attachment\/bonding products, films, sound, and temperature management for transportation vehicles; premium large format graphic films for advertising and fleet signage; light management films and electronics assembly solutions; packaging and interconnection solutions; semiconductor production materials; data centers solutions; and reflective signage for highway, and vehicle safety. The company's Consumer segment provides consumer bandages, braces, supports, and consumer respirators; home cleaning products; retail abrasives, paint accessories, car care DIY products, picture hanging, and consumer air quality solutions; and stationery products. It offers its products through e-commerce and traditional wholesalers, retailers, jobbers, distributors, and dealers. 3M Company was founded in 1902 and is headquartered in Saint Paul, Minnesota.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"KeyCorp","Symbol":"KEY","Current Price":"17.98","Latest MA":"16.73","Price Target":21.04,"Difference from MA":"7.45%","Difference from Open":"0.84%","Change from Yesterday":"1.78%","Change from Last Report":"0.08","Latest Volume":"3,211,758","Market Cap":"19,900,196,864","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":10.307032,"PB Ratio":1.2418054,"ROE":0.0096700005,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.231,"Trailing PEG":0.7599,"Trailing PE":"N\/A","Trailing PS":4.1014423,"Quick Ratio":"N\/A","Day High":18.0053,"Day Low":17.77,"VS Average Volume":0.3025608639,"Company Summary":"KeyCorp operates as the holding company for KeyBank National Association that provides various retail and commercial banking products and services in the United States. It operates in two segments, Consumer Bank and Commercial Bank. The company offers various deposits, investment products and services; commercial leasing, investment management, consumer finance; and personal finance and financial wellness, student loan refinancing, mortgage and home equity, lending, credit card, treasury, business advisory, wealth management, asset management, cash management, portfolio management, and trust and related services to individuals and small and medium-sized businesses. It also provides a suite of banking and capital market products, such as syndicated finance, debt and equity capital market products, commercial payments, equipment finance, commercial mortgage banking, derivatives, foreign exchange, financial advisory, and public finance, as well as commercial mortgage loans to consumer, energy, healthcare, industrial, public sector, real estate, and technology sectors for middle market clients. In addition, the company offers community development financing, securities underwriting, brokerage, and investment banking services. The company was founded in 1849 and is headquartered in Cleveland, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"D.R. Horton, Inc.","Symbol":"DHI","Current Price":"145.86","Latest MA":"166.85","Price Target":167.265,"Difference from MA":"-12.58%","Difference from Open":"1.93%","Change from Yesterday":"2.76%","Change from Last Report":"0.08","Latest Volume":"1,410,288","Market Cap":"46,796,115,968","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":9.920107,"PB Ratio":1.8671514,"ROE":0.19631,"DTE":22.915,"Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":1.744,"Trailing PEG":0.5414,"Trailing PE":10.315417,"Trailing PS":1.2715852,"Quick Ratio":0.766,"Day High":145.86,"Day Low":142.1,"VS Average Volume":0.4598160459,"Company Summary":"D.R. Horton, Inc. operates as a homebuilding company in East, North, Southeast, South Central, Southwest, and Northwest regions in the United States. It engages in the acquisition and development of land; and construction and sale of residential homes in 125 markets across 36 states under the names of D.R. Horton. The company constructs and sells single-family detached homes; and attached homes, such as townhomes, duplexes, and triplexes. It provides mortgage financing services; and title insurance policies, and examination and closing services, as well as engages in the residential lot development business. In addition, the company develops, constructs, owns, leases, and sells multi-family and single-family rental properties; and owns non-residential real estate, including ranch land and improvements. It primarily serves homebuyers. D.R. Horton, Inc. was founded in 1978 and is headquartered in Arlington, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Charles Schwab Corporation (The","Symbol":"SCHW","Current Price":"82.49","Latest MA":"70.99","Price Target":89.5,"Difference from MA":"16.19%","Difference from Open":"-0.01%","Change from Yesterday":"0.54%","Change from Last Report":"0.07","Latest Volume":"1,282,349","Market Cap":"151,002,890,240","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":15.904507,"PB Ratio":3.969109,"ROE":0.12111,"DTE":144.242,"Industry":"Capital Markets","Sector":"Financial Services","Beta":0.952,"Trailing PEG":0.9731,"Trailing PE":27.588629,"Trailing PS":8.0595045,"Quick Ratio":0.481,"Day High":82.53,"Day Low":82.07,"VS Average Volume":0.1559211477,"Company Summary":"The Charles Schwab Corporation, together with its subsidiaries, operates as a savings and loan holding company that provides wealth management, securities brokerage, banking, asset management, custody, and financial advisory services in the United States and internationally. The company operates in two segments, Investor Services and Advisor Services. It offers brokerage accounts with equity and fixed income trading, margin lending, options trading, futures and forex trading, and cash management capabilities, including certificates of deposit; third-party mutual funds through the Mutual Fund Marketplace and Mutual Fund OneSource service, as well as mutual fund trading and clearing services to broker-dealers; exchange-traded funds; advisory solutions for managed portfolios, separately managed accounts, customized personal advice for tailored portfolios, specialized planning, and full-time portfolio management; banking products comprising checking and savings accounts, first lien residential real estate mortgage loans, home equity lines of credit, and pledged asset lines; and trust custody services, personal trust reporting services, and administrative trustee services. It also provides digital retirement calculators; integrated web-, mobile-, and software-based trading platforms, real-time market data, options trading, premium research, and multi-channel access; self-service education and support tools; online research and analysis tools; equity compensation plan sponsors full-service recordkeeping for stock plans, stock options, restricted stock, performance shares, and stock appreciation rights; retirement plan services; mutual fund clearing services; and advisor services, including interactive tools and educational content. The Company operates through branch offices. The Charles Schwab Corporation was founded in 1971 and is headquartered in Westlake, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Citizens Financial Group, Inc.","Symbol":"CFG","Current Price":"48.58","Latest MA":"42.37","Price Target":53.13889,"Difference from MA":"14.66%","Difference from Open":"0.98%","Change from Yesterday":"1.99%","Change from Last Report":"0.16","Latest Volume":"1,063,133","Market Cap":"21,401,579,520","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":9.799591,"PB Ratio":0.9477915,"ROE":0.05426,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.32,"Trailing PEG":null,"Trailing PE":16.033005,"Trailing PS":3.0079522,"Quick Ratio":"N\/A","Day High":48.63,"Day Low":48.05,"VS Average Volume":0.2684653531,"Company Summary":"Citizens Financial Group, Inc. operates as the bank holding company that provides retail and commercial banking products and services to individuals, small businesses, middle-market companies, corporations, and institutions in the United States. The company operates in two segments, Consumer Banking and Commercial Banking. The Consumer Banking segment offers deposit products, mortgage and home equity lending products, credit cards, business loans, wealth management, and investment services; and auto, education, and point-of-sale finance loans, as well as digital deposit products. This segment serves its customers through telephone service centers, as well as through its online and mobile platforms. The Commercial Banking segment provides various financial products and solutions, including lending and leasing, deposit and treasury management services, foreign exchange, and interest rate and commodity risk management solutions, as well as syndicated loans, corporate finance, mergers and acquisitions, and debt and equity capital markets services. This segment serves corporate banking, healthcare, technology, asset finance, franchise finance, leasing, asset-based lending, commercial real estate, mid-corporate, and private equity sponsor industries. The company was formerly known as RBS Citizens Financial Group, Inc. and changed its name to Citizens Financial Group, Inc. in April 2014. Citizens Financial Group, Inc. was founded in 1828 and is headquartered in Providence, Rhode Island.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Truist Financial Corporation","Symbol":"TFC","Current Price":"48.25","Latest MA":"43.19","Price Target":51.28947,"Difference from MA":"11.72%","Difference from Open":"0.52%","Change from Yesterday":"1.62%","Change from Last Report":"0.28","Latest Volume":"1,976,486","Market Cap":"63,494,103,040","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":10.454993,"PB Ratio":1.0852208,"ROE":-0.09505,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.035,"Trailing PEG":1.9441,"Trailing PE":"N\/A","Trailing PS":4.37981,"Quick Ratio":"N\/A","Day High":48.315,"Day Low":47.75,"VS Average Volume":0.2518526239,"Company Summary":"Truist Financial Corporation, a financial services company, provides banking and trust services in the Southeastern and Mid-Atlantic United States. The company operates through three segments: Consumer Banking and Wealth, Corporate and Commercial Banking, and Insurance Holdings.Its deposit products include noninterest-bearing checking, interest-bearing checking, savings, and money market deposit accounts, as well as certificates of deposit and individual retirement accounts. The company also provides funding; asset management; automobile lending; credit card lending; consumer finance; home equity and mortgage lending; other direct retail lending; insurance; investment brokerage; mobile\/online banking; payment solutions; point-of-sale lending; retail and small business deposit products; small business lending; and wealth management\/private banking services. In addition, it offers asset based lending, investment banking and capital market, institutional trust, insurance premium finance, derivatives, commercial lending, international banking, leasing, merchant, commercial deposit and treasury, floor plan, mortgage warehouse lending, real estate lending, and supply chain financing services. Further, the company provides insurance brokerage, retail and wholesale brokerage, securities underwriting and market making, loan syndication, and investment management and advisory services. The company was formerly known as BB&T Corporation and changed its name to Truist Financial Corporation in December 2019. Truist Financial Corporation was founded in 1872 and is headquartered in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Schlumberger N.V.","Symbol":"SLB","Current Price":"41.16","Latest MA":"42.70","Price Target":53.26903,"Difference from MA":"-3.60%","Difference from Open":"0.34%","Change from Yesterday":"0.51%","Change from Last Report":"0.07","Latest Volume":"3,511,415","Market Cap":"57,658,986,496","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":10.943636,"PB Ratio":2.7020285,"ROE":0.21722999,"DTE":57.141,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.532,"Trailing PEG":1.9154,"Trailing PE":13.234727,"Trailing PS":1.601861,"Quick Ratio":1.003,"Day High":41.38,"Day Low":40.685,"VS Average Volume":0.2715972408,"Company Summary":"Schlumberger Limited engages in the provision of technology for the energy industry worldwide. The company operates through four divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. The company provides field development and hydrocarbon production, carbon management, and integration of adjacent energy systems; reservoir interpretation and data processing services for exploration data; and well construction and production improvement services and products. It also offers subsurface geology and fluids evaluation information; open and cased hole services; exploration and production pressure, and flow-rate measurement services; and pressure pumping, well stimulation, and coiled tubing equipment solutions. In addition, the company offers mud logging, directional drilling, measurement-while-drilling, and logging-while-drilling services, as well as engineering support services; supplies drilling fluid systems; designs, manufactures, and markets roller cone and fixed cutter drill bits; bottom-hole-assembly and borehole enlargement technologies; well cementing products and services; well planning, well drilling, engineering, supervision, logistics, procurement, and contracting of third parties, as well as drilling rig management solutions; and drilling equipment and services, as well as land drilling rigs and related services. Further, it provides artificial lift production equipment and optimization services; supplies packers, safety valves, sand control technology, and various intelligent well completions technology and equipment; designs and manufactures valves, chokes, actuators, and surface trees; and OneSubsea, an integrated solutions, products, systems, and services, including wellheads, subsea trees, manifolds and flowline connectors, control systems, connectors, and services. The company was formerly known as Socie´te´ de Prospection E´lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Huntington Bancshares Incorpora","Symbol":"HBAN","Current Price":"17.46","Latest MA":"15.29","Price Target":18.88889,"Difference from MA":"14.19%","Difference from Open":"0.69%","Change from Yesterday":"1.69%","Change from Last Report":"0.20","Latest Volume":"7,828,442","Market Cap":"25,380,552,704","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":11.243552,"PB Ratio":1.3927886,"ROE":0.08545,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.057,"Trailing PEG":2.903,"Trailing PE":14.311475,"Trailing PS":3.7938046,"Quick Ratio":"N\/A","Day High":17.46,"Day Low":17.24,"VS Average Volume":0.4882094228,"Company Summary":"Huntington Bancshares Incorporated operates as the bank holding company for The Huntington National Bank that provides commercial, consumer, and mortgage banking services in the United States. The company offers financial products and services to consumer and business customers, including deposits, lending, payments, mortgage banking, dealer financing, investment management, trust, brokerage, insurance, and other financial products and services. It also provides 24-hour grace, asterisk-free checking, money scout, $50 safety zone, standby cash, early pay, instant access, savings goal getter, and Huntington heads up; digitally powered consumer and business financial solutions to consumer lending, regional banking, branch banking, and wealth management customers; direct and indirect consumer loans, as well as dealer finance loans and deposits; and private banking, wealth management and legacy planning through investment and portfolio management, fiduciary administration and trust, institutional custody, and full-service retail brokerage investment services. The company offers equipment financing, asset-based lending, distribution finance, structured lending, and municipal financing solutions, as well as Huntington ChoicePay. In addition, it offers lending, liquidity, treasury management and other payment services, and capital markets; government and non-profits, healthcare, technology and telecommunications, franchises, financial sponsors, and global services; and corporate risk management, institutional sales and trading, debt and equity issuance, and additional advisory services. The company offers its products through a network of channels, including branches and ATMs, online and mobile banking, and through customer call centers to customers in middle market banking, corporate, specialty, and government banking, asset finance, commercial real estate banking, and capital markets. The company was founded in 1866 and is headquartered in Columbus, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"U.S. Bancorp","Symbol":"USB","Current Price":"48.26","Latest MA":"46.03","Price Target":57.14286,"Difference from MA":"4.85%","Difference from Open":"0.12%","Change from Yesterday":"1.26%","Change from Last Report":"0.22","Latest Volume":"1,867,054","Market Cap":"75,285,594,112","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":9.977176,"PB Ratio":1.4470329,"ROE":0.09779,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.04,"Trailing PEG":1.1493,"Trailing PE":12.733509,"Trailing PS":3.0238822,"Quick Ratio":"N\/A","Day High":48.37,"Day Low":47.895,"VS Average Volume":0.2305154062,"Company Summary":"U.S. Bancorp, a financial services holding company, provides various financial services to individuals, businesses, institutional organizations, governmental entities, and other financial institutions in the United States. It operates through Wealth, Corporate, Commercial and Institutional Banking; Consumer and Business Banking; Payment Services; and Treasury and Corporate Support segments. The company offers depository services, including checking accounts, savings accounts, and time certificate contracts; and lending services, such as traditional credit products and credit card services, lease financing and import\/export trade, asset-backed lending, agricultural finance, and other products. It also provides ancillary services comprising capital markets, treasury management, and receivable lock-box collection services to corporate and governmental entity customers. In addition, the company offers asset management and fiduciary services for individuals, estates, foundations, business corporations, and charitable organizations. Further, it provides investment and insurance products to its customers principally within its domestic markets, as well as fund administration services to mutual and other funds. Additionally, the company provides corporate and purchasing card, and corporate trust services. Furthermore, it offers trust and investment management, merchant and ATM processing, mortgage banking, insurance, and brokerage and leasing services. U.S. Bancorp was founded in 1863 and is headquartered in Minneapolis, Minnesota.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Bank of America Corporation","Symbol":"BAC","Current Price":"46.72","Latest MA":"42.24","Price Target":52.16667,"Difference from MA":"10.63%","Difference from Open":"-0.82%","Change from Yesterday":"-0.05%","Change from Last Report":"0.07","Latest Volume":"8,362,917","Market Cap":"355,612,852,224","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.791477,"PB Ratio":1.3209805,"ROE":0.08092,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.325,"Trailing PEG":2.0713,"Trailing PE":14.555887,"Trailing PS":3.7580884,"Quick Ratio":"N\/A","Day High":47.16,"Day Low":46.57,"VS Average Volume":0.2350802266,"Company Summary":"Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. It operates in four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, non-interest and interest-bearing checking accounts, and investment accounts and products; credit and debit cards; residential mortgages, and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research, and certain market-based services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"First Horizon Corporation","Symbol":"FHN","Current Price":"21.83","Latest MA":"17.60","Price Target":23.2,"Difference from MA":"24.06%","Difference from Open":"0.37%","Change from Yesterday":"1.51%","Change from Last Report":"0.05","Latest Volume":"1,477,141","Market Cap":"11,438,919,680","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":11.585265,"PB Ratio":1.3516191,"ROE":0.08979,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":0.882,"Trailing PEG":null,"Trailing PE":16.05147,"Trailing PS":3.7248192,"Quick Ratio":"N\/A","Day High":21.88,"Day Low":21.67,"VS Average Volume":0.2354421914,"Company Summary":"First Horizon Corporation operates as the bank holding company for First Horizon Bank that provides various financial services. The company operates through Regional Banking and Specialty Banking segments. It offers general banking services for consumers, businesses, financial institutions, and governments. The company also accepts deposits; provides underwriting services for bank-eligible securities and other fixed-income securities by financial subsidiaries; sells loans and derivatives; financial planning; and offers investment and financial advisory services. In addition, it offers mortgage banking; loan syndications; brokerage services; commercial and business banking for business enterprises, consumer banking, and private client and wealth management services; capital markets, professional commercial real estate, mortgage warehouse and asset-based lending, franchise and equipment finance, tax credit finance, energy and healthcare finance, asset management, and corporate and correspondent banking services. Further, the company provides transaction processing services including check clearing services and remittance processing, credit cards, investment, and sale of mutual fund and retail insurances, as well as trust, fiduciary, and agency services. First Horizon Corporation was founded in 1864 and is headquartered in Memphis, Tennessee.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Citigroup, Inc.","Symbol":"C","Current Price":"81.81","Latest MA":"65.71","Price Target":91.47222,"Difference from MA":"24.50%","Difference from Open":"0.64%","Change from Yesterday":"1.47%","Change from Last Report":"0.11","Latest Volume":"2,897,622","Market Cap":"153,565,544,448","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.845836,"PB Ratio":0.80279076,"ROE":0.03874,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.426,"Trailing PEG":0.874,"Trailing PE":13.749579,"Trailing PS":2.2156973,"Quick Ratio":"N\/A","Day High":81.81,"Day Low":80.99,"VS Average Volume":0.1961441611,"Company Summary":"Citigroup Inc., a diversified financial service holding company, provides various financial product and services to consumers, corporations, governments, and institutions worldwide. It operates through five segments: Services, Markets, Banking, U.S. Personal Banking, and Wealth. The Services segment includes Treasury and Trade Solutions, which provides cash management, trade, and working capital solutions to multinational corporations, financial institutions, and public sector organizations; and Securities Services, such as cross-border support for clients, local market expertise, post-trade technologies, data solutions, and various securities services solutions. The Markets segment offers sales and trading services for equities, foreign exchange, rates, spread products, and commodities to corporate, institutional, and public sector clients; and market-making services, including asset classes, risk management solutions, financing, prime brokerage, research, securities clearing, and settlement. The banking segment includes investment banking; advisory services related to mergers and acquisitions, divestitures, restructurings, and corporate defense activities; and corporate lending, which includes corporate and commercial banking. The U.S. Personal Banking segment provides co-branded cards and retail banking services. The Wealth segment provides financial services to high-net-worth clients through banking, lending, mortgages, investment, custody, and trust product offerings; and to professional industries, including law firms, consulting groups, accounting, and asset management. The company was founded in 1812 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Morgan Stanley","Symbol":"MS","Current Price":"140.10","Latest MA":"113.58","Price Target":135.5,"Difference from MA":"23.35%","Difference from Open":"0.21%","Change from Yesterday":"0.98%","Change from Last Report":"0.17","Latest Volume":"1,561,000","Market Cap":"225,137,016,832","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":14.90176,"PB Ratio":2.405276,"ROE":0.11079001,"DTE":405.772,"Industry":"Capital Markets","Sector":"Financial Services","Beta":1.336,"Trailing PEG":3.7088,"Trailing PE":17.622353,"Trailing PS":3.862891,"Quick Ratio":1.83,"Day High":140.27,"Day Low":139.33,"VS Average Volume":0.228449834,"Company Summary":"Morgan Stanley, a financial holding company, provides various financial products and services to corporations, governments, financial institutions, and individuals in the Americas, Europe, the Middle East, Africa, and Asia. It operates through Institutional Securities, Wealth Management, and Investment Management segments. The Institutional Securities segment offers capital raising and financial advisory services, including services related to the underwriting of debt, equity, and other securities, as well as advice on mergers and acquisitions, restructurings, real estate, and project finance. This segment also provides equity and fixed income products comprising sales, financing, prime brokerage, and market-making services; foreign exchange and commodities; corporate and commercial real estate loans, commercial mortgage and secured lending facilities, and financing for sales and trading customers, and asset-backed and mortgage lending; and wealth management services, investment, and research services. The Wealth Management segment offers financial advisor-led brokerage, custody, administrative, and investment advisory services; self-directed brokerage services; financial and wealth planning services; workplace services, including stock plan administration; annuity and insurance products; securities-based lending, residential real estate loans, and other lending products; banking; and retirement plan services to individual investors and small to medium-sized businesses and institutions. The Investment Management segment provides equity, fixed income, alternatives and solutions, and liquidity and overlay services to benefit\/defined contribution plans, foundations, endowments, government entities, sovereign wealth funds, insurance companies, third-party fund sponsors, corporations, and individuals through institutional and intermediary channels. The company was founded in 1924 and is headquartered in New York, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Wells Fargo & Company","Symbol":"WFC","Current Price":"78.77","Latest MA":"63.59","Price Target":83.28571,"Difference from MA":"23.88%","Difference from Open":"-0.47%","Change from Yesterday":"0.47%","Change from Last Report":"0.15","Latest Volume":"2,553,687","Market Cap":"259,069,788,160","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":11.515997,"PB Ratio":1.6004307,"ROE":0.099139996,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.136,"Trailing PEG":3.4646,"Trailing PE":14.668529,"Trailing PS":3.3267386,"Quick Ratio":"N\/A","Day High":79.23,"Day Low":78.525,"VS Average Volume":0.1542477573,"Company Summary":"Wells Fargo & Company, a financial services company, provides diversified banking, investment, mortgage, and consumer and commercial finance products and services in the United States and internationally. The company operates through four segments: Consumer Banking and Lending; Commercial Banking; Corporate and Investment Banking; and Wealth and Investment Management. The Consumer Banking and Lending segment offers diversified financial products and services for consumers and small businesses. Its financial products and services include checking and savings accounts, and credit and debit cards, as well as home, auto, personal, and small business lending services. The Commercial Banking segment provides financial solutions to private, family owned, and certain public companies. Its products and services include banking and credit products across various industry sectors and municipalities, secured lending and lease products, and treasury management services. The Corporate and Investment Banking segment offers a suite of capital markets, banking, and financial products and services, such as corporate banking, investment banking, treasury management, commercial real estate lending and servicing, equity, and fixed income solutions, as well as sales, trading, and research capabilities services to corporate, commercial real estate, government, and institutional clients. The Wealth and Investment Management segment provides personalized wealth management, brokerage, financial planning, lending, private banking, and trust and fiduciary products and services to affluent, high-net worth, and ultra-high-net worth clients. It also operates through financial advisors in brokerage and wealth offices, consumer bank branches, independent offices, and digitally through WellsTrade and Intuitive Investor. The company was founded in 1852 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"JP Morgan Chase & Co.","Symbol":"JPM","Current Price":"268.44","Latest MA":"223.81","Price Target":265.5481,"Difference from MA":"19.94%","Difference from Open":"-0.07%","Change from Yesterday":"0.69%","Change from Last Report":"0.18","Latest Volume":"2,017,375","Market Cap":"750,987,771,904","Earning Date":"2025-01-15","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":13.685724,"PB Ratio":2.3312201,"ROE":0.16216,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.091,"Trailing PEG":7.244,"Trailing PE":13.591899,"Trailing PS":4.6314955,"Quick Ratio":"N\/A","Day High":268.98,"Day Low":266.6201,"VS Average Volume":0.2116768944,"Company Summary":"JPMorgan Chase & Co. operates as a financial services company worldwide. It operates through three segments: Consumer & Community Banking, Commercial & Investment Bank, and Asset & Wealth Management. It offers deposit, investment and lending products, cash management, and payments and services; mortgage origination and servicing activities; residential mortgages and home equity loans; and credit cards, auto loans, leases, and travel services to consumers and small businesses through bank branches, ATMs, and digital and telephone banking. The company also provides investment banking products and services, including corporate strategy and structure advisory, and equity and debt market capital-raising services, as well as loan origination and syndication; payments; and cash and derivative instruments, risk management solutions, prime brokerage, and research, as well as offers securities services, including custody, fund accounting and administration, and securities lending products for asset managers, insurance companies, and public and private investment funds. In addition, it provides financial solutions, including lending, payments, investment banking, and asset management to small and midsized companies, local governments, nonprofit clients, and large corporations, as well as investors, developers, and owners of multifamily, office, retail, industrial, and affordable housing properties. Further, the company offers multi-asset investment management solutions in equities, fixed income, alternatives, and money market funds to institutional clients and retail investors; and retirement products and services, brokerage, custody, estate planning, lending, deposits, and investment management products to high net worth clients. JPMorgan Chase & Co. was founded in 1799 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Delta Air Lines, Inc.","Symbol":"DAL","Current Price":"68.78","Latest MA":"52.92","Price Target":79.92864,"Difference from MA":"29.96%","Difference from Open":"1.15%","Change from Yesterday":"0.36%","Change from Last Report":"0.15","Latest Volume":"1,532,905","Market Cap":"44,382,429,184","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.147744,"PB Ratio":3.2313836,"ROE":0.4067,"DTE":186.78,"Industry":"Airlines","Sector":"Industrials","Beta":1.341,"Trailing PEG":null,"Trailing PE":12.904315,"Trailing PS":0.7359416,"Quick Ratio":0.268,"Day High":68.9,"Day Low":67.8,"VS Average Volume":0.1941161066,"Company Summary":"Delta Air Lines, Inc. provides scheduled air transportation for passengers and cargo in the United States and internationally. The company operates through two segments, Airline and Refinery. Its domestic network centered on core hubs in Atlanta, Minneapolis-St. Paul, Detroit, and Salt Lake City, as well as coastal hub positions in Boston, Los Angeles, New York-LaGuardia, New York-JFK, and Seattle; and international network centered on hubs and market presence in Amsterdam, Bogota, Lima, Mexico City, London-Heathrow, Paris-Charles de Gaulle, Sao Paulo, Seoul-Incheon, and Tokyo. The company sells its tickets through various distribution channels, including delta.com and the Fly Delta app; acts as a reservations specialists; and operates online travel and traditional brick and mortar agencies. It also provides aircraft maintenance and engineering support, repair, and overhaul services; and vacation packages to third-party consumers. The company operates through a fleet of approximately 1,273 aircrafts. Delta Air Lines, Inc. was founded in 1924 and is based in Atlanta, Georgia.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Walgreens Boots Alliance, Inc.","Symbol":"WBA","Current Price":"11.38","Latest MA":"9.77","Price Target":12.414,"Difference from MA":"16.56%","Difference from Open":"0.93%","Change from Yesterday":"1.24%","Change from Last Report":"0.35","Latest Volume":"5,210,527","Market Cap":"9,838,382,080","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":7.6925154,"PB Ratio":0.9417653,"ROE":-0.75969005,"DTE":277.898,"Industry":"Pharmaceutical Retailers","Sector":"Healthcare","Beta":0.669,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.06662952,"Quick Ratio":0.332,"Day High":11.6,"Day Low":11.25,"VS Average Volume":0.2139431847,"Company Summary":"Walgreens Boots Alliance, Inc. operates as a healthcare, pharmacy, and retail company in the United States, Germany, the United Kingdom, and internationally. It operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The U.S. Retail Pharmacy segment engages in operation of the retail drugstores, health and wellness services, specialty, and home delivery pharmacy services, which offers health and wellness, beauty, personal care and consumables, and general merchandise. The International segment offers sale of prescription drugs and health and wellness, beauty, personal care, and other consumer products outside the United States; and operates pharmacy-led health and beauty retail businesses under the Boots brand stores in the United Kingdom, the Republic of Ireland, and Thailand, as well as the Benavides brand in Mexico and the Ahumada brand in Chile. The U.S. Healthcare segment provides VillageMD, a national provider of value-based care with primary, multi-specialty, and urgent care providers serving patients in traditional clinic settings, in patients' homes and online appointments; Shields, a specialty pharmacy integrator and accelerator for hospitals; and CareCentrix, a participant in the post-acute and home care management sectors. Walgreens Boots Alliance, Inc. was founded in 1909 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Pepsico, Inc.","Symbol":"PEP","Current Price":"151.46","Latest MA":"163.75","Price Target":173.43864,"Difference from MA":"-7.51%","Difference from Open":"0.12%","Change from Yesterday":"0.64%","Change from Last Report":"0.09","Latest Volume":"1,059,986","Market Cap":"207,801,614,336","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":17.742449,"PB Ratio":10.690289,"ROE":0.48819,"DTE":229.605,"Industry":"Beverages - Non-Alcoholic","Sector":"Consumer Defensive","Beta":0.542,"Trailing PEG":1.7994,"Trailing PE":22.339233,"Trailing PS":2.260679,"Quick Ratio":0.664,"Day High":151.81,"Day Low":150.63,"VS Average Volume":0.1664741718,"Company Summary":"PepsiCo, Inc. engages in the manufacture, marketing, distribution, and sale of various beverages and convenient foods worldwide. The company operates through seven segments: Frito-Lay North America; Quaker Foods North America; PepsiCo Beverages North America; Latin America; Europe; Africa, Middle East and South Asia; and Asia Pacific, Australia and New Zealand and China Region. It provides dips, cheese-flavored snacks, and spreads, as well as corn, potato, and tortilla chips; cereals, rice, pasta, mixes and syrups, granola bars, grits, oatmeal, rice cakes, and side dishes; beverage concentrates, fountain syrups, and finished goods; ready-to-drink tea, coffee, and juices; dairy products; and sparkling water makers and related products, as well as distributes alcoholic beverages under Hard MTN Dew brand. The company offers its products primarily under the Lay's, Doritos, Fritos, Tostitos, BaiCaoWei, Cheetos, Cap'n Crunch, Life, Pearl Milling Company, Gatorade, Pepsi-Cola, Mountain Dew, Quaker, Rice-A-Roni, Aquafina, Bubly, Emperador, Diet Mountain Dew, Diet Pepsi, Gatorade Zero, Crush, Propel, Dr Pepper, Schweppes, Marias Gamesa, Ruffles, Sabritas, Saladitas, Tostitos, 7UP, Diet 7UP, H2oh!, Manzanita Sol, Mirinda, Pepsi Black, Pepsi Max, San Carlos, Toddy, Walkers, Chipsy, Kurkure, Sasko, Spekko, White Star, Smith's, Sting, SodaStream, Lubimyj Sad, Agusha, Chudo, Domik v Derevne, Lipton, and other brands. It serves wholesale and other distributors, foodservice customers, grocery stores, drug stores, convenience stores, discount\/dollar stores, mass merchandisers, membership stores, hard discounters, e-commerce retailers and authorized independent bottlers, and others through a network of direct-store-delivery, customer warehouse, and distributor networks, as well as directly to consumers through e-commerce platforms and retailers. The company was founded in 1898 and is based in Purchase, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Alphabet Inc.","Symbol":"GOOGL","Current Price":"199.88","Latest MA":"174.35","Price Target":216.14644,"Difference from MA":"14.64%","Difference from Open":"0.95%","Change from Yesterday":"2.26%","Change from Last Report":"0.21","Latest Volume":"9,908,169","Market Cap":"2,456,745,148,416","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":22.21743,"PB Ratio":7.8038497,"ROE":0.32101002,"DTE":9.324,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.034,"Trailing PEG":1.2782,"Trailing PE":26.509285,"Trailing PS":7.2287188,"Quick Ratio":1.761,"Day High":201.4,"Day Low":197.67,"VS Average Volume":0.3572123505,"Company Summary":"Alphabet Inc. offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube. It is also involved in the sale of apps and in-app purchases and digital content in the Google Play and YouTube; and devices, as well as in the provision of YouTube consumer subscription services. The Google Cloud segment offers infrastructure, cybersecurity, databases, analytics, AI, and other services; Google Workspace that include cloud-based communication and collaboration tools for enterprises, such as Gmail, Docs, Drive, Calendar, and Meet; and other services for enterprise customers. The Other Bets segment sells healthcare-related and internet services. The company was incorporated in 1998 and is headquartered in Mountain View, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Enterprise Products Partners L.","Symbol":"EPD","Current Price":"33.96","Latest MA":"29.95","Price Target":35.66722,"Difference from MA":"13.41%","Difference from Open":"0.00%","Change from Yesterday":"1.00%","Change from Last Report":"0.00","Latest Volume":"1,515,164","Market Cap":"73,611,010,048","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":11.7533455,"PB Ratio":2.5967271,"ROE":0.20665,"DTE":110.757,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":1.014,"Trailing PEG":3.263,"Trailing PE":12.766916,"Trailing PS":1.2996294,"Quick Ratio":0.719,"Day High":34.09,"Day Low":33.6798,"VS Average Volume":0.3566097824,"Company Summary":"Enterprise Products Partners L.P. provides midstream energy services to producers and consumers of natural gas, natural gas liquids (NGLs), crude oil, petrochemicals, and refined products. It operates in four segments: NGL Pipelines & Services, Crude Oil Pipelines & Services, Natural Gas Pipelines & Services, and Petrochemical & Refined Products Services. The NGL Pipelines & Services segment offers natural gas processing and related NGL marketing services. It operates natural gas processing facilities located in Colorado, Louisiana, Mississippi, New Mexico, Texas, and Wyoming; NGL pipelines; NGL fractionation facilities; NGL and related product storage facilities; and NGL marine terminals. The Crude Oil Pipelines & Services segment operates crude oil pipelines; and crude oil storage and marine terminals, which include a fleet of approximately 250 tractor-trailer tank trucks that are used to transport crude oil. It also engages in crude oil marketing activities. The Natural Gas Pipelines & Services segment operates natural gas pipeline systems to gather, treat, and transport natural gas. It leases underground salt dome natural gas storage facilities in Napoleonville, Louisiana; owns an underground salt dome storage cavern in Wharton County, Texas; and markets natural gas. The Petrochemical & Refined Products Services segment operates propylene fractionation facilities, including propylene fractionation units and propane dehydrogenation facilities, and related marketing activities; butane isomerization complex and related deisobutanizer operations; and octane enhancement, isobutane dehydrogenation, and high purity isobutylene production facilities. It also operates refined products pipelines and terminals; and ethylene export terminals; and provides refined products marketing and marine transportation services. Enterprise Products Partners L.P. was founded in 1968 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Lumen Technologies, Inc.","Symbol":"LUMN","Current Price":"4.97","Latest MA":"5.48","Price Target":5.37091,"Difference from MA":"-9.29%","Difference from Open":"-2.17%","Change from Yesterday":"-0.70%","Change from Last Report":"0.10","Latest Volume":"2,934,295","Market Cap":"5,043,605,504","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":-7.424559,"PB Ratio":14.747773,"ROE":-1.6673199,"DTE":5502.924,"Industry":"Telecom Services","Sector":"Communication Services","Beta":1.201,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.37933254,"Quick Ratio":0.988,"Day High":5.0922,"Day Low":4.9,"VS Average Volume":0.2067981984,"Company Summary":"Lumen Technologies, Inc., a facilities-based technology and communications company, provides various integrated products and services to business and residential customers in the United States and internationally. The company operates in two segments, Business and Mass Markets. It offers dark fiber, edge cloud services, internet protocol, managed security, software-defined wide area networks, secure access service edge, unified communications and collaboration, and optical wavelengths services; ethernet and VPN data networks services; and legacy services to manage cash flow, including time division multiplexing voice, private line, and other legacy services, as well as sells communication equipment, and IT solutions. The company also provides high speed and lower speed broadband service to residential and small business customers; local and long-distance voice services, professional services, and other ancillary services; and federal broadband and state support programs. It serves its products and services under the Lumen, Quantum Fiber, and CenturyLink brands. The company was formerly known as CenturyLink, Inc. and changed its name to Lumen Technologies, Inc. in September 2020. Lumen Technologies, Inc. was incorporated in 1968 and is headquartered in Monroe, Louisiana.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Pfizer, Inc.","Symbol":"PFE","Current Price":"26.79","Latest MA":"27.17","Price Target":31.12955,"Difference from MA":"-1.42%","Difference from Open":"0.47%","Change from Yesterday":"0.60%","Change from Last Report":"0.11","Latest Volume":"8,335,041","Market Cap":"151,790,321,664","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":9.171751,"PB Ratio":1.6444621,"ROE":0.04538,"DTE":73.408,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.615,"Trailing PEG":0.1994,"Trailing PE":35.713333,"Trailing PS":2.5564685,"Quick Ratio":0.64,"Day High":26.88,"Day Low":26.58,"VS Average Volume":0.1910161392,"Company Summary":"Pfizer Inc. discovers, develops, manufactures, markets, distributes, and sells biopharmaceutical products in the United States, Europe, and internationally. The company offers medicines and vaccines in various therapeutic areas, including cardiovascular metabolic, migraine, and women's health under the Eliquis, Nurtec ODT\/Vydura, Zavzpret, and the Premarin family brands; infectious diseases with unmet medical needs under the Prevnar family, Abrysvo, Nimenrix, FSME\/IMMUN-TicoVac, and Trumenba brands; and COVID-19 prevention and treatment, and potential future mRNA and antiviral products under the Comirnaty and Paxlovid brands. It also provides medicines and vaccines in various therapeutic areas, such as biosimilars for chronic immune and inflammatory diseases under the Xeljanz, Enbrel, Inflectra, Litfulo, Velsipity, and Cibinqo brands; amyloidosis, hemophilia, endocrine diseases, and sickle cell disease under the Vyndaqel family, Oxbryta, BeneFIX, Somavert, Ngenla, and Genotropin brands; sterile injectable and anti-infective medicines under the Sulperazon, Medrol, Zavicefta, Zithromax, and Panzyga brands; and biologics, small molecules, immunotherapies, and biosimilars under the Ibrance, Xtandi, Inlyta, Bosulif, Mektovi, Padcev, Adcetris, Talzenna, Tukysa, Elrexfio, Tivdak, Lorbrena, and Braftovi brands. In addition, the company involved in the contract manufacturing business. It serves wholesalers, retailers, hospitals, clinics, government agencies, pharmacies, individual provider offices, retail pharmacies, and integrated delivery systems. The company has collaboration agreements with Bristol-Myers Squibb Company; Astellas Pharma US, Inc.; Merck KGaA; and BioNTech SE, as well as has strategic clinical collaboration with Acepodia Inc. for the development of antibody-cell conjugation-based cell therapies in autoimmune diseases. Pfizer Inc. was founded in 1849 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Super Micro Computer, Inc.","Symbol":"SMCI","Current Price":"28.31","Latest MA":"47.17","Price Target":40.79182,"Difference from MA":"-39.98%","Difference from Open":"-0.94%","Change from Yesterday":"1.83%","Change from Last Report":"0.02","Latest Volume":"9,779,922","Market Cap":"16,577,344,512","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.6734796,"PB Ratio":3.0375538,"ROE":0.32469,"DTE":39.749,"Industry":"Computer Hardware","Sector":"Technology","Beta":1.279,"Trailing PEG":null,"Trailing PE":14.084577,"Trailing PS":1.1093827,"Quick Ratio":1.805,"Day High":28.63,"Day Low":27.81,"VS Average Volume":0.1321206453,"Company Summary":"Super Micro Computer, Inc., together with its subsidiaries, develops and manufactures high performance server and storage solutions based on modular and open architecture in the United States, Europe, Asia, and internationally. Its solutions range from complete server, storage systems, modular blade servers, blades, workstations, full racks, networking devices, server sub-systems, server management software, and security software. The company provides application-optimized server solutions, rackmount and blade servers, storage, and subsystems and accessories; and server software management solutions, such as Server Management Suite, including Supermicro Server Manager, Supermicro Power Management software, Supermicro Update Manager, SuperCloud Composer, and SuperDoctor 5. In addition, it offers server subsystems and accessories comprising server boards, chassis, power supplies, and other accessories. Further, the company provides server and storage system integration, configuration, and software upgrade and update services; and technical documentation services, as well as identifies service requirements, creates and executes project plans, and conducts verification testing and technical documentation, and training services. Additionally, it offers help desk and on-site product support services for its server and storage systems; and customer support services, including ongoing maintenance and technical support for its products. The company provides its products to enterprise data centers, cloud computing, artificial intelligence, and 5G and edge computing markets. It sells its products through direct and indirect sales force, distributors, value-added resellers, system integrators, and original equipment manufacturers. The company was incorporated in 1993 and is headquartered in San Jose, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"PayPal Holdings, Inc.","Symbol":"PYPL","Current Price":"90.29","Latest MA":"76.78","Price Target":96.24829,"Difference from MA":"17.60%","Difference from Open":"0.59%","Change from Yesterday":"1.76%","Change from Last Report":"0.24","Latest Volume":"3,512,886","Market Cap":"90,519,339,008","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":18.395521,"PB Ratio":4.5023437,"ROE":0.22188,"DTE":65.718,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.436,"Trailing PEG":1.4784,"Trailing PE":21.60048,"Trailing PS":2.877558,"Quick Ratio":0.261,"Day High":90.925,"Day Low":89.57,"VS Average Volume":0.4062251485,"Company Summary":"PayPal Holdings, Inc. operates a technology platform that enables digital payments on behalf of merchants and consumers worldwide. It operates a two-sided network at scale that connects merchants and consumers that enables its customers to connect, transact, and send and receive payments through online and in person, as well as transfer and withdraw funds using various funding sources, such as bank accounts, PayPal or Venmo account balance, PayPal and Venmo branded credit products comprising its installment products, credit and debit cards, and cryptocurrencies, as well as other stored value products, including gift cards and eligible rewards. The company provides payment solutions under the PayPal, PayPal Credit, Braintree, Venmo, Xoom, Zettle, Hyperwallet, Honey, and Paidy names. The company was founded in 1998 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Advanced Micro Devices, Inc.","Symbol":"AMD","Current Price":"118.08","Latest MA":"144.68","Price Target":169.81767,"Difference from MA":"-18.39%","Difference from Open":"-0.34%","Change from Yesterday":"0.75%","Change from Last Report":"-0.02","Latest Volume":"12,892,192","Market Cap":"191,621,398,528","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":23.877216,"PB Ratio":3.3630486,"ROE":0.03262,"DTE":3.927,"Industry":"Semiconductors","Sector":"Technology","Beta":1.706,"Trailing PEG":0.3245,"Trailing PE":104.495575,"Trailing PS":7.887277,"Quick Ratio":1.575,"Day High":120.44,"Day Low":117.09,"VS Average Volume":0.3549873297,"Company Summary":"Advanced Micro Devices, Inc. operates as a semiconductor company worldwide. It operates through Data Center, Client, Gaming, and Embedded segments. The company offers x86 microprocessors and graphics processing units (GPUs) as an accelerated processing unit, chipsets, data center, and professional GPUs; and embedded processors, and semi-custom system-on-chip (SoC) products, microprocessor and SoC development services and technology, data processing unites, field programmable gate arrays (FPGA), and adaptive SoC products. It provides processors under the AMD Ryzen, AMD Ryzen PRO, Ryzen Threadripper, Ryzen Threadripper PRO, AMD Athlon, AMD Athlon PRO, and AMD PRO A-Series brand names; graphics under the AMD Radeon graphics and AMD Embedded Radeon graphics; and professional graphics under the AMD Radeon Pro graphics brand name. In addition, the company offers data center graphics under the Radeon Instinct and Radeon PRO V-series brands, as well as servers under the AMD Instinct accelerators brand; server microprocessors under the AMD EPYC brands; low power solutions under the AMD Athlon, AMD Geode, AMD Ryzen, AMD EPYC, AMD R-Series, and G-Series brands; FPGA products under the Virtex-6, Virtex-7, Virtex UltraScale+, Kintex-7, Kintex UltraScale, Kintex UltraScale+, Artix-7, Artix UltraScale+, Spartan-6, and Spartan-7 brands; adaptive SOCs under the Zynq-7000, Zynq UltraScale+ MPSoC, Zynq UltraScale+ RFSoCs, Versal HBM, Versal Premium, Versal Prime, Versal AI Core, Versal AI Edge, Vitis, and Vivado brands; and compute and network acceleration board products under the Alveo brand. It serves original equipment and design manufacturers, public cloud service providers, system integrators, independent distributors, and add-in-board manufacturers through its direct sales force, and sales representatives. Advanced Micro Devices, Inc. was incorporated in 1969 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Amcor plc","Symbol":"AMCR","Current Price":"9.70","Latest MA":"10.27","Price Target":11.29556,"Difference from MA":"-5.63%","Difference from Open":"-0.26%","Change from Yesterday":"-0.59%","Change from Last Report":"0.05","Latest Volume":"4,026,207","Market Cap":"14,012,571,648","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":12.211557,"PB Ratio":3.5735347,"ROE":0.1958,"DTE":196.619,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":0.863,"Trailing PEG":1.9233,"Trailing PE":18.292454,"Trailing PS":1.0341381,"Quick Ratio":0.591,"Day High":9.76,"Day Low":9.68,"VS Average Volume":0.2567009465,"Company Summary":"Amcor plc develops, produces, and sells packaging products in Europe, North America, Latin America, and the Asia Pacific. The company operates in two segments, Flexibles and Rigid Packaging. The Flexibles segment offers flexible and film packaging products in the food and beverage, medical and pharmaceutical, fresh produce, snack food, personal care, and other industries. The Rigid Packaging segment provides rigid containers for various beverage and food products, including carbonated soft drinks, water, juices, sports drinks, milk-based beverages, spirits and beer, sauces, dressings, spreads, and personal care items; and plastic caps for various applications. It sells its products through its direct sales force. The company was incorporated in 1926 and is headquartered in Zurich, Switzerland.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Juniper Networks, Inc.","Symbol":"JNPR","Current Price":"36.37","Latest MA":"37.73","Price Target":39.7,"Difference from MA":"-3.61%","Difference from Open":"1.88%","Change from Yesterday":"3.50%","Change from Last Report":"0.19","Latest Volume":"1,922,115","Market Cap":"12,041,706,496","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":18.212955,"PB Ratio":2.5921173,"ROE":0.055760004,"DTE":39.109,"Industry":"Communication Equipment","Sector":"Technology","Beta":0.921,"Trailing PEG":null,"Trailing PE":47.855263,"Trailing PS":2.3919327,"Quick Ratio":1.069,"Day High":36.47,"Day Low":35.31,"VS Average Volume":0.4744633294,"Company Summary":"Juniper Networks, Inc. designs, develops, and sells network products and services worldwide. The company offers routing products, such as ACX series universal access routers to deploy high-bandwidth services; MX series Ethernet routers that function as a universal edge platform; PTX series packet transport routers; wide-area network SDN controllers; and session smart routers. It also provides switching products, including EX series Ethernet switches to address the access, aggregation, and core layer switching requirements of micro branch, branch office, and campus environments; QFX series of core, spine, and top-of-rack data center switches; and juniper access points, which provide Wi-Fi access and performance. In addition, the company offers security products comprising SRX series services gateways for the data center; Branch SRX family provides an integrated and next-generation firewall; virtual firewall that delivers various features of physical firewalls; and advanced malware protection, a cloud-based service and Juniper ATP. Further, it offers Junos OS, a network operating system; Contrail networking, which provides an open-source and standards-based platform for SDN; Mist AI-driven Wired, Wireless, and WAN assurance solutions to set and measure key metrics; Mist AI-driven Marvis Virtual Network Assistant, which identifies the root cause of issues; Juniper Paragon Automation, a modular portfolio of cloud-native software applications; and Juniper Apstra to automate the network lifecycle in a single system. Additionally, the company provides software-as-a-service, technical support, maintenance, and professional services, as well as education and training programs. It sells its products through direct sales, distributors, value-added resellers, and original equipment manufacturers to end-users in the cloud, service provider, and enterprise markets. The company was incorporated in 1996 and is headquartered in Sunnyvale, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Ball Corporation","Symbol":"BALL","Current Price":"56.04","Latest MA":"61.13","Price Target":67.808,"Difference from MA":"-8.33%","Difference from Open":"-1.62%","Change from Yesterday":"1.27%","Change from Last Report":"0.11","Latest Volume":"1,045,013","Market Cap":"16,723,792,896","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":15.932993,"PB Ratio":2.5160508,"ROE":0.14048,"DTE":90.836,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":0.899,"Trailing PEG":1.1212,"Trailing PE":23.35,"Trailing PS":1.2131877,"Quick Ratio":0.801,"Day High":57.0,"Day Low":55.95,"VS Average Volume":0.4818745934,"Company Summary":"Ball Corporation supplies aluminum packaging products for the beverage, personal care, and household products industries in the United States, Brazil, and internationally. The company manufactures and sells aluminum beverage containers to fillers of carbonated soft drinks, beer, energy drinks, and other beverages. It also manufactures and sells extruded aluminum aerosol containers, recloseable aluminum bottles, aluminum cups, and aluminum slugs. Ball Corporation was founded in 1880 and is headquartered in Westminster, Colorado.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Electronic Arts Inc.","Symbol":"EA","Current Price":"118.10","Latest MA":"147.27","Price Target":148.46455,"Difference from MA":"-19.80%","Difference from Open":"0.20%","Change from Yesterday":"0.98%","Change from Last Report":"0.28","Latest Volume":"1,261,899","Market Cap":"30,974,439,424","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":14.792047,"PB Ratio":4.195233,"ROE":0.13962,"DTE":29.954,"Industry":"Electronic Gaming & Multimedia","Sector":"Communication Services","Beta":0.781,"Trailing PEG":1.8511,"Trailing PE":30.282051,"Trailing PS":4.1806507,"Quick Ratio":1.283,"Day High":118.16,"Day Low":116.29,"VS Average Volume":0.4894038685,"Company Summary":"Electronic Arts Inc. develops, markets, publishes, and delivers games, content, and services for game consoles, PCs, mobile phones, and tablets worldwide. It develops and publishes games and services across various genres, such as sports, racing, first-person shooter, action, role-playing, and simulation through owned and licensed brands, such as EA SPORTS FC, Battlefield, Apex Legends, The Sims, Madden NFL, Need for Speed, Titanfall, and F1 brands. The company licenses its games to third parties to distribute and host its games and content. It markets and sells its games and services through digital distribution and retail channels, as well as directly to mass market retailers, specialty stores, and distribution arrangements. Electronic Arts Inc. was incorporated in 1982 and is headquartered in Redwood City, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Snap Inc.","Symbol":"SNAP","Current Price":"11.22","Latest MA":"11.46","Price Target":13.17057,"Difference from MA":"-2.10%","Difference from Open":"-3.61%","Change from Yesterday":"-3.40%","Change from Last Report":"0.04","Latest Volume":"8,063,621","Market Cap":"18,818,295,808","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":27.458948,"PB Ratio":8.487141,"ROE":-0.4062,"DTE":191.874,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":0.995,"Trailing PEG":496.0591,"Trailing PE":"N\/A","Trailing PS":3.6431425,"Quick Ratio":3.861,"Day High":11.66,"Day Low":11.18,"VS Average Volume":0.2737691902,"Company Summary":"Snap Inc. operates as a technology company in North America, Europe, and internationally. The company offers Snapchat, a visual messaging application with various tabs, such as camera, visual messaging, snap map, stories, and spotlight that enable people to communicate visually through short videos and images. It also provides Spectacles, an eyewear product that connects with Snapchat and captures photos and video from a human perspective; and advertising products, including AR ads and Snap ads comprises a single image or video ads, collection ads, dynamic ads, story ads, and commercials. The company was formerly known as Snapchat, Inc. and changed its name to Snap Inc. in September 2016. Snap Inc. was founded in 2010 and is headquartered in Santa Monica, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Chipotle Mexican Grill, Inc.","Symbol":"CMG","Current Price":"58.84","Latest MA":"57.91","Price Target":66.30719,"Difference from MA":"1.61%","Difference from Open":"0.38%","Change from Yesterday":"1.04%","Change from Last Report":"0.04","Latest Volume":"2,139,978","Market Cap":"80,181,608,448","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":44.47241,"PB Ratio":22.20566,"ROE":0.45673,"DTE":124.061,"Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":1.266,"Trailing PEG":2.0257,"Trailing PE":54.48611,"Trailing PS":7.2992816,"Quick Ratio":1.486,"Day High":59.57,"Day Low":58.5792,"VS Average Volume":0.2365535082,"Company Summary":"Chipotle Mexican Grill, Inc., together with its subsidiaries, owns and operates Chipotle Mexican Grill restaurants. It sells food and beverages through offering burritos, burrito bowls, quesadillas, tacos, and salads. The company also provides delivery and related services its app and website. It has operations in the United States, Canada, France, Germany, Dubai, and the United Kingdom. Chipotle Mexican Grill, Inc. was founded in 1993 and is headquartered in Newport Beach, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Western Union Company (The)","Symbol":"WU","Current Price":"10.45","Latest MA":"11.13","Price Target":12.46667,"Difference from MA":"-6.17%","Difference from Open":"0.82%","Change from Yesterday":"0.97%","Change from Last Report":"0.05","Latest Volume":"2,636,305","Market Cap":"3,528,331,264","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":5.7771015,"PB Ratio":5.4063144,"ROE":1.06689,"DTE":396.308,"Industry":"Credit Services","Sector":"Financial Services","Beta":0.888,"Trailing PEG":2.1003,"Trailing PE":5.3290815,"Trailing PS":0.83931947,"Quick Ratio":0.221,"Day High":10.48,"Day Low":10.345,"VS Average Volume":0.574672016,"Company Summary":"The Western Union Company provides money movement and payment services worldwide. The company operates through Consumer Money Transfer and Consumer Services segments. The Consumer Money Transfer segment facilitates money transfers for international cross-border and intra-country transfers, primarily through a network of retail agent locations, as well as through websites and mobile devices. The Consumer Services segments offers bill payment services, which facilitate payments for consumers, businesses, and other organizations, as well as money order services, retail foreign exchange services, prepaid cards, lending partnerships, and digital wallets. The company was founded in 1851 and is headquartered in Denver, Colorado.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Mondelez International, Inc.","Symbol":"MDLZ","Current Price":"57.82","Latest MA":"66.16","Price Target":72.4844,"Difference from MA":"-12.61%","Difference from Open":"0.56%","Change from Yesterday":"1.20%","Change from Last Report":"0.10","Latest Volume":"2,217,956","Market Cap":"77,316,325,376","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":17.650434,"PB Ratio":2.775804,"ROE":0.13552,"DTE":73.232,"Industry":"Confectioners","Sector":"Consumer Defensive","Beta":0.561,"Trailing PEG":4.7878,"Trailing PE":20.503546,"Trailing PS":2.138705,"Quick Ratio":0.295,"Day High":57.91,"Day Low":57.24,"VS Average Volume":0.240798895,"Company Summary":"Mondelez International, Inc., through its subsidiaries, manufactures, markets, and sells snack food and beverage products in the Latin America, North America, Asia, the Middle East, Africa, and Europe. It provides biscuits and baked snacks, including cookies, crackers, salted snacks, snack bars, and cakes and pastries; chocolates; and gums and candies, as well as various cheese and grocery, and powdered beverage products. The company's brand portfolio includes Oreo, Ritz, LU, CLIF Bar, and Tate's Bake Shop biscuits and baked snacks, as well as Cadbury Dairy Milk, Milka, and Toblerone chocolate. It serves supermarket chains, wholesalers, supercenters, club stores, mass merchandisers, distributors, convenience stores, gasoline stations, drug stores, value stores, and other retail food outlets through direct store delivery, company-owned and satellite warehouses, distribution centers, third party distributors, and other facilities, as well as through independent sales offices and agents. The company also sells products directly to businesses and consumers through e-retail platforms, retailer digital platforms, as well as through its direct-to-consumer websites and social media platforms. Mondelez International, Inc. was formerly known as Kraft Foods Inc. and changed its name to Mondelez International, Inc. in October 2012. The company was incorporated in 2000 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Merck & Company, Inc.","Symbol":"MRK","Current Price":"98.50","Latest MA":"108.73","Price Target":123.96542,"Difference from MA":"-9.41%","Difference from Open":"-0.92%","Change from Yesterday":"0.23%","Change from Last Report":"0.15","Latest Volume":"2,391,261","Market Cap":"249,169,526,784","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":10.590202,"PB Ratio":5.604233,"ROE":0.28332,"DTE":85.572,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.411,"Trailing PEG":0.0693,"Trailing PE":20.606693,"Trailing PS":3.9441783,"Quick Ratio":0.917,"Day High":99.41,"Day Low":98.23,"VS Average Volume":0.2047234326,"Company Summary":"Merck & Co., Inc. operates as a healthcare company worldwide. It operates through two segments, Pharmaceutical and Animal Health. The Pharmaceutical segment offers human health pharmaceutical products in the areas of oncology, hospital acute care, immunology, neuroscience, virology, cardiovascular, and diabetes under the Keytruda, Bridion, Adempas, Lagevrio, Belsomra, Simponi, and Januvia brands, as well as vaccine products consisting of preventive pediatric, adolescent, and adult vaccines under the Gardasil\/Gardasil 9, ProQuad, M-M-R II, Varivax, RotaTeq, Live Oral, Vaxneuvance, Pneumovax 23, and Vaqta names. The Animal Health segment discovers, develops, manufactures, and markets veterinary pharmaceuticals, vaccines, and health management solutions and services, as well as digitally connected identification, traceability, and monitoring products. vIt has development and commercialization agreement for three of Daiichi Sankyo's deruxtecan ADC candidates, which include patritumab deruxtecan, ifinatamab deruxtecan, and raludotatug deruxtecan for the treatment of multiple solid tumors both as monotherapy and\/or in combination with other treatments; and AstraZeneca PLC to co-development and co-commercialize AstraZeneca's Lynparza products for multiple cancer types, and Koselugo for multiple indications. It also has licensed to develop, manufacture and  commercialize LM-299, a novel investigational PD-1\/VEGF bispecific antibody from LaNova. The company also has a collaboration agreement with Eisai Co., Ltd., Bayer AG, and Ridgeback Biotherapeutics LP, as well Moderna, Inc. Merck & Co., Inc. was founded in 1891 and is headquartered in Rahway, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"CNH Industrial N.V.","Symbol":"CNH","Current Price":"13.13","Latest MA":"10.94","Price Target":14.19474,"Difference from MA":"20.08%","Difference from Open":"-0.11%","Change from Yesterday":"0.23%","Change from Last Report":"0.23","Latest Volume":"5,690,640","Market Cap":"16,405,352,448","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":15.308859,"PB Ratio":2.1465926,"ROE":0.22186,"DTE":356.262,"Industry":"Farm & Heavy Construction Machinery","Sector":"Industrials","Beta":1.597,"Trailing PEG":null,"Trailing PE":9.658089,"Trailing PS":0.7541997,"Quick Ratio":3.87,"Day High":13.17,"Day Low":12.91,"VS Average Volume":0.473125503,"Company Summary":"CNH Industrial N.V., an equipment and services company, engages in the design, production, marketing, sale, and financing of agricultural and construction equipment in North America, Europe, the Middle East, Africa, South America, and the Asia Pacific. The company operates through three segments: Agriculture, Construction, and Financial Services. The Agriculture segment designs, manufactures, and distributes farm machinery and implements, including two-wheel and four-wheel drive tractors, crawler tractors, combines, grape and sugar cane harvesters, hay and forage equipment, planting and seeding equipment, soil preparation and cultivation implements, material handling equipment, and precision agriculture technology. This segment sells its agricultural equipment under the New Holland Agriculture and Case IH brands. The Construction segment designs, manufactures, and distributes construction equipment comprising excavators, crawler dozers, graders, wheel loaders, backhoe loaders, skid steer loaders, and compact track loaders under the CASE Construction Equipment, New Holland Construction, and Eurocomach brands. The Financial Services segment offers financing to end-use customers for the purchase of new and used agricultural and construction equipment and components, as well as revolving charge account financing and other financial services. It also provides wholesale financing to CNH Industrial brand dealers and distributors; trade receivables factoring services to CNH companies; and financial services to Iveco Group companies in the North America, South America, and Asia Pacific regions. The company was founded in 1842 and is headquartered in Basildon, the United Kingdom.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Palantir Technologies Inc.","Symbol":"PLTR","Current Price":"79.84","Latest MA":"47.78","Price Target":50.36316,"Difference from MA":"67.11%","Difference from Open":"-0.08%","Change from Yesterday":"0.18%","Change from Last Report":"0.13","Latest Volume":"22,978,424","Market Cap":"181,877,112,832","Earning Date":"2025-02-03","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":165.82893,"PB Ratio":40.28254,"ROE":0.12409,"DTE":5.552,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":2.697,"Trailing PEG":3.4191,"Trailing PE":399.19998,"Trailing PS":68.727844,"Quick Ratio":5.546,"Day High":81.66,"Day Low":79.39,"VS Average Volume":0.2760337069,"Company Summary":"Palantir Technologies Inc. builds and deploys software platforms for the intelligence community to assist in counterterrorism investigations and operations in the United States, the United Kingdom, and internationally. The company provides Palantir Gotham, a software platform which enables users to identify patterns hidden deep within datasets, ranging from signals intelligence sources to reports from confidential informants, as well as facilitates the handoff between analysts and operational users, helping operators plan and execute real-world responses to threats that have been identified within the platform. It also offers Palantir Foundry, a platform that transforms the ways organizations operate by creating a central operating system for their data; and allows individual users to integrate and analyze the data they need in one place. In addition, it provides Palantir Apollo, a software that delivers software and updates across the business, as well as enables customers to deploy their software virtually in any environment; and Palantir Artificial Intelligence Platform (AIP) that provides unified access to open-source, self-hosted, and commercial large language models (LLM) that can transform structured and unstructured data into LLM-understandable objects and can turn organizations' actions and processes into tools for humans and LLM-driven agents. The company was incorporated in 2003 and is headquartered in Denver, Colorado.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Kyndryl Holdings, Inc.","Symbol":"KD","Current Price":"37.20","Latest MA":"28.15","Price Target":38.4,"Difference from MA":"32.14%","Difference from Open":"-0.69%","Change from Yesterday":"-3.11%","Change from Last Report":"0.05","Latest Volume":"1,293,003","Market Cap":"8,640,481,280","Earning Date":"2025-02-03","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":18.325123,"PB Ratio":8.109876,"ROE":-0.0779,"DTE":349.744,"Industry":"Information Technology Services","Sector":"Technology","Beta":1.719,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.5647742,"Quick Ratio":0.663,"Day High":38.13,"Day Low":36.6,"VS Average Volume":0.5494716713,"Company Summary":"Kyndryl Holdings, Inc. operates as a technology services company and IT infrastructure services provider worldwide. The company offers cloud services; core enterprise and zCloud services; application, data, and artificial intelligence services; digital workplace services; security and resiliency services; and network services and edge services. It serves financial, technology, media and telecom, retail and travel, and automotive industries. The company was incorporated in 2020 and is headquartered in New York, New York.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"NXP Semiconductors N.V.","Symbol":"NXPI","Current Price":"210.15","Latest MA":"235.84","Price Target":262.41095,"Difference from MA":"-10.89%","Difference from Open":"-0.71%","Change from Yesterday":"-1.18%","Change from Last Report":"-0.04","Latest Volume":"1,041,778","Market Cap":"53,409,611,776","Earning Date":"2025-02-03","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":16.127956,"PB Ratio":5.6748405,"ROE":0.29555,"DTE":104.495,"Industry":"Semiconductors","Sector":"Technology","Beta":1.494,"Trailing PEG":1.179,"Trailing PE":20.052006,"Trailing PS":4.132272,"Quick Ratio":1.41,"Day High":211.64,"Day Low":206.81,"VS Average Volume":0.4244980219,"Company Summary":"NXP Semiconductors N.V. offers various semiconductor products. The company's product portfolio includes microcontrollers; application processors, including i.MX application processors, and i.MX 8 and 9 family of applications processors; communication processors; wireless connectivity solutions, such as near field communications, ultra-wideband, Bluetooth low-energy, Zigbee, and Wi-Fi and Wi-Fi\/Bluetooth integrated SoCs; analog and interface devices; radio frequency power amplifiers; and security controllers, as well as semiconductor-based environmental and inertial sensors, including pressure, inertial, magnetic, and gyroscopic sensors. Its products are used in various applications, including automotive, industrial and Internet of Things, mobile, and communication infrastructure. The company markets its products to various original equipment manufacturers, contract manufacturers, and distributors. It operates in China, the Netherlands, the United States, Singapore, Germany, Japan, South Korea, Taiwan, and internationally. N.V. was incorporated in 2006 and is headquartered in Eindhoven, the Netherlands.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Exxon Mobil Corporation","Symbol":"XOM","Current Price":"109.27","Latest MA":"114.46","Price Target":129.47845,"Difference from MA":"-4.54%","Difference from Open":"0.02%","Change from Yesterday":"0.51%","Change from Last Report":"0.03","Latest Volume":"3,304,042","Market Cap":"480,229,490,688","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":13.8196945,"PB Ratio":1.7879467,"ROE":0.14513999,"DTE":15.394,"Industry":"Oil & Gas Integrated","Sector":"Energy","Beta":0.88,"Trailing PEG":4.1662,"Trailing PE":13.607099,"Trailing PS":1.3967549,"Quick Ratio":0.978,"Day High":109.85,"Day Low":108.98,"VS Average Volume":0.2111033588,"Company Summary":"Exxon Mobil Corporation engages in the exploration and production of crude oil and natural gas in the United States and internationally. It operates through Upstream, Energy Products, Chemical Products, and Specialty Products segments. The Upstream segment explores for and produces crude oil and natural gas. The Energy Products segment offers fuels, aromatics, and catalysts, as well as licensing services. It sells its products under the Exxon, Esso, and Mobil brands. The Chemical Products segment manufactures and markets petrochemicals including olefins, polyolefins, and intermediates. The Specialty Products segment offers performance products, including lubricants, basestocks, waxes, synthetics, elastomers, and resins. The company also involves in the manufacturing, trade, transport, and sale of crude oil, natural gas, petroleum products, petrochemicals, and other specialty products; and pursuit lower-emission business opportunities, including carbon capture and storage, hydrogen, lower-emission fuels, and lithium. Exxon Mobil Corporation was founded in 1870 and is based in Spring, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Chevron Corporation","Symbol":"CVX","Current Price":"156.77","Latest MA":"150.09","Price Target":177.1913,"Difference from MA":"4.45%","Difference from Open":"0.13%","Change from Yesterday":"0.62%","Change from Last Report":"0.02","Latest Volume":"2,279,768","Market Cap":"279,508,353,024","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":13.945524,"PB Ratio":1.8036333,"ROE":0.103520006,"DTE":16.456,"Industry":"Oil & Gas Integrated","Sector":"Energy","Beta":1.078,"Trailing PEG":3.2201,"Trailing PE":17.246426,"Trailing PS":1.4581345,"Quick Ratio":0.675,"Day High":157.45,"Day Low":156.03,"VS Average Volume":0.2743993203,"Company Summary":"Chevron Corporation, through its subsidiaries, engages in the integrated energy and chemicals operations in the United States and internationally. The company operates in two segments, Upstream and Downstream. The Upstream segment is involved in the exploration, development, production, and transportation of crude oil and natural gas; processing, liquefaction, transportation, and regasification of liquefied natural gas; transportation of crude oil through pipelines; transportation, storage, and marketing of natural gas; and carbon capture and storage, as well as a gas-to-liquids plant. The Downstream segment refines crude oil into petroleum products; markets crude oil, refined products, and lubricants; manufactures and markets renewable fuels, commodity petrochemicals, plastics for industrial uses, and fuel and lubricant additives; and transports crude oil and refined products by pipeline, marine vessel, motor equipment, and rail car. The company was formerly known as ChevronTexaco Corporation and changed its name to Chevron Corporation in 2005. Chevron Corporation was founded in 1879 and is headquartered in San Ramon, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Charter Communications, Inc.","Symbol":"CHTR","Current Price":"330.02","Latest MA":"348.14","Price Target":404.65695,"Difference from MA":"-5.21%","Difference from Open":"-2.00%","Change from Yesterday":"-8.21%","Change from Last Report":"0.07","Latest Volume":"1,132,487","Market Cap":"46,845,677,568","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":9.2146845,"PB Ratio":3.328425,"ROE":0.32965,"DTE":533.472,"Industry":"Telecom Services","Sector":"Communication Services","Beta":1.036,"Trailing PEG":0.3596,"Trailing PE":10.342212,"Trailing PS":0.85375756,"Quick Ratio":0.288,"Day High":351.02,"Day Low":329.48,"VS Average Volume":0.9203036346,"Company Summary":"Charter Communications, Inc. operates as a broadband connectivity and cable operator company serving residential and commercial customers in the United States. The company offers subscription-based internet, video, and mobile and voice services; a suite of broadband connectivity services, including fixed internet, WiFi, and mobile; Advanced WiFi services; Spectrum Security Shield; in-home WiFi, which provides customers with high performance wireless routers and managed WiFi services to enhance their fixed wireless internet experience; out-of-home WiFi; and Spectrum WiFi services. It also offers voice communications services using voice over internet protocol technology; and broadband communications solutions, such as internet access, data networking, fiber connectivity, video entertainment, and business telephone services to cellular towers and office buildings for business and carrier organizations. In addition, the company provides mobile services; video programming, static IP and business WiFi, voice, and e-mail and security services; sells local advertising across various platforms for networks, such as TBS, CNN, and ESPN; sells advertising inventory to local sports and news channels; and offers Audience App to create data-driven linear TV campaigns for local advertisers. Further, the company offers communications products and managed service solutions; data connectivity services to mobile and wireline carriers on a wholesale basis; and owns and operates regional sports networks and news channels. It serves approximately 32 million customers in 41 states. Charter Communications, Inc.was founded in 1993 and is headquartered in Stamford, Connecticut.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"30-01-2025 18:42:19"},{"Company Name":"Eaton Corporation, PLC","Symbol":"ETN","Current Price":"324.60","Latest MA":"329.02","Price Target":377.53708,"Difference from MA":"-1.34%","Difference from Open":"-0.07%","Change from Yesterday":"2.35%","Change from Last Report":"0.00","Latest Volume":"1,236,829","Market Cap":"128,281,919,488","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":27.056494,"PB Ratio":6.710355,"ROE":0.20079,"DTE":52.594,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":1.01,"Trailing PEG":2.3953,"Trailing PE":34.531918,"Trailing PS":5.2136526,"Quick Ratio":0.911,"Day High":327.72,"Day Low":321.11,"VS Average Volume":0.5123851117,"Company Summary":"Eaton Corporation plc operates as a power management company worldwide. The company's Electrical Americas and Electrical Global segment provides electrical components, industrial components, power distribution and assemblies, residential products, single and three phase power quality and connectivity products, wiring devices, circuit protection products, utility power distribution products, power reliability equipment, and services, as well as hazardous duty electrical equipment, emergency lighting, fire detection, explosion-proof instrumentation, and structural support systems. Its Aerospace segment offers pumps, motors, hydraulic power units, hoses and fittings, and electro-hydraulic pumps; valves, cylinders, electronic controls, electromechanical actuators, sensors, aircraft flap and slat systems, and nose wheel steering systems; hose, thermoplastic tubing products, fittings, adapters, couplings, and sealing and ducting products; air-to-air refueling systems, fuel pumps, fuel inerting products, sensors, and adapters and regulators; oxygen generation system, payload carriages, and thermal management products; and wiring connectors and cables, as well as hydraulic and bag filters, strainers and cartridges, and golf grips for manufacturers of commercial and military aircraft, and related after-market customers, as well as industrial applications. The company's Vehicle segment offers transmissions, clutches, hybrid power systems, superchargers, engine valves and valve actuation systems, locking and limited slip differentials, transmission controls, and fuel vapor components for the vehicle industry. Its eMobility segment provides voltage inverters, converters, fuses, circuit protection units, vehicle controls, power distribution systems, fuel tank isolation valves, and commercial vehicle hybrid systems. Eaton Corporation plc was founded in 1911 and is based in Dublin, Ireland.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:43:19"},{"Company Name":"Colgate-Palmolive Company","Symbol":"CL","Current Price":"90.11","Latest MA":"96.53","Price Target":100.86864,"Difference from MA":"-6.65%","Difference from Open":"-0.49%","Change from Yesterday":"0.56%","Change from Last Report":"0.02","Latest Volume":"1,487,186","Market Cap":"73,620,865,024","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":23.964151,"PB Ratio":169.3797,"ROE":4.87923,"DTE":1009.091,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":0.415,"Trailing PEG":2.023,"Trailing PE":25.893679,"Trailing PS":3.6616366,"Quick Ratio":0.576,"Day High":90.68,"Day Low":89.95,"VS Average Volume":0.3207810116,"Company Summary":"Colgate-Palmolive Company, together with its subsidiaries, manufactures and sells consumer products in the United States and internationally. It operates through two segments: Oral, Personal and Home Care; and Pet Nutrition. The Oral, Personal and Home Care segment offers toothpaste, toothbrushes, mouthwash, bar and liquid hand soaps, shower gels, shampoos, conditioners, deodorants and antiperspirants, skin health products, dishwashing detergents, fabric conditioners, household cleaners, and other related items. This segment markets and sells its products under various brands, which include Colgate, Darlie, elmex, hello, meridol, Sorriso, Tom's of Maine, Irish Spring, Palmolive, Protex, Sanex, Softsoap, Lady Speed Stick, Speed Stick, EltaMD, Filorga, PCA SKIN, Ajax, Axion, Fabuloso, Murphy, Suavitel, and Soupline to a range of traditional and eCommerce retailers, wholesalers, and distributors. It includes pharmaceutical products for dentists and other oral health professionals. Its Pet Nutrition segment offers pet nutrition products for everyday nutritional needs under the Hill's Science Diet brand; and a range of therapeutic pet products to help nutritionally support dogs and cats in different stages of health under the Hill's Prescription Diet brand. This segment markets and sells its products through pet supply retailers, veterinarians, and eCommerce retailers. Colgate-Palmolive Company was founded in 1806 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:43:19"},{"Company Name":"AbbVie Inc.","Symbol":"ABBV","Current Price":"175.50","Latest MA":"181.20","Price Target":199.96964,"Difference from MA":"-3.15%","Difference from Open":"-0.29%","Change from Yesterday":"0.19%","Change from Last Report":"-0.05","Latest Volume":"1,600,238","Market Cap":"310,124,216,320","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":14.439671,"PB Ratio":51.41957,"ROE":0.56407,"DTE":1174.815,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.613,"Trailing PEG":0.414,"Trailing PE":61.148083,"Trailing PS":5.584503,"Quick Ratio":0.436,"Day High":176.01,"Day Low":173.98,"VS Average Volume":0.2446516778,"Company Summary":"AbbVie Inc. discovers, develops, manufactures, and sells pharmaceuticals worldwide. The company offers Humira, an injection for autoimmune and intestinal Behçet's diseases, and pyoderma gangrenosum; Skyrizi to treat moderate to severe plaque psoriasis, psoriatic disease, and Crohn's disease; Rinvoq to treat rheumatoid and psoriatic arthritis, ankylosing spondylitis, atopic dermatitis, axial spondyloarthropathy, ulcerative colitis, and Crohn's disease; Imbruvica for the treatment of adult patients with blood cancers; Epkinly to treat lymphoma; Elahere to treat cancer; and Venclexta\/Venclyxto to treat blood cancers. It also provides facial injectables, plastics and regenerative medicine, body contouring, and skincare products; botox therapeutic; Vraylar for depressive disorder; Duopa and Duodopa to treat advanced Parkinson's disease; Ubrelvy for the acute treatment of migraine in adults; and Qulipta for episodic and chronic migraine. In addition, the company offers Ozurdex for eye diseases; Lumigan\/Ganfort and Alphagan\/Combigan for the reduction of elevated intraocular pressure in patients with open angle glaucoma or ocular hypertension; Restasis to increase tear production; and other eye care products. Further, it provides Mavyret\/Maviret to treat chronic hepatitis C virus genotype 1-6 infection; Creon, a pancreatic enzyme therapy; Lupron to treat advanced prostate cancer, endometriosis and central precocious puberty, and patients with anemia caused by uterine fibroids; Linzess\/Constella to treat irritable bowel syndrome with constipation and chronic idiopathic constipation; and Synthroid for hypothyroidism. It has collaborations with Calico Life Sciences LLC; REGENXBIO Inc.; Janssen Biotech, Inc.; Evolveimmune Therapeutics, Inc.; Genentech, Inc.; AbCellera Biologics Inc.; and Tentarix Biotherapeutics, LP. The company was incorporated in 2012 and is headquartered in North Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 18:43:19"},{"Company Name":"LyondellBasell Industries NV","Symbol":"LYB","Current Price":"75.95","Latest MA":"86.83","Price Target":88.76714,"Difference from MA":"-12.53%","Difference from Open":"-1.85%","Change from Yesterday":"-2.48%","Change from Last Report":"0.12","Latest Volume":"1,421,481","Market Cap":"24,665,292,800","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":10.293392,"PB Ratio":1.798229,"ROE":0.1586,"DTE":92.277,"Industry":"Specialty Chemicals","Sector":"Basic Materials","Beta":1.091,"Trailing PEG":1.2586,"Trailing PE":11.525037,"Trailing PS":0.605521,"Quick Ratio":1.1,"Day High":77.73,"Day Low":74.35,"VS Average Volume":0.4950961663,"Company Summary":"LyondellBasell Industries N.V. operates as a chemical company in the United States, Germany, Mexico, Italy, Poland, France, Japan, China, the Netherlands, and internationally. The company operates in six segments: Olefins and Polyolefins\u0097Americas; Olefins and Polyolefins\u0097Europe, Asia, International; Intermediates and Derivatives; Advanced Polymer Solutions; Refining; and Technology. It produces and markets olefins and co-products, polyethylene, and polypropylene; and propylene oxide and derivatives; oxyfuels and related products; and intermediate chemicals, such as styrene monomer, acetyls, ethylene oxide, and ethylene glycol. In addition, the company produce and markets compounding and solutions including polypropylene compounds, engineered plastics, masterbatches, engineered composites, colors and powders, and advanced polymers including catalloy and polybutene-1; and refines heavy, high-sulfur crude oil and other crude oils, as well as refined products, including gasoline and distillates. Further, it develops and licenses chemical and polyolefin process technologies; manufactures and sells polyolefin catalysts; and serves food packaging, home furnishings, automotive components, and paints and coatings applications. LyondellBasell Industries N.V. was incorporated in 2009 and is headquartered in Houston, Texas.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"30-01-2025 18:43:19"}]