[{"Company Name":"Oracle Corporation","Symbol":"ORCL","Current Price":"200.84","Latest MA":"162.82","Latest MA 5":181.1739997559,"Latest MA 9":175.6466678874,"Latest MA 20":167.265500061,"RSI":92.7979891592,"Price Target":204.78146,"Difference from MA":"23.35%","Difference from Open":"5.73%","Change from Yesterday":"13.87%","Change from Last Report":"-0.03","Latest Volume":"43,296,945","Market Cap":"563,201,507,328","Earning Date":"12-06-2025","Earning Time":"Before","Earning Day of Week":"Saturday","PE Ratio":28.05028,"PB Ratio":33.64718,"Previous Close":176.38,"ROE":1.03741,"DTE":632.501,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.324,"Trailing PEG":1.8619,"Trailing PE":47.03513,"Trailing PS":47.03513,"Quick Ratio":0.873,"Day High":202.49,"Day Low":188.88,"VS Average Volume":4.4534061138,"Company Summary":"Oracle Corporation offers products and services that address enterprise information technology environments worldwide. Its Oracle cloud software as a service offering include various cloud software applications, including Oracle Fusion cloud enterprise resource planning (ERP), Oracle Fusion cloud enterprise performance management, Oracle Fusion cloud supply chain and manufacturing management, Oracle Fusion cloud human capital management, Oracle Cerner healthcare, and NetSuite applications suite, as well as Oracle Fusion Sales, Service, and Marketing. The company also offers cloud-based industry solutions for various industries; Oracle application licenses; and Oracle license support services. In addition, it provides cloud and license business' infrastructure technologies, such as the Oracle Database and MySQL Database; Java, a software development language; and middleware, including development tools and others. The company's cloud and license business' infrastructure technologies also comprise cloud-based compute, storage, and networking capabilities; and Oracle autonomous database and MySQL HeatWave, as well as Internet-of-Things, digital assistant, and blockchain. Further, it provides hardware products and other hardware-related software offerings, including Oracle engineered systems, enterprise servers, storage solutions, industry-specific hardware, virtualization software, operating systems, management software, and related hardware services, as well as hardware support products; and consulting and customer services. The company markets and sells its cloud, license, hardware, support, and services offerings directly to businesses in various industries, government agencies, and educational institutions, as well as through indirect channels. Oracle Corporation was founded in 1977 and is headquartered in Austin, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:42:48"},{"Company Name":"Mastercard Incorporated","Symbol":"MA","Current Price":"587.86","Latest MA":"541.65","Latest MA 5":588.5179960938,"Latest MA 9":586.1499921332,"Latest MA 20":581.2729957275,"RSI":59.323851483,"Price Target":621.28265,"Difference from MA":"8.53%","Difference from Open":"-0.27%","Change from Yesterday":"-0.49%","Change from Last Report":"0.04","Latest Volume":"793,658","Market Cap":"533,825,060,864","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":35.88889,"PB Ratio":80.18824,"Previous Close":590.74,"ROE":1.8770399,"DTE":280.795,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.052,"Trailing PEG":2.3696,"Trailing PE":41.282303,"Trailing PS":41.282303,"Quick Ratio":0.665,"Day High":590.67,"Day Low":584.56,"VS Average Volume":0.2919956866,"Company Summary":"Mastercard Incorporated, a technology company, provides transaction processing and other payment-related products and services in the United States and internationally. The company offers integrated products and value-added services for account holders, merchants, financial institutions, digital partners, businesses, governments, and other organizations, such as programs that enable issuers to provide consumers with credits to defer payments; payment products and solutions that allow its customers to access funds in deposit and other accounts; prepaid programs services; consumer bill payment services; and commercial credit, debit, and prepaid payment products and solutions. It also provides solutions that enable businesses or governments to make payments to businesses, including Virtual Card Number, which is generated dynamically from a physical card and leverages the credit limit of the funding account; and a platform to optimize supplier payment enablement campaigns for financial institutions. In addition, the company offers Mastercard Move, which partners with digital messaging and payment platforms to enable consumers to send money directly within applications to other consumers; and partners with central banks, fintechs and financial institutions to help governments and nonprofits, as well as enables various cross-border payment flows. Further, it provides security solutions; personalization, issuer and merchant loyalty, and marketing services; advanced analytics, business intelligence, economic and location-based insights, payments consulting, and operational insights services; processing and gateway solutions; and open banking services. The company offers payment solutions and services under the MasterCard, Maestro, and Cirrus names. Mastercard Incorporated was founded in 1966 and is headquartered in Purchase, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:42:48"},{"Company Name":"Merck & Company, Inc.","Symbol":"MRK","Current Price":"81.78","Latest MA":"89.77","Latest MA 5":80.3510002441,"Latest MA 9":79.0038888889,"Latest MA 20":77.8247499542,"RSI":69.6275594787,"Price Target":101.78708,"Difference from MA":"-8.89%","Difference from Open":"1.99%","Change from Yesterday":"1.82%","Change from Last Report":"0.02","Latest Volume":"5,381,873","Market Cap":"205,364,592,640","Earning Date":"29-07-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":8.700533,"PB Ratio":4.2574186,"Previous Close":80.32,"ROE":0.39293,"DTE":71.992,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.441,"Trailing PEG":0.7364,"Trailing PE":11.887355,"Trailing PS":11.887355,"Quick Ratio":0.827,"Day High":81.94,"Day Low":80.07,"VS Average Volume":0.3323818868,"Company Summary":"Merck & Co., Inc. operates as a healthcare company worldwide. It operates through two segments, Pharmaceutical and Animal Health. The company offers human health pharmaceutical for various areas, including oncology, vaccines, hospital acute care, cardiovascular, virology, neuroscience, and diabetes under the Keytruda, Welireg, Gardasil, ProQuad, M-M-R II, Varivax, Vaxneuvance, RotaTeq, Pneumovax 23, Bridion, Dificid, Zerbaxa, Noxafil, Winrevair, Adempas, Verquvo, Lagevrio, Isentress\/Isentress HD, Delstrigo, Pifeltro, Belsomra, Januvia, and Janumet brands. It also provides veterinary pharmaceuticals, vaccines and health management solutions and services, such as livestock products under the Nuflor, Bovilis\/Vista, Bovilis Cryptium, Banamine, Estrumate, Matrix, Resflor, Zuprevo, Revalor, Safe-Guard, M+Pac, Porcilis, Circumvent, Nobilis\/Innovax, Paracox and Coccivac, Exzolt, Slice, Imvixa, Clynav, Aquavac\/Norvax, Aquaflor, Flexolt brands; Allflex Livestock Intelligence solutions for animal identification, monitoring and traceability; and companion animal products under the Bravecto One-Month, Bravecto Injectable\/Quantum, Bravecto Plus, Sentinel Spectrum, Sentinel Flavor Tabs, Optimmune, Nobivac NXT, GilvetMab, Otomax, Mometamax, Mometamax Ultra, Posatex, Caninsulin\/Vetsulin, Panacur, Regumate, Prestige, Scalibor\/Exspot, Sure Petcare, and Home Again brands. The company has development and commercialization agreement for three of Daiichi Sankyo's deruxtecan ADC candidates; AstraZeneca PLC to co-development and co-commercialize AstraZeneca's Lynparza products for multiple cancer types, and Koselugo for multiple indications; licensed to develop, manufacture and commercialize LM-299, a novel investigational PD-1\/VEGF bispecific antibody from LaNova; and collaboration agreement with Eisai Co., Ltd., Bayer AG, and Ridgeback Biotherapeutics LP, as well Moderna, Inc. It has a collaboration agreement with Antengene Corporation Limited to evaluate the combination of ATG-022, a CLDN18.2-targeting antibody-drug conjugate, and anti-PD-1 therapy, as well as KEYTRUDA (pembrolizumab) in patients with advanced solid tumors. Merck & Co., Inc. was founded in 1891 and is headquartered in Rahway, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:42:48"},{"Company Name":"S&P Global Inc.","Symbol":"SPGI","Current Price":"507.22","Latest MA":"503.49","Latest MA 5":513.8959897461,"Latest MA 9":513.896663954,"Latest MA 20":514.6546599731,"RSI":35.625404727,"Price Target":585.96564,"Difference from MA":"0.74%","Difference from Open":"-0.63%","Change from Yesterday":"-1.32%","Change from Last Report":"-0.12","Latest Volume":"627,193","Market Cap":"155,555,758,080","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":30.173708,"PB Ratio":4.6616488,"Previous Close":513.98,"ROE":0.11241,"DTE":31.875,"Industry":"Financial Data & Stock Exchanges","Sector":"Financial Services","Beta":1.195,"Trailing PEG":2.2353,"Trailing PE":39.78196,"Trailing PS":39.78196,"Quick Ratio":0.769,"Day High":509.23,"Day Low":497.17,"VS Average Volume":0.4890782737,"Company Summary":"S&P Global Inc., together with its subsidiaries, provides credit ratings, benchmarks, analytics, and workflow solutions in the global capital, commodity, and automotive markets. It operates through five segments: S&P Global Market Intelligence, S&P Global Ratings, S&P Global Commodity Insights, S&P Global Mobility, and S&P Dow Jones Indices. The S&P Global Market Intelligence segment provides multi-asset-class data and analytics integrated with purpose-built workflow solutions. This segment offers Desktop, a product suite that provides data, analytics, and third-party research for global finance and corporate professionals; data and advisory solutions for research, reference data, market data, derived analytics, and valuation services; enterprise solutions, such as software and workflow solutions; and credit and risk solutions for selling ratings' credit ratings and related data and research, analytics, and financial risk solutions. The S&P Global Ratings segment operates as an independent provider of credit ratings, research, and analytics offering investors and other market participants information, ratings, and benchmarks. The S&P Global Commodity Insights segment provides information and benchmark prices for the commodity and energy markets. The S&P Global Mobility segment offers solutions serving the full automotive value chain, including vehicle manufacturers (original equipment manufacturers), automotive suppliers, mobility service providers, retailers, consumers, and finance and insurance companies. The S&P Dow Jones Indices segment operates as an index provider that maintains various valuation and index benchmarks for investment advisors, wealth managers, and institutional investors. It has operations in the United States, European region, Asia, and internationally. S&P Global Inc. was founded in 1860 and is headquartered in New York, New York.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:42:48"},{"Company Name":"Boeing Company (The)","Symbol":"BA","Current Price":"204.46","Latest MA":"173.82","Latest MA 5":212.4989986572,"Latest MA 9":212.0438874647,"Latest MA 20":208.0192503967,"RSI":40.1875882015,"Price Target":216.5274,"Difference from MA":"17.62%","Difference from Open":"1.13%","Change from Yesterday":"-4.46%","Change from Last Report":"-0.40","Latest Volume":"25,469,955","Market Cap":"154,160,300,032","Earning Date":"23-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":435.01065,"PB Ratio":-46.246326,"Previous Close":214.0,"ROE":null,"DTE":null,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.418,"Trailing PEG":null,"Trailing PE":null,"Trailing PS":null,"Quick Ratio":0.348,"Day High":206.32,"Day Low":201.28,"VS Average Volume":2.8146041192,"Company Summary":"The Boeing Company, together with its subsidiaries, designs, develops, manufactures, sells, services, and supports commercial jetliners, military aircraft, satellites, missile defense, human space flight and launch systems, and services worldwide. The company operates through three segments: Commercial Airplanes; Defense, Space & Security; and Global Services. The Commercial Airplanes segment develops, produces, and markets commercial jet aircraft for passenger and cargo requirements. The Defense, Space & Security segment engages in the research, development, production, and modification of manned and unmanned military aircraft and weapons systems; strategic defense and intelligence systems, which include strategic missile and defense systems, command, control, communications, computers, intelligence, surveillance and reconnaissance, cyber and information solutions, and intelligence systems; and satellite systems, such as government and commercial satellites, and space exploration. The Global Services segment offers products and services, including supply chain and logistics management, engineering, maintenance and modifications, upgrades and conversions, spare parts, pilot and maintenance training systems and services, technical and maintenance documents, and data analytics and digital services to commercial and defense customers. The Boeing Company was incorporated in 1916 and is based in Arlington, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:42:48"},{"Company Name":"KLA Corporation","Symbol":"KLAC","Current Price":"874.50","Latest MA":"700.15","Latest MA 5":848.0750009766,"Latest MA 9":816.9538918728,"Latest MA 20":796.2124666748,"RSI":85.0027689798,"Price Target":792.65845,"Difference from MA":"24.90%","Difference from Open":"0.92%","Change from Yesterday":"0.29%","Change from Last Report":"-0.13","Latest Volume":"492,309","Market Cap":"115,644,096,512","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":26.645185,"PB Ratio":28.876469,"Previous Close":872.0,"ROE":1.04097,"DTE":152.049,"Industry":"Semiconductor Equipment & Materials","Sector":"Technology","Beta":1.386,"Trailing PEG":1.6383,"Trailing PE":31.834547,"Trailing PS":31.834547,"Quick Ratio":1.608,"Day High":879.155,"Day Low":866.5,"VS Average Volume":0.3967674081,"Company Summary":"KLA Corporation, together with its subsidiaries, engages in the design, manufacture, and marketing of process control, process-enabling, and yield management solutions for the semiconductor and related electronics industries worldwide. It operates through three segments: Semiconductor Process Control; Specialty Semiconductor Process; and PCB and Component Inspection. The company offers inspection and review tools to identify, locate, characterize, review, and analyze defects on various surfaces of patterned and unpatterned wafers; metrology systems that are used to measure pattern dimensions, film thickness, film stress, layer-to-layer alignment, pattern placement, surface topography, and electro-optical properties for wafers; chemical process control equipment; wired and wireless sensor wafers and reticles; wafer defect inspection, review, and metrology systems; reticle inspection and metrology systems; and semiconductor software solutions that provide run-time process control, defect excursion identification, process corrections, and defect classification to accelerate yield learning rates and reduce production risk. It also provides etch, plasma dicing, deposition, and other wafer processing technologies and solutions for the semiconductor and microelectronics industry. In addition, the company offers direct imaging, inspection, optical shaping, inkjet and additive printing, UV laser drilling, and computer-aided manufacturing and engineering solutions for the PCB market; inspection and electrical testing systems to identify and classify defects, as well as systems to repair defects for the display market; and inspection and metrology systems for quality control and yield improvement in advanced and traditional semiconductor packaging markets. The company was formerly known as KLA-Tencor Corporation and changed its name to KLA Corporation in July 2019. KLA Corporation was incorporated in 1975 and is headquartered in Milpitas, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:42:48"},{"Company Name":"Southern Company (The)","Symbol":"SO","Current Price":"89.83","Latest MA":"86.43","Latest MA 5":89.0890016479,"Latest MA 9":89.0716672431,"Latest MA 20":89.0803051453,"RSI":59.7414727604,"Price Target":92.76167,"Difference from MA":"3.94%","Difference from Open":"-0.02%","Change from Yesterday":"0.32%","Change from Last Report":"0.15","Latest Volume":"3,635,975","Market Cap":"98,835,562,496","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":20.795137,"PB Ratio":2.9177628,"Previous Close":89.55,"ROE":0.12244,"DTE":188.378,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.367,"Trailing PEG":3.822,"Trailing PE":21.543165,"Trailing PS":21.543165,"Quick Ratio":0.479,"Day High":91.05,"Day Low":89.42,"VS Average Volume":0.7395091586,"Company Summary":"The Southern Company, through its subsidiaries, engages in the generation, transmission, and distribution of electricity. The company develops, constructs, acquires, owns, and manages power generation assets, including renewable energy projects and sells electricity in the wholesale market; distributes natural gas in Illinois, Georgia, Virginia, and Tennessee; operates, constructs, and maintains approximately 78,500 miles of natural gas pipelines and 14 storage facilities; and provides gas marketing services, as well as electric services to retail customers. It also offers distributed energy and resilience solutions, and digital wireless communications and fiber optics services, as well as deploys microgrids for commercial, industrial, governmental, utility customers. The Southern Company was incorporated in 1946 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"12-06-2025 20:42:48"},{"Company Name":"Elevance Health, Inc.","Symbol":"ELV","Current Price":"383.89","Latest MA":"398.68","Latest MA 5":385.6557089844,"Latest MA 9":382.4815618218,"Latest MA 20":385.4159078369,"RSI":48.8346296469,"Price Target":500.7542,"Difference from MA":"-3.71%","Difference from Open":"0.98%","Change from Yesterday":"0.78%","Change from Last Report":"-0.22","Latest Volume":"402,218","Market Cap":"86,735,314,944","Earning Date":"22-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":10.984119,"PB Ratio":2.0380378,"Previous Close":380.93,"ROE":0.14175001,"DTE":70.397,"Industry":"Healthcare Plans","Sector":"Healthcare","Beta":0.617,"Trailing PEG":0.688,"Trailing PE":14.931739,"Trailing PS":14.931739,"Quick Ratio":1.303,"Day High":384.82,"Day Low":376.69,"VS Average Volume":0.2239497466,"Company Summary":"Elevance Health, Inc., together with its subsidiaries, operates as a health benefits company in the United States. It operates in four segments: Health Benefits, CarelonRx, Carelon Services, and Corporate & Other. The company offers a variety of health plans and services to individual, employer group risk-based and fee-based, BlueCard, Medicare, Medicaid, and FEP members; health products; a broad array of fee-based administrative managed care services; and specialty and other insurance products and services, such as stop loss, dental, vision, and supplemental health insurance benefits. It also operates in the pharmacy services business; and markets and offers pharmacy services, including home delivery and specialty pharmacies, claims adjudication, formulary management, pharmacy networks, rebate administration, a prescription drug database, and member services, as well as infusion services and injectable therapies through ambulatory infusion centers. In addition, the company provides healthcare related services and capabilities, including specialty care enablement and utilization management support for specialized clinical domains; behavioral health and comprehensive care management services; palliative care services and management; virtual care; and payment integrity, subrogation, clinical data exchange through its HealthOS platform, research and data, reporting and clinical analytics, information technology, and business process support services, as well as manages home health, post-acute institutional management, and durable medical equipment costs; and supports plans in managing home and community-based services. It provides its services under the Anthem Blue Cross and Blue Shield, Wellpoint, and Carelon brands. The company was formerly known as Anthem, Inc. and changed its name to Elevance Health, Inc. in June 2022. Elevance Health, Inc. was incorporated in 2001 and is headquartered in Indianapolis, Indiana.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:42:48"},{"Company Name":"Fortinet, Inc.","Symbol":"FTNT","Current Price":"102.61","Latest MA":"99.34","Latest MA 5":102.6559996338,"Latest MA 9":102.6388888211,"Latest MA 20":103.1564998322,"RSI":49.1879159988,"Price Target":108.51,"Difference from MA":"3.29%","Difference from Open":"0.76%","Change from Yesterday":"0.58%","Change from Last Report":"-0.08","Latest Volume":"1,121,861","Market Cap":"78,539,333,632","Earning Date":"07-05-2025","Earning Time":"Before","Earning Day of Week":"Saturday","PE Ratio":42.576763,"PB Ratio":40.20768,"Previous Close":102.02,"ROE":2.05906,"DTE":54.842,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.072,"Trailing PEG":2.8485,"Trailing PE":42.226337,"Trailing PS":42.226337,"Quick Ratio":1.259,"Day High":102.79,"Day Low":101.7,"VS Average Volume":0.2179088492,"Company Summary":"Fortinet, Inc. provides cybersecurity and convergence of networking and security solutions worldwide. The company offers secure networking solutions that focus on the convergence of networking and security; network firewall solutions, which consist of FortiGate data centers, hyperscale, and distributed firewalls, as well as encrypted applications; wireless local area network (LAN) solutions; and secure connectivity solutions, including FortiSwitch secure ethernet switches, FortiAP wireless LAN access points, and FortiExtender 5G connectivity gateways. It also provides the Fortinet Unified Secure Access Service Edge (SASE) solutions that include firewall, software-defined wide-area network, secure web gateway, cloud access services broker, data loss prevention, and zero trust network access; and web application firewalls, cloud network security with virtualized firewalls, cloud-native firewalls, cloud-native application protection, and code security. In addition the company offers artificial intelligence-driven security operation solutions, which provides a suite of cybersecurity solutions that identify, protect, detect, respond, and recover from threats, as well as FortiEDR, FortiXDR, FortiNDR, FortiSandbox, FortiDeceptor, FortiDLP, and FortiRecon that helps organizations ensuring attackers face multiple layers of detection and mitigation across endpoints, networks, and applications. Further, it offers FortiGuard application security, content security, device security, NOC\/SOC security, and web security services; FortiCare technical support services; and training and certification programs, as well as operates FortiGuard Lab, a cybersecurity threat intelligence and research organization. The company serves large enterprises, communication service providers, government organizations, and small to medium-sized enterprises. Fortinet, Inc. was incorporated in 2000 and is headquartered in Sunnyvale, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"12-06-2025 20:42:48"},{"Company Name":"Apollo Global Management, Inc. ","Symbol":"APO","Current Price":"137.33","Latest MA":"149.73","Latest MA 5":135.5879970703,"Latest MA 9":133.3488886176,"Latest MA 20":134.4394988098,"RSI":66.6122058875,"Price Target":156.88235,"Difference from MA":"-8.28%","Difference from Open":"0.90%","Change from Yesterday":"-0.51%","Change from Last Report":"-0.01","Latest Volume":"966,522","Market Cap":"78,483,275,776","Earning Date":"02-05-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":16.194576,"PB Ratio":4.7254148,"Previous Close":138.03,"ROE":0.18686001,"DTE":90.49,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.571,"Trailing PEG":null,"Trailing PE":23.96684,"Trailing PS":23.96684,"Quick Ratio":1.68,"Day High":137.68,"Day Low":136.0,"VS Average Volume":0.2424796638,"Company Summary":"Apollo Global Management, Inc. is a private equity firm specializing in investments in credit, private equity, infrastructure, secondaries and real estate markets. The firm prefers to invest in private and public markets. The firm's private equity investments include traditional buyouts, recapitalization, distressed buyouts and debt investments in real estate, corporate partner buyouts, distressed asset, corporate carve-outs, middle market, growth, venture capital, turnaround, bridge, corporate restructuring, special situation, acquisition, and industry consolidation transactions. For credit strategies, the firm focuses to invest in multi-sector credit, semi-liquid credit, direct lending, first lien, unitranche, whole loans and private credit. The firm provides its services to endowment and sovereign wealth funds, as well as other institutional and individual investors. It manages client focused portfolios. The firm launches and manages hedge funds for its clients. It also manages real estate funds and private equity funds for its clients. The firm invests in the fixed income and alternative investment markets across the globe. Its fixed income investments include income-oriented senior loans, bonds, collateralized loan obligations, structured credit, opportunistic credit, non-performing loans, distressed debt, mezzanine debt, and value oriented fixed income securities. The firm seeks to invest in chemicals, commodities, consumer and retail, oil and gas, metals, mining, agriculture, commodities, distribution and transportation, financial and business services, manufacturing and industrial, media distribution, cable, entertainment and leisure, telecom, technology, natural resources, energy, packaging and materials, and satellite and wireless industries. It also focuses on clean energy, sustainable industry, climate solutions, energy transition, industrial decarbonization, sustainable mobility, sustainable resource use, and sustainable real estate. It seeks to invest in companies based in across Africa, Asia, North America with a focus on United States, Western Europe and Europe. It employs a combination of contrarian, value, and distressed strategies to make its investments. The firm seeks to make investments in the range of $75 million and $1500 million. The firm seeks to invest in companies with Enterprise value between $750 million to $2500 million. The firm conducts in-house research to create its investment portfolio. It seeks to acquire minority and majority positions in its portfolio companies. Apollo Global Management, Inc. was founded in 1990 and is headquartered in New York, New York with additional offices in North America, Asia, Africa and Europe.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:42:48"},{"Company Name":"Republic Services, Inc.","Symbol":"RSG","Current Price":"250.80","Latest MA":"227.77","Latest MA 5":249.8800012207,"Latest MA 9":252.3566670736,"Latest MA 20":252.1645010376,"RSI":47.2823127747,"Price Target":259.01456,"Difference from MA":"10.11%","Difference from Open":"0.67%","Change from Yesterday":"1.03%","Change from Last Report":"0.18","Latest Volume":"506,424","Market Cap":"78,374,248,448","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":36.828194,"PB Ratio":6.709291,"Previous Close":248.24,"ROE":0.18545,"DTE":115.988,"Industry":"Waste Management","Sector":"Industrials","Beta":0.644,"Trailing PEG":3.9205,"Trailing PE":37.828053,"Trailing PS":37.828053,"Quick Ratio":0.59,"Day High":250.8,"Day Low":248.46,"VS Average Volume":0.3534017493,"Company Summary":"Republic Services, Inc., together with its subsidiaries, offers environmental services in the United States and Canada. It is involved in the collection and processing of recyclable, solid waste, and industrial waste materials; transportation and disposal of non-hazardous and hazardous waste streams; and other environmental solutions. Its residential collection services include curbside collection of material for transport to transfer stations, landfills, recycling centers, and organics processing facilities; supply of recycling and waste containers; and renting of compactors. The company also engages in the processing and sale of old corrugated containers, old newsprint, aluminum, glass, and other materials; and provision of landfill services. It serves small-container, large-container, and residential customers. The company was incorporated in 1996 and is based in Phoenix, Arizona.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:42:48"},{"Company Name":"Air Products and Chemicals, Inc","Symbol":"APD","Current Price":"283.45","Latest MA":"295.90","Latest MA 5":281.448001709,"Latest MA 9":280.6288913303,"Latest MA 20":276.9580026245,"RSI":65.7431504774,"Price Target":317.93304,"Difference from MA":"-4.21%","Difference from Open":"0.95%","Change from Yesterday":"0.44%","Change from Last Report":"0.03","Latest Volume":"269,479","Market Cap":"63,080,099,840","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":20.003529,"PB Ratio":4.290147,"Previous Close":282.21,"ROE":0.095790006,"DTE":98.527,"Industry":"Specialty Chemicals","Sector":"Basic Materials","Beta":0.873,"Trailing PEG":6.852,"Trailing PE":40.84294,"Trailing PS":40.84294,"Quick Ratio":0.77,"Day High":284.1,"Day Low":279.14,"VS Average Volume":0.2136832991,"Company Summary":"Air Products and Chemicals, Inc. provides atmospheric gases, process and specialty gases, equipment, and related services in the Americas, Asia, Europe, the Middle East, India, and internationally. The company produces atmospheric gases, including oxygen, nitrogen, and argon; process gases, such as hydrogen, helium, carbon dioxide, carbon monoxide, and syngas; and specialty gases for customers in various industries, including refining, chemical, manufacturing, electronics, energy production, medical, food, and metals. It also designs and manufactures equipment for air separation, hydrocarbon recovery and purification, natural gas liquefaction, and liquid helium and liquid hydrogen transport and storage. The company was founded in 1940 and is headquartered in Allentown, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:42:48"},{"Company Name":"Coinbase Global, Inc.","Symbol":"COIN","Current Price":"244.22","Latest MA":"247.03","Latest MA 5":251.5480008545,"Latest MA 9":251.5077784559,"Latest MA 20":255.5044989929,"RSI":42.5266380699,"Price Target":260.29715,"Difference from MA":"-1.14%","Difference from Open":"-1.03%","Change from Yesterday":"-2.58%","Change from Last Report":"0.04","Latest Volume":"4,019,874","Market Cap":"62,204,051,456","Earning Date":"08-05-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":68.408966,"PB Ratio":5.9394913,"Previous Close":250.68,"ROE":0.15841,"DTE":43.892,"Industry":"Financial Data & Stock Exchanges","Sector":"Financial Services","Beta":3.62,"Trailing PEG":70.976,"Trailing PE":45.992466,"Trailing PS":45.992466,"Quick Ratio":1.197,"Day High":247.7125,"Day Low":242.65,"VS Average Volume":0.3853303401,"Company Summary":"Coinbase Global, Inc. operates platform for crypto assets in the United States and internationally. It offers the primary financial account in the crypto economy for consumers; a brokerage platform with a pool of liquidity across the crypto marketplace for institutions; and a suite of products granting access to build onchain for developers. The company was founded in 2012 and is based in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:42:48"},{"Company Name":"Axon Enterprise, Inc.","Symbol":"AXON","Current Price":"777.98","Latest MA":"617.49","Latest MA 5":778.928984375,"Latest MA 9":775.6272135417,"Latest MA 20":754.7757458496,"RSI":62.0395272499,"Price Target":721.31573,"Difference from MA":"25.99%","Difference from Open":"0.62%","Change from Yesterday":"-0.05%","Change from Last Report":"-0.02","Latest Volume":"122,871","Market Cap":"60,565,975,040","Earning Date":"07-05-2025","Earning Time":"Before","Earning Day of Week":"Saturday","PE Ratio":125.479836,"PB Ratio":23.696352,"Previous Close":778.36,"ROE":0.15166001,"DTE":80.08,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.285,"Trailing PEG":null,"Trailing PE":188.37166,"Trailing PS":188.37166,"Quick Ratio":2.5,"Day High":781.0,"Day Low":773.16,"VS Average Volume":0.1995303678,"Company Summary":"Axon Enterprise, Inc. develops, manufactures, and sells conducted energy devices (CEDs) under the TASER brand in the United States and internationally. It operates through two segments, Software and Sensors, and TASER. The company also offers hardware and cloud-based software solutions that enable law enforcement to capture, securely store, manage, share, and analyze video and other digital evidence. Its products include axon officer safety plan; taser 10, taser7, taser X26P, taser X2, taser 7 CQ, and civilian series; cameras, such as axon body, axon flex, axon fleet, axon air, axon signal sidearm, axon signal vehicle, axon interview, and axon interview portable kit; software, including axon records, evidence, standards, commander, performance, auto-transcribe, justice, investigate, respond, and justice, my90, and redaction assistant; mobile applications, and training services, as well as hardware extended warranties; and Axon docks, cartridges, and batteries. The company sells its products through its direct sales, distribution partners, online store, and third-party resellers. Axon Enterprise, Inc. has a strategic partnership with Fusus, Inc. to expand bility to aggregate live video, data, and sensor feeds. It serves law enforcement, federal, correction, fire, EMS, campus, justice healthcare, retail, private security, and personal safety industries. The company was formerly known as TASER International, Inc. and changed its name to Axon Enterprise, Inc. in April 2017. Axon Enterprise, Inc. was incorporated in 1993 and is headquartered in Scottsdale, Arizona.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:42:48"},{"Company Name":"Norfolk Southern Corporation","Symbol":"NSC","Current Price":"251.08","Latest MA":"241.31","Latest MA 5":251.3337823193,"Latest MA 9":249.3587659885,"Latest MA 20":246.0959448169,"RSI":66.2367841739,"Price Target":258.04166,"Difference from MA":"4.05%","Difference from Open":"0.41%","Change from Yesterday":"-0.10%","Change from Last Report":"0.03","Latest Volume":"263,672","Market Cap":"56,604,233,728","Earning Date":"23-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":18.488874,"PB Ratio":3.9008002,"Previous Close":251.33,"ROE":0.24542,"DTE":122.314,"Industry":"Railroads","Sector":"Industrials","Beta":1.31,"Trailing PEG":2.3593,"Trailing PE":17.138493,"Trailing PS":17.138493,"Quick Ratio":0.648,"Day High":251.405,"Day Low":249.315,"VS Average Volume":0.1977533079,"Company Summary":"Norfolk Southern Corporation, together with its subsidiaries, engages in the rail transportation of raw materials, intermediate products, and finished goods in the United States. The company transports agriculture, forest, and consumer products comprising soybeans, wheat, corn, fertilizers, livestock and poultry feed, food products, food oils, flour, sweeteners, ethanol, lumber and wood products, pulp board and paper products, wood fibers, wood pulp, beverages, and canned goods; chemicals consist of sulfur and related chemicals, petroleum products comprising crude oil, chlorine and bleaching compounds, plastics, rubber, industrial chemicals, chemical wastes, sand, and natural gas liquids; metals and construction materials, such as steel, aluminum products, machinery, scrap metals, cement, aggregates, minerals, clay, transportation equipment, and military-related products; and automotive, including finished motor vehicles and automotive parts, as well as coal. It also transports overseas freight through various Atlantic and Gulf Coast ports; and operates an intermodal network. Norfolk Southern Corporation was incorporated in 1980 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:42:48"},{"Company Name":"NXP Semiconductors N.V.","Symbol":"NXPI","Current Price":"218.28","Latest MA":"207.07","Latest MA 5":215.0339998779,"Latest MA 9":209.3177779812,"Latest MA 20":205.1864998474,"RSI":71.4535073832,"Price Target":235.32,"Difference from MA":"5.41%","Difference from Open":"0.86%","Change from Yesterday":"0.40%","Change from Last Report":"-0.36","Latest Volume":"883,307","Market Cap":"55,143,854,080","Earning Date":"21-07-2025","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":16.700842,"PB Ratio":5.9276557,"Previous Close":217.41,"ROE":0.25441998,"DTE":121.164,"Industry":"Semiconductors","Sector":"Technology","Beta":1.39,"Trailing PEG":1.44,"Trailing PE":23.803707,"Trailing PS":23.803707,"Quick Ratio":1.312,"Day High":220.0,"Day Low":216.205,"VS Average Volume":0.2691692843,"Company Summary":"NXP Semiconductors N.V. offers various semiconductor products in China, the United States, Germany, Japan, Singapore, South Korea, Mexico, the Netherlands, Taiwan, and internationally. The company's product portfolio includes microcontrollers; application processors, including i.MX application processors, and i.MX 8 and 9 family of applications processors; communication processors; wireless connectivity solutions, such as near field communications, ultra-wideband, Bluetooth low-energy, Zigbee, Thread, and Wi-Fi and Wi-Fi\/Bluetooth integrated SoCs; analog and interface devices; radio frequency power amplifiers; and security controllers, as well as semiconductor-based environmental and inertial sensors, including pressure, inertial, magnetic, and gyroscopic sensors. Its products are used in various applications, including automotive, industrial and Internet of Things, mobile, and communication infrastructure. The company markets its products to various original equipment manufacturers, contract manufacturers, and distributors. N.V. was incorporated in 2006 and is headquartered in Eindhoven, the Netherlands.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:42:48"},{"Company Name":"American Electric Power Company","Symbol":"AEP","Current Price":"102.58","Latest MA":"99.61","Latest MA 5":101.9190019531,"Latest MA 9":102.136111891,"Latest MA 20":102.4802505951,"RSI":53.8612110186,"Price Target":108.83,"Difference from MA":"2.99%","Difference from Open":"0.52%","Change from Yesterday":"0.63%","Change from Last Report":"0.24","Latest Volume":"828,650","Market Cap":"54,800,396,288","Earning Date":"06-05-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":17.41681,"PB Ratio":2.0051014,"Previous Close":101.94,"ROE":0.10421,"DTE":171.503,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.41,"Trailing PEG":2.3938,"Trailing PE":19.804054,"Trailing PS":19.804054,"Quick Ratio":0.221,"Day High":102.67,"Day Low":101.96,"VS Average Volume":0.2071825967,"Company Summary":"American Electric Power Company, Inc., an electric public utility holding company, engages in the generation, transmission, and distribution of electricity for sale to retail and wholesale customers in the United States. It operates through Vertically Integrated Utilities, Transmission and Distribution Utilities, AEP Transmission Holdco, and Generation & Marketing segments. The company generates electricity using coal and lignite, natural gas, renewable, nuclear, hydro, solar, wind, and other energy sources; owns, operates, maintains, and invests in transmission infrastructure; and engages in wholesale energy trading and marketing business. It operates approximately 225,000 circuit miles of distribution lines that delivers electricity to 5.6 million customers; 40,000 circuit miles of transmission lines; and 23,000 MWs of regulated owned generating capacity. American Electric Power Company, Inc. was incorporated in 1906 and is headquartered in Columbus, Ohio.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"12-06-2025 20:42:48"},{"Company Name":"Allstate Corporation (The)","Symbol":"ALL","Current Price":"199.53","Latest MA":"195.67","Latest MA 5":199.9869976807,"Latest MA 9":203.6944959852,"Latest MA 20":204.7304606628,"RSI":41.0061310138,"Price Target":227.58824,"Difference from MA":"1.97%","Difference from Open":"1.71%","Change from Yesterday":"1.71%","Change from Last Report":"0.14","Latest Volume":"421,788","Market Cap":"52,837,810,176","Earning Date":"30-07-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":10.48476,"PB Ratio":2.6366036,"Previous Close":196.18,"ROE":0.19723,"DTE":36.672,"Industry":"Insurance - Property & Casualty","Sector":"Financial Services","Beta":0.345,"Trailing PEG":2.0457,"Trailing PE":13.6287565,"Trailing PS":13.6287565,"Quick Ratio":0.244,"Day High":199.54,"Day Low":196.17,"VS Average Volume":0.2520540479,"Company Summary":"The Allstate Corporation, together with its subsidiaries, provides property and casualty, and other insurance products in the United States and Canada. It operates in five segments: Allstate Protection; Run-off Property-Liability; Protection Services; Allstate Health and Benefits; and Corporate and Other. The company offers private passenger auto, homeowners, personal lines, and commercial insurance products through agents, contact centers, and online; and property and casualty insurance products. It also provides consumer product protection plans, device and mobile data collection services, and analytic solutions using automotive telematics information, roadside assistance, and protection plans; and insurance products, such as identity protection and restoration through Allstate Protection Plans, Allstate Dealer Services, Allstate Roadside, Arity, and Allstate Identity Protection brands. In addition, the company offers life, accident, critical illness, hospital indemnity, short-term disability, and other health insurance products; self-funded stop-loss and fully insured group health products to employers; medicare supplement, ancillary products, and short-term medical insurance to individuals through independent agents, owned agencies, benefits brokers, and Allstate exclusive agents. Further, it offers automotive protection; vehicle service contracts, guaranteed asset protection, road hazard tires and wheels, and paintless dent repair protection; and roadside assistance, mobility data collection services, and analytic solutions using automotive telematics information, identity theft protection, and remediation services. The Allstate Corporation was founded in 1931 and is headquartered in Northbrook, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:42:48"},{"Company Name":"Realty Income Corporation","Symbol":"O","Current Price":"57.81","Latest MA":"54.83","Latest MA 5":57.1459996338,"Latest MA 9":56.6744442579,"Latest MA 20":56.109398201,"RSI":76.1284519122,"Price Target":61.83333,"Difference from MA":"5.43%","Difference from Open":"0.03%","Change from Yesterday":"0.09%","Change from Last Report":"0.33","Latest Volume":"1,927,433","Market Cap":"52,207,054,848","Earning Date":"05-05-2025","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":36.35849,"PB Ratio":1.3375442,"Previous Close":57.76,"ROE":0.02507,"DTE":69.956,"Industry":"REIT - Retail","Sector":"Real Estate","Beta":0.766,"Trailing PEG":5.7512,"Trailing PE":52.554546,"Trailing PS":52.554546,"Quick Ratio":0.892,"Day High":58.1191,"Day Low":57.535,"VS Average Volume":0.3345604738,"Company Summary":"Realty Income (NYSE: O), an S&P 500 company, is real estate partner to the world's leading companies. Founded in 1969, we invest in diversified commercial real estate and, as of March 31, 2025, have a portfolio of over 15,600 properties in all 50 U.S. states, the U.K., and six other countries in Europe. We are known as \"The Monthly Dividend Company\" and have a mission to invest in people and places to deliver dependable monthly dividends that increase over time. Since our founding, we have declared 658 consecutive monthly dividends and are a member of the S&P 500 Dividend Aristocrats index for having increased our dividend for over 30 consecutive years.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:42:48"},{"Company Name":"Fastenal Company","Symbol":"FAST","Current Price":"43.08","Latest MA":"38.85","Latest MA 5":42.5270010376,"Latest MA 9":41.8838894314,"Latest MA 20":41.4850003815,"RSI":76.9243722296,"Price Target":38.10091,"Difference from MA":"10.86%","Difference from Open":"1.40%","Change from Yesterday":"1.00%","Change from Last Report":"0.16","Latest Volume":"1,907,626","Market Cap":"49,417,359,360","Earning Date":"14-07-2025","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":19.66895,"PB Ratio":13.389805,"Previous Close":42.65,"ROE":0.32351002,"DTE":13.435,"Industry":"Industrial Distribution","Sector":"Industrials","Beta":0.968,"Trailing PEG":3.895,"Trailing PE":43.075,"Trailing PS":43.075,"Quick Ratio":1.924,"Day High":43.1,"Day Low":42.28,"VS Average Volume":0.2791261113,"Company Summary":"Fastenal Company, together with its subsidiaries, engages in the wholesale distribution of industrial and construction supplies in the United States, Canada, Mexico, and internationally. It offers fasteners, and related industrial and construction supplies under the Fastenal name. The company's fastener products include threaded fasteners, bolts, nuts, screws, studs, and related washers that are used in manufactured products and construction projects, as well as in the maintenance and repair of machines. It also offers miscellaneous supplies and hardware, including pins, machinery keys, concrete anchors, metal framing systems, wire ropes, strut products, rivets, and related accessories. The company serves the manufacturing market comprising original equipment manufacturers; maintenance, repair, and operations customers; non-residential construction market; farmers, truckers, railroads, mining companies, schools, and retail trades; and oil exploration, production, and refinement companies, as well as federal, state, and local governmental entities. Fastenal Company was founded in 1967 and is headquartered in Winona, Minnesota.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"12-06-2025 20:42:48"},{"Company Name":"PACCAR Inc.","Symbol":"PCAR","Current Price":"93.64","Latest MA":"101.64","Latest MA 5":94.0459992676,"Latest MA 9":93.3999982029,"Latest MA 20":94.2924995728,"RSI":49.1498806077,"Price Target":101.13263,"Difference from MA":"-7.87%","Difference from Open":"0.59%","Change from Yesterday":"-0.26%","Change from Last Report":"0.07","Latest Volume":"625,362","Market Cap":"49,157,160,960","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":12.06701,"PB Ratio":2.7276433,"Previous Close":93.88,"ROE":0.19899,"DTE":87.159,"Industry":"Farm & Heavy Construction Machinery","Sector":"Industrials","Beta":0.954,"Trailing PEG":2.2841,"Trailing PE":14.209408,"Trailing PS":14.209408,"Quick Ratio":4.786,"Day High":93.67,"Day Low":92.39,"VS Average Volume":0.2032469487,"Company Summary":"PACCAR Inc designs, manufactures, and distributes light, medium, and heavy-duty commercial trucks in the United States, Canada, Europe, Mexico, South America, Australia, and internationally. It operates through three segments: Truck, Parts, and Financial Services. The Truck segment designs, manufactures, and distributes trucks for the over-the-road and off-highway hauling of commercial and consumer goods. It sells its trucks through a network of independent dealers under the Kenworth, Peterbilt, and DAF nameplates. The Parts segment distributes aftermarket parts for trucks and related commercial vehicles. The Financial Services segment conducts full-service leasing operations under the PacLease trade name, as well as provides finance and leasing products and services to customers and dealers. This segment offers equipment financing and administrative support services for its franchisees; retail loan and leasing services for small, medium, and large commercial trucking companies, as well as independent owners\/operators and other businesses; and truck inventory financing services to independent dealers. In addition, this segment offers loans and leases directly to customers for the acquisition of trucks and related equipment. The company manufactures and markets industrial winches under the Braden, Carco, and Gearmatic nameplates. PACCAR Inc was founded in 1905 and is headquartered in Bellevue, Washington.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:42:48"},{"Company Name":"United Rentals, Inc.","Symbol":"URI","Current Price":"716.97","Latest MA":"706.94","Latest MA 5":713.3030097656,"Latest MA 9":706.2561208767,"Latest MA 20":709.3682481689,"RSI":61.2599707495,"Price Target":767.706,"Difference from MA":"1.42%","Difference from Open":"0.95%","Change from Yesterday":"-0.41%","Change from Last Report":"0.16","Latest Volume":"158,906","Market Cap":"46,602,010,624","Earning Date":"23-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":15.30015,"PB Ratio":5.3022113,"Previous Close":719.95,"ROE":0.30173,"DTE":159.21,"Industry":"Rental & Leasing Services","Sector":"Industrials","Beta":1.705,"Trailing PEG":1.4818,"Trailing PE":18.579037,"Trailing PS":18.579037,"Quick Ratio":0.749,"Day High":717.6399,"Day Low":704.51,"VS Average Volume":0.2482828662,"Company Summary":"United Rentals, Inc., through its subsidiaries, operates as an equipment rental company. It operates in two segments, General Rentals and Specialty. The General Rentals segment rents general construction and industrial equipment includes backhoes, skid-steer loaders, forklifts, earthmoving equipment, and material handling equipment; aerial work platforms, such as boom and scissor lifts; and general tools and light equipment comprising pressure washers, water pumps, and power tools for construction and industrial companies, manufacturers, utilities, municipalities, homeowners, and government entities. The specialty segment rents trench safety equipment consists of trench shields, aluminum hydraulic shoring systems, slide rails, crossing plates, construction lasers, and line testing equipment for underground work; power and heating, ventilating, and air conditioning equipment, such as portable diesel generators, electrical distribution equipment, and temperature control equipment; fluid solutions equipment for fluid containment, transfer, and treatment; surface protection mats; and mobile storage equipment and modular office space. This segment serves construction companies involved in infrastructure projects, and municipalities and industrial companies. It also sells aerial lifts, reach forklifts, telehandlers, compressors, and generators; construction consumables, tools, small equipment, and safety supplies; and parts for equipment that is owned by its customers, as well as provides repair and maintenance services. The company sells used equipment through its sales force, brokers, website, at auctions, and directly to manufacturers. The company operates in the United States, Canada, Europe, Australia, and New Zealand. United Rentals, Inc. was incorporated in 1997 and is headquartered in Stamford, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:42:48"},{"Company Name":"Kimberly-Clark Corporation","Symbol":"KMB","Current Price":"133.43","Latest MA":"133.30","Latest MA 5":133.1120009766,"Latest MA 9":135.0335904948,"Latest MA 20":137.7583667603,"RSI":33.5569138754,"Price Target":142.40167,"Difference from MA":"0.10%","Difference from Open":"0.14%","Change from Yesterday":"0.44%","Change from Last Report":"0.11","Latest Volume":"676,949","Market Cap":"44,274,204,672","Earning Date":"22-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":17.487549,"PB Ratio":40.21398,"Previous Close":132.85,"ROE":2.0706,"DTE":595.098,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":0.398,"Trailing PEG":5.8543,"Trailing PE":18.15374,"Trailing PS":18.15374,"Quick Ratio":0.396,"Day High":133.645,"Day Low":132.52,"VS Average Volume":0.2884258389,"Company Summary":"Kimberly-Clark Corporation, together with its subsidiaries, manufactures and markets personal care products in the United States. It operates through three segments: North America, International Personal Care, and International Family Care and Professional. The company North America segment offers disposable diapers, training and youth pants, swimpants, baby wipes, feminine and incontinence care products, reusable underwear, facial and bathroom tissue, paper towels, napkins, wipers, tissue, towels, soaps and sanitizers, and other related products under the Huggies, Pull-Ups, GoodNites, Kotex, Poise, Depend, Kleenex, Scott, Cottonelle, Viva, Wypall, and other brand names. The International Personal Care segment provides baby and child care, adult care and feminine care, including disposable diapers, training and youth pants, swimpants, baby wipes, feminine and incontinence care products, reusable underwear, and other related products under the Huggies, Kotex, Goodfeel, Intimus, Depend and other brand names. The International Family Care and Professional segment offers facial and bathroom tissue, paper towels, napkins, wipers, tissue, towels, soaps and sanitizers, and other related products under the Kleenex, Scott, Viva, Andrex, Scottex, Wypall, and other brand names. It also sells household use products directly to supermarkets, mass merchandisers, drugstores, warehouse clubs, variety and department stores, and other retail outlets, as well as through other distributors and e-commerce; and professional use products directly to distributors, manufacturing, lodging, office building, food service, and public facilities, as well as through e-commerce. Kimberly-Clark Corporation was founded in 1872 and is headquartered in Dallas, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"12-06-2025 20:42:48"},{"Company Name":"Corning Incorporated","Symbol":"GLW","Current Price":"50.65","Latest MA":"47.42","Latest MA 5":50.6619999695,"Latest MA 9":50.6388887193,"Latest MA 20":49.4482123566,"RSI":68.6453926326,"Price Target":52.33077,"Difference from MA":"6.80%","Difference from Open":"1.14%","Change from Yesterday":"0.40%","Change from Last Report":"0.14","Latest Volume":"1,818,163","Market Cap":"43,380,256,768","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":21.926409,"PB Ratio":3.8284204,"Previous Close":50.45,"ROE":0.048660003,"DTE":73.266,"Industry":"Electronic Components","Sector":"Technology","Beta":1.096,"Trailing PEG":0.5001,"Trailing PE":97.403854,"Trailing PS":97.403854,"Quick Ratio":0.753,"Day High":50.79,"Day Low":49.94,"VS Average Volume":0.2967079306,"Company Summary":"Corning Incorporated engages in the optical communications, display technologies, environmental technologies, specialty materials, and life sciences businesses in the United States and internationally. The company's Optical Communications segment provides optical fibers and cables; and hardware and equipment products, such as cable assemblies, fiber optic hardware and connectors, optical components and couplers, closures, network interface devices, and other accessories for the telecommunications industry, businesses, governments, and individuals. Its Display Technologies segment offers glass substrates for flat panel displays, including liquid crystal displays and organic light-emitting diodes that are used in televisions, notebook computers, desktop monitors, tablets, and handheld devices. The company's Specialty Materials segment manufactures products that offer material formulations for glass, glass ceramics, crystals, precision metrology instruments, and software, as well as glass wafers and substrates, tinted sunglasses, and radiation shielding products for various markets comprising mobile consumer electronics, semiconductor equipment optics and consumables, aerospace and defense optics, radiation shielding products, sunglasses, and telecommunications components. Its Environmental Technologies segment provides ceramic substrates and filter products for emissions control in mobile, gasoline, and diesel applications. The company's Life Sciences segment offers laboratory products, including consumables, such as plastic vessels, liquid handling plastics, specialty surfaces, cell culture media, and serum, as well as general labware, and glassware and equipment under the Corning, Pyrex, Falcon, and Axygen brands. The company was formerly known as Corning Glass Works and changed its name to Corning Incorporated in April 1989. Corning Incorporated was founded in 1851 and is headquartered in Corning, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:42:48"},{"Company Name":"AMETEK, Inc.","Symbol":"AME","Current Price":"180.17","Latest MA":"179.88","Latest MA 5":179.5859989014,"Latest MA 9":178.4555564372,"Latest MA 20":179.2080002747,"RSI":59.7651027906,"Price Target":192.43588,"Difference from MA":"0.16%","Difference from Open":"0.70%","Change from Yesterday":"-0.40%","Change from Last Report":"0.08","Latest Volume":"409,256","Market Cap":"41,597,468,672","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":24.68082,"PB Ratio":4.1722436,"Previous Close":180.9,"ROE":0.14964,"DTE":21.761,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":1.11,"Trailing PEG":2.9097,"Trailing PE":29.487724,"Trailing PS":29.487724,"Quick Ratio":16.587,"Day High":180.22,"Day Low":178.43,"VS Average Volume":0.2937267911,"Company Summary":"AMETEK, Inc. manufactures and sells electronic instruments (EIG) and electromechanical (EMG) devices in the United States and internationally. The company's EIG segment offers advanced instruments for the process, aerospace, power, and industrial markets; process and analytical instruments for the oil and gas, petrochemical, pharmaceutical, semiconductor, automation, and food and beverage industries; instruments to the laboratory equipment, ultra-precision manufacturing, medical, and test and measurement markets; power quality monitoring and c devices, uninterruptible power supplies, programmable power and electromagnetic compatibility test equipment, and gas turbines sensors; dashboard instruments for heavy trucks and other vehicles; instrumentation and controls for the food and beverage industries; and aircraft and engine sensors, power supplies, embedded computing, monitoring, fuel and fluid measurement, and data acquisition systems for aerospace and defense industry. Its EMG segment offers engineered medical components and devices, automation solutions, thermal management systems, specialty metals, and electrical interconnects; single-use and consumable surgical instruments, implantable components, and drug delivery systems; engineered electrical connectors and electronics packaging to protect sensitive electronic devices; precision motion control products for data storage, medical devices, business equipment, and automation; high-purity powdered metals, strips and foils, specialty clad metals, and metal matrix composites; motor-blower systems and heat exchangers for thermal management, military and commercial aircraft, and military ground vehicles; and motors for commercial appliances, food and beverage machines, hydraulic pumps, and industrial blowers, as well as operates a network of aviation maintenance, repair, and overhaul facilities. AMETEK, Inc. was incorporated in 1930 and is headquartered in Berwyn, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:42:48"},{"Company Name":"D.R. Horton, Inc.","Symbol":"DHI","Current Price":"126.67","Latest MA":"135.62","Latest MA 5":124.3619998779,"Latest MA 9":122.5911104329,"Latest MA 20":121.6199997864,"RSI":63.6768209863,"Price Target":144.5,"Difference from MA":"-6.60%","Difference from Open":"1.92%","Change from Yesterday":"1.49%","Change from Last Report":"0.32","Latest Volume":"1,259,516","Market Cap":"38,910,615,552","Earning Date":"22-07-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":7.9516635,"PB Ratio":1.6070182,"Previous Close":124.81,"ROE":0.17649001,"DTE":26.598,"Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":1.37,"Trailing PEG":1.4724,"Trailing PE":9.603488,"Trailing PS":9.603488,"Quick Ratio":0.589,"Day High":126.735,"Day Low":123.1,"VS Average Volume":0.3620891835,"Company Summary":"D.R. Horton, Inc. operates as a homebuilding company in East, North, Southeast, South Central, Southwest, and Northwest regions in the United States. It engages in the acquisition and development of land; and construction and sale of residential homes in 125 markets across 36 states under the names of D.R. Horton. The company constructs and sells single-family detached homes; and attached homes, such as townhomes, duplexes, and triplexes. It provides mortgage financing services; and title insurance policies, and examination and closing services, as well as engages in the residential lot development business. In addition, the company develops, constructs, owns, leases, and sells multi-family and single-family rental properties; and owns non-residential real estate, including ranch land and improvements. It primarily serves homebuyers. D.R. Horton, Inc. was founded in 1978 and is headquartered in Arlington, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:42:48"},{"Company Name":"Prudential Financial, Inc.","Symbol":"PRU","Current Price":"104.53","Latest MA":"110.75","Latest MA 5":105.3249996948,"Latest MA 9":104.6838885837,"Latest MA 20":104.399769516,"RSI":50.1975241404,"Price Target":113.28571,"Difference from MA":"-5.62%","Difference from Open":"0.11%","Change from Yesterday":"-0.08%","Change from Last Report":"-0.03","Latest Volume":"624,823","Market Cap":"37,002,584,064","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":7.115385,"PB Ratio":1.2382425,"Previous Close":104.61,"ROE":0.07908,"DTE":148.073,"Industry":"Insurance - Life","Sector":"Financial Services","Beta":1.047,"Trailing PEG":0.6882,"Trailing PE":16.486593,"Trailing PS":16.486593,"Quick Ratio":0.881,"Day High":104.58,"Day Low":103.01,"VS Average Volume":0.3326350455,"Company Summary":"Prudential Financial, Inc., together with its subsidiaries, provides insurance, investment management, and other financial products and services in the United States, Japan and internationally. It operates through PGIM, Retirement Strategies, Group Insurance, Individual Life, and International Businesses segments. The PGIM segment offers investment management services and solutions related to public fixed income, public equity, real estate debt and equity, private credit and other alternatives, and multi-asset class strategies to institutional and retail clients, as well as its insurance and retirement businesses. The Retirement Strategies segment provides a range of retirement investment, and income products and services to retirement plan sponsors in the public, private, and not-for-profit sectors; develops and distributes individual variable and fixed annuity products. The Group Insurance segment offers various group life, and long-term and short-term group disability, as well as group corporate-, bank-, and trust-owned life insurance in the United States primarily for institutional clients for use in connection with employee and membership benefits plans; sells accidental death and dismemberment, and other supplemental health solutions; and plan administration services in connection with its insurance coverages. The Individual Life segment develops and distributes variable life, universal life, and term life insurance products. The International Businesses segment develops and distributes life insurance, retirement products, investment products, and certain accident and health products; and advisory and administration services . The company provides its products and services to individual and institutional customers through its proprietary and third-party distribution networks. Prudential Financial, Inc. was founded in 1875 and is headquartered in Newark, New Jersey.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:42:48"},{"Company Name":"Rockwell Automation, Inc.","Symbol":"ROK","Current Price":"324.81","Latest MA":"278.80","Latest MA 5":324.7490004883,"Latest MA 9":321.8927789985,"Latest MA 20":314.8595004883,"RSI":84.5064547794,"Price Target":316.56,"Difference from MA":"16.50%","Difference from Open":"0.56%","Change from Yesterday":"-0.07%","Change from Last Report":"0.05","Latest Volume":"253,712","Market Cap":"36,610,719,744","Earning Date":"07-05-2025","Earning Time":"Before","Earning Day of Week":"Saturday","PE Ratio":28.491667,"PB Ratio":10.645853,"Previous Close":325.04,"ROE":0.24438,"DTE":113.537,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":1.373,"Trailing PEG":3.428,"Trailing PE":40.959015,"Trailing PS":40.959015,"Quick Ratio":0.635,"Day High":324.825,"Day Low":320.81,"VS Average Volume":0.243328912,"Company Summary":"Rockwell Automation, Inc. provides industrial automation and digital transformation solutions in North America, Europe, the Middle East, Africa, the Asia Pacific, and Latin America. The company operates through three segments, Intelligent Devices, Software & Control, and Lifecycle Services. Its solutions include hardware and software products and services. The Intelligent Devices segment offers drives, motion, safety, sensing, industrial components, and configured-to-order products. The Software & Control segment provides control and visualization software and hardware, information software, and network and security infrastructure solutions. The Lifecycle Services segment provides consulting, professional services and solutions, and connected and maintenance services. It sells its solutions primarily through independent distributors in relation with its direct sales force. It serves discrete end markets, including automotive, semiconductor, and warehousing and logistics, as well as general industries comprising printing and publishing, marine, glass, fiber and textiles, airports, and aerospace; hybrid end markets, such as food and beverage, life sciences, household and personal care, and tire, as well as eco industrial, including water\/wastewater, waste management, mass transit, and renewable energy; and process end markets comprising oil and gas, mining, metals, chemicals, pulp and paper, and others. The company was founded in 1903 and is headquartered in Milwaukee, Wisconsin.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:42:48"},{"Company Name":"Agilent Technologies, Inc.","Symbol":"A","Current Price":"119.43","Latest MA":"126.15","Latest MA 5":118.4427197559,"Latest MA 9":116.1004009833,"Latest MA 20":113.6226805951,"RSI":70.1098780764,"Price Target":136.825,"Difference from MA":"-5.33%","Difference from Open":"0.38%","Change from Yesterday":"-0.24%","Change from Last Report":"-0.01","Latest Volume":"602,913","Market Cap":"33,926,905,856","Earning Date":"28-05-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":21.13869,"PB Ratio":5.526519,"Previous Close":119.72,"ROE":0.18882999,"DTE":60.039,"Industry":"Diagnostics & Research","Sector":"Healthcare","Beta":1.232,"Trailing PEG":1.9435,"Trailing PE":29.417143,"Trailing PS":29.417143,"Quick Ratio":1.417,"Day High":120.04,"Day Low":118.53,"VS Average Volume":0.2612689014,"Company Summary":"Agilent Technologies, Inc. provides application focused solutions to the life sciences, diagnostics, and applied chemical markets worldwide. The company operates in three segments: Life Sciences and Applied Markets, Diagnostics and Genomics, and Agilent CrossLab. The Life Sciences and Applied Markets segment offers liquid chromatography systems and components; liquid chromatography mass spectrometry systems; gas chromatography systems and components; gas chromatography mass spectrometry systems; inductively coupled plasma mass spectrometry instruments; atomic absorption instruments; microwave plasma-atomic emission spectrometry instruments; inductively coupled plasma optical emission spectrometry instruments; raman spectroscopy; laboratory software; information management and analytics; laboratory automation and robotic systems; dissolution testing; and vacuum pumps, and measurement technologies. This segment also offers GC and LC columns, sample preparation products, custom chemistries, and laboratory instrument supplies. The Diagnostics and Genomics segment provides genomics, contract manufacturing and research and development, pathology, companion diagnostics, reagent partnership, and biomolecular analysis businesses; and cell analysis plate based assays, flow cytometers, real-time cell analyzers, cell imaging systems, microplate readers, and related consumables. The Agilent CrossLab segment provides various services, including repairs, parts, maintenance, installations, training, compliance support, software as a service, asset management, and consulting services. The company markets its products through direct sales, distributors, resellers, manufacturer's representatives, and electronic commerce. Agilent Technologies, Inc. was incorporated in 1999 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:45:04"},{"Company Name":"Delta Air Lines, Inc.","Symbol":"DAL","Current Price":"48.74","Latest MA":"55.19","Latest MA 5":50.349,"Latest MA 9":49.6550001695,"Latest MA 20":49.442249733,"RSI":43.902719799,"Price Target":58.46826,"Difference from MA":"-11.68%","Difference from Open":"0.53%","Change from Yesterday":"-0.86%","Change from Last Report":"0.04","Latest Volume":"4,229,939","Market Cap":"31,828,195,328","Earning Date":"09-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":6.9437323,"PB Ratio":2.0468192,"Previous Close":49.17,"ROE":0.27521,"DTE":151.356,"Industry":"Airlines","Sector":"Industrials","Beta":1.508,"Trailing PEG":null,"Trailing PE":8.642731,"Trailing PS":8.642731,"Quick Ratio":0.248,"Day High":48.94,"Day Low":47.88,"VS Average Volume":0.3499814664,"Company Summary":"Delta Air Lines, Inc. provides scheduled air transportation for passengers and cargo in the United States and internationally. The company operates through two segments, Airline and Refinery. Its domestic network centered on core hubs in Atlanta, Detroit, Minneapolis-St. Paul, and Salt Lake City, as well as coastal hub positions in Boston, Los Angeles, New York-LaGuardia, New York-JFK, and Seattle; and international network centered on hubs and market presence in Amsterdam, Bogota, Lima, Mexico City, London-Heathrow, Paris-Charles de Gaulle, Santiago (Chile), Sao Paulo, Seoul-Incheon, and Tokyo. The company sells its tickets through various distribution channels, including delta.com and the Fly Delta app; and acts as a reservations specialists. It also provides aircraft maintenance and engineering support, repair, and overhaul services; and vacation packages to third-party consumers. The company operates through a fleet of approximately 1,292 aircraft. Delta Air Lines, Inc. was founded in 1924 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:45:04"},{"Company Name":"ANSYS, Inc.","Symbol":"ANSS","Current Price":"346.16","Latest MA":"333.78","Latest MA 5":344.023998291,"Latest MA 9":340.2866647678,"Latest MA 20":340.4624998169,"RSI":67.7794047121,"Price Target":347.7143,"Difference from MA":"3.71%","Difference from Open":"0.23%","Change from Yesterday":"-0.11%","Change from Last Report":"-0.14","Latest Volume":"84,801","Market Cap":"30,433,036,288","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":31.440508,"PB Ratio":4.9247403,"Previous Close":346.53,"ROE":0.102299996,"DTE":13.932,"Industry":"Software - Application","Sector":"Technology","Beta":1.189,"Trailing PEG":2.2715,"Trailing PE":51.511906,"Trailing PS":51.511906,"Quick Ratio":3.56,"Day High":346.65,"Day Low":344.95,"VS Average Volume":0.1216081339,"Company Summary":"ANSYS, Inc. develops and markets engineering simulation software and services for engineers, designers, researchers, and students. It offers structural analysis product suite that provides simulation tools for product design and optimization; the Ansys Mechanical product, an element analysis software; LS-DYNA solver for multiphysics simulation; and power analysis and optimization software suite. The company also offers electronics product suite that provides electromagnetic field simulation software for designing electronic and electromechanical products; Ansys High Frequency Structure Simulator product for radio frequency and microwave design; SCADE product suite, a solution for embedded software simulation, code production, and automated certification; fluids product suite that enables modeling of fluid flow and other related physical phenomena; Ansys Fluent computational fluid dynamics software package; Ansys RedHawk-SC, an electronic design automation (EDA) software tool; Ansys Optics software; and mission-simulation, modeling, testing, and analysis software. In addition, it offers Ansys Granta MI system for materials information management; Ansys Granta Selector technology for materials selection and graphical analysis of materials properties; CES EduPack product, a set of teaching resources; Granta Materials Data for Simulation; Ansys Lumerical product, a photonics simulation software solution; safety-certified embedded software solutions; design exploration tools; and academic product suite for research and teaching settings. The company serves high-tech, aerospace and defense, automotive, energy, industrial equipment, materials and chemicals, consumer products, healthcare, and construction industries. It has operations in the United States, Japan, Germany, China, Hong Kong, South Korea, rest of Europe, the Middle East, Africa, and internationally. The company was founded in 1970 and is headquartered in Canonsburg, Pennsylvania.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"12-06-2025 20:45:04"},{"Company Name":"Broadridge Financial Solutions,","Symbol":"BR","Current Price":"239.24","Latest MA":"233.72","Latest MA 5":242.4985,"Latest MA 9":243.1002764893,"Latest MA 20":241.5896243896,"RSI":35.5951348821,"Price Target":256.27222,"Difference from MA":"2.36%","Difference from Open":"-0.60%","Change from Yesterday":"-0.80%","Change from Last Report":"0.07","Latest Volume":"132,305","Market Cap":"28,102,139,904","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":25.587431,"PB Ratio":11.7696905,"Previous Close":240.3,"ROE":0.33918,"DTE":152.819,"Industry":"Information Technology Services","Sector":"Technology","Beta":0.969,"Trailing PEG":1.7178,"Trailing PE":35.9223,"Trailing PS":35.9223,"Quick Ratio":1.188,"Day High":240.54,"Day Low":238.905,"VS Average Volume":0.2372685912,"Company Summary":"Broadridge Financial Solutions, Inc. provides investor communications and technology-driven solutions for the financial services industry. The company's Investor Communication Solutions segment handles the proxy materials distribution and voting processes for bank, broker-dealer, corporate issuer, and fund clients, as well as distributes regulatory reports, prospectuses, class action, and corporate action\/reorganization event information, as well as tax reporting solutions. The segment also offers ProxyEdge, an electronic proxy delivery and voting solution; data-driven solutions and an end-to-end platform for content management, composition, and omni-channel distribution of regulatory, marketing, and transactional information, as well as mutual fund trade processing services; solutions for public corporations and mutual funds; data and analytics solutions; SEC filing and capital markets transaction services; registrar, stock transfer, and record-keeping services; and omni-channel customer communications solutions, as well as operates Broadridge Communications Cloud platform that creates, delivers, and manages communications and customer engagement activities. Its Global Technology and Operations segment provides solutions that automate the front-to-back transaction lifecycle of equity, mutual fund, fixed income, foreign exchange and exchange-traded derivatives, order capture and execution, trade confirmation, margin, cash management, clearing and settlement, reference data management, reconciliations, securities financing and collateral management, asset servicing, compliance and regulatory reporting, portfolio accounting, and custody-related services. This segment also offers business process outsourcing services; technology solutions, such portfolio management, compliance, fee billing, and operational support solutions; and capital market and wealth and investment management solutions. The company was founded in 1962 and is headquartered in Lake Success, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:45:04"},{"Company Name":"Super Micro Computer, Inc.","Symbol":"SMCI","Current Price":"43.83","Latest MA":"36.11","Latest MA 5":42.9239994202,"Latest MA 9":42.6566664463,"Latest MA 20":42.4670001068,"RSI":61.4775134842,"Price Target":42.93312,"Difference from MA":"21.39%","Difference from Open":"2.84%","Change from Yesterday":"1.43%","Change from Last Report":"-0.28","Latest Volume":"17,125,458","Market Cap":"26,158,532,608","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":10.337265,"PB Ratio":4.100094,"Previous Close":43.21,"ROE":0.20062,"DTE":41.506,"Industry":"Computer Hardware","Sector":"Technology","Beta":1.397,"Trailing PEG":null,"Trailing PE":23.820652,"Trailing PS":23.820652,"Quick Ratio":3.639,"Day High":44.08,"Day Low":42.32,"VS Average Volume":0.3461654075,"Company Summary":"Super Micro Computer, Inc., together with its subsidiaries, develops and sells high performance server and storage solutions based on modular and open architecture in the United States, Europe, Asia, and internationally. It offers various IT solutions, including complete servers, storage systems, modular blade servers, blades, workstations, full-rack scale solutions, networking devices, server sub-systems, and server management and security software. The company also provides application-optimized server solutions, rackmount and blade servers, storage, and subsystems and accessories; and server software management solutions, such as Server Management Suite, including Supermicro Server Manager, Supermicro Power Management software, Supermicro Update Manager, SuperCloud Composer, and SuperDoctor 5. In addition, it offers server subsystems and accessories comprising server boards, chassis, power supplies, and other accessories. Further, the company identifies service requirements, creates and executes project plans, conducts verification testing and training activities, and provides technical documentation services. Additionally, it offers help desk and on-site support services for its server and storage systems; and customer support services, including ongoing maintenance and technical support for its products. The company provides its products to enterprise data centers, cloud computing, artificial intelligence, 5G, and edge computing markets. It sells its products through direct and indirect sales force, distributors, value-added resellers, system integrators, and original equipment manufacturers. The company was incorporated in 1993 and is headquartered in San Jose, California.","Stock Sentiment":"N\/A","Row Color":"positive-row","Last Updated":"12-06-2025 20:45:04"},{"Company Name":"Eversource Energy (D\/B\/A)","Symbol":"ES","Current Price":"65.76","Latest MA":"59.24","Latest MA 5":65.665999939,"Latest MA 9":65.3844449531,"Latest MA 20":64.524000061,"RSI":64.6207919691,"Price Target":68.97125,"Difference from MA":"11.00%","Difference from Open":"-0.12%","Change from Yesterday":"0.32%","Change from Last Report":"0.18","Latest Volume":"499,284","Market Cap":"24,159,238,144","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":13.757322,"PB Ratio":1.5744488,"Previous Close":65.55,"ROE":0.05617,"DTE":189.941,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.648,"Trailing PEG":0.9856,"Trailing PE":28.842106,"Trailing PS":28.842106,"Quick Ratio":0.334,"Day High":66.05,"Day Low":65.435,"VS Average Volume":0.1809811136,"Company Summary":"Eversource Energy, a public utility holding company, engages in the energy delivery business. The company operates through Electric Distribution, Electric Transmission, Natural Gas Distribution, and Water Distribution segments. It is involved in the transmission and distribution of electricity; solar power facilities; and distribution of natural gas. The company operates regulated water utilities that provide water services to residential, commercial, industrial, municipal and fire protection, and other customers in Connecticut, Massachusetts, and New Hampshire. The company was formerly known as Northeast Utilities and changed its name to Eversource Energy in April 2015. Eversource Energy was incorporated in 1927 and is headquartered in Springfield, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:45:04"},{"Company Name":"Fox Corporation","Symbol":"FOXA","Current Price":"53.19","Latest MA":"50.98","Latest MA 5":54.2099993591,"Latest MA 9":54.3688885837,"Latest MA 20":54.998499939,"RSI":35.6489656908,"Price Target":56.8955,"Difference from MA":"4.34%","Difference from Open":"-2.85%","Change from Yesterday":"-2.69%","Change from Last Report":"-0.22","Latest Volume":"1,911,615","Market Cap":"22,874,413,056","Earning Date":"12-05-2025","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":14.260054,"PB Ratio":2.0791962,"Previous Close":54.66,"ROE":0.16621,"DTE":68.321,"Industry":"Entertainment","Sector":"Communication Services","Beta":0.527,"Trailing PEG":5.9836,"Trailing PE":13.165841,"Trailing PS":13.165841,"Quick Ratio":2.262,"Day High":54.99,"Day Low":53.08,"VS Average Volume":0.4449226361,"Company Summary":"Fox Corporation operates as a news, sports, and entertainment company in the United States (U.S.). The company operates through four segments: Cable Network Programming, Television, Credible, and The FOX Studio Lot. The Cable Network Programming segment produces and licenses news and sports content for distribution through traditional cable television systems, direct broadcast satellite operators and telecommunication companies, virtual multi-channel video programming distributors, and other digital platforms primarily in the U.S. Television segment produces, acquires, markets, and distributes programming through the FOX broadcast network, advertising supported video-on-demand service Tubi, and operates power broadcast television stations including duopolies and other digital platform; and produces content for third parties. The Credible segment engages in the consumer finance marketplace. The FOX Studio Lot segment provides television and film production services along with office space, studio operation services and includes all operations of the facility. The company was incorporated in 2018 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:45:04"},{"Company Name":"Hewlett Packard Enterprise Comp","Symbol":"HPE","Current Price":"18.07","Latest MA":"19.05","Latest MA 5":18.2099999084,"Latest MA 9":17.9644445123,"Latest MA 20":17.7650000725,"RSI":58.1900967818,"Price Target":21.12353,"Difference from MA":"-5.14%","Difference from Open":"0.06%","Change from Yesterday":"-0.82%","Change from Last Report":"-0.08","Latest Volume":"4,265,405","Market Cap":"23,711,815,680","Earning Date":"03-06-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":8.604762,"PB Ratio":0.99220294,"Previous Close":18.22,"ROE":0.06373,"DTE":73.382,"Industry":"Communication Equipment","Sector":"Technology","Beta":1.329,"Trailing PEG":11.1356,"Trailing PE":17.375,"Trailing PS":17.375,"Quick Ratio":0.794,"Day High":18.235,"Day Low":17.965,"VS Average Volume":0.2016806894,"Company Summary":"Hewlett Packard Enterprise Company provides solutions that allow customers to capture, analyze, and act upon data seamlessly in the Americas, Europe, the Middle East, Africa, the Asia Pacific, and Japan. It operates in five segments: Server, Hybrid Cloud, Intelligent Edge, Financial Services, and Corporate Investments and Other. The company offers general purpose servers for multi-workload computing and workload-optimized servers; HPE ProLiant Rack and Tower servers; HPE Synergy, a composable infrastructure for traditional and cloud-native applications; HPE Scale Up Servers product lines for critical applications, including large enterprise software applications and data analytics platforms; HPE Edgeline servers; HPE Cray EX; HPE Cray XD; and HPE NonStop. It also provides HPE Aruba products include hardware products, such as Wi-Fi access points, switches, and gateways; HPE Aruba Networking software and services comprising cloud-based management, network management and access control, software-defined wide-area networking, network security, analytics and assurance, location services software, private and public cellular core software, and professional and support services, as well as as-a-service and consumption models through the HPE GreenLake cloud for the Intelligent Edge portfolio of products. In addition, the company offers leasing, financing, IT consumption, utility programs, and asset management services for customers to facilitate technology deployment models and the acquisition of various IT solutions, including hardware, software, and services from Hewlett Packard Enterprise and others; consultative-led services; HPE and partner technology expertise and advice, and implementation services, as well as solution engagement capabilities; the Communications and Media Solutions (CMS) that offers software and related services; and Hewlett Packard Labs for research and development. It serves commercial and large enterprise groups, such as business and public sector enterprises; and through various partners comprising resellers, distribution partners, original equipment manufacturers, independent software vendors, systems integrators, and advisory firms. The company was founded in 1939 and is headquartered in Spring, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:45:04"},{"Company Name":"FirstEnergy Corp.","Symbol":"FE","Current Price":"40.72","Latest MA":"40.16","Latest MA 5":40.3020001831,"Latest MA 9":40.6500001187,"Latest MA 20":41.4924998627,"RSI":45.2179439369,"Price Target":44.6,"Difference from MA":"1.39%","Difference from Open":"0.89%","Change from Yesterday":"1.27%","Change from Last Report":"0.06","Latest Volume":"2,075,052","Market Cap":"23,501,791,232","Earning Date":"23-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":14.089965,"PB Ratio":1.8701204,"Previous Close":40.21,"ROE":0.09274,"DTE":178.805,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.382,"Trailing PEG":1.2226,"Trailing PE":21.659575,"Trailing PS":21.659575,"Quick Ratio":0.284,"Day High":40.735,"Day Low":40.2713,"VS Average Volume":0.3989455796,"Company Summary":"FirstEnergy Corp., together with its subsidiaries, engages in the generation, distribution, and transmission of electricity in the United States. It operates through Distribution, Integrated, and Stand-Alone Transmission segments. The company owns and operates coal-fired, nuclear, hydroelectric, wind, and solar power generating facilities. It operates 252,244 distribution line miles and 24,143 transmission line miles, including overhead pole line and underground conduit carrying primary, secondary, and street lighting circuits. The company serves customers in Ohio, Pennsylvania, New Jersey, West Virginia, Maryland, and New York. FirstEnergy Corp. was incorporated in 1996 and is headquartered in Akron, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:45:04"},{"Company Name":"Synchrony Financial","Symbol":"SYF","Current Price":"61.62","Latest MA":"59.97","Latest MA 5":60.8440004578,"Latest MA 9":59.6322226122,"Latest MA 20":59.1270004807,"RSI":69.8753597438,"Price Target":64.14286,"Difference from MA":"2.75%","Difference from Open":"0.90%","Change from Yesterday":"-0.28%","Change from Last Report":"0.02","Latest Volume":"1,320,796","Market Cap":"23,456,083,968","Earning Date":"22-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":9.523957,"PB Ratio":1.5267214,"Previous Close":61.79,"ROE":0.18597999,"DTE":null,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.428,"Trailing PEG":null,"Trailing PE":8.441095,"Trailing PS":8.441095,"Quick Ratio":null,"Day High":61.86,"Day Low":60.645,"VS Average Volume":0.2906072495,"Company Summary":"Synchrony Financial, together with its subsidiaries, operates as a consumer financial services company in the United States. It provides credit products, such as credit cards, commercial credit products, and consumer installment loans. The company also offers private label credit cards, dual and general purpose co-branded cards, short- and long-term installment loans, and consumer banking products; and deposit products, including certificates of deposit, individual retirement accounts, money market accounts, savings accounts, and sweep and affinity deposits, as well as accepts deposits through third-party securities brokerage firms. In addition, it provides debt cancellation products to its credit card customers through online and mobile channels; and healthcare payments and financing solutions under the CareCredit and Walgreens brands; payments and financing solutions in the apparel, specialty retail, outdoor, music, and luxury industries, such as American Eagle, Dick's Sporting Goods, Guitar Center, Kawasaki, Pandora, Polaris, Suzuki, and Sweetwater. The company offers its credit products through programs established with a group of national and regional retailers, local merchants, manufacturers, buying groups, industry associations, and healthcare service providers; and deposit products through various channels, such as digital and print. It serves digital, health and wellness, retail, home, auto, telecommunications, pet, outdoor, and other industries. The company was founded in 1932 and is headquartered in Stamford, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:45:04"},{"Company Name":"Teledyne Technologies Incorpora","Symbol":"TDY","Current Price":"497.61","Latest MA":"484.44","Latest MA 5":500.4879973145,"Latest MA 9":499.2822180176,"Latest MA 20":496.6209998779,"RSI":50.740959632,"Price Target":557.13544,"Difference from MA":"2.72%","Difference from Open":"0.47%","Change from Yesterday":"-0.13%","Change from Last Report":"-0.19","Latest Volume":"160,806","Market Cap":"23,317,655,552","Earning Date":"23-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":23.187792,"PB Ratio":2.3489676,"Previous Close":498.24,"ROE":0.086210005,"DTE":29.853,"Industry":"Scientific & Technical Instruments","Sector":"Technology","Beta":1.051,"Trailing PEG":null,"Trailing PE":28.451115,"Trailing PS":28.451115,"Quick Ratio":1.294,"Day High":502.05,"Day Low":495.15,"VS Average Volume":0.503823969,"Company Summary":"Teledyne Technologies Incorporated provides enabling technologies for industrial growth markets in the United States and internationally. Its Digital Imaging segment provides visible spectrum sensors and digital cameras; and infrared, ultraviolet, visible, and X-ray spectra; as well as micro electromechanical systems and semiconductors, including analog-to-digital and digital-to-analog converters. This segment offers cooled and uncooled infrared or thermal products, including sensors, camera cores, and camera systems; high-resolution, low-dose X-ray sensors, high-power microwave, and high-energy X-ray subsystems; and instruments for the measurement of physical properties and maritime products; as well as develops and manufactures multi-spectrum electro-optic\/infrared imaging systems and associated products, such as lasers, optics, and radars, CBRNE (Chemical, Biological, Radiological, Nuclear and Explosive detectors), and unmanned air and ground systems. The company's Instrumentation segment offers monitoring, control, and electronic test and measurement equipment; and power and communications connectivity devices for distributed instrumentation systems and sensor networks. The company's Aerospace and Defense Electronics segment provides electronic components and subsystems, data acquisition and communications components and equipment, harsh environment interconnects, general aviation batteries, and other components; and onboard avionics systems and ground-based applications, aircraft data and connectivity solutions, hardware systems, and software applications. Its Engineered Systems segment offers systems engineering and integration, technology development, and manufacturing solutions for defense, space, environmental, and energy applications; and designs and manufactures electrochemical energy systems and electronics for military applications. The company was founded in 1960 and is headquartered in Thousand Oaks, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:45:04"},{"Company Name":"HP Inc.","Symbol":"HPQ","Current Price":"24.77","Latest MA":"30.42","Latest MA 5":25.091000061,"Latest MA 9":25.0694444868,"Latest MA 20":26.6142501068,"RSI":34.1513466093,"Price Target":27.21062,"Difference from MA":"-18.57%","Difference from Open":"0.10%","Change from Yesterday":"-0.18%","Change from Last Report":"-0.19","Latest Volume":"2,288,676","Market Cap":"23,270,488,064","Earning Date":"28-05-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":6.8819447,"PB Ratio":-18.284132,"Previous Close":24.82,"ROE":null,"DTE":null,"Industry":"Computer Hardware","Sector":"Technology","Beta":1.313,"Trailing PEG":1.6287,"Trailing PE":9.528847,"Trailing PS":9.528847,"Quick Ratio":0.356,"Day High":24.905,"Day Low":24.6401,"VS Average Volume":0.2423918791,"Company Summary":"HP Inc. provides personal computing, printing, 3D printing, hybrid work, gaming, and other related technologies in the United States and internationally. The company operates through three segments: Personal Systems, Printing, and Corporate Investments. The Personal Systems segment offers commercial and consumer desktops and notebooks, workstations, thin clients, retail point-of-sale systems, displays, software, support, and services, as well as hybrid systems. The Printing segment provides consumer and commercial printer hardware, supplies, solutions, and services, as well as focuses on graphics and 3D printing and personalization solutions in the commercial and industrial markets. The Corporate Investments segment is involved in the business incubation and investment projects. It serves individual consumers, small- and medium-sized businesses, and large enterprises. The company was formerly known as Hewlett-Packard Company and changed its name to HP Inc. in October 2015. HP Inc. was founded in 1939 and is headquartered in Palo Alto, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:45:04"},{"Company Name":"CDW Corporation","Symbol":"CDW","Current Price":"175.56","Latest MA":"176.16","Latest MA 5":177.1409987793,"Latest MA 9":176.9383332655,"Latest MA 20":181.0680957642,"RSI":40.2497220946,"Price Target":208.82909,"Difference from MA":"-0.35%","Difference from Open":"0.14%","Change from Yesterday":"-0.11%","Change from Last Report":"-0.08","Latest Volume":"469,491","Market Cap":"23,117,959,168","Earning Date":"07-05-2025","Earning Time":"Before","Earning Day of Week":"Saturday","PE Ratio":17.347332,"PB Ratio":9.9526615,"Previous Close":175.75,"ROE":0.48707,"DTE":272.795,"Industry":"Information Technology Services","Sector":"Technology","Beta":0.943,"Trailing PEG":null,"Trailing PE":21.754026,"Trailing PS":21.754026,"Quick Ratio":1.152,"Day High":176.21,"Day Low":173.865,"VS Average Volume":0.3280082496,"Company Summary":"CDW Corporation provides information technology (IT) solutions in the United States, the United Kingdom, and Canada. It operates through three segments: Corporate, Small Business, and Public. The company offers discrete hardware and software products and services, as well as integrated IT solutions, including on-premise and cloud capabilities across hybrid infrastructure, digital experience, and security. It also provides hardware products comprising notebooks\/mobile devices, tablets, network communications, collaboration hardware, data storage and servers, desktop computers, and other hardware; and software products, such as cloud solutions, software assurance, application suites, security, virtualization, collaboration and productivity applications, operating systems, and network management. In addition, the company offers advisory and design, software development, implementation, and managed services, as well as warranties. It serves business, government, education, and healthcare customers. The company was formerly known as CDW Computer Centers, Inc. and changed its name to CDW Corporation in June 2003. CDW Corporation was founded in 1984 and is based in Vernon Hills, Illinois.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:45:04"},{"Company Name":"ON Semiconductor Corporation","Symbol":"ON","Current Price":"53.07","Latest MA":"51.87","Latest MA 5":52.2399994507,"Latest MA 9":50.1033329773,"Latest MA 20":46.3449997101,"RSI":72.0359677285,"Price Target":49.14172,"Difference from MA":"2.30%","Difference from Open":"3.73%","Change from Yesterday":"2.49%","Change from Last Report":"-0.04","Latest Volume":"4,054,922","Market Cap":"22,177,157,120","Earning Date":"05-05-2025","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":12.284721,"PB Ratio":2.7617612,"Previous Close":51.78,"ROE":0.07852,"DTE":45.383,"Industry":"Semiconductors","Sector":"Technology","Beta":1.381,"Trailing PEG":2.2343,"Trailing PE":36.854164,"Trailing PS":36.854164,"Quick Ratio":3.024,"Day High":53.19,"Day Low":51.0,"VS Average Volume":0.3775181785,"Company Summary":"ON Semiconductor Corporation provides intelligent sensing and power solutions in the United States and internationally. The company operates through three segments Power Solutions Group, Analog and Mixed-Signal Group, and Intelligent Sensing Group. The Power Solutions Group segment offers discrete, module and integrated semiconductor products that perform multiple application functions, including power switching, signal conditioning, and circuit protection. The Analog and Mixed-Signal Group segment designs and develops analogues, mixed-signal, power management ICs, sensor interface devices, power conversion, signal chain, and voltage regulation devices for end-users in the automotive, industrial, computing and mobile end-markets. The Intelligent Sensing Group segment designs and develops complementary metal oxide semiconductor image sensors, image signal processors, single photon detectors, including silicon photomultipliers, single photon avalanche diode arrays, and short-wavelength infrared products, as well as actuator drivers for autofocus and image stabilization for a broad base of end-users in the different end-markets. ON Semiconductor Corporation was incorporated in 1992 and is headquartered in Scottsdale, Arizona.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:45:04"},{"Company Name":"Invitation Homes Inc.","Symbol":"INVH","Current Price":"33.72","Latest MA":"32.75","Latest MA 5":33.406999176,"Latest MA 9":33.370555013,"Latest MA 20":33.5487497253,"RSI":56.5436114973,"Price Target":37.84091,"Difference from MA":"2.94%","Difference from Open":"1.19%","Change from Yesterday":"1.19%","Change from Last Report":"0.03","Latest Volume":"1,247,161","Market Cap":"20,665,575,424","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":45.56081,"PB Ratio":2.1261902,"Previous Close":33.32,"ROE":0.048070002,"DTE":83.399,"Industry":"REIT - Residential","Sector":"Real Estate","Beta":0.817,"Trailing PEG":12.9681,"Trailing PE":43.22436,"Trailing PS":43.22436,"Quick Ratio":0.721,"Day High":33.73,"Day Low":33.1,"VS Average Volume":0.3801936451,"Company Summary":"Invitation Homes, an S&P 500 company, is the nation's premier single-family home leasing and management company, meeting changing lifestyle demands by providing access to high-quality, updated homes with valued features such as close proximity to jobs and access to good schools.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:45:04"},{"Company Name":"PTC Inc.","Symbol":"PTC","Current Price":"170.93","Latest MA":"173.41","Latest MA 5":170.6749993896,"Latest MA 9":169.358331977,"Latest MA 20":169.8917501831,"RSI":62.6400774069,"Price Target":186.6215,"Difference from MA":"-1.44%","Difference from Open":"0.28%","Change from Yesterday":"-0.04%","Change from Last Report":"-0.08","Latest Volume":"212,623","Market Cap":"20,502,112,256","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":24.417858,"PB Ratio":6.053014,"Previous Close":171.0,"ROE":0.13915,"DTE":46.287,"Industry":"Software - Application","Sector":"Technology","Beta":1.183,"Trailing PEG":1.499,"Trailing PE":46.957417,"Trailing PS":46.957417,"Quick Ratio":0.83,"Day High":171.465,"Day Low":169.7,"VS Average Volume":0.2297338034,"Company Summary":"PTC Inc. operates as software company in the Americas, Europe, and the Asia Pacific. The company provides Windchill, a suite that manages all aspects of the product development lifecycle(PLM) that provides real-time information sharing, dynamic data visualization, collaborate across geographically distributed teams, and enabling manufacturers to elevate product development, manufacturing, field service, and end-of-life processes; ThingWorx, an Industrial Internet of Things software; ServiceMax, a service lifecycle management solutions enable companies to asset uptime with optimized in-person and remote service and technician productivity with mobile tools, and deliver metrics; and Arena, a SaaS PLM solution enables product teams to collaborate virtually to share product and quality information with internal teams and supply chain partners and deliver products to customers. It offers Codebeamer, an application lifecycle management for products and software development; Servigistics, a service parts management solution; and FlexPLM, a platform for merchandising and line planning, materials management, sampling, and others. In addition, it offers Kepware, an enterprise industrial connectivity solution; Creo, a 3D CAD technology enables the digital design, testing, and modification of product models; and Onshape, a SaaS product development platform that delivers computer-aided design with data management, collaboration tools, and real-time analytics. Further, it offers Vuforia, an augmented reality (AR) software; and Arbortext, a dynamic publishing solution streamlines how organizations create, manage, and publish technical documentation. PTC Inc. was incorporated in 1985 and is headquartered in Boston, Massachusetts.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:45:04"},{"Company Name":"Dollar Tree, Inc.","Symbol":"DLTR","Current Price":"95.14","Latest MA":"75.06","Latest MA 5":94.165000061,"Latest MA 9":93.786111145,"Latest MA 20":91.0997503052,"RSI":59.5909835793,"Price Target":95.70522,"Difference from MA":"26.76%","Difference from Open":"1.32%","Change from Yesterday":"0.99%","Change from Last Report":"0.03","Latest Volume":"936,175","Market Cap":"19,856,379,904","Earning Date":"04-06-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":15.700495,"PB Ratio":5.120553,"Previous Close":94.21,"ROE":0.19404,"DTE":202.505,"Industry":"Discount Stores","Sector":"Consumer Defensive","Beta":0.845,"Trailing PEG":null,"Trailing PE":18.766272,"Trailing PS":18.766272,"Quick Ratio":0.122,"Day High":95.155,"Day Low":93.83,"VS Average Volume":0.1657545086,"Company Summary":"Dollar Tree, Inc. operates retail discount stores under the Dollar Tree and Dollar Tree Canada brands in the United States and Canada. The company offers consumable merchandise comprising everyday consumables, such as household paper and chemicals, food, candy, health, personal care products, and frozen and refrigerated food; variety merchandise consisting of toys, durable housewares, gifts, stationery, party goods, greeting cards, softlines, arts and crafts supplies, and other items; and seasonal goods, including Christmas, Easter, Halloween, and Valentine's Day merchandise. Dollar Tree, Inc. was founded in 1986 and is based in Chesapeake, Virginia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:45:04"},{"Company Name":"Tyson Foods, Inc.","Symbol":"TSN","Current Price":"55.25","Latest MA":"58.37","Latest MA 5":55.3739997864,"Latest MA 9":55.5200000339,"Latest MA 20":55.4944671631,"RSI":43.1407853071,"Price Target":66.10077,"Difference from MA":"-5.34%","Difference from Open":"-0.04%","Change from Yesterday":"-0.22%","Change from Last Report":"0.00","Latest Volume":"798,912","Market Cap":"19,681,927,168","Earning Date":"05-05-2025","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":15.785714,"PB Ratio":1.0696791,"Previous Close":55.37,"ROE":0.051149998,"DTE":48.934,"Industry":"Farm Products","Sector":"Consumer Defensive","Beta":0.585,"Trailing PEG":0.4245,"Trailing PE":21.498055,"Trailing PS":21.498055,"Quick Ratio":0.616,"Day High":55.35,"Day Low":54.8,"VS Average Volume":0.2753438127,"Company Summary":"Tyson Foods, Inc., together with its subsidiaries, operates as a food company worldwide. It operates through four segments: Beef, Pork, Chicken, and Prepared Foods. The company processes live fed cattle and hogs; fabricates dressed beef and pork carcasses into primal and sub-primal meat cuts, as well as case ready beef and pork, and fully cooked meats; raises and processes chickens into fresh, frozen, and value-added chicken products, including breaded chicken strips, nuggets, patties, and other ready-to-fix or fully cooked chicken parts; and supplies poultry breeding stock. It also manufactures and markets frozen and refrigerated food products, including ready-to-eat sandwiches, flame-grilled hamburgers, Philly steaks, pepperoni, bacon, breakfast sausage, turkey, lunchmeat, hot dogs, flour and corn tortilla products, appetizers, snacks, prepared meals, ethnic foods, side dishes, meat dishes, breadsticks, and processed meats under the Tyson, Jimmy Dean, Hillshire Farm, Ball Park, Wright, Aidells, Gallo Salame, ibp, and State Fair brands. The company sells its products through its sales staff to grocery retailers, grocery wholesalers, meat distributors, warehouse club stores, military commissaries, industrial food processing companies, chain restaurants or their distributors, live markets, international export companies, and domestic distributors who serve restaurants and food service operations, such as plant and school cafeterias, convenience stores, hospitals, and other vendors, as well as through independent brokers and trading companies. The company was founded in 1935 and is headquartered in Springdale, Arkansas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:45:04"},{"Company Name":"Steel Dynamics, Inc.","Symbol":"STLD","Current Price":"132.00","Latest MA":"128.34","Latest MA 5":132.6069997559,"Latest MA 9":133.6283343506,"Latest MA 20":131.688751358,"RSI":50.3294739084,"Price Target":147.22,"Difference from MA":"2.85%","Difference from Open":"1.85%","Change from Yesterday":"1.52%","Change from Last Report":"0.01","Latest Volume":"370,636","Market Cap":"19,596,670,976","Earning Date":"22-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":13.147909,"PB Ratio":2.2344947,"Previous Close":130.03,"ROE":0.13199,"DTE":47.5,"Industry":"Steel","Sector":"Basic Materials","Beta":1.394,"Trailing PEG":null,"Trailing PE":17.346254,"Trailing PS":17.346254,"Quick Ratio":1.292,"Day High":132.12,"Day Low":129.04,"VS Average Volume":0.2225590241,"Company Summary":"Steel Dynamics, Inc., together with its subsidiaries, operates as a steel producer and metal recycler in the United States. It operates through four segments: Steel Operations, Metals Recycling Operations, Steel Fabrication Operations, and Aluminum Operations. The Steel Operations segment offers hot rolled, cold rolled, and coated steel products; parallel flange beams and channel sections, large unequal leg angles, and reinforcing steel bars, as well as standard strength carbon, intermediate alloy hardness, and premium grade rail products; engineered special-bar-quality products, merchant-bar-quality products, and other engineered round steel bars; channels, angles, flats, merchant rounds, and reinforcing steel bars; and specialty shapes and light structural steel products. This segment also engages in turning, polishing, straightening, chamfering, precision saw-cutting, and heat treating of bar products. Its products are used in construction, automotive, manufacturing, transportation, heavy and agriculture equipment, energy, and pipe and tube markets. The Metals Recycling Operations segment is involved in the ferrous and nonferrous scrap metal processing, transportation, marketing, brokerage, and scrap management services. Its ferrous products include heavy melting steel, busheling, bundled scrap, shredded scrap, steel turnings, and cast-iron products; and nonferrous products comprise aluminum, brass, copper, stainless steel, and other nonferrous metals. The Steel Fabrication Operations segment produces steel non-residential building components, such as steel joists, girders, and steel deck products for non-residential steel fabricators, metal building companies, general construction contractors, developers, owners, brokers, and governmental entities. The Aluminum Operations segment offers recycled aluminum flat rolled products. The company also exports its products. Steel Dynamics, Inc. was incorporated in 1993 and is headquartered in Fort Wayne, Indiana.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:45:04"},{"Company Name":"Williams-Sonoma, Inc.","Symbol":"WSM","Current Price":"155.69","Latest MA":"173.70","Latest MA 5":156.7820032959,"Latest MA 9":157.9577786594,"Latest MA 20":162.8849997253,"RSI":35.6079483392,"Price Target":176.8335,"Difference from MA":"-10.37%","Difference from Open":"0.10%","Change from Yesterday":"0.07%","Change from Last Report":"0.32","Latest Volume":"503,318","Market Cap":"19,149,559,808","Earning Date":"22-05-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":19.15006,"PB Ratio":8.860118,"Previous Close":155.58,"ROE":0.50154996,"DTE":63.334,"Industry":"Specialty Retail","Sector":"Consumer Cyclical","Beta":1.477,"Trailing PEG":2.0834,"Trailing PE":17.998844,"Trailing PS":17.998844,"Quick Ratio":0.679,"Day High":155.94,"Day Low":152.9925,"VS Average Volume":0.1873705661,"Company Summary":"Williams-Sonoma, Inc. operates as an omni-channel specialty retailer of various products for home. The company offers cooking, dining, and entertaining products, such as cookware, tools, electrics, cutlery, tabletop and bar, outdoor, furniture, and a library of cookbooks. It also provides home furnishings, home decor products and accessories, bedding, lighting, rugs, table essentials, kids accessories, made-to-order lighting, hardware, personalized products, custom gifts, and colorful and vintage-inspired heirloom products. In addition, the company operates a 3-D imaging and augmented reality platform for the home furnishings and decor industry. It offers its products under the Williams Sonoma, Pottery Barn, Pottery Barn Kids, Pottery Barn Teen, West Elm, Williams Sonoma Home, Rejuvenation, Mark and Graham, and GreenRow brand names. The company markets its products through e-commerce websites, direct-mail catalogs, and retail stores. Williams-Sonoma, Inc. was founded in 1956 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:45:04"},{"Company Name":"First Solar, Inc.","Symbol":"FSLR","Current Price":"167.45","Latest MA":"161.99","Latest MA 5":165.2880010986,"Latest MA 9":162.1233320448,"Latest MA 20":163.0099992371,"RSI":60.3249930615,"Price Target":203.51823,"Difference from MA":"3.37%","Difference from Open":"-0.04%","Change from Yesterday":"-0.24%","Change from Last Report":"0.19","Latest Volume":"1,112,904","Market Cap":"17,958,006,784","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":8.027325,"PB Ratio":2.1933901,"Previous Close":167.86,"ROE":0.16766001,"DTE":7.7,"Industry":"Solar","Sector":"Technology","Beta":1.527,"Trailing PEG":0.4043,"Trailing PE":14.226847,"Trailing PS":14.226847,"Quick Ratio":1.194,"Day High":168.75,"Day Low":163.76,"VS Average Volume":0.2482328889,"Company Summary":"First Solar, Inc., a solar technology company, provides photovoltaic (PV) solar energy solutions in the United States, France, India, Chile, and internationally. The company manufactures and sells PV solar modules with a thin film semiconductor technology that provides a lower-carbon alternative to conventional crystalline silicon PV solar modules. It also designs, manufactures, and sells cadmium telluride solar modules that converts sunlight into electricity. The company's residual business operations include project development activities, operations and maintenance services, and the sale of PV solar power systems to third-party customers. It serves developers and operators of systems, utilities, independent power producers, commercial and industrial companies, and other system owners. The company was formerly known as First Solar Holdings, Inc. and changed its name to First Solar, Inc. in 2006. First Solar, Inc. was founded in 1999 and is headquartered in Tempe, Arizona.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:45:04"},{"Company Name":"Hormel Foods Corporation","Symbol":"HRL","Current Price":"30.91","Latest MA":"30.00","Latest MA 5":30.969000061,"Latest MA 9":30.8838889906,"Latest MA 20":30.4257502098,"RSI":60.946889985,"Price Target":32.323,"Difference from MA":"3.03%","Difference from Open":"-0.15%","Change from Yesterday":"-0.05%","Change from Last Report":"-0.02","Latest Volume":"581,220","Market Cap":"17,000,003,584","Earning Date":"29-05-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":18.2929,"PB Ratio":2.116451,"Previous Close":30.93,"ROE":0.09373,"DTE":35.538,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.336,"Trailing PEG":3.2847,"Trailing PE":22.731619,"Trailing PS":22.731619,"Quick Ratio":1.125,"Day High":31.025,"Day Low":30.72,"VS Average Volume":0.1862482868,"Company Summary":"Hormel Foods Corporation develops, processes, and distributes various meat, nuts, and other food products to foodservice, convenience store, and commercial customers in the United States and internationally. It operates through three segments: Retail, Foodservice, and International segments. The company provides various perishable products that include fresh meats, frozen items, refrigerated meal solutions, bacons, sausages, hams, and guacamoles; and shelf-stable products comprising canned luncheon meats, nut butters, snack nuts, chili, shelf-stable microwaveable meals, hash, stews, tortillas, salsas, tortilla chips, nutritional food supplements, and others. It sells its products under the HORMEL, ALWAYS TENDER, APPLEGATE, AUSTIN BLUES, BACON 1, BLACK LABEL, BREAD READY, BURKE, CAFÉ H, CERATTI, CHI-CHI'S, COLUMBUS, COMPLEATS, CORN NUTS, CURE 81, DAN'S PRIZE, DI LUSSO, DINTY MOORE, DON MIGUEL, DOÑA MARIA, EMBASA, FAST \u0091N EASY, FIRE BRAISED, FONTANINI, HERDEZ, HORMEL GATHERINGS, HOUSE OF TSANG, JENNIE-O, JUSTIN'S, LA VICTORIA, LAYOUT, LLOYD'S, MARY KITCHEN, MR. PEANUT, NATURAL CHOICE, NUT-RITION, OLD SMOKEHOUSE, OVEN READY, PILLOW PACK, PLANTERS, ROSA GRANDE, SADLER'S SMOKEHOUSE, SKIPPY, SPAM, SQUARE TABLE, SPECIAL RECIPE, VALLEY FRESH, and WHOLLY brands through sales personnel, independent brokers, and distributors. The company was formerly known as Geo. A. Hormel & Company and changed its name to Hormel Foods Corporation in January 1995. Hormel Foods Corporation was founded in 1891 and is headquartered in Austin, Minnesota.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"12-06-2025 20:45:04"},{"Company Name":"Genuine Parts Company","Symbol":"GPC","Current Price":"122.17","Latest MA":"119.11","Latest MA 5":124.5060201221,"Latest MA 9":125.2043256524,"Latest MA 20":125.6489499463,"RSI":34.4114592065,"Price Target":131.356,"Difference from MA":"2.57%","Difference from Open":"-0.11%","Change from Yesterday":"-0.92%","Change from Last Report":"0.03","Latest Volume":"520,004","Market Cap":"16,955,987,968","Earning Date":"22-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":14.42386,"PB Ratio":3.810314,"Previous Close":123.3,"ROE":0.19131,"DTE":136.683,"Industry":"Auto Parts","Sector":"Consumer Cyclical","Beta":0.774,"Trailing PEG":1.55,"Trailing PE":20.06077,"Trailing PS":20.06077,"Quick Ratio":0.438,"Day High":122.65,"Day Low":120.6601,"VS Average Volume":0.3667514185,"Company Summary":"Genuine Parts Company distributes automotive and industrial replacement parts. It operates in two segments, Automotive Parts Group and Industrial Parts Group. The company distributes automotive parts, accessories and solutions and replacement parts for hybrid and electric vehicles, trucks, SUVs, buses, motorcycles, farm equipment, and heavy duty equipment; and equipment parts and technologies. It also offers automotive parts, including brakes, batteries, filters, engine components, tools, accessories, and fluids; custom services, such as paint mixing, hydraulic hose assembly, battery testing, and key cutting; and accessories, tools, and equipment for servicing heavy duty and diesel vehicles, as well as operates service and mechanical repair centers for heavy vehicles. In addition, the company operates independent repair shops and auto care centers under the NAPA brand; and NAPA online, an online platform to browse, purchase, and have automotive products, as well as provides DIY workshops and training sessions to customers. Further, it provides abrasives, adhesives, sealants and tape, bearings, chemicals, cutting tools, electrical, facility maintenance, hose and fittings, hydraulics, janitorial, mechanical power transmission, pneumatics, process pumps and equipment, safety, seals and gaskets, tools and testing instruments, as well as inventory management, asset repair and tracking, vendor managed inventory, radio frequency identification asset management, gearbox and fluid power assembly and repair, process pump assembly and repair, drive shaft repair, electrical panel assembly and repair, and hose and gasket manufacture and assembly services. The company was incorporated in 1928 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:45:04"},{"Company Name":"Pentair plc.","Symbol":"PNR","Current Price":"99.24","Latest MA":"96.52","Latest MA 5":99.5254998779,"Latest MA 9":99.4797224257,"Latest MA 20":99.1933752441,"RSI":53.1740360268,"Price Target":105.9725,"Difference from MA":"2.82%","Difference from Open":"0.91%","Change from Yesterday":"0.03%","Change from Last Report":"-0.05","Latest Volume":"235,695","Market Cap":"16,327,249,920","Earning Date":"22-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":20.461342,"PB Ratio":4.493435,"Previous Close":99.21,"ROE":0.1859,"DTE":53.77,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":1.101,"Trailing PEG":1.7405,"Trailing PE":25.642767,"Trailing PS":25.642767,"Quick Ratio":1.117,"Day High":99.36,"Day Low":98.12,"VS Average Volume":0.1528906481,"Company Summary":"Pentair plc provides various water solutions in the United States, Western Europe, China, Eastern Europe, Latin America, the Middle East, Southeast Asia, Australia, Canada, and Japan. The company operates through three segments: Flow, Water Solutions, and Pool. The Flow segment designs, manufactures, and sells fluid treatment and pump products and systems, including pressure vessels, gas recovery solutions, membrane bioreactors, wastewater reuse systems and advanced membrane filtration, separation systems, water disposal pumps, water supply pumps, fluid transfer pumps, turbine pumps, solid handling pumps, and agricultural spray nozzles. This segment provides products under Pentair Flow, Aurora, Berkeley, Codeline, Fairbanks-Nijhuis, Haffmans, Hydromatic, Hypro, Jung Pumpen, Myers, Sta-Rite, Shurflo, Südmo, and X-Flow brand names. The Water Solutions segment offers commercial and residential water treatment products and systems, such as pressure tanks, control valves, activated carbon products, commercial ice machines, conventional filtration products, and point-of-entry and point-of-use water treatment systems for use in water filtration and water softening solutions, as well as commercial water management and filtration solutions in foodservice operations; and installation and preventative services for water management solutions for commercial operators under the Pentair Water Solutions, Everpure, Fleck, KBI, Manitowoc Ice, Pentek, and RainSoft brand names. The Pool segment provides residential and commercial pool equipment and accessories, including pumps, filters, heaters, lights, automatic controls, automatic cleaners, maintenance equipment, and pool accessories for residential and commercial pool maintenance, pool repair, renovation, service, construction, and aquaculture solutions. This segment offers products under the Pentair Pool, Kreepy Krauly, Pleatco, and Sta-Rite brand. Pentair plc was founded in 1966 and is headquartered in London, the United Kingdom.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:45:04"},{"Company Name":"Ralph Lauren Corporation","Symbol":"RL","Current Price":"266.40","Latest MA":"238.63","Latest MA 5":269.4340039063,"Latest MA 9":273.1,"Latest MA 20":275.4850024414,"RSI":36.3583123261,"Price Target":308.8306,"Difference from MA":"11.64%","Difference from Open":"0.29%","Change from Yesterday":"-0.47%","Change from Last Report":"-0.22","Latest Volume":"261,280","Market Cap":"16,070,259,712","Earning Date":"22-05-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":20.460829,"PB Ratio":6.3294444,"Previous Close":267.67,"ROE":0.29487,"DTE":103.075,"Industry":"Apparel Manufacturing","Sector":"Consumer Cyclical","Beta":1.531,"Trailing PEG":2.254,"Trailing PE":22.92599,"Trailing PS":22.92599,"Quick Ratio":1.263,"Day High":268.0712,"Day Low":264.105,"VS Average Volume":0.2548968725,"Company Summary":"Ralph Lauren Corporation designs, markets, and distributes lifestyle products in North America, Europe, Asia, and internationally. It offers apparel, including a range of men's, women's, and children's clothing; footwear and accessories, which comprise casual shoes, dress shoes, boots, sneakers, sandals, eyewear, watches, fashion and fine jewelry, scarves, hats, gloves, and umbrellas, as well as leather goods comprising handbags, luggage, small leather goods, and belts; home products, such as bed and bath lines, furniture, fabric and wall coverings, lighting, dining, floor coverings, decorative accessories, and giftware; and fragrances. The company sells apparel and accessories under the Ralph Lauren Collection, Ralph Lauren Purple Label, Polo Ralph Lauren, Double RL, Lauren Ralph Lauren, Polo Golf Ralph Lauren, Ralph Lauren Golf, RLX Ralph Lauren, Polo Ralph Lauren Children, and Chaps brands; women's fragrances under the Ralph Lauren Collection, Woman by Ralph Lauren, Romance Collection, and Ralph Collection brand names; and men's fragrances under the Ralph's Club, Purple Label, Polo Blue, Polo Red, Polo Green, Polo Black, Polo 67, Safari, Polo Sport, and Big Pony Men's brand names. Its restaurant collection includes The Polo Bar in New York City; RL Restaurant in Chicago; Ralph's in Paris; The Bar at Ralph Lauren located in Milan; Ralph's Bar located in Chengdu, China; and Ralph's Coffee concept. The company sells its products to department stores, specialty stores, and golf and pro shops, as well as directly to consumers through its retail stores, concession-based shop-within-shops, and its digital commerce sites. It directly operates retail stores and concession-based shop-within-shops; and operates Ralph Lauren stores and shops through licensing partners. Ralph Lauren Corporation was founded in 1967 and is based in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:45:04"},{"Company Name":"Baxter International Inc.","Symbol":"BAX","Current Price":"31.25","Latest MA":"31.42","Latest MA 5":31.0949999084,"Latest MA 9":30.5816664293,"Latest MA 20":30.6313072739,"RSI":59.9492469478,"Price Target":38.3425,"Difference from MA":"-0.57%","Difference from Open":"0.02%","Change from Yesterday":"-0.49%","Change from Last Report":"-0.05","Latest Volume":"1,074,346","Market Cap":"16,034,153,472","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":10.848958,"PB Ratio":2.2639666,"Previous Close":31.4,"ROE":-0.03506,"DTE":146.144,"Industry":"Medical Instruments & Supplies","Sector":"Healthcare","Beta":0.613,"Trailing PEG":null,"Trailing PE":null,"Trailing PS":null,"Quick Ratio":1.147,"Day High":31.65,"Day Low":31.115,"VS Average Volume":0.2505325016,"Company Summary":"Baxter International Inc., through its subsidiaries, provides a portfolio of healthcare products in the United States. The company operates through three segments: Medical Products and Therapies, Healthcare Systems and Technologies, and Pharmaceuticals. It offers sterile intravenous (IV) solutions; infusion systems and devices; parenteral nutrition therapies; administrative sets; generic injectable pharmaceuticals; surgical hemostat and sealant products; advanced surgical equipment; smart bed systems; patient monitoring and diagnostic technologies; and respiratory health devices, as well as advanced equipment for the surgical space comprising operating room integration technologies, precision positioning devices, and other accessories. The company also provides specialty injectable pharmaceuticals, inhaled anesthetics, and drug compounding services. Its products are used in hospitals, nursing homes, rehabilitation centers, ambulatory surgery centers, doctors' offices, kidney dialysis centers, and patients at home under physician supervision. The company sells its products through direct sales force, independent distributors, drug wholesalers, and specialty pharmacy or other alternate site providers. It has an agreement with Celerity Pharmaceuticals, LLC to develop acute care generic injectable premix and oncolytic products. The company operates in Eastern Europe, the Middle East, Africa, Latin America, Asia, Western Europe, Canada, Japan, Australia, and New Zealand. Baxter International Inc. was incorporated in 1931 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:45:04"},{"Company Name":"Domino's Pizza Inc","Symbol":"DPZ","Current Price":"450.15","Latest MA":"456.65","Latest MA 5":457.7399975586,"Latest MA 9":460.5744432237,"Latest MA 20":473.7954974365,"RSI":28.5882363944,"Price Target":503.4907,"Difference from MA":"-1.42%","Difference from Open":"0.88%","Change from Yesterday":"0.73%","Change from Last Report":"0.19","Latest Volume":"238,502","Market Cap":"15,413,811,200","Earning Date":"28-04-2025","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":25.518707,"PB Ratio":-3.9878633,"Previous Close":446.9,"ROE":null,"DTE":null,"Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":1.122,"Trailing PEG":2.6064,"Trailing PE":25.82616,"Trailing PS":25.82616,"Quick Ratio":0.358,"Day High":451.99,"Day Low":444.297,"VS Average Volume":0.3873055775,"Company Summary":"Domino's Pizza, Inc. operates as a pizza company in the United States and internationally. The company operates through three segments: U.S. Stores, International Franchise, and Supply Chain. It offers pizzas under the Domino's brand name through company-owned and franchised stores. It provides bread products, wings, boneless chicken, pastas, oven-baked sandwiches, dips, soft drink products and desserts. Domino's Pizza, Inc. was founded in 1960 and is headquartered in Ann Arbor, Michigan.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:45:04"},{"Company Name":"TKO Group Holdings, Inc.","Symbol":"TKO","Current Price":"163.86","Latest MA":"149.64","Latest MA 5":164.529981709,"Latest MA 9":164.4588782525,"Latest MA 20":161.8949954272,"RSI":52.7106420877,"Price Target":182.15685,"Difference from MA":"9.50%","Difference from Open":"-0.41%","Change from Yesterday":"-0.64%","Change from Last Report":"0.05","Latest Volume":"177,297","Market Cap":"13,395,137,536","Earning Date":"08-05-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":50.57404,"PB Ratio":3.2177973,"Previous Close":164.92,"ROE":0.043169998,"DTE":30.107,"Industry":"Entertainment","Sector":"Communication Services","Beta":null,"Trailing PEG":null,"Trailing PE":83.60198,"Trailing PS":83.60198,"Quick Ratio":0.814,"Day High":165.29,"Day Low":163.47,"VS Average Volume":0.1190432068,"Company Summary":"TKO Group Holdings, Inc. operates as a sports and entertainment company. The company owns and manages sports and entertainment intellectual property; produces and licenses live events, programing, and long-form and short-form content, reality series, and other filmed entertainment on digital and linear channels and via pay-per-view; and offers UFC FIGHT PASS, a direct-to-consumer streaming product that provides access to live and video-on-demand events, as well as original content. It is also involved in the merchandising of video games, apparel, equipment, trading cards, memorabilia, digital goods, and toys. In addition, the company engages in the sponsorships and advertising business, which offers sale of in-venue and in-broadcast advertising assets, content product integration, and digital impressions. The company was incorporated in 2023 and is based in New York, New York. TKO Group Holdings, Inc. is a subsidiary of Endeavor Group Holdings, Inc.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:45:04"},{"Company Name":"CarMax Inc","Symbol":"KMX","Current Price":"66.62","Latest MA":"76.29","Latest MA 5":67.1699991455,"Latest MA 9":66.4011108738,"Latest MA 20":65.4834999619,"RSI":53.7227735709,"Price Target":84.13188,"Difference from MA":"-12.68%","Difference from Open":"-0.46%","Change from Yesterday":"-1.78%","Change from Last Report":"-0.13","Latest Volume":"1,246,146","Market Cap":"10,148,558,848","Earning Date":"20-06-2025","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":17.67109,"PB Ratio":1.6360912,"Previous Close":67.83,"ROE":0.08128,"DTE":311.168,"Industry":"Auto & Truck Dealerships","Sector":"Consumer Cyclical","Beta":1.382,"Trailing PEG":0.8459,"Trailing PE":20.753895,"Trailing PS":20.753895,"Quick Ratio":0.198,"Day High":67.18,"Day Low":65.78,"VS Average Volume":0.3512269943,"Company Summary":"CarMax, Inc., through its subsidiaries, operates as a retailer of used vehicles and related products in the United States. The company operates in two segments: CarMax Sales Operations and CarMax Auto Finance. The CarMax Sales Operations segment offers customers a range of makes and models of used vehicles, including domestic, imported, and luxury vehicles, as well as hybrid and electric vehicles; used vehicle auctions; extended protection plans to customers at the time of sale; and reconditioning and vehicle repair services. The CarMax Auto Finance segment provides financing alternatives for retail customers across a range of credit spectrum and arrangements with various financial institutions. The company was founded in 1993 and is based in Richmond, Virginia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:45:04"},{"Company Name":"Lamb Weston Holdings, Inc.","Symbol":"LW","Current Price":"56.04","Latest MA":"59.93","Latest MA 5":55.758,"Latest MA 9":55.5288890245,"Latest MA 20":54.1210000534,"RSI":69.2325046047,"Price Target":65.22214,"Difference from MA":"-6.49%","Difference from Open":"1.69%","Change from Yesterday":"0.48%","Change from Last Report":"0.05","Latest Volume":"339,396","Market Cap":"7,908,140,544","Earning Date":"03-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":11.253013,"PB Ratio":4.8410506,"Previous Close":55.77,"ROE":0.2164,"DTE":261.312,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.474,"Trailing PEG":2.176,"Trailing PE":21.97647,"Trailing PS":21.97647,"Quick Ratio":0.484,"Day High":56.08,"Day Low":54.64,"VS Average Volume":0.1577045676,"Company Summary":"Lamb Weston Holdings, Inc. engages in the production, distribution, and marketing of frozen potato products in the United States, Canada, Mexico, and internationally. It offers frozen potatoes, commercial ingredients, and appetizers under the Lamb Weston brand, as well as under various customer labels. The company also provides its products under its owned or licensed brands, such as Grown in Idaho and Alexia, and other licensed brands, as well as under retailers' own brands. It sells its products through a network of internal sales personnel and independent brokers, agents, and distributors to quick service and full-service restaurants and chains, wholesale, grocery, mass merchants, club retailers, and specialty retailers, as well as foodservice distributors and institutions, including businesses, educational institutions, independent restaurants, regional chain restaurants, and convenience stores. The company was incorporated in 1950 and is headquartered in Eagle, Idaho.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:45:04"}]