[{"Company Name":"Netflix, Inc.","Symbol":"NFLX","Current Price":"1219.17","Latest MA":"984.06","Latest MA 5":1221.7199863281,"Latest MA 9":1226.1888785807,"Latest MA 20":1208.4534951172,"RSI":54.3081836489,"Price Target":1154.1561,"Difference from MA":"23.89%","Difference from Open":"-0.22%","Change from Yesterday":"-0.06%","Change from Last Report":"0.04","Latest Volume":"1,001,081","Market Cap":"518,843,432,960","Earning Date":"17-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":51.268715,"PB Ratio":21.598875,"Previous Close":1219.88,"ROE":0.40842,"DTE":72.513,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.589,"Trailing PEG":2.1726,"Trailing PE":57.78057,"Trailing PS":57.78057,"Quick Ratio":1.01,"Day High":1230.0,"Day Low":1216.7416,"VS Average Volume":0.2216474713,"Company Summary":"Netflix, Inc. provides entertainment services. The company offers television (TV) series, documentaries, feature films, and games across various genres and languages. It also provides members the ability to receive streaming content through a host of internet-connected devices, including TVs, digital video players, TV set-top boxes, and mobile devices. The company operates approximately in 190 countries. Netflix, Inc. was incorporated in 1997 and is headquartered in Los Gatos, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:52:26"},{"Company Name":"Procter & Gamble Company (The)","Symbol":"PG","Current Price":"162.68","Latest MA":"166.05","Latest MA 5":162.8419997559,"Latest MA 9":164.1766670736,"Latest MA 20":165.1789996948,"RSI":40.2710962523,"Price Target":172.87914,"Difference from MA":"-2.03%","Difference from Open":"0.44%","Change from Yesterday":"0.35%","Change from Last Report":"0.09","Latest Volume":"3,054,659","Market Cap":"381,409,722,368","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":21.924526,"PB Ratio":7.4073396,"Previous Close":162.11,"ROE":0.30294,"DTE":64.975,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":0.427,"Trailing PEG":3.9252,"Trailing PE":25.781298,"Trailing PS":25.781298,"Quick Ratio":0.445,"Day High":163.31,"Day Low":161.675,"VS Average Volume":0.3664219502,"Company Summary":"The Procter & Gamble Company engages in the provision of branded consumer packaged goods worldwide. The company operates through five segments: Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care. The Beauty segment offers conditioners, shampoos, styling aids, and treatments under the Head & Shoulders, Herbal Essences, Pantene, and Rejoice brands; and antiperspirants and deodorants, personal cleansing, and skin care products under the Olay, Old Spice, Safeguard, Secret, SK-II, and Native brands. The Grooming segment provides blades and razors, shave products, appliances, and other grooming products under the Braun, Gillette, and Venus brand names. The Health Care segment offers toothbrushes, toothpastes, and other oral care products under the Crest and Oral-B brand names; and gastrointestinal, pain relief, rapid diagnostics, respiratory, vitamins\/minerals\/supplements, and other personal health care products under Metamucil, Neurobion, Pepto-Bismol, and Vicks brands. The Fabric & Home Care segment provides fabric enhancers, laundry additives, and laundry detergents under the Ariel, Downy, Gain, and Tide brands; and air care, dish care, P&G professional, and surface care products under the Cascade, Dawn, Fairy, Febreze, Mr. Clean, and Swiffer brands. The Baby, Feminine & Family Care segment offers baby wipes, and taped diapers and pants under the Luvs and Pampers brands; adult incontinence and feminine care products under the Always, Always Discreet, and Tampax brands; and paper towels, tissues, and toilet papers under the Bounty, Charmin, and Puffs brands. It sells its products primarily through mass merchandisers, e-commerce, grocery stores, membership club stores, drug stores, department stores, distributors, wholesalers, specialty beauty stores, high-frequency stores, pharmacies, electronics stores, and professional channels, as well as directly to consumers. The company was founded in 1837 and is headquartered in Cincinnati, Ohio.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:52:26"},{"Company Name":"Home Depot, Inc. (The)","Symbol":"HD","Current Price":"364.28","Latest MA":"381.85","Latest MA 5":365.0357987793,"Latest MA 9":366.7802404514,"Latest MA 20":368.3159061768,"RSI":45.2767319464,"Price Target":418.63828,"Difference from MA":"-4.60%","Difference from Open":"0.96%","Change from Yesterday":"1.06%","Change from Last Report":"0.17","Latest Volume":"1,658,113","Market Cap":"362,431,381,504","Earning Date":"19-08-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":23.351217,"PB Ratio":45.56335,"Previous Close":360.46,"ROE":2.9951901,"DTE":778.781,"Industry":"Home Improvement Retail","Sector":"Consumer Cyclical","Beta":1.018,"Trailing PEG":4.2201,"Trailing PE":24.713636,"Trailing PS":24.713636,"Quick Ratio":0.23,"Day High":364.56,"Day Low":358.52,"VS Average Volume":0.4588263259,"Company Summary":"The Home Depot, Inc. operates as a home improvement retailer in the United States and internationally. It sells various building materials, home improvement products, lawn and garden products, and décor products, as well as facilities maintenance, repair, and operations products. The company also offers installation services for flooring, water heaters, baths, garage doors, cabinets, cabinet makeovers, countertops, sheds, furnaces and central air systems, and windows. In addition, it provides tool and equipment rental services. The company serves consumers, such as do-it-yourself homeowners and do-it-for-me customers; and professional renovators\/remodelers, general contractors, small to medium homebuilders, maintenance professionals, handymen, property managers, building service contractors and specialty tradespeople, such as electricians, landscapers, plumbers, painters, pool contractors, and roofers. It sells its products through websites and its mobile applications, including homedepot.com; homedepot.ca and homedepot.com.mx; blinds.com, justblinds.com, and americanblinds.com for custom window coverings; thecompanystore.com, an online site for textiles and décor products; hdsupply.com for maintenance, repair, and operations products and related services; and srsdistribution.com, heritagelandscapesupplygroup.com, and heritagepoolsupplygroup.com for roofing and building materials, landscape, and pool products; and The Home Depot stores. The Home Depot, Inc. was incorporated in 1978 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:52:26"},{"Company Name":"Advanced Micro Devices, Inc.","Symbol":"AMD","Current Price":"119.92","Latest MA":"114.67","Latest MA 5":120.4439206104,"Latest MA 9":118.7144002374,"Latest MA 20":115.6549796338,"RSI":60.1290880606,"Price Target":128.75629,"Difference from MA":"4.58%","Difference from Open":"-0.58%","Change from Yesterday":"-1.02%","Change from Last Report":"-0.88","Latest Volume":"21,508,910","Market Cap":"194,437,644,288","Earning Date":"06-05-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":23.513647,"PB Ratio":3.3481195,"Previous Close":121.14,"ROE":0.03904,"DTE":8.174,"Industry":"Semiconductors","Sector":"Technology","Beta":1.993,"Trailing PEG":0.6183,"Trailing PE":87.532555,"Trailing PS":87.532555,"Quick Ratio":1.765,"Day High":122.25,"Day Low":119.71,"VS Average Volume":0.5272486136,"Company Summary":"Advanced Micro Devices, Inc. operates as a semiconductor company worldwide. It operates through four segments: Data Center, Client, Gaming, and Embedded. The company offers artificial intelligence (AI) accelerators, x86 microprocessors, and graphics processing units (GPUs) as standalone devices or as incorporated into accelerated processing units, chipsets, and data center and professional GPUs; and embedded processors and semi-custom system-on-chip (SoC) products, microprocessor and SoC development services and technology, data processing units, field programmable gate arrays (FPGA), system on modules, smart network interface cards, and adaptive SoC products. It provides processors under the AMD Ryzen, AMD Ryzen AI, AMD Ryzen PRO, AMD Ryzen Threadripper, AMD Ryzen Threadripper PRO, AMD Athlon, and AMD PRO A-Series brands; graphics under the AMD Radeon graphics and AMD Embedded Radeon graphics; and professional graphics under the AMD Radeon Pro graphics brand. The company offers data center graphics under the AMD Instinct accelerators and Radeon PRO V-series brands; server microprocessors under the AMD EPYC brand; low power solutions under the AMD Athlon, AMD Geode, AMD Ryzen, AMD EPYC, and AMD R-Series and G-Series brands; FPGA products under the Virtex-6, Virtex-7, Virtex UltraScale+, Kintex-7, Kintex UltraScale, Kintex UltraScale+, Artix-7, Artix UltraScale+, Spartan-6, and Spartan-7 brands; adaptive SOCs under the Zynq-7000, Zynq UltraScale+ MPSoC, Zynq UltraScale+ RFSoCs, Versal HBM, Versal Premium, Versal Prime, Versal AI Core, Versal AI Edge, Vitis, and Vivado brands; and compute and network acceleration board products under the Alveo and Pensando brands. It serves original equipment and design manufacturers, public cloud service providers, system integrators, independent distributors, and add-in-board manufacturers through its direct sales force and sales representatives. It also provides AI and general-purpose compute infrastructure for hyperscale providers. The company was incorporated in 1969 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:52:26"},{"Company Name":"Pepsico, Inc.","Symbol":"PEP","Current Price":"131.78","Latest MA":"144.59","Latest MA 5":130.7010002441,"Latest MA 9":130.3789244927,"Latest MA 20":129.992431076,"RSI":59.7017831203,"Price Target":150.05956,"Difference from MA":"-8.85%","Difference from Open":"1.45%","Change from Yesterday":"1.45%","Change from Last Report":"0.20","Latest Volume":"5,559,058","Market Cap":"180,687,781,888","Earning Date":"17-07-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":15.270568,"PB Ratio":9.839842,"Previous Close":129.9,"ROE":0.49927,"DTE":261.849,"Industry":"Beverages - Non-Alcoholic","Sector":"Consumer Defensive","Beta":0.466,"Trailing PEG":2.3057,"Trailing PE":19.40869,"Trailing PS":19.40869,"Quick Ratio":0.615,"Day High":131.93,"Day Low":129.745,"VS Average Volume":0.6735831304,"Company Summary":"PepsiCo, Inc. engages in the manufacture, marketing, distribution, and sale of various beverages and convenient foods worldwide. The company operates through seven segments: Frito-Lay North America; Quaker Foods North America; PepsiCo Beverages North America; Latin America; Europe; Africa, Middle East and South Asia; and Asia Pacific, Australia and New Zealand and China Region. It provides dips, cheese-flavored snacks, and spreads, as well as corn, potato, and tortilla chips; cereals, rice, pasta, mixes and syrups, granola bars, grits, oatmeal, rice cakes, and side dishes; beverage concentrates, fountain syrups, and finished goods; ready-to-drink tea, coffee, and juices; dairy products; and sparkling water makers and related products, as well as distributes alcoholic beverages under Hard MTN Dew brand. The company offers its products primarily under the Lay's, Doritos, Fritos, Tostitos, BaiCaoWei, Cheetos, Cap'n Crunch, Life, Pearl Milling Company, Gatorade, Pepsi-Cola, Mountain Dew, Quaker, Rice-A-Roni, Aquafina, Bubly, Emperador, Diet Mountain Dew, Diet Pepsi, Gatorade Zero, Crush, Propel, Dr Pepper, Schweppes, Marias Gamesa, Ruffles, Sabritas, Saladitas, Tostitos, 7UP, Diet 7UP, H2oh!, Manzanita Sol, Mirinda, Pepsi Black, Pepsi Max, San Carlos, Toddy, Walkers, Chipsy, Kurkure, Sasko, Spekko, White Star, Smith's, Sting, SodaStream, Lubimyj Sad, Agusha, Chudo, Domik v Derevne, Lipton, and other brands. It serves wholesale and other distributors, foodservice customers, grocery stores, drug stores, convenience stores, discount\/dollar stores, mass merchandisers, membership stores, hard discounters, e-commerce retailers and authorized independent bottlers, and others through a network of direct-store-delivery, customer warehouse, and distributor networks, as well as directly to consumers through e-commerce platforms and retailers. The company was founded in 1898 and is based in Purchase, New York.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:52:26"},{"Company Name":"Analog Devices, Inc.","Symbol":"ADI","Current Price":"232.48","Latest MA":"210.19","Latest MA 5":229.6559975586,"Latest MA 9":224.0814976671,"Latest MA 20":220.7964990845,"RSI":78.6181805464,"Price Target":243.8816,"Difference from MA":"10.60%","Difference from Open":"0.41%","Change from Yesterday":"-0.03%","Change from Last Report":"-0.26","Latest Volume":"937,983","Market Cap":"115,367,731,200","Earning Date":"22-05-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":30.832891,"PB Ratio":3.2952046,"Previous Close":232.54,"ROE":0.05213,"DTE":20.62,"Industry":"Semiconductors","Sector":"Technology","Beta":1.0,"Trailing PEG":1.5541,"Trailing PE":63.346046,"Trailing PS":63.346046,"Quick Ratio":1.397,"Day High":233.74,"Day Low":230.85,"VS Average Volume":0.2153215787,"Company Summary":"Analog Devices, Inc. engages in the design, manufacture, testing, and marketing of integrated circuits (ICs), software, and subsystems products in the United States, rest of North and South America, Europe, Japan, China, and rest of Asia. The company provides data converter products, which translate real-world analog signals into digital data, as well as translates digital data into analog signals; power management and reference products for power conversion, driver monitoring, sequencing, and energy management applications in the automotive, communications, industrial, and consumer markets; and power ICs that include performance, integration, and software design simulation tools for accurate power supply designs. It also offers amplifiers to condition analog signals; and radio frequency and microwave ICs to support cellular infrastructure; and micro-electro-mechanical systems technology solutions, including accelerometers used to sense acceleration, gyroscopes for sense rotation, inertial measurement units to sense multiple degrees of freedom, and broadband switches for radio and instrument systems, as well as isolators. In addition, the company provides digital signal processing and system products for numeric calculations. It serves clients in the industrial, automotive, consumer, instrumentation, aerospace, defense and healthcare, and communications markets through a direct sales force, third-party distributors, and independent sales representatives, as well as online. The company was incorporated in 1965 and is headquartered in Wilmington, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:52:26"},{"Company Name":"Medtronic plc.","Symbol":"MDT","Current Price":"87.90","Latest MA":"85.86","Latest MA 5":87.7619992065,"Latest MA 9":86.7433325873,"Latest MA 20":85.0195006561,"RSI":73.935353655,"Price Target":95.43037,"Difference from MA":"2.38%","Difference from Open":"-0.15%","Change from Yesterday":"-0.18%","Change from Last Report":"0.09","Latest Volume":"2,154,684","Market Cap":"112,681,648,128","Earning Date":"19-08-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":15.025641,"PB Ratio":2.3463776,"Previous Close":88.06,"ROE":0.09508,"DTE":59.093,"Industry":"Medical Devices","Sector":"Healthcare","Beta":0.815,"Trailing PEG":2.5249,"Trailing PE":24.349031,"Trailing PS":24.349031,"Quick Ratio":1.202,"Day High":88.27,"Day Low":87.65,"VS Average Volume":0.2698225972,"Company Summary":"Medtronic plc develops, manufactures, and sells device-based medical therapies to healthcare systems, physicians, clinicians, and patients worldwide. The Cardiovascular Portfolio segment offers implantable cardiac pacemakers, cardioverter defibrillators, and cardiac resynchronization therapy devices; cardiac ablation products; insertable cardiac monitor systems; TYRX products; and remote monitoring and patient-centered software. It also provides aortic valves, surgical valve replacement and repair products, endovascular stent grafts and accessories, and transcatheter pulmonary valves; and percutaneous coronary intervention products, percutaneous angioplasty balloons, and other products. The Neuroscience Portfolio segment offers medical devices and implants, biologic solutions, spinal cord stimulation and brain modulation systems, implantable drug infusion systems, and interventional products, as well as nerve ablation system under the Accurian name. The segment offers its products for spinal surgeons, neurosurgeons, neurologists, pain management specialists, anesthesiologists, orthopedic surgeons, urologists, urogynecologists, and interventional radiologists, as well as ear, nose, and throat specialists; and energy surgical instruments. The Medical Surgical Portfolio segment offers surgical stapling devices, vessel sealing instruments, wound closure and electrosurgery products, AI-powered surgical video and analytics platform, robotic-assisted surgery products, hernia mechanical devices, mesh implants, gynecology products, gastrointestinal and hepatologic diagnostics and therapies, and therapies to treat other non-exclusive diseases and conditions; and patient monitoring and airway management products. The Diabetes Operating Unit segment provides insulin pumps and consumables, continuous glucose monitoring systems, and InPen, a smart insulin pen system. The company was founded in 1949 and is headquartered in Galway, Ireland.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:52:26"},{"Company Name":"Elevance Health, Inc.","Symbol":"ELV","Current Price":"384.50","Latest MA":"398.68","Latest MA 5":385.7767089844,"Latest MA 9":382.5487840441,"Latest MA 20":385.4461578369,"RSI":49.6659369055,"Price Target":500.7542,"Difference from MA":"-3.56%","Difference from Open":"1.14%","Change from Yesterday":"0.94%","Change from Last Report":"0.16","Latest Volume":"407,549","Market Cap":"86,872,006,656","Earning Date":"22-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":11.0014305,"PB Ratio":2.0412498,"Previous Close":380.93,"ROE":0.14175001,"DTE":70.397,"Industry":"Healthcare Plans","Sector":"Healthcare","Beta":0.617,"Trailing PEG":0.688,"Trailing PE":14.955271,"Trailing PS":14.955271,"Quick Ratio":1.303,"Day High":384.82,"Day Low":376.69,"VS Average Volume":0.226917978,"Company Summary":"Elevance Health, Inc., together with its subsidiaries, operates as a health benefits company in the United States. It operates in four segments: Health Benefits, CarelonRx, Carelon Services, and Corporate & Other. The company offers a variety of health plans and services to individual, employer group risk-based and fee-based, BlueCard, Medicare, Medicaid, and FEP members; health products; a broad array of fee-based administrative managed care services; and specialty and other insurance products and services, such as stop loss, dental, vision, and supplemental health insurance benefits. It also operates in the pharmacy services business; and markets and offers pharmacy services, including home delivery and specialty pharmacies, claims adjudication, formulary management, pharmacy networks, rebate administration, a prescription drug database, and member services, as well as infusion services and injectable therapies through ambulatory infusion centers. In addition, the company provides healthcare related services and capabilities, including specialty care enablement and utilization management support for specialized clinical domains; behavioral health and comprehensive care management services; palliative care services and management; virtual care; and payment integrity, subrogation, clinical data exchange through its HealthOS platform, research and data, reporting and clinical analytics, information technology, and business process support services, as well as manages home health, post-acute institutional management, and durable medical equipment costs; and supports plans in managing home and community-based services. It provides its services under the Anthem Blue Cross and Blue Shield, Wellpoint, and Carelon brands. The company was formerly known as Anthem, Inc. and changed its name to Elevance Health, Inc. in June 2022. Elevance Health, Inc. was incorporated in 2001 and is headquartered in Indianapolis, Indiana.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:52:26"},{"Company Name":"Howmet Aerospace Inc.","Symbol":"HWM","Current Price":"171.47","Latest MA":"131.04","Latest MA 5":171.8139981689,"Latest MA 9":172.5866647,"Latest MA 20":168.977999054,"RSI":57.2353950909,"Price Target":169.86682,"Difference from MA":"30.85%","Difference from Open":"1.65%","Change from Yesterday":"0.43%","Change from Last Report":"0.13","Latest Volume":"1,264,155","Market Cap":"69,217,976,320","Earning Date":"01-05-2025","Earning Time":"Before","Earning Day of Week":"Sunday","PE Ratio":54.09148,"PB Ratio":14.624307,"Previous Close":170.74,"ROE":0.28295,"DTE":72.684,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.432,"Trailing PEG":null,"Trailing PE":56.03595,"Trailing PS":56.03595,"Quick Ratio":0.928,"Day High":171.52,"Day Low":168.5,"VS Average Volume":0.4361036433,"Company Summary":"Howmet Aerospace Inc. provides advanced engineered solutions for the aerospace and transportation industries in the United States, Japan, France, Germany, the United Kingdom, Mexico, Italy, Canada, Poland, China, and internationally. It operates through four segments: Engine Products, Fastening Systems, Engineered Structures, and Forged Wheels. The Engine Products segment offers airfoils and seamless rolled rings primarily for aircraft engines and industrial gas turbines; and rotating and structural parts. The Fastening Systems segment produces aerospace fastening systems, as well as commercial transportation, industrial, and other fasteners; and latches, bearings, fluid fittings, and installation tools. The Engineered Structures segment provides titanium ingots and mill products, aluminum and nickel forgings, and machined components and assemblies for aerospace and defense applications; and titanium forgings, extrusions, and forming and machining services for airframe, wing, aero-engine, and landing gear components. The Forged Wheels segment offers forged aluminum wheels and related products for heavy-duty trucks and commercial transportation markets. The company was formerly known as Arconic Inc. Howmet Aerospace Inc. was founded in 1888 and is based in Pittsburgh, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:52:26"},{"Company Name":"CSX Corporation","Symbol":"CSX","Current Price":"32.27","Latest MA":"31.53","Latest MA 5":32.2809998779,"Latest MA 9":32.0194444275,"Latest MA 20":31.48387006,"RSI":63.8518028318,"Price Target":32.84,"Difference from MA":"2.34%","Difference from Open":"0.09%","Change from Yesterday":"-0.15%","Change from Last Report":"0.03","Latest Volume":"3,821,894","Market Cap":"60,611,416,064","Earning Date":"16-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":15.894089,"PB Ratio":4.980704,"Previous Close":32.32,"ROE":0.26121,"DTE":162.012,"Industry":"Railroads","Sector":"Industrials","Beta":1.236,"Trailing PEG":2.1751,"Trailing PE":19.205357,"Trailing PS":19.205357,"Quick Ratio":0.729,"Day High":32.315,"Day Low":31.99,"VS Average Volume":0.2367690034,"Company Summary":"CSX Corporation, together with its subsidiaries, provides rail-based freight transportation services in the United States and Canada. It operates through two segments: rail and trucking. The company offers rail services; and transportation of intermodal containers and trailers, as well as other transportation services, such as rail-to-truck transfers and bulk commodity operations. It also transports chemicals, agricultural and food products, minerals, automotive, forest products, fertilizers, and metals and equipment; and coal, coke, and iron ore to electricity-generating power plants, steel manufacturers, and industrial plants, as well as exports coal to deep-water port facilities. In addition, the company provides intermodal services through a network of approximately 30 terminals transporting manufactured consumer goods in containers; and drayage services, including the pickup and delivery of intermodal shipments. It serves the automotive industry with distribution centers and storage locations, as well as connects non-rail served customers through transferring products, such as plastics and ethanol from rail to trucks. The company operates approximately 20,000 route mile rail network, which serves various population centers in 26 states east of the Mississippi River, the District of Columbia, and the Canadian provinces of Ontario and Quebec, as well as owns and leases approximately 3,500 locomotives. It serves production and distribution facilities through track connections. CSX Corporation was incorporated in 1978 and is headquartered in Jacksonville, Florida.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:52:26"},{"Company Name":"Cencora, Inc.","Symbol":"COR","Current Price":"293.63","Latest MA":"259.37","Latest MA 5":287.4800039063,"Latest MA 9":288.7166674805,"Latest MA 20":289.8990003052,"RSI":63.9100684769,"Price Target":321.49667,"Difference from MA":"13.21%","Difference from Open":"1.80%","Change from Yesterday":"2.41%","Change from Last Report":"0.13","Latest Volume":"651,177","Market Cap":"56,912,248,832","Earning Date":"07-05-2025","Earning Time":"Before","Earning Day of Week":"Saturday","PE Ratio":17.948044,"PB Ratio":56.175625,"Previous Close":286.64,"ROE":1.4178,"DTE":827.73,"Industry":"Medical Distribution","Sector":"Healthcare","Beta":0.571,"Trailing PEG":0.7994,"Trailing PE":34.024334,"Trailing PS":34.024334,"Quick Ratio":0.482,"Day High":293.63,"Day Low":287.4,"VS Average Volume":0.3644489641,"Company Summary":"Cencora, Inc. sources and distributes pharmaceutical products in the United States and internationally. The company's U.S. Healthcare Solutions segment distributes pharmaceuticals, over-the-counter healthcare products, home healthcare supplies and equipment, and related services to acute care hospitals and health systems, independent and chain retail pharmacies, mail order pharmacies, medical clinics, long-term care and alternate site pharmacies, and other customers; provides pharmacy management, staffing, and other consulting services; supply management software to retail and institutional healthcare providers; packaging solutions to institutional and retail healthcare providers; clinical trial support, product post-approval, and commercialization support services; data analytics, outcomes research, and other services for biotechnology and pharmaceutical manufacturers; pharmaceuticals, vaccines, parasiticides, diagnostics, micro feed ingredients, and other products to the companion animal and production animal markets; and sales force services to manufacturers. This segment also distributes plasma and other blood products, injectable pharmaceuticals, vaccines, and other specialty products; and offers other services to physicians who specialize in various disease states, such as oncology, as well as to other healthcare providers, including hospitals and dialysis clinics. Its International Healthcare Solutions segment provides international pharmaceutical wholesale and related service, and global commercialization services; distributes pharmaceuticals, other healthcare products, and related services to pharmacies, doctors, health centers, and hospitals; and offers specialty transportation and logistics services for the biopharmaceutical industry. The company was formerly known as AmerisourceBergen Corporation and changed its name to Cencora, Inc. in August 2023. Cencora, Inc. was founded in 1871 and is headquartered in Conshohocken, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:52:26"},{"Company Name":"Nasdaq, Inc.","Symbol":"NDAQ","Current Price":"86.92","Latest MA":"78.60","Latest MA 5":86.2080005493,"Latest MA 9":85.1911114502,"Latest MA 20":83.4925000153,"RSI":88.9460018086,"Price Target":84.22222,"Difference from MA":"10.58%","Difference from Open":"0.37%","Change from Yesterday":"0.15%","Change from Last Report":"0.05","Latest Volume":"1,083,737","Market Cap":"49,902,682,112","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":27.681528,"PB Ratio":4.3207235,"Previous Close":86.79,"ROE":0.11415,"DTE":84.587,"Industry":"Financial Data & Stock Exchanges","Sector":"Financial Services","Beta":1.013,"Trailing PEG":1.7527,"Trailing PE":39.330315,"Trailing PS":39.330315,"Quick Ratio":0.212,"Day High":87.07,"Day Low":85.935,"VS Average Volume":0.3028240445,"Company Summary":"Nasdaq, Inc. operates as a technology company that serves capital markets and other industries worldwide. It operates in three segments: Capital Access Platforms, Financial Technology, and Market Services. The company distributes historical and real-time market data; develops and licenses Nasdaq-branded indices and financial products; investor relations intelligence, governance solutions, and sustainability solution products for public and private companies and organizations; and insights and workflow solutions, as well as operates listing platforms. It also offers Verafin, a cloud-based platform to detect, investigate, and report money laundering and financial frauds; AxiomSL, a risk data management and regulatory reporting solution; surveillance solutions, including a SaaS platform to assist in complying with market rules, regulations, and internal market surveillance policies; Calypso, a platform providing cross-asset, front-to-back trading, treasury, risk, and collateral management solutions; and handles assets comprising cash equities, equity derivatives, currencies, various interest-bearing securities, commodities, energy products, and digital currencies; and trade management and colocation services. In addition, the company provides equity derivative trading and clearing, cash equity trading, fixed income and commodities trading and clearing, and currency trading services; and operates various exchanges, including derivatives, commodities, cash equity, debt, structured products, and exchange traded products; and clearing, settlement, and central depository services. The company was formerly known as The NASDAQ OMX Group, Inc. and changed its name to Nasdaq, Inc. in September 2015. Nasdaq, Inc. was founded in 1971 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:52:26"},{"Company Name":"General Motors Company","Symbol":"GM","Current Price":"49.23","Latest MA":"49.63","Latest MA 5":48.6860001526,"Latest MA 9":48.2768355984,"Latest MA 20":48.8128072968,"RSI":56.6254148981,"Price Target":54.15407,"Difference from MA":"-0.80%","Difference from Open":"-0.47%","Change from Yesterday":"-1.28%","Change from Last Report":"-0.04","Latest Volume":"3,758,005","Market Cap":"47,331,446,784","Earning Date":"22-07-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":4.6575212,"PB Ratio":0.7387677,"Previous Close":49.87,"ROE":0.08557,"DTE":201.974,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":1.344,"Trailing PEG":1.5547,"Trailing PE":6.8756986,"Trailing PS":6.8756986,"Quick Ratio":0.958,"Day High":49.54,"Day Low":48.6,"VS Average Volume":0.2805160653,"Company Summary":"General Motors Company designs, builds, and sells trucks, crossovers, cars, and automobile parts worldwide. The company operates through GM North America, GM International, Cruise, and GM Financial segments. It markets its vehicles primarily under the Buick, Cadillac, Chevrolet, GMC, Baojun, and Wuling brand names. In addition, the company sells trucks, crossovers, cars, and automobile parts through retail dealers, distributors and dealers, as well as to fleet customers, including daily rental car companies, commercial fleet customers, leasing companies, and governments. Further, it offers software-enabled services and subscriptions; and various range of after-sale services through dealer network, such as maintenance, light repairs, collision repairs, vehicle accessories, and extended service warranties. Additionally, the company provides automotive financing; and software-enabled services and subscriptions. General Motors Company was founded in 1908 and is headquartered in Detroit, Michigan.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:52:26"},{"Company Name":"Brown & Brown, Inc.","Symbol":"BRO","Current Price":"106.28","Latest MA":"111.00","Latest MA 5":106.9360003052,"Latest MA 9":109.0988889567,"Latest MA 20":110.4229996338,"RSI":34.5104006808,"Price Target":118.37727,"Difference from MA":"-4.25%","Difference from Open":"1.19%","Change from Yesterday":"1.72%","Change from Last Report":"0.00","Latest Volume":"4,661,574","Market Cap":"30,468,349,952","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":25.985329,"PB Ratio":4.4717464,"Previous Close":104.48,"ROE":0.16519,"DTE":59.026,"Industry":"Insurance Brokers","Sector":"Financial Services","Beta":0.839,"Trailing PEG":null,"Trailing PE":29.604458,"Trailing PS":29.604458,"Quick Ratio":0.446,"Day High":107.1,"Day Low":104.355,"VS Average Volume":2.2166010153,"Company Summary":"Brown & Brown, Inc. markets and sells insurance products and services in the United States, Canada, Ireland, the United Kingdom, and internationally. It operates through four segments: Retail, Programs, Wholesale Brokerage, and Services. The Retail segment provides property and casualty, employee benefits insurance products, personal insurance products, specialties insurance products, risk management strategies, loss control survey and analysis, consultancy, and claims processing services. It serves commercial, public and quasi-public entities, professional, and individual customers. The Programs segment offers professional liability and related package insurance products for dentistry, legal, eyecare, insurance, financial, physicians, real estate title professionals, as well as supplementary insurance products related to weddings, events, medical facilities, and cyber liabilities. This segment also provides public entity-related and specialty programs through a network of independent agents; and program management services for insurance carrier partners. The Wholesale Brokerage segment markets and sells excess and surplus commercial and personal lines insurance through independent agents and brokers. The Services segment offers third-party claims administration and medical utilization management services in the workers' compensation and all-lines liability arenas, Medicare Set-aside, Social Security disability, Medicare benefits advocacy, and claims adjusting services. Brown & Brown, Inc. was founded in 1939 and is headquartered in Daytona Beach, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:54:37"},{"Company Name":"DuPont de Nemours, Inc.","Symbol":"DD","Current Price":"68.81","Latest MA":"74.02","Latest MA 5":69.0140004272,"Latest MA 9":68.2166674466,"Latest MA 20":68.0973458557,"RSI":54.6461337863,"Price Target":85.07053,"Difference from MA":"-7.04%","Difference from Open":"-0.07%","Change from Yesterday":"-0.85%","Change from Last Report":"0.26","Latest Volume":"587,117","Market Cap":"28,796,915,712","Earning Date":"02-05-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":15.674259,"PB Ratio":1.261134,"Previous Close":69.4,"ROE":0.00199,"DTE":33.114,"Industry":"Specialty Chemicals","Sector":"Basic Materials","Beta":1.03,"Trailing PEG":0.6471,"Trailing PE":2293.6667,"Trailing PS":2293.6667,"Quick Ratio":0.872,"Day High":69.07,"Day Low":68.24,"VS Average Volume":0.1738701801,"Company Summary":"DuPont de Nemours, Inc. provides technology-based materials and solutions in the United States, Canada, the Asia Pacific, Latin America, Europe, the Middle East, and Africa. It operates through Electronics & Industrial, Water & Protection, and Corporate & Other segments. The Electronics & Industrial segment supplies materials and solutions for the fabrication of semiconductors and integrated circuits. This segment also provides semiconductor and advanced packaging materials; dielectric and metallization solutions for chip packaging; silicones for light emitting diode packaging and semiconductor applications; and permanent and process chemistries for the fabrication of printed circuit boards to include laminates and substrates, and electroless and electrolytic metallization solutions, and electromagnetic shielding and thermal management solutions, as well as patterning solutions, and materials and metallization processes for metal finishing, decorative, and industrial applications. In addition, it offers various materials to manufacture rigid and flexible displays for organic light emitting diode, and other display applications; provides high performance parts, and specialty silicone elastomers, and lubricants to automotive, aerospace, electronics, industrial, and healthcare markets; and photopolymer plates and platemaking systems used in flexographic printing, and digital inks for textile, commercial, and home-office printing applications. The Water & Protection segment provides engineered products and integrated systems for worker safety, water purification and separation, transportation, energy, medical packaging and building materials. The Corporate & Other segment offers auto adhesives and fluids; Multibase; and Tedlar products. The company was formerly known as DowDuPont Inc. and changed its name to DuPont de Nemours, Inc. in June 2019. DuPont de Nemours, Inc. was incorporated in 2015 and is headquartered in Wilmington, Delaware.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:54:37"},{"Company Name":"Nucor Corporation","Symbol":"NUE","Current Price":"118.44","Latest MA":"126.52","Latest MA 5":120.8699992065,"Latest MA 9":120.853333096,"Latest MA 20":115.8769999237,"RSI":50.6362536878,"Price Target":145.37154,"Difference from MA":"-6.38%","Difference from Open":"2.07%","Change from Yesterday":"1.12%","Change from Last Report":"0.34","Latest Volume":"812,715","Market Cap":"27,330,150,400","Earning Date":"28-04-2025","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":12.653847,"PB Ratio":1.361802,"Previous Close":117.13,"ROE":0.074039996,"DTE":37.319,"Industry":"Steel","Sector":"Basic Materials","Beta":1.747,"Trailing PEG":null,"Trailing PE":20.88889,"Trailing PS":20.88889,"Quick Ratio":1.389,"Day High":118.44,"Day Low":115.66,"VS Average Volume":0.3108502997,"Company Summary":"Nucor Corporation engages in the manufacture and sale of steel and steel products. The company operates in three segments: Steel Mills, Steel Products, and Raw Materials. The Steel Mills segment produces hot-rolled, cold-rolled, and galvanized sheet steel products; plate steel products; wide-flange beams, beam blanks, and H-piling and sheet piling structural steel products; and bar steel products, such as blooms, billets, concrete reinforcing and merchant bars, and engineered special bar quality products. It also engages in the steel trading and rebar distribution businesses. This segment sells its products to steel service centers, fabricators, and manufacturers in the United States, Canada, and Mexico. The Steel Products segment offers steel joists and joist girders, steel decks, and galvanized torque tubes for used in solar arrays, hollow structural section steel tubing, electrical conduit, fabricated concrete reinforcing steel, cold finished steel, steel fasteners, steel grating and expanded metal, wire and wire mesh, metal building systems, insulated metal panels, steel racking, overhead doors, and utility towers and structures for communications and energy transmission. This segment is also involved in the piling distribution business. The Raw Materials segment produces direct reduced iron (DRI); brokers ferrous and nonferrous metals, pig iron, hot briquetted iron, and DRI; supplies ferro-alloys; processes ferrous and nonferrous scrap metal; and engages in the natural gas production and industrial gas business. This segment sells its ferrous scrap to electric arc furnace steel mills and foundries for manufacturing process; and nonferrous scrap metal to aluminum can producers, secondary aluminum smelters, steel mills and other processors, and consumers of various nonferrous metals. Nucor Corporation was founded in 1905 and is based in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:54:37"},{"Company Name":"VeriSign, Inc.","Symbol":"VRSN","Current Price":"281.51","Latest MA":"231.17","Latest MA 5":280.9459941406,"Latest MA 9":278.7144425456,"Latest MA 20":277.8777018433,"RSI":59.5543792332,"Price Target":253.835,"Difference from MA":"21.77%","Difference from Open":"0.47%","Change from Yesterday":"0.60%","Change from Last Report":"-0.01","Latest Volume":"215,768","Market Cap":"26,433,789,952","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":32.54451,"PB Ratio":-13.398858,"Previous Close":279.83,"ROE":null,"DTE":null,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.771,"Trailing PEG":2.3882,"Trailing PE":34.45655,"Trailing PS":34.45655,"Quick Ratio":0.504,"Day High":282.1,"Day Low":277.94,"VS Average Volume":0.2333777516,"Company Summary":"VeriSign, Inc., together with its subsidiaries, provides internet infrastructure and domain name registry services that enables internet navigation for various recognized domain names worldwide. The company enables the security, stability, and resiliency of internet infrastructure and services, including providing root zone maintainer services, operating two of thirteen internet root servers; and offering registration services and authoritative resolution for the .com and .net domains, which supports global e-commerce. It operates directory for .name and .cc; and back-end systems for .edu, domain names. The company was incorporated in 1995 and is headquartered in Reston, Virginia.","Stock Sentiment":"N\/A","Row Color":"positive-row","Last Updated":"12-06-2025 20:54:37"},{"Company Name":"Super Micro Computer, Inc.","Symbol":"SMCI","Current Price":"43.85","Latest MA":"36.11","Latest MA 5":42.9289994202,"Latest MA 9":42.659444224,"Latest MA 20":42.4682501068,"RSI":61.591733746,"Price Target":42.93312,"Difference from MA":"21.46%","Difference from Open":"2.90%","Change from Yesterday":"1.49%","Change from Last Report":"0.06","Latest Volume":"17,389,875","Market Cap":"26,173,452,288","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":10.343161,"PB Ratio":4.1024323,"Previous Close":43.21,"ROE":0.20062,"DTE":41.506,"Industry":"Computer Hardware","Sector":"Technology","Beta":1.397,"Trailing PEG":null,"Trailing PE":23.834238,"Trailing PS":23.834238,"Quick Ratio":3.639,"Day High":44.08,"Day Low":42.32,"VS Average Volume":0.3515101999,"Company Summary":"Super Micro Computer, Inc., together with its subsidiaries, develops and sells high performance server and storage solutions based on modular and open architecture in the United States, Europe, Asia, and internationally. It offers various IT solutions, including complete servers, storage systems, modular blade servers, blades, workstations, full-rack scale solutions, networking devices, server sub-systems, and server management and security software. The company also provides application-optimized server solutions, rackmount and blade servers, storage, and subsystems and accessories; and server software management solutions, such as Server Management Suite, including Supermicro Server Manager, Supermicro Power Management software, Supermicro Update Manager, SuperCloud Composer, and SuperDoctor 5. In addition, it offers server subsystems and accessories comprising server boards, chassis, power supplies, and other accessories. Further, the company identifies service requirements, creates and executes project plans, conducts verification testing and training activities, and provides technical documentation services. Additionally, it offers help desk and on-site support services for its server and storage systems; and customer support services, including ongoing maintenance and technical support for its products. The company provides its products to enterprise data centers, cloud computing, artificial intelligence, 5G, and edge computing markets. It sells its products through direct and indirect sales force, distributors, value-added resellers, system integrators, and original equipment manufacturers. The company was incorporated in 1993 and is headquartered in San Jose, California.","Stock Sentiment":"N\/A","Row Color":"positive-row","Last Updated":"12-06-2025 20:54:37"},{"Company Name":"PPL Corporation","Symbol":"PPL","Current Price":"34.27","Latest MA":"33.67","Latest MA 5":33.8357065063,"Latest MA 9":33.9513292236,"Latest MA 20":34.1777523483,"RSI":56.6590873597,"Price Target":37.47333,"Difference from MA":"1.77%","Difference from Open":"0.99%","Change from Yesterday":"1.44%","Change from Last Report":"0.05","Latest Volume":"2,005,737","Market Cap":"25,331,249,152","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":18.724316,"PB Ratio":1.7712846,"Previous Close":33.78,"ROE":0.07018,"DTE":121.312,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.668,"Trailing PEG":1.2943,"Trailing PE":25.571268,"Trailing PS":25.571268,"Quick Ratio":0.52,"Day High":34.31,"Day Low":33.84,"VS Average Volume":0.3558574886,"Company Summary":"PPL Corporation provides electricity and natural gas to approximately 3.5 million customers in the United States. It operates through three segments: Kentucky Regulated, Pennsylvania Regulated, and Rhode Island Regulated. The company delivers electricity to customers in Pennsylvania, Kentucky, Virginia, and Rhode Island; delivers natural gas to customers in Kentucky and Rhode Island; and generates electricity from power plants in Kentucky. PPL Corporation was founded in 1920 and is headquartered in Allentown, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:54:37"},{"Company Name":"Corpay, Inc.","Symbol":"CPAY","Current Price":"348.83","Latest MA":"349.31","Latest MA 5":345.6719997559,"Latest MA 9":337.1577773709,"Latest MA 20":335.7574988403,"RSI":70.8368514647,"Price Target":393.218,"Difference from MA":"-0.14%","Difference from Open":"1.07%","Change from Yesterday":"0.03%","Change from Last Report":"-0.05","Latest Volume":"176,594","Market Cap":"24,590,211,072","Earning Date":"07-05-2025","Earning Time":"Before","Earning Day of Week":"Saturday","PE Ratio":15.727231,"PB Ratio":7.117527,"Previous Close":348.73,"ROE":0.30040002,"DTE":235.922,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.964,"Trailing PEG":null,"Trailing PE":24.46213,"Trailing PS":24.46213,"Quick Ratio":0.68,"Day High":350.535,"Day Low":344.68,"VS Average Volume":0.3622775436,"Company Summary":"Corpay, Inc. operates as a payments company that helps businesses and consumers manage vehicle-related expenses, lodging expenses, and corporate payments in the United States, Brazil, the United Kingdom, and internationally. The company offers vehicle payment solutions, which include fuel, tolls, parking, vehicle compliance, fleet maintenance, and long-haul transportation services, as well as prepaid food and transportation vouchers and cards. It also provides corporate payment solutions consisting of accounts payable AP automation; virtual cards, cross-border solutions; and purchasing and T&E travel and entertainment card products, as well as lodging payments solutions for employees who travel overnight for work purposes; traveling crews and stranded passengers from airlines and cruise lines; and insurance policyholders displaced from their homes due to damage or catastrophe; workforce lodging solutions for business travel programs; airline logistics, crew management, insurance, and other payments solutions. In addition, the company offers gifts and payroll cards. It serves business, merchant, consumer, and payment network customers. The company was formerly known as FLEETCOR Technologies, Inc. and changed its name to Corpay, Inc. in March 2024. Corpay, Inc. was founded in 1986 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:54:37"},{"Company Name":"STERIS plc (Ireland)","Symbol":"STE","Current Price":"241.95","Latest MA":"222.26","Latest MA 5":242.2940008545,"Latest MA 9":242.5066684299,"Latest MA 20":244.9295014954,"RSI":48.446746315,"Price Target":263.09888,"Difference from MA":"8.86%","Difference from Open":"0.47%","Change from Yesterday":"0.50%","Change from Last Report":"0.10","Latest Volume":"123,052","Market Cap":"23,801,178,112","Earning Date":"14-05-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":24.267803,"PB Ratio":3.6017861,"Previous Close":240.74,"ROE":0.09458999,"DTE":33.292,"Industry":"Medical Devices","Sector":"Healthcare","Beta":0.943,"Trailing PEG":1.9514,"Trailing PE":39.2776,"Trailing PS":39.2776,"Quick Ratio":1.189,"Day High":242.125,"Day Low":239.74,"VS Average Volume":0.1895948699,"Company Summary":"STERIS plc provides infection prevention products and services worldwide. It operates through three segments: Healthcare, Applied Sterilization Technologies (AST), and Life Sciences. The Healthcare segment offers cleaning chemistries and sterility assurance products; automated endoscope reprocessing system and tracking products; endoscopy accessories, washers, sterilizers, and other pieces of capital equipment for the operation of a sterile processing department; and equipment used directly in procedure rooms, including surgical tables, lights, and connectivity solutions, as well as equipment management services. It also provides capital equipment installation, maintenance, upgradation, repair, and troubleshooting services; preventive maintenance programs and repair services; instrument, devices, and endoscope repair and maintenance services; and custom process improvement consulting and outsourced instrument sterile processing services. The AST segment provides contract sterilization and testing services for medical device and pharmaceutical manufacturers through a network of contract sterilization and laboratory facilities, as well as integrated sterilization equipment and control systems to medical device manufacturers and research institutions. The Life Sciences segment designs, manufactures, and sells consumable products, such as pharmaceutical detergents, cleanroom disinfectants and sterilants, pharmaceutical grade and research sterilizers and washers, sterility assurance and maintenance products, vaporized hydrogen peroxide room decontamination systems and sterilizers, and high purity water and pure steam generators. It also offers equipment installation, maintenance, upgradation, repair, and troubleshooting services; and preventive maintenance programs and repair services. It serves its products and services to hospitals, other healthcare providers, and pharmaceutical manufacturers. The company was founded in 1985 and is headquartered in Mentor, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:54:37"},{"Company Name":"Archer-Daniels-Midland Company","Symbol":"ADM","Current Price":"49.29","Latest MA":"48.38","Latest MA 5":48.4039999084,"Latest MA 9":47.9577775574,"Latest MA 20":48.328751709,"RSI":68.5770258133,"Price Target":49.27273,"Difference from MA":"1.89%","Difference from Open":"1.92%","Change from Yesterday":"1.27%","Change from Last Report":"-0.03","Latest Volume":"2,014,951","Market Cap":"23,681,380,352","Earning Date":"06-05-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":9.721893,"PB Ratio":1.0696383,"Previous Close":48.67,"ROE":0.05888,"DTE":55.504,"Industry":"Farm Products","Sector":"Consumer Defensive","Beta":0.656,"Trailing PEG":null,"Trailing PE":17.355635,"Trailing PS":17.355635,"Quick Ratio":0.362,"Day High":49.45,"Day Low":48.2001,"VS Average Volume":0.4825507559,"Company Summary":"Archer-Daniels-Midland Company engages in the procurement, transportation, storage, processing, and merchandising of agricultural commodities, ingredients, flavors, and solutions in the United States, Switzerland, the Cayman Islands, Brazil, Mexico, Canada, the United Kingdom, and internationally. It operates in three segments: Ag Services and Oilseeds; Carbohydrate Solutions; and Nutrition. The company originates, merchandises, stores, and transports agricultural raw materials, such as oilseeds and soft seeds. It engages in the agricultural commodity and feed product import, export, and distribution; and various structured trade finance activities. In addition, the company offers soybean meal and oil; vegetable and salad oils and protein meals; ingredients for the food, feed, energy, and industrial customers; margarine, shortening, and other food products; and partially refined oils to produce biodiesel and glycols for use in chemicals, paints, and other industrial products. Further, it provides peanuts, peanut-derived ingredients, and cotton cellulose pulp; sweeteners, corn and wheat starches, syrup, glucose, wheat flour, and dextrose; alcohol, and other food and animal feed ingredients; ethyl alcohol and ethanol; corn gluten feed and meal; distillers' grains; corn germ; and citric acids. Additionally, the company provides proteins, natural flavors, flavor systems, natural colors, emulsifiers, soluble fiber, polyols, hydrocolloids, probiotics, prebiotics, postbiotics, enzymes, and botanical extracts; and other specialty food and feed ingredients; edible beans; formula feeds, and animal health and nutrition products; and contract and private label pet treats and food products. It also offers futures commission merchant; commodity brokerage services; cash margins and securities pledged to commodity exchange clearinghouse; and cash pledged as security under certain insurance arrangements. The company was founded in 1902 and is headquartered in Chicago, Illinois.","Stock Sentiment":"N\/A","Row Color":"positive-row","Last Updated":"12-06-2025 20:54:37"},{"Company Name":"Cboe Global Markets, Inc.","Symbol":"CBOE","Current Price":"225.56","Latest MA":"211.09","Latest MA 5":222.3390029297,"Latest MA 9":224.0627805583,"Latest MA 20":225.448250946,"RSI":54.0868904156,"Price Target":225.33333,"Difference from MA":"6.85%","Difference from Open":"1.20%","Change from Yesterday":"1.20%","Change from Last Report":"-0.07","Latest Volume":"252,820","Market Cap":"23,618,539,520","Earning Date":"02-05-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":24.57026,"PB Ratio":5.3063025,"Previous Close":222.89,"ROE":0.19018,"DTE":36.019,"Industry":"Financial Data & Stock Exchanges","Sector":"Financial Services","Beta":0.428,"Trailing PEG":null,"Trailing PE":29.600393,"Trailing PS":29.600393,"Quick Ratio":0.785,"Day High":225.98,"Day Low":223.1263,"VS Average Volume":0.2637519926,"Company Summary":"Cboe Global Markets, Inc., through its subsidiaries, operates as an options exchange in the United States and internationally. It operates through six segments: Options, North American Equities, Europe and Asia Pacific, Futures, Global FX, and Digital. The Options segment trades in listed market indices. Its North American Equities segment trades in listed U.S. and Canadian equities. This segment also offers exchange-traded products (ETP) transaction and listing services. The Europe and Asia Pacific segment provides pan-European listed equities and derivatives transaction services, ETPs, exchange-traded commodities, and international depository receipts, as well as ETP listings and clearing services. Its Futures segment offers and trades in futures and other related products. The Global FX segment provides institutional foreign exchange (FX) trading and non-deliverable forward FX transactions services. Its Digital segment offers Cboe Digital, an operator of the United States based digital asset spot market and a regulated futures exchange; Cboe Clear Digital, a regulated clearinghouse; licensing of proprietary market data; and access and capacity services. It has strategic relationships with S&P Dow Jones Indices, LLC; Frank Russell Company; FTSE International Limited; and MSCI Inc. The company was formerly known as CBOE Holdings, Inc. and changed its name to Cboe Global Markets, Inc. in October 2017. Cboe Global Markets, Inc. was founded in 1973 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"12-06-2025 20:54:37"},{"Company Name":"Dow Inc.","Symbol":"DOW","Current Price":"30.23","Latest MA":"35.25","Latest MA 5":29.908999939,"Latest MA 9":28.9994447072,"Latest MA 20":28.6710334587,"RSI":66.7540092899,"Price Target":36.11778,"Difference from MA":"-14.24%","Difference from Open":"0.05%","Change from Yesterday":"-1.48%","Change from Last Report":"0.05","Latest Volume":"3,396,010","Market Cap":"21,364,903,936","Earning Date":"24-07-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":9.71865,"PB Ratio":1.2726316,"Previous Close":30.68,"ROE":0.020599999,"DTE":103.62,"Industry":"Chemicals","Sector":"Basic Materials","Beta":0.878,"Trailing PEG":1.4251,"Trailing PE":75.5625,"Trailing PS":75.5625,"Quick Ratio":0.603,"Day High":30.45,"Day Low":29.95,"VS Average Volume":0.3604994027,"Company Summary":"Dow Inc., through its subsidiaries, provides various materials science solutions for packaging, infrastructure, mobility, and consumer applications in the United States, Canada, Europe, the Middle East, Africa, India, the Asia Pacific, and Latin America. The company operates through Packaging & Specialty Plastics, Industrial Intermediates & Infrastructure, and Performance Materials & Coatings segments. The Packaging & Specialty Plastics segment provides ethylene, propylene, polyethylene, and aromatics products; and other ethylene derivatives, such as polyolefin elastomers, ethylene vinyl acetate, and ethylene propylene diene monomer rubber. The Industrial Intermediates & Infrastructure segment offers polyurethanes, including propylene oxide, propylene glycol, and polyether polyols; aromatic isocyanates and fully formulated polyurethane systems; and chlor-alkali and vinyl comprising chlorine and caustic soda, ethylene dichloride, and vinyl chloride monomer; and construction chemicals consisting of cellulose ethers, redispersible latex powders, and acrylic emulsions, as well as coatings, adhesives, sealants, elastomers, and composites. The Performance Materials & Coatings segment provides architectural paints and coatings, and industrial coatings; and acrylics-based building blocks, silicon metals, siloxanes, and intermediates. The company also engages in the property and casualty insurance, as well as reinsurance business. Dow Inc. was founded in 1897 and is headquartered in Midland, Michigan.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:54:37"},{"Company Name":"Amcor plc","Symbol":"AMCR","Current Price":"9.21","Latest MA":"9.63","Latest MA 5":9.1789999161,"Latest MA 9":9.1261110391,"Latest MA 20":9.1592499294,"RSI":55.7742981377,"Price Target":11.60444,"Difference from MA":"-4.38%","Difference from Open":"0.71%","Change from Yesterday":"0.49%","Change from Last Report":"0.05","Latest Volume":"10,459,963","Market Cap":"21,091,784,704","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":11.651898,"PB Ratio":3.4527383,"Previous Close":9.16,"ROE":0.20796,"DTE":241.41,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":0.733,"Trailing PEG":1.802,"Trailing PE":16.4375,"Trailing PS":16.4375,"Quick Ratio":1.019,"Day High":9.21,"Day Low":9.09,"VS Average Volume":0.2799983564,"Company Summary":"Amcor plc develops, produces, and sells packaging products in Europe, North America, Latin America, and the Asia Pacific. The company operates in two segments, Flexibles and Rigid Packaging. The Flexibles segment offers flexible and film packaging products in the food and beverage, medical and pharmaceutical, fresh produce, snack food, personal care, and other industries. The Rigid Packaging segment provides rigid containers for various beverage and food products, including carbonated soft drinks, water, juices, sports drinks, milk-based beverages, spirits and beer, sauces, dressings, spreads, and personal care items; and plastic caps for various applications. It sells its products through its direct sales force. The company was incorporated in 1926 and is headquartered in Zurich, Switzerland.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:54:37"},{"Company Name":"CMS Energy Corporation","Symbol":"CMS","Current Price":"70.40","Latest MA":"69.22","Latest MA 5":70.0420010376,"Latest MA 9":70.0455557929,"Latest MA 20":70.2425009918,"RSI":53.8122943875,"Price Target":75.27125,"Difference from MA":"1.70%","Difference from Open":"0.47%","Change from Yesterday":"0.57%","Change from Last Report":"0.02","Latest Volume":"473,243","Market Cap":"21,058,330,624","Earning Date":"24-04-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":19.664804,"PB Ratio":2.5960617,"Previous Close":70.0,"ROE":0.11234,"DTE":190.138,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.379,"Trailing PEG":2.8351,"Trailing PE":20.828402,"Trailing PS":20.828402,"Quick Ratio":0.568,"Day High":70.43,"Day Low":70.0,"VS Average Volume":0.1708087884,"Company Summary":"CMS Energy Corporation operates as an energy company primarily in Michigan. The company operates through three segments: Electric Utility; Gas Utility; and NorthStar Clean Energy. The Electric Utility segment is involved in the generation, purchase, distribution, and sale of electricity. This segment generates electricity through coal, wind, gas, renewable energy, oil, and nuclear sources. Its distribution system comprises 270 miles of high-voltage distribution overhead lines; 4 miles of high-voltage distribution underground lines; 4,646 miles of high-voltage distribution overhead lines; 18 miles of high-voltage distribution underground lines; 81,924 miles of electric distribution overhead lines; 9,775 miles of underground distribution lines; and 1,098 substations. The Gas Utility segment engages in the purchase, transmission, storage, distribution, and sale of natural gas, which includes 2,342 miles of transmission lines; 15 gas storage fields; 28,368 miles of distribution mains; and 8 compressor stations. The NorthStar Clean Energy segment is involved in the independent power production and marketing, including the development and operation of renewable generation. The company serves 1.9 million electric and 1.8 million gas customers, including residential, commercial, and diversified industrial customers. The company was incorporated in 1987 and is headquartered in Jackson, Michigan.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:54:37"},{"Company Name":"T. Rowe Price Group, Inc.","Symbol":"TROW","Current Price":"94.78","Latest MA":"103.22","Latest MA 5":95.0150001831,"Latest MA 9":94.203889228,"Latest MA 20":94.931249054,"RSI":52.6421404214,"Price Target":94.07692,"Difference from MA":"-8.18%","Difference from Open":"0.56%","Change from Yesterday":"-0.33%","Change from Last Report":"0.30","Latest Volume":"639,220","Market Cap":"20,882,653,184","Earning Date":"02-05-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":10.137433,"PB Ratio":2.0157588,"Previous Close":95.1,"ROE":0.18447,"DTE":4.48,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.513,"Trailing PEG":2.9602,"Trailing PE":10.758797,"Trailing PS":10.758797,"Quick Ratio":3.886,"Day High":94.885,"Day Low":93.275,"VS Average Volume":0.3078063943,"Company Summary":"T. Rowe Price Group, Inc. is a publicly owned investment manager. The firm provides its services to individuals, institutional investors, retirement plans, financial intermediaries, and institutions. It launches and manages equity and fixed income mutual funds. The firm invests in the public equity and fixed income markets across the globe. It employs fundamental and quantitative analysis with a bottom-up approach. The firm utilizes in-house and external research to make its investments. It employs socially responsible investing with a focus on environmental, social, and governance issues. It makes investment in late-stage venture capital transactions and usually invests between $3 million and $5 million. The firm was previously known as T. Rowe Group, Inc. and T. Rowe Price Associates, Inc. T. Rowe Price Group, Inc. was founded in 1937 and is based in Baltimore, Maryland, with additional offices in Colorado Springs, Colorado; Owings Mills, Maryland; San Francisco, California; New York, New York; Philadelphia, Pennsylvania; Tampa, Florida; Toronto, Ontario; Hellerup, Denmark; Amsterdam, The Netherlands; Luxembourg, Grand Duchy of Luxembourg; Zurich, Switzerland; Dubai, United Arab Emirates; London, United Kingdom; Sydney, New South Wales; Hong Kong; Tokyo, Japan; Singapore; Frankfurt, Shanghai, China; Germany, Madrid, Spain, Milan, Italy, Stockholm, Sweden, Melbourne, Australia, Amsterdam, Netherlands and Washington, DC.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:54:37"},{"Company Name":"Waters Corporation","Symbol":"WAT","Current Price":"347.80","Latest MA":"369.59","Latest MA 5":348.6374968262,"Latest MA 9":348.4152746582,"Latest MA 20":351.3563712769,"RSI":47.1778348085,"Price Target":387.56525,"Difference from MA":"-5.90%","Difference from Open":"0.75%","Change from Yesterday":"0.50%","Change from Last Report":"-0.02","Latest Volume":"105,391","Market Cap":"20,697,114,624","Earning Date":"06-05-2025","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":26.89849,"PB Ratio":10.544749,"Previous Close":346.05,"ROE":0.40822,"DTE":78.582,"Industry":"Diagnostics & Research","Sector":"Healthcare","Beta":1.117,"Trailing PEG":2.2787,"Trailing PE":31.617952,"Trailing PS":31.617952,"Quick Ratio":1.141,"Day High":348.26,"Day Low":341.51,"VS Average Volume":0.1946588008,"Company Summary":"Waters Corporation provides analytical workflow solutions in Asia, the Americas, and Europe. It operates through two segments: Waters and TA. The company designs, manufactures, sells, and services high and ultra-performance liquid chromatography, as well as mass spectrometry (MS) technology systems and support products, including chromatography columns, other consumable products, and post-warranty service plans. It designs, manufactures, sells, and services thermal analysis, rheometry, and calorimetry instruments; and develops and supplies software-based products that interface with its instruments, as well as other manufacturers' instruments. In addition, the company offers MS technology are used in drug discovery and development comprising clinical trial testing, the analysis of proteins in disease processes, nutritional safety analysis, and environmental testing. Further, the company provides thermal analysis, rheometry, and calorimetry instruments for use in predicting the suitability and stability of fine chemicals, pharmaceuticals, water, polymers, metals, and viscous liquids for various industrial, consumer good, and healthcare products, as well as for life science research. Its products are used by clinical, pharmaceutical, biochemical, industrial, nutritional safety, environmental, academic, and governmental customers working in research and development, quality assurance, and other laboratory applications. The company was founded in 1958 and is headquartered in Milford, Massachusetts.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:54:37"},{"Company Name":"Quest Diagnostics Incorporated","Symbol":"DGX","Current Price":"177.82","Latest MA":"164.55","Latest MA 5":176.4969976807,"Latest MA 9":175.3261077881,"Latest MA 20":174.5202478027,"RSI":68.166017314,"Price Target":183.92294,"Difference from MA":"8.07%","Difference from Open":"0.39%","Change from Yesterday":"0.48%","Change from Last Report":"0.05","Latest Volume":"240,331","Market Cap":"19,851,493,376","Earning Date":"22-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":18.219774,"PB Ratio":2.8743575,"Previous Close":176.98,"ROE":0.13951999,"DTE":93.369,"Industry":"Diagnostics & Research","Sector":"Healthcare","Beta":0.491,"Trailing PEG":1.5696,"Trailing PE":22.481037,"Trailing PS":22.481037,"Quick Ratio":1.105,"Day High":177.96,"Day Low":176.505,"VS Average Volume":0.1885956342,"Company Summary":"Quest Diagnostics Incorporated provides diagnostic testing and services in the United States and internationally. The company develops and delivers diagnostic information services, such as routine, non-routine and advanced clinical testing, anatomic pathology testing, and other diagnostic information services. It also provides diagnostic information services primarily under the Quest Diagnostics brand, as well as under the AmeriPath, Dermpath Diagnostics, ExamOne, and Quanum brands to physicians, hospitals, patients and consumers, health plans, government agencies, employers, emerging retail healthcare providers, pharmaceutical companies and insurers, commercial clinical laboratories, and accountable care organizations through a network of laboratories, patient service centers, phlebotomists in physician offices, call centers and mobile phlebotomists, nurses, and other health and wellness professionals. In addition, the company offers risk assessment services for the life insurance industry; and healthcare organizations and clinicians information technology solutions. Quest Diagnostics Incorporated was founded in 1967 and is headquartered in Secaucus, New Jersey.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:54:37"},{"Company Name":"LyondellBasell Industries NV","Symbol":"LYB","Current Price":"60.37","Latest MA":"68.06","Latest MA 5":59.4188202441,"Latest MA 9":57.6493441562,"Latest MA 20":56.8753664151,"RSI":69.4389180482,"Price Target":69.306,"Difference from MA":"-11.29%","Difference from Open":"0.07%","Change from Yesterday":"-1.22%","Change from Last Report":"0.31","Latest Volume":"1,795,344","Market Cap":"19,404,234,752","Earning Date":"25-04-2025","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":7.0120907,"PB Ratio":1.5969871,"Previous Close":61.12,"ROE":0.07437,"DTE":103.883,"Industry":"Specialty Chemicals","Sector":"Basic Materials","Beta":0.842,"Trailing PEG":0.851,"Trailing PE":20.890692,"Trailing PS":20.890692,"Quick Ratio":0.911,"Day High":60.76,"Day Low":59.77,"VS Average Volume":0.415726117,"Company Summary":"LyondellBasell Industries N.V. operates as a chemical company in the United States, Germany, Mexico, Italy, Poland, France, Japan, China, the Netherlands, and internationally. The company operates in six segments: Olefins and Polyolefins\u0097Americas; Olefins and Polyolefins\u0097Europe, Asia, International; Intermediates and Derivatives; Advanced Polymer Solutions; Refining; and Technology. It produces and markets olefins and co-products, such as ethylene, aromatics, propylene and butadiene; polyolefins; polyethylene; and polypropylene homopolymers and copolymers; and propylene oxide and derivatives; oxyfuels and related products; and intermediate chemicals, such as styrene monomer, acetyls, and ethylene oxide. The company also produces and markets compounding and solutions, including polypropylene compounds, engineered plastics, masterbatches, engineered composites, colors and powders, and advanced polymers, such as catalloy and polybutene-1; and refines heavy, high-sulfur crude oil and other crude oils, as well as refined products, including gasoline and distillates. In addition, it develops and licenses chemical and polyolefin process technologies; manufactures and sells polyolefin catalysts; and serves food packaging, home furnishings, automotive components, and paints and coatings applications. LyondellBasell Industries N.V. was incorporated in 2009 and is headquartered in Houston, Texas.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:54:37"},{"Company Name":"First Solar, Inc.","Symbol":"FSLR","Current Price":"167.68","Latest MA":"161.99","Latest MA 5":165.3340010986,"Latest MA 9":162.1488876004,"Latest MA 20":163.0214992371,"RSI":60.7968682125,"Price Target":203.51823,"Difference from MA":"3.51%","Difference from Open":"0.10%","Change from Yesterday":"-0.11%","Change from Last Report":"0.14","Latest Volume":"1,147,037","Market Cap":"17,982,672,896","Earning Date":"29-04-2025","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":8.03835,"PB Ratio":2.196403,"Previous Close":167.86,"ROE":0.16766001,"DTE":7.7,"Industry":"Solar","Sector":"Technology","Beta":1.527,"Trailing PEG":0.4043,"Trailing PE":14.2463875,"Trailing PS":14.2463875,"Quick Ratio":1.194,"Day High":168.75,"Day Low":163.76,"VS Average Volume":0.2558462438,"Company Summary":"First Solar, Inc., a solar technology company, provides photovoltaic (PV) solar energy solutions in the United States, France, India, Chile, and internationally. The company manufactures and sells PV solar modules with a thin film semiconductor technology that provides a lower-carbon alternative to conventional crystalline silicon PV solar modules. It also designs, manufactures, and sells cadmium telluride solar modules that converts sunlight into electricity. The company's residual business operations include project development activities, operations and maintenance services, and the sale of PV solar power systems to third-party customers. It serves developers and operators of systems, utilities, independent power producers, commercial and industrial companies, and other system owners. The company was formerly known as First Solar Holdings, Inc. and changed its name to First Solar, Inc. in 2006. First Solar, Inc. was founded in 1999 and is headquartered in Tempe, Arizona.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"12-06-2025 20:54:37"},{"Company Name":"Domino's Pizza Inc","Symbol":"DPZ","Current Price":"449.92","Latest MA":"456.65","Latest MA 5":457.6929975586,"Latest MA 9":460.5483321126,"Latest MA 20":473.7837474365,"RSI":28.1612501969,"Price Target":503.4907,"Difference from MA":"-1.47%","Difference from Open":"0.82%","Change from Yesterday":"0.67%","Change from Last Report":"-0.05","Latest Volume":"243,387","Market Cap":"15,405,764,608","Earning Date":"28-04-2025","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":25.505386,"PB Ratio":-3.9857814,"Previous Close":446.9,"ROE":null,"DTE":null,"Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":1.122,"Trailing PEG":2.6064,"Trailing PE":25.81268,"Trailing PS":25.81268,"Quick Ratio":0.358,"Day High":451.99,"Day Low":444.297,"VS Average Volume":0.3952383736,"Company Summary":"Domino's Pizza, Inc. operates as a pizza company in the United States and internationally. The company operates through three segments: U.S. Stores, International Franchise, and Supply Chain. It offers pizzas under the Domino's brand name through company-owned and franchised stores. It provides bread products, wings, boneless chicken, pastas, oven-baked sandwiches, dips, soft drink products and desserts. Domino's Pizza, Inc. was founded in 1960 and is headquartered in Ann Arbor, Michigan.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:54:37"},{"Company Name":"C.H. Robinson Worldwide, Inc.","Symbol":"CHRW","Current Price":"94.68","Latest MA":"99.12","Latest MA 5":95.3940001831,"Latest MA 9":95.3951958211,"Latest MA 20":96.258382019,"RSI":42.6275197222,"Price Target":109.67125,"Difference from MA":"-4.48%","Difference from Open":"0.32%","Change from Yesterday":"0.11%","Change from Last Report":"-0.08","Latest Volume":"429,848","Market Cap":"11,241,451,520","Earning Date":"30-04-2025","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":19.890755,"PB Ratio":6.4924912,"Previous Close":94.58,"ROE":0.3211,"DTE":99.658,"Industry":"Integrated Freight & Logistics","Sector":"Industrials","Beta":0.908,"Trailing PEG":2.2195,"Trailing PE":22.596659,"Trailing PS":22.596659,"Quick Ratio":1.242,"Day High":94.99,"Day Low":93.95,"VS Average Volume":0.2996790905,"Company Summary":"C.H. Robinson Worldwide, Inc., together with its subsidiaries, provides freight transportation and related logistics and supply chain services in the United States and internationally. It operates in two segments, North American Surface Transportation and Global Forwarding. The company offers transportation and logistics services, such as truckload; less than truckload transportation brokerage services, which include the shipment of single or multiple pallets of freight; intermodal transportation that comprises the shipment service of freight in containers or trailers by a combination of truck and rail; and non-vessel operating common carrier and freight forwarding services, as well as organizes air shipments and provides door-to-door services. It also provides customs brokerage services; and other logistics services, such as fee-based managed, warehousing, and other services. In addition, the company is involved in the buying, selling, and\/or marketing of fresh fruits, vegetables, and other value-added perishable items under the Robinson Fresh trade name. Further, the company offers transportation management and other surface transportation services. It provides its fresh produce to grocery retailers, restaurants, produce wholesalers, and foodservice distributors through a network of independent produce growers and suppliers. The company was founded in 1905 and is headquartered in Eden Prairie, Minnesota.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:54:37"},{"Company Name":"CarMax Inc","Symbol":"KMX","Current Price":"66.61","Latest MA":"76.29","Latest MA 5":67.1679991455,"Latest MA 9":66.3999997626,"Latest MA 20":65.4829999619,"RSI":53.645779445,"Price Target":84.13188,"Difference from MA":"-12.69%","Difference from Open":"-0.48%","Change from Yesterday":"-1.80%","Change from Last Report":"-0.02","Latest Volume":"1,271,697","Market Cap":"10,147,035,136","Earning Date":"20-06-2025","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":17.668436,"PB Ratio":1.6358457,"Previous Close":67.83,"ROE":0.08128,"DTE":311.168,"Industry":"Auto & Truck Dealerships","Sector":"Consumer Cyclical","Beta":1.382,"Trailing PEG":0.8459,"Trailing PE":20.750778,"Trailing PS":20.750778,"Quick Ratio":0.198,"Day High":67.18,"Day Low":65.78,"VS Average Volume":0.3584285589,"Company Summary":"CarMax, Inc., through its subsidiaries, operates as a retailer of used vehicles and related products in the United States. The company operates in two segments: CarMax Sales Operations and CarMax Auto Finance. The CarMax Sales Operations segment offers customers a range of makes and models of used vehicles, including domestic, imported, and luxury vehicles, as well as hybrid and electric vehicles; used vehicle auctions; extended protection plans to customers at the time of sale; and reconditioning and vehicle repair services. The CarMax Auto Finance segment provides financing alternatives for retail customers across a range of credit spectrum and arrangements with various financial institutions. The company was founded in 1993 and is based in Richmond, Virginia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:54:37"},{"Company Name":"Dayforce, Inc.","Symbol":"DAY","Current Price":"60.03","Latest MA":"65.40","Latest MA 5":60.0339998779,"Latest MA 9":59.6022221544,"Latest MA 20":58.999500145,"RSI":55.887516388,"Price Target":67.29667,"Difference from MA":"-8.21%","Difference from Open":"-1.12%","Change from Yesterday":"-1.02%","Change from Last Report":"-0.20","Latest Volume":"551,336","Market Cap":"9,597,656,064","Earning Date":"07-05-2025","Earning Time":"Before","Earning Day of Week":"Saturday","PE Ratio":27.162895,"PB Ratio":3.7053268,"Previous Close":60.65,"ROE":0.01031,"DTE":47.498,"Industry":"Software - Application","Sector":"Technology","Beta":1.117,"Trailing PEG":null,"Trailing PE":375.1875,"Trailing PS":375.1875,"Quick Ratio":0.137,"Day High":60.755,"Day Low":59.49,"VS Average Volume":0.2715673333,"Company Summary":"Dayforce Inc., together with its subsidiaries, operates as a human capital management (HCM) software company in the United States, Canada, Australia, and internationally. The company offers Dayforce, a cloud HCM platform that provides human resources, payroll and tax, workforce management, wallet, benefits, and talent intelligence functionalities; and Powerpay, a cloud HR and payroll solution for the small business market. It also provides payroll and payroll-related services; and professional services for its solutions, which include training and implementation consulting services. In addition, the company is involved in the shipment, rental, maintenance, and sale of payroll time clocks. It sells its solutions through direct sales force and third-party channels. The company was formerly known as Ceridian HCM Holding Inc. and changed its name to Dayforce Inc. in February 2024. Dayforce Inc. was founded in 1992 and is headquartered in Minneapolis, Minnesota.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"12-06-2025 20:54:37"},{"Company Name":"APA Corporation","Symbol":"APA","Current Price":"19.95","Latest MA":"19.98","Latest MA 5":19.1940000916,"Latest MA 9":18.5933334774,"Latest MA 20":17.8200000381,"RSI":81.9847696227,"Price Target":22.63321,"Difference from MA":"-0.15%","Difference from Open":"3.74%","Change from Yesterday":"1.73%","Change from Last Report":"0.25","Latest Volume":"3,331,906","Market Cap":"7,198,857,728","Earning Date":"07-05-2025","Earning Time":"Before","Earning Day of Week":"Saturday","PE Ratio":7.2545457,"PB Ratio":1.3264629,"Previous Close":19.61,"ROE":0.26176,"DTE":84.961,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":1.246,"Trailing PEG":null,"Trailing PE":7.150538,"Trailing PS":7.150538,"Quick Ratio":0.684,"Day High":19.97,"Day Low":19.0202,"VS Average Volume":0.3992957241,"Company Summary":"APA Corporation, an independent energy company, explores for, develops, and produces natural gas, crude oil, and natural gas liquids. It has oil and gas operations in the United States, Egypt, and North Sea. The company also has exploration and appraisal activities in Suriname, as well as holds interests in projects located in Uruguay and internationally. APA Corporation was incorporated in 1954 and is headquartered in Houston, Texas.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"12-06-2025 20:54:37"}]