[{"Company Name":"Halliburton Company","Symbol":"HAL","Current Price":"27.80","Latest MA":"30.35","Price Target":36.70357,"Difference from MA":"-8.37%","Difference from Open":"0.38%","Change from Yesterday":"0.11%","Change from Last Report":"-0.16","Latest Volume":"1,493,902","Market Cap":"24,426,747,904","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":9.092188,"PB Ratio":2.3710241,"ROE":0.26293,"DTE":83.993,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.905,"Trailing PEG":2.2035,"Trailing PE":9.722029,"Trailing PS":1.0586724,"Quick Ratio":1.377,"Day High":28.2,"Day Low":27.59,"VS Average Volume":0.1587724954,"Company Summary":"Halliburton Company provides products and services to the energy industry worldwide. It operates through two segments, Completion and Production, and Drilling and Evaluation. The Completion and Production segment offers production enhancement services that include stimulation and sand control services; cementing services, such as well bonding and casing, and casing equipment; and completion tools that offer downhole solutions and services, including well completion products and services, intelligent well completions, and service tools, as well as liner hanger, sand control, and multilateral systems. This segment also provides electrical submersible pumps, as well as artificial lift services; production solutions comprising coiled tubing, hydraulic workover units, downhole tools, and pumping and nitrogen services; pipeline and process services, such as pre-commissioning, commissioning, maintenance, and decommissioning; and specialty chemicals and services. The Drilling and Evaluation segment offers drilling fluid systems, performance additives, completion fluids, solids control, specialized testing equipment, and waste management services; drilling systems and services; wireline and perforating services consists of open-hole logging, and cased-hole and slickline; and drill bits and services comprising roller cone rock bits, fixed cutter bits, hole enlargement, and related downhole tools and services, as well as coring equipment and services. This segment also provides cloud based digital services and artificial intelligence solutions on an open architecture for subsurface insights, integrated well construction, and reservoir and production management; testing and subsea services, such as acquisition and analysis of reservoir information and optimization solutions; and project management and integrated asset management services. Halliburton Company was founded in 1919 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"14-01-2025 18:14:26"},{"Company Name":"Johnson & Johnson","Symbol":"JNJ","Current Price":"143.27","Latest MA":"154.05","Price Target":171.61092,"Difference from MA":"-7.00%","Difference from Open":"-0.85%","Change from Yesterday":"-0.70%","Change from Last Report":"-0.05","Latest Volume":"2,080,021","Market Cap":"344,939,757,568","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":13.470683,"PB Ratio":4.915935,"ROE":0.20889,"DTE":50.958,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.518,"Trailing PEG":0.8647,"Trailing PE":23.680992,"Trailing PS":3.933358,"Quick Ratio":0.705,"Day High":144.58,"Day Low":142.92,"VS Average Volume":0.2685103069,"Company Summary":"Johnson & Johnson, together with its subsidiaries, researches, develops, manufactures, and sells various products in the healthcare field worldwide. The company's Innovative Medicine segment offers products for various therapeutic areas, such as immunology, including rheumatoid arthritis, psoriatic arthritis, inflammatory bowel disease, and psoriasis; infectious diseases comprising HIV\/AIDS; neuroscience, consisting of mood disorders, neurodegenerative disorders, and schizophrenia; oncology, such as prostate cancer, hematologic malignancies, lung cancer, and bladder cancer; cardiovascular and metabolism, including thrombosis, diabetes, and macular degeneration; and pulmonary hypertension comprising pulmonary arterial hypertension through retailers, wholesalers, distributors, hospitals, and healthcare professionals for prescription use. Its MedTech segment provides Interventional Solutions, including electrophysiology products to treat heart rhythm disorders; the heart recovery portfolio, which includes technologies to treat severe coronary artery disease requiring high-risk PCI or AMI cardiogenic shock; and neurovascular care that treats hemorrhagic and ischemic stroke. this segment also offers an orthopaedics portfolio that includes products and enabling technologies that support hips, knees, trauma, spine, sports, and other; surgery portfolios comprising advanced and general surgery technologies, as well as solutions for breast aesthetics, ear, nose, and throat procedures; contact lenses under the ACUVUE Brand; and TECNIS intraocular lenses for cataract surgery. It distributes its products to wholesalers, hospitals, and retailers, as well as physicians, nurses, hospitals, eye care professionals, and clinics. The company has a collaboration agreement with Stand Up To Cancer for research testing a combination of teclistamab and daratumumab to treat a rare disease AL amyloidosis. Johnson & Johnson was founded in 1886 and is based in New Brunswick, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"14-01-2025 18:14:26"},{"Company Name":"Kinder Morgan, Inc.","Symbol":"KMI","Current Price":"28.84","Latest MA":"23.24","Price Target":26.61176,"Difference from MA":"24.11%","Difference from Open":"0.91%","Change from Yesterday":"1.14%","Change from Last Report":"0.10","Latest Volume":"3,208,685","Market Cap":"64,072,097,792","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":22.841936,"PB Ratio":2.1072628,"ROE":0.083500005,"DTE":101.433,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.907,"Trailing PEG":2.0883,"Trailing PE":25.522123,"Trailing PS":4.2289023,"Quick Ratio":0.291,"Day High":28.97,"Day Low":28.48,"VS Average Volume":0.2418600707,"Company Summary":"Kinder Morgan, Inc. operates as an energy infrastructure company primarily in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas gasification, liquefaction, and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and\/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, renewable fuel and feedstocks, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; owns interests in\/or operates oil fields and gasoline processing plants; and operates a crude oil pipeline system in West Texas, as well as owns and operates RNG and LNG facilities. It owns and operates approximately 82,000 miles of pipelines and 139 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1997 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-01-2025 18:14:26"},{"Company Name":"Las Vegas Sands Corp.","Symbol":"LVS","Current Price":"45.03","Latest MA":"46.17","Price Target":59.80632,"Difference from MA":"-2.47%","Difference from Open":"-1.98%","Change from Yesterday":"-3.84%","Change from Last Report":"-0.41","Latest Volume":"1,865,966","Market Cap":"32,647,919,616","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":16.17114,"PB Ratio":9.528142,"ROE":0.45166,"DTE":384.206,"Industry":"Resorts & Casinos","Sector":"Consumer Cyclical","Beta":1.117,"Trailing PEG":0.7007,"Trailing PE":22.292078,"Trailing PS":2.8848562,"Quick Ratio":0.864,"Day High":46.365,"Day Low":45.02,"VS Average Volume":0.3963143369,"Company Summary":"Las Vegas Sands Corp., together with its subsidiaries, develops, owns, and operates integrated resorts in Macao and Singapore. It owns and operates The Venetian Macao Resort Hotel, the Londoner Macao, The Parisian Macao, The Plaza Macao and Four Seasons Hotel Macao, Cotai Strip, and the Sands Macao in Macao, the People's Republic of China; and Marina Bay Sands in Singapore. The company's integrated resorts feature accommodations, gaming, entertainment and retail malls, convention and exhibition facilities, celebrity chef restaurants, and other amenities. Las Vegas Sands Corp. was founded in 1988 and is based in Las Vegas, Nevada.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"14-01-2025 18:14:26"},{"Company Name":"GE Vernova Inc.","Symbol":"GEV","Current Price":"381.31","Latest MA":"250.89","Price Target":366.74707,"Difference from MA":"51.98%","Difference from Open":"1.32%","Change from Yesterday":"3.76%","Change from Last Report":"0.03","Latest Volume":"1,160,660","Market Cap":"105,107,865,600","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":57.09791,"PB Ratio":11.049437,"ROE":"N\/A","DTE":9.346,"Industry":"Utilities - Renewable","Sector":"Utilities","Beta":"N\/A","Trailing PEG":3.1791,"Trailing PE":90.356636,"Trailing PS":3.0535083,"Quick Ratio":0.717,"Day High":388.8799,"Day Low":373.7,"VS Average Volume":0.4127204932,"Company Summary":"GE Vernova Inc., an energy company, engages in the provision of various products and services that generate, transfer, orchestrate, convert, and store electricity in the United States, Europe, Asia, the Americas, the Middle East, and Africa. The company operates through three segments: Power, Wind, and Electrification. The Power segment designs, manufactures, and services gas, nuclear, hydro, and steam technologies. The Wind segment offers wind generation technologies, including onshore and offshore wind turbines and blades. The Electrification segment provides grid solutions, power conversion, solar, and storage solutions; and electrification software for the transmission, distribution, conversion, storage, and orchestration of electricity from point of generation to point of consumption. The company was incorporated in 2023 and is headquartered in Cambridge, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-01-2025 18:14:26"},{"Company Name":"Fifth Third Bancorp","Symbol":"FITB","Current Price":"42.57","Latest MA":"41.56","Price Target":50.54762,"Difference from MA":"2.42%","Difference from Open":"1.00%","Change from Yesterday":"1.97%","Change from Last Report":"-0.02","Latest Volume":"1,929,682","Market Cap":"28,261,455,872","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":11.765291,"PB Ratio":1.5421678,"ROE":0.119160004,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.231,"Trailing PEG":3.3626,"Trailing PE":14.19,"Trailing PS":3.5050795,"Quick Ratio":"N\/A","Day High":42.695,"Day Low":42.01,"VS Average Volume":0.4303019991,"Company Summary":"Fifth Third Bancorp operates as the bank holding company for Fifth Third Bank, National Association that engages in the provision of a range of financial products and services in the United States. It operates through three segments: Commercial Banking, Consumer and Small Business Banking, and Wealth and Asset Management. The Commercial Banking segment offers credit intermediation, cash management, and financial services; lending and depository products; and cash management, foreign exchange and international trade finance, derivatives and capital markets services, asset-based lending, real estate finance, public finance, commercial leasing, and syndicated finance for business, government, and professional customers. The Consumer and Small Banking segment provides a range of deposit and loan products to individuals and small businesses; home equity loans and lines of credit; credit cards; and cash management services. This segment also engages in the residential mortgage that include origination, retention and servicing of residential mortgage loans, sales and securitizations of loans, and hedging activities; indirect lending, including extending loans to consumers through automobile dealers, motorcycle dealers, powersport dealers, recreational vehicle dealers, and marine dealers; and home improvement and solar energy installation loans through contractors and installers. The Wealth & Asset Management segment provides various wealth management services for individuals, companies, and not-for-profit organizations. It offers retail brokerage services to individual clients; and broker dealer services to the institutional marketplace. This segment also provides wealth planning, investment management, banking, insurance, and trust and estate services; and advisory services for institutional clients comprising middle market businesses, non-profits, states, and municipalities. The company was founded in 1858 and is headquartered in Cincinnati, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-01-2025 18:14:26"},{"Company Name":"United Airlines Holdings, Inc.","Symbol":"UAL","Current Price":"107.18","Latest MA":"65.91","Price Target":120.61304,"Difference from MA":"62.62%","Difference from Open":"-0.13%","Change from Yesterday":"2.19%","Change from Last Report":"-0.04","Latest Volume":"1,698,382","Market Cap":"35,248,930,816","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":8.425525,"PB Ratio":3.081745,"ROE":0.27245,"DTE":291.676,"Industry":"Airlines","Sector":"Industrials","Beta":1.393,"Trailing PEG":0.8317,"Trailing PE":12.774732,"Trailing PS":0.62951267,"Quick Ratio":0.694,"Day High":108.14,"Day Low":105.6,"VS Average Volume":0.2630072184,"Company Summary":"United Airlines Holdings, Inc., through its subsidiaries, provides air transportation services in North America, Asia, Europe, Africa, the Pacific, the Middle East, and Latin America. The company transports people and cargo through its mainline and regional fleets. It also offers catering, ground handling, flight academy, and maintenance services for third parties. The company was formerly known as United Continental Holdings, Inc. and changed its name to United Airlines Holdings, Inc. in June 2019. United Airlines Holdings, Inc. was incorporated in 1968 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"14-01-2025 18:14:26"},{"Company Name":"GE Aerospace","Symbol":"GE","Current Price":"174.53","Latest MA":"172.20","Price Target":209.18353,"Difference from MA":"1.35%","Difference from Open":"0.82%","Change from Yesterday":"1.59%","Change from Last Report":"-0.18","Latest Volume":"1,730,851","Market Cap":"188,886,663,168","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":33.186974,"PB Ratio":10.007741,"ROE":0.22552,"DTE":110.224,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":1.188,"Trailing PEG":null,"Trailing PE":34.355316,"Trailing PS":2.7001936,"Quick Ratio":0.804,"Day High":176.15,"Day Low":172.395,"VS Average Volume":0.3506622536,"Company Summary":"General Electric Company, doing business as GE Aerospace, designs and produces commercial and defense aircraft engines, integrated engine components, electric power, and mechanical aircraft systems. It also offers aftermarket services to support its products. The company operates in the United States, Europe, China, Asia, the Americas, the Middle East, and Africa. General Electric Company was incorporated in 1892 and is based in Evendale, Ohio.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"14-01-2025 18:14:26"},{"Company Name":"3M Company","Symbol":"MMM","Current Price":"136.41","Latest MA":"124.05","Price Target":145.84889,"Difference from MA":"9.96%","Difference from Open":"1.33%","Change from Yesterday":"1.34%","Change from Last Report":"-0.07","Latest Volume":"1,064,569","Market Cap":"74,283,294,720","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":17.211294,"PB Ratio":16.00305,"ROE":1.1329399,"DTE":295.441,"Industry":"Conglomerates","Sector":"Industrials","Beta":1.001,"Trailing PEG":null,"Trailing PE":14.19459,"Trailing PS":2.2759757,"Quick Ratio":0.95,"Day High":136.83,"Day Low":134.55,"VS Average Volume":0.3118704039,"Company Summary":"3M Company provides diversified technology services in the United States and internationally. The company's Safety and Industrial segment offers industrial abrasives and finishing for metalworking applications; autobody repair solutions; closure systems for personal hygiene products, masking, and packaging materials; electrical products and materials for construction and maintenance, power distribution, and electrical original equipment manufacturers; structural adhesives and tapes; respiratory, hearing, eye, and fall protection solutions; and natural and color-coated mineral granules for shingles. Its Transportation and Electronics segment provides ceramic solutions; attachment\/bonding products, films, sound, and temperature management for transportation vehicles; premium large format graphic films for advertising and fleet signage; light management films and electronics assembly solutions; packaging and interconnection solutions; semiconductor production materials; data centers solutions; and reflective signage for highway, and vehicle safety. The company's Consumer segment provides consumer bandages, braces, supports, and consumer respirators; home cleaning products; retail abrasives, paint accessories, car care DIY products, picture hanging, and consumer air quality solutions; and stationery products. It offers its products through e-commerce and traditional wholesalers, retailers, jobbers, distributors, and dealers. 3M Company was founded in 1902 and is headquartered in Saint Paul, Minnesota.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-01-2025 18:14:26"},{"Company Name":"KeyCorp","Symbol":"KEY","Current Price":"17.12","Latest MA":"16.40","Price Target":21.215,"Difference from MA":"4.39%","Difference from Open":"0.09%","Change from Yesterday":"0.59%","Change from Last Report":"-0.20","Latest Volume":"2,371,084","Market Cap":"18,949,326,848","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":11.061447,"PB Ratio":1.1827474,"ROE":0.0096700005,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.231,"Trailing PEG":0.7055,"Trailing PE":"Infinity","Trailing PS":3.9054675,"Quick Ratio":"N\/A","Day High":17.2395,"Day Low":17.105,"VS Average Volume":0.2456996061,"Company Summary":"KeyCorp operates as the holding company for KeyBank National Association that provides various retail and commercial banking products and services in the United States. It operates in two segments, Consumer Bank and Commercial Bank. The company offers various deposits, investment products and services; commercial leasing, investment management, consumer finance; and personal finance and financial wellness, student loan refinancing, mortgage and home equity, lending, credit card, treasury, business advisory, wealth management, asset management, cash management, portfolio management, and trust and related services to individuals and small and medium-sized businesses. It also provides a suite of banking and capital market products, such as syndicated finance, debt and equity capital market products, commercial payments, equipment finance, commercial mortgage banking, derivatives, foreign exchange, financial advisory, and public finance, as well as commercial mortgage loans to consumer, energy, healthcare, industrial, public sector, real estate, and technology sectors for middle market clients. In addition, the company offers community development financing, securities underwriting, brokerage, and investment banking services. The company was founded in 1849 and is headquartered in Cleveland, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-01-2025 18:14:26"},{"Company Name":"D.R. Horton, Inc.","Symbol":"DHI","Current Price":"141.96","Latest MA":"166.57","Price Target":176.91376,"Difference from MA":"-14.77%","Difference from Open":"-0.38%","Change from Yesterday":"2.52%","Change from Last Report":"0.04","Latest Volume":"1,097,334","Market Cap":"45,544,886,272","Earning Date":"2025-01-21","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":9.0194845,"PB Ratio":1.8172276,"ROE":0.19631,"DTE":22.915,"Industry":"Residential Construction","Sector":"Consumer Cyclical","Beta":1.744,"Trailing PEG":0.5141,"Trailing PE":9.899582,"Trailing PS":1.2375857,"Quick Ratio":0.766,"Day High":143.55,"Day Low":141.31,"VS Average Volume":0.3743332619,"Company Summary":"D.R. Horton, Inc. operates as a homebuilding company in East, North, Southeast, South Central, Southwest, and Northwest regions in the United States. It engages in the acquisition and development of land; and construction and sale of residential homes in 125 markets across 36 states under the names of D.R. Horton. The company constructs and sells single-family detached homes; and attached homes, such as townhomes, duplexes, and triplexes. It provides mortgage financing services; and title insurance policies, and examination and closing services, as well as engages in the residential lot development business. In addition, the company develops, constructs, owns, leases, and sells multi-family and single-family rental properties; and owns non-residential real estate, including ranch land and improvements. It primarily serves homebuyers. D.R. Horton, Inc. was founded in 1978 and is headquartered in Arlington, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"14-01-2025 18:14:26"},{"Company Name":"Charles Schwab Corporation (The","Symbol":"SCHW","Current Price":"71.50","Latest MA":"70.47","Price Target":85.14286,"Difference from MA":"1.46%","Difference from Open":"-1.73%","Change from Yesterday":"-1.53%","Change from Last Report":"0.02","Latest Volume":"1,639,712","Market Cap":"130,885,042,176","Earning Date":"2025-01-21","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":18.00273,"PB Ratio":3.4403117,"ROE":0.12111,"DTE":144.242,"Industry":"Capital Markets","Sector":"Financial Services","Beta":0.952,"Trailing PEG":0.9031,"Trailing PE":27.929688,"Trailing PS":6.985751,"Quick Ratio":0.481,"Day High":72.97,"Day Low":71.41,"VS Average Volume":0.2060745357,"Company Summary":"The Charles Schwab Corporation, together with its subsidiaries, operates as a savings and loan holding company that provides wealth management, securities brokerage, banking, asset management, custody, and financial advisory services in the United States and internationally. The company operates in two segments, Investor Services and Advisor Services. It offers brokerage accounts with equity and fixed income trading, margin lending, options trading, futures and forex trading, and cash management capabilities, including certificates of deposit; third-party mutual funds through the Mutual Fund Marketplace and Mutual Fund OneSource service, as well as mutual fund trading and clearing services to broker-dealers; exchange-traded funds; advisory solutions for managed portfolios, separately managed accounts, customized personal advice for tailored portfolios, specialized planning, and full-time portfolio management; banking products comprising checking and savings accounts, first lien residential real estate mortgage loans, home equity lines of credit, and pledged asset lines; and trust custody services, personal trust reporting services, and administrative trustee services. It also provides digital retirement calculators; integrated web-, mobile-, and software-based trading platforms, real-time market data, options trading, premium research, and multi-channel access; self-service education and support tools; online research and analysis tools; equity compensation plan sponsors full-service recordkeeping for stock plans, stock options, restricted stock, performance shares, and stock appreciation rights; retirement plan services; mutual fund clearing services; and advisor services, including interactive tools and educational content. The Company operates through branch offices. The Charles Schwab Corporation was founded in 1971 and is headquartered in Westlake, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-01-2025 18:14:26"},{"Company Name":"Citizens Financial Group, Inc.","Symbol":"CFG","Current Price":"45.10","Latest MA":"41.37","Price Target":51.505,"Difference from MA":"9.02%","Difference from Open":"0.88%","Change from Yesterday":"2.04%","Change from Last Report":"-0.30","Latest Volume":"1,189,705","Market Cap":"19,877,818,368","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":11.752857,"PB Ratio":0.8799945,"ROE":0.05426,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.32,"Trailing PEG":null,"Trailing PE":17.688236,"Trailing PS":2.7937903,"Quick Ratio":"N\/A","Day High":45.41,"Day Low":44.555,"VS Average Volume":0.2841254837,"Company Summary":"Citizens Financial Group, Inc. operates as the bank holding company that provides retail and commercial banking products and services to individuals, small businesses, middle-market companies, corporations, and institutions in the United States. The company operates in two segments, Consumer Banking and Commercial Banking. The Consumer Banking segment offers deposit products, mortgage and home equity lending products, credit cards, business loans, wealth management, and investment services; and auto, education, and point-of-sale finance loans, as well as digital deposit products. This segment serves its customers through telephone service centers, as well as through its online and mobile platforms. The Commercial Banking segment provides various financial products and solutions, including lending and leasing, deposit and treasury management services, foreign exchange, and interest rate and commodity risk management solutions, as well as syndicated loans, corporate finance, mergers and acquisitions, and debt and equity capital markets services. This segment serves corporate banking, healthcare, technology, asset finance, franchise finance, leasing, asset-based lending, commercial real estate, mid-corporate, and private equity sponsor industries. The company was formerly known as RBS Citizens Financial Group, Inc. and changed its name to Citizens Financial Group, Inc. in April 2014. Citizens Financial Group, Inc. was founded in 1828 and is headquartered in Providence, Rhode Island.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"14-01-2025 18:14:26"}]