[{"Company Name":"Plains All American Pipeline, L","Symbol":"PAA","Current Price":"20.01","Latest MA":"17.42","Price Target":21.67316,"Difference from MA":"14.90%","Difference from Open":"-1.38%","Change from Yesterday":"-1.38%","Change from Last Report":"0.00","Latest Volume":"4,721,406","Market Cap":"14,080,416,768","Earning Date":"2025-02-07","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":13.671582,"PB Ratio":1.774408,"Previous Close":20.29,"ROE":0.1028,"DTE":60.937,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":1.585,"Trailing PEG":null,"Trailing PE":17.707964,"Trailing PS":0.2795453,"Quick Ratio":0.894,"Day High":20.375,"Day Low":19.92,"VS Average Volume":1.1715249382,"Company Summary":"Plains All American Pipeline, L.P., through its subsidiaries, engages in the pipeline transportation, terminaling, storage, and gathering of crude oil and natural gas liquids (NGL) in the United States and Canada. The company operates through two segments, Crude Oil and NGL. The Crude Oil segment offers gathering and transporting crude oil through pipelines, gathering systems, trucks, and on barges or railcars. This segment provides terminaling, storage, and other facilities-related services, as well as merchant activities. The NGL segment is involved in natural gas processing and NGL fractionation, storage, transportation, and terminaling. This segment also includes ethane, propane, normal butane, iso-butane, and natural gasoline derived from natural gas production and processing activities, as well as crude oil refining processes. Its NGL components are used for various applications, such as heating, engine, and industrial fuels. The company was founded in 1981 and is headquartered in Houston, Texas. Plains All American Pipeline, L.P. operates as a subsidiary of Plains GP Holdings, L.P.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Kimco Realty Corporation (HC)","Symbol":"KIM","Current Price":"22.41","Latest MA":"22.86","Price Target":25.55,"Difference from MA":"-1.95%","Difference from Open":"-0.71%","Change from Yesterday":"0.18%","Change from Last Report":"0.00","Latest Volume":"3,147,030","Market Cap":"15,106,155,520","Earning Date":"2025-02-07","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":30.241283,"PB Ratio":1.4355263,"Previous Close":22.37,"ROE":0.03829,"DTE":78.638,"Industry":"REIT - Retail","Sector":"Real Estate","Beta":1.485,"Trailing PEG":87.7255,"Trailing PE":41.499996,"Trailing PS":7.694581,"Quick Ratio":3.264,"Day High":22.57,"Day Low":22.175,"VS Average Volume":0.7699498791,"Company Summary":"Kimco Realty (NYSE: KIM) is a real estate investment trust (REIT) and leading owner and operator of high-quality, open-air, grocery-anchored shopping centers and mixed-use properties in the United States. The company's portfolio is strategically concentrated in the first-ring suburbs of the top major metropolitan markets, including high-barrier-to-entry coastal markets and rapidly expanding Sun Belt cities. Its tenant mix is focused on essential, necessity-based goods and services that drive multiple shopping trips per week. Publicly traded on the NYSE since 1991 and included in the S&P 500 Index, the company has specialized in shopping center ownership, management, acquisitions, and value-enhancing redevelopment activities for more than 60 years. With a proven commitment to corporate responsibility, Kimco Realty is a recognized industry leader in this area. As of September 30, 2024, the company owned interests in 567 U.S. shopping centers and mixed-use assets comprising 101 million square feet of gross leasable space.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Newell Brands Inc.","Symbol":"NWL","Current Price":"9.69","Latest MA":"8.39","Price Target":11.09091,"Difference from MA":"15.44%","Difference from Open":"-1.42%","Change from Yesterday":"-0.10%","Change from Last Report":"0.00","Latest Volume":"7,869,450","Market Cap":"4,031,039,744","Earning Date":"2025-02-07","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":12.998336,"PB Ratio":1.4094545,"Previous Close":9.7,"ROE":-0.08286,"DTE":196.259,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":0.88,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.52290046,"Quick Ratio":0.419,"Day High":10.01,"Day Low":9.58,"VS Average Volume":1.4301486223,"Company Summary":"Newell Brands Inc. engages in the design, manufacture, sourcing, and distribution of consumer and commercial products worldwide. The company operates in three segments: Home and Commercial Solutions, Learning and Development, and Outdoor and Recreation. The Commercial Solutions segment provides commercial cleaning and maintenance solution products under the Rubbermaid, Rubbermaid Commercial Products, Mapa, and Spontex brands; closet and garage organization products; hygiene systems and material handling solutions; household products, such as kitchen appliances under the Crockpot, Mr. Coffee, Oster, and Sunbeam brands; small appliances under the Breville brand name in Europe; food and home storage products under the FoodSaver, Rubbermaid, Ball, and Sistema brands; fresh preserving products; vacuum sealing products; and gourmet cookware, bakeware, and cutlery under the Calphalon brand; and home fragrance products under the WoodWick and Yankee Candle brands. The Learning and Development segment offers writing instruments, including markers and highlighters, pens, and pencils; art products; activity-based products; labeling solutions; and baby gear and infant care products under the Dymo, Elmer's, EXPO, Graco, NUK, Paper Mate, Parker, and Sharpie brands. The Outdoor and Recreation segment provides outdoor and outdoor-related products, inlcuding technical apparel and on-the-go beverageware under the Campingaz, Coleman, Contigo, and Marmot brands. It serves warehouse clubs, department and drug\/grocery stores, mass merchants, home centers, commercial products distributors, specialty retailers, office superstores and supply stores, contract stationers, e-commerce retailers, and sporting goods, as well as direct to consumers online, select contract customers, and other professional customers. Newell Brands Inc. was founded in 1903 and is based in Atlanta, Georgia.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Avantor, Inc.","Symbol":"AVTR","Current Price":"21.70","Latest MA":"23.31","Price Target":26.37368,"Difference from MA":"-6.90%","Difference from Open":"-1.45%","Change from Yesterday":"-1.32%","Change from Last Report":"0.00","Latest Volume":"6,129,232","Market Cap":"14,769,325,056","Earning Date":"2025-02-07","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":19.684326,"PB Ratio":2.6596396,"Previous Close":21.99,"ROE":0.058130004,"DTE":88.619,"Industry":"Medical Instruments & Supplies","Sector":"Healthcare","Beta":1.348,"Trailing PEG":null,"Trailing PE":48.222225,"Trailing PS":2.1656537,"Quick Ratio":0.842,"Day High":22.0,"Day Low":21.3125,"VS Average Volume":1.1069691991,"Company Summary":"Avantor, Inc. engages in the provision of mission-critical products and services to customers in the biopharma, healthcare, education and government, advanced technologies, and applied materials industries in the Americas, Europe, Asia, the Middle East, and Africa. The company offers materials and consumables, such as purity chemicals and reagents, lab products and supplies, formulated silicone materials, customized excipients, customized single-use assemblies, process chromatography resins and columns, analytical sample prep kits, education and microbiology products, clinical trial kits, peristaltic pumps, and fluid handling tips. It also provides equipment and instrumentation products, including filtration systems, virus inactivation systems, incubators, analytical instruments, evaporators, ultra-low-temperature freezers, biological safety cabinets, and critical environment supplies. In addition, the company offers services and specialty procurements comprising onsite lab and production, clinical, equipment, procurement and sourcing, and biopharmaceutical material scale-up and development services. Further, it provides scientific research support services, such as DNA extraction, bioreactor servicing, clinical and biorepository, and compound management services. The company was founded in 1904 and is headquartered in Radnor, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Flowers Foods, Inc.","Symbol":"FLO","Current Price":"19.34","Latest MA":"21.69","Price Target":23.5,"Difference from MA":"-10.83%","Difference from Open":"-1.98%","Change from Yesterday":"-0.72%","Change from Last Report":"0.00","Latest Volume":"2,685,583","Market Cap":"4,072,965,376","Earning Date":"2025-02-07","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":14.8956,"PB Ratio":2.8737,"Previous Close":19.48,"ROE":0.17307,"DTE":87.609,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":0.361,"Trailing PEG":null,"Trailing PE":16.964912,"Trailing PS":0.7952853,"Quick Ratio":0.725,"Day High":19.73,"Day Low":19.29,"VS Average Volume":1.5308564494,"Company Summary":"Flowers Foods, Inc. produces and markets packaged bakery food products in the United States. Its principal products include fresh breads, buns, rolls, snack items, bagels, English muffins, and tortillas, as well as frozen breads and rolls under the Nature's Own, Dave's Killer Bread, Wonder, Canyon Bakehouse, Mrs. Freshley's, and Tastykake brand names. The company distributes its products through a direct-store-delivery distribution and a warehouse delivery system, as well as operates bakeries. Its customers include national and regional restaurants, institutions and foodservice distributors, and retail in-store bakeries; wholesale distributors; mass merchandisers, supermarkets, vending outlets, and convenience stores; quick-serve chains, food wholesalers, institutions, dollar stores, and vending companies; and public health care, military commissaries, and prisons, and other governmental institutions. The company was formerly known as Flowers Industries and changed its name to Flowers Foods, Inc. in 2001. Flowers Foods, Inc. was founded in 1919 and is headquartered in Thomasville, Georgia.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Valvoline Inc.","Symbol":"VVV","Current Price":"39.58","Latest MA":"40.46","Price Target":43.26923,"Difference from MA":"-2.18%","Difference from Open":"6.60%","Change from Yesterday":"7.44%","Change from Last Report":"0.00","Latest Volume":"3,768,668","Market Cap":"5,077,599,744","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":20.384096,"PB Ratio":47.91768,"Previous Close":36.84,"ROE":1.0227101,"DTE":"N\/A","Industry":"Auto & Truck Dealerships","Sector":"Consumer Cyclical","Beta":1.462,"Trailing PEG":null,"Trailing PE":24.28221,"Trailing PS":3.226946,"Quick Ratio":0.468,"Day High":39.725,"Day Low":37.13,"VS Average Volume":2.5014655671,"Company Summary":"Valvoline Inc. engages in the operation and franchising of vehicle service centers and retail stores in the United States and Canada. The company, through its service centers, provides fluid exchange for motor oil, transmission and differential fluid, and coolant; parts replacement for batteries, filters, wiper blades, and belts; and safety services, such as tire inflation and rotation, bulbs, and safety checks. It offers its services for passenger cars, hybrid and battery electric vehicles, and light and medium duty vehicles. The company was founded in 1866 and is headquartered in Lexington, Kentucky.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Fortune Brands Innovations, Inc","Symbol":"FBIN","Current Price":"69.06","Latest MA":"77.24","Price Target":86.37,"Difference from MA":"-10.59%","Difference from Open":"-1.27%","Change from Yesterday":"-0.42%","Change from Last Report":"0.00","Latest Volume":"2,011,485","Market Cap":"8,579,047,424","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":15.361994,"PB Ratio":3.5806499,"Previous Close":69.35,"ROE":0.1942,"DTE":121.253,"Industry":"Building Products & Equipment","Sector":"Industrials","Beta":1.576,"Trailing PEG":2.0487,"Trailing PE":19.45352,"Trailing PS":1.8385905,"Quick Ratio":0.588,"Day High":70.07,"Day Low":68.78,"VS Average Volume":1.6123507873,"Company Summary":"Fortune Brands Innovations, Inc. provides home and security products for residential home repair, remodeling, new construction, and security applications in the United States and internationally. The company operates through three segments: Water, Outdoors, and Security. The Water segment manufactures or assembles, and sells faucets, accessories, kitchen sinks, and waste disposals under the Moen, ROHL, Riobel, Victoria+Albert, Perrin & Rowe, Aqualisa, Shaws, Emtek, and Schaub brands. The Outdoors segment manufactures and sells fiberglass and steel entry door systems under the Therma-Tru brand; storm, screen, and security doors under the Larson brand; composite decking, railing, and cladding under the Fiberon brand; and urethane millwork under the Fypon brand. The Security segment manufactures, sources, and distributes locks, safety and security devices, and electronic security products under the Master Lock, American Lock, Yale, and August brands; and fire-resistant safes, security containers, and commercial cabinets under the SentrySafe brand. The company sells its products through various sales channels, including kitchen and bath dealers, wholesalers oriented toward builders or professional remodelers, industrial and locksmith distributors, do-it-yourself remodeling-oriented home centers, showrooms, e-commerce, and other retail outlets. Fortune Brands Innovations, Inc. was incorporated in 1988 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"FirstEnergy Corp.","Symbol":"FE","Current Price":"40.13","Latest MA":"41.32","Price Target":46.21467,"Difference from MA":"-2.87%","Difference from Open":"-0.52%","Change from Yesterday":"-0.22%","Change from Last Report":"0.00","Latest Volume":"5,307,758","Market Cap":"23,127,601,152","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":13.910795,"PB Ratio":1.8610584,"Previous Close":40.22,"ROE":0.083050005,"DTE":173.13,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.495,"Trailing PEG":1.2139,"Trailing PE":25.890324,"Trailing PS":1.7445577,"Quick Ratio":0.406,"Day High":40.385,"Day Low":39.835,"VS Average Volume":1.7691642085,"Company Summary":"FirstEnergy Corp., through its subsidiaries, generates, transmits, and distributes electricity in the United States. It operates through Regulated Distribution and Regulated Transmission segments. The company owns and operates coal-fired, nuclear, hydroelectric, wind, and solar power generating facilities. It operates 24,080 circuit miles of overhead and underground transmission lines; and electric distribution systems, including 274,518 miles of overhead pole line and underground conduit carrying primary, secondary, and street lighting circuits. The company serves approximately 6 million customers in Ohio, Pennsylvania, West Virginia, Maryland, New Jersey, and New York. FirstEnergy Corp. was incorporated in 1996 and is headquartered in Akron, Ohio.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Honeywell International Inc.","Symbol":"HON","Current Price":"209.82","Latest MA":"213.99","Price Target":244.7213,"Difference from MA":"-1.95%","Difference from Open":"-2.41%","Change from Yesterday":"-5.64%","Change from Last Report":"0.00","Latest Volume":"11,935,158","Market Cap":"136,434,827,264","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":17.544666,"PB Ratio":7.8384643,"Previous Close":222.35,"ROE":0.31865,"DTE":177.821,"Industry":"Conglomerates","Sector":"Industrials","Beta":1.025,"Trailing PEG":1.8801,"Trailing PE":24.256649,"Trailing PS":3.6046188,"Quick Ratio":0.972,"Day High":215.23,"Day Low":206.18,"VS Average Volume":2.9906080864,"Company Summary":"Honeywell International Inc. engages in the aerospace technologies, building automation, energy and sustainable solutions, and industrial automation businesses in the United States, Europe, and internationally. The company's Aerospace segment offers auxiliary power units, propulsion engines, integrated avionics, environmental control and electric power systems, engine controls, flight safety, communications, navigation hardware, data and software applications, radar and surveillance systems, aircraft lighting, advanced systems and instruments, satellite and space components, and aircraft wheels and brakes; spare parts; repair, overhaul, and maintenance services; and thermal systems, as well as wireless connectivity services. Its Honeywell Building Technologies segment provides software applications for building control and optimization; sensors, switches, control systems, and instruments for energy management; access control; video surveillance; fire products; and installation, maintenance, and upgrades of systems. The company's Performance Materials and Technologies segment offers automation control, instrumentation, and software and related services; catalysts and adsorbents, equipment, and consulting; and materials to manufacture end products, such as bullet-resistant armor, nylon, computer chips, and pharmaceutical packaging, as well as provides materials based on hydrofluoro-olefin technology. Its Safety and Productivity Solutions segment provides personal protective equipment, apparel, gear, and footwear; gas detection technology; custom-engineered sensors, switches, and controls for sensing and productivity solution; cloud-based notification and emergency messaging; mobile devices and software; custom-engineered sensors, switches, and controls; and data and asset management productivity solutions. Honeywell International Inc. was founded in 1885 and is headquartered in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Xcel Energy Inc.","Symbol":"XEL","Current Price":"67.12","Latest MA":"63.22","Price Target":72.535,"Difference from MA":"6.16%","Difference from Open":"-0.22%","Change from Yesterday":"-1.22%","Change from Last Report":"0.00","Latest Volume":"5,610,945","Market Cap":"38,543,122,432","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":16.217497,"PB Ratio":1.9912188,"Previous Close":67.95,"ROE":0.10262,"DTE":154.33,"Industry":"Utilities - Regulated Electric","Sector":"Utilities","Beta":0.398,"Trailing PEG":2.1966,"Trailing PE":19.916916,"Trailing PS":2.8004885,"Quick Ratio":0.64,"Day High":67.73,"Day Low":66.0,"VS Average Volume":1.6158238248,"Company Summary":"Xcel Energy Inc., through its subsidiaries, engages in the generation, purchasing, transmission, distribution, and sale of electricity. It operates through Regulated Electric Utility, Regulated Natural Gas Utility, and All Other segments. The company generates electricity through wind, nuclear, hydroelectric, biomass, and solar energy sources, as well as coal, natural gas, oil, wood, and refuse-derived fuels. It also purchases, transports, distributes, and sells natural gas to retail customers, as well as transports customer-owned natural gas. In addition, the company develops and leases natural gas pipelines, and storage and compression facilities; and invests in rental housing projects and nonregulated assets, as well as procures equipment for the construction of renewable generation facilities. It serves residential, commercial, and industrial customers in the portions of Colorado, Michigan, Minnesota, New Mexico, North Dakota, South Dakota, Texas, and Wisconsin. The company was incorporated in 1909 and is headquartered in Minneapolis, Minnesota.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"XPO, Inc.","Symbol":"XPO","Current Price":"146.91","Latest MA":"125.90","Price Target":151.0087,"Difference from MA":"16.69%","Difference from Open":"-2.05%","Change from Yesterday":"7.78%","Change from Last Report":"0.00","Latest Volume":"2,516,940","Market Cap":"17,100,618,752","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":27.106516,"PB Ratio":10.420628,"Previous Close":136.31,"ROE":0.26075,"DTE":255.881,"Industry":"Trucking","Sector":"Industrials","Beta":1.923,"Trailing PEG":1.4485,"Trailing PE":47.698055,"Trailing PS":2.1137972,"Quick Ratio":0.923,"Day High":155.0,"Day Low":143.5,"VS Average Volume":1.6808735141,"Company Summary":"XPO, Inc. provides freight transportation services in the United States, rest of North America, France, the United Kingdom, rest of Europe, and internationally. The company operates in two segments, North American LTL and European Transportation. The North American LTL segment provides customers with less-than-truckload (LTL) services, such as geographic density and day-definite domestic services. This segment also offers cross-border U.S., Mexico, Canada, and the Caribbean, as well as engages in the operation of trailer manufacturing. The European Transportation segment offers dedicated truckload, LTL, truck brokerage, managed transportation, last mile, freight forwarding and multimodal solutions, such as road-rail and road-short sea combinations. It provides its services to customers in various industries, such as industrial and manufacturing, retail and e-commerce, food and beverage, logistics and transportation, and consumer goods. The company was formerly known as XPO Logistics, Inc. and changed its name to XPO, Inc. in December 2022. XPO, Inc. was incorporated in 2000 and is based in Greenwich, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Cloudflare, Inc.","Symbol":"NET","Current Price":"141.52","Latest MA":"94.76","Price Target":115.04138,"Difference from MA":"49.35%","Difference from Open":"-0.99%","Change from Yesterday":"-1.92%","Change from Last Report":"0.00","Latest Volume":"6,389,659","Market Cap":"48,568,815,616","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":165.72594,"PB Ratio":49.883682,"Previous Close":144.29,"ROE":-0.1122,"DTE":149.085,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.097,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":30.893187,"Quick Ratio":3.258,"Day High":144.0,"Day Low":140.53,"VS Average Volume":2.0353672696,"Company Summary":"Cloudflare, Inc. operates as a cloud services provider that delivers a range of services to businesses worldwide. The company provides an integrated cloud-based security solution to secure a range of combination of platforms, including public cloud, private cloud, on-premise, software-as-a-service applications, and IoT devices; and website and application security products comprising web application firewall, bot management, distributed denial of service, API gateways, SSL\/TLS encryption, script management, security center, and rate limiting products. It offers website and application performance solutions, including content delivery, load balancing, DNS, agro smart routing, video stream delivery, web optimization, cache reserve, cloudfare waiting room, and cloudfare data localization suite; SASE platform through cloudfare one that provides a cloud-based network-as-a-service; network services which deliver network connectivity, security, and performance, including magic WAN, magic transit, magic firewall, cloudflare network interconnect, and spectrum. In addition, the company provides zero trust services, such as cloudflare access, cloudflare gateway, remote browser isolation, cloud access security broker, cloud email security, and data loss prevention products that protects, inspects, and provides privilege rules to grant access to data and application. Further, it provides developer-based solutions consisting of cloudflare workers, R2 object storage, workers KV, durable objects, cloudfare pages, cloudfare stream, and cloudfare images; and consumer products comprising of 1.1.1.1, a DNS resolver, WARP, a virtual private network, and cloudfare registrar that secures registration and management of domain names. The company serves customers in the technology, healthcare, financial services, consumer and retail, industrial, and non-profit industries, as well as government. Cloudflare, Inc. was incorporated in 2009 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Philip Morris International Inc","Symbol":"PM","Current Price":"145.32","Latest MA":"120.50","Price Target":136.93071,"Difference from MA":"20.59%","Difference from Open":"-0.42%","Change from Yesterday":"10.95%","Change from Last Report":"0.00","Latest Volume":"12,263,581","Market Cap":"225,947,893,760","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":18.710554,"PB Ratio":"N\/A","Previous Close":130.98,"ROE":"N\/A","DTE":"N\/A","Industry":"Tobacco","Sector":"Consumer Defensive","Beta":0.56,"Trailing PEG":1.6251,"Trailing PE":23.066668,"Trailing PS":6.0707674,"Quick Ratio":0.404,"Day High":146.77,"Day Low":140.02,"VS Average Volume":2.4209867477,"Company Summary":"Philip Morris International Inc. operates as a tobacco company working to delivers a smoke-free future and evolving portfolio for the long-term to include products outside of the tobacco and nicotine sector. The company's product portfolio primarily consists of cigarettes and smoke-free products, including heat-not-burn, vapor, and oral nicotine products primarily under the IQOS and ZYN brands; and consumer accessories, such as lighters and matches. It also offers wellness and healthcare products. Philip Morris International Inc. was incorporated in 1987 and is headquartered in Stamford, Connecticut.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Warner Music Group Corp.","Symbol":"WMG","Current Price":"31.75","Latest MA":"30.65","Price Target":35.5555,"Difference from MA":"3.58%","Difference from Open":"2.09%","Change from Yesterday":"-1.09%","Change from Last Report":"0.00","Latest Volume":"4,199,604","Market Cap":"16,499,871,744","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":20.552689,"PB Ratio":34.03001,"Previous Close":32.1,"ROE":1.25054,"DTE":669.764,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.365,"Trailing PEG":1.2845,"Trailing PE":38.253014,"Trailing PS":2.5853763,"Quick Ratio":0.512,"Day High":32.69,"Day Low":29.9135,"VS Average Volume":2.4504318418,"Company Summary":"Warner Music Group Corp. operates as a music entertainment company in the United States, the United Kingdom, Germany, and internationally. It operates through Recorded Music and Music Publishing segments. The Recorded Music segment is involved in the discovery and development of recording artists, as well as related marketing, promotion, distribution, sale, and licensing of music created by such recording artists; markets its music catalog through compilations and reissuances of previously released music and video titles, as well as previously unreleased materials; and conducts its operation primarily through a collection of record labels, such as Warner Records and Atlantic Records, as well as Asylum, Big Beat, Canvasback, East West, Erato, FFRR, Fueled by Ramen, Nonesuch, Parlophone, Reprise, Roadrunner, Sire, Spinnin' Records, Warner Classics, and Warner Music Nashville. This segment markets, distributes, and sells music and video products to retailers and wholesale distributors; independent labels to retail and wholesale distributors; and various distribution centers and ventures, as well as retail outlets, online physical retailers, streaming services, and download services. The Music Publishing segment owns and acquires rights to approximately one million musical compositions comprising pop hits, American standards, folk songs, and motion picture and theatrical compositions. Its catalog includes approximately 150,000 songwriters and composers; and various genres, including pop, rock, jazz, classical, country, R&B, hip-hop, rap, reggae, Latin, folk, blues, symphonic, soul, Broadway, electronic, alternative, and gospel. This segment also administers the music and soundtracks of various third-party television and film producers and studios. The company was founded in 1929 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Eli Lilly and Company","Symbol":"LLY","Current Price":"870.37","Latest MA":"849.61","Price Target":975.08575,"Difference from MA":"2.44%","Difference from Open":"3.67%","Change from Yesterday":"3.35%","Change from Last Report":"0.00","Latest Volume":"6,308,115","Market Cap":"782,737,604,608","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":29.735245,"PB Ratio":54.999683,"Previous Close":842.18,"ROE":0.65318,"DTE":218.081,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.43,"Trailing PEG":0.7971,"Trailing PE":93.99244,"Trailing PS":19.155025,"Quick Ratio":0.63,"Day High":887.7368,"Day Low":835.97,"VS Average Volume":1.6149394537,"Company Summary":"Eli Lilly and Company discovers, develops, and markets human pharmaceuticals worldwide. The company offers Basaglar, Humalog, Humalog Mix 75\/25, Humalog U-100, Humalog U-200, Humalog Mix 50\/50, insulin lispro, insulin lispro protamine, insulin lispro mix 75\/25, Humulin, Humulin 70\/30, Humulin N, Humulin R, and Humulin U-500 for diabetes; Jardiance, Mounjaro, and Trulicity for type 2 diabetes; and Zepbound for obesity. It provides oncology products, including Alimta, Cyramza, Erbitux, Jaypirca, Retevmo, Tyvyt, and Verzenio. In addition, the company offers Olumiant for rheumatoid arthritis, atopic dermatitis, severe alopecia areata, and COVID-19; Taltz for plaque psoriasis, psoriatic arthritis, ankylosing spondylitis, and non-radiographic axial spondylarthritis; Omvoh for ulcerative colitis; Cymbalta for depressive disorder, diabetic peripheral neuropathic pain, generalized anxiety disorder, fibromyalgia, and chronic musculoskeletal pain; Ebglyss for severe atopic dermatitis; and Emgality for migraine prevention and episodic cluster headache. Further, it provides Cialis for erectile dysfunction and benign prostatic hyperplasia; and Forteo for osteoporosis. It operates Lilly Seaport Innovation Center (LSC), a research and development facility in the Boston Seaport to advancing Lilly's efforts in RNA and DNA-based therapies as well as discovering new drug targets to create life-changing medicines across several disease states, including diabetes, obesity, cardiovascular diseases, neurodegeneration, and chronic pain. It has collaborations with Incyte Corporation; Boehringer Ingelheim Pharmaceuticals, Inc.; F. Hoffmann-La Roche Ltd and Genentech, Inc.; Biologics, Inc., AbCellera Biologics Inc.; Verge Genomics; and Chugai Pharmaceutical Co., Ltd, as well as development collaboration with Eli Lilly and Company for developing QIAstat-Dx IVD panel, for the detection of various APOE genotypes. The company was founded in 1876 and is headquartered in Indianapolis, Indiana.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Principal Financial Group Inc","Symbol":"PFG","Current Price":"80.00","Latest MA":"81.54","Price Target":87.53846,"Difference from MA":"-1.89%","Difference from Open":"-1.43%","Change from Yesterday":"-0.71%","Change from Last Report":"0.00","Latest Volume":"2,402,244","Market Cap":"18,298,079,232","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":9.566197,"PB Ratio":1.6323533,"Previous Close":80.57,"ROE":-0.01274,"DTE":36.258,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.203,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":1.3008268,"Quick Ratio":0.549,"Day High":81.16,"Day Low":79.095,"VS Average Volume":1.9148893431,"Company Summary":"Principal Financial Group, Inc. provides retirement, asset management, and insurance products and services to businesses, individuals, and institutional clients worldwide. The company operates through Retirement and Income Solutions, Principal Asset Management, and Benefits and Protection segments. The Retirement and Income Solutions segment provides retirement, and related financial products and services. It offers products and services for defined contribution plans, including 401(k) and 403(b) plans, defined benefit plans, nonqualified executive benefit plans, employee stock ownership plans, equity compensation, and pension risk transfer services; individual retirement accounts; investment only products; and mutual funds, individual variable annuities, registered index-linked annuities, and bank products, as well as trust and custody services. The Principal Asset Management segment provides equity, fixed income, real estate, and other alternative investments, as well as asset allocation, stable value management, and other structured investment strategies. It also offers pension accumulation products and services, mutual funds, asset management, income annuities, and life insurance accumulation products, as well as voluntary savings plans in Brazil, Chile, Mexico, Asia, China, Hong Kong Special Administrative Region, and Southeast Asia. The Benefits and Protection segment provides specialty benefits, such as group dental and vision insurance, group life insurance, and group and individual disability insurance, as well as administers group dental, disability, and vision benefits; and individual life insurance products comprising universal, variable universal, indexed universal, and term life insurance products. It also offers insurance solutions for small and medium-sized businesses and their owners, as well as employees. Principal Financial Group, Inc. was founded in 1879 and is based in Des Moines, Iowa.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Gates Industrial Corporation pl","Symbol":"GTES","Current Price":"23.22","Latest MA":"18.96","Price Target":24.45455,"Difference from MA":"22.49%","Difference from Open":"10.68%","Change from Yesterday":"11.80%","Change from Last Report":"0.00","Latest Volume":"6,197,925","Market Cap":"5,914,551,808","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":13.482128,"PB Ratio":1.9014084,"Previous Close":20.77,"ROE":0.063379996,"DTE":72.92,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":1.387,"Trailing PEG":null,"Trailing PE":27.975903,"Trailing PS":1.7237561,"Quick Ratio":1.844,"Day High":23.235,"Day Low":20.89,"VS Average Volume":2.6233737045,"Company Summary":"Gates Industrial Corporation plc manufactures and sells engineered power transmission and fluid power solutions worldwide. It operates in two segments, Power Transmission and Fluid Power. The company offers synchronous or asynchronous belts, including V-belts, CVT belts, and Micro-V belts, as well as related components, such as sprockets, pulleys, water pumps, tensioners, and other accessories; solutions for stationary and mobile drives, engine systems, and personal mobility application platforms; metal drive components; and kits for automotive replacement channels. It also provides fluid power solutions comprising stationary hydraulics, mobile hydraulics, vehicle systems, and other industrial application platforms; and hydraulics, including hoses, tubing, coupling, and fittings, as well as assemblies. The company's products are used in applications across various markets, including industrial off-highway, such as construction and agriculture; first-fit end markets; industrial on-highway commercial vehicles comprising heavy-duty trucks and buses, energy and resources, automotive, and personal mobility; and various industrial applications, such as automated manufacturing and logistics systems. It sells its products under the Gates brand. It offers its products to replacement channel customers, as well as to original equipment manufacturers. The company was founded in 1911 and is headquartered in Denver, Colorado.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Linde plc","Symbol":"LIN","Current Price":"460.68","Latest MA":"451.56","Price Target":491.71,"Difference from MA":"2.02%","Difference from Open":"2.37%","Change from Yesterday":"1.54%","Change from Last Report":"0.00","Latest Volume":"2,412,172","Market Cap":"219,356,479,488","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":24.91098,"PB Ratio":5.599679,"Previous Close":453.7,"ROE":0.1619,"DTE":54.828,"Industry":"Specialty Chemicals","Sector":"Basic Materials","Beta":0.949,"Trailing PEG":2.5598,"Trailing PE":34.9,"Trailing PS":6.642134,"Quick Ratio":0.734,"Day High":461.49,"Day Low":450.01,"VS Average Volume":1.0510045048,"Company Summary":"Linde plc operates as an industrial gas company in the Americas, Europe, the Middle East, Africa, Asia, and South Pacific. It offers atmospheric gases, including oxygen, nitrogen, argon, and rare gases; and process gases, such as carbon dioxide, helium, hydrogen, electronic gases, specialty gases, and acetylene. The company also designs and constructs turnkey process plants for third-party customers, as well as for the gas businesses in various locations, such as air separation, hydrogen, synthesis, olefin, and natural gas plants. It serves a range of industries, including healthcare, chemicals and energy, manufacturing, metals and mining, food and beverage, and electronics. The company was founded in 1879 and is based in Woking, the United Kingdom.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Yum! Brands, Inc.","Symbol":"YUM","Current Price":"144.01","Latest MA":"132.74","Price Target":143.40875,"Difference from MA":"8.49%","Difference from Open":"3.81%","Change from Yesterday":"9.72%","Change from Last Report":"0.00","Latest Volume":"5,571,475","Market Cap":"40,189,157,376","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":21.866642,"PB Ratio":"N\/A","Previous Close":131.25,"ROE":"N\/A","DTE":"N\/A","Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":1.095,"Trailing PEG":2.3911,"Trailing PE":26.867537,"Trailing PS":5.5640535,"Quick Ratio":1.105,"Day High":144.4,"Day Low":138.1,"VS Average Volume":3.137377959,"Company Summary":"Yum! Brands, Inc., together with its subsidiaries, develops, operates, and franchises quick service restaurants worldwide. The company operates through the KFC Division, the Taco Bell Division, the Pizza Hut Division, and the Habit Burger Grill Division segments. It also operates restaurants under the KFC, Pizza Hut, Taco Bell, and The Habit Burger Grill brands, which specialize in chicken, pizza, made-to-order chargrilled burgers, sandwiches, Mexican-style food categories, and other food products. The company was formerly known as TRICON Global Restaurants, Inc. and changed its name to Yum! Brands, Inc. in May 2002. Yum! Brands, Inc. was incorporated in 1997 and is headquartered in Louisville, Kentucky.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"nVent Electric plc","Symbol":"NVT","Current Price":"65.81","Latest MA":"70.60","Price Target":81.8,"Difference from MA":"-6.78%","Difference from Open":"3.44%","Change from Yesterday":"3.51%","Change from Last Report":"0.00","Latest Volume":"7,133,224","Market Cap":"10,846,540,800","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":19.617311,"PB Ratio":3.3032172,"Previous Close":63.58,"ROE":0.18530001,"DTE":72.196,"Industry":"Electrical Equipment & Parts","Sector":"Industrials","Beta":1.25,"Trailing PEG":null,"Trailing PE":19.186588,"Trailing PS":3.0647738,"Quick Ratio":0.917,"Day High":66.69,"Day Low":62.15,"VS Average Volume":4.2205529088,"Company Summary":"nVent Electric plc, together with its subsidiaries, designs, manufactures, markets, installs, and services electrical connection and protection solutions in North America, Europe, the Middle East, Africa, the Asia Pacific, and internationally. The company operates through three segments: Enclosures, Electrical & Fastening Solutions, and Thermal Management. The Enclosures segment provides solutions to protect electronics and data in mission critical applications, including data solutions. This segment also offers digital and automation solutions, system integrations, and global services. The Electrical & Fastening Solutions segment provides solutions that connect and protect power and data infrastructure. This segment also offers power connections, fastening solutions, cable management solutions, grounding and bonding systems, and tools and test instruments. The Thermal Management segment offers heat management solutions that protect people and assets. This segment includes heat tracing for freeze protection and process temperature maintenance and control; pipe freeze protection, surface deicing, hot water temperature maintenance, floor heating, fire-rated wiring, and leak detection; and heat trace systems, connected controls, remote monitoring, and annual service programs. The company markets its products through electrical distributors, contractors, and original equipment manufacturers under the CADDY, ERICO, GARDNER BENDER, HOFFMAN, ILSCO, RAYCHEM, SCHROFF, and TRACER brand names. Its products are used for various applications, such as industrial, commercial and residential, infrastructure, and energy. nVent Electric plc was founded in 1903 and is based in London, the United Kingdom.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Roblox Corporation","Symbol":"RBLX","Current Price":"67.12","Latest MA":"49.35","Price Target":63.52419,"Difference from MA":"36.01%","Difference from Open":"11.62%","Change from Yesterday":"-11.06%","Change from Last Report":"0.00","Latest Volume":"51,518,388","Market Cap":"44,045,758,464","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":-50.461994,"PB Ratio":232.24915,"Previous Close":75.47,"ROE":-7.00543,"DTE":985.81,"Industry":"Electronic Gaming & Multimedia","Sector":"Communication Services","Beta":1.561,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":13.094301,"Quick Ratio":0.792,"Day High":67.0,"Day Low":60.11,"VS Average Volume":6.7847495866,"Company Summary":"Roblox Corporation develops and operates an online entertainment platform in the United States and internationally. It offers Roblox Studio, a free toolset that allows developers and creators to build, publish, and operate 3D experiences, and other content; Roblox Client, an application that allows users to explore 3D experience; and Roblox Cloud, which provides services and infrastructure that power the platform. Roblox Corporation was incorporated in 2004 and is headquartered in San Mateo, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Lincoln National Corporation","Symbol":"LNC","Current Price":"35.77","Latest MA":"31.78","Price Target":36.72727,"Difference from MA":"12.54%","Difference from Open":"3.29%","Change from Yesterday":"5.92%","Change from Last Report":"0.00","Latest Volume":"2,906,206","Market Cap":"6,093,169,664","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":4.284766,"PB Ratio":0.7590773,"Previous Close":33.77,"ROE":0.05781,"DTE":71.918,"Industry":"Insurance - Life","Sector":"Financial Services","Beta":1.783,"Trailing PEG":null,"Trailing PE":25.013987,"Trailing PS":0.44984642,"Quick Ratio":2.177,"Day High":36.39,"Day Low":34.365,"VS Average Volume":2.2906689052,"Company Summary":"Lincoln National Corporation, through its subsidiaries, operates multiple insurance and retirement businesses in the United States. It operates in four segments: Life Insurance, Annuities, Group Protection, and Retirement Plan Services. The Life Insurance segment provides life insurance products, including term insurance, universal life insurance (UL), indexed universal life insurance, variable universal life insurance (VUL), linked-benefit UL and VUL products, and critical illness and long-term care riders. The Annuities segment offers variable, fixed, and registered index-linked annuities. The Group Protection segment offers group non-medical insurance products consisting of short and long-term disability and statutory disability; paid family medical leave administration and absence management services; term life; dental and vision; and accident, critical illness, and hospital indemnity benefits and services to the employer marketplace through various forms of employee-paid and employer-paid plans. The Retirement Plan Services segment provides employers with retirement plan products and services primarily in the defined contribution retirement plan marketplace; individual and group variable annuities, group fixed annuities, and mutual fund-based programs; and various plan services, including plan recordkeeping, compliance testing, participant education, and trust and custodial services. The company distributes its products through consultants, brokers, planners, agents, financial advisors, third-party administrators, and other intermediaries. Lincoln National Corporation was founded in 1905 and is headquartered in Radnor, Pennsylvania.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Zimmer Biomet Holdings, Inc.","Symbol":"ZBH","Current Price":"102.69","Latest MA":"107.84","Price Target":124.6048,"Difference from MA":"-4.78%","Difference from Open":"-1.26%","Change from Yesterday":"-5.14%","Change from Last Report":"0.00","Latest Volume":"3,782,352","Market Cap":"20,442,908,672","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":11.26837,"PB Ratio":1.6563705,"Previous Close":108.25,"ROE":0.08713,"DTE":53.611,"Industry":"Medical Devices","Sector":"Healthcare","Beta":1.021,"Trailing PEG":1.4201,"Trailing PE":19.59733,"Trailing PS":2.69145,"Quick Ratio":0.574,"Day High":107.9475,"Day Low":102.33,"VS Average Volume":2.3800382331,"Company Summary":"Zimmer Biomet Holdings, Inc., together with its subsidiaries, operates as a medical technology company worldwide. The company designs, manufactures, and markets orthopedic reconstructive products, such as knee and hip products; S.E.T. products, including sports medicine, biologics, foot and ankle, extremities, and trauma products; craniomaxillofacial and thoracic products comprising face and skull reconstruction products, as well as products that fixate and stabilize the bones of the chest to facilitate healing or reconstruction after open heart surgery, trauma, or for deformities of the chest. It also offers robotic, surgical, and bone cement products. The company's products and solutions are used to treat patients suffering from disorders of, or injuries to, bones, joints, or supporting soft tissues. It serves orthopedic surgeons, neurosurgeons, hospitals, stocking distributors, healthcare dealers, and other specialists, as well as agents, healthcare purchasing organizations, or buying groups. The company was formerly known as Zimmer Holdings, Inc. and changed its name to Zimmer Biomet Holdings, Inc. in June 2015. Zimmer Biomet Holdings, Inc. was founded in 1927 and is headquartered in Warsaw, Indiana.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Rithm Capital Corp.","Symbol":"RITM","Current Price":"11.91","Latest MA":"10.82","Price Target":13.09091,"Difference from MA":"10.07%","Difference from Open":"2.06%","Change from Yesterday":"3.66%","Change from Last Report":"0.00","Latest Volume":"6,229,129","Market Cap":"6,190,007,808","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":5.7638144,"PB Ratio":0.9672704,"Previous Close":11.49,"ROE":0.07756,"DTE":389.996,"Industry":"REIT - Mortgage","Sector":"Real Estate","Beta":1.788,"Trailing PEG":null,"Trailing PE":12.153061,"Trailing PS":2.0589051,"Quick Ratio":0.722,"Day High":11.97,"Day Low":11.65,"VS Average Volume":1.7469112086,"Company Summary":"Rithm Capital Corp. operates as an asset manager focused on real estate, credit, and financial services. It operates through Origination and Servicing, Investment Portfolio, Mortgage Loans Receivable, and Asset Management segments. Its investment portfolio primarily comprises of mortgage servicing rights (MSR), and MSR financing receivables, title, appraisal and property preservation, excess MSRs, and services advance investments; real estate securities, call rights, SFR properties, and residential mortgage loans; consumer and business purpose loans; and asset management related investments. The company qualifies as a real estate investment trust for federal income tax purposes. It generally would not be subject to federal corporate income taxes if it distributes at least 90% of its taxable income to its stockholders. The company was formerly known as New Residential Investment Corp. and changed its name to Rithm Capital Corp. in August 2022. Rithm Capital Corp. was incorporated in 2011 and is based in New York, New York.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"ConocoPhillips","Symbol":"COP","Current Price":"99.94","Latest MA":"106.38","Price Target":131.96967,"Difference from MA":"-6.05%","Difference from Open":"1.06%","Change from Yesterday":"-0.27%","Change from Last Report":"0.00","Latest Volume":"7,459,596","Market Cap":"129,278,394,368","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":11.04191,"PB Ratio":2.305953,"Previous Close":100.21,"ROE":0.20376,"DTE":36.695,"Industry":"Oil & Gas E&P","Sector":"Energy","Beta":1.22,"Trailing PEG":8.2377,"Trailing PE":11.855279,"Trailing PS":2.27107,"Quick Ratio":1.078,"Day High":101.1,"Day Low":98.61,"VS Average Volume":1.0988310662,"Company Summary":"ConocoPhillips explores for, produces, transports, and markets crude oil, bitumen, natural gas, liquefied natural gas (LNG), and natural gas liquids in the United States, Canada, China, Libya, Malaysia, Norway, the United Kingdom, and internationally. The company's portfolio includes unconventional plays in North America; conventional assets in North America, Europe, Asia, and Australia; global LNG developments; oil sands assets in Canada; and an inventory of global exploration prospects. ConocoPhillips was founded in 1917 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Yum China Holdings, Inc.","Symbol":"YUMC","Current Price":"49.65","Latest MA":"41.20","Price Target":58.1776,"Difference from MA":"20.52%","Difference from Open":"1.35%","Change from Yesterday":"9.07%","Change from Last Report":"0.00","Latest Volume":"3,284,878","Market Cap":"18,696,503,296","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":17.184927,"PB Ratio":3.1443954,"Previous Close":45.52,"ROE":0.13741,"DTE":33.383,"Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":0.353,"Trailing PEG":1.3042,"Trailing PE":21.872248,"Trailing PS":1.6691816,"Quick Ratio":1.012,"Day High":50.05,"Day Low":48.27,"VS Average Volume":1.5287255168,"Company Summary":"Yum China Holdings, Inc. owns, operates, and franchises restaurants in the People's Republic of China. The company operates through KFC, Pizza Hut, and All Other segments. It operates restaurants under the KFC, Pizza Hut, Taco Bell, Lavazza, Little Sheep, and Huang Ji Huang concepts. The company also operates V-Gold Mall, a mobile e-commerce platform to sell products; and offers online food deliver services. Yum China Holdings, Inc. was founded in 1987 and is headquartered in Shanghai, the People's Republic of China.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Tapestry, Inc.","Symbol":"TPR","Current Price":"82.20","Latest MA":"51.48","Price Target":72.93895,"Difference from MA":"59.68%","Difference from Open":"-6.32%","Change from Yesterday":"12.02%","Change from Last Report":"0.00","Latest Volume":"15,055,476","Market Cap":"19,155,558,400","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":15.903695,"PB Ratio":6.532104,"Previous Close":73.38,"ROE":0.29924,"DTE":295.298,"Industry":"Luxury Goods","Sector":"Consumer Cyclical","Beta":1.556,"Trailing PEG":2.2903,"Trailing PE":23.826086,"Trailing PS":2.8738365,"Quick Ratio":4.233,"Day High":87.8749,"Day Low":81.5,"VS Average Volume":3.1126677748,"Company Summary":"Tapestry, Inc. provides luxury accessories and branded lifestyle products in North America, Greater China, rest of Asia, and internationally. The company operates in three segments: Coach, Kate Spade, and Stuart Weitzman. It offers women's handbags; and women's accessories, such as small leather goods which includes mini and micro handbags, money pieces, wristlets, pouches, and cosmetic cases, as well as novelty accessories including address books, time management and travel accessories, sketchbooks, and portfolios; and belts, key rings, and charms. The company also provides men products, which includes bag collections, such as business cases, computer bags, messenger-style bags, backpacks, and totes; small leather goods including wallets, card cases, travel organizers, and belts; and footwear, watches, fragrances, sunglasses, novelty accessories, and ready-to-wear items. In addition, it offers other products including women's footwear and fragrances; eyewear and sunglasses; and jewelry, such as bracelets, necklaces, rings, and earrings, watches, and other women's seasonal lifestyle apparel collections, including outerwear, ready-to-wear and cold weather accessories, such as gloves, scarves, and hats. Further, the company provides kids items, housewares, and home accessories, such as fashion bedding and tableware, stationery, and gifts. It offers its products through retail and outlet stores, brand e-commerce sites, and concession shop-in-shops, wholesale, and third-party distributors under the Coach, Kate Spade, and Stuart Weitzman brand names. The company was formerly known as Coach, Inc. and changed its name to Tapestry, Inc. in October 2017. Tapestry, Inc. was founded in 1941 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Kenvue Inc.","Symbol":"KVUE","Current Price":"19.80","Latest MA":"21.49","Price Target":24.20333,"Difference from MA":"-7.85%","Difference from Open":"-3.58%","Change from Yesterday":"-4.53%","Change from Last Report":"0.00","Latest Volume":"23,608,033","Market Cap":"37,961,748,480","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":15.484839,"PB Ratio":3.5643563,"Previous Close":20.74,"ROE":0.098809995,"DTE":82.929,"Industry":"Household & Personal Products","Sector":"Consumer Defensive","Beta":"N\/A","Trailing PEG":1.9259,"Trailing PE":35.999996,"Trailing PS":2.4556406,"Quick Ratio":0.58,"Day High":21.1,"Day Low":19.75,"VS Average Volume":1.8702212598,"Company Summary":"Kenvue Inc. operates as a consumer health company worldwide. The company operates through three segments: Self Care, Skin Health and Beauty, and Essential Health. The Self Care segment offers cough, cold and allergy, pain care, digestive health, smoking cessation, eye care, and other products under the Tylenol, Motrin, Benadryl, Nicorette, Zarbee's, ORSLTM, Rhinocort, Calpol, and Zyrtec brands. The Skin Health and Beauty segment provides face and body care, hair, sun, and other care products under the Neutrogena, Aveeno, Dr.Ci:Labo, Le Petit Marseillais, Lubriderm, Rogaine, and OGX brand names. The Essential Health segment offers oral and baby, women's health, wound, and other care products under the Listerine, Johnson's, Band-Aid, and Stayfree, o.b., tampons, Carefree, and Desitin Diaper Rash brands. The company was incorporated in 2022 and is headquartered in Skillman, New Jersey.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Affirm Holdings, Inc.","Symbol":"AFRM","Current Price":"61.75","Latest MA":"46.93","Price Target":66.05789,"Difference from MA":"31.57%","Difference from Open":"-1.98%","Change from Yesterday":"-1.67%","Change from Last Report":"0.00","Latest Volume":"10,467,022","Market Cap":"19,175,227,392","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":-297.59036,"PB Ratio":6.837559,"Previous Close":62.8,"ROE":-0.16519,"DTE":251.092,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":3.477,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":7.5943565,"Quick Ratio":12.914,"Day High":63.3599,"Day Low":60.56,"VS Average Volume":1.3166250896,"Company Summary":"Affirm Holdings, Inc. operates payment network in the United States, Canada, and internationally. The company's platform includes point-of-sale payment solution for consumers, merchant commerce solutions, and a consumer-focused app. Its commerce platform, agreements with originating banks, and capital markets partners enables consumers to pay for a purchase over time. The company has active merchants covering small businesses, large enterprises, direct-to-consumer brands, brick-and-mortar stores, and companies with an omni-channel presence. Its merchants represent a range of industries, including sporting goods and outdoors, home and lifestyle, travel and ticketing, electronics, fashion and beauty, equipment and auto, and general merchandise. Affirm Holdings, Inc. was founded in 2012 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Bristol-Myers Squibb Company","Symbol":"BMY","Current Price":"57.42","Latest MA":"51.84","Price Target":61.72,"Difference from MA":"10.77%","Difference from Open":"0.09%","Change from Yesterday":"-3.84%","Change from Last Report":"0.00","Latest Volume":"22,421,936","Market Cap":"116,458,086,400","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":9.138437,"PB Ratio":6.7928543,"Previous Close":59.71,"ROE":-0.3133,"DTE":299.052,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.441,"Trailing PEG":2.0894,"Trailing PE":"N\/A","Trailing PS":2.4551086,"Quick Ratio":1.016,"Day High":59.38,"Day Low":56.91,"VS Average Volume":2.0436294532,"Company Summary":"Bristol-Myers Squibb Company discovers, develops, licenses, manufactures, markets, distributes, and sells biopharmaceutical products worldwide. It offers products for hematology, oncology, cardiovascular, immunology, fibrotic, and neuroscience diseases. The company's products include Eliquis for reduction in risk of stroke\/systemic embolism in non-valvular atrial fibrillation, and for the treatment of DVT\/PE; Opdivo for various anti-cancer indications, including bladder, blood, CRC, head and neck, RCC, HCC, lung, melanoma, MPM, stomach and esophageal cancer; Pomalyst\/Imnovid for multiple myeloma; Orencia for active rheumatoid arthritis and psoriatic arthritis; and Sprycel for the treatment of Philadelphia chromosome-positive chronic myeloid leukemia. It also provides Yervoy for the treatment of patients with unresectable or metastatic melanoma; Empliciti for the treatment of multiple myeloma; Abecma for the treatment of relapsed or refractory multiple myeloma; Reblozyl for the treatment of anemia; Opdualag for the treatment of unresectable or metastatic melanoma; and Zeposia to treat relapsing forms of multiple sclerosis. In addition, the company offers Breyanzi for the treatment of relapsed or refractory large B-cell lymphoma; Onureg for the treatment of AML; Inrebic for the treatment of myelofibrosis; Camzyos for the treatment of symptomatic obstructive HCM to enhance functional capacity and symptom; Sotyktu for the treatment of moderate-to-severe plaque psoriasis; Augtyro for the treatment of locally advanced or metastatic ROS1-positive NSCLC; Revlimid, an oral immunomodulatory drug for the treatment of multiple myeloma; and Abraxane to treat breast cancer, NSCLC and pancreatic cancer. It sells products to wholesalers, distributors, pharmacies, retailers, hospitals, clinics, and government agencies. The company was formerly known as Bristol-Myers Company. Bristol-Myers Squibb Company was founded in 1887 and is headquartered in Princeton, New Jersey.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Fortinet, Inc.","Symbol":"FTNT","Current Price":"104.72","Latest MA":"81.92","Price Target":99.73806,"Difference from MA":"27.82%","Difference from Open":"0.11%","Change from Yesterday":"-0.33%","Change from Last Report":"0.00","Latest Volume":"6,479,289","Market Cap":"80,262,955,008","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":43.245743,"PB Ratio":88.2968,"Previous Close":105.07,"ROE":3.1152499,"DTE":118.588,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.995,"Trailing PEG":1.8138,"Trailing PE":52.623116,"Trailing PS":14.054591,"Quick Ratio":1.222,"Day High":105.82,"Day Low":103.96,"VS Average Volume":1.3864139208,"Company Summary":"Fortinet, Inc. provides cybersecurity and convergence of networking and security solutions worldwide. It offers secure networking solutions focus on the convergence of networking and security; network firewall solutions that consist of FortiGate data centers, hyperscale, and distributed firewalls, as well as encrypted applications; wireless LAN solutions; and secure connectivity solutions, including FortiSwitch secure ethernet switches, FortiAP wireless local area network access points, FortiExtender 5G connectivity gateways, and other products. The company also provides the Fortinet Unified SASE solutions that include firewall, SD-WAN, Secure web gateway, cloud access services broker, data loss prevention, zero trust network access, and cloud security, including web application firewalls, virtualized firewalls, and cloud-native firewalls. In addition, it offers security operations solutions comprising FortiAI generative AI assistant, FortiSIEM security information and event management, FortiSOAR security orchestration, automation and response, FortiEDR endpoint detection and response, FortiXDR extended detection and response, FortiMDR managed detection and response service, FortiNDR network detection and response, FortiRecon digital risk protection, FortiDeceptor deception technology, FortiGuard SoCaaS, FortiSandbox sandboxing, FortiGuard incident response, and other products. Further, the company offers FortiGuard security services consisting of FortiGuard application security, content security, device security, NOC\/SOC security, and web security services; FortiCare technical support services; and training services to customers and channel partners, as well as operates a FortiGuard Lab, a cybersecurity threat intelligence and research organization. It serves enterprise, communication and security service providers, government organizations, and small and medium-sized businesses. The company was incorporated in 2000 and is headquartered in Sunnyvale, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"The Hershey Company","Symbol":"HSY","Current Price":"152.34","Latest MA":"180.50","Price Target":164.88435,"Difference from MA":"-15.60%","Difference from Open":"-1.87%","Change from Yesterday":"4.40%","Change from Last Report":"0.00","Latest Volume":"4,123,635","Market Cap":"30,826,760,192","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":18.869047,"PB Ratio":7.3307347,"Previous Close":145.92,"ROE":0.43405998,"DTE":134.227,"Industry":"Confectioners","Sector":"Consumer Defensive","Beta":0.374,"Trailing PEG":4.5247,"Trailing PE":17.510345,"Trailing PS":2.8096268,"Quick Ratio":0.419,"Day High":156.59,"Day Low":150.52,"VS Average Volume":1.7550168601,"Company Summary":"The Hershey Company, together with its subsidiaries, engages in the manufacture and sale of confectionery products and pantry items in the United States and internationally. The company operates through three segments: North America Confectionery, North America Salty Snacks, and International. It offers chocolate and non-chocolate confectionery products; gum and mint refreshment products, including mints, chewing gums, and bubble gums; protein bars; pantry items, such as baking ingredients, toppings, beverages, and sundae syrups; and snack items comprising spreads, bars, snack bites, mixes, popcorn, and pretzels. The company provides its products primarily under the Hershey's, Reese's, Kisses, Jolly Rancher, Almond Joy, Brookside, barkTHINS, Cadbury, Good & Plenty, Heath, Kit Kat, Payday, Rolo, Twizzlers, Whoppers, York, Ice Breakers, Breath Savers, Bubble Yum, Lily's, SkinnyPop, Pirates Booty, Dot's Homestyle Pretzels, and ONE Bar brands, as well as under the Pelon Pelo Rico, IO-IO, and Sofit brands. It markets and sells its products to wholesale distributors, chain grocery stores, mass merchandisers, chain drug stores, vending companies, wholesale clubs, convenience stores, dollar stores, concessionaires, and department stores. The company exports its products in approximately 80 countries worldwide. The Hershey Company was founded in 1894 and is headquartered in Hershey, Pennsylvania.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Darling Ingredients Inc.","Symbol":"DAR","Current Price":"38.50","Latest MA":"37.47","Price Target":51.96714,"Difference from MA":"2.76%","Difference from Open":"0.65%","Change from Yesterday":"6.80%","Change from Last Report":"0.00","Latest Volume":"3,242,340","Market Cap":"6,123,347,968","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.2353325,"PB Ratio":1.3453541,"Previous Close":36.05,"ROE":0.059180003,"DTE":96.332,"Industry":"Packaged Foods","Sector":"Consumer Defensive","Beta":1.232,"Trailing PEG":null,"Trailing PE":23.765432,"Trailing PS":1.0358253,"Quick Ratio":0.688,"Day High":39.95,"Day Low":37.7673,"VS Average Volume":1.4579778143,"Company Summary":"Darling Ingredients Inc. develops, produces, and sells natural ingredients from edible and inedible bio-nutrients in North America, Europe, China, South America, and internationally. The company operates through three segments: Feed Ingredients, Food Ingredients, and Fuel Ingredients. It offers ingredients and customized specialty solutions for customers in the pharmaceutical, food, pet food, feed, industrial, fuel, bioenergy, and fertilizer industries. The company also collects and transforms various animal by-product streams into useable and specialty ingredients, such as collagen, edible fats, feed-grade fats, animal proteins and meals, plasma, pet food ingredients, organic fertilizers, yellow grease, fuel feedstock, green energy, natural casings, and hides. In addition, it recovers and converts used cooking oil and animal fats, and residual bakery products into valuable feed and fuel ingredients. Further, the company provides environmental services, including grease trap collection and disposal services to food service establishments. It primarily operates under the Rendac, Sonac, FASA, Ecoson, Rousselot, Gelnex, and CTH brand names. The company was formerly known as Darling International Inc. and changed its name to Darling Ingredients Inc. in May 2014. Darling Ingredients Inc. was founded in 1882 and is headquartered in Irving, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Ralph Lauren Corporation","Symbol":"RL","Current Price":"273.14","Latest MA":"201.07","Price Target":249.26471,"Difference from MA":"35.85%","Difference from Open":"-4.33%","Change from Yesterday":"9.69%","Change from Last Report":"0.00","Latest Volume":"2,441,528","Market Cap":"16,961,530,880","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":20.57662,"PB Ratio":7.0562406,"Previous Close":249.0,"ROE":0.28424,"DTE":109.237,"Industry":"Apparel Manufacturing","Sector":"Consumer Cyclical","Beta":1.504,"Trailing PEG":2.0131,"Trailing PE":26.062979,"Trailing PS":2.5165102,"Quick Ratio":1.115,"Day High":289.33,"Day Low":270.625,"VS Average Volume":3.4917630233,"Company Summary":"Ralph Lauren Corporation designs, markets, and distributes lifestyle products in North America, Europe, Asia, and internationally. The company offers apparel, including a range of men's, women's, and children's clothing; footwear and accessories, which comprise casual shoes, dress shoes, boots, sneakers, sandals, eyewear, watches, fashion and fine jewelry, scarves, hats, gloves, and umbrellas, as well as leather goods, such as handbags, luggage, small leather goods, and belts; home products consisting of bed and bath lines, furniture, fabric and wallcoverings, floor coverings, lighting, tabletop, kitchen linens, floor coverings, dining, decorative accessories, and giftware; and fragrances. It sells apparel and accessories under the Ralph Lauren Collection, Ralph Lauren Purple Label, Polo Ralph Lauren, Double RL, Lauren Ralph Lauren, Polo Golf Ralph Lauren, Ralph Lauren Golf, RLX Ralph Lauren, Polo Ralph Lauren Children, and Chaps brands; women's fragrances under the Ralph Lauren Collection, Woman by Ralph Lauren, Romance Collection, and Ralph Collection brand names; and men's fragrances under the Ralph's Club, Purple Label, Polo Blue, Polo Red, Polo Green, Polo Black, Polo 67, Safari, Polo Sport, and Big Pony Men's brand names. The company's restaurant collection includes The Polo Bar in New York City; RL Restaurant in Chicago; Ralph's in Paris; The Bar at Ralph Lauren located in Milan; Ralph's Bar located in Chengdu, China; and Ralph's Coffee concept. It sells its products to department stores, specialty stores, and golf and pro shops, as well as directly to consumers through its retail stores, concession-based shop-within-shops, and its digital commerce sites. The company directly operates retail stores and concession-based shop-within-shops; and operates Ralph Lauren stores and stores and shops through licensing partners. Ralph Lauren Corporation was founded in 1967 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Blue Owl Capital Inc.","Symbol":"OWL","Current Price":"24.77","Latest MA":"20.92","Price Target":26.2,"Difference from MA":"18.38%","Difference from Open":"-1.82%","Change from Yesterday":"-0.72%","Change from Last Report":"0.00","Latest Volume":"6,209,929","Market Cap":"36,994,490,368","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":22.62865,"PB Ratio":7.0249577,"Previous Close":24.95,"ROE":0.07691,"DTE":49.396,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.142,"Trailing PEG":null,"Trailing PE":137.61111,"Trailing PS":17.142149,"Quick Ratio":1.923,"Day High":25.89,"Day Low":24.31,"VS Average Volume":0.9831782765,"Company Summary":"Blue Owl Capital Inc. operates as an asset manager in the United States. The company offers permanent capital base solutions that enables it to offer holistic framework of capital solutions to middle market companies, large alternative asset managers, and corporate real estate owners and tenants. It also provides direct lending products that offer private credit products comprising diversified, technology, first lien, and opportunistic lending to middle-market companies; liquid credit; GP strategic capital products, which offers capital solutions, including GP minority stakes, GP debt financing, and professional sports minority stakes; and real estate products that focuses on acquiring triple net lease real estate by investment grade or creditworthy tenants. It offers its solutions through permanent capital vehicles, as well as long-dated private funds. Blue Owl Capital Inc. is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Pinterest, Inc.","Symbol":"PINS","Current Price":"33.59","Latest MA":"32.45","Price Target":39.39189,"Difference from MA":"3.51%","Difference from Open":"1.54%","Change from Yesterday":"0.87%","Change from Last Report":"0.00","Latest Volume":"17,608,524","Market Cap":"22,700,994,560","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":18.541723,"PB Ratio":7.8353157,"Previous Close":33.3,"ROE":0.07572,"DTE":5.335,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.017,"Trailing PEG":0.4534,"Trailing PE":104.96875,"Trailing PS":6.5358615,"Quick Ratio":7.63,"Day High":33.9,"Day Low":33.08,"VS Average Volume":1.5552076089,"Company Summary":"Pinterest, Inc. operates as a visual search and discovery platform in the United States and internationally. Its platform allows people to find ideas, such as recipes, home and style inspiration, and others; and to search, save, and shop the ideas. The company was formerly known as Cold Brew Labs Inc. and changed its name to Pinterest, Inc. in April 2012. Pinterest, Inc. was incorporated in 2008 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Equifax, Inc.","Symbol":"EFX","Current Price":"247.48","Latest MA":"273.03","Price Target":304.0058,"Difference from MA":"-9.36%","Difference from Open":"-2.88%","Change from Yesterday":"-8.42%","Change from Last Report":"0.00","Latest Volume":"3,879,662","Market Cap":"30,675,640,320","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":22.7531,"PB Ratio":6.246183,"Previous Close":270.23,"ROE":0.11927,"DTE":108.422,"Industry":"Consulting Services","Sector":"Industrials","Beta":1.594,"Trailing PEG":0.9142,"Trailing PE":54.87361,"Trailing PS":5.48936,"Quick Ratio":0.79,"Day High":260.05,"Day Low":245.6638,"VS Average Volume":4.069662325,"Company Summary":"Equifax Inc. operates as a data, analytics, and technology company. The company operates through three segments: Workforce Solutions, U.S. Information Solutions (USIS), and International. The Workforce Solutions segment offers services that enables customers to verify income, employment, educational history, criminal justice data, healthcare professional licensure, and sanctions of people in the United States; and employer customers with services that assist them in complying with and automating payroll-related and human resource management processes throughout the entire cycle of the employment relationship. The USIS segment provides consumer and commercial information services, such as credit information and credit scoring, credit modeling and portfolio analytics, locate, fraud detection and prevention, identity verification, and other consulting services; mortgage services; financial marketing services; identity management services; and credit monitoring products. The International segment offers information service products, which include consumer and commercial services, such as credit and financial information, and credit scoring and modeling; and credit and other marketing products and services, as well as offers information, technology, and other services to support debt collections and recovery management. The company serves customers in financial services, mortgage, retail, telecommunications, utilities, automotive, brokerage, healthcare, and insurance industries, as well as government agencies. It operates in Argentina, Australia, Brazil, Canada, Chile, Costa Rica, Dominican Republic, Ecuador, El Salvador, Honduras, India, Ireland, Mexico, New Zealand, Paraguay, Peru, Portugal, Spain, the United Kingdom, Uruguay, and the United States. The company was founded in 1899 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Huntington Ingalls Industries, ","Symbol":"HII","Current Price":"159.75","Latest MA":"231.47","Price Target":218.92667,"Difference from MA":"-30.98%","Difference from Open":"-6.68%","Change from Yesterday":"-18.32%","Change from Last Report":"0.00","Latest Volume":"2,385,752","Market Cap":"6,250,905,600","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":9.263007,"PB Ratio":1.4872363,"Previous Close":195.58,"ROE":0.17666,"DTE":67.095,"Industry":"Aerospace & Defense","Sector":"Industrials","Beta":0.548,"Trailing PEG":1.4065,"Trailing PE":9.025423,"Trailing PS":0.5339004,"Quick Ratio":0.699,"Day High":175.0,"Day Low":158.88,"VS Average Volume":4.3399719128,"Company Summary":"Huntington Ingalls Industries, Inc. designs, builds, overhauls, and repairs military ships in the United States. It operates through three segments: Ingalls, Newport News, and Mission Technologies. The company is involved in the design and construction of non-nuclear ships comprising amphibious assault ships; expeditionary warfare ships; surface combatants; and national security cutters for the U.S. Navy and U.S. Coast Guard. It also provides nuclear-powered ships, such as aircraft carriers and submarines, as well as refueling and overhaul, and inactivation services of nuclear-powered aircraft carriers. In addition, the company offers naval nuclear support services, including fleet services comprising design, construction, maintenance, and disposal activities for in-service the U.S. Navy nuclear ships; and maintenance services on nuclear reactor prototypes. Further, the company provides C5ISR systems and operations; application of artificial intelligence and machine learning to battlefield decisions; defensive and offensive cyberspace strategies and electronic warfare; live, virtual, and constructive solutions; unmanned, autonomous systems; and fleet sustainment; and critical nuclear operations. Huntington Ingalls Industries, Inc. was founded in 1886 and is headquartered in Newport News, Virginia.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"BorgWarner Inc.","Symbol":"BWA","Current Price":"30.24","Latest MA":"33.17","Price Target":39.41765,"Difference from MA":"-8.84%","Difference from Open":"-5.08%","Change from Yesterday":"-2.98%","Change from Last Report":"0.00","Latest Volume":"5,333,663","Market Cap":"6,613,488,128","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":6.018198,"PB Ratio":1.0743214,"Previous Close":31.17,"ROE":0.15923999,"DTE":74.606,"Industry":"Auto Parts","Sector":"Consumer Cyclical","Beta":1.186,"Trailing PEG":1.2103,"Trailing PE":7.4851484,"Trailing PS":0.46675757,"Quick Ratio":1.407,"Day High":32.98,"Day Low":29.98,"VS Average Volume":2.341266664,"Company Summary":"BorgWarner Inc., together with its subsidiaries, provides solutions for combustion, hybrid, and electric vehicles worldwide. It offers turbochargers, eBoosters, eTurbos, timing systems, emissions systems, thermal systems, gasoline ignition technology, smart remote actuators, powertrain sensors, cabin heaters, battery modules and systems, battery heaters, and battery charging. The company provides power electronics, control modules, software, friction, and mechanical products for automatic transmissions and torque-management products. It sells its products to original equipment manufacturers of light vehicles, which comprise passenger cars, sport-utility vehicles, vans, and light trucks; commercial vehicles, including medium-duty and heavy-duty trucks, and buses; and off-highway vehicles, such as agricultural and construction machinery, and marine applications, as well as to tier one vehicle systems suppliers and the aftermarket for light, commercial, and off-highway vehicles. The company was formerly known as Borg-Warner Automotive, Inc. BorgWarner Inc. was incorporated in 1987 and is headquartered in Auburn Hills, Michigan.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Microchip Technology Incorporat","Symbol":"MCHP","Current Price":"53.11","Latest MA":"71.85","Price Target":77.64167,"Difference from MA":"-26.09%","Difference from Open":"-1.02%","Change from Yesterday":"-0.73%","Change from Last Report":"0.00","Latest Volume":"12,656,654","Market Cap":"28,520,601,600","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":23.055517,"PB Ratio":4.5443654,"Previous Close":53.5,"ROE":0.118030004,"DTE":102.895,"Industry":"Semiconductors","Sector":"Technology","Beta":1.526,"Trailing PEG":8.9386,"Trailing PE":36.881943,"Trailing PS":5.1887712,"Quick Ratio":0.405,"Day High":54.2195,"Day Low":52.715,"VS Average Volume":1.4719653129,"Company Summary":"Microchip Technology Incorporated engages in the development, manufacture, and sale of smart, connected, and secure embedded control solutions in the Americas, Europe, and Asia. The company offers general purpose 8-bit, 16-bit, and 32-bit mixed-signal microcontrollers; 32-bit embedded mixed-signal microprocessors; and specialized microcontrollers for automotive, industrial, computing, communications, lighting, power supplies, motor control, human machine interface, security, wired connectivity, and wireless connectivity applications. It also provides analog, interface, mixed signal, and timing products comprising power management, linear, mixed-signal, high-voltage, thermal management, discrete diodes, and metal oxide semiconductor field effect transistors (MOSFETS), radio frequency (RF), drivers, safety, security, timing, USB, Ethernet, wireless, and other interface products; field-programmable gate array (FPGA) products; and application development tools that enable system designers to program microcontroller, FPGA, and microprocessor products for specific applications. In addition, the company offers serial electrically erasable programmable read-only memory, serial flash memories, parallel flash memories, serial static random access memories, and serial electrically erasable random access memories for the production of very small footprint devices; and licenses its SuperFlash embedded flash and non-volatile memory technologies to foundries, integrated device manufacturers, and design partners for use in the manufacture of microcontroller products, gate array, RF, analog, and neuromorphic compute products that require embedded non-volatile memory, as well as provides engineering services. Further, it offers wafer foundry and assembly, and test subcontracting manufacturing services; and timing systems products, application specific integrated circuits, and aerospace products. The company was incorporated in 1989 and is headquartered in Chandler, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Air Products and Chemicals, Inc","Symbol":"APD","Current Price":"328.13","Latest MA":"295.41","Price Target":355.09454,"Difference from MA":"11.07%","Difference from Open":"-0.55%","Change from Yesterday":"-1.51%","Change from Last Report":"0.00","Latest Volume":"2,662,821","Market Cap":"72,969,224,192","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":23.378159,"PB Ratio":4.287376,"Previous Close":333.15,"ROE":0.2258,"DTE":79.822,"Industry":"Specialty Chemicals","Sector":"Basic Materials","Beta":0.826,"Trailing PEG":12.3203,"Trailing PE":19.05517,"Trailing PS":6.0302153,"Quick Ratio":1.296,"Day High":336.644,"Day Low":317.9717,"VS Average Volume":1.7959439827,"Company Summary":"Air Products and Chemicals, Inc. provides atmospheric gases, process and specialty gases, equipment, and related services in the Americas, Asia, Europe, the Middle East, India, and internationally. The company produces atmospheric gases, including oxygen, nitrogen, and argon; process gases, such as hydrogen, helium, carbon dioxide, carbon monoxide, and syngas; and specialty gases for customers in various industries, including refining, chemical, manufacturing, electronics, energy production, medical, food, and metals. It also designs and manufactures equipment for air separation, hydrocarbon recovery and purification, natural gas liquefaction, and liquid helium and liquid hydrogen transport and storage. The company was founded in 1940 and is headquartered in Allentown, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Expedia Group, Inc.","Symbol":"EXPE","Current Price":"172.57","Latest MA":"156.85","Price Target":192.58559,"Difference from MA":"10.02%","Difference from Open":"1.73%","Change from Yesterday":"1.67%","Change from Last Report":"0.00","Latest Volume":"3,732,713","Market Cap":"22,148,669,440","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":10.1991005,"PB Ratio":16.81805,"Previous Close":169.73,"ROE":0.38564998,"DTE":255.417,"Industry":"Travel Services","Sector":"Consumer Cyclical","Beta":1.785,"Trailing PEG":0.457,"Trailing PE":22.440832,"Trailing PS":1.6536262,"Quick Ratio":0.592,"Day High":175.26,"Day Low":169.59,"VS Average Volume":2.475170467,"Company Summary":"Expedia Group, Inc. operates as an online travel company in the United States and internationally. The company operates through B2C, B2B, and trivago segments. Its B2C segment includes Brand Expedia, a full-service online travel brand offers various travel products and services; Hotels.com for lodging accommodations; Vrbo, an online marketplace for the alternative accommodations; Orbitz, Travelocity, Wotif Group, ebookers, CheapTickets, Hotwire.com and CarRentals.com. The company's B2B segment provides various travel and non-travel companies including airlines, offline travel agents, online retailers, corporate travel management, and financial institutions who leverage its travel technology and tap into its diverse supply to augment their offerings and market Expedia Group rates and availabilities to its travelers. Its trivago segment, a hotel metasearch website, which send referrals to online travel companies and travel service providers from hotel metasearch websites. In addition, the company provides brand advertising through online and offline channels, loyalty programs, mobile apps, and search engine marketing, as well as metasearch, social media, direct and personalized traveler communications on its websites, and through direct e-mail communication with its travelers. The company was formerly known as Expedia, Inc. and changed its name to Expedia Group, Inc. in March 2018. Expedia Group, Inc. was founded in 1996 and is headquartered in Seattle, Washington.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Skechers U.S.A., Inc.","Symbol":"SKX","Current Price":"75.62","Latest MA":"66.41","Price Target":83.64867,"Difference from MA":"13.87%","Difference from Open":"-0.26%","Change from Yesterday":"1.63%","Change from Last Report":"0.00","Latest Volume":"3,650,515","Market Cap":"11,416,503,296","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":15.461368,"PB Ratio":2.619056,"Previous Close":74.41,"ROE":0.15761,"DTE":42.625,"Industry":"Footwear & Accessories","Sector":"Consumer Cyclical","Beta":1.233,"Trailing PEG":null,"Trailing PE":18.625616,"Trailing PS":1.3095511,"Quick Ratio":1.149,"Day High":76.78,"Day Low":74.91,"VS Average Volume":2.018171485,"Company Summary":"Skechers U.S.A., Inc. designs, develops, markets, and distributes footwear for men, women, and children worldwide. The company operates through Wholesale and Direct-to-Consumer segments. It offers footwear under Skechers Hands Free Slip-ins, Skechers Arch Fit, and Skechers Air-Cooled Memory Foam brands. In addition, the company provides men's and women's slip-resistant and safety-toe casuals, and boots for protective footwear in their work environments. It sells its products through department stores, family shoe stores, specialty running and sporting goods retailers, and big box club stores; franchisee and licensee third-party store operators; company-owned retail stores; digital commerce sites and mobile applications; and concept, factory outlet, and big box stores. The company licenses its Skechers brand. Skechers U.S.A., Inc. was incorporated in 1992 and is headquartered in Manhattan Beach, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Amazon.com, Inc.","Symbol":"AMZN","Current Price":"238.83","Latest MA":"199.26","Price Target":249.69365,"Difference from MA":"19.86%","Difference from Open":"0.24%","Change from Yesterday":"1.13%","Change from Last Report":"0.00","Latest Volume":"51,293,543","Market Cap":"2,511,297,576,960","Earning Date":"2025-02-06","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":38.488068,"PB Ratio":9.686879,"Previous Close":236.17,"ROE":0.22558,"DTE":61.175,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":1.146,"Trailing PEG":1.9409,"Trailing PE":51.032055,"Trailing PS":4.049644,"Quick Ratio":0.827,"Day High":239.6599,"Day Low":236.01,"VS Average Volume":1.4090676539,"Company Summary":"Amazon.com, Inc. engages in the retail sale of consumer products, advertising, and subscriptions service through online and physical stores in North America and internationally. The company operates through three segments: North America, International, and Amazon Web Services (AWS). It also manufactures and sells electronic devices, including Kindle, Fire tablets, Fire TVs, Echo, Ring, Blink, and eero; and develops and produces media content. In addition, the company offers programs that enable sellers to sell their products in its stores; and programs that allow authors, independent publishers, musicians, filmmakers, Twitch streamers, skill and app developers, and others to publish and sell content. Further, it provides compute, storage, database, analytics, machine learning, and other services, as well as advertising services through programs, such as sponsored ads, display, and video advertising. Additionally, the company offers Amazon Prime, a membership program. The company's products offered through its stores include merchandise and content purchased for resale and products offered by third-party sellers. It serves consumers, sellers, developers, enterprises, content creators, advertisers, and employees. Amazon.com, Inc. was incorporated in 1994 and is headquartered in Seattle, Washington.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Intercontinental Exchange Inc.","Symbol":"ICE","Current Price":"167.68","Latest MA":"155.58","Price Target":180.0625,"Difference from MA":"7.77%","Difference from Open":"1.30%","Change from Yesterday":"4.34%","Change from Last Report":"0.00","Latest Volume":"4,423,760","Market Cap":"96,277,995,520","Earning Date":"2025-02-06","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":22.573162,"PB Ratio":3.5342717,"Previous Close":160.7,"ROE":0.09408,"DTE":78.899,"Industry":"Financial Data & Stock Exchanges","Sector":"Financial Services","Beta":1.092,"Trailing PEG":2.591,"Trailing PE":39.828976,"Trailing PS":10.514141,"Quick Ratio":0.027,"Day High":169.72,"Day Low":163.995,"VS Average Volume":1.4723619278,"Company Summary":"Intercontinental Exchange, Inc., together with its subsidiaries, engages in the provision of market infrastructure, data services, and technology solutions for financial institutions, corporations, and government entities in the United States, the United Kingdom, the European Union, Singapore, India, Abu Dhabi, Israel, and Canada. It operates through three segments: Exchanges, Fixed Income and Data Services, and Mortgage Technology. The company operates regulated marketplaces for listing, trading, and clearing an array of derivatives contracts and financial securities, such as commodities, interest rates, foreign exchange, and equities, as well as corporate and exchange-traded funds; and trading venues, including regulated exchanges and clearing houses. It also offers energy, agricultural and metals, and financial futures and options; and cash equities and equity options, and over-the-counter and other markets, as well as listings and data and connectivity services. In addition, the company provides fixed income data and analytic, fixed income execution, CDS clearing, and other multi-asset class data and network services. Further, it offers proprietary and comprehensive mortgage origination platform, which serves residential mortgage loans; closing solutions that provides customers connectivity to the mortgage supply chain and facilitates the secure exchange of information; data and analytics services; and Data as a Service for lenders to access data and origination information. Intercontinental Exchange, Inc. was founded in 2000 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Skyworks Solutions, Inc.","Symbol":"SWKS","Current Price":"65.60","Latest MA":"96.18","Price Target":74.01714,"Difference from MA":"-31.79%","Difference from Open":"4.89%","Change from Yesterday":"-24.67%","Change from Last Report":"0.00","Latest Volume":"19,910,398","Market Cap":"10,544,609,280","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":14.530666,"PB Ratio":1.6543097,"Previous Close":87.08,"ROE":0.12777,"DTE":15.691,"Industry":"Semiconductors","Sector":"Technology","Beta":1.205,"Trailing PEG":1.1252,"Trailing PE":20.184614,"Trailing PS":2.4119606,"Quick Ratio":3.333,"Day High":67.3,"Day Low":62.01,"VS Average Volume":7.7615486299,"Company Summary":"Skyworks Solutions, Inc., together with its subsidiaries, designs, develops, manufactures, and markets proprietary semiconductor products in the United States, China, South Korea, Taiwan, Europe, the Middle East, Africa, and the rest of Asia-Pacific. Its product portfolio includes amplifiers, antenna tuners, attenuators, automotive tuners and digital radios, DC\/DC converters, demodulators, detectors, diodes, wireless analog system on chip products, directional couplers, diversity receive modules, filters, front-end modules, hybrids, light emitting diode drivers, low noise amplifiers, mixers, modulators, optocouplers\/optoisolators, phase locked loops, phase shifters, power dividers\/combiners, power over ethernet, power isolators, receivers, switches, synthesizers, timing devices, voltage controlled oscillators\/synthesizers, and voltage regulators. The company products are the used in aerospace, automotive, broadband, cellular infrastructure, connected home, defense, entertainment and gaming, industrial, medical, military, smartphone, tablet, and wearable markets. It sells its products through direct sales force, electronic component distributors, and independent sales representatives. Skyworks Solutions, Inc. was founded in 1962 and is based in Irvine, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"New York Times Company (The)","Symbol":"NYT","Current Price":"49.20","Latest MA":"53.80","Price Target":56.34556,"Difference from MA":"-8.56%","Difference from Open":"-0.91%","Change from Yesterday":"-0.06%","Change from Last Report":"0.00","Latest Volume":"3,132,234","Market Cap":"8,066,536,960","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":21.318913,"PB Ratio":4.3589973,"Previous Close":49.23,"ROE":0.15986,"DTE":"N\/A","Industry":"Publishing","Sector":"Communication Services","Beta":1.019,"Trailing PEG":null,"Trailing PE":27.796612,"Trailing PS":3.2149062,"Quick Ratio":1.157,"Day High":49.67,"Day Low":48.06,"VS Average Volume":2.0897985817,"Company Summary":"The New York Times Company, together with its subsidiaries, creates, collects, and distributes news and information worldwide. The company operates through two segments, The New York Times Group and The Athletic. It offers The New York Times (The Times) through company's mobile application, website, printed newspaper, and associated content, such as podcast. The company also offers The Athletic, a sports media product; Cooking, a recipe product; Games, a puzzle games product; and Audio, an audio product. In addition, it offers a portfolio of advertising products and services to advertisers, such as luxury goods, technology, and financial companies, to promote products, services or brands on digital platforms in the form of display ads, audio and video, in print in the form of column-inch ads, and at live events; and Wirecutter, a product review and recommendation product. Further, the company licenses content to digital aggregators in the business, professional, academic and library markets, and third-party digital platforms; articles, graphics, and photographs, including newspapers, magazines, and websites; and for use in television, films, and books, as well as provide rights to reprint articles, and create and sell new digests. Additionally, it engages in commercial printing and distribution for third parties; and operates the NYTimes.com website. The company was founded in 1851 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Cognizant Technology Solutions ","Symbol":"CTSH","Current Price":"87.09","Latest MA":"76.71","Price Target":86.4387,"Difference from MA":"13.53%","Difference from Open":"3.17%","Change from Yesterday":"4.17%","Change from Last Report":"0.00","Latest Volume":"6,310,540","Market Cap":"43,181,309,952","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":16.242468,"PB Ratio":2.9889832,"Previous Close":83.6,"ROE":0.16478,"DTE":12.891,"Industry":"Information Technology Services","Sector":"Technology","Beta":1.052,"Trailing PEG":1.3946,"Trailing PE":19.31042,"Trailing PS":2.2244647,"Quick Ratio":1.839,"Day High":87.61,"Day Low":83.35,"VS Average Volume":2.1332414755,"Company Summary":"Cognizant Technology Solutions Corporation, a professional services company, provides consulting and technology, and outsourcing services in North America, Europe, and internationally. It operates through four segments: Financial Services, Health Sciences, Products and Resources, and Communications, Media and Technology. The company provides customer experience, robotic process automation, analytics, and AI services in areas, such as digital lending, fraud detection, and next generation payments; the shift towards consumerism, outcome-based contracting, digital health, delivering integrated seamless, omni-channel, and patient-centered experience; and services that drive operational improvements in areas, such as clinical development, pharmacovigilance, and manufacturing, as well as claims processing, enrollment, membership, and billing to healthcare providers and payers, and life sciences companies, including pharmaceutical, biotech, and medical device companies. It offers solution to manufacturers, automakers, retailers and travel and hospitality companies, as well as companies providing logistics, energy and utility services; and digital content, business process improvement, technology modernization, and the creation of unified and compelling user experience services to communications, media and entertainment, education, and information services and technology companies. The company was incorporated in 1988 and is headquartered in Teaneck, New Jersey.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Fiserv, Inc.","Symbol":"FI","Current Price":"231.24","Latest MA":"189.17","Price Target":251.7103,"Difference from MA":"22.24%","Difference from Open":"0.76%","Change from Yesterday":"0.75%","Change from Last Report":"0.00","Latest Volume":"2,383,029","Market Cap":"131,556,827,136","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":19.295696,"PB Ratio":4.74962,"Previous Close":229.53,"ROE":0.10618,"DTE":89.406,"Industry":"Information Technology Services","Sector":"Technology","Beta":0.919,"Trailing PEG":1.5442,"Trailing PE":43.061455,"Trailing PS":6.53796,"Quick Ratio":0.215,"Day High":232.25,"Day Low":228.27,"VS Average Volume":0.8753926913,"Company Summary":"Fiserv, Inc., together with its subsidiaries, provides payments and financial services technology services in the United States, Europe, the Middle East and Africa, Latin America, the Asia-Pacific, and internationally. It operates through Merchant Acceptance, Financial Technology, and Payments and Network segments. The Merchant Acceptance segment provides merchant acquiring and digital commerce services; mobile payment services; security and fraud protection products; Clover, a cloud based POS and integrated commerce operating system for small and mid-sized businesses and independent software vendors; and Carat, an integrated operating system for large businesses. This segment distributes through various channels, including direct sales teams, strategic partnerships with agent sales forces, independent software vendors, financial institutions, and other strategic partners in the form of joint venture alliances, revenue sharing alliances, and referral agreement. The Financial Technology segment offers customer deposit and loan accounts, as well as manages an institution's general ledger and central information files. This segment also provides digital banking, financial and risk management, professional services and consulting, check processing, and other products and services. The Payments and Network segment offers card transactions, such as debit, credit, and prepaid card processing and services; funds access, debit payments, cardless ATM access, and surcharge-free ATM network; security and fraud protection products; card production; print services; and various network services, as well as non-card digital payment software and services, including bill payment, account-to-account transfers, person-to-person payments, electronic billing, and security and fraud protection products. It serves merchants, banks, credit unions, other financial institutions, and corporate clients. Fiserv, Inc. was incorporated in 1984 and is headquartered in Milwaukee, Wisconsin.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"UDR, Inc.","Symbol":"UDR","Current Price":"42.99","Latest MA":"42.64","Price Target":46.06818,"Difference from MA":"0.83%","Difference from Open":"0.68%","Change from Yesterday":"1.82%","Change from Last Report":"0.00","Latest Volume":"2,539,223","Market Cap":"16,149,623,808","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":58.094597,"PB Ratio":4.0868907,"Previous Close":42.22,"ROE":0.02841,"DTE":131.116,"Industry":"REIT - Residential","Sector":"Real Estate","Beta":0.847,"Trailing PEG":null,"Trailing PE":165.34616,"Trailing PS":9.62594,"Quick Ratio":0.007,"Day High":43.485,"Day Low":42.7,"VS Average Volume":1.3517455896,"Company Summary":"UDR, Inc. (NYSE: UDR), an S&P 500 company, is a leading multifamily real estate investment trust with a demonstrated performance history of delivering superior and dependable returns by successfully managing, buying, selling, developing and redeveloping attractive real estate properties in targeted U.S. markets. As of September 30, 2024, UDR owned or had an ownership position in 60,123 apartment homes. For over 52 years, UDR has delivered long-term value to shareholders, the best standard of service to residents and the highest quality experience for associates.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Hologic, Inc.","Symbol":"HOLX","Current Price":"65.45","Latest MA":"77.87","Price Target":80.76733,"Difference from MA":"-15.95%","Difference from Open":"-3.75%","Change from Yesterday":"-10.10%","Change from Last Report":"0.00","Latest Volume":"8,155,905","Market Cap":"14,773,570,560","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":14.16596,"PB Ratio":2.9825919,"Previous Close":72.8,"ROE":0.13846,"DTE":49.407,"Industry":"Medical Instruments & Supplies","Sector":"Healthcare","Beta":0.986,"Trailing PEG":1.4755,"Trailing PE":20.712025,"Trailing PS":3.7048779,"Quick Ratio":3.069,"Day High":68.5,"Day Low":64.87,"VS Average Volume":3.7505690759,"Company Summary":"Hologic, Inc. engages in the development, manufacture, and supply of diagnostics products, medical imaging systems, and surgical products for women's health through early detection and treatment worldwide. The company operates through four segments: Diagnostics, Breast Health, GYN Surgical, and Skeletal Health. It provides Aptima molecular diagnostic assays to detect the infectious microorganisms; Aptima viral load assays for Hepatitis B virus, Hepatitis C virus, human immunodeficiency virus, and human cytomegalo virus; Aptima bacterial vaginosis and candida vaginitis assays for the diagnosis of vaginitis; Aptima SARS-CoV-2 and Panther Fusion SARS-CoV-2 assays to detect SARS-CoV-2; ThinPrep System for cytology applications; and Rapid Fetal Fibronectin Test that assists physicians in assessing the risk of pre-term birth. The company also offers breast cancer care solutions in the areas of radiology, breast surgery, pathology, and treatment, such as 3D digital mammography systems, image analytics software, reading workstations, minimally invasive breast biopsy guidance systems, breast biopsy site markers, localization, and specimen radiology solutions; and breast conserving surgery products. In addition, it provides MyoSure Hysteroscopic Tissue Removal System for the removal of fibroids and polyps in the uterus; NovaSure Endometrial Ablation System to treat abnormal uterine bleeding; Fluent Fluid Management System that provides liquid distention during diagnostic and operative hysteroscopic procedures; Acessa ProVu system to treat various fibroids; and CoolSeal portfolio, such as bipolar vessel sealing devices. Further, it offers Horizon DXA, a dual energy X-ray system; and Fluoroscan Insight FD mini C-arm to perform minimally invasive orthopedic surgical procedures. It sells its products through direct sales, service forces, independent distributors, and sales representatives. The company was incorporated in 1985 and is headquartered in Marlborough, Massachusetts.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Allstate Corporation (The)","Symbol":"ALL","Current Price":"191.88","Latest MA":"185.93","Price Target":224.05882,"Difference from MA":"3.20%","Difference from Open":"-1.60%","Change from Yesterday":"-0.59%","Change from Last Report":"0.00","Latest Volume":"2,640,775","Market Cap":"50,810,400,768","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":9.012856,"PB Ratio":2.6938088,"Previous Close":193.01,"ROE":0.23783001,"DTE":38.833,"Industry":"Insurance - Property & Casualty","Sector":"Financial Services","Beta":0.481,"Trailing PEG":null,"Trailing PE":11.300354,"Trailing PS":0.81385183,"Quick Ratio":0.256,"Day High":199.035,"Day Low":190.0,"VS Average Volume":1.6919812732,"Company Summary":"The Allstate Corporation, together with its subsidiaries, provides property and casualty, and other insurance products in the United States and Canada. It operates in five segments: Allstate Protection; Protection Services; Allstate Health and Benefits; Run-off Property-Liability; and Corporate and Other segments. The Allstate Protection segment offers private passenger auto and homeowners insurance; other personal lines products; and commercial lines products through agents, contact centers, and online. The Protection Services segment provides consumer product protection; protection and insurance products, including vehicle service contracts, guaranteed asset protection, road hazard tire and wheel, and paintless dent repair protection; and roadside assistance, device and mobile data collection services, and analytic solutions using automotive telematics information, as well as identity theft protection and remediation services. This segment also offers its products under various brands, including Allstate Protection Plans, Allstate Dealer Services, Allstate Roadside, Arity, Avail, and Allstate Identity Protection. The Allstate Health and Benefits segment provides life, accident, critical illness, short-term disability, and other health insurance products; stop-loss and fully insured group health products to employers; and short-term medical and medicare supplement insurance to individuals. The Run-off Property-Liability segment offers property and casualty insurance coverage that primarily relates to policies written during the 1960s through the mid-1980s. The Corporate and Other segment provides debt services, as well as non-insurance operations. It sells its products through agents, independent agents, call and contact centers, retailers, direct to consumer, wholesale partners, and affinity groups, as well as through online and mobile applications. The Allstate Corporation was founded in 1931 and is headquartered in Northbrook, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"PTC Inc.","Symbol":"PTC","Current Price":"171.61","Latest MA":"183.32","Price Target":214.1165,"Difference from MA":"-6.39%","Difference from Open":"-6.10%","Change from Yesterday":"-9.56%","Change from Last Report":"0.00","Latest Volume":"4,442,310","Market Cap":"20,654,292,992","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":25.300089,"PB Ratio":6.41269,"Previous Close":189.76,"ROE":0.12775,"DTE":60.052,"Industry":"Software - Application","Sector":"Technology","Beta":1.174,"Trailing PEG":1.8745,"Trailing PE":52.96605,"Trailing PS":8.986097,"Quick Ratio":"N\/A","Day High":185.045,"Day Low":169.73,"VS Average Volume":5.406078676,"Company Summary":"PTC Inc. operates as software company in the Americas, Europe, and the Asia Pacific. The company provides Windchill, a suite that manages all aspects of the product development lifecycle(PLM) that provides real-time information sharing, dynamic data visualization, collaborate across geographically distributed teams, and enabling manufacturers to elevate product development, manufacturing, field service, and end-of-life processes; ThingWorx, an Industrial Internet of Things software; ServiceMax, a service lifecycle management solutions enable companies to asset uptime with optimized in-person and remote service and technician productivity with mobile tools, and deliver metrics; and Arena, a SaaS PLM solution enables product teams to collaborate virtually to share product and quality information with internal teams and supply chain partners and deliver products to customers. It offers Codebeamer, an application lifecycle management for products and software development; Servigistics, a service parts management solution; and FlexPLM, a platform for merchandising and line planning, materials management, sampling, and others. In addition, it offers Kepware, an enterprise industrial connectivity solution; Creo, a 3D CAD technology enables the digital design, testing, and modification of product models; and Onshape, a SaaS product development platform that delivers computer-aided design with data management, collaboration tools, and real-time analytics. Further, it offers Vuforia, an augmented reality (AR) software; and Arbortext, a dynamic publishing solution streamlines how organizations create, manage, and publish technical documentation. PTC Inc. was incorporated in 1985 and is headquartered in Boston, Massachusetts.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Uber Technologies, Inc.","Symbol":"UBER","Current Price":"69.99","Latest MA":"70.26","Price Target":88.23857,"Difference from MA":"-0.39%","Difference from Open":"6.58%","Change from Yesterday":"8.55%","Change from Last Report":"0.00","Latest Volume":"45,832,888","Market Cap":"147,378,634,752","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":16.205065,"PB Ratio":9.964407,"Previous Close":64.48,"ROE":0.34326,"DTE":80.343,"Industry":"Software - Application","Sector":"Technology","Beta":1.337,"Trailing PEG":0.6826,"Trailing PE":15.348684,"Trailing PS":3.5127788,"Quick Ratio":1.223,"Day High":70.05,"Day Low":65.54,"VS Average Volume":1.7307864318,"Company Summary":"Uber Technologies, Inc. develops and operates proprietary technology applications in the United States, Canada, Latin America, Europe, the Middle East, Africa, and Asia excluding China and Southeast Asia. It operates through three segments: Mobility, Delivery, and Freight. The Mobility segment connects consumers with a range of transportation modalities, such as ridesharing, carsharing, micromobility, rentals, public transit, taxis, and other modalities; and offers riders in a variety of vehicle types, as well as financial partnerships products and advertising services. The Delivery segment allows to search for and discover restaurants to grocery, alcohol, convenience, and other retails; order a meal or other items; and Uber direct, a white-label Delivery-as-a-Service for retailers and restaurants, as well as advertising. The Freight segment manages transportation and logistics network, which connects shippers and carriers in digital marketplace including carriers upfronts, pricing, and shipment booking; and provides on-demand platform to automate logistics end-to-end transactions for small-and medium-sized business to global enterprises. The company was formerly known as Ubercab, Inc. and changed its name to Uber Technologies, Inc. in February 2011. Uber Technologies, Inc. was founded in 2009 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Coherent Corp.","Symbol":"COHR","Current Price":"100.46","Latest MA":"88.79","Price Target":115.97222,"Difference from MA":"13.14%","Difference from Open":"-2.70%","Change from Yesterday":"11.50%","Change from Last Report":"0.00","Latest Volume":"9,088,821","Market Cap":"15,537,545,216","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":22.970371,"PB Ratio":2.9458683,"Previous Close":90.1,"ROE":-0.00863,"DTE":50.88,"Industry":"Scientific & Technical Instruments","Sector":"Technology","Beta":1.654,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":3.1058068,"Quick Ratio":1.371,"Day High":107.37,"Day Low":98.7,"VS Average Volume":3.0629368579,"Company Summary":"Coherent Corp. develops, manufactures, and markets engineered materials, optoelectronic components and devices, and optical and laser systems and subsystems for the use in the industrial, communications, electronics, and instrumentation markets worldwide. It operates through three segments: Networking, Materials, and Lasers. The Networking segment offers telecommunication products for fiber-optic transmission; datacom transceivers, including pluggable transceivers for ethernet and fiber channel applications; and advanced optics, such as fiber and precision optics used in projection displays, crystal materials and components for optical communications, filters and assemblies for life sciences, sensors, instrumentation, and semiconductor equipment, as well as ultraviolet (UV), visible, and near-infrared spectroscopy optics for industrial lasers. The Materials segments provides laser optics and accessories; infrared thermal imaging optics and assemblies; polycrystalline materials; thermoelectric components, subassemblies, and systems; ceramic and metal-matrix composite products; semiconductor lasers and laser bars; Q-switched laser modules, uncooled pump laser modules, and laser systems for superhard materials processing; laser processing heads and beam delivery systems; EELs, VCSELs, and detectors; pumps for amplifiers; precision optical assemblies, infrared optics, thin-film coatings and optical materials; optical solutions; and integrated circuits for transceivers. The Lasers segment offers UV gas and solid-state lasers; UV optical systems, line beams, and mask-based imaging systems; UV nanosecond lasers; continuous-wave lasers and systems; amplifiers; subsystems and standard systems; IR lasers; crystals and diode lasers, and specialty polishing and coating solutions. The company was formerly known as II-VI Incorporated and changed its name to Coherent Corp. in September 2022. Coherent Corp. was incorporated in 1971 and is headquartered in Saxonburg, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Crown Holdings, Inc.","Symbol":"CCK","Current Price":"87.35","Latest MA":"88.01","Price Target":108.5075,"Difference from MA":"-0.75%","Difference from Open":"-4.81%","Change from Yesterday":"2.64%","Change from Last Report":"0.00","Latest Volume":"3,064,421","Market Cap":"10,449,855,488","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":11.581486,"PB Ratio":4.0772033,"Previous Close":85.1,"ROE":0.08377,"DTE":253.727,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":0.853,"Trailing PEG":0.7537,"Trailing PE":106.52439,"Trailing PS":0.88889545,"Quick Ratio":0.786,"Day High":91.815,"Day Low":85.26,"VS Average Volume":2.2773335375,"Company Summary":"Crown Holdings, Inc., together with its subsidiaries, engages in the packaging business in the United States and internationally. It operates through Americas Beverage, European Beverage, Asia Pacific, and Transit Packaging segments. The company manufactures and sells recyclable aluminum beverage cans and ends, glass bottles, steel crowns, aluminum caps, non-beverage cans, and aerosol cans and closures. It also provides manual, semi-automatic, and automatic equipment and tools to apply and remove consumables, such as straps and films; protective solutions, including airbags, edge protectors, and honeycomb products; and steel and plastic consumables include steel strap, plastic strap, industrial film, and other related products. The company serves food industries, including pet food, personal care, household, and industrial products. Crown Holdings, Inc. was founded in 1892 and is headquartered in Yardley, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Ford Motor Company","Symbol":"F","Current Price":"9.26","Latest MA":"10.74","Price Target":11.3275,"Difference from MA":"-13.75%","Difference from Open":"-2.42%","Change from Yesterday":"-7.49%","Change from Last Report":"0.00","Latest Volume":"209,050,576","Market Cap":"36,801,925,120","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":5.338191,"PB Ratio":0.83049333,"Previous Close":10.01,"ROE":0.0799,"DTE":359.359,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":1.636,"Trailing PEG":0.8686,"Trailing PE":10.522728,"Trailing PS":0.20138623,"Quick Ratio":0.942,"Day High":9.64,"Day Low":9.26,"VS Average Volume":3.372420273,"Company Summary":"Ford Motor Company develops, delivers, and services a range of Ford trucks, commercial cars and vans, sport utility vehicles, and Lincoln luxury vehicles worldwide. It operates through Ford Blue, Ford Model e, and Ford Pro; Ford Next; and Ford Credit segments. The company sells Ford and Lincoln vehicles, service parts, and accessories through distributors and dealers, as well as through dealerships to commercial fleet customers, daily rental car companies, and governments. It also engages in vehicle-related financing and leasing activities to and through automotive dealers. In addition, the company provides retail installment sale contracts for new and used vehicles; and direct financing leases for new vehicles to retail and commercial customers, such as leasing companies, government entities, daily rental companies, and fleet customers. Further, it offers wholesale loans to dealers to finance the purchase of vehicle inventory; and loans to dealers to finance working capital and enhance dealership facilities, purchase dealership real estate, and other dealer vehicle programs. The company was incorporated in 1903 and is based in Dearborn, Michigan.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Ares Capital Corporation","Symbol":"ARCC","Current Price":"22.73","Latest MA":"20.95","Price Target":23.03846,"Difference from MA":"8.49%","Difference from Open":"-1.56%","Change from Yesterday":"-1.60%","Change from Last Report":"0.00","Latest Volume":"6,698,801","Market Cap":"15,262,785,536","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":10.544872,"PB Ratio":1.1496055,"Previous Close":23.1,"ROE":0.1338,"DTE":106.255,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.054,"Trailing PEG":null,"Trailing PE":9.315574,"Trailing PS":5.1949577,"Quick Ratio":1.29,"Day High":23.1,"Day Low":22.635,"VS Average Volume":1.4410439758,"Company Summary":"Ares Capital Corporation is a business development company specializing in acquisition, recapitalization, mezzanine debt, restructurings, rescue financing, and leveraged buyout transactions of middle market companies. It also makes growth capital and general refinancing. It prefers to make investments in companies engaged in the basic and growth manufacturing, business services, consumer products, health care products and services, and information technology service sectors. The fund will also consider investments in industries such as restaurants, retail, oil and gas, and technology sectors. It focuses on investments in Northeast, Mid-Atlantic, Southeast and Southwest regions from its New York office, the Midwest region, from the Chicago office, and the Western region from the Los Angeles office. The fund typically invests between $20 million and $200 million and a maximum of $400 million in companies with an EBITDA between $10 million and $250 million. It makes debt investments between $10 million and $100 million The fund invests through revolvers, first lien loans, warrants, unitranche structures, second lien loans, mezzanine debt, private high yield, junior capital, subordinated debt, and non-control preferred and common equity. The fund also selectively considers third-party-led senior and subordinated debt financings and opportunistically considers the purchase of stressed and discounted debt positions. The fund prefers to be an agent and\/or lead the transactions in which it invests. The fund also seeks board representation in its portfolio companies.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Boston Scientific Corporation","Symbol":"BSX","Current Price":"105.02","Latest MA":"85.99","Price Target":111.61656,"Difference from MA":"22.13%","Difference from Open":"-0.66%","Change from Yesterday":"0.05%","Change from Last Report":"0.00","Latest Volume":"5,166,462","Market Cap":"154,781,630,464","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":32.49602,"PB Ratio":7.4726057,"Previous Close":104.97,"ROE":0.08916,"DTE":53.722,"Industry":"Medical Devices","Sector":"Healthcare","Beta":0.797,"Trailing PEG":1.903,"Trailing PE":84.016,"Trailing PS":9.727963,"Quick Ratio":0.847,"Day High":105.8958,"Day Low":104.73,"VS Average Volume":0.9459075671,"Company Summary":"Boston Scientific Corporation develops, manufactures, and markets medical devices for use in various interventional medical specialties worldwide. It operates through two segments, MedSurg and Cardiovascular. The company offers devices to diagnose and treat gastrointestinal and pulmonary conditions, such as resolution clips, biliary stent systems, stents and electrocautery enhanced delivery systems, direct visualization systems, digital catheters, and single-use duodenoscopes; devices to treat urological conditions, including ureteral stents, catheters, baskets, guidewires, sheaths, balloons, single-use digital flexible ureteroscopes, holmium laser systems, artificial urinary sphincter, laser system, fiber, and hydrogel systems; and devices to treat neurological movement disorders and manage chronic pain, such as spinal cord stimulator system, proprietary programming software, radiofrequency generator, indirect decompression systems, practice optimization tools, and deep brain stimulation system. It also provides technologies for diagnosing and treating coronary artery disease and aortic valve conditions; WATCHMAN FLX, a Left Atrial Appendage Closure Device; and implantable devices that monitor the heart and deliver electricity to treat cardiac abnormalities, such as cardioverter and cardiac resynchronization therapy defibrillators, MRI S-ICD systems, cardiac resynchronization therapy pacemakers, quadripolar LV leads, ICD leads, pacing leads, remote patient management systems, insertable cardiac monitor systems, and remote cardiac monitoring systems. In addition, the company offers diagnosis and treatment of rate and rhythm disorders of the heart; peripheral arterial and venous diseases; and products to diagnose, treat and ease forms of cancer. The company was incorporated in 1979 and is headquartered in Marlborough, Massachusetts.","Stock Sentiment":"Strong Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"Emerson Electric Company","Symbol":"EMR","Current Price":"127.48","Latest MA":"115.88","Price Target":142.07571,"Difference from MA":"10.01%","Difference from Open":"1.11%","Change from Yesterday":"2.18%","Change from Last Report":"0.00","Latest Volume":"3,929,537","Market Cap":"71,885,979,648","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":19.601873,"PB Ratio":3.3595996,"Previous Close":124.76,"ROE":0.05933,"DTE":30.376,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":1.292,"Trailing PEG":null,"Trailing PE":35.80899,"Trailing PS":4.1096487,"Quick Ratio":1.323,"Day High":128.0,"Day Low":125.04,"VS Average Volume":1.2927027052,"Company Summary":"Emerson Electric Co., a technology and software company, provides various solutions in the Americas, Asia, the Middle East, Africa, and Europe. It operates through seven segments: Final Control, Measurement & Analytical, Discrete Automation, Safety & Productivity, Control Systems & Software, Test & Measurement, and AspenTech. The Final Control segment provides control, isolation, shutoff, pressure relief, and pressure safety valves, actuators, and regulators for process and hybrid industries. The Measurement & Analytical segment offers intelligent instrumentation measuring the physical properties of liquids or gases, such as pressure, temperature, level, flow, acoustics, corrosion, pH, conductivity, water quality, toxic gases, and flame. The Discrete Automation segment offers solenoid and pneumatic valves, valve position indicators, pneumatic cylinders, actuators, air preparation equipment, pressure and temperature switches, electric linear motion solutions, programmable automation control systems, electrical distribution equipment, and materials joining solutions. The Safety & Productivity segment offers tools for professionals and homeowners; pipe-working tools, including pipe wrenches, pipe cutters, pipe threading and roll grooving equipment, battery hydraulic tools; electrical tools; and other professional tools. The Control Systems & Software segment provides control systems, safety instrumented systems, SCADA systems, application software, digital twins, asset performance management, and cybersecurity. The Test & Measurement provides software-connected automated test and measurement systems. The AspenTech segment provides asset optimization software that enables industrial manufacturers to design, operate, and maintain operations for enhancing performance through a combination of decades of modeling, simulation, and optimization capabilities. The company was incorporated in 1890 and is based in Saint Louis, Missouri.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:24"},{"Company Name":"WEX Inc.","Symbol":"WEX","Current Price":"151.93","Latest MA":"185.88","Price Target":193.31615,"Difference from MA":"-18.26%","Difference from Open":"-6.09%","Change from Yesterday":"-18.66%","Change from Last Report":"0.00","Latest Volume":"2,233,141","Market Cap":"6,044,276,224","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":8.187842,"PB Ratio":3.6046786,"Previous Close":186.78,"ROE":0.19598,"DTE":272.948,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":1.574,"Trailing PEG":null,"Trailing PE":19.329515,"Trailing PS":2.2765634,"Quick Ratio":0.942,"Day High":168.66,"Day Low":149.295,"VS Average Volume":6.1024618723,"Company Summary":"WEX Inc. operates a commerce platform in the United States and internationally. The Mobility segment offers fleet vehicle payment solutions, transaction processing, and information management services; and provides account activation and account retention services; authorization and billing inquiries, and account maintenance services; account management; credit and collections services; merchant services; analytics solutions; and ancillary services and offerings. This segment markets its products directly and indirectly to businesses and government agencies with fleets of commercial vehicles; and indirectly through co-branded and private label relationships. The Corporate Payments segment provides payment solutions, including embedded payments; and accounts payable automation and spend management solutions. This segment also markets its products directly and indirectly to customers in travel, fintech, insurance, consumer bill pay, and media verticals. The Benefits Solutions segment offers software-as-a-service (SaaS) platform for consumer directed healthcare benefits and full-service benefit enrollment solutions. In addition, its SaaS platform includes embedded payment solutions and plan administration services for consumer-directed health benefits; COBRA accounts; and benefit enrollment and administration services. Further, it offers custodial and depository services for health savings accounts; and markets its products through third-party administrators, financial institutions, payroll providers, and health plans. The company was formerly known as Wright Express Corporation and changed its name to WEX Inc. in October 2012. WEX Inc. was founded in 1983 and is based in Portland, Maine.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:32"},{"Company Name":"Walt Disney Company (The)","Symbol":"DIS","Current Price":"112.09","Latest MA":"100.14","Price Target":125.34643,"Difference from MA":"11.93%","Difference from Open":"0.19%","Change from Yesterday":"1.40%","Change from Last Report":"0.00","Latest Volume":"10,346,274","Market Cap":"202,635,165,696","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":18.383125,"PB Ratio":2.0229564,"Previous Close":110.54,"ROE":0.0546,"DTE":45.188,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.398,"Trailing PEG":0.9705,"Trailing PE":36.392857,"Trailing PS":2.2508016,"Quick Ratio":0.531,"Day High":112.65,"Day Low":109.15,"VS Average Volume":1.0698443214,"Company Summary":"The Walt Disney Company operates as an entertainment company worldwide. It operates through three segments: Entertainment, Sports, and Experiences. The company produces and distributes film and television video streaming content under the ABC Television Network, Disney, Freeform, FX, Fox, National Geographic, and Star brand television channels, as well as ABC television stations and A+E television networks; and produces original content under the ABC Signature, Disney Branded Television, FX Productions, Lucasfilm, Marvel, National Geographic Studios, Pixar, Searchlight Pictures, Twentieth Century Studios, 20th Television, and Walt Disney Pictures banners. It also offers direct-to-consumer streaming services through Disney+, Disney+ Hotstar, Hulu, and Star+; sports-related entertainment services through ESPN, ESPN on ABC, ESPN+ DTC, and Star; sale\/licensing of film and episodic content to third-party television and VOD services; theatrical, home entertainment, and music distribution services; DVD and Blu-ray discs, electronic home video licenses, and VOD rental services; staging and licensing of live entertainment events; and post-production services. In addition, the company operates theme parks and resorts comprising Walt Disney World Resort, Disneyland Resort, Disneyland Paris, Hong Kong Disneyland Resort, Shanghai Disney Resort, Disney Cruise Line, Disney Vacation Club, National Geographic Expeditions, and Adventures by Disney, as well as Aulani, a Disney resort and spa in Hawaii. It also licenses its intellectual property to a third party for operations of the Tokyo Disney Resort; licenses trade names, characters, visual, literary, and other IP for use on merchandise, published materials, and games; operates a direct-to-home satellite distribution platform; sells branded merchandise through retail, online, and wholesale businesses; and develops and publishes books, comic books, and magazines. The company was founded in 1923 and is based in Burbank, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:32"},{"Company Name":"Weatherford International plc","Symbol":"WFRD","Current Price":"65.36","Latest MA":"90.19","Price Target":99.33333,"Difference from MA":"-27.53%","Difference from Open":"-5.04%","Change from Yesterday":"0.17%","Change from Last Report":"0.00","Latest Volume":"2,173,030","Market Cap":"4,748,534,784","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":8.848706,"PB Ratio":3.532782,"Previous Close":65.25,"ROE":0.54082,"DTE":133.923,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.769,"Trailing PEG":0.8083,"Trailing PE":9.141258,"Trailing PS":0.85806555,"Quick Ratio":1.331,"Day High":71.9367,"Day Low":63.2901,"VS Average Volume":2.235602272,"Company Summary":"Weatherford International plc, an energy services company, provides equipment and services for the drilling, evaluation, completion, production, and intervention of oil, geothermal, and natural gas wells worldwide. The company operates through three segments: Drilling and Evaluation; Well Construction and Completions; and Production and Intervention. It offers artificial lift systems, including reciprocating rod, progressing cavity pumping, gas, hydraulic, plunger, and hybrid lift systems, as well as related automation and control systems; pressure pumping and reservoir stimulation services, such as acidizing, fracturing, cementing, and coiled-tubing intervention; and software, automation and flow measurement solutions. The company also provides safety, downhole reservoir monitoring, flow control, and multistage fracturing systems, as well as sand-control technologies, and production and isolation packers; liner hangers to suspend a casing string in high-temperature and high-pressure wells; cementing products, including plugs, float and stage equipment, and torque-and-drag reduction technology for zonal isolation; and pre-job planning and installation services. In addition, it offers directional drilling services, and logging and measurement services while drilling; services related to rotary-steerable systems, high temperature and high pressure sensors, drilling reamers, and circulation subs; rotating control devices and advanced automated control systems, as well as closed loop drilling, air drilling, managed-pressure drilling, and underbalanced drilling services; open-hole and cased-hole logging services; and intervention and remediation services. Further, it provides tubular handling, management, and connection services; and re-entry, fishing, and well abandonment services, as well as patented bottom hole, tubular-handling equipment, pressure-control equipment, and drill pipe and collars. The company was incorporated in 1972 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:32"},{"Company Name":"Pepsico, Inc.","Symbol":"PEP","Current Price":"145.35","Latest MA":"163.25","Price Target":165.66591,"Difference from MA":"-10.96%","Difference from Open":"-0.62%","Change from Yesterday":"-0.21%","Change from Last Report":"0.00","Latest Volume":"5,548,615","Market Cap":"199,347,535,872","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":16.340422,"PB Ratio":10.259035,"Previous Close":145.66,"ROE":0.48819,"DTE":229.605,"Industry":"Beverages - Non-Alcoholic","Sector":"Consumer Defensive","Beta":0.542,"Trailing PEG":1.7543,"Trailing PE":20.91367,"Trailing PS":2.168707,"Quick Ratio":0.664,"Day High":146.9,"Day Low":143.96,"VS Average Volume":0.8481082389,"Company Summary":"PepsiCo, Inc. engages in the manufacture, marketing, distribution, and sale of various beverages and convenient foods worldwide. The company operates through seven segments: Frito-Lay North America; Quaker Foods North America; PepsiCo Beverages North America; Latin America; Europe; Africa, Middle East and South Asia; and Asia Pacific, Australia and New Zealand and China Region. It provides dips, cheese-flavored snacks, and spreads, as well as corn, potato, and tortilla chips; cereals, rice, pasta, mixes and syrups, granola bars, grits, oatmeal, rice cakes, and side dishes; beverage concentrates, fountain syrups, and finished goods; ready-to-drink tea, coffee, and juices; dairy products; and sparkling water makers and related products, as well as distributes alcoholic beverages under Hard MTN Dew brand. The company offers its products primarily under the Lay's, Doritos, Fritos, Tostitos, BaiCaoWei, Cheetos, Cap'n Crunch, Life, Pearl Milling Company, Gatorade, Pepsi-Cola, Mountain Dew, Quaker, Rice-A-Roni, Aquafina, Bubly, Emperador, Diet Mountain Dew, Diet Pepsi, Gatorade Zero, Crush, Propel, Dr Pepper, Schweppes, Marias Gamesa, Ruffles, Sabritas, Saladitas, Tostitos, 7UP, Diet 7UP, H2oh!, Manzanita Sol, Mirinda, Pepsi Black, Pepsi Max, San Carlos, Toddy, Walkers, Chipsy, Kurkure, Sasko, Spekko, White Star, Smith's, Sting, SodaStream, Lubimyj Sad, Agusha, Chudo, Domik v Derevne, Lipton, and other brands. It serves wholesale and other distributors, foodservice customers, grocery stores, drug stores, convenience stores, discount\/dollar stores, mass merchandisers, membership stores, hard discounters, e-commerce retailers and authorized independent bottlers, and others through a network of direct-store-delivery, customer warehouse, and distributor networks, as well as directly to consumers through e-commerce platforms and retailers. The company was founded in 1898 and is based in Purchase, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:32"},{"Company Name":"NOV Inc.","Symbol":"NOV","Current Price":"15.48","Latest MA":"16.29","Price Target":18.91667,"Difference from MA":"-4.96%","Difference from Open":"-6.12%","Change from Yesterday":"-5.78%","Change from Last Report":"0.00","Latest Volume":"7,608,748","Market Cap":"6,023,020,032","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":9.856106,"PB Ratio":0.9318003,"Previous Close":16.43,"ROE":0.17694001,"DTE":36.848,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.674,"Trailing PEG":null,"Trailing PE":9.674999,"Trailing PS":0.6763638,"Quick Ratio":1.55,"Day High":16.53,"Day Low":15.315,"VS Average Volume":1.877354296,"Company Summary":"NOV Inc. designs, constructs, manufactures, and sells systems, components, and products for oil and gas drilling and production, and industrial and renewable energy sectors in the United States and internationally. It operates through two segments, Energy Equipment, and Energy Products and Services. The company provides solids control and waste management equipment and services, managed pressure drilling, drilling fluids, premium drillpipe, wired pipe, drilling optimization services, tubular inspection and coating services, instrumentation, downhole tools, and drill bits. It also offers equipment and technologies for hydraulic fracture stimulation, including downhole multistage fracturing tools, pressure pumping trucks, blenders, sanders, hydration and injection units, flowline, and manifolds; coiled tubing units, and wireline units and tools; connections and liner hangers; onshore production consists of composite pipe, surface transfer and progressive cavity pumps, and artificial lift systems; and offshore production, such as floating production systems and subsea production technologies, as well as manufactures industrial pumps and mixers. In addition, the company provides substructures, derricks, and masts; cranes; jacking systems; pipe lifting, racking, rotating, and assembly systems; mud pumps; pressure control equipment; drives and generators; rig instrumentation and control systems; mooring, anchor, and deck handling machinery; equipment components for offshore wind construction vessels; and pipelay and construction systems. Further, the company offers spare parts, repair, and rentals as well as comprehensive remote equipment monitoring, technical support, field service, and customer training. The company was formerly known as National Oilwell Varco, Inc. and changed its name to NOV Inc. in January 2021. NOV Inc. was founded in 1862 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:32"},{"Company Name":"Alphabet Inc.","Symbol":"GOOGL","Current Price":"191.60","Latest MA":"174.87","Price Target":217.20404,"Difference from MA":"9.57%","Difference from Open":"1.27%","Change from Yesterday":"0.14%","Change from Last Report":"0.00","Latest Volume":"27,352,638","Market Cap":"2,346,448,584,704","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":18.606802,"PB Ratio":7.480576,"Previous Close":191.33,"ROE":0.32101002,"DTE":9.324,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.034,"Trailing PEG":1.2503,"Trailing PE":23.830847,"Trailing PS":6.9041824,"Quick Ratio":1.761,"Day High":192.1,"Day Low":188.72,"VS Average Volume":0.9563489942,"Company Summary":"Alphabet Inc. offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube. It is also involved in the sale of apps and in-app purchases and digital content in the Google Play and YouTube; and devices, as well as in the provision of YouTube consumer subscription services. The Google Cloud segment offers infrastructure, cybersecurity, databases, analytics, AI, and other services; Google Workspace that include cloud-based communication and collaboration tools for enterprises, such as Gmail, Docs, Drive, Calendar, and Meet; and other services for enterprise customers. The Other Bets segment sells healthcare-related and internet services. The company was incorporated in 1998 and is headquartered in Mountain View, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:32"},{"Company Name":"Enterprise Products Partners L.","Symbol":"EPD","Current Price":"32.87","Latest MA":"29.66","Price Target":36.38944,"Difference from MA":"10.84%","Difference from Open":"-0.69%","Change from Yesterday":"-0.51%","Change from Last Report":"0.00","Latest Volume":"3,414,570","Market Cap":"71,248,347,136","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":11.000816,"PB Ratio":2.5133812,"Previous Close":33.04,"ROE":0.20665,"DTE":110.757,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":1.014,"Trailing PEG":3.2038,"Trailing PE":12.21933,"Trailing PS":1.2579157,"Quick Ratio":0.719,"Day High":33.25,"Day Low":32.69,"VS Average Volume":0.7662614881,"Company Summary":"Enterprise Products Partners L.P. provides midstream energy services to producers and consumers of natural gas, natural gas liquids (NGLs), crude oil, petrochemicals, and refined products. It operates in four segments: NGL Pipelines & Services, Crude Oil Pipelines & Services, Natural Gas Pipelines & Services, and Petrochemical & Refined Products Services. The NGL Pipelines & Services segment offers natural gas processing and related NGL marketing services. It operates natural gas processing facilities located in Colorado, Louisiana, Mississippi, New Mexico, Texas, and Wyoming; NGL pipelines; NGL fractionation facilities; NGL and related product storage facilities; and NGL marine terminals. The Crude Oil Pipelines & Services segment operates crude oil pipelines; and crude oil storage and marine terminals, which include a fleet of approximately 250 tractor-trailer tank trucks that are used to transport crude oil. It also engages in crude oil marketing activities. The Natural Gas Pipelines & Services segment operates natural gas pipeline systems to gather, treat, and transport natural gas. It leases underground salt dome natural gas storage facilities in Napoleonville, Louisiana; owns an underground salt dome storage cavern in Wharton County, Texas; and markets natural gas. The Petrochemical & Refined Products Services segment operates propylene fractionation facilities, including propylene fractionation units and propane dehydrogenation facilities, and related marketing activities; butane isomerization complex and related deisobutanizer operations; and octane enhancement, isobutane dehydrogenation, and high purity isobutylene production facilities. It also operates refined products pipelines and terminals; and ethylene export terminals; and provides refined products marketing and marine transportation services. Enterprise Products Partners L.P. was founded in 1968 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:32"},{"Company Name":"Lumen Technologies, Inc.","Symbol":"LUMN","Current Price":"5.01","Latest MA":"5.61","Price Target":5.34364,"Difference from MA":"-10.69%","Difference from Open":"0.80%","Change from Yesterday":"0.80%","Change from Last Report":"0.00","Latest Volume":"14,653,574","Market Cap":"5,084,198,400","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":-8.70744,"PB Ratio":14.866469,"Previous Close":4.97,"ROE":-1.6673199,"DTE":5502.924,"Industry":"Telecom Services","Sector":"Communication Services","Beta":1.201,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.38238555,"Quick Ratio":0.988,"Day High":5.16,"Day Low":4.85,"VS Average Volume":1.0945868069,"Company Summary":"Lumen Technologies, Inc., a facilities-based technology and communications company, provides various integrated products and services to business and residential customers in the United States and internationally. The company operates in two segments, Business and Mass Markets. It offers dark fiber, edge cloud services, internet protocol, managed security, software-defined wide area networks, secure access service edge, unified communications and collaboration, and optical wavelengths services; ethernet and VPN data networks services; and legacy services to manage cash flow, including time division multiplexing voice, private line, and other legacy services, as well as sells communication equipment, and IT solutions. The company also provides high speed and lower speed broadband service to residential and small business customers; local and long-distance voice services, professional services, and other ancillary services; and federal broadband and state support programs. It serves its products and services under the Lumen, Quantum Fiber, and CenturyLink brands. The company was formerly known as CenturyLink, Inc. and changed its name to Lumen Technologies, Inc. in September 2020. Lumen Technologies, Inc. was incorporated in 1968 and is headquartered in Monroe, Louisiana.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:32"},{"Company Name":"FMC Corporation","Symbol":"FMC","Current Price":"35.66","Latest MA":"57.78","Price Target":58.22889,"Difference from MA":"-38.28%","Difference from Open":"-2.02%","Change from Yesterday":"-0.72%","Change from Last Report":"0.00","Latest Volume":"8,517,306","Market Cap":"4,451,651,584","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.937762,"PB Ratio":0.96610767,"Previous Close":35.92,"ROE":0.38454,"DTE":90.927,"Industry":"Agricultural Inputs","Sector":"Basic Materials","Beta":0.853,"Trailing PEG":null,"Trailing PE":11.109035,"Trailing PS":1.0680803,"Quick Ratio":0.922,"Day High":36.9696,"Day Low":35.63,"VS Average Volume":4.5221111984,"Company Summary":"FMC Corporation, an agricultural sciences company, provides crop protection, plant health, and professional pest and turf management products. It develops, markets, and sells crop protection chemicals that includes insecticides, herbicides, and fungicides; and biologicals, crop nutrition, and seed treatment products, which are used in agriculture to enhance crop yield and quality by controlling a range of insects, weeds, and diseases, as well as in non-agricultural markets for pest control. The company markets its products through its own sales organization and through alliance partners, independent distributors, and sales representatives. It operates in North America, Latin America, Europe, the Middle East, Africa, and Asia. The company was founded in 1883 and is headquartered in Philadelphia, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:32"},{"Company Name":"Pfizer, Inc.","Symbol":"PFE","Current Price":"25.83","Latest MA":"27.16","Price Target":31.03864,"Difference from MA":"-4.89%","Difference from Open":"-2.23%","Change from Yesterday":"-2.31%","Change from Last Report":"0.00","Latest Volume":"44,955,340","Market Cap":"146,378,358,784","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":8.484988,"PB Ratio":1.5858301,"Previous Close":26.44,"ROE":0.04538,"DTE":73.408,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.615,"Trailing PEG":0.1981,"Trailing PE":18.319149,"Trailing PS":2.4653196,"Quick Ratio":0.64,"Day High":26.41,"Day Low":25.78,"VS Average Volume":1.0312489111,"Company Summary":"Pfizer Inc. discovers, develops, manufactures, markets, distributes, and sells biopharmaceutical products in the United States, Europe, and internationally. The company offers medicines and vaccines in various therapeutic areas, including cardiovascular metabolic, migraine, and women's health under the Eliquis, Nurtec ODT\/Vydura, Zavzpret, and the Premarin family brands; infectious diseases with unmet medical needs under the Prevnar family, Abrysvo, Nimenrix, FSME\/IMMUN-TicoVac, and Trumenba brands; and COVID-19 prevention and treatment, and potential future mRNA and antiviral products under the Comirnaty and Paxlovid brands. It also provides medicines and vaccines in various therapeutic areas, such as biosimilars for chronic immune and inflammatory diseases under the Xeljanz, Enbrel, Inflectra, Litfulo, Velsipity, and Cibinqo brands; amyloidosis, hemophilia, endocrine diseases, and sickle cell disease under the Vyndaqel family, Oxbryta, BeneFIX, Somavert, Ngenla, and Genotropin brands; sterile injectable and anti-infective medicines under the Sulperazon, Medrol, Zavicefta, Zithromax, and Panzyga brands; and biologics, small molecules, immunotherapies, and biosimilars under the Ibrance, Xtandi, Inlyta, Bosulif, Mektovi, Padcev, Adcetris, Talzenna, Tukysa, Elrexfio, Tivdak, Lorbrena, and Braftovi brands. In addition, the company involved in the contract manufacturing business. It serves wholesalers, retailers, hospitals, clinics, government agencies, pharmacies, individual provider offices, retail pharmacies, and integrated delivery systems. The company has collaboration agreements with Bristol-Myers Squibb Company; Astellas Pharma US, Inc.; Merck KGaA; and BioNTech SE, as well as has strategic clinical collaboration with Acepodia Inc. for the development of antibody-cell conjugation-based cell therapies in autoimmune diseases. Pfizer Inc. was founded in 1849 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:32"},{"Company Name":"Apollo Global Management, Inc. ","Symbol":"APO","Current Price":"164.88","Latest MA":"141.50","Price Target":184.17647,"Difference from MA":"16.52%","Difference from Open":"-1.92%","Change from Yesterday":"-0.52%","Change from Last Report":"0.00","Latest Volume":"2,172,158","Market Cap":"93,279,051,776","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":16.672129,"PB Ratio":5.6659794,"Previous Close":165.75,"ROE":0.33501,"DTE":92.115,"Industry":"Asset Management","Sector":"Financial Services","Beta":1.589,"Trailing PEG":null,"Trailing PE":22.493862,"Trailing PS":2.9452512,"Quick Ratio":1.877,"Day High":168.2492,"Day Low":163.21,"VS Average Volume":0.3934123796,"Company Summary":"Apollo Global Management, Inc. is a private equity firm specializing in investments in credit, private equity, infrastructure, secondaries and real estate markets. The firm prefers to invest in private and public markets. The firm's private equity investments include traditional buyouts, recapitalization, distressed buyouts and debt investments in real estate, corporate partner buyouts, distressed asset, corporate carve-outs, middle market, growth, venture capital, turnaround, bridge, corporate restructuring, special situation, acquisition, and industry consolidation transactions. For credit strategies, the firm focuses to invest in multi-sector credit, semi-liquid credit, direct lending, first lien, unitranche, whole loans and private credit. The firm provides its services to endowment and sovereign wealth funds, as well as other institutional and individual investors. It manages client focused portfolios. The firm launches and manages hedge funds for its clients. It also manages real estate funds and private equity funds for its clients. The firm invests in the fixed income and alternative investment markets across the globe. Its fixed income investments include income-oriented senior loans, bonds, collateralized loan obligations, structured credit, opportunistic credit, non-performing loans, distressed debt, mezzanine debt, and value oriented fixed income securities. The firm seeks to invest in chemicals, commodities, consumer and retail, oil and gas, metals, mining, agriculture, commodities, distribution and transportation, financial and business services, manufacturing and industrial, media distribution, cable, entertainment and leisure, telecom, technology, natural resources, energy, packaging and materials, and satellite and wireless industries. It also focuses on clean energy, sustainable industry, climate solutions, energy transition, industrial decarbonization, sustainable mobility, sustainable resource use, and sustainable real estate. It seeks to invest in companies based in across Africa, Asia, North America with a focus on United States, Western Europe and Europe. It employs a combination of contrarian, value, and distressed strategies to make its investments. The firm seeks to make investments in the range of $75 million and $1500 million. The firm seeks to invest in companies with Enterprise value between $750 million to $2500 million. The firm conducts in-house research to create its investment portfolio. It seeks to acquire minority and majority positions in its portfolio companies. Apollo Global Management, Inc. was founded in 1990 and is headquartered in New York, New York with additional offices in North America, Asia, Africa and Europe.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:32"},{"Company Name":"Archer-Daniels-Midland Company","Symbol":"ADM","Current Price":"45.55","Latest MA":"55.84","Price Target":52.45455,"Difference from MA":"-18.42%","Difference from Open":"-2.67%","Change from Yesterday":"-1.94%","Change from Last Report":"0.00","Latest Volume":"5,400,864","Market Cap":"21,797,224,448","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":9.723245,"PB Ratio":0.9683042,"Previous Close":46.45,"ROE":0.1075,"DTE":52.874,"Industry":"Farm Products","Sector":"Consumer Defensive","Beta":0.722,"Trailing PEG":null,"Trailing PE":12.479451,"Trailing PS":0.24555272,"Quick Ratio":0.375,"Day High":47.11,"Day Low":45.01,"VS Average Volume":1.6617143195,"Company Summary":"Archer-Daniels-Midland Company engages in the procurement, transportation, storage, processing, and merchandising of agricultural commodities, ingredients, flavors, and solutions in the United States, Switzerland, the Cayman Islands, Brazil, Mexico, Canada, the United Kingdom, and internationally. It operates in three segments: Ag Services and Oilseeds, Carbohydrate Solutions, and Nutrition. The company originates, merchandises, stores, and transports agricultural raw materials, such as oilseeds and soft seeds. It also engages in the agricultural commodity and feed product import, export, and distribution; and various structured trade finance activities. In addition, the company offers soybean meal and oil; vegetable and salad oils and protein meals; ingredients for the food, feed, energy, and industrial customers; margarine, shortening, and other food products; and partially refined oils to produce biodiesel and glycols for use in chemicals, paints, and other industrial products. Further, it provides peanuts, peanut-derived ingredients, and cotton cellulose pulp; sweeteners, corn and wheat starches, syrup, glucose, wheat flour, and dextrose; alcohol, and other food and animal feed ingredients; ethyl alcohol and ethanol; corn gluten feed and meal; distillers' grains; corn germ; and citric acids. Additionally, the company provides proteins, natural flavors, flavor systems, natural colors, emulsifiers, soluble fiber, polyols, hydrocolloids, probiotics, prebiotics, postbiotics, enzymes, and botanical extracts; and other specialty food and feed ingredients; edible beans; formula feeds, and animal health and nutrition products; and contract and private label pet treats and food products. It also offers futures commission merchant; commodity brokerage services; cash margins and securities pledged to commodity exchange clearinghouse; and cash pledged as security under certain insurance arrangements. The company was founded in 1902 and is headquartered in Chicago, Illinois.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:32"},{"Company Name":"PayPal Holdings, Inc.","Symbol":"PYPL","Current Price":"78.57","Latest MA":"77.58","Price Target":95.01971,"Difference from MA":"1.27%","Difference from Open":"-1.33%","Change from Yesterday":"-0.80%","Change from Last Report":"0.00","Latest Volume":"14,338,522","Market Cap":"77,724,745,728","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":13.998735,"PB Ratio":3.9179215,"Previous Close":79.2,"ROE":0.22188,"DTE":65.718,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.436,"Trailing PEG":1.2132,"Trailing PE":19.691729,"Trailing PS":2.4708252,"Quick Ratio":0.261,"Day High":79.74,"Day Low":78.12,"VS Average Volume":1.5058223782,"Company Summary":"PayPal Holdings, Inc. operates a technology platform that enables digital payments on behalf of merchants and consumers worldwide. It operates a two-sided network at scale that connects merchants and consumers that enables its customers to connect, transact, and send and receive payments through online and in person, as well as transfer and withdraw funds using various funding sources, such as bank accounts, PayPal or Venmo account balance, PayPal and Venmo branded credit products comprising its installment products, credit and debit cards, and cryptocurrencies, as well as other stored value products, including gift cards and eligible rewards. The company provides payment solutions under the PayPal, PayPal Credit, Braintree, Venmo, Xoom, Zettle, Hyperwallet, Honey, and Paidy names. The company was founded in 1998 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:32"},{"Company Name":"Advanced Micro Devices, Inc.","Symbol":"AMD","Current Price":"110.16","Latest MA":"143.16","Price Target":150.59454,"Difference from MA":"-23.05%","Difference from Open":"-0.62%","Change from Yesterday":"-1.65%","Change from Last Report":"0.00","Latest Volume":"49,694,644","Market Cap":"178,768,756,736","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":17.338722,"PB Ratio":3.1374784,"Previous Close":112.01,"ROE":0.03262,"DTE":3.927,"Industry":"Semiconductors","Sector":"Technology","Beta":1.706,"Trailing PEG":0.3097,"Trailing PE":110.16,"Trailing PS":7.358253,"Quick Ratio":1.575,"Day High":112.56,"Day Low":109.02,"VS Average Volume":1.3012616922,"Company Summary":"Advanced Micro Devices, Inc. operates as a semiconductor company worldwide. It operates through Data Center, Client, Gaming, and Embedded segments. The company offers x86 microprocessors and graphics processing units (GPUs) as an accelerated processing unit, chipsets, data center, and professional GPUs; and embedded processors, and semi-custom system-on-chip (SoC) products, microprocessor and SoC development services and technology, data processing unites, field programmable gate arrays (FPGA), and adaptive SoC products. It provides processors under the AMD Ryzen, AMD Ryzen PRO, Ryzen Threadripper, Ryzen Threadripper PRO, AMD Athlon, AMD Athlon PRO, and AMD PRO A-Series brand names; graphics under the AMD Radeon graphics and AMD Embedded Radeon graphics; and professional graphics under the AMD Radeon Pro graphics brand name. In addition, the company offers data center graphics under the Radeon Instinct and Radeon PRO V-series brands, as well as servers under the AMD Instinct accelerators brand; server microprocessors under the AMD EPYC brands; low power solutions under the AMD Athlon, AMD Geode, AMD Ryzen, AMD EPYC, AMD R-Series, and G-Series brands; FPGA products under the Virtex-6, Virtex-7, Virtex UltraScale+, Kintex-7, Kintex UltraScale, Kintex UltraScale+, Artix-7, Artix UltraScale+, Spartan-6, and Spartan-7 brands; adaptive SOCs under the Zynq-7000, Zynq UltraScale+ MPSoC, Zynq UltraScale+ RFSoCs, Versal HBM, Versal Premium, Versal Prime, Versal AI Core, Versal AI Edge, Vitis, and Vivado brands; and compute and network acceleration board products under the Alveo brand. It serves original equipment and design manufacturers, public cloud service providers, system integrators, independent distributors, and add-in-board manufacturers through its direct sales force, and sales representatives. Advanced Micro Devices, Inc. was incorporated in 1969 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:32"},{"Company Name":"Amcor plc","Symbol":"AMCR","Current Price":"10.03","Latest MA":"10.29","Price Target":11.34333,"Difference from MA":"-2.50%","Difference from Open":"-1.57%","Change from Yesterday":"-1.86%","Change from Last Report":"0.00","Latest Volume":"24,117,716","Market Cap":"14,496,759,808","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":12.516535,"PB Ratio":3.7327874,"Previous Close":10.22,"ROE":0.1958,"DTE":196.619,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":0.863,"Trailing PEG":2.0218,"Trailing PE":18.236362,"Trailing PS":1.0698715,"Quick Ratio":0.591,"Day High":10.22,"Day Low":10.0,"VS Average Volume":1.3780637753,"Company Summary":"Amcor plc develops, produces, and sells packaging products in Europe, North America, Latin America, and the Asia Pacific. The company operates in two segments, Flexibles and Rigid Packaging. The Flexibles segment offers flexible and film packaging products in the food and beverage, medical and pharmaceutical, fresh produce, snack food, personal care, and other industries. The Rigid Packaging segment provides rigid containers for various beverage and food products, including carbonated soft drinks, water, juices, sports drinks, milk-based beverages, spirits and beer, sauces, dressings, spreads, and personal care items; and plastic caps for various applications. It sells its products through its direct sales force. The company was incorporated in 1926 and is headquartered in Zurich, Switzerland.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:32"},{"Company Name":"Ball Corporation","Symbol":"BALL","Current Price":"51.27","Latest MA":"60.91","Price Target":63.47467,"Difference from MA":"-15.82%","Difference from Open":"-2.34%","Change from Yesterday":"0.16%","Change from Last Report":"0.00","Latest Volume":"3,023,859","Market Cap":"15,300,300,800","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":12.884305,"PB Ratio":2.3018901,"Previous Close":51.19,"ROE":0.14048,"DTE":90.836,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":0.899,"Trailing PEG":1.0523,"Trailing PE":37.42336,"Trailing PS":1.1099238,"Quick Ratio":0.801,"Day High":52.54,"Day Low":50.76,"VS Average Volume":1.303596525,"Company Summary":"Ball Corporation supplies aluminum packaging products for the beverage, personal care, and household products industries in the United States, Brazil, and internationally. The company manufactures and sells aluminum beverage containers to fillers of carbonated soft drinks, beer, energy drinks, and other beverages. It also manufactures and sells extruded aluminum aerosol containers, recloseable aluminum bottles, aluminum cups, and aluminum slugs. Ball Corporation was founded in 1880 and is headquartered in Westminster, Colorado.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:32"},{"Company Name":"Omnicom Group Inc.","Symbol":"OMC","Current Price":"84.23","Latest MA":"94.99","Price Target":111.83727,"Difference from MA":"-11.33%","Difference from Open":"-1.49%","Change from Yesterday":"-0.82%","Change from Last Report":"0.00","Latest Volume":"3,158,872","Market Cap":"16,550,437,888","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":9.117933,"PB Ratio":4.1588902,"Previous Close":84.93,"ROE":0.33923998,"DTE":155.236,"Industry":"Advertising Agencies","Sector":"Communication Services","Beta":0.968,"Trailing PEG":1.242,"Trailing PE":11.290885,"Trailing PS":1.0727673,"Quick Ratio":0.788,"Day High":85.96,"Day Low":83.51,"VS Average Volume":1.3140345323,"Company Summary":"Omnicom Group Inc., together with its subsidiaries, offers advertising, marketing, and corporate communications services. It provides a range of services in the areas of advertising and media, precision marketing, commerce and branding, experiential, execution and support, public relations, and healthcare. The company's services include advertising, branding, content marketing, corporate social responsibility consulting, crisis communications, custom publishing, data analytics, database management, digital\/direct marketing and post-production, digital transformation consulting, entertainment marketing, experiential marketing, field marketing, sales support, financial\/corporate business-to-business advertising, graphic arts\/digital imaging, healthcare marketing and communications, and instore design services. Its services also comprise interactive marketing, investor relations, marketing research, media planning and buying, retail media planning and buying, merchandising and point of sale, mobile marketing, multi-cultural marketing, non-profit marketing, organizational communications, package design, product placement, promotional marketing, public affairs, public relations, retail marketing, retail media and e-commerce, search engine marketing, shopper marketing, social media marketing, and sports and event marketing services. It operates in the North and Latin America, Europe, the Middle East and Africa (EMEA), and the Asia Pacific. The company was incorporated in 1944 and is based in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:32"},{"Company Name":"Match Group, Inc.","Symbol":"MTCH","Current Price":"34.59","Latest MA":"34.34","Price Target":36.27864,"Difference from MA":"0.72%","Difference from Open":"2.37%","Change from Yesterday":"3.01%","Change from Last Report":"0.00","Latest Volume":"6,760,507","Market Cap":"8,685,238,272","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":9.007226,"PB Ratio":"N\/A","Previous Close":33.58,"ROE":"N\/A","DTE":"N\/A","Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.487,"Trailing PEG":0.5432,"Trailing PE":17.123762,"Trailing PS":2.4918735,"Quick Ratio":2.265,"Day High":34.765,"Day Low":33.79,"VS Average Volume":1.4991616634,"Company Summary":"Match Group, Inc. engages in the provision of dating products. Its portfolio of brands includes Tinder, Hinge, Match, Meetic, OkCupid, Pairs, Plenty Of Fish, Azar, BLK, and Hakuna, as well as a various other brands, each built to increase users' likelihood of connecting with others. Its services are available in over 40 languages to users worldwide. The company was incorporated in 1986 and is based in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:32"},{"Company Name":"Pentair plc.","Symbol":"PNR","Current Price":"98.63","Latest MA":"95.13","Price Target":112.7285,"Difference from MA":"3.68%","Difference from Open":"-1.04%","Change from Yesterday":"-0.07%","Change from Last Report":"0.00","Latest Volume":"931,992","Market Cap":"16,296,733,696","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":18.683144,"PB Ratio":4.657851,"Previous Close":98.7,"ROE":0.20408002,"DTE":49.774,"Industry":"Specialty Industrial Machinery","Sector":"Industrials","Beta":1.189,"Trailing PEG":1.796,"Trailing PE":26.371656,"Trailing PS":3.9801521,"Quick Ratio":0.828,"Day High":99.67,"Day Low":97.9,"VS Average Volume":0.7496832722,"Company Summary":"Pentair plc provides various water solutions in the United States, Western Europe, China, Eastern Europe, Latin America, the Middle East, Southeast Asia, Australia, Canada, and Japan. The company operates through three segments: Flow, Water Solutions, and Pool. The Flow segment designs, manufactures, and sells fluid treatment and pump products and systems, including pressure vessels, gas recovery solutions, membrane bioreactors, wastewater reuse systems and advanced membrane filtration, separation systems, water disposal pumps, water supply pumps, fluid transfer pumps, turbine pumps, solid handling pumps, and agricultural spray nozzles for fluid delivery, ion exchange, desalination, food and beverage, separation technologies in the oil and gas industry, residential and municipal wells, water treatment, wastewater solids handling, pressure boosting, circulation and transfer, fire suppression, flood control, agricultural irrigation, and crop spray in residential, commercial, and industrial markets. The Water Solutions segment provides commercial and residential water treatment products and systems, including pressure tanks, control valves, activated carbon products, commercial ice machines, conventional filtration products, and point-of-entry and point-of-use water treatment systems, as well as installation and preventative services for use in residential whole home water filtration, drinking water filtration, and water softening solutions, as well as commercial total water management and filtration in foodservice operations. The Pool segment provides residential and commercial pool equipment and accessories comprising pumps, filters, heaters, lights, automatic controls, automatic cleaners, maintenance equipment, and pool accessories for applications in residential and commercial pool maintenance, pool repair, renovation, service, and construction and aquaculture solutions. Pentair plc was founded in 1966 and is headquartered in London, the United Kingdom.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"07-02-2025 03:42:32"},{"Company Name":"Marathon Petroleum Corporation","Symbol":"MPC","Current Price":"151.93","Latest MA":"157.93","Price Target":167.47368,"Difference from MA":"-3.80%","Difference from Open":"-3.84%","Change from Yesterday":"-3.42%","Change from Last Report":"0.00","Latest Volume":"2,045,848","Market Cap":"48,009,879,552","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":12.38197,"PB Ratio":2.6080163,"Previous Close":157.31,"ROE":0.21053,"DTE":114.328,"Industry":"Oil & Gas Refining & Marketing","Sector":"Energy","Beta":1.371,"Trailing PEG":null,"Trailing PE":15.07242,"Trailing PS":0.33650997,"Quick Ratio":0.727,"Day High":158.99,"Day Low":150.79,"VS Average Volume":0.7517103047,"Company Summary":"Marathon Petroleum Corporation, together with its subsidiaries, operates as an integrated downstream energy company primarily in the United States. The company operates through Refining & Marketing, and Midstream segments. The Refining & Marketing segment refines crude oil and other feedstocks at its refineries in the Gulf Coast, Mid-Continent, and West Coast regions of the United States; and purchases refined products and ethanol for resale and distributes refined products, including renewable diesel, through transportation, storage, distribution, and marketing services. Its refined products include transportation fuels, such as reformulated gasolines and blend-grade gasolines; heavy fuel oil; and asphalt. This segment also manufactures propane and petrochemicals. It sells refined products to wholesale marketing customers in the United States and internationally, buyers on the spot market, and independent entrepreneurs who operate primarily Marathon branded outlets, as well as through long-term fuel supply contracts to direct dealer locations primarily under the ARCO brand. The Midstream segment transports, stores, distributes, and markets crude oil and refined products through refining logistics assets, pipelines, terminals, towboats, and barges; gathers, processes, and transports natural gas; and gathers, transports, fractionates, stores, and markets natural gas liquids. Marathon Petroleum Corporation was founded in 1887 and is headquartered in Findlay, Ohio.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:32"},{"Company Name":"Electronic Arts Inc.","Symbol":"EA","Current Price":"132.00","Latest MA":"146.84","Price Target":142.87364,"Difference from MA":"-10.11%","Difference from Open":"1.29%","Change from Yesterday":"1.17%","Change from Last Report":"0.00","Latest Volume":"5,469,426","Market Cap":"34,620,035,072","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":17.656313,"PB Ratio":4.673559,"Previous Close":130.47,"ROE":0.13962,"DTE":29.954,"Industry":"Electronic Gaming & Multimedia","Sector":"Communication Services","Beta":0.781,"Trailing PEG":2.0625,"Trailing PE":33.587784,"Trailing PS":4.6727,"Quick Ratio":1.283,"Day High":132.27,"Day Low":128.74,"VS Average Volume":1.8792043019,"Company Summary":"Electronic Arts Inc. develops, markets, publishes, and delivers games, content, and services for game consoles, PCs, mobile phones, and tablets worldwide. It develops and publishes games and services across various genres, such as sports, racing, first-person shooter, action, role-playing, and simulation through owned and licensed brands, such as EA SPORTS FC, Battlefield, Apex Legends, The Sims, Madden NFL, Need for Speed, Titanfall, and F1 brands. The company licenses its games to third parties to distribute and host its games and content. It markets and sells its games and services through digital distribution and retail channels, as well as directly to mass market retailers, specialty stores, and distribution arrangements. Electronic Arts Inc. was incorporated in 1982 and is headquartered in Redwood City, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"07-02-2025 03:42:32"}]