[{"Company Name":"Palantir Technologies Inc.","Symbol":"PLTR","Current Price":"79.35","Latest MA":"48.54","Price Target":53.41579,"Difference from MA":"63.49%","Difference from Open":"-0.96%","Change from Yesterday":"-3.79%","Change from Last Report":"0.00","Latest Volume":"23,229,779","Market Cap":"180,760,887,296","Earning Date":"2025-02-03","Earning Time":"After","Earning Day of Week":"Monday","PE Ratio":162.35957,"PB Ratio":40.035316,"Previous Close":82.49,"ROE":0.12409,"DTE":5.552,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":2.697,"Trailing PEG":3.2996,"Trailing PE":396.75,"Trailing PS":68.306046,"Quick Ratio":5.546,"Day High":80.9563,"Day Low":78.47,"VS Average Volume":0.2768195074,"Company Summary":"Palantir Technologies Inc. builds and deploys software platforms for the intelligence community to assist in counterterrorism investigations and operations in the United States, the United Kingdom, and internationally. The company provides Palantir Gotham, a software platform which enables users to identify patterns hidden deep within datasets, ranging from signals intelligence sources to reports from confidential informants, as well as facilitates the handoff between analysts and operational users, helping operators plan and execute real-world responses to threats that have been identified within the platform. It also offers Palantir Foundry, a platform that transforms the ways organizations operate by creating a central operating system for their data; and allows individual users to integrate and analyze the data they need in one place. In addition, it provides Palantir Apollo, a software that delivers software and updates across the business, as well as enables customers to deploy their software virtually in any environment; and Palantir Artificial Intelligence Platform (AIP) that provides unified access to open-source, self-hosted, and commercial large language models (LLM) that can transform structured and unstructured data into LLM-understandable objects and can turn organizations' actions and processes into tools for humans and LLM-driven agents. The company was incorporated in 2003 and is headquartered in Denver, Colorado.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"Exxon Mobil Corporation","Symbol":"XOM","Current Price":"106.33","Latest MA":"114.38","Price Target":129.63231,"Difference from MA":"-7.04%","Difference from Open":"-0.29%","Change from Yesterday":"-0.51%","Change from Last Report":"0.00","Latest Volume":"2,937,849","Market Cap":"462,854,488,064","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":12.036123,"PB Ratio":1.7399201,"Previous Close":106.83,"ROE":0.14513999,"DTE":15.394,"Industry":"Oil & Gas Integrated","Sector":"Energy","Beta":0.88,"Trailing PEG":4.0957,"Trailing PE":13.5625,"Trailing PS":1.3462194,"Quick Ratio":0.978,"Day High":106.73,"Day Low":105.3225,"VS Average Volume":0.1890597629,"Company Summary":"Exxon Mobil Corporation engages in the exploration and production of crude oil and natural gas in the United States and internationally. It operates through Upstream, Energy Products, Chemical Products, and Specialty Products segments. The Upstream segment explores for and produces crude oil and natural gas. The Energy Products segment offers fuels, aromatics, and catalysts, as well as licensing services. It sells its products under the Exxon, Esso, and Mobil brands. The Chemical Products segment manufactures and markets petrochemicals including olefins, polyolefins, and intermediates. The Specialty Products segment offers performance products, including lubricants, basestocks, waxes, synthetics, elastomers, and resins. The company also involves in the manufacturing, trade, transport, and sale of crude oil, natural gas, petroleum products, petrochemicals, and other specialty products; and pursuit lower-emission business opportunities, including carbon capture and storage, hydrogen, lower-emission fuels, and lithium. Exxon Mobil Corporation was founded in 1870 and is based in Spring, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"AbbVie Inc.","Symbol":"ABBV","Current Price":"190.79","Latest MA":"181.49","Price Target":203.50693,"Difference from MA":"5.12%","Difference from Open":"4.15%","Change from Yesterday":"3.76%","Change from Last Report":"0.00","Latest Volume":"2,208,273","Market Cap":"337,152,638,976","Earning Date":"2025-01-31","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":13.820994,"PB Ratio":55.900963,"Previous Close":183.9,"ROE":0.56407,"DTE":1174.815,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.613,"Trailing PEG":0.4344,"Trailing PE":79.828445,"Trailing PS":6.071213,"Quick Ratio":0.436,"Day High":190.8,"Day Low":182.15,"VS Average Volume":0.3343626432,"Company Summary":"AbbVie Inc. discovers, develops, manufactures, and sells pharmaceuticals worldwide. The company offers Humira, an injection for autoimmune and intestinal Behçet's diseases, and pyoderma gangrenosum; Skyrizi to treat moderate to severe plaque psoriasis, psoriatic disease, and Crohn's disease; Rinvoq to treat rheumatoid and psoriatic arthritis, ankylosing spondylitis, atopic dermatitis, axial spondyloarthropathy, ulcerative colitis, and Crohn's disease; Imbruvica for the treatment of adult patients with blood cancers; Epkinly to treat lymphoma; Elahere to treat cancer; and Venclexta\/Venclyxto to treat blood cancers. It also provides facial injectables, plastics and regenerative medicine, body contouring, and skincare products; botox therapeutic; Vraylar for depressive disorder; Duopa and Duodopa to treat advanced Parkinson's disease; Ubrelvy for the acute treatment of migraine in adults; and Qulipta for episodic and chronic migraine. In addition, the company offers Ozurdex for eye diseases; Lumigan\/Ganfort and Alphagan\/Combigan for the reduction of elevated intraocular pressure in patients with open angle glaucoma or ocular hypertension; Restasis to increase tear production; and other eye care products. Further, it provides Mavyret\/Maviret to treat chronic hepatitis C virus genotype 1-6 infection; Creon, a pancreatic enzyme therapy; Lupron to treat advanced prostate cancer, endometriosis and central precocious puberty, and patients with anemia caused by uterine fibroids; Linzess\/Constella to treat irritable bowel syndrome with constipation and chronic idiopathic constipation; and Synthroid for hypothyroidism. It has collaborations with Calico Life Sciences LLC; REGENXBIO Inc.; Janssen Biotech, Inc.; Evolveimmune Therapeutics, Inc.; Genentech, Inc.; AbCellera Biologics Inc.; and Tentarix Biotherapeutics, LP. The company was incorporated in 2012 and is headquartered in North Chicago, Illinois.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"Baker Hughes Company","Symbol":"BKR","Current Price":"46.40","Latest MA":"38.53","Price Target":48.94654,"Difference from MA":"20.42%","Difference from Open":"-0.91%","Change from Yesterday":"0.52%","Change from Last Report":"0.00","Latest Volume":"2,428,791","Market Cap":"45,909,061,632","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":15.68416,"PB Ratio":2.834494,"Previous Close":46.18,"ROE":0.14292,"DTE":36.933,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.363,"Trailing PEG":1.0291,"Trailing PE":15.568792,"Trailing PS":1.6816506,"Quick Ratio":0.749,"Day High":47.06,"Day Low":46.05,"VS Average Volume":0.3581106585,"Company Summary":"Baker Hughes Company provides a portfolio of technologies and services to energy and industrial value chain worldwide. The company operates through Oilfield Services & Equipment (OFSE) and Industrial & Energy Technology (IET) segments. The OFSE segment designs and manufactures products and provides related services, including exploration, appraisal, development, production, rejuvenation, and decommissioning for onshore and offshore oilfield operations. This segment also provides drilling services, drill bits, and drilling and completions fluids; completions, intervention, measurements, pressure pumping, and wireline services; artificial lift systems, and oilfield and industrial chemicals; subsea projects and services, flexible pipe systems, and surface pressure control systems; and integrated well services and solutions. It serves oil and natural gas companies; the United States and international independent oil and natural gas companies; national or state-owned oil companies; engineering, procurement, and construction contractors; geothermal companies; and other oilfield service companies. The IET segment provides gas technology equipment, including drivers, driven equipment, flow control, and turnkey solutions for the mechanical-drive, compression, and power-generation applications; and energy sectors, such as oil and gas, LNG operations, petrochemical, and carbon solutions. This segment also provides rack-based vibration monitoring equipment and sensors; integrated asset performance management products; inspection services; pumps, valves, and gears; precision sensors and instrumentation, and condition monitoring solutions. It serves upstream, midstream, downstream, onshore, offshore, and small and large scale customers. The company was formerly known as Baker Hughes, a GE company and changed its name to Baker Hughes Company in October 2019. Baker Hughes Company was incorporated in 2016 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"Intel Corporation","Symbol":"INTC","Current Price":"19.47","Latest MA":"23.27","Price Target":22.44353,"Difference from MA":"-16.33%","Difference from Open":"2.52%","Change from Yesterday":"0.13%","Change from Last Report":"0.00","Latest Volume":"23,184,031","Market Cap":"84,300,767,232","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":16.360504,"PB Ratio":0.8428503,"Previous Close":19.43,"ROE":-0.15597,"DTE":47.906,"Industry":"Semiconductors","Sector":"Technology","Beta":1.026,"Trailing PEG":0.5766,"Trailing PE":"N\/A","Trailing PS":1.5540172,"Quick Ratio":0.833,"Day High":19.469,"Day Low":18.78,"VS Average Volume":0.3149795966,"Company Summary":"Intel Corporation designs, develops, manufactures, markets, and sells computing and related products and services worldwide. It operates through Client Computing Group, Data Center and AI, Network and Edge, Mobileye, and Intel Foundry Services segments. The company's products portfolio comprises central processing units and chipsets, system-on-chips (SoCs), and multichip packages; mobile and desktop processors; hardware products comprising graphics processing units (GPUs), domain-specific accelerators, and field programmable gate arrays (FPGAs); and memory and storage, connectivity and networking, and other semiconductor products. It also offers silicon devices and software products; and optimization solutions for workloads, such as AI, cryptography, security, storage, networking, and leverages various features supporting diverse compute environments. In addition, the company develops and deploys advanced driver assistance systems (ADAS), and autonomous driving technologies and solutions; and provides advanced process technologies backed by an ecosystem of IP, EDA, and design services, as well as systems of chips, including advanced packaging technologies, software and accelerate bring-up, and integration of chips and driving standards. Further, it delivers and deploys intelligent edge platforms that allow developers to achieve agility and drive automation using AI for efficient operations with data integrity, as well as provides hardware and software platforms, tools, and ecosystem partnerships for digital transformation from the cloud to edge. The company serves original equipment manufacturers, original design manufacturers, cloud service providers, and other manufacturers and service providers. It has a strategic agreement with Synopsys, Inc. to develop EDA and IP solutions; and ARM that enables chip designers to build optimized compute SoCs on the Intel 18A process. Intel Corporation was incorporated in 1968 and is headquartered in Santa Clara, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"Apple Inc.","Symbol":"AAPL","Current Price":"227.89","Latest MA":"229.83","Price Target":251.8335,"Difference from MA":"-0.85%","Difference from Open":"-0.68%","Change from Yesterday":"-3.41%","Change from Last Report":"0.00","Latest Volume":"18,962,003","Market Cap":"3,423,386,468,352","Earning Date":"2025-01-30","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":27.54637,"PB Ratio":60.496418,"Previous Close":236.0,"ROE":1.5741299,"DTE":209.059,"Industry":"Consumer Electronics","Sector":"Technology","Beta":1.24,"Trailing PEG":2.1681,"Trailing PE":36.173016,"Trailing PS":8.754681,"Quick Ratio":0.745,"Day High":231.83,"Day Low":226.635,"VS Average Volume":0.3786775496,"Company Summary":"Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod. It also provides AppleCare support and cloud services; and operates various platforms, including the App Store that allow customers to discover and download applications and digital content, such as books, music, video, games, and podcasts, as well as advertising services include third-party licensing arrangements and its own advertising platforms. In addition, the company offers various subscription-based services, such as Apple Arcade, a game subscription service; Apple Fitness+, a personalized fitness service; Apple Music, which offers users a curated listening experience with on-demand radio stations; Apple News+, a subscription news and magazine service; Apple TV+, which offers exclusive original content; Apple Card, a co-branded credit card; and Apple Pay, a cashless payment service, as well as licenses its intellectual property. The company serves consumers, and small and mid-sized businesses; and the education, enterprise, and government markets. It distributes third-party applications for its products through the App Store. The company also sells its products through its retail and online stores, and direct sales force; and third-party cellular network carriers, wholesalers, retailers, and resellers. Apple Inc. was founded in 1976 and is headquartered in Cupertino, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"Comcast Corporation","Symbol":"CMCSA","Current Price":"33.41","Latest MA":"39.50","Price Target":43.80964,"Difference from MA":"-15.41%","Difference from Open":"0.68%","Change from Yesterday":"-0.67%","Change from Last Report":"0.00","Latest Volume":"5,950,929","Market Cap":"127,548,399,616","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":7.0067835,"PB Ratio":1.4937416,"Previous Close":33.66,"ROE":0.16884,"DTE":117.127,"Industry":"Telecom Services","Sector":"Communication Services","Beta":1.004,"Trailing PEG":1.0444,"Trailing PE":8.071257,"Trailing PS":1.0363891,"Quick Ratio":0.605,"Day High":33.57,"Day Low":33.04,"VS Average Volume":0.2717166198,"Company Summary":"Comcast Corporation operates as a media and technology company worldwide. It operates through Residential Connectivity & Platforms, Business Services Connectivity, Media, Studios, and Theme Parks segments. The Residential Connectivity & Platforms segment provides residential broadband and wireless connectivity services, residential and business video services, sky-branded entertainment television networks, and advertising. The Business Services Connectivity segment offers connectivity services for small business locations, which include broadband, wireline voice, and wireless services, as well as solutions for medium-sized customers and larger enterprises; and small business connectivity services in the United Kingdom. The Media segment operates NBCUniversal's television and streaming business, including national and regional cable networks; the NBC and Telemundo broadcast networks and owned local broadcast television stations; and Peacock, a direct-to-consumer streaming services. It also operates international television networks comprising the Sky Sports networks, as well as other digital properties. The Studios segment operates NBCUniversal and Sky film and television studio production and distribution operations. The Theme Parks segment operates Universal theme parks in Orlando, Florida; Hollywood, California; Osaka, Japan; and Beijing, China. The company also offers a consolidated streaming platforms under the Philadelphia Flyers and the Wells Fargo Center arena in Philadelphia, Pennsylvania; and Xumo. Comcast Corporation was founded in 1963 and is headquartered in Philadelphia, Pennsylvania.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"United Parcel Service, Inc.","Symbol":"UPS","Current Price":"110.64","Latest MA":"129.39","Price Target":133.38448,"Difference from MA":"-14.49%","Difference from Open":"-1.50%","Change from Yesterday":"-3.11%","Change from Last Report":"0.00","Latest Volume":"3,218,509","Market Cap":"94,416,855,040","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":12.418763,"PB Ratio":5.5986238,"Previous Close":114.23,"ROE":0.31422,"DTE":155.425,"Industry":"Integrated Freight & Logistics","Sector":"Industrials","Beta":0.982,"Trailing PEG":1.467,"Trailing PE":16.391111,"Trailing PS":1.0411404,"Quick Ratio":1.027,"Day High":112.36,"Day Low":109.4,"VS Average Volume":0.6322584283,"Company Summary":"United Parcel Service, Inc., a package delivery company, provides transportation and delivery, distribution, contract logistics, ocean freight, airfreight, customs brokerage, and insurance services. It operates through two segments, U.S. Domestic Package and International Package. The U.S. Domestic Package segment offers time-definite delivery of express letters, documents, small packages, and palletized freight through air and ground services in the United States. The International Package segment provides guaranteed day and time-definite international shipping services comprising guaranteed time-definite express options in Europe, Asia, the Indian sub-continent, the Middle East, Africa, Canada, and Latin America. The company also offers international air and ocean freight forwarding, post-sales, and mail and consulting services. In addition, it provides truckload and customs brokerage services; supply chain solutions to the healthcare and life sciences industries; fulfillment and transportation management services; and integrated supply chain and shipment insurance solutions. United Parcel Service, Inc. was founded in 1907 and is headquartered in Atlanta, Georgia.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"Dow Inc.","Symbol":"DOW","Current Price":"37.17","Latest MA":"47.62","Price Target":46.44444,"Difference from MA":"-21.95%","Difference from Open":"-2.70%","Change from Yesterday":"-4.81%","Change from Last Report":"0.00","Latest Volume":"3,630,375","Market Cap":"26,153,293,824","Earning Date":"2025-01-30","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":13.543055,"PB Ratio":1.421143,"Previous Close":39.05,"ROE":0.05863,"DTE":95.059,"Industry":"Chemicals","Sector":"Basic Materials","Beta":1.222,"Trailing PEG":0.5802,"Trailing PE":23.675158,"Trailing PS":0.60568076,"Quick Ratio":0.8,"Day High":38.3,"Day Low":36.66,"VS Average Volume":0.4538845315,"Company Summary":"Dow Inc., through its subsidiaries, engages in the provision of various materials science solutions for packaging, infrastructure, mobility, and consumer applications in the United States, Canada, Europe, the Middle East, Africa, India, the Asia Pacific, and Latin America. The company operates through Packaging & Specialty Plastics, Industrial Intermediates & Infrastructure, and Performance Materials & Coatings segments. The Packaging & Specialty Plastics segment provides ethylene, and propylene and aromatics products; and polyethylene, polyolefin elastomers, ethylene vinyl acetate, and ethylene propylene diene monomer rubbers for mobility and transportation, consumer, wire and cable, and construction end-markets. The Industrial Intermediates & Infrastructure segment offers purified ethylene, ethylene and ethanol amines, propylene glycol and polyether polyols, aromatic isocyanates and coatings, adhesives, sealants, elastomers, and composites. This segment also provides caustic soda, and ethylene dichloride and vinyl chloride monomers; and cellulose ethers, redispersible latex powders, and acrylic emulsions. The Performance Materials and Coatings segment provides architectural paints and coatings, and industrial coatings that are used in maintenance and protective industries, wood, metal packaging, traffic markings, thermal paper, and leather; and silicon metal, siloxanes, and intermediates used as key materials in manufacturing differentiated downstream silicone products. It also engages in property and casualty insurance, as well as reinsurance business. Dow Inc. was incorporated in 2018 and is headquartered in Midland, Michigan.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"Tesla, Inc.","Symbol":"TSLA","Current Price":"378.76","Latest MA":"292.42","Price Target":324.98926,"Difference from MA":"29.53%","Difference from Open":"-2.05%","Change from Yesterday":"-6.42%","Change from Last Report":"0.00","Latest Volume":"31,988,974","Market Cap":"1,218,305,196,032","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":97.40946,"PB Ratio":17.369762,"Previous Close":404.6,"ROE":0.20389,"DTE":18.078,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":2.295,"Trailing PEG":5.3299,"Trailing PE":187.50743,"Trailing PS":12.540455,"Quick Ratio":1.214,"Day High":389.17,"Day Low":374.39,"VS Average Volume":0.3522945657,"Company Summary":"Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners; and provision of service and repairs to its energy product customers, including under warranty, as well as various financing options to its solar customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was incorporated in 2003 and is headquartered in Austin, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"Microsoft Corporation","Symbol":"MSFT","Current Price":"410.76","Latest MA":"426.21","Price Target":507.029,"Difference from MA":"-3.63%","Difference from Open":"-0.24%","Change from Yesterday":"-1.06%","Change from Last Report":"0.00","Latest Volume":"6,762,436","Market Cap":"3,053,581,762,560","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":27.350832,"PB Ratio":11.373667,"Previous Close":415.06,"ROE":0.35604,"DTE":33.657,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.904,"Trailing PEG":2.2191,"Trailing PE":33.099113,"Trailing PS":12.01299,"Quick Ratio":1.163,"Day High":414.72,"Day Low":408.67,"VS Average Volume":0.3072683686,"Company Summary":"Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services. This segment also provides LinkedIn; and dynamics business solutions, including Dynamics 365, a set of intelligent, cloud-based applications across ERP, CRM, power apps, and power automate; and on-premises ERP and CRM applications. The Intelligent Cloud segment offers server products and cloud services, such as azure and other cloud services; SQL and windows server, visual studio, system center, and related client access licenses, as well as nuance and GitHub; and enterprise services including enterprise support services, industry solutions, and nuance professional services. The More Personal Computing segment offers Windows, including windows OEM licensing and other non-volume licensing of the Windows operating system; Windows commercial comprising volume licensing of the Windows operating system, windows cloud services, and other Windows commercial offerings; patent licensing; and windows Internet of Things; and devices, such as surface, HoloLens, and PC accessories. Additionally, this segment provides gaming, which includes Xbox hardware and content, and first- and third-party content; Xbox game pass and other subscriptions, cloud gaming, advertising, third-party disc royalties, and other cloud services; and search and news advertising, which includes Bing, Microsoft News and Edge, and third-party affiliates. The company sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online, and retail stores. The company was founded in 1975 and is headquartered in Redmond, Washington.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"V.F. Corporation","Symbol":"VFC","Current Price":"24.70","Latest MA":"19.20","Price Target":26.155,"Difference from MA":"28.64%","Difference from Open":"-2.16%","Change from Yesterday":"-4.97%","Change from Last Report":"0.00","Latest Volume":"2,036,320","Market Cap":"9,620,504,576","Earning Date":"2025-01-29","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":22.837194,"PB Ratio":5.7901525,"Previous Close":25.97,"ROE":-0.22331,"DTE":524.646,"Industry":"Apparel Manufacturing","Sector":"Consumer Cyclical","Beta":1.545,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.95313966,"Quick Ratio":0.465,"Day High":25.4,"Day Low":24.51,"VS Average Volume":0.3529285345,"Company Summary":"V.F. Corporation, together with its subsidiaries, engages in the design, procurement, marketing, and distribution of branded lifestyle apparel, footwear, and accessories for men, women, and children in the Americas, Europe, and the Asia-Pacific. It operates through three segments: Outdoor, Active, and Work. The company offers High performance outdoor apparel, footwear, equipment, accessories; outdoor, adventure-inspired lifestyle footwear, apparel, and accessories; performance merino wool and other natural fibers-based apparel and accessories; performance-based footwear; and high performance apparel and accessories based on natural fibers under the The North Face, Timberland, Smartwool, Icebreaker, and Altra brands. It also offers youth culture\/action sports-inspired and streetwear apparel, footwear, and accessories; handbags, luggage, backpacks, totes, and accessories; outdoor-inspired apparel, footwear, and accessories; and backpacks and luggage under the Vans, Supreme, Kipling, Napapijri, Eastpak, and JanSport brands. In addition, the company provides work and work-inspired lifestyle apparel and footwear; and protective work footwear under the Dickies, and Timberland PRO brands. The company sells its products primarily to specialty stores, department stores, national chains, independently-operated partnership stores, and mass merchants, as well as sells through direct-to-consumer operations, including retail stores, concession retail stores, and e-commerce sites, and other digital platforms. V.F. Corporation was founded in 1899 and is headquartered in Denver, Colorado.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"Alibaba Group Holding Limited","Symbol":"BABA","Current Price":"100.48","Latest MA":"88.02","Price Target":120.953445,"Difference from MA":"14.16%","Difference from Open":"4.12%","Change from Yesterday":"1.53%","Change from Last Report":"0.00","Latest Volume":"12,388,292","Market Cap":"238,735,474,688","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":1.4175079,"PB Ratio":0.24786744,"Previous Close":98.84,"ROE":0.05668,"DTE":22.796,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":0.349,"Trailing PEG":0.6524,"Trailing PE":20.46436,"Trailing PS":0.25123492,"Quick Ratio":0.97,"Day High":100.52,"Day Low":96.29,"VS Average Volume":0.7466889213,"Company Summary":"Alibaba Group Holding Limited, through its subsidiaries, provides technology infrastructure and marketing reach to help merchants, brands, retailers, and other businesses to engage with their users and customers in the People's Republic of China and internationally. The company operates through seven segments: China Commerce, International Commerce, Local Consumer Services, Cainiao, Cloud, Digital Media and Entertainment, and Innovation Initiatives and Others. It operates Taobao and Tmall, which are digital retail platforms; Alimama, a proprietary monetization platform; 1688.com and Alibaba.com, which are online wholesale marketplaces; AliExpress, a retail marketplace; Lazada, Trendyol, and Daraz that are e-commerce platforms; Freshippo, a retail platform for groceries and fresh goods; and Tmall Global, an import e-commerce platform. The company also operates Cainiao Network logistic services platform; Ele.me, an on-demand delivery and local services platform; Koubei, a restaurant and local services guide platform; and Fliggy, an online travel platform. In addition, it offers pay-for-performance, in-feed, and display marketing services; and Taobao Ad Network and Exchange, a real-time online bidding marketing exchange. Further, the company provides elastic computing, storage, network, security, database, big data, and IoT services; and hardware, software license, software installation, and application development and maintenance services. Additionally, it operates Youku, an online video platform; Quark, a platform for information search, storage, and consumption; Alibaba Pictures and other content platforms that provide online videos, films, live events, news feeds, literature, music, and others; Amap, a mobile digital map, navigation, and real-time traffic information app; DingTalk, a business efficiency mobile app; and Tmall Genie smart speaker. The company was incorporated in 1999 and is based in Hangzhou, the People's Republic of China.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"Meta Platforms, Inc.","Symbol":"META","Current Price":"688.68","Latest MA":"561.64","Price Target":730.9879,"Difference from MA":"22.62%","Difference from Open":"1.89%","Change from Yesterday":"-0.11%","Change from Last Report":"0.00","Latest Volume":"6,277,060","Market Cap":"1,744,880,533,504","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":23.738766,"PB Ratio":10.564844,"Previous Close":689.18,"ROE":0.36134,"DTE":29.811,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.215,"Trailing PEG":2.0114,"Trailing PE":28.875465,"Trailing PS":11.1688795,"Quick Ratio":2.568,"Day High":697.5,"Day Low":675.25,"VS Average Volume":0.4686441814,"Company Summary":"Meta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and wearables worldwide. It operates in two segments, Family of Apps and Reality Labs. The Family of Apps segment offers Facebook, which enables people to share, discuss, discover, and connect with interests; Instagram, a community for sharing photos, videos, and private messages, as well as feed, stories, reels, video, live, and shops; Messenger, a messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls; and WhatsApp, a messaging application that is used by people and businesses to communicate and transact privately. The Reality Labs segment provides augmented and virtual reality related products comprising consumer hardware, software, and content that help people feel connected, anytime, and anywhere. The company was formerly known as Facebook, Inc. and changed its name to Meta Platforms, Inc. in October 2021. The company was incorporated in 2004 and is headquartered in Menlo Park, California","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"General Motors Company","Symbol":"GM","Current Price":"47.79","Latest MA":"49.52","Price Target":60.05308,"Difference from MA":"-3.49%","Difference from Open":"2.77%","Change from Yesterday":"-3.55%","Change from Last Report":"0.00","Latest Volume":"8,098,242","Market Cap":"47,551,143,936","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":4.095488,"PB Ratio":0.74109113,"Previous Close":49.46,"ROE":0.14167,"DTE":174.581,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":1.414,"Trailing PEG":7.3274,"Trailing PE":7.502355,"Trailing PS":0.26024193,"Quick Ratio":0.948,"Day High":47.97,"Day Low":46.37,"VS Average Volume":0.6995913413,"Company Summary":"General Motors Company designs, builds, and sells trucks, crossovers, cars, and automobile parts; and provide software-enabled services and subscriptions worldwide. The company operates through GM North America, GM International, Cruise, and GM Financial segments. It markets its vehicles primarily under the Buick, Cadillac, Chevrolet, GMC, Baojun, and Wuling brand names. In addition, the company sells trucks, crossovers, cars, and automobile parts through retail dealers, and distributors and dealers, as well as to fleet customers, including daily rental car companies, commercial fleet customers, leasing companies, and governments. Further, it offers range of after-sale services through dealer network, such as maintenance, light repairs, collision repairs, vehicle accessories, and extended service warranties. Additionally, the company provides automotive financing; and software-enabled services and subscriptions. General Motors Company was founded in 1908 and is headquartered in Detroit, Michigan.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"Starbucks Corporation","Symbol":"SBUX","Current Price":"106.43","Latest MA":"91.60","Price Target":105.97067,"Difference from MA":"16.19%","Difference from Open":"0.67%","Change from Yesterday":"-1.18%","Change from Last Report":"0.00","Latest Volume":"2,589,970","Market Cap":"120,897,028,096","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":29.046698,"PB Ratio":"N\/A","Previous Close":107.68,"ROE":"N\/A","DTE":"N\/A","Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":0.962,"Trailing PEG":2.6235,"Trailing PE":34.33226,"Trailing PS":3.3418941,"Quick Ratio":0.524,"Day High":107.07,"Day Low":105.52,"VS Average Volume":0.2931664929,"Company Summary":"Starbucks Corporation, together with its subsidiaries, operates as a roaster, marketer, and retailer of coffee worldwide. The company operates through three segments: North America, International, and Channel Development. Its stores offer coffee, tea, and other beverages, roasted whole beans and ground coffees, single serve products, and ready-to-drink beverages; and various food products, such as pastries, breakfast sandwiches, and lunch items. The company also licenses its trademarks through licensed stores, and grocery and foodservice accounts. The company offers its products under the Starbucks Coffee, Teavana, Seattle's Best Coffee, Ethos, and Starbucks Reserve brands. Starbucks Corporation was founded in 1971 and is based in Seattle, Washington.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"SoFi Technologies, Inc.","Symbol":"SOFI","Current Price":"15.23","Latest MA":"10.90","Price Target":13.29375,"Difference from MA":"39.72%","Difference from Open":"1.69%","Change from Yesterday":"-3.58%","Change from Last Report":"0.00","Latest Volume":"14,585,769","Market Cap":"16,680,799,232","Earning Date":"2025-01-27","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":32.796932,"PB Ratio":2.697237,"Previous Close":15.78,"ROE":0.037249997,"DTE":54.394,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.613,"Trailing PEG":null,"Trailing PE":39.04769,"Trailing PS":6.621438,"Quick Ratio":0.47,"Day High":15.265,"Day Low":14.895,"VS Average Volume":0.2996583766,"Company Summary":"SoFi Technologies, Inc. provides various financial services in the United States, Latin America, and Canada. It operates through three segments: Lending, Technology Platform, and Financial Services. The company offers lending and financial services and products that allows its members to borrow, save, spend, invest, and protect money. It offers personal loans, student loans, home loans, and related services. The company also operates Galileo, a technology platform that offers services to financial and non-financial institution; and Technisys, a cloud-native digital and core banking platform with financial services customers. In addition, it provides SoFi Money offers checking and savings accounts, debit cards, and cash management products; and SoFi Invest, a mobile-first investment platform that provides access to trading and advisory solutions, such as investing and robo-advisory. Further, the company offers SoFi Credit Card that provides cash backs on every purchase; Sofi Relay, a personal finance management product that allows to track all of their financial accounts comprising credit score and spending behaviors; SoFi Protect, which offers insurance product; SoFi Travel, an application that manages travel search and booking experience; SoFi At Work provides financial benefits to employees, including student loan payments made on their employees' behalf; Lantern Credit, a financial services marketplace platform for seeking alternative products and provide product comparisons; and other lending as a service that offers pre-qualified borrower referrals and sells loans to third-party partner. The company was founded in 2011 and is based in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"AT&T Inc.","Symbol":"T","Current Price":"24.27","Latest MA":"21.04","Price Target":26.61885,"Difference from MA":"15.36%","Difference from Open":"2.45%","Change from Yesterday":"2.19%","Change from Last Report":"0.00","Latest Volume":"10,828,497","Market Cap":"174,161,526,784","Earning Date":"2025-01-27","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":10.815557,"PB Ratio":1.7012478,"Previous Close":23.73,"ROE":0.08759,"DTE":125.151,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.73,"Trailing PEG":4.0309,"Trailing PE":16.288591,"Trailing PS":1.4268517,"Quick Ratio":0.42,"Day High":24.27,"Day Low":23.68,"VS Average Volume":0.3029954884,"Company Summary":"AT&T Inc. provides telecommunications and technology services worldwide. The company operates through two segments, Communications and Latin America. The Communications segment offers wireless voice and data communications services; and sells handsets, wireless data cards, wireless computing devices, carrying cases\/protective covers, and wireless chargers through its own company-owned stores, agents, and third-party retail stores. It also provides Virtual Private Networks, AT&T Dedicated Internet, Ethernet, data services, cloud solutions, outsourcing, and managed professional services, as well as customer premises equipment for multinational corporations, small and mid-sized businesses, governmental, and wholesale customers. In addition, this segment offers broadband services, including fiber connections, legacy telephony voice communication services, and other VoIP services and equipment to residential customers. This segment markets its communications services and products under the AT&T, AT&T Business, Cricket, AT&T PREPAID, and AT&T Fiber brand names. The Latin America segment provides postpaid and prepaid wireless services in Mexico under the AT&T and Unefon brand names, as well as sells smartphones through its owned stores, agents and third-party retail stores. The company was formerly known as SBC Communications Inc. and changed its name to AT&T Inc. in 2005. AT&T Inc. was incorporated in 1983 and is based in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"Verizon Communications Inc.","Symbol":"VZ","Current Price":"39.89","Latest MA":"40.59","Price Target":47.66043,"Difference from MA":"-1.72%","Difference from Open":"1.48%","Change from Yesterday":"1.26%","Change from Last Report":"0.00","Latest Volume":"4,682,111","Market Cap":"167,922,139,136","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.18473,"PB Ratio":1.7432916,"Previous Close":39.39,"ROE":0.10431,"DTE":182.615,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.418,"Trailing PEG":1.0601,"Trailing PE":9.635266,"Trailing PS":1.2509378,"Quick Ratio":0.51,"Day High":39.89,"Day Low":39.146,"VS Average Volume":0.2288598421,"Company Summary":"Verizon Communications Inc., through its subsidiaries, engages in the provision of communications, technology, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide. It operates in two segments, Verizon Consumer Group (Consumer) and Verizon Business Group (Business). The Consumer segment provides wireless services across the wireless networks in the United States under the Verizon and TracFone brands and through wholesale and other arrangements; and fixed wireless access (FWA) broadband through its wireless networks, as well as related equipment and devices, such as smartphones, tablets, smart watches, and other wireless-enabled connected devices. The segment also offers wireline services in the Mid-Atlantic and Northeastern United States, as well as Washington D.C. through its fiber-optic network, Verizon Fios product portfolio, and a copper-based network. The Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and conferencing, corporate networking, security and managed network, local and long-distance voice, and network access services to deliver various IoT services and products to businesses, government customers, and wireless and wireline carriers in the United States and internationally. The company was formerly known as Bell Atlantic Corporation and changed its name to Verizon Communications Inc. in June 2000. Verizon Communications Inc. was incorporated in 1983 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"American Airlines Group, Inc.","Symbol":"AAL","Current Price":"16.34","Latest MA":"13.18","Price Target":20.995,"Difference from MA":"24.01%","Difference from Open":"-0.46%","Change from Yesterday":"-3.46%","Change from Last Report":"0.00","Latest Volume":"7,754,458","Market Cap":"10,747,916,288","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":5.3226824,"PB Ratio":"N\/A","Previous Close":16.92,"ROE":"N\/A","DTE":"N\/A","Industry":"Airlines","Sector":"Industrials","Beta":1.399,"Trailing PEG":0.2335,"Trailing PE":13.181451,"Trailing PS":0.2004722,"Quick Ratio":0.422,"Day High":16.54,"Day Low":16.22,"VS Average Volume":0.2808022489,"Company Summary":"American Airlines Group Inc., through its subsidiaries, operates as a network air carrier. The company provides scheduled air transportation services for passengers and cargo through its hubs in Charlotte, Chicago, Dallas\/Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix, and Washington, D.C., as well as through partner gateways in London, Doha, Madrid, Seattle\/Tacoma, Sydney, and Tokyo. It operates a mainline fleet of 965 aircraft. The company was formerly known as AMR Corporation and changed its name to American Airlines Group Inc. in December 2013. American Airlines Group Inc. was founded in 1926 and is headquartered in Fort Worth, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"Freeport-McMoRan, Inc.","Symbol":"FCX","Current Price":"35.16","Latest MA":"43.76","Price Target":47.70762,"Difference from MA":"-19.65%","Difference from Open":"-0.58%","Change from Yesterday":"-1.92%","Change from Last Report":"0.00","Latest Volume":"3,411,866","Market Cap":"50,522,460,160","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":15.935748,"PB Ratio":2.8791354,"Previous Close":35.85,"ROE":0.16870001,"DTE":33.531,"Industry":"Copper","Sector":"Basic Materials","Beta":1.91,"Trailing PEG":5.0477,"Trailing PE":27.046154,"Trailing PS":1.9704548,"Quick Ratio":1.048,"Day High":35.4,"Day Low":34.8901,"VS Average Volume":0.2738239174,"Company Summary":"Freeport-McMoRan Inc. engages in the mining of mineral properties in North America, South America, and Indonesia. It primarily explores for copper, gold, molybdenum, silver, and other metals. The company's assets include the Grasberg minerals district in Indonesia; Morenci, Bagdad, Safford, Sierrita, and Miami in Arizona; Chino and Tyrone in New Mexico; and Henderson and Climax in Colorado, North America, as well as Cerro Verde in Peru and El Abra in Chile. The company was formerly known as Freeport-McMoRan Copper & Gold Inc. and changed its name to Freeport-McMoRan Inc. in July 2014. Freeport-McMoRan Inc. was incorporated in 1987 and is headquartered in Phoenix, Arizona.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"CSX Corporation","Symbol":"CSX","Current Price":"32.41","Latest MA":"33.79","Price Target":37.01231,"Difference from MA":"-4.08%","Difference from Open":"-0.05%","Change from Yesterday":"-1.46%","Change from Last Report":"0.00","Latest Volume":"2,286,408","Market Cap":"62,500,089,856","Earning Date":"2025-01-23","Earning Time":"After","Earning Day of Week":"Thursday","PE Ratio":15.321414,"PB Ratio":4.8337064,"Previous Close":32.87,"ROE":0.29458,"DTE":147.913,"Industry":"Railroads","Sector":"Industrials","Beta":1.191,"Trailing PEG":2.1871,"Trailing PE":18.106146,"Trailing PS":4.2572093,"Quick Ratio":1.195,"Day High":32.56,"Day Low":32.045,"VS Average Volume":0.1765504674,"Company Summary":"CSX Corporation, together with its subsidiaries, provides rail-based freight transportation services. The company offers rail services; and transportation of intermodal containers and trailers, as well as other transportation services, such as rail-to-truck transfers and bulk commodity operations. It also transports chemicals, agricultural and food products, minerals, automotive, forest products, fertilizers, and metals and equipment; and coal, coke, and iron ore to electricity-generating power plants, steel manufacturers, and industrial plants, as well as exports coal to deep-water port facilities. In addition, the company provides intermodal services through a network of approximately 30 terminals transporting manufactured consumer goods in containers; and drayage services, including the pickup and delivery of intermodal shipments. It serves the automotive industry with distribution centers and storage locations, as well as connects non-rail served customers through transferring products, such as plastics and ethanol from rail to trucks. The company operates approximately 20,000 route mile rail network, which serves various population centers in 26 states east of the Mississippi River, the District of Columbia, and the Canadian provinces of Ontario and Quebec, as well as owns and leases approximately 3,500 locomotives. It serves production and distribution facilities through track connections. CSX Corporation was incorporated in 1978 and is headquartered in Jacksonville, Florida.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"Lam Research Corporation","Symbol":"LRCX","Current Price":"79.75","Latest MA":"79.87","Price Target":91.18703,"Difference from MA":"-0.15%","Difference from Open":"0.99%","Change from Yesterday":"-1.62%","Change from Last Report":"0.00","Latest Volume":"2,034,661","Market Cap":"102,480,699,392","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.232271,"PB Ratio":12.176183,"Previous Close":81.05,"ROE":0.49116,"DTE":58.827,"Industry":"Semiconductor Equipment & Materials","Sector":"Technology","Beta":1.486,"Trailing PEG":1.5967,"Trailing PE":24.241337,"Trailing PS":6.5729413,"Quick Ratio":1.685,"Day High":80.07,"Day Low":78.51,"VS Average Volume":0.1720135439,"Company Summary":"Lam Research Corporation designs, manufactures, markets, refurbishes, and services semiconductor processing equipment used in the fabrication of integrated circuits. The company offers ALTUS systems to deposit conformal films for tungsten metallization applications; SABRE electrochemical deposition products for copper interconnect transition that offers copper damascene manufacturing; and VECTOR plasma-enhanced CVD products. It also provides SPEED gapfill high-density plasma chemical vapor deposition products; and Striker single-wafer atomic layer deposition products for dielectric film solutions. In addition, the company offers Flex for dielectric etch applications; Vantex, a dielectric etch system that provides RF technology and repeatable wafer-to-wafer performance enabled by Equipment Intelligence solutions; Kiyo for conductor etch applications; Syndion for through-silicon via etch applications; and Versys metal products for metal etch processes. Further, it provides Coronus bevel clean products to enhance die yield; and Da Vinci, DV-Prime, EOS, and SP series products to address various wafer cleaning applications. The company sells its products in the United States, China, Europe, Japan, Korea, Southeast Asia, and Taiwan. Lam Research Corporation was incorporated in 1980 and is headquartered in Fremont, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"Kinder Morgan, Inc.","Symbol":"KMI","Current Price":"27.10","Latest MA":"24.08","Price Target":29.585,"Difference from MA":"12.54%","Difference from Open":"0.97%","Change from Yesterday":"-1.42%","Change from Last Report":"0.00","Latest Volume":"2,473,820","Market Cap":"60,206,444,544","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.106543,"PB Ratio":1.9801257,"Previous Close":27.1925,"ROE":0.083500005,"DTE":101.433,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.907,"Trailing PEG":2.0121,"Trailing PE":23.162394,"Trailing PS":3.9737606,"Quick Ratio":0.291,"Day High":27.2899,"Day Low":26.73,"VS Average Volume":0.17066476,"Company Summary":"Kinder Morgan, Inc. operates as an energy infrastructure company primarily in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas gasification, liquefaction, and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and\/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, renewable fuel and feedstocks, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; owns interests in\/or operates oil fields and gasoline processing plants; and operates a crude oil pipeline system in West Texas, as well as owns and operates RNG and LNG facilities. It owns and operates approximately 82,000 miles of pipelines and 139 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1997 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"Uber Technologies, Inc.","Symbol":"UBER","Current Price":"67.78","Latest MA":"70.33","Price Target":88.6338,"Difference from MA":"-3.63%","Difference from Open":"3.80%","Change from Yesterday":"1.39%","Change from Last Report":"0.00","Latest Volume":"5,563,680","Market Cap":"142,731,329,536","Earning Date":"2025-02-05","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":21.36809,"PB Ratio":9.650199,"Previous Close":66.85,"ROE":0.34326,"DTE":80.343,"Industry":"Software - Application","Sector":"Technology","Beta":1.337,"Trailing PEG":0.7077,"Trailing PE":33.39064,"Trailing PS":3.40201,"Quick Ratio":1.223,"Day High":67.875,"Day Low":65.1781,"VS Average Volume":0.2218526238,"Company Summary":"Uber Technologies, Inc. develops and operates proprietary technology applications in the United States, Canada, Latin America, Europe, the Middle East, Africa, and Asia excluding China and Southeast Asia. It operates through three segments: Mobility, Delivery, and Freight. The Mobility segment connects consumers with a range of transportation modalities, such as ridesharing, carsharing, micromobility, rentals, public transit, taxis, and other modalities; and offers riders in a variety of vehicle types, as well as financial partnerships products and advertising services. The Delivery segment allows to search for and discover restaurants to grocery, alcohol, convenience, and other retails; order a meal or other items; and Uber direct, a white-label Delivery-as-a-Service for retailers and restaurants, as well as advertising. The Freight segment manages transportation and logistics network, which connects shippers and carriers in digital marketplace including carriers upfronts, pricing, and shipment booking; and provides on-demand platform to automate logistics end-to-end transactions for small-and medium-sized business to global enterprises. The company was formerly known as Ubercab, Inc. and changed its name to Uber Technologies, Inc. in February 2011. Uber Technologies, Inc. was founded in 2009 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"Ford Motor Company","Symbol":"F","Current Price":"9.84","Latest MA":"10.79","Price Target":11.68125,"Difference from MA":"-8.78%","Difference from Open":"1.23%","Change from Yesterday":"-2.38%","Change from Last Report":"0.00","Latest Volume":"37,685,551","Market Cap":"39,107,014,656","Earning Date":"2025-02-05","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":5.91467,"PB Ratio":0.88251126,"Previous Close":10.08,"ROE":0.0799,"DTE":359.359,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":1.636,"Trailing PEG":0.8746,"Trailing PE":11.181818,"Trailing PS":0.21400006,"Quick Ratio":0.942,"Day High":9.85,"Day Low":9.6,"VS Average Volume":0.6277311214,"Company Summary":"Ford Motor Company develops, delivers, and services a range of Ford trucks, commercial cars and vans, sport utility vehicles, and Lincoln luxury vehicles worldwide. It operates through Ford Blue, Ford Model e, and Ford Pro; Ford Next; and Ford Credit segments. The company sells Ford and Lincoln vehicles, service parts, and accessories through distributors and dealers, as well as through dealerships to commercial fleet customers, daily rental car companies, and governments. It also engages in vehicle-related financing and leasing activities to and through automotive dealers. In addition, the company provides retail installment sale contracts for new and used vehicles; and direct financing leases for new vehicles to retail and commercial customers, such as leasing companies, government entities, daily rental companies, and fleet customers. Further, it offers wholesale loans to dealers to finance the purchase of vehicle inventory; and loans to dealers to finance working capital and enhance dealership facilities, purchase dealership real estate, and other dealer vehicle programs. The company was incorporated in 1903 and is based in Dearborn, Michigan.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"Alphabet Inc.","Symbol":"GOOGL","Current Price":"201.68","Latest MA":"174.61","Price Target":216.36867,"Difference from MA":"15.50%","Difference from Open":"0.50%","Change from Yesterday":"-1.14%","Change from Last Report":"0.00","Latest Volume":"7,080,232","Market Cap":"2,477,416,775,680","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":22.419973,"PB Ratio":7.874126,"Previous Close":204.02,"ROE":0.32101002,"DTE":9.324,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.034,"Trailing PEG":1.3332,"Trailing PE":26.712582,"Trailing PS":7.2895427,"Quick Ratio":1.761,"Day High":203.02,"Day Low":200.11,"VS Average Volume":0.2583807974,"Company Summary":"Alphabet Inc. offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube. It is also involved in the sale of apps and in-app purchases and digital content in the Google Play and YouTube; and devices, as well as in the provision of YouTube consumer subscription services. The Google Cloud segment offers infrastructure, cybersecurity, databases, analytics, AI, and other services; Google Workspace that include cloud-based communication and collaboration tools for enterprises, such as Gmail, Docs, Drive, Calendar, and Meet; and other services for enterprise customers. The Other Bets segment sells healthcare-related and internet services. The company was incorporated in 1998 and is headquartered in Mountain View, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"Lumen Technologies, Inc.","Symbol":"LUMN","Current Price":"4.84","Latest MA":"5.53","Price Target":5.37091,"Difference from MA":"-12.40%","Difference from Open":"2.43%","Change from Yesterday":"-2.13%","Change from Last Report":"0.00","Latest Volume":"2,244,210","Market Cap":"4,916,753,920","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":-7.237825,"PB Ratio":14.376853,"Previous Close":4.94,"ROE":-1.6673199,"DTE":5502.924,"Industry":"Telecom Services","Sector":"Communication Services","Beta":1.201,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.36979195,"Quick Ratio":0.988,"Day High":4.845,"Day Low":4.57,"VS Average Volume":0.1582188927,"Company Summary":"Lumen Technologies, Inc., a facilities-based technology and communications company, provides various integrated products and services to business and residential customers in the United States and internationally. The company operates in two segments, Business and Mass Markets. It offers dark fiber, edge cloud services, internet protocol, managed security, software-defined wide area networks, secure access service edge, unified communications and collaboration, and optical wavelengths services; ethernet and VPN data networks services; and legacy services to manage cash flow, including time division multiplexing voice, private line, and other legacy services, as well as sells communication equipment, and IT solutions. The company also provides high speed and lower speed broadband service to residential and small business customers; local and long-distance voice services, professional services, and other ancillary services; and federal broadband and state support programs. It serves its products and services under the Lumen, Quantum Fiber, and CenturyLink brands. The company was formerly known as CenturyLink, Inc. and changed its name to Lumen Technologies, Inc. in September 2020. Lumen Technologies, Inc. was incorporated in 1968 and is headquartered in Monroe, Louisiana.","Stock Sentiment":"N\/A","Row Color":"negative-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"Pfizer, Inc.","Symbol":"PFE","Current Price":"26.45","Latest MA":"27.17","Price Target":31.12955,"Difference from MA":"-2.68%","Difference from Open":"0.55%","Change from Yesterday":"-0.36%","Change from Last Report":"0.00","Latest Volume":"11,393,408","Market Cap":"149,863,546,880","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":9.019995,"PB Ratio":1.6235878,"Previous Close":26.52,"ROE":0.04538,"DTE":73.408,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.615,"Trailing PEG":0.1987,"Trailing PE":35.26,"Trailing PS":2.5240176,"Quick Ratio":0.64,"Day High":26.45,"Day Low":26.15,"VS Average Volume":0.2626299978,"Company Summary":"Pfizer Inc. discovers, develops, manufactures, markets, distributes, and sells biopharmaceutical products in the United States, Europe, and internationally. The company offers medicines and vaccines in various therapeutic areas, including cardiovascular metabolic, migraine, and women's health under the Eliquis, Nurtec ODT\/Vydura, Zavzpret, and the Premarin family brands; infectious diseases with unmet medical needs under the Prevnar family, Abrysvo, Nimenrix, FSME\/IMMUN-TicoVac, and Trumenba brands; and COVID-19 prevention and treatment, and potential future mRNA and antiviral products under the Comirnaty and Paxlovid brands. It also provides medicines and vaccines in various therapeutic areas, such as biosimilars for chronic immune and inflammatory diseases under the Xeljanz, Enbrel, Inflectra, Litfulo, Velsipity, and Cibinqo brands; amyloidosis, hemophilia, endocrine diseases, and sickle cell disease under the Vyndaqel family, Oxbryta, BeneFIX, Somavert, Ngenla, and Genotropin brands; sterile injectable and anti-infective medicines under the Sulperazon, Medrol, Zavicefta, Zithromax, and Panzyga brands; and biologics, small molecules, immunotherapies, and biosimilars under the Ibrance, Xtandi, Inlyta, Bosulif, Mektovi, Padcev, Adcetris, Talzenna, Tukysa, Elrexfio, Tivdak, Lorbrena, and Braftovi brands. In addition, the company involved in the contract manufacturing business. It serves wholesalers, retailers, hospitals, clinics, government agencies, pharmacies, individual provider offices, retail pharmacies, and integrated delivery systems. The company has collaboration agreements with Bristol-Myers Squibb Company; Astellas Pharma US, Inc.; Merck KGaA; and BioNTech SE, as well as has strategic clinical collaboration with Acepodia Inc. for the development of antibody-cell conjugation-based cell therapies in autoimmune diseases. Pfizer Inc. was founded in 1849 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"Super Micro Computer, Inc.","Symbol":"SMCI","Current Price":"26.04","Latest MA":"46.39","Price Target":40.79182,"Difference from MA":"-43.87%","Difference from Open":"-4.35%","Change from Yesterday":"-8.63%","Change from Last Report":"0.00","Latest Volume":"16,992,030","Market Cap":"15,246,121,984","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.0572705,"PB Ratio":2.7936268,"Previous Close":28.52,"ROE":0.32469,"DTE":39.749,"Industry":"Computer Hardware","Sector":"Technology","Beta":1.279,"Trailing PEG":null,"Trailing PE":12.953532,"Trailing PS":1.0202951,"Quick Ratio":1.805,"Day High":27.23,"Day Low":25.71,"VS Average Volume":0.2387972264,"Company Summary":"Super Micro Computer, Inc., together with its subsidiaries, develops and manufactures high performance server and storage solutions based on modular and open architecture in the United States, Europe, Asia, and internationally. Its solutions range from complete server, storage systems, modular blade servers, blades, workstations, full racks, networking devices, server sub-systems, server management software, and security software. The company provides application-optimized server solutions, rackmount and blade servers, storage, and subsystems and accessories; and server software management solutions, such as Server Management Suite, including Supermicro Server Manager, Supermicro Power Management software, Supermicro Update Manager, SuperCloud Composer, and SuperDoctor 5. In addition, it offers server subsystems and accessories comprising server boards, chassis, power supplies, and other accessories. Further, the company provides server and storage system integration, configuration, and software upgrade and update services; and technical documentation services, as well as identifies service requirements, creates and executes project plans, and conducts verification testing and technical documentation, and training services. Additionally, it offers help desk and on-site product support services for its server and storage systems; and customer support services, including ongoing maintenance and technical support for its products. The company provides its products to enterprise data centers, cloud computing, artificial intelligence, and 5G and edge computing markets. It sells its products through direct and indirect sales force, distributors, value-added resellers, system integrators, and original equipment manufacturers. The company was incorporated in 1993 and is headquartered in San Jose, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"PayPal Holdings, Inc.","Symbol":"PYPL","Current Price":"86.79","Latest MA":"77.16","Price Target":96.24829,"Difference from MA":"12.48%","Difference from Open":"0.34%","Change from Yesterday":"-2.01%","Change from Last Report":"0.00","Latest Volume":"2,436,083","Market Cap":"87,010,451,456","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":17.710438,"PB Ratio":4.3278146,"Previous Close":88.58,"ROE":0.22188,"DTE":65.718,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.436,"Trailing PEG":1.468,"Trailing PE":20.763159,"Trailing PS":2.7660124,"Quick Ratio":0.261,"Day High":87.65,"Day Low":86.0,"VS Average Volume":0.2897129252,"Company Summary":"PayPal Holdings, Inc. operates a technology platform that enables digital payments on behalf of merchants and consumers worldwide. It operates a two-sided network at scale that connects merchants and consumers that enables its customers to connect, transact, and send and receive payments through online and in person, as well as transfer and withdraw funds using various funding sources, such as bank accounts, PayPal or Venmo account balance, PayPal and Venmo branded credit products comprising its installment products, credit and debit cards, and cryptocurrencies, as well as other stored value products, including gift cards and eligible rewards. The company provides payment solutions under the PayPal, PayPal Credit, Braintree, Venmo, Xoom, Zettle, Hyperwallet, Honey, and Paidy names. The company was founded in 1998 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"Advanced Micro Devices, Inc.","Symbol":"AMD","Current Price":"113.94","Latest MA":"144.11","Price Target":169.81767,"Difference from MA":"-20.93%","Difference from Open":"0.26%","Change from Yesterday":"-1.74%","Change from Last Report":"0.00","Latest Volume":"8,230,115","Market Cap":"184,902,975,488","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":23.040058,"PB Ratio":3.245137,"Previous Close":115.95,"ROE":0.03262,"DTE":3.927,"Industry":"Semiconductors","Sector":"Technology","Beta":1.706,"Trailing PEG":0.3206,"Trailing PE":101.73215,"Trailing PS":7.610742,"Quick Ratio":1.575,"Day High":114.47,"Day Low":112.98,"VS Average Volume":0.2279791619,"Company Summary":"Advanced Micro Devices, Inc. operates as a semiconductor company worldwide. It operates through Data Center, Client, Gaming, and Embedded segments. The company offers x86 microprocessors and graphics processing units (GPUs) as an accelerated processing unit, chipsets, data center, and professional GPUs; and embedded processors, and semi-custom system-on-chip (SoC) products, microprocessor and SoC development services and technology, data processing unites, field programmable gate arrays (FPGA), and adaptive SoC products. It provides processors under the AMD Ryzen, AMD Ryzen PRO, Ryzen Threadripper, Ryzen Threadripper PRO, AMD Athlon, AMD Athlon PRO, and AMD PRO A-Series brand names; graphics under the AMD Radeon graphics and AMD Embedded Radeon graphics; and professional graphics under the AMD Radeon Pro graphics brand name. In addition, the company offers data center graphics under the Radeon Instinct and Radeon PRO V-series brands, as well as servers under the AMD Instinct accelerators brand; server microprocessors under the AMD EPYC brands; low power solutions under the AMD Athlon, AMD Geode, AMD Ryzen, AMD EPYC, AMD R-Series, and G-Series brands; FPGA products under the Virtex-6, Virtex-7, Virtex UltraScale+, Kintex-7, Kintex UltraScale, Kintex UltraScale+, Artix-7, Artix UltraScale+, Spartan-6, and Spartan-7 brands; adaptive SOCs under the Zynq-7000, Zynq UltraScale+ MPSoC, Zynq UltraScale+ RFSoCs, Versal HBM, Versal Premium, Versal Prime, Versal AI Core, Versal AI Edge, Vitis, and Vivado brands; and compute and network acceleration board products under the Alveo brand. It serves original equipment and design manufacturers, public cloud service providers, system integrators, independent distributors, and add-in-board manufacturers through its direct sales force, and sales representatives. Advanced Micro Devices, Inc. was incorporated in 1969 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"Amcor plc","Symbol":"AMCR","Current Price":"9.43","Latest MA":"10.27","Price Target":11.29556,"Difference from MA":"-8.21%","Difference from Open":"-1.67%","Change from Yesterday":"-3.03%","Change from Last Report":"0.00","Latest Volume":"2,891,269","Market Cap":"13,629,556,736","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":11.877771,"PB Ratio":3.475857,"Previous Close":9.72,"ROE":0.1958,"DTE":196.619,"Industry":"Packaging & Containers","Sector":"Consumer Cyclical","Beta":0.863,"Trailing PEG":1.9257,"Trailing PE":17.792454,"Trailing PS":1.0058713,"Quick Ratio":0.591,"Day High":9.595,"Day Low":9.4,"VS Average Volume":0.1822789635,"Company Summary":"Amcor plc develops, produces, and sells packaging products in Europe, North America, Latin America, and the Asia Pacific. The company operates in two segments, Flexibles and Rigid Packaging. The Flexibles segment offers flexible and film packaging products in the food and beverage, medical and pharmaceutical, fresh produce, snack food, personal care, and other industries. The Rigid Packaging segment provides rigid containers for various beverage and food products, including carbonated soft drinks, water, juices, sports drinks, milk-based beverages, spirits and beer, sauces, dressings, spreads, and personal care items; and plastic caps for various applications. It sells its products through its direct sales force. The company was incorporated in 1926 and is headquartered in Zurich, Switzerland.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"Snap Inc.","Symbol":"SNAP","Current Price":"11.15","Latest MA":"11.39","Price Target":13.142,"Difference from MA":"-2.06%","Difference from Open":"1.41%","Change from Yesterday":"-1.24%","Change from Last Report":"0.00","Latest Volume":"5,256,899","Market Cap":"18,708,942,848","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":27.354948,"PB Ratio":8.437821,"Previous Close":11.29,"ROE":-0.4062,"DTE":191.874,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":0.995,"Trailing PEG":496.0591,"Trailing PE":"N\/A","Trailing PS":3.621972,"Quick Ratio":3.861,"Day High":11.275,"Day Low":10.955,"VS Average Volume":0.1872716258,"Company Summary":"Snap Inc. operates as a technology company in North America, Europe, and internationally. The company offers Snapchat, a visual messaging application with various tabs, such as camera, visual messaging, snap map, stories, and spotlight that enable people to communicate visually through short videos and images. It also provides Spectacles, an eyewear product that connects with Snapchat and captures photos and video from a human perspective; and advertising products, including AR ads and Snap ads comprises a single image or video ads, collection ads, dynamic ads, story ads, and commercials. The company was formerly known as Snapchat, Inc. and changed its name to Snap Inc. in September 2016. Snap Inc. was founded in 2010 and is headquartered in Santa Monica, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"Chipotle Mexican Grill, Inc.","Symbol":"CMG","Current Price":"57.22","Latest MA":"57.83","Price Target":66.30719,"Difference from MA":"-1.05%","Difference from Open":"1.53%","Change from Yesterday":"-1.98%","Change from Last Report":"0.00","Latest Volume":"2,621,602","Market Cap":"77,967,400,960","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":43.273087,"PB Ratio":21.592453,"Previous Close":58.35,"ROE":0.45673,"DTE":124.061,"Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":1.266,"Trailing PEG":2.0285,"Trailing PE":52.98148,"Trailing PS":7.097713,"Quick Ratio":1.486,"Day High":57.5006,"Day Low":56.61,"VS Average Volume":0.2993818004,"Company Summary":"Chipotle Mexican Grill, Inc., together with its subsidiaries, owns and operates Chipotle Mexican Grill restaurants. It sells food and beverages through offering burritos, burrito bowls, quesadillas, tacos, and salads. The company also provides delivery and related services its app and website. It has operations in the United States, Canada, France, Germany, Dubai, and the United Kingdom. Chipotle Mexican Grill, Inc. was founded in 1993 and is headquartered in Newport Beach, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"03-02-2025 17:23:16"},{"Company Name":"CNH Industrial N.V.","Symbol":"CNH","Current Price":"12.37","Latest MA":"10.97","Price Target":14.19474,"Difference from MA":"12.74%","Difference from Open":"-0.56%","Change from Yesterday":"-4.08%","Change from Last Report":"0.00","Latest Volume":"4,741,474","Market Cap":"15,449,756,672","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":14.663924,"PB Ratio":2.021556,"Previous Close":12.88,"ROE":0.22186,"DTE":356.262,"Industry":"Farm & Heavy Construction Machinery","Sector":"Industrials","Beta":1.597,"Trailing PEG":null,"Trailing PE":9.095514,"Trailing PS":0.7102683,"Quick Ratio":3.87,"Day High":12.46,"Day Low":12.23,"VS Average Volume":0.3859841755,"Company Summary":"CNH Industrial N.V., an equipment and services company, engages in the design, production, marketing, sale, and financing of agricultural and construction equipment in North America, Europe, the Middle East, Africa, South America, and the Asia Pacific. The company operates through three segments: Agriculture, Construction, and Financial Services. The Agriculture segment designs, manufactures, and distributes farm machinery and implements, including two-wheel and four-wheel drive tractors, crawler tractors, combines, grape and sugar cane harvesters, hay and forage equipment, planting and seeding equipment, soil preparation and cultivation implements, material handling equipment, and precision agriculture technology. This segment sells its agricultural equipment under the New Holland Agriculture and Case IH brands. The Construction segment designs, manufactures, and distributes construction equipment comprising excavators, crawler dozers, graders, wheel loaders, backhoe loaders, skid steer loaders, and compact track loaders under the CASE Construction Equipment, New Holland Construction, and Eurocomach brands. The Financial Services segment offers financing to end-use customers for the purchase of new and used agricultural and construction equipment and components, as well as revolving charge account financing and other financial services. It also provides wholesale financing to CNH Industrial brand dealers and distributors; trade receivables factoring services to CNH companies; and financial services to Iveco Group companies in the North America, South America, and Asia Pacific regions. The company was founded in 1842 and is headquartered in Basildon, the United Kingdom.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"03-02-2025 17:23:16"}]