[{"Company Name":"Western Digital Corporation","Symbol":"WDC","Current Price":"65.35","Latest MA":"66.61","Price Target":83.75,"Difference from MA":"-1.90%","Difference from Open":"-1.66%","Change from Yesterday":"3.84%","Change from Last Report":"0.37","Latest Volume":"3,270,011","Market Cap":"22,592,016,384","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":8.545153,"PB Ratio":1.9420503,"ROE":0.033239998,"DTE":"N\/A","Industry":"Computer Hardware","Sector":"Technology","Beta":1.394,"Trailing PEG":null,"Trailing PE":18.887283,"Trailing PS":1.574576,"Quick Ratio":0.683,"Day High":67.59,"Day Low":64.25,"VS Average Volume":0.6020303636,"Company Summary":"Western Digital Corporation develops, manufactures, and sells data storage devices and solutions in the United States, China, Hong Kong, Europe, the Middle East, Africa, rest of Asia, and internationally. It offers client devices, including hard disk drives (HDDs) and solid state drives (SSDs) for desktop and notebook personal computers (PCs), gaming consoles, and set top boxes; and flash-based embedded storage products for mobile phones, tablets, notebook PCs, and other portable and wearable devices, as well as automotive, Internet of Things, industrial, and connected home applications. The company also provides enterprise HDDs; enterprise SSDs consisting of flash-based SSDs and software solutions for use in enterprise servers, online transactions, artificial intelligence-related workloads, data analysis, and other enterprise applications; and data storage platforms. In addition, it offers external HDD storage products in mobile and desktop form; client portable SSDs; removable cards that are used in consumer devices comprising mobile phones, tablets, imaging systems, and cameras and smart video systems; universal serial bus flash drives for use in the computing and consumer markets; and wireless drive products used in-field backup of created content, as well as wireless streaming of high-definition movies, photos, music, documents to tablets, smartphones, and PCs. The company sells its products under the Western Digital, SanDisk, and WD brands to original equipment manufacturers, distributors, dealers, resellers, and retailers. Western Digital Corporation was founded in 1970 and is headquartered in San Jose, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 16:56:16"},{"Company Name":"Teradyne, Inc.","Symbol":"TER","Current Price":"107.07","Latest MA":"127.38","Price Target":142.66058,"Difference from MA":"-15.95%","Difference from Open":"4.66%","Change from Yesterday":"-11.38%","Change from Last Report":"0.02","Latest Volume":"2,019,790","Market Cap":"17,437,526,016","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":17.422476,"PB Ratio":6.011453,"ROE":0.19206,"DTE":2.738,"Industry":"Semiconductor Equipment & Materials","Sector":"Technology","Beta":1.515,"Trailing PEG":1.2544,"Trailing PE":34.098724,"Trailing PS":6.369652,"Quick Ratio":1.742,"Day High":109.53,"Day Low":100.77,"VS Average Volume":0.8262501606,"Company Summary":"Teradyne, Inc. designs, develops, manufactures, and sells automated test systems and robotics products worldwide. It operates through four segments; Semiconductor Test, System Test, Robotics, and Wireless Test. The Semiconductor Test segment offers products and services for wafer level and device package testing of semiconductor devices in automotive, industrial, communications, consumer, smartphones, cloud, computer and electronic game, and other applications. This segment also provides FLEX test platform systems; J750 test system to address the volume semiconductor devices, including microcontrollers; Magnum platform that tests memory devices, such as flash memory and DRAM; and ETS platform for semiconductor manufacturers, and assembly and test subcontractors in the analog\/mixed signal markets. It serves integrated device manufacturers that integrate the fabrication of silicon wafers into their business; fabless companies that outsource the manufacturing of silicon wafers; foundries; and semiconductor assembly and test providers. The System Test segment offers defense\/aerospace test instrumentation and systems; storage and system level test systems; and circuit-board test and inspection systems. The Wireless Test segment provides wireless test solutions for silicon validation, wireless module manufacturing, and wireless end device manufacturing under the LitePoint brand. This segment also offers IQxel-MX and IQxel-MW7G series products for edge measurement performance in the manufacturing of connectivity products; IQxstream-5G and IQgig-5G family products to support 4G and 5G technologies; and IQgig-UWB+ for certification and manufacturing test support for ultra wideband products. The Robotics segment provides collaborative robotic arms, autonomous mobile robots, and advanced robotic control software for manufacturing, logistics, and industrial customers. The company was incorporated in 1960 and is headquartered in North Reading, Massachusetts.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 16:56:16"},{"Company Name":"Tesla, Inc.","Symbol":"TSLA","Current Price":"390.25","Latest MA":"289.76","Price Target":323.97952,"Difference from MA":"34.68%","Difference from Open":"-4.93%","Change from Yesterday":"0.75%","Change from Last Report":"-3.04","Latest Volume":"21,142,750","Market Cap":"1,252,742,004,736","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":97.0535,"PB Ratio":17.89668,"ROE":0.20389,"DTE":18.078,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":2.295,"Trailing PEG":4.7684,"Trailing PE":193.19554,"Trailing PS":12.894925,"Quick Ratio":1.214,"Day High":412.5,"Day Low":390.22,"VS Average Volume":0.2353914959,"Company Summary":"Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners; and provision of service and repairs to its energy product customers, including under warranty, as well as various financing options to its solar customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was incorporated in 2003 and is headquartered in Austin, Texas.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"30-01-2025 16:56:16"},{"Company Name":"Microsoft Corporation","Symbol":"MSFT","Current Price":"420.40","Latest MA":"426.75","Price Target":508.1818,"Difference from MA":"-1.49%","Difference from Open":"0.46%","Change from Yesterday":"-4.70%","Change from Last Report":"0.58","Latest Volume":"12,361,007","Market Cap":"3,125,624,176,640","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":27.950369,"PB Ratio":11.6405945,"ROE":0.35604,"DTE":33.657,"Industry":"Software - Infrastructure","Sector":"Technology","Beta":0.904,"Trailing PEG":2.3451,"Trailing PE":33.821407,"Trailing PS":12.29641,"Quick Ratio":1.163,"Day High":422.86,"Day Low":414.74,"VS Average Volume":0.5666161124,"Company Summary":"Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services. This segment also provides LinkedIn; and dynamics business solutions, including Dynamics 365, a set of intelligent, cloud-based applications across ERP, CRM, power apps, and power automate; and on-premises ERP and CRM applications. The Intelligent Cloud segment offers server products and cloud services, such as azure and other cloud services; SQL and windows server, visual studio, system center, and related client access licenses, as well as nuance and GitHub; and enterprise services including enterprise support services, industry solutions, and nuance professional services. The More Personal Computing segment offers Windows, including windows OEM licensing and other non-volume licensing of the Windows operating system; Windows commercial comprising volume licensing of the Windows operating system, windows cloud services, and other Windows commercial offerings; patent licensing; and windows Internet of Things; and devices, such as surface, HoloLens, and PC accessories. Additionally, this segment provides gaming, which includes Xbox hardware and content, and first- and third-party content; Xbox game pass and other subscriptions, cloud gaming, advertising, third-party disc royalties, and other cloud services; and search and news advertising, which includes Bing, Microsoft News and Edge, and third-party affiliates. The company sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online, and retail stores. The company was founded in 1975 and is headquartered in Redmond, Washington.","Stock Sentiment":"Strong Buy","Row Color":"negative-row","Last Updated":"30-01-2025 16:56:16"},{"Company Name":"Tetra Tech, Inc.","Symbol":"TTEK","Current Price":"31.58","Latest MA":"43.94","Price Target":44.5,"Difference from MA":"-28.12%","Difference from Open":"-7.88%","Change from Yesterday":"-15.66%","Change from Last Report":"-16.17","Latest Volume":"1,613,490","Market Cap":"8,464,324,096","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":19.394104,"PB Ratio":4.5934544,"ROE":0.18655,"DTE":55.515,"Industry":"Engineering & Construction","Sector":"Industrials","Beta":0.939,"Trailing PEG":null,"Trailing PE":25.674797,"Trailing PS":1.9987637,"Quick Ratio":1.111,"Day High":35.185,"Day Low":31.09,"VS Average Volume":0.6755693597,"Company Summary":"Tetra Tech, Inc. provides consulting and engineering services in the United States and internationally. The company operates through two segments, Government Services Group (GSG) and Commercial\/International Services Group (CIG). The GSG segment offers early data collection and monitoring, data analysis and information management, science and engineering applied research, engineering design, project management, and operations and maintenance services; and climate change and energy management consulting, as well as greenhouse gas inventory assessment, certification, reduction, and management services. This segment serves federal, state, and local governments; and development agencies in water resources analysis and water management, environmental monitoring, data analytics, government consulting, waste management, and a range of civil infrastructure master planning and engineering design markets. The CIG segment provides early data collection and monitoring, data analysis and information management, feasibility studies and assessments, science and engineering applied research, engineering design, project management, and operations and maintenance services; and environmental remediation and reconstruction services, and industrial water treatment services. This segment serves natural resources, energy, and utilities markets, as well as sustainable infrastructure master planning and engineering design for facilities, transportation, and local development projects. Tetra Tech, Inc. was founded in 1966 and is headquartered in Pasadena, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 16:56:16"},{"Company Name":"Las Vegas Sands Corp.","Symbol":"LVS","Current Price":"47.77","Latest MA":"46.19","Price Target":58.62889,"Difference from MA":"3.42%","Difference from Open":"0.56%","Change from Yesterday":"10.29%","Change from Last Report":"0.79","Latest Volume":"2,386,308","Market Cap":"34,630,864,896","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":16.12974,"PB Ratio":10.106856,"ROE":0.45166,"DTE":384.206,"Industry":"Resorts & Casinos","Sector":"Consumer Cyclical","Beta":1.117,"Trailing PEG":0.6553,"Trailing PE":24.369898,"Trailing PS":3.0600746,"Quick Ratio":0.864,"Day High":48.06,"Day Low":46.5358,"VS Average Volume":0.4934807325,"Company Summary":"Las Vegas Sands Corp., together with its subsidiaries, develops, owns, and operates integrated resorts in Macao and Singapore. It owns and operates The Venetian Macao Resort Hotel, the Londoner Macao, The Parisian Macao, The Plaza Macao and Four Seasons Hotel Macao, Cotai Strip, and the Sands Macao in Macao, the People's Republic of China; and Marina Bay Sands in Singapore. The company's integrated resorts feature accommodations, gaming, entertainment and retail malls, convention and exhibition facilities, celebrity chef restaurants, and other amenities. Las Vegas Sands Corp. was founded in 1988 and is based in Las Vegas, Nevada.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 16:56:16"},{"Company Name":"Levi Strauss & Co","Symbol":"LEVI","Current Price":"17.64","Latest MA":"18.18","Price Target":21.21571,"Difference from MA":"-2.95%","Difference from Open":"3.76%","Change from Yesterday":"-4.37%","Change from Last Report":"-2.49","Latest Volume":"1,266,412","Market Cap":"6,983,301,120","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":11.999932,"PB Ratio":3.7364752,"ROE":0.08122,"DTE":120.196,"Industry":"Apparel Manufacturing","Sector":"Consumer Cyclical","Beta":1.173,"Trailing PEG":null,"Trailing PE":46.42079,"Trailing PS":1.1340394,"Quick Ratio":0.646,"Day High":18.86,"Day Low":16.77,"VS Average Volume":0.7125169773,"Company Summary":"Levi Strauss & Co. designs, markets, and sells apparels and related accessories for men, women, and children worldwide. The company offers jeans, casual and dress pants, activewears, tops, shorts, skirts, dresses, jumpsuits, shirts, sweaters, jackets, footwear, and related accessories under the Levi's, Dockers, Signature by Levi Strauss & Co., Denizen, and Beyond Yoga brands. It also licenses Levi's and Dockers trademarks for various product categories, including footwear, belts, wallets, bags, outerwear, sweaters, dress shirts, kids wear, sleepwear, and hosiery. In addition, the company sells its products through third-party retailers, such as department stores, specialty retailers, third-party e-commerce sites, and franchisees; and directly to consumers through various formats, including company-operated mainline and outlet stores, company-operated e-commerce sites, and select shop-in-shops located in department stores and other third-party retail locations. Further, it operates brand-dedicated stores and shop-in-shops. The company was founded in 1853 and is headquartered in San Francisco, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 16:56:16"},{"Company Name":"Alibaba Group Holding Limited","Symbol":"BABA","Current Price":"97.73","Latest MA":"87.63","Price Target":120.953445,"Difference from MA":"11.52%","Difference from Open":"0.44%","Change from Yesterday":"1.51%","Change from Last Report":"-0.01","Latest Volume":"3,484,193","Market Cap":"232,201,617,408","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":1.3787127,"PB Ratio":0.24108365,"ROE":0.05668,"DTE":22.796,"Industry":"Internet Retail","Sector":"Consumer Cyclical","Beta":0.349,"Trailing PEG":0.6431,"Trailing PE":20.109055,"Trailing PS":0.24435896,"Quick Ratio":0.97,"Day High":98.67,"Day Low":97.14,"VS Average Volume":0.2248102865,"Company Summary":"Alibaba Group Holding Limited, through its subsidiaries, provides technology infrastructure and marketing reach to help merchants, brands, retailers, and other businesses to engage with their users and customers in the People's Republic of China and internationally. The company operates through seven segments: China Commerce, International Commerce, Local Consumer Services, Cainiao, Cloud, Digital Media and Entertainment, and Innovation Initiatives and Others. It operates Taobao and Tmall, which are digital retail platforms; Alimama, a proprietary monetization platform; 1688.com and Alibaba.com, which are online wholesale marketplaces; AliExpress, a retail marketplace; Lazada, Trendyol, and Daraz that are e-commerce platforms; Freshippo, a retail platform for groceries and fresh goods; and Tmall Global, an import e-commerce platform. The company also operates Cainiao Network logistic services platform; Ele.me, an on-demand delivery and local services platform; Koubei, a restaurant and local services guide platform; and Fliggy, an online travel platform. In addition, it offers pay-for-performance, in-feed, and display marketing services; and Taobao Ad Network and Exchange, a real-time online bidding marketing exchange. Further, the company provides elastic computing, storage, network, security, database, big data, and IoT services; and hardware, software license, software installation, and application development and maintenance services. Additionally, it operates Youku, an online video platform; Quark, a platform for information search, storage, and consumption; Alibaba Pictures and other content platforms that provide online videos, films, live events, news feeds, literature, music, and others; Amap, a mobile digital map, navigation, and real-time traffic information app; DingTalk, a business efficiency mobile app; and Tmall Genie smart speaker. The company was incorporated in 1999 and is based in Hangzhou, the People's Republic of China.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 16:56:16"},{"Company Name":"Meta Platforms, Inc.","Symbol":"META","Current Price":"703.88","Latest MA":"559.44","Price Target":717.7861,"Difference from MA":"25.82%","Difference from Open":"1.01%","Change from Yesterday":"4.36%","Change from Last Report":"2.27","Latest Volume":"7,977,070","Market Cap":"1,776,937,992,192","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":24.21666,"PB Ratio":10.798025,"ROE":0.36134,"DTE":29.811,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.215,"Trailing PEG":1.4368,"Trailing PE":29.475714,"Trailing PS":11.374078,"Quick Ratio":2.568,"Day High":709.86,"Day Low":687.43,"VS Average Volume":0.6007369035,"Company Summary":"Meta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and wearables worldwide. It operates in two segments, Family of Apps and Reality Labs. The Family of Apps segment offers Facebook, which enables people to share, discuss, discover, and connect with interests; Instagram, a community for sharing photos, videos, and private messages, as well as feed, stories, reels, video, live, and shops; Messenger, a messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls; and WhatsApp, a messaging application that is used by people and businesses to communicate and transact privately. The Reality Labs segment provides augmented and virtual reality related products comprising consumer hardware, software, and content that help people feel connected, anytime, and anywhere. The company was formerly known as Facebook, Inc. and changed its name to Meta Platforms, Inc. in October 2021. The company was incorporated in 2004 and is headquartered in Menlo Park, California","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 16:56:16"},{"Company Name":"International Business Machines","Symbol":"IBM","Current Price":"258.42","Latest MA":"209.23","Price Target":231.32529,"Difference from MA":"23.51%","Difference from Open":"3.37%","Change from Yesterday":"12.87%","Change from Last Report":"3.51","Latest Volume":"3,703,487","Market Cap":"238,946,779,136","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":22.6948,"PB Ratio":9.773828,"ROE":0.26729,"DTE":245.112,"Industry":"Information Technology Services","Sector":"Technology","Beta":0.71,"Trailing PEG":7.571,"Trailing PE":40.25234,"Trailing PS":3.8182611,"Quick Ratio":0.896,"Day High":258.535,"Day Low":247.01,"VS Average Volume":0.9474763424,"Company Summary":"International Business Machines Corporation, together with its subsidiaries, provides integrated solutions and services worldwide. The company operates through Software, Consulting, Infrastructure, and Financing segments. The Software segment offers a hybrid cloud and AI platforms that allows clients to realize their digital and AI transformations across the applications, data, and environments in which they operate. The Consulting segment focuses on skills integration for strategy, experience, technology, and operations by domain and industry. The Infrastructure segment provides on-premises and cloud based server, and storage solutions, as well as life-cycle services for hybrid cloud infrastructure deployment. The Financing segment offers client and commercial financing, facilitates IBM clients' acquisition of hardware, software, and services. The company has a strategic partnership to various companies including hyperscalers, service providers, global system integrators, and software and hardware vendors that includes Adobe, Amazon Web services, Microsoft, Oracle, Salesforce, Samsung Electronics and SAP, and others. The company was formerly known as Computing-Tabulating-Recording Co. International Business Machines Corporation was incorporated in 1911 and is headquartered in Armonk, New York.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"30-01-2025 16:56:16"},{"Company Name":"SiriusXM Holdings Inc.","Symbol":"SIRI","Current Price":"22.66","Latest MA":"27.22","Price Target":24.69231,"Difference from MA":"-16.77%","Difference from Open":"3.02%","Change from Yesterday":"3.50%","Change from Last Report":"-1.88","Latest Volume":"2,078,035","Market Cap":"7,684,621,312","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.0907674,"PB Ratio":0.7072615,"ROE":-0.46799,"DTE":98.775,"Industry":"Entertainment","Sector":"Communication Services","Beta":1.05,"Trailing PEG":0.1852,"Trailing PE":"N\/A","Trailing PS":0.8733517,"Quick Ratio":0.26,"Day High":23.13,"Day Low":21.99,"VS Average Volume":0.3719567585,"Company Summary":"Sirius XM Holdings Inc. operates as an audio entertainment company in North America. It operates in two segments, Sirius XM, and Pandora and Off-platform. The company's Sirius XM segment provides music, sports, entertainment, comedy, talk, news, traffic and weather channels, and other content, as well as podcast and infotainment services on subscription fee basis; and live, curated, and exclusive and on demand programming services through satellite radio systems and streamed through applications for mobile and home devices, and other consumer electronic equipment. This segment also distributes satellite radios through automakers and retailers, as well as its website; podcasts, including true crime, news, politics, music, comedy, sports, and entertainment; and offers location-based services through two-way wireless connectivity, including safety, security, convenience, maintenance and data, remote vehicles diagnostic, and stolen or parked vehicle locator services. In addition, this segment provides music channels on the DISH Network satellite television service as a programming package; Travel Link, a suite of data services that include graphical weather, fuel prices, sports schedule and scores, and movie listings; graphic information related to road closings, traffic flow, and incident data for consumers with in-vehicle navigation systems; real-time weather services in vehicles, boats, and planes; and music programming and commercial-free music services for office, restaurants, and other business. Its Pandora and Off-platform segment operates music, comedy, and podcast streaming platform, which offers personalized experience for listener through computers, tablets, mobile devices, vehicle speakers, and connected devices; and provides advertising services. The company was incorporated in 2013 and is headquartered in New York.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"30-01-2025 16:56:16"},{"Company Name":"ServiceNow, Inc.","Symbol":"NOW","Current Price":"1008.79","Latest MA":"935.04","Price Target":1140.2083,"Difference from MA":"7.89%","Difference from Open":"-1.78%","Change from Yesterday":"-11.56%","Change from Last Report":"-11.79","Latest Volume":"1,163,490","Market Cap":"208,130,506,752","Earning Date":"2025-01-29","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":50.44512,"PB Ratio":22.403616,"ROE":0.16221,"DTE":24.166,"Industry":"Software - Application","Sector":"Technology","Beta":0.986,"Trailing PEG":3.0939,"Trailing PE":147.05392,"Trailing PS":19.890148,"Quick Ratio":0.973,"Day High":1031.0,"Day Low":1002.0,"VS Average Volume":0.9226607751,"Company Summary":"ServiceNow, Inc. provides end to-end intelligent workflow automation platform solutions for digital businesses in the North America, Europe, the Middle East and Africa, Asia Pacific, and internationally. The company operates the Now platform for end-to-end digital transformation, artificial intelligence, machine learning, robotic process automation, process mining, performance analytics, and collaboration and development tools. It also provides asset management, cloud observability, integrated risk management; information technology (IT) service management applications; IT service management product suite for enterprise's employees, customers, and partners; strategic portfolio management product suite; IT operations management product that connects a customer's physical and cloud-based IT infrastructure; IT asset management; and security operations that connects with internal and third party. In addition, the company offers integrated risk management product to manage risk and resilience; environmental, social and governance management product; human resources, legal, and workplace service delivery products; customer service management product; and field service management applications. Further, the company provides app engine product; automation engine; platform privacy and security product; and source-to-pay operations. It serves to government, financial services, healthcare, telecommunications, manufacturing, IT services, technology, oil and gas, education, and consumer products through service providers and resale partners. ServiceNow, Inc. has strategic collaboration with Amazon Web Services, Inc. to accelerate AI-driven business transformation. The company was formerly known as Service-now.com and changed its name to ServiceNow, Inc. in May 2012. ServiceNow, Inc. was founded in 2004 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 16:56:16"},{"Company Name":"General Motors Company","Symbol":"GM","Current Price":"50.59","Latest MA":"49.48","Price Target":60.05308,"Difference from MA":"2.24%","Difference from Open":"0.28%","Change from Yesterday":"1.41%","Change from Last Report":"1.63","Latest Volume":"1,432,954","Market Cap":"50,337,148,928","Earning Date":"2025-01-28","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":4.412587,"PB Ratio":0.7845114,"ROE":0.14167,"DTE":174.581,"Industry":"Auto Manufacturers","Sector":"Consumer Cyclical","Beta":1.414,"Trailing PEG":7.6221,"Trailing PE":7.9419155,"Trailing PS":0.2754894,"Quick Ratio":0.948,"Day High":50.89,"Day Low":49.94,"VS Average Volume":0.1269639621,"Company Summary":"General Motors Company designs, builds, and sells trucks, crossovers, cars, and automobile parts; and provide software-enabled services and subscriptions worldwide. The company operates through GM North America, GM International, Cruise, and GM Financial segments. It markets its vehicles primarily under the Buick, Cadillac, Chevrolet, GMC, Baojun, and Wuling brand names. In addition, the company sells trucks, crossovers, cars, and automobile parts through retail dealers, and distributors and dealers, as well as to fleet customers, including daily rental car companies, commercial fleet customers, leasing companies, and governments. Further, it offers range of after-sale services through dealer network, such as maintenance, light repairs, collision repairs, vehicle accessories, and extended service warranties. Additionally, the company provides automotive financing; and software-enabled services and subscriptions. General Motors Company was founded in 1908 and is headquartered in Detroit, Michigan.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 16:56:16"},{"Company Name":"Starbucks Corporation","Symbol":"SBUX","Current Price":"109.50","Latest MA":"91.22","Price Target":105.604,"Difference from MA":"20.04%","Difference from Open":"0.46%","Change from Yesterday":"0.75%","Change from Last Report":"0.85","Latest Volume":"2,101,971","Market Cap":"124,384,329,728","Earning Date":"2025-01-28","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":29.899324,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Restaurants","Sector":"Consumer Cyclical","Beta":0.962,"Trailing PEG":2.2714,"Trailing PE":35.209003,"Trailing PS":3.4382918,"Quick Ratio":0.524,"Day High":109.88,"Day Low":108.04,"VS Average Volume":0.2440553644,"Company Summary":"Starbucks Corporation, together with its subsidiaries, operates as a roaster, marketer, and retailer of coffee worldwide. The company operates through three segments: North America, International, and Channel Development. Its stores offer coffee, tea, and other beverages, roasted whole beans and ground coffees, single serve products, and ready-to-drink beverages; and various food products, such as pastries, breakfast sandwiches, and lunch items. The company also licenses its trademarks through licensed stores, and grocery and foodservice accounts. The company offers its products under the Starbucks Coffee, Teavana, Seattle's Best Coffee, Ethos, and Starbucks Reserve brands. Starbucks Corporation was founded in 1971 and is based in Seattle, Washington.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 16:56:16"},{"Company Name":"SoFi Technologies, Inc.","Symbol":"SOFI","Current Price":"16.56","Latest MA":"10.78","Price Target":13.29375,"Difference from MA":"53.61%","Difference from Open":"1.91%","Change from Yesterday":"3.63%","Change from Last Report":"1.16","Latest Volume":"6,818,473","Market Cap":"18,139,052,032","Earning Date":"2025-01-27","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":35.664078,"PB Ratio":2.9330323,"ROE":0.037249997,"DTE":54.394,"Industry":"Credit Services","Sector":"Financial Services","Beta":1.613,"Trailing PEG":null,"Trailing PE":42.461285,"Trailing PS":7.2002907,"Quick Ratio":0.47,"Day High":16.67,"Day Low":16.11,"VS Average Volume":0.1392544046,"Company Summary":"SoFi Technologies, Inc. provides various financial services in the United States, Latin America, and Canada. It operates through three segments: Lending, Technology Platform, and Financial Services. The company offers lending and financial services and products that allows its members to borrow, save, spend, invest, and protect money. It offers personal loans, student loans, home loans, and related services. The company also operates Galileo, a technology platform that offers services to financial and non-financial institution; and Technisys, a cloud-native digital and core banking platform with financial services customers. In addition, it provides SoFi Money offers checking and savings accounts, debit cards, and cash management products; and SoFi Invest, a mobile-first investment platform that provides access to trading and advisory solutions, such as investing and robo-advisory. Further, the company offers SoFi Credit Card that provides cash backs on every purchase; Sofi Relay, a personal finance management product that allows to track all of their financial accounts comprising credit score and spending behaviors; SoFi Protect, which offers insurance product; SoFi Travel, an application that manages travel search and booking experience; SoFi At Work provides financial benefits to employees, including student loan payments made on their employees' behalf; Lantern Credit, a financial services marketplace platform for seeking alternative products and provide product comparisons; and other lending as a service that offers pre-qualified borrower referrals and sells loans to third-party partner. The company was founded in 2011 and is based in San Francisco, California.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"30-01-2025 16:56:16"},{"Company Name":"AT&T Inc.","Symbol":"T","Current Price":"23.97","Latest MA":"20.96","Price Target":26.61885,"Difference from MA":"14.37%","Difference from Open":"-0.81%","Change from Yesterday":"-1.20%","Change from Last Report":"-0.29","Latest Volume":"6,138,176","Market Cap":"172,008,718,336","Earning Date":"2025-01-27","Earning Time":"Before","Earning Day of Week":"Monday","PE Ratio":10.702708,"PB Ratio":1.6802187,"ROE":0.08759,"DTE":125.151,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.73,"Trailing PEG":4.1158,"Trailing PE":16.087248,"Trailing PS":1.4092145,"Quick Ratio":0.42,"Day High":24.2,"Day Low":23.89,"VS Average Volume":0.1708985347,"Company Summary":"AT&T Inc. provides telecommunications and technology services worldwide. The company operates through two segments, Communications and Latin America. The Communications segment offers wireless voice and data communications services; and sells handsets, wireless data cards, wireless computing devices, carrying cases\/protective covers, and wireless chargers through its own company-owned stores, agents, and third-party retail stores. It also provides Virtual Private Networks, AT&T Dedicated Internet, Ethernet, data services, cloud solutions, outsourcing, and managed professional services, as well as customer premises equipment for multinational corporations, small and mid-sized businesses, governmental, and wholesale customers. In addition, this segment offers broadband services, including fiber connections, legacy telephony voice communication services, and other VoIP services and equipment to residential customers. This segment markets its communications services and products under the AT&T, AT&T Business, Cricket, AT&T PREPAID, and AT&T Fiber brand names. The Latin America segment provides postpaid and prepaid wireless services in Mexico under the AT&T and Unefon brand names, as well as sells smartphones through its owned stores, agents and third-party retail stores. The company was formerly known as SBC Communications Inc. and changed its name to AT&T Inc. in 2005. AT&T Inc. was incorporated in 1983 and is based in Dallas, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 16:56:16"},{"Company Name":"Verizon Communications Inc.","Symbol":"VZ","Current Price":"39.37","Latest MA":"40.58","Price Target":47.66043,"Difference from MA":"-2.99%","Difference from Open":"-2.44%","Change from Yesterday":"-2.52%","Change from Last Report":"-1.33","Latest Volume":"4,433,109","Market Cap":"165,712,084,992","Earning Date":"2025-01-24","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":8.077556,"PB Ratio":1.720348,"ROE":0.10431,"DTE":182.615,"Industry":"Telecom Services","Sector":"Communication Services","Beta":0.418,"Trailing PEG":1.0831,"Trailing PE":9.508455,"Trailing PS":1.234474,"Quick Ratio":0.51,"Day High":40.29,"Day Low":39.35,"VS Average Volume":0.2212557515,"Company Summary":"Verizon Communications Inc., through its subsidiaries, engages in the provision of communications, technology, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide. It operates in two segments, Verizon Consumer Group (Consumer) and Verizon Business Group (Business). The Consumer segment provides wireless services across the wireless networks in the United States under the Verizon and TracFone brands and through wholesale and other arrangements; and fixed wireless access (FWA) broadband through its wireless networks, as well as related equipment and devices, such as smartphones, tablets, smart watches, and other wireless-enabled connected devices. The segment also offers wireline services in the Mid-Atlantic and Northeastern United States, as well as Washington D.C. through its fiber-optic network, Verizon Fios product portfolio, and a copper-based network. The Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and conferencing, corporate networking, security and managed network, local and long-distance voice, and network access services to deliver various IoT services and products to businesses, government customers, and wireless and wireline carriers in the United States and internationally. The company was formerly known as Bell Atlantic Corporation and changed its name to Verizon Communications Inc. in June 2000. Verizon Communications Inc. was incorporated in 1983 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 16:56:16"},{"Company Name":"American Airlines Group, Inc.","Symbol":"AAL","Current Price":"17.05","Latest MA":"13.11","Price Target":20.995,"Difference from MA":"30.06%","Difference from Open":"0.71%","Change from Yesterday":"-1.50%","Change from Last Report":"-0.50","Latest Volume":"9,307,947","Market Cap":"11,211,500,544","Earning Date":"2025-01-23","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":5.5522623,"PB Ratio":"N\/A","ROE":"N\/A","DTE":"N\/A","Industry":"Airlines","Sector":"Industrials","Beta":1.399,"Trailing PEG":0.2392,"Trailing PE":13.749999,"Trailing PS":0.20911907,"Quick Ratio":0.422,"Day High":17.22,"Day Low":16.8,"VS Average Volume":0.341802178,"Company Summary":"American Airlines Group Inc., through its subsidiaries, operates as a network air carrier. The company provides scheduled air transportation services for passengers and cargo through its hubs in Charlotte, Chicago, Dallas\/Fort Worth, Los Angeles, Miami, New York, Philadelphia, Phoenix, and Washington, D.C., as well as through partner gateways in London, Doha, Madrid, Seattle\/Tacoma, Sydney, and Tokyo. It operates a mainline fleet of 965 aircraft. The company was formerly known as AMR Corporation and changed its name to American Airlines Group Inc. in December 2013. American Airlines Group Inc. was founded in 1926 and is headquartered in Fort Worth, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 16:56:16"},{"Company Name":"Lam Research Corporation","Symbol":"LRCX","Current Price":"79.20","Latest MA":"81.08","Price Target":91.08359,"Difference from MA":"-2.31%","Difference from Open":"-0.86%","Change from Yesterday":"5.41%","Change from Last Report":"0.90","Latest Volume":"5,972,600","Market Cap":"101,912,289,280","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":19.920624,"PB Ratio":12.092366,"ROE":0.49116,"DTE":58.827,"Industry":"Semiconductor Equipment & Materials","Sector":"Technology","Beta":1.486,"Trailing PEG":1.4446,"Trailing PE":24.074469,"Trailing PS":6.5364842,"Quick Ratio":1.685,"Day High":80.0,"Day Low":77.6,"VS Average Volume":0.5198906529,"Company Summary":"Lam Research Corporation designs, manufactures, markets, refurbishes, and services semiconductor processing equipment used in the fabrication of integrated circuits. The company offers ALTUS systems to deposit conformal films for tungsten metallization applications; SABRE electrochemical deposition products for copper interconnect transition that offers copper damascene manufacturing; and VECTOR plasma-enhanced CVD products. It also provides SPEED gapfill high-density plasma chemical vapor deposition products; and Striker single-wafer atomic layer deposition products for dielectric film solutions. In addition, the company offers Flex for dielectric etch applications; Vantex, a dielectric etch system that provides RF technology and repeatable wafer-to-wafer performance enabled by Equipment Intelligence solutions; Kiyo for conductor etch applications; Syndion for through-silicon via etch applications; and Versys metal products for metal etch processes. Further, it provides Coronus bevel clean products to enhance die yield; and Da Vinci, DV-Prime, EOS, and SP series products to address various wafer cleaning applications. The company sells its products in the United States, China, Europe, Japan, Korea, Southeast Asia, and Taiwan. Lam Research Corporation was incorporated in 1980 and is headquartered in Fremont, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 16:56:16"},{"Company Name":"Halliburton Company","Symbol":"HAL","Current Price":"26.40","Latest MA":"29.95","Price Target":34.41481,"Difference from MA":"-11.85%","Difference from Open":"-0.57%","Change from Yesterday":"0.10%","Change from Last Report":"0.11","Latest Volume":"1,151,002","Market Cap":"23,191,574,528","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":8.565959,"PB Ratio":2.2511299,"ROE":0.26293,"DTE":83.993,"Industry":"Oil & Gas Equipment & Services","Sector":"Energy","Beta":1.905,"Trailing PEG":1.7644,"Trailing PE":9.328269,"Trailing PS":1.0051391,"Quick Ratio":1.377,"Day High":26.6227,"Day Low":26.3,"VS Average Volume":0.1124412456,"Company Summary":"Halliburton Company provides products and services to the energy industry worldwide. It operates through two segments, Completion and Production, and Drilling and Evaluation. The Completion and Production segment offers production enhancement services that include stimulation and sand control services; cementing services, such as well bonding and casing, and casing equipment; and completion tools that offer downhole solutions and services, including well completion products and services, intelligent well completions, and service tools, as well as liner hanger, sand control, and multilateral systems. This segment also provides electrical submersible pumps, as well as artificial lift services; production solutions comprising coiled tubing, hydraulic workover units, downhole tools, and pumping and nitrogen services; pipeline and process services, such as pre-commissioning, commissioning, maintenance, and decommissioning; and specialty chemicals and services. The Drilling and Evaluation segment offers drilling fluid systems, performance additives, completion fluids, solids control, specialized testing equipment, and waste management services; drilling systems and services; wireline and perforating services consists of open-hole logging, and cased-hole and slickline; and drill bits and services comprising roller cone rock bits, fixed cutter bits, hole enlargement, and related downhole tools and services, as well as coring equipment and services. This segment also provides cloud based digital services and artificial intelligence solutions on an open architecture for subsurface insights, integrated well construction, and reservoir and production management; testing and subsea services, such as acquisition and analysis of reservoir information and optimization solutions; and project management and integrated asset management services. Halliburton Company was founded in 1919 and is based in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 16:56:16"},{"Company Name":"Kinder Morgan, Inc.","Symbol":"KMI","Current Price":"27.90","Latest MA":"23.97","Price Target":29.585,"Difference from MA":"16.38%","Difference from Open":"1.20%","Change from Yesterday":"2.09%","Change from Last Report":"2.20","Latest Volume":"1,550,438","Market Cap":"61,983,531,008","Earning Date":"2025-01-22","Earning Time":"After","Earning Day of Week":"Wednesday","PE Ratio":20.70002,"PB Ratio":2.0385723,"ROE":0.083500005,"DTE":101.433,"Industry":"Oil & Gas Midstream","Sector":"Energy","Beta":0.907,"Trailing PEG":1.999,"Trailing PE":23.84607,"Trailing PS":4.091052,"Quick Ratio":0.291,"Day High":27.9,"Day Low":27.5,"VS Average Volume":0.1084841572,"Company Summary":"Kinder Morgan, Inc. operates as an energy infrastructure company primarily in North America. The company operates through Natural Gas Pipelines, Products Pipelines, Terminals, and CO2 segments. The Natural Gas Pipelines segment owns and operates interstate and intrastate natural gas pipeline, and storage systems; natural gas gathering systems and natural gas processing and treating facilities; natural gas liquids fractionation facilities and transportation systems; and liquefied natural gas gasification, liquefaction, and storage facilities. The Products Pipelines segment owns and operates refined petroleum products, and crude oil and condensate pipelines; and associated product terminals and petroleum pipeline transmix facilities. The Terminals segment owns and\/or operates liquids and bulk terminals that stores and handles various commodities, including gasoline, diesel fuel, renewable fuel and feedstocks, chemicals, ethanol, metals, and petroleum coke; and owns tankers. The CO2 segment produces, transports, and markets CO2 to recovery and production crude oil from mature oil fields; owns interests in\/or operates oil fields and gasoline processing plants; and operates a crude oil pipeline system in West Texas, as well as owns and operates RNG and LNG facilities. It owns and operates approximately 82,000 miles of pipelines and 139 terminals. The company was formerly known as Kinder Morgan Holdco LLC and changed its name to Kinder Morgan, Inc. in February 2011. Kinder Morgan, Inc. was founded in 1997 and is headquartered in Houston, Texas.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 16:56:16"},{"Company Name":"GE Vernova Inc.","Symbol":"GEV","Current Price":"376.46","Latest MA":"266.74","Price Target":413.59042,"Difference from MA":"41.13%","Difference from Open":"3.14%","Change from Yesterday":"6.39%","Change from Last Report":"6.57","Latest Volume":"1,143,069","Market Cap":"103,774,085,120","Earning Date":"2025-01-22","Earning Time":"Before","Earning Day of Week":"Wednesday","PE Ratio":36.3663,"PB Ratio":10.9091835,"ROE":"N\/A","DTE":9.346,"Industry":"Utilities - Renewable","Sector":"Utilities","Beta":"N\/A","Trailing PEG":3.0616,"Trailing PE":67.46684,"Trailing PS":3.0147603,"Quick Ratio":0.717,"Day High":383.83,"Day Low":364.93,"VS Average Volume":0.3459007037,"Company Summary":"GE Vernova Inc., an energy company, engages in the provision of various products and services that generate, transfer, orchestrate, convert, and store electricity in the United States, Europe, Asia, the Americas, the Middle East, and Africa. The company operates through three segments: Power, Wind, and Electrification. The Power segment designs, manufactures, and services gas, nuclear, hydro, and steam technologies. The Wind segment offers wind generation technologies, including onshore and offshore wind turbines and blades. The Electrification segment provides grid solutions, power conversion, solar, and storage solutions; and electrification software for the transmission, distribution, conversion, storage, and orchestration of electricity from point of generation to point of consumption. The company was incorporated in 2023 and is headquartered in Cambridge, Massachusetts.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 16:56:16"},{"Company Name":"Huntington Bancshares Incorpora","Symbol":"HBAN","Current Price":"17.27","Latest MA":"15.29","Price Target":18.88889,"Difference from MA":"12.96%","Difference from Open":"-0.40%","Change from Yesterday":"0.70%","Change from Last Report":"0.58","Latest Volume":"1,050,903","Market Cap":"25,104,361,472","Earning Date":"2025-01-17","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":11.121201,"PB Ratio":1.3776324,"ROE":0.08545,"DTE":"N\/A","Industry":"Banks - Regional","Sector":"Financial Services","Beta":1.057,"Trailing PEG":2.903,"Trailing PE":14.155738,"Trailing PS":3.7525206,"Quick Ratio":"N\/A","Day High":17.39,"Day Low":17.24,"VS Average Volume":0.0655380403,"Company Summary":"Huntington Bancshares Incorporated operates as the bank holding company for The Huntington National Bank that provides commercial, consumer, and mortgage banking services in the United States. The company offers financial products and services to consumer and business customers, including deposits, lending, payments, mortgage banking, dealer financing, investment management, trust, brokerage, insurance, and other financial products and services. It also provides 24-hour grace, asterisk-free checking, money scout, $50 safety zone, standby cash, early pay, instant access, savings goal getter, and Huntington heads up; digitally powered consumer and business financial solutions to consumer lending, regional banking, branch banking, and wealth management customers; direct and indirect consumer loans, as well as dealer finance loans and deposits; and private banking, wealth management and legacy planning through investment and portfolio management, fiduciary administration and trust, institutional custody, and full-service retail brokerage investment services. The company offers equipment financing, asset-based lending, distribution finance, structured lending, and municipal financing solutions, as well as Huntington ChoicePay. In addition, it offers lending, liquidity, treasury management and other payment services, and capital markets; government and non-profits, healthcare, technology and telecommunications, franchises, financial sponsors, and global services; and corporate risk management, institutional sales and trading, debt and equity issuance, and additional advisory services. The company offers its products through a network of channels, including branches and ATMs, online and mobile banking, and through customer call centers to customers in middle market banking, corporate, specialty, and government banking, asset finance, commercial real estate banking, and capital markets. The company was founded in 1866 and is headquartered in Columbus, Ohio.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 16:56:16"},{"Company Name":"Bank of America Corporation","Symbol":"BAC","Current Price":"46.82","Latest MA":"42.24","Price Target":52.16667,"Difference from MA":"10.85%","Difference from Open":"-0.62%","Change from Yesterday":"0.20%","Change from Last Report":"-0.19","Latest Volume":"2,769,517","Market Cap":"356,340,465,664","Earning Date":"2025-01-16","Earning Time":"Before","Earning Day of Week":"Thursday","PE Ratio":10.813557,"PB Ratio":1.3236833,"ROE":0.08092,"DTE":"N\/A","Industry":"Banks - Diversified","Sector":"Financial Services","Beta":1.325,"Trailing PEG":2.0713,"Trailing PE":14.5856695,"Trailing PS":3.7657776,"Quick Ratio":"N\/A","Day High":47.16,"Day Low":46.7796,"VS Average Volume":0.0778506691,"Company Summary":"Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. It operates in four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, non-interest and interest-bearing checking accounts, and investment accounts and products; credit and debit cards; residential mortgages, and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research, and certain market-based services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 16:56:16"},{"Company Name":"Walgreens Boots Alliance, Inc.","Symbol":"WBA","Current Price":"11.53","Latest MA":"9.77","Price Target":12.414,"Difference from MA":"18.04%","Difference from Open":"2.22%","Change from Yesterday":"2.44%","Change from Last Report":"2.49","Latest Volume":"1,996,320","Market Cap":"9,963,683,840","Earning Date":"2025-01-10","Earning Time":"Before","Earning Day of Week":"Friday","PE Ratio":7.790488,"PB Ratio":0.9537596,"ROE":-0.75969005,"DTE":277.898,"Industry":"Pharmaceutical Retailers","Sector":"Healthcare","Beta":0.669,"Trailing PEG":null,"Trailing PE":"N\/A","Trailing PS":0.06747812,"Quick Ratio":0.332,"Day High":11.6,"Day Low":11.25,"VS Average Volume":0.0819684954,"Company Summary":"Walgreens Boots Alliance, Inc. operates as a healthcare, pharmacy, and retail company in the United States, Germany, the United Kingdom, and internationally. It operates through three segments: U.S. Retail Pharmacy, International, and U.S. Healthcare. The U.S. Retail Pharmacy segment engages in operation of the retail drugstores, health and wellness services, specialty, and home delivery pharmacy services, which offers health and wellness, beauty, personal care and consumables, and general merchandise. The International segment offers sale of prescription drugs and health and wellness, beauty, personal care, and other consumer products outside the United States; and operates pharmacy-led health and beauty retail businesses under the Boots brand stores in the United Kingdom, the Republic of Ireland, and Thailand, as well as the Benavides brand in Mexico and the Ahumada brand in Chile. The U.S. Healthcare segment provides VillageMD, a national provider of value-based care with primary, multi-specialty, and urgent care providers serving patients in traditional clinic settings, in patients' homes and online appointments; Shields, a specialty pharmacy integrator and accelerator for hospitals; and CareCentrix, a participant in the post-acute and home care management sectors. Walgreens Boots Alliance, Inc. was founded in 1909 and is headquartered in Deerfield, Illinois.","Stock Sentiment":"Hold","Row Color":"positive-row","Last Updated":"30-01-2025 16:56:16"},{"Company Name":"Alphabet Inc.","Symbol":"GOOGL","Current Price":"200.70","Latest MA":"174.36","Price Target":216.14644,"Difference from MA":"15.11%","Difference from Open":"1.36%","Change from Yesterday":"2.88%","Change from Last Report":"1.23","Latest Volume":"4,500,799","Market Cap":"2,466,823,536,640","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":22.308577,"PB Ratio":7.835864,"ROE":0.32101002,"DTE":9.324,"Industry":"Internet Content & Information","Sector":"Communication Services","Beta":1.034,"Trailing PEG":1.2782,"Trailing PE":26.618036,"Trailing PS":7.2583733,"Quick Ratio":1.761,"Day High":201.4,"Day Low":197.94,"VS Average Volume":0.1622641873,"Company Summary":"Alphabet Inc. offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube. It is also involved in the sale of apps and in-app purchases and digital content in the Google Play and YouTube; and devices, as well as in the provision of YouTube consumer subscription services. The Google Cloud segment offers infrastructure, cybersecurity, databases, analytics, AI, and other services; Google Workspace that include cloud-based communication and collaboration tools for enterprises, such as Gmail, Docs, Drive, Calendar, and Meet; and other services for enterprise customers. The Other Bets segment sells healthcare-related and internet services. The company was incorporated in 1998 and is headquartered in Mountain View, California.","Stock Sentiment":"Buy","Row Color":"positive-row","Last Updated":"30-01-2025 16:56:16"},{"Company Name":"Pfizer, Inc.","Symbol":"PFE","Current Price":"26.70","Latest MA":"27.17","Price Target":31.12955,"Difference from MA":"-1.75%","Difference from Open":"0.13%","Change from Yesterday":"0.24%","Change from Last Report":"0.28","Latest Volume":"2,144,505","Market Cap":"151,280,304,128","Earning Date":"2025-02-04","Earning Time":"Before","Earning Day of Week":"Tuesday","PE Ratio":9.140933,"PB Ratio":1.6389366,"ROE":0.04538,"DTE":73.408,"Industry":"Drug Manufacturers - General","Sector":"Healthcare","Beta":0.615,"Trailing PEG":0.1994,"Trailing PE":35.593334,"Trailing PS":2.5478787,"Quick Ratio":0.64,"Day High":26.755,"Day Low":26.58,"VS Average Volume":0.0491461368,"Company Summary":"Pfizer Inc. discovers, develops, manufactures, markets, distributes, and sells biopharmaceutical products in the United States, Europe, and internationally. The company offers medicines and vaccines in various therapeutic areas, including cardiovascular metabolic, migraine, and women's health under the Eliquis, Nurtec ODT\/Vydura, Zavzpret, and the Premarin family brands; infectious diseases with unmet medical needs under the Prevnar family, Abrysvo, Nimenrix, FSME\/IMMUN-TicoVac, and Trumenba brands; and COVID-19 prevention and treatment, and potential future mRNA and antiviral products under the Comirnaty and Paxlovid brands. It also provides medicines and vaccines in various therapeutic areas, such as biosimilars for chronic immune and inflammatory diseases under the Xeljanz, Enbrel, Inflectra, Litfulo, Velsipity, and Cibinqo brands; amyloidosis, hemophilia, endocrine diseases, and sickle cell disease under the Vyndaqel family, Oxbryta, BeneFIX, Somavert, Ngenla, and Genotropin brands; sterile injectable and anti-infective medicines under the Sulperazon, Medrol, Zavicefta, Zithromax, and Panzyga brands; and biologics, small molecules, immunotherapies, and biosimilars under the Ibrance, Xtandi, Inlyta, Bosulif, Mektovi, Padcev, Adcetris, Talzenna, Tukysa, Elrexfio, Tivdak, Lorbrena, and Braftovi brands. In addition, the company involved in the contract manufacturing business. It serves wholesalers, retailers, hospitals, clinics, government agencies, pharmacies, individual provider offices, retail pharmacies, and integrated delivery systems. The company has collaboration agreements with Bristol-Myers Squibb Company; Astellas Pharma US, Inc.; Merck KGaA; and BioNTech SE, as well as has strategic clinical collaboration with Acepodia Inc. for the development of antibody-cell conjugation-based cell therapies in autoimmune diseases. Pfizer Inc. was founded in 1849 and is headquartered in New York, New York.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 16:56:16"},{"Company Name":"Super Micro Computer, Inc.","Symbol":"SMCI","Current Price":"28.27","Latest MA":"47.17","Price Target":40.79182,"Difference from MA":"-40.07%","Difference from Open":"-1.08%","Change from Yesterday":"2.05%","Change from Last Report":"-0.05","Latest Volume":"3,532,897","Market Cap":"16,554,859,520","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":7.6630716,"PB Ratio":3.0334337,"ROE":0.32469,"DTE":39.749,"Industry":"Computer Hardware","Sector":"Technology","Beta":1.279,"Trailing PEG":null,"Trailing PE":14.065473,"Trailing PS":1.107878,"Quick Ratio":1.805,"Day High":28.63,"Day Low":28.11,"VS Average Volume":0.0477272346,"Company Summary":"Super Micro Computer, Inc., together with its subsidiaries, develops and manufactures high performance server and storage solutions based on modular and open architecture in the United States, Europe, Asia, and internationally. Its solutions range from complete server, storage systems, modular blade servers, blades, workstations, full racks, networking devices, server sub-systems, server management software, and security software. The company provides application-optimized server solutions, rackmount and blade servers, storage, and subsystems and accessories; and server software management solutions, such as Server Management Suite, including Supermicro Server Manager, Supermicro Power Management software, Supermicro Update Manager, SuperCloud Composer, and SuperDoctor 5. In addition, it offers server subsystems and accessories comprising server boards, chassis, power supplies, and other accessories. Further, the company provides server and storage system integration, configuration, and software upgrade and update services; and technical documentation services, as well as identifies service requirements, creates and executes project plans, and conducts verification testing and technical documentation, and training services. Additionally, it offers help desk and on-site product support services for its server and storage systems; and customer support services, including ongoing maintenance and technical support for its products. The company provides its products to enterprise data centers, cloud computing, artificial intelligence, and 5G and edge computing markets. It sells its products through direct and indirect sales force, distributors, value-added resellers, system integrators, and original equipment manufacturers. The company was incorporated in 1993 and is headquartered in San Jose, California.","Stock Sentiment":"Hold","Row Color":"negative-row","Last Updated":"30-01-2025 16:56:16"},{"Company Name":"Advanced Micro Devices, Inc.","Symbol":"AMD","Current Price":"119.55","Latest MA":"144.69","Price Target":169.81767,"Difference from MA":"-17.37%","Difference from Open":"0.91%","Change from Yesterday":"1.96%","Change from Last Report":"-0.25","Latest Volume":"5,300,661","Market Cap":"194,014,068,736","Earning Date":"2025-02-04","Earning Time":"After","Earning Day of Week":"Tuesday","PE Ratio":24.175358,"PB Ratio":3.405041,"ROE":0.03262,"DTE":3.927,"Industry":"Semiconductors","Sector":"Technology","Beta":1.706,"Trailing PEG":0.3245,"Trailing PE":105.800354,"Trailing PS":7.985761,"Quick Ratio":1.575,"Day High":120.44,"Day Low":118.48,"VS Average Volume":0.145954039,"Company Summary":"Advanced Micro Devices, Inc. operates as a semiconductor company worldwide. It operates through Data Center, Client, Gaming, and Embedded segments. The company offers x86 microprocessors and graphics processing units (GPUs) as an accelerated processing unit, chipsets, data center, and professional GPUs; and embedded processors, and semi-custom system-on-chip (SoC) products, microprocessor and SoC development services and technology, data processing unites, field programmable gate arrays (FPGA), and adaptive SoC products. It provides processors under the AMD Ryzen, AMD Ryzen PRO, Ryzen Threadripper, Ryzen Threadripper PRO, AMD Athlon, AMD Athlon PRO, and AMD PRO A-Series brand names; graphics under the AMD Radeon graphics and AMD Embedded Radeon graphics; and professional graphics under the AMD Radeon Pro graphics brand name. In addition, the company offers data center graphics under the Radeon Instinct and Radeon PRO V-series brands, as well as servers under the AMD Instinct accelerators brand; server microprocessors under the AMD EPYC brands; low power solutions under the AMD Athlon, AMD Geode, AMD Ryzen, AMD EPYC, AMD R-Series, and G-Series brands; FPGA products under the Virtex-6, Virtex-7, Virtex UltraScale+, Kintex-7, Kintex UltraScale, Kintex UltraScale+, Artix-7, Artix UltraScale+, Spartan-6, and Spartan-7 brands; adaptive SOCs under the Zynq-7000, Zynq UltraScale+ MPSoC, Zynq UltraScale+ RFSoCs, Versal HBM, Versal Premium, Versal Prime, Versal AI Core, Versal AI Edge, Vitis, and Vivado brands; and compute and network acceleration board products under the Alveo brand. It serves original equipment and design manufacturers, public cloud service providers, system integrators, independent distributors, and add-in-board manufacturers through its direct sales force, and sales representatives. Advanced Micro Devices, Inc. was incorporated in 1969 and is headquartered in Santa Clara, California.","Stock Sentiment":"Buy","Row Color":"negative-row","Last Updated":"30-01-2025 16:56:16"}]